[
  {
    "id": "arXiv:2310.12985",
    "title": "Enabling energy-Efficient object detection with surrogate gradient  descent in spiking neural networks",
    "abstract": "Spiking Neural Networks (SNNs) are a biologically plausible neural network model with significant advantages in both event-driven processing and spatio-temporal information processing, rendering SNNs an appealing choice for energyefficient object detection. However, the non-differentiability of the biological neuronal dynamics model presents a challenge during the training of SNNs. Furthermore, a suitable decoding strategy for object detection in SNNs is currently lacking. In this study, we introduce the Current Mean Decoding (CMD) method, which solves the regression problem to facilitate the training of deep SNNs for object detection tasks. Based on the gradient surrogate and CMD, we propose the SNN-YOLOv3 model for object detection. Our experiments demonstrate that SNN-YOLOv3 achieves a remarkable performance with an mAP of 61.87% on the PASCAL VOC dataset, requiring only 6 time steps. Compared to SpikingYOLO, we have managed to increase mAP by nearly 10% while reducing energy consumption by two orders of magnitude. ",
    "url": "https://arxiv.org/abs/2310.12985",
    "authors": [
      "Jilong Luo",
      "Shanlin Xiao",
      "Yinsheng Chen",
      "Zhiyi Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.12990",
    "title": "Wave-informed dictionary learning for high-resolution imaging in complex  media",
    "abstract": "We propose an approach for imaging in scattering media when large and diverse data sets are available. It has two steps. Using a dictionary learning algorithm the first step estimates the true Green's function vectors as columns in an unordered sensing matrix. The array data comes from many sparse sets of sources whose location and strength are not known to us. In the second step, the columns of the estimated sensing matrix are ordered for imaging using Multi-Dimensional Scaling with connectivity information derived from cross-correlations of its columns, as in time reversal. For these two steps to work together we need data from large arrays of receivers so the columns of the sensing matrix are incoherent for the first step, as well as from sub-arrays so that they are coherent enough to obtain the connectivity needed in the second step. Through simulation experiments, we show that the proposed approach is able to provide images in complex media whose resolution is that of a homogeneous medium. ",
    "url": "https://arxiv.org/abs/2310.12990",
    "authors": [
      "Miguel Moscoso",
      "Alexei Novikov",
      "George Papanicolaou",
      "Chrysoula Tsogka"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2310.13014",
    "title": "Large Language Model Prediction Capabilities: Evidence from a Real-World  Forecasting Tournament",
    "abstract": "Accurately predicting the future would be an important milestone in the capabilities of artificial intelligence. However, research on the ability of large language models to provide probabilistic predictions about future events remains nascent. To empirically test this ability, we enrolled OpenAI's state-of-the-art large language model, GPT-4, in a three-month forecasting tournament hosted on the Metaculus platform. The tournament, running from July to October 2023, attracted 843 participants and covered diverse topics including Big Tech, U.S. politics, viral outbreaks, and the Ukraine conflict. Focusing on binary forecasts, we show that GPT-4's probabilistic forecasts are significantly less accurate than the median human-crowd forecasts. We find that GPT-4's forecasts did not significantly differ from the no-information forecasting strategy of assigning a 50% probability to every question. We explore a potential explanation, that GPT-4 might be predisposed to predict probabilities close to the midpoint of the scale, but our data do not support this hypothesis. Overall, we find that GPT-4 significantly underperforms in real-world predictive tasks compared to median human-crowd forecasts. A potential explanation for this underperformance is that in real-world forecasting tournaments, the true answers are genuinely unknown at the time of prediction; unlike in other benchmark tasks like professional exams or time series forecasting, where strong performance may at least partly be due to the answers being memorized from the training data. This makes real-world forecasting tournaments an ideal environment for testing the generalized reasoning and prediction capabilities of artificial intelligence going forward. ",
    "url": "https://arxiv.org/abs/2310.13014",
    "authors": [
      "Philipp Schoenegger",
      "Peter S. Park"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13019",
    "title": "Tailoring Adversarial Attacks on Deep Neural Networks for Targeted Class  Manipulation Using DeepFool Algorithm",
    "abstract": "Deep neural networks (DNNs) have significantly advanced various domains, but their vulnerability to adversarial attacks poses serious concerns. Understanding these vulnerabilities and developing effective defense mechanisms is crucial. DeepFool, an algorithm proposed by Moosavi-Dezfooli et al. (2016), finds minimal perturbations to misclassify input images. However, DeepFool lacks a targeted approach, making it less effective in specific attack scenarios. Also, in previous related works, researchers primarily focus on success, not considering how much an image is getting distorted; the integrity of the image quality, and the confidence level to misclassifying. So, in this paper, we propose Targeted DeepFool, an augmented version of DeepFool that allows targeting specific classes for misclassification. We also introduce a minimum confidence score requirement hyperparameter to enhance flexibility. Our experiments demonstrate the effectiveness and efficiency of the proposed method across different deep neural network architectures while preserving image integrity as much as possible. Results show that one of the deep convolutional neural network architectures, AlexNet, and one of the state-of-the-art model Vision Transformer exhibit high robustness to getting fooled. Our code will be made public when publishing the paper. ",
    "url": "https://arxiv.org/abs/2310.13019",
    "authors": [
      "S. M. Fazle Rabby Labib",
      "Joyanta Jyoti Mondal",
      "Meem Arafat Manab"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13023",
    "title": "GraphGPT: Graph Instruction Tuning for Large Language Models",
    "abstract": "Graph Neural Networks (GNNs) have advanced graph structure understanding via recursive information exchange and aggregation among graph nodes. To improve model robustness, self-supervised learning (SSL) has emerged as a promising approach for data augmentation. However, existing methods for generating pre-trained graph embeddings often rely on fine-tuning with specific downstream task labels, which limits their usability in scenarios where labeled data is scarce or unavailable. To address this, our research focuses on advancing the generalization capabilities of graph models in challenging zero-shot learning scenarios. Inspired by the success of large language models (LLMs), we aim to develop a graph-oriented LLM that can achieve high generalization across diverse downstream datasets and tasks, even without any information available from the downstream graph data. In this work, we present the GraphGPT framework that aligns LLMs with graph structural knowledge with a graph instruction tuning paradigm. Our framework incorporates a text-graph grounding component to establish a connection between textual information and graph structures. Additionally, we propose a dual-stage instruction tuning paradigm, accompanied by a lightweight graph-text alignment projector. This paradigm explores self-supervised graph structural signals and task-specific graph instructions, to guide LLMs in understanding complex graph structures and improving their adaptability across different downstream tasks. Our framework is evaluated on supervised and zero-shot graph learning tasks, demonstrating superior generalization and outperforming state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2310.13023",
    "authors": [
      "Jiabin Tang",
      "Yuhao Yang",
      "Wei Wei",
      "Lei Shi",
      "Lixin Su",
      "Suqi Cheng",
      "Dawei Yin",
      "Chao Huang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13025",
    "title": "Powerset multi-class cross entropy loss for neural speaker diarization",
    "abstract": "Since its introduction in 2019, the whole end-to-end neural diarization (EEND) line of work has been addressing speaker diarization as a frame-wise multi-label classification problem with permutation-invariant training. Despite EEND showing great promise, a few recent works took a step back and studied the possible combination of (local) supervised EEND diarization with (global) unsupervised clustering. Yet, these hybrid contributions did not question the original multi-label formulation. We propose to switch from multi-label (where any two speakers can be active at the same time) to powerset multi-class classification (where dedicated classes are assigned to pairs of overlapping speakers). Through extensive experiments on 9 different benchmarks, we show that this formulation leads to significantly better performance (mostly on overlapping speech) and robustness to domain mismatch, while eliminating the detection threshold hyperparameter, critical for the multi-label formulation. ",
    "url": "https://arxiv.org/abs/2310.13025",
    "authors": [
      "Alexis Plaquet",
      "Hervé Bredin"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2310.13029",
    "title": "Blending gradient boosted trees and neural networks for point and  probabilistic forecasting of hierarchical time series",
    "abstract": "In this paper we tackle the problem of point and probabilistic forecasting by describing a blending methodology of machine learning models that belong to gradient boosted trees and neural networks families. These principles were successfully applied in the recent M5 Competition on both Accuracy and Uncertainty tracks. The keypoints of our methodology are: a) transform the task to regression on sales for a single day b) information rich feature engineering c) create a diverse set of state-of-the-art machine learning models and d) carefully construct validation sets for model tuning. We argue that the diversity of the machine learning models along with the careful selection of validation examples, where the most important ingredients for the effectiveness of our approach. Although forecasting data had an inherent hierarchy structure (12 levels), none of our proposed solutions exploited that hierarchical scheme. Using the proposed methodology, our team was ranked within the gold medal range in both Accuracy and the Uncertainty track. Inference code along with already trained models are available at https://github.com/IoannisNasios/M5_Uncertainty_3rd_place ",
    "url": "https://arxiv.org/abs/2310.13029",
    "authors": [
      "Ioannis Nasios",
      "Konstantinos Vogklis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Statistical Finance (q-fin.ST)"
    ]
  },
  {
    "id": "arXiv:2310.13037",
    "title": "Agri-GNN: A Novel Genotypic-Topological Graph Neural Network Framework  Built on GraphSAGE for Optimized Yield Prediction",
    "abstract": "Agriculture, as the cornerstone of human civilization, constantly seeks to integrate technology for enhanced productivity and sustainability. This paper introduces $\\textit{Agri-GNN}$, a novel Genotypic-Topological Graph Neural Network Framework tailored to capture the intricate spatial and genotypic interactions of crops, paving the way for optimized predictions of harvest yields. $\\textit{Agri-GNN}$ constructs a Graph $\\mathcal{G}$ that considers farming plots as nodes, and then methodically constructs edges between nodes based on spatial and genotypic similarity, allowing for the aggregation of node information through a genotypic-topological filter. Graph Neural Networks (GNN), by design, consider the relationships between data points, enabling them to efficiently model the interconnected agricultural ecosystem. By harnessing the power of GNNs, $\\textit{Agri-GNN}$ encapsulates both local and global information from plants, considering their inherent connections based on spatial proximity and shared genotypes, allowing stronger predictions to be made than traditional Machine Learning architectures. $\\textit{Agri-GNN}$ is built from the GraphSAGE architecture, because of its optimal calibration with large graphs, like those of farming plots and breeding experiments. $\\textit{Agri-GNN}$ experiments, conducted on a comprehensive dataset of vegetation indices, time, genotype information, and location data, demonstrate that $\\textit{Agri-GNN}$ achieves an $R^2 = .876$ in yield predictions for farming fields in Iowa. The results show significant improvement over the baselines and other work in the field. $\\textit{Agri-GNN}$ represents a blueprint for using advanced graph-based neural architectures to predict crop yield, providing significant improvements over baselines in the field. ",
    "url": "https://arxiv.org/abs/2310.13037",
    "authors": [
      "Aditya Gupta",
      "Asheesh Singh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13040",
    "title": "Robust multimodal models have outlier features and encode more concepts",
    "abstract": "What distinguishes robust models from non-robust ones? This question has gained traction with the appearance of large-scale multimodal models, such as CLIP. These models have demonstrated unprecedented robustness with respect to natural distribution shifts. While it has been shown that such differences in robustness can be traced back to differences in training data, so far it is not known what that translates to in terms of what the model has learned. In this work, we bridge this gap by probing the representation spaces of 12 robust multimodal models with various backbones (ResNets and ViTs) and pretraining sets (OpenAI, LAION-400M, LAION-2B, YFCC15M, CC12M and DataComp). We find two signatures of robustness in the representation spaces of these models: (1) Robust models exhibit outlier features characterized by their activations, with some being several orders of magnitude above average. These outlier features induce privileged directions in the model's representation space. We demonstrate that these privileged directions explain most of the predictive power of the model by pruning up to $80 \\%$ of the least important representation space directions without negative impacts on model accuracy and robustness; (2) Robust models encode substantially more concepts in their representation space. While this superposition of concepts allows robust models to store much information, it also results in highly polysemantic features, which makes their interpretation challenging. We discuss how these insights pave the way for future research in various fields, such as model pruning and mechanistic interpretability. ",
    "url": "https://arxiv.org/abs/2310.13040",
    "authors": [
      "Jonathan Crabbé",
      "Pau Rodríguez",
      "Vaishaal Shankar",
      "Luca Zappella",
      "Arno Blaas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.13068",
    "title": "GARI: Graph Attention for Relative Isomorphism of Arabic Word Embeddings",
    "abstract": "Bilingual Lexical Induction (BLI) is a core challenge in NLP, it relies on the relative isomorphism of individual embedding spaces. Existing attempts aimed at controlling the relative isomorphism of different embedding spaces fail to incorporate the impact of semantically related words in the model training objective. To address this, we propose GARI that combines the distributional training objectives with multiple isomorphism losses guided by the graph attention network. GARI considers the impact of semantical variations of words in order to define the relative isomorphism of the embedding spaces. Experimental evaluation using the Arabic language data set shows that GARI outperforms the existing research by improving the average P@1 by a relative score of up to 40.95% and 76.80% for in-domain and domain mismatch settings respectively. We release the codes for GARI at https://github.com/asif6827/GARI. ",
    "url": "https://arxiv.org/abs/2310.13068",
    "authors": [
      "Muhammad Asif Ali",
      "Maha Alshmrani",
      "Jianbin Qin",
      "Yan Hu",
      "Di Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.13073",
    "title": "Using Logic Programming and Kernel-Grouping for Improving  Interpretability of Convolutional Neural Networks",
    "abstract": "Within the realm of deep learning, the interpretability of Convolutional Neural Networks (CNNs), particularly in the context of image classification tasks, remains a formidable challenge. To this end we present a neurosymbolic framework, NeSyFOLD-G that generates a symbolic rule-set using the last layer kernels of the CNN to make its underlying knowledge interpretable. What makes NeSyFOLD-G different from other similar frameworks is that we first find groups of similar kernels in the CNN (kernel-grouping) using the cosine-similarity between the feature maps generated by various kernels. Once such kernel groups are found, we binarize each kernel group's output in the CNN and use it to generate a binarization table which serves as input data to FOLD-SE-M which is a Rule Based Machine Learning (RBML) algorithm. FOLD-SE-M then generates a rule-set that can be used to make predictions. We present a novel kernel grouping algorithm and show that grouping similar kernels leads to a significant reduction in the size of the rule-set generated by FOLD-SE-M, consequently, improving the interpretability. This rule-set symbolically encapsulates the connectionist knowledge of the trained CNN. The rule-set can be viewed as a normal logic program wherein each predicate's truth value depends on a kernel group in the CNN. Each predicate in the rule-set is mapped to a concept using a few semantic segmentation masks of the images used for training, to make it human-understandable. The last layers of the CNN can then be replaced by this rule-set to obtain the NeSy-G model which can then be used for the image classification task. The goal directed ASP system s(CASP) can be used to obtain the justification of any prediction made using the NeSy-G model. We also propose a novel algorithm for labeling each predicate in the rule-set with the semantic concept(s) that its corresponding kernel group represents. ",
    "url": "https://arxiv.org/abs/2310.13073",
    "authors": [
      "Parth Padalkar",
      "Gopal Gupta"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.13075",
    "title": "On the Computational Complexities of Complex-valued Neural Networks",
    "abstract": "Complex-valued neural networks (CVNNs) are nonlinear filters used in the digital signal processing of complex-domain data. Compared with real-valued neural networks~(RVNNs), CVNNs can directly handle complex-valued input and output signals due to their complex domain parameters and activation functions. With the trend toward low-power systems, computational complexity analysis has become essential for measuring an algorithm's power consumption. Therefore, this paper presents both the quantitative and asymptotic computational complexities of CVNNs. This is a crucial tool in deciding which algorithm to implement. The mathematical operations are described in terms of the number of real-valued multiplications, as these are the most demanding operations. To determine which CVNN can be implemented in a low-power system, quantitative computational complexities can be used to accurately estimate the number of floating-point operations. We have also investigated the computational complexities of CVNNs discussed in some studies presented in the literature. ",
    "url": "https://arxiv.org/abs/2310.13075",
    "authors": [
      "Kayol Soares Mayer",
      "Jonathan Aguiar Soares",
      "Ariadne Arrais Cruz",
      "Dalton Soares Arantes"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2310.13076",
    "title": "PatchCURE: Improving Certifiable Robustness, Model Utility, and  Computation Efficiency of Adversarial Patch Defenses",
    "abstract": "State-of-the-art defenses against adversarial patch attacks can now achieve strong certifiable robustness with a marginal drop in model utility. However, this impressive performance typically comes at the cost of 10-100x more inference-time computation compared to undefended models -- the research community has witnessed an intense three-way trade-off between certifiable robustness, model utility, and computation efficiency. In this paper, we propose a defense framework named PatchCURE to approach this trade-off problem. PatchCURE provides sufficient \"knobs\" for tuning defense performance and allows us to build a family of defenses: the most robust PatchCURE instance can match the performance of any existing state-of-the-art defense (without efficiency considerations); the most efficient PatchCURE instance has similar inference efficiency as undefended models. Notably, PatchCURE achieves state-of-the-art robustness and utility performance across all different efficiency levels, e.g., 16-23% absolute clean accuracy and certified robust accuracy advantages over prior defenses when requiring computation efficiency to be close to undefended models. The family of PatchCURE defenses enables us to flexibly choose appropriate defenses to satisfy given computation and/or utility constraints in practice. ",
    "url": "https://arxiv.org/abs/2310.13076",
    "authors": [
      "Chong Xiang",
      "Tong Wu",
      "Sihui Dai",
      "Jonathan Petit",
      "Suman Jana",
      "Prateek Mittal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.13077",
    "title": "NeuroSMPC: A Neural Network guided Sampling Based MPC for On-Road  Autonomous Driving",
    "abstract": "In this paper we show an effective means of integrating data driven frameworks to sampling based optimal control to vastly reduce the compute time for easy adoption and adaptation to real time applications such as on-road autonomous driving in the presence of dynamic actors. Presented with training examples, a spatio-temporal CNN learns to predict the optimal mean control over a finite horizon that precludes further resampling, an iterative process that makes sampling based optimal control formulations difficult to adopt in real time settings. Generating control samples around the network-predicted optimal mean retains the advantage of sample diversity while enabling real time rollout of trajectories that avoids multiple dynamic obstacles in an on-road navigation setting. Further the 3D CNN architecture implicitly learns the future trajectories of the dynamic agents in the scene resulting in successful collision free navigation despite no explicit future trajectory prediction. We show performance gain over multiple baselines in a number of on-road scenes through closed loop simulations in CARLA. We also showcase the real world applicability of our system by running it on our custom Autonomous Driving Platform (AutoDP). ",
    "url": "https://arxiv.org/abs/2310.13077",
    "authors": [
      "Kaustab Pal",
      "Aditya Sharma",
      "Mohd Omama",
      "Parth N. Shah",
      "K. Madhava Krishna"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.13079",
    "title": "Critical Path Prioritization Dashboard for Alert-driven Attack Graphs",
    "abstract": "Although intrusion alerts can provide threat intelligence regarding attacker strategies, extracting such intelligence via existing tools is expensive and time-consuming. Earlier work has proposed SAGE, which generates attack graphs from intrusion alerts using unsupervised sequential machine learning. This paper proposes a querying and prioritization-enabled visual analytics dashboard for SAGE. The dashboard has three main components: (i) a Graph Explorer that presents a global view of all attacker strategies, (ii) a Timeline Viewer that correlates attacker actions chronologically, and (iii) a Recommender Matrix that highlights prevalent critical alerts via a MITRE ATT&CK-inspired attack stage matrix. We describe the utility of the proposed dashboard using intrusion alerts collected from a distributed multi-stage team-based attack scenario. We evaluate the utility of the dashboard through a user study. Based on the responses of a small set of security practitioners, we find that the dashboard is useful in depicting attacker strategies and attack progression, but can be improved in terms of usability. ",
    "url": "https://arxiv.org/abs/2310.13079",
    "authors": [
      "Sònia Leal Díaz",
      "Sergio Pastrana",
      "Azqa Nadeem"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.13085",
    "title": "Unsupervised Representation Learning to Aid Semi-Supervised Meta  Learning",
    "abstract": "Few-shot learning or meta-learning leverages the data scarcity problem in machine learning. Traditionally, training data requires a multitude of samples and labeling for supervised learning. To address this issue, we propose a one-shot unsupervised meta-learning to learn the latent representation of the training samples. We use augmented samples as the query set during the training phase of the unsupervised meta-learning. A temperature-scaled cross-entropy loss is used in the inner loop of meta-learning to prevent overfitting during unsupervised learning. The learned parameters from this step are applied to the targeted supervised meta-learning in a transfer-learning fashion for initialization and fast adaptation with improved accuracy. The proposed method is model agnostic and can aid any meta-learning model to improve accuracy. We use model agnostic meta-learning (MAML) and relation network (RN) on Omniglot and mini-Imagenet datasets to demonstrate the performance of the proposed method. Furthermore, a meta-learning model with the proposed initialization can achieve satisfactory accuracy with significantly fewer training samples. ",
    "url": "https://arxiv.org/abs/2310.13085",
    "authors": [
      "Atik Faysal",
      "Mohammad Rostami",
      "Huaxia Wang",
      "Avimanyu Sahoo",
      "Ryan Antle"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13097",
    "title": "A Multi-Stage Temporal Convolutional Network for Volleyball Jumps  Classification Using a Waist-Mounted IMU",
    "abstract": "Monitoring the number of jumps for volleyball players during training or a match can be crucial to prevent injuries, yet the measurement requires considerable workload and cost using traditional methods such as video analysis. Also, existing methods do not provide accurate differentiation between different types of jumps. In this study, an unobtrusive system with a single inertial measurement unit (IMU) on the waist was proposed to recognize the types of volleyball jumps. A Multi-Layer Temporal Convolutional Network (MS-TCN) was applied for sample-wise classification. The model was evaluated on ten volleyball players and twenty-six volleyball players, during a lab session with a fixed protocol of jumping and landing tasks, and during four volleyball training sessions, respectively. The MS-TCN model achieved better performance than a state-of-the-art deep learning model but with lower computational cost. In the lab sessions, most jump counts showed small differences between the predicted jumps and video-annotated jumps, with an overall count showing a Limit of Agreement (LoA) of 0.1+-3.40 (r=0.884). For comparison, the proposed algorithm showed slightly worse results than VERT (a commercial jumping assessment device) with a LoA of 0.1+-2.08 (r=0.955) but the differences were still within a comparable range. In the training sessions, the recognition of three types of jumps exhibited a mean difference from observation of less than 10 jumps: block, smash, and overhead serve. These results showed the potential of using a single IMU to recognize the types of volleyball jumps. The sample-wise architecture provided high resolution of recognition and the MS-TCN required fewer parameters to train compared with state-of-the-art models. ",
    "url": "https://arxiv.org/abs/2310.13097",
    "authors": [
      "Meng Shang",
      "Camilla De Bleecker",
      "Jos Vanrenterghem",
      "Roel De Ridder",
      "Sabine Verschueren",
      "Carolina Varon",
      "Walter De Raedt",
      "Bart Vanrumste"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13099",
    "title": "No offence, Bert -- I insult only humans! Multiple addressees  sentence-level attack on toxicity detection neural network",
    "abstract": "We introduce a simple yet efficient sentence-level attack on black-box toxicity detector models. By adding several positive words or sentences to the end of a hateful message, we are able to change the prediction of a neural network and pass the toxicity detection system check. This approach is shown to be working on seven languages from three different language families. We also describe the defence mechanism against the aforementioned attack and discuss its limitations. ",
    "url": "https://arxiv.org/abs/2310.13099",
    "authors": [
      "Sergey Berezin",
      "Reza Farahbakhsh",
      "Noel Crespi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13103",
    "title": "AVTENet: Audio-Visual Transformer-based Ensemble Network Exploiting  Multiple Experts for Video Deepfake Detection",
    "abstract": "Forged content shared widely on social media platforms is a major social problem that requires increased regulation and poses new challenges to the research community. The recent proliferation of hyper-realistic deepfake videos has drawn attention to the threat of audio and visual forgeries. Most previous work on detecting AI-generated fake videos only utilizes visual modality or audio modality. While there are some methods in the literature that exploit audio and visual modalities to detect forged videos, they have not been comprehensively evaluated on multi-modal datasets of deepfake videos involving acoustic and visual manipulations. Moreover, these existing methods are mostly based on CNN and suffer from low detection accuracy. Inspired by the recent success of Transformer in various fields, to address the challenges posed by deepfake technology, in this paper, we propose an Audio-Visual Transformer-based Ensemble Network (AVTENet) framework that considers both acoustic manipulation and visual manipulation to achieve effective video forgery detection. Specifically, the proposed model integrates several purely transformer-based variants that capture video, audio, and audio-visual salient cues to reach a consensus in prediction. For evaluation, we use the recently released benchmark multi-modal audio-video FakeAVCeleb dataset. For a detailed analysis, we evaluate AVTENet, its variants, and several existing methods on multiple test sets of the FakeAVCeleb dataset. Experimental results show that our best model outperforms all existing methods and achieves state-of-the-art performance on Testset-I and Testset-II of the FakeAVCeleb dataset. ",
    "url": "https://arxiv.org/abs/2310.13103",
    "authors": [
      "Ammarah Hashmi",
      "Sahibzada Adil Shahzad",
      "Chia-Wen Lin",
      "Yu Tsao",
      "Hsin-Min Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2310.13104",
    "title": "Making Differential Privacy Easier to Use for Data Controllers and Data  Analysts using a Privacy Risk Indicator and an Escrow-Based Platform",
    "abstract": "Differential privacy (DP) enables private data analysis but is hard to use in practice. For data controllers who decide what output to release, choosing the amount of noise to add to the output is a non-trivial task because of the difficulty of interpreting the privacy parameter $\\epsilon$. For data analysts who submit queries, it is hard to understand the impact of the noise introduced by DP on their tasks. To address these two challenges: 1) we define a privacy risk indicator that indicates the impact of choosing $\\epsilon$ on individuals' privacy and use that to design an algorithm that chooses $\\epsilon$ automatically; 2) we introduce a utility signaling protocol that helps analysts interpret the impact of DP on their downstream tasks. We implement the algorithm and the protocol inside a new platform built on top of a data escrow, which allows the controller to control the data flow and achieve trustworthiness while maintaining high performance. We demonstrate our contributions through an IRB-approved user study, extensive experimental evaluations, and comparison with other DP platforms. All in all, our work contributes to making DP easier to use by lowering adoption barriers. ",
    "url": "https://arxiv.org/abs/2310.13104",
    "authors": [
      "Zhiru Zhu",
      "Raul Castro Fernandez"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2310.13110",
    "title": "Semi-Supervised Learning of Dynamical Systems with Neural Ordinary  Differential Equations: A Teacher-Student Model Approach",
    "abstract": "Modeling dynamical systems is crucial for a wide range of tasks, but it remains challenging due to complex nonlinear dynamics, limited observations, or lack of prior knowledge. Recently, data-driven approaches such as Neural Ordinary Differential Equations (NODE) have shown promising results by leveraging the expressive power of neural networks to model unknown dynamics. However, these approaches often suffer from limited labeled training data, leading to poor generalization and suboptimal predictions. On the other hand, semi-supervised algorithms can utilize abundant unlabeled data and have demonstrated good performance in classification and regression tasks. We propose TS-NODE, the first semi-supervised approach to modeling dynamical systems with NODE. TS-NODE explores cheaply generated synthetic pseudo rollouts to broaden exploration in the state space and to tackle the challenges brought by lack of ground-truth system data under a teacher-student model. TS-NODE employs an unified optimization framework that corrects the teacher model based on the student's feedback while mitigating the potential false system dynamics present in pseudo rollouts. TS-NODE demonstrates significant performance improvements over a baseline Neural ODE model on multiple dynamical system modeling tasks. ",
    "url": "https://arxiv.org/abs/2310.13110",
    "authors": [
      "Yu Wang",
      "Yuxuan Yin",
      "Karthik Somayaji Nanjangud Suryanarayana",
      "Jan Drgona",
      "Malachi Schram",
      "Mahantesh Halappanavar",
      "Frank Liu",
      "Peng Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13123",
    "title": "Fuel Consumption Prediction for a Passenger Ferry using Machine Learning  and In-service Data: A Comparative Study",
    "abstract": "As the importance of eco-friendly transportation increases, providing an efficient approach for marine vessel operation is essential. Methods for status monitoring with consideration to the weather condition and forecasting with the use of in-service data from ships requires accurate and complete models for predicting the energy efficiency of a ship. The models need to effectively process all the operational data in real-time. This paper presents models that can predict fuel consumption using in-service data collected from a passenger ship. Statistical and domain-knowledge methods were used to select the proper input variables for the models. These methods prevent over-fitting, missing data, and multicollinearity while providing practical applicability. Prediction models that were investigated include multiple linear regression (MLR), decision tree approach (DT), an artificial neural network (ANN), and ensemble methods. The best predictive performance was from a model developed using the XGboost technique which is a boosting ensemble approach. \\rvv{Our code is available on GitHub at \\url{https://github.com/pagand/model_optimze_vessel/tree/OE} for future research. ",
    "url": "https://arxiv.org/abs/2310.13123",
    "authors": [
      "Pedram Agand",
      "Allison Kennedy",
      "Trevor Harris",
      "Chanwoo Bae",
      "Mo Chen",
      "Edward J Park"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.13124",
    "title": "Efficient online cross-covariance monitoring with incremental SVD: An  approach for the detection of emerging dependency patterns in IoT systems",
    "abstract": "The development of the manufacturing systems has made it increasingly necessary to monitor the data generated by multiple interconnected subsystems with rapid incoming of samples. Based on incremental Singular Value Decomposition (ISVD), we develop a general online monitoring approach for the relationship of data generated from two interconnected subsystems, where each subsystem produces big data streams with several variation patterns in normal working condition. When special situation happens and new associations occur, a very small amount of computation is sufficient to update the system status and compute the control statistics by using this approach. The proposed method reduces computational overhead and retains only a small number of pairs of possible dependent patterns at each step. The validation of the method through simulation studies and a case study on semiconductor manufacturing processes further supports its effectiveness. ",
    "url": "https://arxiv.org/abs/2310.13124",
    "authors": [
      "Xinmiao Luan",
      "Qing Zou",
      "Jian Li",
      "Andi Wang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.13137",
    "title": "Mean Estimation Under Heterogeneous Privacy Demands",
    "abstract": "Differential Privacy (DP) is a well-established framework to quantify privacy loss incurred by any algorithm. Traditional formulations impose a uniform privacy requirement for all users, which is often inconsistent with real-world scenarios in which users dictate their privacy preferences individually. This work considers the problem of mean estimation, where each user can impose their own distinct privacy level. The algorithm we propose is shown to be minimax optimal and has a near-linear run-time. Our results elicit an interesting saturation phenomenon that occurs. Namely, the privacy requirements of the most stringent users dictate the overall error rates. As a consequence, users with less but differing privacy requirements are all given more privacy than they require, in equal amounts. In other words, these privacy-indifferent users are given a nontrivial degree of privacy for free, without any sacrifice in the performance of the estimator. ",
    "url": "https://arxiv.org/abs/2310.13137",
    "authors": [
      "Syomantak Chaudhuri",
      "Konstantin Miagkov",
      "Thomas A. Courtade"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.13139",
    "title": "Graph Neural Networks with polynomial activations have limited  expressivity",
    "abstract": "The expressivity of Graph Neural Networks (GNNs) can be entirely characterized by appropriate fragments of the first order logic. Namely, any query of the two variable fragment of graded modal logic (GC2) interpreted over labelled graphs can be expressed using a GNN whose size depends only on the depth of the query. As pointed out by [Barcelo & Al., 2020, Grohe, 2021 ], this description holds for a family of activation functions, leaving the possibibility for a hierarchy of logics expressible by GNNs depending on the chosen activation function. In this article, we show that such hierarchy indeed exists by proving that GC2 queries cannot be expressed by GNNs with polynomial activation functions. This implies a separation between polynomial and popular non polynomial activations (such as ReLUs, sigmoid and hyperbolic tan and others) and answers an open question formulated by [Grohe, 2021]. ",
    "url": "https://arxiv.org/abs/2310.13139",
    "authors": [
      "Sammy Khalife"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13140",
    "title": "Privacy Preserving Decision Tree Training and Prediction via Fully  Homomorphic Encryption with No Decryption",
    "abstract": "With data-outsourcing becoming commonplace, there grows a need for secure outsourcing of data and machine learning models. Namely, data and model owners (client) often have a need for their information to remain private and secure against the potentially untrusted computing resource (server) to whom they want to outsource said data and models to. Various approaches to privacy-preserving machine learning (PPML) have been devised with different techniques and solutions introduced in the past. These solutions often involved one of two compromises: (1) client-server interactions to allow intermediary rounds of decryption and re-encryption of data or (2) complex architectures for multi-party computation. This paper devises a paradigm using Fully Homomorphic Encryption (FHE) that minimizes architectural complexity and removes client-side involvement during the training and prediction lifecycle of machine learning models. In addition, the paradigm proposed in this work achieves both model security as well as data security. To remove client-side involvement, the devised paradigm proposes a no decryption approach that allows the server to handle PPML in its entirety without rounds of decryption and re-encryption. To the best of our knowledge, this paradigm is the first to achieve privacy-preserving decision tree training with no decryption while maintaining a simple client-server architecture. ",
    "url": "https://arxiv.org/abs/2310.13140",
    "authors": [
      "Hunjae Lee",
      "Corey Clark"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.13161",
    "title": "A Distributed Approach to Meteorological Predictions: Addressing Data  Imbalance in Precipitation Prediction Models through Federated Learning and  GANs",
    "abstract": "The classification of weather data involves categorizing meteorological phenomena into classes, thereby facilitating nuanced analyses and precise predictions for various sectors such as agriculture, aviation, and disaster management. This involves utilizing machine learning models to analyze large, multidimensional weather datasets for patterns and trends. These datasets may include variables such as temperature, humidity, wind speed, and pressure, contributing to meteorological conditions. Furthermore, it's imperative that classification algorithms proficiently navigate challenges such as data imbalances, where certain weather events (e.g., storms or extreme temperatures) might be underrepresented. This empirical study explores data augmentation methods to address imbalanced classes in tabular weather data in centralized and federated settings. Employing data augmentation techniques such as the Synthetic Minority Over-sampling Technique or Generative Adversarial Networks can improve the model's accuracy in classifying rare but critical weather events. Moreover, with advancements in federated learning, machine learning models can be trained across decentralized databases, ensuring privacy and data integrity while mitigating the need for centralized data storage and processing. Thus, the classification of weather data stands as a critical bridge, linking raw meteorological data to actionable insights, enhancing our capacity to anticipate and prepare for diverse weather conditions. ",
    "url": "https://arxiv.org/abs/2310.13161",
    "authors": [
      "Elaheh Jafarigol",
      "Theodore Trafalis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13167",
    "title": "Visualizing Causality in Mixed Reality for Manual Task Learning: An  Exploratory Study",
    "abstract": "Mixed Reality (MR) is gaining prominence in manual task skill learning due to its in-situ, embodied, and immersive experience. To teach manual tasks, current methodologies break the task into hierarchies (tasks into subtasks) and visualize the current subtask and future in terms of causality. Existing psychology literature also shows that humans learn tasks by breaking them into hierarchies. In order to understand the design space of information visualized to the learner for better task understanding, we conducted a user study with 48 users. The study was conducted using a complex assembly task, which involves learning of both actions and tool usage. We aim to explore the effect of visualization of causality in the hierarchy for manual task learning in MR by four options: no causality, event level causality, interaction level causality, and gesture level causality. The results show that the user understands and performs best when all the level of causality is shown to the user. Based on the results, we further provide design recommendations and in-depth discussions for future manual task learning systems. ",
    "url": "https://arxiv.org/abs/2310.13167",
    "authors": [
      "Rahul Jain",
      "Jingyu Shi",
      "Andrew Benton",
      "Moiz Rasheed",
      "Subramanian Chidambaram",
      "Karthik Ramani"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2310.13189",
    "title": "Fast and Accurate Factual Inconsistency Detection Over Long Documents",
    "abstract": "Generative AI models exhibit remarkable potential; however, hallucinations across various tasks present a significant challenge, particularly for longer inputs that current approaches struggle to address effectively. We introduce SCALE (Source Chunking Approach for Large-scale inconsistency Evaluation), a task-agnostic model for detecting factual inconsistencies using a novel chunking strategy. Specifically, SCALE is a Natural Language Inference (NLI) based model that uses large text chunks to condition over long texts. This approach achieves state-of-the-art performance in factual inconsistency detection for diverse tasks and long inputs. Additionally, we leverage the chunking mechanism and employ a novel algorithm to explain SCALE's decisions through relevant source sentence retrieval. Our evaluations reveal that SCALE outperforms existing methods on both standard benchmarks and a new long-form dialogue dataset ScreenEval we constructed. Moreover, SCALE surpasses competitive systems in efficiency and model explanation evaluations. ",
    "url": "https://arxiv.org/abs/2310.13189",
    "authors": [
      "Barrett Martin Lattimer",
      "Patrick Chen",
      "Xinyuan Zhang",
      "Yi Yang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13191",
    "title": "Towards Robust Pruning: An Adaptive Knowledge-Retention Pruning Strategy  for Language Models",
    "abstract": "The pruning objective has recently extended beyond accuracy and sparsity to robustness in language models. Despite this, existing methods struggle to enhance robustness against adversarial attacks when continually increasing model sparsity and require a retraining process. As humans step into the era of large language models, these issues become increasingly prominent. This paper proposes that the robustness of language models is proportional to the extent of pre-trained knowledge they encompass. Accordingly, we introduce a post-training pruning strategy designed to faithfully replicate the embedding space and feature space of dense language models, aiming to conserve more pre-trained knowledge during the pruning process. In this setup, each layer's reconstruction error not only originates from itself but also includes cumulative error from preceding layers, followed by an adaptive rectification. Compared to other state-of-art baselines, our approach demonstrates a superior balance between accuracy, sparsity, robustness, and pruning cost with BERT on datasets SST2, IMDB, and AGNews, marking a significant stride towards robust pruning in language models. ",
    "url": "https://arxiv.org/abs/2310.13191",
    "authors": [
      "Jianwei Li",
      "Qi Lei",
      "Wei Cheng",
      "Dongkuan Xu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13193",
    "title": "Heterogeneous Graph Neural Networks for Data-driven Traffic Assignment",
    "abstract": "The traffic assignment problem is one of the significant components of traffic flow analysis for which various solution approaches have been proposed. However, deploying these approaches for large-scale networks poses significant challenges. In this paper, we leverage the power of heterogeneous graph neural networks to propose a novel data-driven approach for traffic assignment and traffic flow learning. The proposed model is capable of capturing spatial traffic patterns across different links, yielding highly accurate results. We present numerical experiments on urban transportation networks and show that the proposed heterogeneous graph neural network model outperforms other conventional neural network models in terms of convergence rate, training loss, and prediction accuracy. Notably, the proposed heterogeneous graph neural network model can also be generalized to different network topologies. This approach offers a promising solution for complex traffic flow analysis and prediction, enhancing our understanding and management of a wide range of transportation systems. ",
    "url": "https://arxiv.org/abs/2310.13193",
    "authors": [
      "Tong Liu",
      "Hadi Meidani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13212",
    "title": "Facile: Fast, Accurate, and Interpretable Basic-Block Throughput  Prediction",
    "abstract": "Basic-block throughput models such as uiCA, IACA, GRANITE, Ithemal, llvm-mca, OSACA, or CQA guide optimizing compilers and help performance engineers identify and eliminate bottlenecks. For this purpose, basic-block throughput models should ideally be fast, accurate, and interpretable. Recent advances have significantly improved accuracy: uiCA, the state-of-the-art model, achieves an error of about 1% relative to measurements across a wide range of microarchitectures. The computational efficiency of throughput models, which is equally important for widespread adoption, especially in compilers, has so far received little attention. In this paper, we introduce Facile, an analytical throughput model that is fast, accurate, and interpretable. Facile analyzes different potential bottlenecks independently and analytically. Due to its compositional nature, Facile's predictions directly pinpoint the bottlenecks. We evaluate Facile on a wide range of microarchitectures and show that it is almost two orders of magnitude faster than existing models while achieving state-of-the-art accuracy. ",
    "url": "https://arxiv.org/abs/2310.13212",
    "authors": [
      "Andreas Abel",
      "Shrey Sharma",
      "Jan Reineke"
    ],
    "subjectives": [
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2310.13215",
    "title": "Zone Evaluation: Revealing Spatial Bias in Object Detection",
    "abstract": "A fundamental limitation of object detectors is that they suffer from \"spatial bias\", and in particular perform less satisfactorily when detecting objects near image borders. For a long time, there has been a lack of effective ways to measure and identify spatial bias, and little is known about where it comes from and what degree it is. To this end, we present a new zone evaluation protocol, extending from the traditional evaluation to a more generalized one, which measures the detection performance over zones, yielding a series of Zone Precisions (ZPs). For the first time, we provide numerical results, showing that the object detectors perform quite unevenly across the zones. Surprisingly, the detector's performance in the 96\\% border zone of the image does not reach the AP value (Average Precision, commonly regarded as the average detection performance in the entire image zone). To better understand spatial bias, a series of heuristic experiments are conducted. Our investigation excludes two intuitive conjectures about spatial bias that the object scale and the absolute positions of objects barely influence the spatial bias. We find that the key lies in the human-imperceptible divergence in data patterns between objects in different zones, thus eventually forming a visible performance gap between the zones. With these findings, we finally discuss a future direction for object detection, namely, spatial disequilibrium problem, aiming at pursuing a balanced detection ability over the entire image zone. By broadly evaluating 10 popular object detectors and 5 detection datasets, we shed light on the spatial bias of object detectors. We hope this work could raise a focus on detection robustness. The source codes, evaluation protocols, and tutorials are publicly available at \\url{https://github.com/Zzh-tju/ZoneEval}. ",
    "url": "https://arxiv.org/abs/2310.13215",
    "authors": [
      "Zhaohui Zheng",
      "Yuming Chen",
      "Qibin Hou",
      "Xiang Li",
      "Ping Wang",
      "Ming-Ming Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.13219",
    "title": "HierCas: Hierarchical Temporal Graph Attention Networks for Popularity  Prediction in Information Cascades",
    "abstract": "Information cascade popularity prediction is critical for many applications, including but not limited to identifying fake news and accurate recommendations. Traditional feature-based methods heavily rely on handcrafted features, which are domain-specific and lack generalizability to new domains. To address this problem, researchers have turned to neural network-based approaches. However, existing methods follow a sampling-based modeling approach, potentially losing continuous dynamic information and structural-temporal dependencies that emerge during the information diffusion process. In this paper, we propose a novel framework called Hierarchical Temporal Graph Attention Networks for cascade popularity prediction (HierCas). Unlike existing methods, HierCas operates on the entire cascade graph by a dynamic graph modeling approach, enabling it to capture the full range of continuous dynamic information and explicitly model the interplay between structural and temporal factors. By leveraging time-aware node embedding, graph attention mechanisms and hierarchical pooling structures, HierCas effectively captures the popularity trend implicit in the complex cascade. Extensive experiments conducted on two real-world datasets in different scenarios demonstrate that our HierCas significantly outperforms the state-of-the-art approaches. ",
    "url": "https://arxiv.org/abs/2310.13219",
    "authors": [
      "Zhizhen Zhang",
      "Xiaohui Xie",
      "Yishuo Zhang",
      "Lanshan Zhang",
      "Yong Jiang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13225",
    "title": "Scalable Neural Network Kernels",
    "abstract": "We introduce the concept of scalable neural network kernels (SNNKs), the replacements of regular feedforward layers (FFLs), capable of approximating the latter, but with favorable computational properties. SNNKs effectively disentangle the inputs from the parameters of the neural network in the FFL, only to connect them in the final computation via the dot-product kernel. They are also strictly more expressive, as allowing to model complicated relationships beyond the functions of the dot-products of parameter-input vectors. We also introduce the neural network bundling process that applies SNNKs to compactify deep neural network architectures, resulting in additional compression gains. In its extreme version, it leads to the fully bundled network whose optimal parameters can be expressed via explicit formulae for several loss functions (e.g. mean squared error), opening a possibility to bypass backpropagation. As a by-product of our analysis, we introduce the mechanism of the universal random features (or URFs), applied to instantiate several SNNK variants, and interesting on its own in the context of scalable kernel methods. We provide rigorous theoretical analysis of all these concepts as well as an extensive empirical evaluation, ranging from point-wise kernel estimation to Transformers' fine-tuning with novel adapter layers inspired by SNNKs. Our mechanism provides up to 5x reduction in the number of trainable parameters, while maintaining competitive accuracy. ",
    "url": "https://arxiv.org/abs/2310.13225",
    "authors": [
      "Arijit Sehanobish",
      "Krzysztof Choromanski",
      "Yunfan Zhao",
      "Avinava Dubey",
      "Valerii Likhosherstov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13228",
    "title": "The Less the Merrier? Investigating Language Representation in  Multilingual Models",
    "abstract": "Multilingual Language Models offer a way to incorporate multiple languages in one model and utilize cross-language transfer learning to improve performance for different Natural Language Processing (NLP) tasks. Despite progress in multilingual models, not all languages are supported as well, particularly in low-resource settings. In this work, we investigate the linguistic representation of different languages in multilingual models. We start by asking the question which languages are supported in popular multilingual models and which languages are left behind. Then, for included languages, we look at models' learned representations based on language family and dialect and try to understand how models' learned representations for~(1) seen and~(2) unseen languages vary across different language groups. In addition, we test and analyze performance on downstream tasks such as text generation and Named Entity Recognition. We observe from our experiments that community-centered models -- models that focus on languages of a given family or geographical location and are built by communities who speak them -- perform better at distinguishing between languages in the same family for low-resource languages. Our paper contributes to the literature in understanding multilingual models and their shortcomings and offers insights on potential ways to improve them. ",
    "url": "https://arxiv.org/abs/2310.13228",
    "authors": [
      "Hellina Hailu Nigatu",
      "Atnafu Lambebo Tonja",
      "Jugal Kalita"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.13240",
    "title": "Transparency challenges in policy evaluation with causal machine  learning -- improving usability and accountability",
    "abstract": "Causal machine learning tools are beginning to see use in real-world policy evaluation tasks to flexibly estimate treatment effects. One issue with these methods is that the machine learning models used are generally black boxes, i.e., there is no globally interpretable way to understand how a model makes estimates. This is a clear problem in policy evaluation applications, particularly in government, because it is difficult to understand whether such models are functioning in ways that are fair, based on the correct interpretation of evidence and transparent enough to allow for accountability if things go wrong. However, there has been little discussion of transparency problems in the causal machine learning literature and how these might be overcome. This paper explores why transparency issues are a problem for causal machine learning in public policy evaluation applications and considers ways these problems might be addressed through explainable AI tools and by simplifying models in line with interpretable AI principles. It then applies these ideas to a case-study using a causal forest model to estimate conditional average treatment effects for a hypothetical change in the school leaving age in Australia. It shows that existing tools for understanding black-box predictive models are poorly suited to causal machine learning and that simplifying the model to make it interpretable leads to an unacceptable increase in error (in this application). It concludes that new tools are needed to properly understand causal machine learning models and the algorithms that fit them. ",
    "url": "https://arxiv.org/abs/2310.13240",
    "authors": [
      "Patrick Rehill",
      "Nicholas Biddle"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Econometrics (econ.EM)"
    ]
  },
  {
    "id": "arXiv:2310.13247",
    "title": "Anomaly Detection of Command Shell Sessions based on DistilBERT:  Unsupervised and Supervised Approaches",
    "abstract": "Anomaly detection in command shell sessions is a critical aspect of computer security. Recent advances in deep learning and natural language processing, particularly transformer-based models, have shown great promise for addressing complex security challenges. In this paper, we implement a comprehensive approach to detect anomalies in Unix shell sessions using a pretrained DistilBERT model, leveraging both unsupervised and supervised learning techniques to identify anomalous activity while minimizing data labeling. The unsupervised method captures the underlying structure and syntax of Unix shell commands, enabling the detection of session deviations from normal behavior. Experiments on a large-scale enterprise dataset collected from production systems demonstrate the effectiveness of our approach in detecting anomalous behavior in Unix shell sessions. This work highlights the potential of leveraging recent advances in transformers to address important computer security challenges. ",
    "url": "https://arxiv.org/abs/2310.13247",
    "authors": [
      "Zefang Liu",
      "John Buford"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.13248",
    "title": "FLEE-GNN: A Federated Learning System for Edge-Enhanced Graph Neural  Network in Analyzing Geospatial Resilience of Multicommodity Food Flows",
    "abstract": "Understanding and measuring the resilience of food supply networks is a global imperative to tackle increasing food insecurity. However, the complexity of these networks, with their multidimensional interactions and decisions, presents significant challenges. This paper proposes FLEE-GNN, a novel Federated Learning System for Edge-Enhanced Graph Neural Network, designed to overcome these challenges and enhance the analysis of geospatial resilience of multicommodity food flow network, which is one type of spatial networks. FLEE-GNN addresses the limitations of current methodologies, such as entropy-based methods, in terms of generalizability, scalability, and data privacy. It combines the robustness and adaptability of graph neural networks with the privacy-conscious and decentralized aspects of federated learning on food supply network resilience analysis across geographical regions. This paper also discusses FLEE-GNN's innovative data generation techniques, experimental designs, and future directions for improvement. The results show the advancements of this approach to quantifying the resilience of multicommodity food flow networks, contributing to efforts towards ensuring global food security using AI methods. The developed FLEE-GNN has the potential to be applied in other spatial networks with spatially heterogeneous sub-network distributions. ",
    "url": "https://arxiv.org/abs/2310.13248",
    "authors": [
      "Yuxiao Qu",
      "Jinmeng Rao",
      "Song Gao",
      "Qianheng Zhang",
      "Wei-Lun Chao",
      "Yu Su",
      "Michelle Miller",
      "Alfonso Morales",
      "Patrick Huber"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2310.13249",
    "title": "TempGNN: Temporal Graph Neural Networks for Dynamic Session-Based  Recommendations",
    "abstract": "Session-based recommendations which predict the next action by understanding a user's interaction behavior with items within a relatively short ongoing session have recently gained increasing popularity. Previous research has focused on capturing the dynamics of sequential dependencies from complicated item transitions in a session by means of recurrent neural networks, self-attention models, and recently, mostly graph neural networks. Despite the plethora of different models relying on the order of items in a session, few approaches have been proposed for dealing better with the temporal implications between interactions. We present Temporal Graph Neural Networks (TempGNN), a generic framework for capturing the structural and temporal dynamics in complex item transitions utilizing temporal embedding operators on nodes and edges on dynamic session graphs, represented as sequences of timed events. Extensive experimental results show the effectiveness and adaptability of the proposed method by plugging it into existing state-of-the-art models. Finally, TempGNN achieved state-of-the-art performance on two real-world e-commerce datasets. ",
    "url": "https://arxiv.org/abs/2310.13249",
    "authors": [
      "Eunkyu Oh",
      "Taehun Kim"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13253",
    "title": "Knowledge Graph Context-Enhanced Diversified Recommendation",
    "abstract": "The field of Recommender Systems (RecSys) has been extensively studied to enhance accuracy by leveraging users' historical interactions. Nonetheless, this persistent pursuit of accuracy frequently engenders diminished diversity, culminating in the well-recognized \"echo chamber\" phenomenon. Diversified RecSys has emerged as a countermeasure, placing diversity on par with accuracy and garnering noteworthy attention from academic circles and industry practitioners. This research explores the realm of diversified RecSys within the intricate context of knowledge graphs (KG). These KGs act as repositories of interconnected information concerning entities and items, offering a propitious avenue to amplify recommendation diversity through the incorporation of insightful contextual information. Our contributions include introducing an innovative metric, Entity Coverage, and Relation Coverage, which effectively quantifies diversity within the KG domain. Additionally, we introduce the Diversified Embedding Learning (DEL) module, meticulously designed to formulate user representations that possess an innate awareness of diversity. In tandem with this, we introduce a novel technique named Conditional Alignment and Uniformity (CAU). It adeptly encodes KG item embeddings while preserving contextual integrity. Collectively, our contributions signify a substantial stride towards augmenting the panorama of recommendation diversity within the realm of KG-informed RecSys paradigms. ",
    "url": "https://arxiv.org/abs/2310.13253",
    "authors": [
      "Xiaolong Liu",
      "Liangwei Yang",
      "Zhiwei Liu",
      "Mingdai Yang",
      "Chen Wang",
      "Hao Peng",
      "Philip S. Yu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13273",
    "title": "Dynamic Object Detection in Range data using Spatiotemporal Normals",
    "abstract": "On the journey to enable robots to interact with the real world where humans, animals, and unpredictable elements are acting as independent agents; it is crucial for robots to have the capability to detect dynamic objects. In this paper, we argue that the detection of dynamic objects can be solved by computing the spatiotemporal normals of a point cloud. In our experiments, we demonstrate that this simple method can be used robustly for LiDAR and depth cameras with performances similar to the state of the art while offering a significantly simpler method. ",
    "url": "https://arxiv.org/abs/2310.13273",
    "authors": [
      "Raphael Falque",
      "Cedric Le Gentil",
      "Fouad Sukkar"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.13276",
    "title": "InvGC: Robust Cross-Modal Retrieval by Inverse Graph Convolution",
    "abstract": "Over recent decades, significant advancements in cross-modal retrieval are mainly driven by breakthroughs in visual and linguistic modeling. However, a recent study shows that multi-modal data representations tend to cluster within a limited convex cone (as representation degeneration problem), which hinders retrieval performance due to the inseparability of these representations. In our study, we first empirically validate the presence of the representation degeneration problem across multiple cross-modal benchmarks and methods. Next, to address it, we introduce a novel method, called InvGC, a post-processing technique inspired by graph convolution and average pooling. Specifically, InvGC defines the graph topology within the datasets and then applies graph convolution in a subtractive manner. This method effectively separates representations by increasing the distances between data points. To improve the efficiency and effectiveness of InvGC, we propose an advanced graph topology, LocalAdj, which only aims to increase the distances between each data point and its nearest neighbors. To understand why InvGC works, we present a detailed theoretical analysis, proving that the lower bound of recall will be improved after deploying InvGC. Extensive empirical results show that InvGC and InvGC w/LocalAdj significantly mitigate the representation degeneration problem, thereby enhancing retrieval performance. Our code is available at https://github.com/yimuwangcs/Better_Cross_Modal_Retrieval ",
    "url": "https://arxiv.org/abs/2310.13276",
    "authors": [
      "Xiangru Jian",
      "Yimu Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2310.13291",
    "title": "Assessing Privacy Risks in Language Models: A Case Study on  Summarization Tasks",
    "abstract": "Large language models have revolutionized the field of NLP by achieving state-of-the-art performance on various tasks. However, there is a concern that these models may disclose information in the training data. In this study, we focus on the summarization task and investigate the membership inference (MI) attack: given a sample and black-box access to a model's API, it is possible to determine if the sample was part of the training data. We exploit text similarity and the model's resistance to document modifications as potential MI signals and evaluate their effectiveness on widely used datasets. Our results demonstrate that summarization models are at risk of exposing data membership, even in cases where the reference summary is not available. Furthermore, we discuss several safeguards for training summarization models to protect against MI attacks and discuss the inherent trade-off between privacy and utility. ",
    "url": "https://arxiv.org/abs/2310.13291",
    "authors": [
      "Ruixiang Tang",
      "Gord Lueck",
      "Rodolfo Quispe",
      "Huseyin A Inan",
      "Janardhan Kulkarni",
      "Xia Hu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13297",
    "title": "Decoding the Silent Majority: Inducing Belief Augmented Social Graph  with Large Language Model for Response Forecasting",
    "abstract": "Automatic response forecasting for news media plays a crucial role in enabling content producers to efficiently predict the impact of news releases and prevent unexpected negative outcomes such as social conflict and moral injury. To effectively forecast responses, it is essential to develop measures that leverage the social dynamics and contextual information surrounding individuals, especially in cases where explicit profiles or historical actions of the users are limited (referred to as lurkers). As shown in a previous study, 97% of all tweets are produced by only the most active 25% of users. However, existing approaches have limited exploration of how to best process and utilize these important features. To address this gap, we propose a novel framework, named SocialSense, that leverages a large language model to induce a belief-centered graph on top of an existent social network, along with graph-based propagation to capture social dynamics. We hypothesize that the induced graph that bridges the gap between distant users who share similar beliefs allows the model to effectively capture the response patterns. Our method surpasses existing state-of-the-art in experimental evaluations for both zero-shot and supervised settings, demonstrating its effectiveness in response forecasting. Moreover, the analysis reveals the framework's capability to effectively handle unseen user and lurker scenarios, further highlighting its robustness and practical applicability. ",
    "url": "https://arxiv.org/abs/2310.13297",
    "authors": [
      "Chenkai Sun",
      "Jinning Li",
      "Yi R. Fung",
      "Hou Pong Chan",
      "Tarek Abdelzaher",
      "ChengXiang Zhai",
      "Heng Ji"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13298",
    "title": "Cache-Aided Communications in MISO Networks with Dynamic User Behavior",
    "abstract": "Coded caching (CC) can substantially enhance network performance by leveraging memory as an additional communication resource. However, the use of CC is challenging in various practical applications due to dynamic user behavior. The existing solutions, based on shared caching, cannot directly handle all scenarios where users freely enter and depart the network at any time as they are constrained by specific conditions on network parameters. This paper proposes a universally applicable shared-caching scheme for dynamic setups without any restriction on network parameters. The closed-form expressions for the achievable degrees of freedom (DoF) are computed for the resulting generalized scheme, and are shown to achieve the existing optimal bounds of the shared-cache model. Furthermore, a successive-interference-cancellation-free extension based on a fast iterative optimized beamformer design is devised to optimize the use of excess spatial dimensions freed by cache-aided interference cancellation. Extensive numerical experiments are carried out to assess the performance of the proposed scheme. In particular, the results demonstrate that while a dynamic setup may achieve a DoF substantially lower than the optimal DoF of shared caching, our proposed scheme significantly improves the performance at the finite signal-to-noise ratio compared to unicasting, which only benefits from the local caching gain. ",
    "url": "https://arxiv.org/abs/2310.13298",
    "authors": [
      "Milad Abolpour",
      "MohammadJavad Salehi",
      "Antti Tölli"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2310.13304",
    "title": "Investigating Emotions, Social Roles, Well-being and Mobile Usage  Behaviors During COVID-19 Home Confinement",
    "abstract": "Pandemics and epidemics have been an essential part of human history. It has powerfully shaped human civilization, affecting politics, economics, medicine, and everyday human lives. Home confinement, one of the social isolation restrictions, has proven to be an effective way to prevent a pandemic and significantly reduce the spread of the virus. However, these measures have also led to negative psychological effects, which can be more severe than the physical discomfort caused by the pandemic itself. To address this issue, it is crucial to understand how being confined at home affects people's psychological states and their use of digital devices. To this end, we conducted an in-situ study with 32 participants living in states affected by COVID-19 lockdowns for three weeks. We examined human emotions, social roles, well-being, and mobile usage behaviors and explored the predictability of affective states using digital traces. Extensive experimental results show that COVID-19 home confinement is associated with decreased valence and increased work time and that human well-being could be accurately inferred from mobile usage behaviors. We also present a set of interesting findings on how different factors of mobile usage affect human emotions. Overall, the findings of this research have great potential to inform the development of interventions and remote programs to support individuals in similar situations, such as those who are ill or undergoing post-operative home rehabilitation and home work. ",
    "url": "https://arxiv.org/abs/2310.13304",
    "authors": [
      "Nan Gao",
      "Sam Nolan",
      "Kaixin Ji",
      "Shakila Khan Rumi",
      "Judith Simone Heinisch",
      "Christoph Anderson",
      "Klaus David",
      "Flora D. Salim"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2310.13321",
    "title": "Beyond Hard Samples: Robust and Effective Grammatical Error Correction  with Cycle Self-Augmenting",
    "abstract": "Recent studies have revealed that grammatical error correction methods in the sequence-to-sequence paradigm are vulnerable to adversarial attack, and simply utilizing adversarial examples in the pre-training or post-training process can significantly enhance the robustness of GEC models to certain types of attack without suffering too much performance loss on clean data. In this paper, we further conduct a thorough robustness evaluation of cutting-edge GEC methods for four different types of adversarial attacks and propose a simple yet very effective Cycle Self-Augmenting (CSA) method accordingly. By leveraging the augmenting data from the GEC models themselves in the post-training process and introducing regularization data for cycle training, our proposed method can effectively improve the model robustness of well-trained GEC models with only a few more training epochs as an extra cost. More concretely, further training on the regularization data can prevent the GEC models from over-fitting on easy-to-learn samples and thus can improve the generalization capability and robustness towards unseen data (adversarial noise/samples). Meanwhile, the self-augmented data can provide more high-quality pseudo pairs to improve model performance on the original testing data. Experiments on four benchmark datasets and seven strong models indicate that our proposed training method can significantly enhance the robustness of four types of attacks without using purposely built adversarial examples in training. Evaluation results on clean data further confirm that our proposed CSA method significantly improves the performance of four baselines and yields nearly comparable results with other state-of-the-art models. Our code is available at https://github.com/ZetangForward/CSA-GEC. ",
    "url": "https://arxiv.org/abs/2310.13321",
    "authors": [
      "Zecheng Tang",
      "Kaifeng Qi",
      "Juntao Li",
      "Min Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.13345",
    "title": "An LLM can Fool Itself: A Prompt-Based Adversarial Attack",
    "abstract": "The wide-ranging applications of large language models (LLMs), especially in safety-critical domains, necessitate the proper evaluation of the LLM's adversarial robustness. This paper proposes an efficient tool to audit the LLM's adversarial robustness via a prompt-based adversarial attack (PromptAttack). PromptAttack converts adversarial textual attacks into an attack prompt that can cause the victim LLM to output the adversarial sample to fool itself. The attack prompt is composed of three important components: (1) original input (OI) including the original sample and its ground-truth label, (2) attack objective (AO) illustrating a task description of generating a new sample that can fool itself without changing the semantic meaning, and (3) attack guidance (AG) containing the perturbation instructions to guide the LLM on how to complete the task by perturbing the original sample at character, word, and sentence levels, respectively. Besides, we use a fidelity filter to ensure that PromptAttack maintains the original semantic meanings of the adversarial examples. Further, we enhance the attack power of PromptAttack by ensembling adversarial examples at different perturbation levels. Comprehensive empirical results using Llama2 and GPT-3.5 validate that PromptAttack consistently yields a much higher attack success rate compared to AdvGLUE and AdvGLUE++. Interesting findings include that a simple emoji can easily mislead GPT-3.5 to make wrong predictions. ",
    "url": "https://arxiv.org/abs/2310.13345",
    "authors": [
      "Xilie Xu",
      "Keyi Kong",
      "Ning Liu",
      "Lizhen Cui",
      "Di Wang",
      "Jingfeng Zhang",
      "Mohan Kankanhalli"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.13364",
    "title": "Dissecting Causal Biases",
    "abstract": "Accurately measuring discrimination in machine learning-based automated decision systems is required to address the vital issue of fairness between subpopulations and/or individuals. Any bias in measuring discrimination can lead to either amplification or underestimation of the true value of discrimination. This paper focuses on a class of bias originating in the way training data is generated and/or collected. We call such class causal biases and use tools from the field of causality to formally define and analyze such biases. Four sources of bias are considered, namely, confounding, selection, measurement, and interaction. The main contribution of this paper is to provide, for each source of bias, a closed-form expression in terms of the model parameters. This makes it possible to analyze the behavior of each source of bias, in particular, in which cases they are absent and in which other cases they are maximized. We hope that the provided characterizations help the community better understand the sources of bias in machine learning applications. ",
    "url": "https://arxiv.org/abs/2310.13364",
    "authors": [
      "Rūta Binkytė",
      "Sami Zhioua",
      "Yassine Turki"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13367",
    "title": "VFedMH: Vertical Federated Learning for Training Multi-party  Heterogeneous Models",
    "abstract": "Vertical Federated Learning (VFL) has gained increasing attention as a novel training paradigm that integrates sample alignment and feature union. However, existing VFL methods face challenges when dealing with heterogeneous local models among participants, which affects optimization convergence and generalization. To address this issue, this paper proposes a novel approach called Vertical Federated learning for training Multi-parties Heterogeneous models (VFedMH). VFedMH focuses on aggregating the embeddings of each participant's knowledge instead of intermediate results during forward propagation. The active party, who possesses labels and features of the sample, in VFedMH securely aggregates local embeddings to obtain global knowledge embeddings, and sends them to passive parties. The passive parties, who own only features of the sample, then utilize the global embeddings to propagate forward on their local heterogeneous networks. However, the passive party does not own the labels, so the local model gradient cannot be calculated locally. To overcome this limitation, the active party assists the passive party in computing its local heterogeneous model gradients. Then, each participant trains their local model using the heterogeneous model gradients. The objective is to minimize the loss value of their respective local heterogeneous models. Additionally, the paper provides a theoretical analysis of VFedMH's convergence performance. Extensive experiments are conducted to demonstrate that VFedMH can simultaneously train multiple heterogeneous models with heterogeneous optimization and outperform some recent methods in model performance. ",
    "url": "https://arxiv.org/abs/2310.13367",
    "authors": [
      "Shuo Wang",
      "Keke Gai",
      "Jing Yu",
      "Liehuang Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2310.13380",
    "title": "APP: Adaptive Prototypical Pseudo-Labeling for Few-shot OOD Detection",
    "abstract": "Detecting out-of-domain (OOD) intents from user queries is essential for a task-oriented dialogue system. Previous OOD detection studies generally work on the assumption that plenty of labeled IND intents exist. In this paper, we focus on a more practical few-shot OOD setting where there are only a few labeled IND data and massive unlabeled mixed data that may belong to IND or OOD. The new scenario carries two key challenges: learning discriminative representations using limited IND data and leveraging unlabeled mixed data. Therefore, we propose an adaptive prototypical pseudo-labeling (APP) method for few-shot OOD detection, including a prototypical OOD detection framework (ProtoOOD) to facilitate low-resource OOD detection using limited IND data, and an adaptive pseudo-labeling method to produce high-quality pseudo OOD\\&IND labels. Extensive experiments and analysis demonstrate the effectiveness of our method for few-shot OOD detection. ",
    "url": "https://arxiv.org/abs/2310.13380",
    "authors": [
      "Pei Wang",
      "Keqing He",
      "Yutao Mou",
      "Xiaoshuai Song",
      "Yanan Wu",
      "Jingang Wang",
      "Yunsen Xian",
      "Xunliang Cai",
      "Weiran Xu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.13384",
    "title": "Salted Inference: Enhancing Privacy while Maintaining Efficiency of  Split Inference in Mobile Computing",
    "abstract": "Split inference partitions a deep neural network (DNN) to run the early part at the edge and the later part in the cloud. This meets two key requirements for on-device machine learning: input privacy and compute efficiency. Still, an open question in split inference is output privacy, given that the output of a DNN is visible to the cloud. While encrypted computing can protect output privacy, it mandates extensive computation and communication resources. In this paper, we introduce \"Salted DNNs\": a novel method that lets clients control the semantic interpretation of DNN output at inference time while maintaining accuracy and efficiency very close to that of a standard DNN. Experimental evaluations conducted on both image and sensor data show that Salted DNNs achieve classification accuracy very close to standard DNNs, particularly when the salted layer is positioned within the early part to meet the requirements of split inference. Our method is general and can be applied to various DNNs. We open-source our code and results, as a benchmark for future studies. ",
    "url": "https://arxiv.org/abs/2310.13384",
    "authors": [
      "Mohammad Malekzadeh",
      "Fahim Kawsar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2310.13388",
    "title": "Music Augmentation and Denoising For Peak-Based Audio Fingerprinting",
    "abstract": "Audio fingerprinting is a well-established solution for song identification from short recording excerpts. Popular methods rely on the extraction of sparse representations, generally spectral peaks, and have proven to be accurate, fast, and scalable to large collections. However, real-world applications of audio identification often happen in noisy environments, which can cause these systems to fail. In this work, we tackle this problem by introducing and releasing a new audio augmentation pipeline that adds noise to music snippets in a realistic way, by stochastically mimicking real-world scenarios. We then propose and release a deep learning model that removes noisy components from spectrograms in order to improve peak-based fingerprinting systems' accuracy. We show that the addition of our model improves the identification performance of commonly used audio fingerprinting systems, even under noisy conditions. ",
    "url": "https://arxiv.org/abs/2310.13388",
    "authors": [
      "Kamil Akesbi",
      "Dorian Desblancs",
      "Benjamin Martin"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2310.13411",
    "title": "Towards Enhancing Relational Rules for Knowledge Graph Link Prediction",
    "abstract": "Graph neural networks (GNNs) have shown promising performance for knowledge graph reasoning. A recent variant of GNN called progressive relational graph neural network (PRGNN), utilizes relational rules to infer missing knowledge in relational digraphs and achieves notable results. However, during reasoning with PRGNN, two important properties are often overlooked: (1) the sequentiality of relation composition, where the order of combining different relations affects the semantics of the relational rules, and (2) the lagged entity information propagation, where the transmission speed of required information lags behind the appearance speed of new entities. Ignoring these properties leads to incorrect relational rule learning and decreased reasoning accuracy. To address these issues, we propose a novel knowledge graph reasoning approach, the Relational rUle eNhanced Graph Neural Network (RUN-GNN). Specifically, RUN-GNN employs a query related fusion gate unit to model the sequentiality of relation composition and utilizes a buffering update mechanism to alleviate the negative effect of lagged entity information propagation, resulting in higher-quality relational rule learning. Experimental results on multiple datasets demonstrate the superiority of RUN-GNN is superior on both transductive and inductive link prediction tasks. ",
    "url": "https://arxiv.org/abs/2310.13411",
    "authors": [
      "Shuhan Wu",
      "Huaiyu Wan",
      "Wei Chen",
      "Yuting Wu",
      "Junfeng Shen",
      "Youfang Lin"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.13415",
    "title": "Secure Event-Triggered Control for Vehicle Platooning in the Presence of  Modification Attacks",
    "abstract": "This paper addresses the problem of achieving secure consensus in a vehicular platoon using event-triggered control. The platoon consists of a leader and multiple follower vehicles exchanging their position and velocity information discretely to maintain stability. The paper focuses on the issue of gain modification attacks, where a malicious actor attempts to alter the controller gains to destabilize the platoon. To tackle this problem, the paper proposes a resilient event-triggered control scheme that ensures secure consensus while considering constraints on the duration and frequency of attacks. The paper also introduces an attack mitigation strategy through a topology-switching procedure, which is employed when the attack frequency and duration constraints are not met. First, sufficient consensus conditions for distributed static and dynamic event-triggered control schemes are derived under sequential gain modification attacks. The impact of the system matrices and triggering parameters on the attack constraints is also discussed. Second, the paper derives conditions to broaden the range of controller gain stability using the Schur stability criterion to mitigate attacks and maintain platoon stability. Finally, the effectiveness of the proposed methodology is demonstrated through simulation scenarios in various case studies. ",
    "url": "https://arxiv.org/abs/2310.13415",
    "authors": [
      "Ali Nikoutadbir",
      "Sajjad Torabi",
      "Sadegh Bolouki"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.13424",
    "title": "FLTracer: Accurate Poisoning Attack Provenance in Federated Learning",
    "abstract": "Federated Learning (FL) is a promising distributed learning approach that enables multiple clients to collaboratively train a shared global model. However, recent studies show that FL is vulnerable to various poisoning attacks, which can degrade the performance of global models or introduce backdoors into them. In this paper, we first conduct a comprehensive study on prior FL attacks and detection methods. The results show that all existing detection methods are only effective against limited and specific attacks. Most detection methods suffer from high false positives, which lead to significant performance degradation, especially in not independent and identically distributed (non-IID) settings. To address these issues, we propose FLTracer, the first FL attack provenance framework to accurately detect various attacks and trace the attack time, objective, type, and poisoned location of updates. Different from existing methodologies that rely solely on cross-client anomaly detection, we propose a Kalman filter-based cross-round detection to identify adversaries by seeking the behavior changes before and after the attack. Thus, this makes it resilient to data heterogeneity and is effective even in non-IID settings. To further improve the accuracy of our detection method, we employ four novel features and capture their anomalies with the joint decisions. Extensive evaluations show that FLTracer achieves an average true positive rate of over $96.88\\%$ at an average false positive rate of less than $2.67\\%$, significantly outperforming SOTA detection methods. \\footnote{Code is available at \\url{https://github.com/Eyr3/FLTracer}.} ",
    "url": "https://arxiv.org/abs/2310.13424",
    "authors": [
      "Xinyu Zhang",
      "Qingyu Liu",
      "Zhongjie Ba",
      "Yuan Hong",
      "Tianhang Zheng",
      "Feng Lin",
      "Li Lu",
      "Kui Ren"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13447",
    "title": "Multiscale Superpixel Structured Difference Graph Convolutional Network  for VL Representation",
    "abstract": "Within the multimodal field, the key to integrating vision and language lies in establishing a good alignment strategy. Recently, benefiting from the success of self-supervised learning, significant progress has been made in multimodal semantic representation based on pre-trained models for vision and language. However, there is still room for improvement in visual semantic representation. The lack of spatial semantic coherence and vulnerability to noise makes it challenging for current pixel or patch-based methods to accurately extract complex scene boundaries. To this end, this paper develops superpixel as a comprehensive compact representation of learnable image data, which effectively reduces the number of visual primitives for subsequent processing by clustering perceptually similar pixels. To mine more precise topological relations, we propose a Multiscale Difference Graph Convolutional Network (MDGCN). It parses the entire image as a fine-to-coarse hierarchical structure of constituent visual patterns, and captures multiscale features by progressively merging adjacent superpixels as graph nodes. Moreover, we predict the differences between adjacent nodes through the graph structure, facilitating key information aggregation of graph nodes to reason actual semantic relations. Afterward, we design a multi-level fusion rule in a bottom-up manner to avoid understanding deviation by learning complementary spatial information at different regional scales. Our proposed method can be well applied to multiple downstream task learning. Extensive experiments demonstrate that our method is competitive with other state-of-the-art methods in visual reasoning. Our code will be released upon publication. ",
    "url": "https://arxiv.org/abs/2310.13447",
    "authors": [
      "Siyu Zhang",
      "Yeming Chen",
      "Sirui Cheng",
      "Yaoru Sun",
      "Jun Yang",
      "Lizhi Bai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.13451",
    "title": "Two-Stage Triplet Loss Training with Curriculum Augmentation for  Audio-Visual Retrieval",
    "abstract": "The cross-modal retrieval model leverages the potential of triple loss optimization to learn robust embedding spaces. However, existing methods often train these models in a singular pass, overlooking the distinction between semi-hard and hard triples in the optimization process. The oversight of not distinguishing between semi-hard and hard triples leads to suboptimal model performance. In this paper, we introduce a novel approach rooted in curriculum learning to address this problem. We propose a two-stage training paradigm that guides the model's learning process from semi-hard to hard triplets. In the first stage, the model is trained with a set of semi-hard triplets, starting from a low-loss base. Subsequently, in the second stage, we augment the embeddings using an interpolation technique. This process identifies potential hard negatives, alleviating issues arising from high-loss functions due to a scarcity of hard triples. Our approach then applies hard triplet mining in the augmented embedding space to further optimize the model. Extensive experimental results conducted on two audio-visual datasets show a significant improvement of approximately 9.8% in terms of average Mean Average Precision (MAP) over the current state-of-the-art method, MSNSCA, for the Audio-Visual Cross-Modal Retrieval (AV-CMR) task on the AVE dataset, indicating the effectiveness of our proposed method. ",
    "url": "https://arxiv.org/abs/2310.13451",
    "authors": [
      "Donghuo Zeng",
      "Kazushi Ikeda"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Retrieval (cs.IR)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2310.13473",
    "title": "Benchmarking Sequential Visual Input Reasoning and Prediction in  Multimodal Large Language Models",
    "abstract": "Multimodal large language models (MLLMs) have shown great potential in perception and interpretation tasks, but their capabilities in predictive reasoning remain under-explored. To address this gap, we introduce a novel benchmark that assesses the predictive reasoning capabilities of MLLMs across diverse scenarios. Our benchmark targets three important domains: abstract pattern reasoning, human activity prediction, and physical interaction prediction. We further develop three evaluation methods powered by large language model to robustly quantify a model's performance in predicting and reasoning the future based on multi-visual context. Empirical experiments confirm the soundness of the proposed benchmark and evaluation methods via rigorous testing and reveal pros and cons of current popular MLLMs in the task of predictive reasoning. Lastly, our proposed benchmark provides a standardized evaluation framework for MLLMs and can facilitate the development of more advanced models that can reason and predict over complex long sequence of multimodal input. ",
    "url": "https://arxiv.org/abs/2310.13473",
    "authors": [
      "Mingwei Zhu",
      "Leigang Sha",
      "Yu Shu",
      "Kangjia Zhao",
      "Tiancheng Zhao",
      "Jianwei Yin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.13481",
    "title": "A review of individual tree crown detection and delineation from optical  remote sensing images",
    "abstract": "Powered by the advances of optical remote sensing sensors, the production of very high spatial resolution multispectral images provides great potential for achieving cost-efficient and high-accuracy forest inventory and analysis in an automated way. Lots of studies that aim at providing an inventory to the level of each individual tree have generated a variety of methods for Individual Tree Crown Detection and Delineation (ITCD). This review covers ITCD methods for detecting and delineating individual tree crowns, and systematically reviews the past and present of ITCD-related researches applied to the optical remote sensing images. With the goal to provide a clear knowledge map of existing ITCD efforts, we conduct a comprehensive review of recent ITCD papers to build a meta-data analysis, including the algorithm, the study site, the tree species, the sensor type, the evaluation method, etc. We categorize the reviewed methods into three classes: (1) traditional image processing methods (such as local maximum filtering, image segmentation, etc.); (2) traditional machine learning methods (such as random forest, decision tree, etc.); and (3) deep learning based methods. With the deep learning-oriented approaches contributing a majority of the papers, we further discuss the deep learning-based methods as semantic segmentation and object detection methods. In addition, we discuss four ITCD-related issues to further comprehend the ITCD domain using optical remote sensing data, such as comparisons between multi-sensor based data and optical data in ITCD domain, comparisons among different algorithms and different ITCD tasks, etc. Finally, this review proposes some ITCD-related applications and a few exciting prospects and potential hot topics in future ITCD research. ",
    "url": "https://arxiv.org/abs/2310.13481",
    "authors": [
      "Juepeng Zheng",
      "Shuai Yuan",
      "Weijia Li",
      "Haohuan Fu",
      "Le Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.13490",
    "title": "Feature Selection and Hyperparameter Fine-tuning in Artificial Neural  Networks for Wood Quality Classification",
    "abstract": "Quality classification of wood boards is an essential task in the sawmill industry, which is still usually performed by human operators in small to median companies in developing countries. Machine learning algorithms have been successfully employed to investigate the problem, offering a more affordable alternative compared to other solutions. However, such approaches usually present some drawbacks regarding the proper selection of their hyperparameters. Moreover, the models are susceptible to the features extracted from wood board images, which influence the induction of the model and, consequently, its generalization power. Therefore, in this paper, we investigate the problem of simultaneously tuning the hyperparameters of an artificial neural network (ANN) as well as selecting a subset of characteristics that better describes the wood board quality. Experiments were conducted over a private dataset composed of images obtained from a sawmill industry and described using different feature descriptors. The predictive performance of the model was compared against five baseline methods as well as a random search, performing either ANN hyperparameter tuning and feature selection. Experimental results suggest that hyperparameters should be adjusted according to the feature set, or the features should be selected considering the hyperparameter values. In summary, the best predictive performance, i.e., a balanced accuracy of $0.80$, was achieved in two distinct scenarios: (i) performing only feature selection, and (ii) performing both tasks concomitantly. Thus, we suggest that at least one of the two approaches should be considered in the context of industrial applications. ",
    "url": "https://arxiv.org/abs/2310.13490",
    "authors": [
      "Mateus Roder",
      "Leandro Aparecido Passos",
      "João Paulo Papa",
      "André Luis Debiaso Rossi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13505",
    "title": "Robust Training for Conversational Question Answering Models with  Reinforced Reformulation Generation",
    "abstract": "Models for conversational question answering (ConvQA) over knowledge graphs (KGs) are usually trained and tested on benchmarks of gold QA pairs. This implies that training is limited to surface forms seen in the respective datasets, and evaluation is on a small set of held-out questions. Through our proposed framework REIGN, we take several steps to remedy this restricted learning setup. First, we systematically generate reformulations of training questions to increase robustness of models to surface form variations. This is a particularly challenging problem, given the incomplete nature of such questions. Second, we guide ConvQA models towards higher performance by feeding it only those reformulations that help improve their answering quality, using deep reinforcement learning. Third, we demonstrate the viability of training major model components on one benchmark and applying them zero-shot to another. Finally, for a rigorous evaluation of robustness for trained models, we use and release large numbers of diverse reformulations generated by prompting GPT for benchmark test sets (resulting in 20x increase in sizes). Our findings show that ConvQA models with robust training via reformulations, significantly outperform those with standard training from gold QA pairs only. ",
    "url": "https://arxiv.org/abs/2310.13505",
    "authors": [
      "Magdalena Kaiser",
      "Rishiraj Saha Roy",
      "Gerhard Weikum"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2310.13508",
    "title": "Social Robot Mediator for Multiparty Interaction",
    "abstract": "A social robot acting as a 'mediator' can enhance interactions between humans, for example, in fields such as education and healthcare. A particularly promising area of research is the use of a social robot mediator in a multiparty setting, which tends to be the most applicable in real-world scenarios. However, research in social robot mediation for multiparty interactions is still emerging and faces numerous challenges. This paper provides an overview of social robotics and mediation research by highlighting relevant literature and some of the ongoing problems. The importance of incorporating relevant psychological principles for developing social robot mediators is also presented. Additionally, the potential of implementing a Theory of Mind in a social robot mediator is explored, given how such a framework could greatly improve mediation by reading the individual and group mental states to interact effectively. ",
    "url": "https://arxiv.org/abs/2310.13508",
    "authors": [
      "Manith Adikari",
      "Angelo Cangelosi",
      "Randy Gomez"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2310.13528",
    "title": "Watch Nearby! Privacy Analysis of the People Nearby Service of Telegram",
    "abstract": "People Nearby is a service offered by Telegram that allows a user to discover other Telegram users, based only on geographical proximity. Nearby users are reported with a rough estimate of their distance from the position of the reference user, allowing Telegram to claim location privacy In this paper, we systematically analyze the location privacy provided by Telegram to users of the People Nearby service. Through an extensive measurement campaign run by spoofing the user's location all over the world, we reverse-engineer the algorithm adopted by People Nearby to compute distances between users. Although the service protects against precise user localization, we demonstrate that location privacy is always lower than the one declared by Telegram of 500 meters. Specifically, we discover that location privacy is a function of the geographical position of the user. Indeed, the radius of the location privacy area (localization error) spans between 400 meters (close to the equator) and 128 meters (close to the poles), with a difference of up to 75% (worst case) compared to what Telegram declares. After our responsible disclosure, Telegram updated the FAQ associated with the service. Finally, we provide some solutions and countermeasures that Telegram can implement to improve location privacy. In general, the reported findings highlight the significant privacy risks associated with using People Nearby service. ",
    "url": "https://arxiv.org/abs/2310.13528",
    "authors": [
      "Maurantonio Caprolu",
      "Savio Sciancalepore",
      "Aleksandar Grigorov",
      "Velyan Kolev",
      "Gabriele Oligeri"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.13538",
    "title": "Positive-Unlabeled Node Classification with Structure-aware Graph  Learning",
    "abstract": "Node classification on graphs is an important research problem with many applications. Real-world graph data sets may not be balanced and accurate as assumed by most existing works. A challenging setting is positive-unlabeled (PU) node classification, where labeled nodes are restricted to positive nodes. It has diverse applications, e.g., pandemic prediction or network anomaly detection. Existing works on PU node classification overlook information in the graph structure, which can be critical. In this paper, we propose to better utilize graph structure for PU node classification. We first propose a distance-aware PU loss that uses homophily in graphs to introduce more accurate supervision. We also propose a regularizer to align the model with graph structure. Theoretical analysis shows that minimizing the proposed loss also leads to minimizing the expected loss with both positive and negative labels. Extensive empirical evaluation on diverse graph data sets demonstrates its superior performance over existing state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2310.13538",
    "authors": [
      "Hansi Yang",
      "Yongqi Zhang",
      "Quanming Yao",
      "James Kwok"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13545",
    "title": "ScaleLong: Towards More Stable Training of Diffusion Model via Scaling  Network Long Skip Connection",
    "abstract": "In diffusion models, UNet is the most popular network backbone, since its long skip connects (LSCs) to connect distant network blocks can aggregate long-distant information and alleviate vanishing gradient. Unfortunately, UNet often suffers from unstable training in diffusion models which can be alleviated by scaling its LSC coefficients smaller. However, theoretical understandings of the instability of UNet in diffusion models and also the performance improvement of LSC scaling remain absent yet. To solve this issue, we theoretically show that the coefficients of LSCs in UNet have big effects on the stableness of the forward and backward propagation and robustness of UNet. Specifically, the hidden feature and gradient of UNet at any layer can oscillate and their oscillation ranges are actually large which explains the instability of UNet training. Moreover, UNet is also provably sensitive to perturbed input, and predicts an output distant from the desired output, yielding oscillatory loss and thus oscillatory gradient. Besides, we also observe the theoretical benefits of the LSC coefficient scaling of UNet in the stableness of hidden features and gradient and also robustness. Finally, inspired by our theory, we propose an effective coefficient scaling framework ScaleLong that scales the coefficients of LSC in UNet and better improves the training stability of UNet. Experimental results on four famous datasets show that our methods are superior to stabilize training and yield about 1.5x training acceleration on different diffusion models with UNet or UViT backbones. Code: https://github.com/sail-sg/ScaleLong ",
    "url": "https://arxiv.org/abs/2310.13545",
    "authors": [
      "Zhongzhan Huang",
      "Pan Zhou",
      "Shuicheng Yan",
      "Liang Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13553",
    "title": "On sample complexity of conditional independence testing with Von Mises  estimator with application to causal discovery",
    "abstract": "Motivated by conditional independence testing, an essential step in constraint-based causal discovery algorithms, we study the nonparametric Von Mises estimator for the entropy of multivariate distributions built on a kernel density estimator. We establish an exponential concentration inequality for this estimator. We design a test for conditional independence (CI) based on our estimator, called VM-CI, which achieves optimal parametric rates under smoothness assumptions. Leveraging the exponential concentration, we prove a tight upper bound for the overall error of VM-CI. This, in turn, allows us to characterize the sample complexity of any constraint-based causal discovery algorithm that uses VM-CI for CI tests. To the best of our knowledge, this is the first sample complexity guarantee for causal discovery for continuous variables. Furthermore, we empirically show that VM-CI outperforms other popular CI tests in terms of either time or sample complexity (or both), which translates to a better performance in structure learning as well. ",
    "url": "https://arxiv.org/abs/2310.13553",
    "authors": [
      "Fateme Jamshidi",
      "Luca Ganassali",
      "Negar Kiyavash"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13566",
    "title": "Retrieval-Augmented Neural Response Generation Using Logical Reasoning  and Relevance Scoring",
    "abstract": "Constructing responses in task-oriented dialogue systems typically relies on information sources such the current dialogue state or external databases. This paper presents a novel approach to knowledge-grounded response generation that combines retrieval-augmented language models with logical reasoning. The approach revolves around a knowledge graph representing the current dialogue state and background information, and proceeds in three steps. The knowledge graph is first enriched with logically derived facts inferred using probabilistic logical programming. A neural model is then employed at each turn to score the conversational relevance of each node and edge of this extended graph. Finally, the elements with highest relevance scores are converted to a natural language form, and are integrated into the prompt for the neural conversational model employed to generate the system response. We investigate the benefits of the proposed approach on two datasets (KVRET and GraphWOZ) along with a human evaluation. Experimental results show that the combination of (probabilistic) logical reasoning with conversational relevance scoring does increase both the factuality and fluency of the responses. ",
    "url": "https://arxiv.org/abs/2310.13566",
    "authors": [
      "Nicholas Thomas Walker",
      "Stefan Ultes",
      "Pierre Lison"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13573",
    "title": "Boosting Generalization with Adaptive Style Techniques for Fingerprint  Liveness Detection",
    "abstract": "We introduce a high-performance fingerprint liveness feature extraction technique that secured first place in LivDet 2023 Fingerprint Representation Challenge. Additionally, we developed a practical fingerprint recognition system with 94.68% accuracy, earning second place in LivDet 2023 Liveness Detection in Action. By investigating various methods, particularly style transfer, we demonstrate improvements in accuracy and generalization when faced with limited training data. As a result, our approach achieved state-of-the-art performance in LivDet 2023 Challenges. ",
    "url": "https://arxiv.org/abs/2310.13573",
    "authors": [
      "Kexin Zhu",
      "Bo Lin",
      "Yang Qiu",
      "Adam Yule",
      "Yao Tang",
      "Jiajun Liang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13576",
    "title": "Tree Search in DAG Space with Model-based Reinforcement Learning for  Causal Discovery",
    "abstract": "Identifying causal structure is central to many fields ranging from strategic decision-making to biology and economics. In this work, we propose a model-based reinforcement learning method for causal discovery based on tree search, which builds directed acyclic graphs incrementally. We also formalize and prove the correctness of an efficient algorithm for excluding edges that would introduce cycles, which enables deeper discrete search and sampling in DAG space. We evaluate our approach on two real-world tasks, achieving substantially better performance than the state-of-the-art model-free method and greedy search, constituting a promising advancement for combinatorial methods. ",
    "url": "https://arxiv.org/abs/2310.13576",
    "authors": [
      "Victor-Alexandru Darvariu",
      "Stephen Hailes",
      "Mirco Musolesi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13581",
    "title": "SPARE: A Single-Pass Neural Model for Relational Databases",
    "abstract": "While there has been extensive work on deep neural networks for images and text, deep learning for relational databases (RDBs) is still a rather unexplored field. One direction that recently gained traction is to apply Graph Neural Networks (GNNs) to RBDs. However, training GNNs on large relational databases (i.e., data stored in multiple database tables) is rather inefficient due to multiple rounds of training and potentially large and inefficient representations. Hence, in this paper we propose SPARE (Single-Pass Relational models), a new class of neural models that can be trained efficiently on RDBs while providing similar accuracies as GNNs. For enabling efficient training, different from GNNs, SPARE makes use of the fact that data in RDBs has a regular structure, which allows one to train these models in a single pass while exploiting symmetries at the same time. Our extensive empirical evaluation demonstrates that SPARE can significantly speedup both training and inference while offering competitive predictive performance over numerous baselines. ",
    "url": "https://arxiv.org/abs/2310.13581",
    "authors": [
      "Benjamin Hilprecht",
      "Kristian Kersting",
      "Carsten Binnig"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13590",
    "title": "ReLM: Leveraging Language Models for Enhanced Chemical Reaction  Prediction",
    "abstract": "Predicting chemical reactions, a fundamental challenge in chemistry, involves forecasting the resulting products from a given reaction process. Conventional techniques, notably those employing Graph Neural Networks (GNNs), are often limited by insufficient training data and their inability to utilize textual information, undermining their applicability in real-world applications. In this work, we propose ReLM, a novel framework that leverages the chemical knowledge encoded in language models (LMs) to assist GNNs, thereby enhancing the accuracy of real-world chemical reaction predictions. To further enhance the model's robustness and interpretability, we incorporate the confidence score strategy, enabling the LMs to self-assess the reliability of their predictions. Our experimental results demonstrate that ReLM improves the performance of state-of-the-art GNN-based methods across various chemical reaction datasets, especially in out-of-distribution settings. Codes are available at https://github.com/syr-cn/ReLM. ",
    "url": "https://arxiv.org/abs/2310.13590",
    "authors": [
      "Yaorui Shi",
      "An Zhang",
      "Enzhi Zhang",
      "Zhiyuan Liu",
      "Xiang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13606",
    "title": "MULTITuDE: Large-Scale Multilingual Machine-Generated Text Detection  Benchmark",
    "abstract": "There is a lack of research into capabilities of recent LLMs to generate convincing text in languages other than English and into performance of detectors of machine-generated text in multilingual settings. This is also reflected in the available benchmarks which lack authentic texts in languages other than English and predominantly cover older generators. To fill this gap, we introduce MULTITuDE, a novel benchmarking dataset for multilingual machine-generated text detection comprising of 74,081 authentic and machine-generated texts in 11 languages (ar, ca, cs, de, en, es, nl, pt, ru, uk, and zh) generated by 8 multilingual LLMs. Using this benchmark, we compare the performance of zero-shot (statistical and black-box) and fine-tuned detectors. Considering the multilinguality, we evaluate 1) how these detectors generalize to unseen languages (linguistically similar as well as dissimilar) and unseen LLMs and 2) whether the detectors improve their performance when trained on multiple languages. ",
    "url": "https://arxiv.org/abs/2310.13606",
    "authors": [
      "Dominik Macko",
      "Robert Moro",
      "Adaku Uchendu",
      "Jason Samuel Lucas",
      "Michiharu Yamashita",
      "Matúš Pikuliak",
      "Ivan Srba",
      "Thai Le",
      "Dongwon Lee",
      "Jakub Simko",
      "Maria Bielikova"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.13622",
    "title": "What you see is what you get: Experience ranking with deep neural  dataset-to-dataset similarity for topological localisation",
    "abstract": "Recalling the most relevant visual memories for localisation or understanding a priori the likely outcome of localisation effort against a particular visual memory is useful for efficient and robust visual navigation. Solutions to this problem should be divorced from performance appraisal against ground truth - as this is not available at run-time - and should ideally be based on generalisable environmental observations. For this, we propose applying the recently developed Visual DNA as a highly scalable tool for comparing datasets of images - in this work, sequences of map and live experiences. In the case of localisation, important dataset differences impacting performance are modes of appearance change, including weather, lighting, and season. Specifically, for any deep architecture which is used for place recognition by matching feature volumes at a particular layer, we use distribution measures to compare neuron-wise activation statistics between live images and multiple previously recorded past experiences, with a potentially large seasonal (winter/summer) or time of day (day/night) shift. We find that differences in these statistics correlate to performance when localising using a past experience with the same appearance gap. We validate our approach over the Nordland cross-season dataset as well as data from Oxford's University Parks with lighting and mild seasonal change, showing excellent ability of our system to rank actual localisation performance across candidate experiences. ",
    "url": "https://arxiv.org/abs/2310.13622",
    "authors": [
      "Matthew Gadd",
      "Benjamin Ramtoula",
      "Daniele De Martini",
      "Paul Newman"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.13627",
    "title": "Deep-Learning-based Change Detection with Spaceborne Hyperspectral  PRISMA data",
    "abstract": "Change detection (CD) methods have been applied to optical data for decades, while the use of hyperspectral data with a fine spectral resolution has been rarely explored. CD is applied in several sectors, such as environmental monitoring and disaster management. Thanks to the PRecursore IperSpettrale della Missione operativA (PRISMA), hyperspectral-from-space CD is now possible. In this work, we apply standard and deep-learning (DL) CD methods to different targets, from natural to urban areas. We propose a pipeline starting from coregistration, followed by CD with a full-spectrum algorithm and by a DL network developed for optical data. We find that changes in vegetation and built environments are well captured. The spectral information is valuable to identify subtle changes and the DL methods are less affected by noise compared to the statistical method, but atmospheric effects and the lack of reliable ground truth represent a major challenge to hyperspectral CD. ",
    "url": "https://arxiv.org/abs/2310.13627",
    "authors": [
      "J.F. Amieva",
      "A. Austoni",
      "M.A. Brovelli",
      "L. Ansalone",
      "P. Naylor",
      "F. Serva",
      "B. Le Saux"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.13655",
    "title": "Adaptive Robust Control Contraction Metrics: Transient Bounds in  Adaptive Control with Unmatched Uncertainties",
    "abstract": "This work presents a new sufficient condition for synthesizing nonlinear controllers that yield bounded closed-loop tracking error transients despite the presence of unmatched uncertainties that are concurrently being learned online. The approach utilizes contraction theory and addresses fundamental limitations of existing approaches by allowing the contraction metric to depend on the unknown model parameters. This allows the controller to incorporate new model estimates generated online without sacrificing its strong convergence and bounded transients guarantees. The approach is specifically designed for trajectory tracking so the approach is more broadly applicable to adaptive model predictive control as well. Simulation results on a nonlinear system with unmatched uncertainties demonstrates the approach. ",
    "url": "https://arxiv.org/abs/2310.13655",
    "authors": [
      "Samuel G. Gessow",
      "Brett T. Lopez"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2310.13664",
    "title": "Explainability, Interpretability, Depression detection, Social Media",
    "abstract": "Users of social platforms often perceive these sites as supportive spaces to post about their mental health issues. Those conversations contain important traces about individuals' health risks. Recently, researchers have exploited this online information to construct mental health detection models, which aim to identify users at risk on platforms like Twitter, Reddit or Facebook. Most of these models are centred on achieving good classification results, ignoring the explainability and interpretability of the decisions. Recent research has pointed out the importance of using clinical markers, such as the use of symptoms, to improve trust in the computational models by health professionals. In this paper, we propose using transformer-based architectures to detect and explain the appearance of depressive symptom markers in the users' writings. We present two approaches: $i)$ train a model to classify, and another one to explain the classifier's decision separately and $ii)$ unify the two tasks simultaneously using a single model. Additionally, for this latter manner, we also investigated the performance of recent conversational LLMs when using in-context learning. Our natural language explanations enable clinicians to interpret the models' decisions based on validated symptoms, enhancing trust in the automated process. We evaluate our approach using recent symptom-based datasets, employing both offline and expert-in-the-loop metrics to assess the quality of the explanations generated by our models. The experimental results show that it is possible to achieve good classification results while generating interpretable symptom-based explanations. ",
    "url": "https://arxiv.org/abs/2310.13664",
    "authors": [
      "Eliseo Bao Souto",
      "Anxo Pérez",
      "Javier Parapar"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.13669",
    "title": "Automatic Unit Test Data Generation and Actor-Critic Reinforcement  Learning for Code Synthesis",
    "abstract": "The advent of large pre-trained language models in the domain of Code Synthesis has shown remarkable performance on various benchmarks, treating the problem of Code Generation in a fashion similar to Natural Language Generation, trained with a Language Modelling (LM) objective. In addition, the property of programming language code being precisely evaluable with respect to its semantics -- through the use of Unit Tests to check its functional correctness -- lends itself to using Reinforcement Learning (RL) as a further training paradigm. Previous work has shown that RL can be applied as such to improve models' coding capabilities; however, such RL-based methods rely on a reward signal based on defined Unit Tests, which are much harder to obtain compared to the huge crawled code datasets used in LM objectives. In this work, we present a novel approach to automatically obtain data consisting of function signatures and associated Unit Tests, suitable for RL training of Code Synthesis models. We also introduce a straightforward, simple yet effective Actor-Critic RL training scheme and show that it, in conjunction with automatically generated training data, leads to improvement of a pre-trained code language model's performance by up to 9.9% improvement over the original underlying code synthesis LM, and up to 4.3% over RL-based models trained with standard PPO or CodeRL. ",
    "url": "https://arxiv.org/abs/2310.13669",
    "authors": [
      "Philip John Gorinski",
      "Matthieu Zimmer",
      "Gerasimos Lampouras",
      "Derrick Goh Xin Deik",
      "Ignacio Iacobacci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2310.13670",
    "title": "ManifoldNeRF: View-dependent Image Feature Supervision for Few-shot  Neural Radiance Fields",
    "abstract": "Novel view synthesis has recently made significant progress with the advent of Neural Radiance Fields (NeRF). DietNeRF is an extension of NeRF that aims to achieve this task from only a few images by introducing a new loss function for unknown viewpoints with no input images. The loss function assumes that a pre-trained feature extractor should output the same feature even if input images are captured at different viewpoints since the images contain the same object. However, while that assumption is ideal, in reality, it is known that as viewpoints continuously change, also feature vectors continuously change. Thus, the assumption can harm training. To avoid this harmful training, we propose ManifoldNeRF, a method for supervising feature vectors at unknown viewpoints using interpolated features from neighboring known viewpoints. Since the method provides appropriate supervision for each unknown viewpoint by the interpolated features, the volume representation is learned better than DietNeRF. Experimental results show that the proposed method performs better than others in a complex scene. We also experimented with several subsets of viewpoints from a set of viewpoints and identified an effective set of viewpoints for real environments. This provided a basic policy of viewpoint patterns for real-world application. The code is available at https://github.com/haganelego/ManifoldNeRF_BMVC2023 ",
    "url": "https://arxiv.org/abs/2310.13670",
    "authors": [
      "Daiju Kanaoka",
      "Motoharu Sonogashira",
      "Hakaru Tamukoh",
      "Yasutomo Kawanishi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13674",
    "title": "Using Human-like Mechanism to Weaken Effect of Pre-training Weight Bias  in Face-Recognition Convolutional Neural Network",
    "abstract": "Convolutional neural network (CNN), as an important model in artificial intelligence, has been widely used and studied in different disciplines. The computational mechanisms of CNNs are still not fully revealed due to the their complex nature. In this study, we focused on 4 extensively studied CNNs (AlexNet, VGG11, VGG13, and VGG16) which has been analyzed as human-like models by neuroscientists with ample evidence. We trained these CNNs to emotion valence classification task by transfer learning. Comparing their performance with human data, the data unveiled that these CNNs would partly perform as human does. We then update the object-based AlexNet using self-attention mechanism based on neuroscience and behavioral data. The updated FE-AlexNet outperformed all the other tested CNNs and closely resembles human perception. The results further unveil the computational mechanisms of these CNNs. Moreover, this study offers a new paradigm to better understand and improve CNN performance via human data. ",
    "url": "https://arxiv.org/abs/2310.13674",
    "authors": [
      "Haojiang Ying",
      "Yi-Fan Li",
      "Yiyang Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2310.12987",
    "title": "Spec-NeRF: Multi-spectral Neural Radiance Fields",
    "abstract": "We propose Multi-spectral Neural Radiance Fields(Spec-NeRF) for jointly reconstructing a multispectral radiance field and spectral sensitivity functions(SSFs) of the camera from a set of color images filtered by different filters. The proposed method focuses on modeling the physical imaging process, and applies the estimated SSFs and radiance field to synthesize novel views of multispectral scenes. In this method, the data acquisition requires only a low-cost trichromatic camera and several off-the-shelf color filters, making it more practical than using specialized 3D scanning and spectral imaging equipment. Our experiments on both synthetic and real scenario datasets demonstrate that utilizing filtered RGB images with learnable NeRF and SSFs can achieve high fidelity and promising spectral reconstruction while retaining the inherent capability of NeRF to comprehend geometric structures. Code is available at https://github.com/CPREgroup/SpecNeRF-v2. ",
    "url": "https://arxiv.org/abs/2310.12987",
    "authors": [
      "Jiabao Li",
      "Yuqi Li",
      "Ciliang Sun",
      "Chong Wang",
      "Jinhui Xiang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2310.12996",
    "title": "Zero-shot Learning of Drug Response Prediction for Preclinical Drug  Screening",
    "abstract": "Conventional deep learning methods typically employ supervised learning for drug response prediction (DRP). This entails dependence on labeled response data from drugs for model training. However, practical applications in the preclinical drug screening phase demand that DRP models predict responses for novel compounds, often with unknown drug responses. This presents a challenge, rendering supervised deep learning methods unsuitable for such scenarios. In this paper, we propose a zero-shot learning solution for the DRP task in preclinical drug screening. Specifically, we propose a Multi-branch Multi-Source Domain Adaptation Test Enhancement Plug-in, called MSDA. MSDA can be seamlessly integrated with conventional DRP methods, learning invariant features from the prior response data of similar drugs to enhance real-time predictions of unlabeled compounds. We conducted experiments using the GDSCv2 and CellMiner datasets. The results demonstrate that MSDA efficiently predicts drug responses for novel compounds, leading to a general performance improvement of 5-10\\% in the preclinical drug screening phase. The significance of this solution resides in its potential to accelerate the drug discovery process, improve drug candidate assessment, and facilitate the success of drug discovery. ",
    "url": "https://arxiv.org/abs/2310.12996",
    "authors": [
      "Kun Li",
      "Yong Luo",
      "Xiantao Cai",
      "Wenbin Hu",
      "Bo Du"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Cell Behavior (q-bio.CB)",
      "Genomics (q-bio.GN)"
    ]
  },
  {
    "id": "arXiv:2310.13259",
    "title": "Domain-specific optimization and diverse evaluation of self-supervised  models for histopathology",
    "abstract": "Task-specific deep learning models in histopathology offer promising opportunities for improving diagnosis, clinical research, and precision medicine. However, development of such models is often limited by availability of high-quality data. Foundation models in histopathology that learn general representations across a wide range of tissue types, diagnoses, and magnifications offer the potential to reduce the data, compute, and technical expertise necessary to develop task-specific deep learning models with the required level of model performance. In this work, we describe the development and evaluation of foundation models for histopathology via self-supervised learning (SSL). We first establish a diverse set of benchmark tasks involving 17 unique tissue types and 12 unique cancer types and spanning different optimal magnifications and task types. Next, we use this benchmark to explore and evaluate histopathology-specific SSL methods followed by further evaluation on held out patch-level and weakly supervised tasks. We found that standard SSL methods thoughtfully applied to histopathology images are performant across our benchmark tasks and that domain-specific methodological improvements can further increase performance. Our findings reinforce the value of using domain-specific SSL methods in pathology, and establish a set of high quality foundation models to enable further research across diverse applications. ",
    "url": "https://arxiv.org/abs/2310.13259",
    "authors": [
      "Jeremy Lai",
      "Faruk Ahmed",
      "Supriya Vijay",
      "Tiam Jaroensri",
      "Jessica Loo",
      "Saurabh Vyawahare",
      "Saloni Agarwal",
      "Fayaz Jamil",
      "Yossi Matias",
      "Greg S. Corrado",
      "Dale R. Webster",
      "Jonathan Krause",
      "Yun Liu",
      "Po-Hsuan Cameron Chen",
      "Ellery Wulczyn",
      "David F. Steiner"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.13270",
    "title": "Meta-learning of Physics-informed Neural Networks for Efficiently  Solving Newly Given PDEs",
    "abstract": "We propose a neural network-based meta-learning method to efficiently solve partial differential equation (PDE) problems. The proposed method is designed to meta-learn how to solve a wide variety of PDE problems, and uses the knowledge for solving newly given PDE problems. We encode a PDE problem into a problem representation using neural networks, where governing equations are represented by coefficients of a polynomial function of partial derivatives, and boundary conditions are represented by a set of point-condition pairs. We use the problem representation as an input of a neural network for predicting solutions, which enables us to efficiently predict problem-specific solutions by the forwarding process of the neural network without updating model parameters. To train our model, we minimize the expected error when adapted to a PDE problem based on the physics-informed neural network framework, by which we can evaluate the error even when solutions are unknown. We demonstrate that our proposed method outperforms existing methods in predicting solutions of PDE problems. ",
    "url": "https://arxiv.org/abs/2310.13270",
    "authors": [
      "Tomoharu Iwata",
      "Yusuke Tanaka",
      "Naonori Ueda"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13387",
    "title": "Assumption violations in causal discovery and the robustness of score  matching",
    "abstract": "When domain knowledge is limited and experimentation is restricted by ethical, financial, or time constraints, practitioners turn to observational causal discovery methods to recover the causal structure, exploiting the statistical properties of their data. Because causal discovery without further assumptions is an ill-posed problem, each algorithm comes with its own set of usually untestable assumptions, some of which are hard to meet in real datasets. Motivated by these considerations, this paper extensively benchmarks the empirical performance of recent causal discovery methods on observational i.i.d. data generated under different background conditions, allowing for violations of the critical assumptions required by each selected approach. Our experimental findings show that score matching-based methods demonstrate surprising performance in the false positive and false negative rate of the inferred graph in these challenging scenarios, and we provide theoretical insights into their performance. This work is also the first effort to benchmark the stability of causal discovery algorithms with respect to the values of their hyperparameters. Finally, we hope this paper will set a new standard for the evaluation of causal discovery methods and can serve as an accessible entry point for practitioners interested in the field, highlighting the empirical implications of different algorithm choices. ",
    "url": "https://arxiv.org/abs/2310.13387",
    "authors": [
      "Francesco Montagna",
      "Atalanti A. Mastakouri",
      "Elias Eulig",
      "Nicoletta Noceti",
      "Lorenzo Rosasco",
      "Dominik Janzing",
      "Bryon Aragam",
      "Francesco Locatello"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13402",
    "title": "Calibrating Neural Simulation-Based Inference with Differentiable  Coverage Probability",
    "abstract": "Bayesian inference allows expressing the uncertainty of posterior belief under a probabilistic model given prior information and the likelihood of the evidence. Predominantly, the likelihood function is only implicitly established by a simulator posing the need for simulation-based inference (SBI). However, the existing algorithms can yield overconfident posteriors (Hermans *et al.*, 2022) defeating the whole purpose of credibility if the uncertainty quantification is inaccurate. We propose to include a calibration term directly into the training objective of the neural model in selected amortized SBI techniques. By introducing a relaxation of the classical formulation of calibration error we enable end-to-end backpropagation. The proposed method is not tied to any particular neural model and brings moderate computational overhead compared to the profits it introduces. It is directly applicable to existing computational pipelines allowing reliable black-box posterior inference. We empirically show on six benchmark problems that the proposed method achieves competitive or better results in terms of coverage and expected posterior density than the previously existing approaches. ",
    "url": "https://arxiv.org/abs/2310.13402",
    "authors": [
      "Maciej Falkiewicz",
      "Naoya Takeishi",
      "Imahn Shekhzadeh",
      "Antoine Wehenkel",
      "Arnaud Delaunoy",
      "Gilles Louppe",
      "Alexandros Kalousis"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13430",
    "title": "HRTF Interpolation using a Spherical Neural Process Meta-Learner",
    "abstract": "Several individualization methods have recently been proposed to estimate a subject's Head-Related Transfer Function (HRTF) using convenient input modalities such as anthropometric measurements or pinnae photographs. There exists a need for adaptively correcting the estimation error committed by such methods using a few data point samples from the subject's HRTF, acquired using acoustic measurements or perceptual feedback. To this end, we introduce a Convolutional Conditional Neural Process meta-learner specialized in HRTF error interpolation. In particular, the model includes a Spherical Convolutional Neural Network component to accommodate the spherical geometry of HRTF data. It also exploits potential symmetries between the HRTF's left and right channels about the median axis. In this work, we evaluate the proposed model's performance purely on time-aligned spectrum interpolation grounds under a simplified setup where a generic population-mean HRTF forms the initial estimates prior to corrections instead of individualized ones. The trained model achieves up to 3 dB relative error reduction compared to state-of-the-art interpolation methods despite being trained using only 85 subjects. This improvement translates up to nearly a halving of the data point count required to achieve comparable accuracy, in particular from 50 to 28 points to reach an average of -20 dB relative error per interpolated feature. Moreover, we show that the trained model provides well-calibrated uncertainty estimates. Accordingly, such estimates can inform the sequential decision problem of acquiring as few correcting HRTF data points as needed to meet a desired level of HRTF individualization accuracy. ",
    "url": "https://arxiv.org/abs/2310.13430",
    "authors": [
      "Etienne Thuillier",
      "Craig Jin",
      "Vesa Välimäki"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13471",
    "title": "Neural domain alignment for spoken language recognition based on optimal  transport",
    "abstract": "Domain shift poses a significant challenge in cross-domain spoken language recognition (SLR) by reducing its effectiveness. Unsupervised domain adaptation (UDA) algorithms have been explored to address domain shifts in SLR without relying on class labels in the target domain. One successful UDA approach focuses on learning domain-invariant representations to align feature distributions between domains. However, disregarding the class structure during the learning process of domain-invariant representations can result in over-alignment, negatively impacting the classification task. To overcome this limitation, we propose an optimal transport (OT)-based UDA algorithm for a cross-domain SLR, leveraging the distribution geometry structure-aware property of OT. An OT-based discrepancy measure on a joint distribution over feature and label information is considered during domain alignment in OT-based UDA. Our previous study discovered that completely aligning the distributions between the source and target domains can introduce a negative transfer, where classes or irrelevant classes from the source domain map to a different class in the target domain during distribution alignment. This negative transfer degrades the performance of the adaptive model. To mitigate this issue, we introduce coupling-weighted partial optimal transport (POT) within our UDA framework for SLR, where soft weighting on the OT coupling based on transport cost is adaptively set during domain alignment. A cross-domain SLR task was used in the experiments to evaluate the proposed UDA. The results demonstrated that our proposed UDA algorithm significantly improved the performance over existing UDA algorithms in a cross-channel SLR task. ",
    "url": "https://arxiv.org/abs/2310.13471",
    "authors": [
      "Xugang Lu",
      "Peng Shen",
      "Yu Tsao",
      "Hisashi Kawai"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2310.13480",
    "title": "Personalized identification, prediction, and stimulation of neural  oscillations via data-driven models of epileptic network dynamics",
    "abstract": "Neural oscillations are considered to be brain-specific signatures of information processing and communication in the brain. They also reflect pathological brain activity in neurological disorders, thus offering a basis for diagnoses and forecasting. Epilepsy is one of the most common neurological disorders, characterized by abnormal synchronization and desynchronization of the oscillations in the brain. About one third of epilepsy cases are pharmacoresistant, and as such emphasize the need for novel therapy approaches, where brain stimulation appears to be a promising therapeutic option. The development of brain stimulation paradigms, however, is often based on generalized assumptions about brain dynamics, although it is known that significant differences occur between patients and brain states. We developed a framework to extract individualized predictive models of epileptic network dynamics directly from EEG data. The models are based on the dominant coherent oscillations and their dynamical coupling, thus combining an established interpretation of dynamics through neural oscillations, with accurate patient-specific features. We show that it is possible to build a direct correspondence between the models of brain-network dynamics under periodic driving, and the mechanism of neural entrainment via periodic stimulation. When our framework is applied to EEG recordings of patients in status epilepticus (a brain state of perpetual seizure activity), it yields a model-driven predictive analysis of the therapeutic performance of periodic brain stimulation. This suggests that periodic brain stimulation can drive pathological states of epileptic network dynamics towards a healthy functional brain state. ",
    "url": "https://arxiv.org/abs/2310.13480",
    "authors": [
      "Tena Dubcek",
      "Debora Ledergerber",
      "Jana Thomann",
      "Giovanna Aiello",
      "Marc Serra-Garcia",
      "Lukas Imbach",
      "Rafael Polania"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)",
      "Adaptation and Self-Organizing Systems (nlin.AO)",
      "Medical Physics (physics.med-ph)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2310.13574",
    "title": "Progressive Dual Priori Network for Generalized Breast Tumor  Segmentation",
    "abstract": "To promote the generalization ability of breast tumor segmentation models, as well as to improve the segmentation performance for breast tumors with smaller size, low-contrast amd irregular shape, we propose a progressive dual priori network (PDPNet) to segment breast tumors from dynamic enhanced magnetic resonance images (DCE-MRI) acquired at different sites. The PDPNet first cropped tumor regions with a coarse-segmentation based localization module, then the breast tumor mask was progressively refined by using the weak semantic priori and cross-scale correlation prior knowledge. To validate the effectiveness of PDPNet, we compared it with several state-of-the-art methods on multi-center datasets. The results showed that, comparing against the suboptimal method, the DSC, SEN, KAPPA and HD95 of PDPNet were improved 3.63\\%, 8.19\\%, 5.52\\%, and 3.66\\% respectively. In addition, through ablations, we demonstrated that the proposed localization module can decrease the influence of normal tissues and therefore improve the generalization ability of the model. The weak semantic priors allow focusing on tumor regions to avoid missing small tumors and low-contrast tumors. The cross-scale correlation priors are beneficial for promoting the shape-aware ability for irregual tumors. Thus integrating them in a unified framework improved the multi-center breast tumor segmentation performance. ",
    "url": "https://arxiv.org/abs/2310.13574",
    "authors": [
      "Li Wang",
      "Lihui Wang",
      "Zixiang Kuai",
      "Lei Tang",
      "Yingfeng Ou",
      "Chen Ye",
      "Yuemin Zhu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13604",
    "title": "Skin Lesion Segmentation Improved by Transformer-based Networks with  Inter-scale Dependency Modeling",
    "abstract": "Melanoma, a dangerous type of skin cancer resulting from abnormal skin cell growth, can be treated if detected early. Various approaches using Fully Convolutional Networks (FCNs) have been proposed, with the U-Net architecture being prominent To aid in its diagnosis through automatic skin lesion segmentation. However, the symmetrical U-Net model's reliance on convolutional operations hinders its ability to capture long-range dependencies crucial for accurate medical image segmentation. Several Transformer-based U-Net topologies have recently been created to overcome this limitation by replacing CNN blocks with different Transformer modules to capture local and global representations. Furthermore, the U-shaped structure is hampered by semantic gaps between the encoder and decoder. This study intends to increase the network's feature re-usability by carefully building the skip connection path. Integrating an already calculated attention affinity within the skip connection path improves the typical concatenation process utilized in the conventional skip connection path. As a result, we propose a U-shaped hierarchical Transformer-based structure for skin lesion segmentation and an Inter-scale Context Fusion (ISCF) method that uses attention correlations in each stage of the encoder to adaptively combine the contexts from each stage to mitigate semantic gaps. The findings from two skin lesion segmentation benchmarks support the ISCF module's applicability and effectiveness. The code is publicly available at \\url{https://github.com/saniaesk/skin-lesion-segmentation} ",
    "url": "https://arxiv.org/abs/2310.13604",
    "authors": [
      "Sania Eskandari",
      "Janet Lumpp",
      "Luis Sanchez Giraldo"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.13616",
    "title": "Copnumbers of periodic graphs",
    "abstract": "A periodic temporal graph $\\mathcal{G}=(G_0, G_1, \\dots, G_{p-1})^*$ is an infinite periodic sequence of graphs $G_i=(V,E_i)$ where $G=(V,\\cup_i E_i)$ is called the footprint. Recently, the arena where the Cops and Robber game is played has been extended from a graph to a periodic graph; in this case, the copnumber is also the minimum number of cops sufficient for capturing the robber. We study the connections and distinctions between the copnumber $c(\\mathcal{G})$ of a periodic graph $\\mathcal{G}$ and the copnumber $c(G)$ of its footprint $G$ and establish several facts. For instance, we show that the smallest periodic graph with $c(\\mathcal{G}) = 3$ has at most $8$ nodes; in contrast, the smallest graph $G$ with $c(G) = 3$ has $10$ nodes. We push this investigation by generating multiple examples showing how the copnumbers of a periodic graph $\\mathcal{G}$, the subgraphs $G_i$ and its footprint $G$ can be loosely tied. Based on these results, we derive upper bounds on the copnumber of a periodic graph from properties of its footprint such as its treewidth. ",
    "url": "https://arxiv.org/abs/2310.13616",
    "authors": [
      "Jean-Lou De Carufel",
      "Paola Flocchini",
      "Nicola Santoro",
      "Frédéric Simard"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2310.13628",
    "title": "SurfaceNet: Fault-Tolerant Quantum Networks with Surface Codes",
    "abstract": "Quantum networks serve as the means to transmit information, encoded in quantum bits or qubits, between quantum processors that are physically separated. Given the instability of qubits, the design of such networks is challenging, necessitating a careful balance between reliability and efficiency. Typically, quantum networks fall into two categories: those utilize quantum entanglements for quantum teleportation, and those directly transfer quantum message. In this paper, we present SurfaceNet, a quantum network in the second category that employs surface codes as logical qubits for preserving and transferring message. Our approach of using surface codes can fault-tolerantly correct both operational and photon loss errors within the network. We propose a novel one-way quantum communication procedure, designed to better integrate surface codes into our network architecture. We also propose an efficient routing protocol that optimizes resource utilization for our communication procedure. Simulation results demonstrate that SurfaceNet significantly enhances the overall communication fidelity. ",
    "url": "https://arxiv.org/abs/2310.13628",
    "authors": [
      "Tianjie Hu",
      "Jindi Wu",
      "Qun Li"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2310.13694",
    "title": "Studying speed-accuracy trade-offs in best-of-n collective  decision-making through heterogeneous mean-field modelling",
    "abstract": "To succeed in their objectives, groups of individuals must be able to make quick and accurate collective decisions on the best among alternatives with different qualities. Group-living animals aim to do that all the time. Plants and fungi are thought to do so too. Swarms of autonomous robots can also be programmed to make best-of-n decisions for solving tasks collaboratively. Ultimately, humans critically need it and so many times they should be better at it! Despite their simplicity, mathematical tractability made models like the voter model (VM) and the local majority rule model (MR) useful to describe in simple terms such collective decision-making processes. To reach a consensus, individuals change their opinion by interacting with neighbours in their social network. At least among animals and robots, options with a better quality are exchanged more often and therefore spread faster than lower-quality options, leading to the collective selection of the best option. With our work, we study the impact of individuals making errors in pooling others' opinions caused, for example, to reduce the cognitive load. Our analysis in grounded on the introduction of a model that generalises the two existing VM and MR models, showing a speed-accuracy trade-off regulated by the cognitive effort of individuals. We also investigate the impact of the interaction network topology on the collective dynamics. To do so, we extend our model and, by using the heterogeneous mean-field approach, we show that another speed-accuracy trade-off is regulated by network connectivity. An interesting result is that reduced network connectivity corresponds to an increase in collective decision accuracy ",
    "url": "https://arxiv.org/abs/2310.13694",
    "authors": [
      "Andreagiovanni Reina",
      "Thierry Njougouo",
      "Elio Tuci",
      "Timoteo Carletti"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Multiagent Systems (cs.MA)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2101.06969",
    "title": "Red Alarm for Pre-trained Models: Universal Vulnerability to  Neuron-Level Backdoor Attacks",
    "abstract": " Comments: Published in Machine Intelligence Research (this https URL) ",
    "url": "https://arxiv.org/abs/2101.06969",
    "authors": [
      "Zhengyan Zhang",
      "Guangxuan Xiao",
      "Yongwei Li",
      "Tian Lv",
      "Fanchao Qi",
      "Zhiyuan Liu",
      "Yasheng Wang",
      "Xin Jiang",
      "Maosong Sun"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.06776",
    "title": "Pruning-aware Sparse Regularization for Network Pruning",
    "abstract": " Comments: MIR 2023 ",
    "url": "https://arxiv.org/abs/2201.06776",
    "authors": [
      "Nanfei Jiang",
      "Xu Zhao",
      "Chaoyang Zhao",
      "Yongqi An",
      "Ming Tang",
      "Jinqiao Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.00934",
    "title": "Deep neural networks can stably solve high-dimensional, noisy,  non-linear inverse problems",
    "abstract": " Title: Deep neural networks can stably solve high-dimensional, noisy,  non-linear inverse problems ",
    "url": "https://arxiv.org/abs/2206.00934",
    "authors": [
      "Andrés Felipe Lerma Pineda",
      "Philipp Christian Petersen"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Analysis of PDEs (math.AP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2206.01178",
    "title": "Discretization Invariant Networks for Learning Maps between Neural  Fields",
    "abstract": " Comments: Published in Transactions on Machine Learning Research 2023 ",
    "url": "https://arxiv.org/abs/2206.01178",
    "authors": [
      "Clinton J. Wang",
      "Polina Golland"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2207.09920",
    "title": "DESCN: Deep Entire Space Cross Networks for Individual Treatment Effect  Estimation",
    "abstract": " Comments: Accepted by SIGKDD 2022 Applied Data Science Track ",
    "url": "https://arxiv.org/abs/2207.09920",
    "authors": [
      "Kailiang Zhong",
      "Fengtong Xiao",
      "Yan Ren",
      "Yaorong Liang",
      "Wenqing Yao",
      "Xiaofeng Yang",
      "Ling Cen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.07502",
    "title": "Combinatorial optimization solving by coherent Ising machines based on  spiking neural networks",
    "abstract": " Comments: 10 pages, 5 figures, accepted by Quantum ",
    "url": "https://arxiv.org/abs/2208.07502",
    "authors": [
      "Bo Lu",
      "Yong-Pan Gao",
      "Kai Wen",
      "Chuan Wang"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2209.10507",
    "title": "Gemino: Practical and Robust Neural Compression for Video Conferencing",
    "abstract": " Comments: 13 pages, 5 appendix ",
    "url": "https://arxiv.org/abs/2209.10507",
    "authors": [
      "Vibhaalakshmi Sivaraman",
      "Pantea Karimi",
      "Vedantha Venkatapathy",
      "Mehrdad Khani",
      "Sadjad Fouladi",
      "Mohammad Alizadeh",
      "Frédo Durand",
      "Vivienne Sze"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.02809",
    "title": "LAMASSU: Streaming Language-Agnostic Multilingual Speech Recognition and  Translation Using Neural Transducers",
    "abstract": " Comments: INTERSPEECH 2023 ",
    "url": "https://arxiv.org/abs/2211.02809",
    "authors": [
      "Peidong Wang",
      "Eric Sun",
      "Jian Xue",
      "Yu Wu",
      "Long Zhou",
      "Yashesh Gaur",
      "Shujie Liu",
      "Jinyu Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2211.07208",
    "title": "A Lego-Brick Approach to Coding for Network Communication",
    "abstract": " Title: A Lego-Brick Approach to Coding for Network Communication ",
    "url": "https://arxiv.org/abs/2211.07208",
    "authors": [
      "Nadim Ghaddar",
      "Shouvik Ganguly",
      "Lele Wang",
      "Young-Han Kim"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2212.00060",
    "title": "Capacity of an infinite family of networks related to the diamond  network for fixed alphabet sizes",
    "abstract": " Comments: 14 pages, 4 tables, 1 figure ",
    "url": "https://arxiv.org/abs/2212.00060",
    "authors": [
      "Sascha Kurz"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2212.03416",
    "title": "On Spectral Bias Reduction of Multi-scale Neural Networks for Regression  Problems",
    "abstract": " Title: On Spectral Bias Reduction of Multi-scale Neural Networks for Regression  Problems ",
    "url": "https://arxiv.org/abs/2212.03416",
    "authors": [
      "Bo Wang",
      "Heng Yuan",
      "Lizuo Liu",
      "Wenzhong Zhang",
      "Wei Cai"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2212.10341",
    "title": "CoCo: Coherence-Enhanced Machine-Generated Text Detection Under Data  Limitation With Contrastive Learning",
    "abstract": " Comments: Accepted by EMNLP 2023 main cofference ",
    "url": "https://arxiv.org/abs/2212.10341",
    "authors": [
      "Xiaoming Liu",
      "Zhaohan Zhang",
      "Yichen Wang",
      "Hang Pu",
      "Yu Lan",
      "Chao Shen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2212.11237",
    "title": "Not Just Pretty Pictures: Toward Interventional Data Augmentation Using  Text-to-Image Generators",
    "abstract": " Title: Not Just Pretty Pictures: Toward Interventional Data Augmentation Using  Text-to-Image Generators ",
    "url": "https://arxiv.org/abs/2212.11237",
    "authors": [
      "Jianhao Yuan",
      "Francesco Pinto",
      "Adam Davies",
      "Philip Torr"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.05294",
    "title": "Learning to Control and Coordinate Mixed Traffic Through Robot Vehicles  at Complex and Unsignalized Intersections",
    "abstract": " Comments: This paper introduces the first method to control and coordinate mixed traffic (i.e., human-driven vehicles and robot vehicles) at unsignalized intersections with both complicated topology and real-world traffic demands ",
    "url": "https://arxiv.org/abs/2301.05294",
    "authors": [
      "Dawei Wang",
      "Weizi Li",
      "Lei Zhu",
      "Jia Pan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.11604",
    "title": "A critical look at deep neural network for dynamic system modeling",
    "abstract": " Comments: The failure of NARX model modeling a noiseless LTI system is mainly due to some initilization issues with the current Matlab SYSID Toolbox. If this procedure is done purely in the Neural Network Toolbox, the situation can be improved for great extent ",
    "url": "https://arxiv.org/abs/2301.11604",
    "authors": [
      "Jinming Zhou",
      "Yucai Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2302.08397",
    "title": "Adaptive Selective Sampling for Online Prediction with Experts",
    "abstract": " Title: Adaptive Selective Sampling for Online Prediction with Experts ",
    "url": "https://arxiv.org/abs/2302.08397",
    "authors": [
      "Rui M. Castro",
      "Fredrik Hellström",
      "Tim van Erven"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.03898",
    "title": "Virtual Omnidirectional Perception for Downwash Prediction within a Team  of Nano Multirotors Flying in Close Proximity",
    "abstract": " Comments: Accepted for presentation at the 2023 IEEE International Symposium on Multi-Robot & Multi-Agent Systems ",
    "url": "https://arxiv.org/abs/2303.03898",
    "authors": [
      "Akmaral Moldagalieva",
      "Wolfgang Hönig"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2303.04749",
    "title": "Data-Driven Robust Backward Reachable Sets for Set-Theoretic Model  Predictive Control",
    "abstract": " Comments: Preprint jointly submitted to IEEE Control Systems Letters (L-CSS) and IEEE Conference on Decision and Control (CDC) ",
    "url": "https://arxiv.org/abs/2303.04749",
    "authors": [
      "Mehran Attar",
      "Walter Lucia"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2303.12570",
    "title": "RepoCoder: Repository-Level Code Completion Through Iterative Retrieval  and Generation",
    "abstract": " Comments: accepted by EMNLP 2023 main conference ",
    "url": "https://arxiv.org/abs/2303.12570",
    "authors": [
      "Fengji Zhang",
      "Bei Chen",
      "Yue Zhang",
      "Jacky Keung",
      "Jin Liu",
      "Daoguang Zan",
      "Yi Mao",
      "Jian-Guang Lou",
      "Weizhu Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Programming Languages (cs.PL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2304.02008",
    "title": "GlueStick: Robust Image Matching by Sticking Points and Lines Together",
    "abstract": " Comments: Accepted at ICCV 2023 ",
    "url": "https://arxiv.org/abs/2304.02008",
    "authors": [
      "Rémi Pautrat",
      "Iago Suárez",
      "Yifan Yu",
      "Marc Pollefeys",
      "Viktor Larsson"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03215",
    "title": "Hierarchical Graph Neural Network with Cross-Attention for Cross-Device  User Matching",
    "abstract": " Title: Hierarchical Graph Neural Network with Cross-Attention for Cross-Device  User Matching ",
    "url": "https://arxiv.org/abs/2304.03215",
    "authors": [
      "Ali Taghibakhshi",
      "Mingyuan Ma",
      "Ashwath Aithal",
      "Onur Yilmaz",
      "Haggai Maron",
      "Matthew West"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.00467",
    "title": "The iteration time and the general position number in graph convexities",
    "abstract": " Title: The iteration time and the general position number in graph convexities ",
    "url": "https://arxiv.org/abs/2305.00467",
    "authors": [
      "Julio Araujo",
      "Mitre C. Dourado",
      "Fábio Protti",
      "Rudini Sampaio"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2305.03626",
    "title": "Verifiable Learning for Robust Tree Ensembles",
    "abstract": " Comments: 19 pages, 5 figures; full version of the revised paper accepted at ACM CCS 2023 with corrected proofs of Lemma A.6 and Lemma A.7 ",
    "url": "https://arxiv.org/abs/2305.03626",
    "authors": [
      "Stefano Calzavara",
      "Lorenzo Cazzaro",
      "Giulio Ermanno Pibiri",
      "Nicola Prezza"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Logic in Computer Science (cs.LO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.03686",
    "title": "Provable Preimage Under-Approximation for Neural Networks",
    "abstract": " Title: Provable Preimage Under-Approximation for Neural Networks ",
    "url": "https://arxiv.org/abs/2305.03686",
    "authors": [
      "Xiyue Zhang",
      "Benjie Wang",
      "Marta Kwiatkowska"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2305.04812",
    "title": "Influence of External Information on Large Language Models Mirrors  Social Cognitive Patterns",
    "abstract": " Title: Influence of External Information on Large Language Models Mirrors  Social Cognitive Patterns ",
    "url": "https://arxiv.org/abs/2305.04812",
    "authors": [
      "Ning Bian",
      "Hongyu Lin",
      "Peilin Liu",
      "Yaojie Lu",
      "Chunkang Zhang",
      "Ben He",
      "Xianpei Han",
      "Le Sun"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.10613",
    "title": "Temporal Knowledge Graph Forecasting Without Knowledge Using In-Context  Learning",
    "abstract": " Comments: Accepted to EMNLP 2023 main conference. 14 pages, 4 figures, 10 tables ",
    "url": "https://arxiv.org/abs/2305.10613",
    "authors": [
      "Dong-Ho Lee",
      "Kian Ahrabian",
      "Woojeong Jin",
      "Fred Morstatter",
      "Jay Pujara"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.11596",
    "title": "Mitigating Backdoor Poisoning Attacks through the Lens of Spurious  Correlation",
    "abstract": " Comments: accepted to EMNLP2023 (main conference) ",
    "url": "https://arxiv.org/abs/2305.11596",
    "authors": [
      "Xuanli He",
      "Qiongkai Xu",
      "Jun Wang",
      "Benjamin Rubinstein",
      "Trevor Cohn"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.11707",
    "title": "What Comes Next? Evaluating Uncertainty in Neural Text Generators  Against Human Production Variability",
    "abstract": " Comments: Camera ready version for EMNLP 2023 ",
    "url": "https://arxiv.org/abs/2305.11707",
    "authors": [
      "Mario Giulianelli",
      "Joris Baan",
      "Wilker Aziz",
      "Raquel Fernández",
      "Barbara Plank"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.12074",
    "title": "DisCo: Distilled Student Models Co-training for Semi-supervised Text  Mining",
    "abstract": " Title: DisCo: Distilled Student Models Co-training for Semi-supervised Text  Mining ",
    "url": "https://arxiv.org/abs/2305.12074",
    "authors": [
      "Weifeng Jiang",
      "Qianren Mao",
      "Chenghua Lin",
      "Jianxin Li",
      "Ting Deng",
      "Weiyi Yang",
      "Zheng Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.12138",
    "title": "ChatGPT: Understanding Code Syntax and Semantics",
    "abstract": " Title: ChatGPT: Understanding Code Syntax and Semantics ",
    "url": "https://arxiv.org/abs/2305.12138",
    "authors": [
      "Wei Ma",
      "Shangqing Liu",
      "Wenhan Wang",
      "Qiang Hu",
      "Ye Liu",
      "Cen Zhang",
      "Liming Nie",
      "Yang Liu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.12947",
    "title": "ChatGPT to Replace Crowdsourcing of Paraphrases for Intent  Classification: Higher Diversity and Comparable Model Robustness",
    "abstract": " Comments: Long paper accepted to EMNLP 2023 conference main track, 17 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2305.12947",
    "authors": [
      "Jan Cegin",
      "Jakub Simko",
      "Peter Brusilovsky"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.13785",
    "title": "Enhancing Black-Box Few-Shot Text Classification with Prompt-Based Data  Augmentation",
    "abstract": " Title: Enhancing Black-Box Few-Shot Text Classification with Prompt-Based Data  Augmentation ",
    "url": "https://arxiv.org/abs/2305.13785",
    "authors": [
      "Danqing Luo",
      "Chen Zhang",
      "Jiahui Xu",
      "Bin Wang",
      "Yiming Chen",
      "Yan Zhang",
      "Haizhou Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.14642",
    "title": "Newton-Cotes Graph Neural Networks: On the Time Evolution of Dynamic  Systems",
    "abstract": " Comments: NeurIPS 2023 (spotlight) ",
    "url": "https://arxiv.org/abs/2305.14642",
    "authors": [
      "Lingbing Guo",
      "Weiqing Wang",
      "Zhuo Chen",
      "Ningyu Zhang",
      "Zequn Sun",
      "Yixuan Lai",
      "Qiang Zhang",
      "Huajun Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2305.15054",
    "title": "A Mechanistic Interpretation of Arithmetic Reasoning in Language Models  using Causal Mediation Analysis",
    "abstract": " Comments: EMNLP 2023. 18 pages, 19 figures ",
    "url": "https://arxiv.org/abs/2305.15054",
    "authors": [
      "Alessandro Stolfo",
      "Yonatan Belinkov",
      "Mrinmaya Sachan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.05031",
    "title": "Generalizable Lightweight Proxy for Robust NAS against Diverse  Perturbations",
    "abstract": " Comments: NeurIPS 2023, Code is available at this https URL ",
    "url": "https://arxiv.org/abs/2306.05031",
    "authors": [
      "Hyeonjeong Ha",
      "Minseon Kim",
      "Sung Ju Hwang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.07263",
    "title": "Enlarging Stability Region of Urban Networks with Imminent Supply  Prediction",
    "abstract": " Title: Enlarging Stability Region of Urban Networks with Imminent Supply  Prediction ",
    "url": "https://arxiv.org/abs/2306.07263",
    "authors": [
      "Dianchao Lin",
      "Li Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2306.12802",
    "title": "Otter-Knowledge: benchmarks of multimodal knowledge graph representation  learning from different sources for drug discovery",
    "abstract": " Title: Otter-Knowledge: benchmarks of multimodal knowledge graph representation  learning from different sources for drug discovery ",
    "url": "https://arxiv.org/abs/2306.12802",
    "authors": [
      "Hoang Thanh Lam",
      "Marco Luca Sbodio",
      "Marcos Martínez Galindo",
      "Mykhaylo Zayats",
      "Raúl Fernández-Díaz",
      "Víctor Valls",
      "Gabriele Picco",
      "Cesar Berrospi Ramis",
      "Vanessa López"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2306.15228",
    "title": "IIFL: Implicit Interactive Fleet Learning from Heterogeneous Human  Supervisors",
    "abstract": " Comments: CoRL 2023 ",
    "url": "https://arxiv.org/abs/2306.15228",
    "authors": [
      "Gaurav Datta",
      "Ryan Hoque",
      "Anrui Gu",
      "Eugen Solowjow",
      "Ken Goldberg"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15864",
    "title": "What Went Wrong? Closing the Sim-to-Real Gap via Differentiable Causal  Discovery",
    "abstract": " Title: What Went Wrong? Closing the Sim-to-Real Gap via Differentiable Causal  Discovery ",
    "url": "https://arxiv.org/abs/2306.15864",
    "authors": [
      "Peide Huang",
      "Xilun Zhang",
      "Ziang Cao",
      "Shiqi Liu",
      "Mengdi Xu",
      "Wenhao Ding",
      "Jonathan Francis",
      "Bingqing Chen",
      "Ding Zhao"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2307.07847",
    "title": "Enabling Real-time Neural Recovery for Cloud Gaming on Mobile Devices",
    "abstract": " Title: Enabling Real-time Neural Recovery for Cloud Gaming on Mobile Devices ",
    "url": "https://arxiv.org/abs/2307.07847",
    "authors": [
      "Zhaoyuan He",
      "Yifan Yang",
      "Shuozhe Li",
      "Diyuan Dai",
      "Lili Qiu",
      "Yuqing Yang"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2307.10069",
    "title": "Robust constrained nonlinear Model Predictive Control with Gated  Recurrent Unit model -- Extended version",
    "abstract": " Comments: This work has been submitted to Elsevier for possible pubblication. Copyright may be tranferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2307.10069",
    "authors": [
      "Irene Schimperna",
      "Lalo Magni"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2307.11224",
    "title": "Jina Embeddings: A Novel Set of High-Performance Sentence Embedding  Models",
    "abstract": " Comments: 9 pages, 2 page appendix ",
    "url": "https://arxiv.org/abs/2307.11224",
    "authors": [
      "Michael Günther",
      "Louis Milliken",
      "Jonathan Geuter",
      "Georgios Mastrapas",
      "Bo Wang",
      "Han Xiao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.14502",
    "title": "The Effect of Spoken Language on Speech Enhancement using  Self-Supervised Speech Representation Loss Functions",
    "abstract": " Comments: Accepted at WASPAA 2023 ",
    "url": "https://arxiv.org/abs/2307.14502",
    "authors": [
      "George Close",
      "Thomas Hain",
      "Stefan Goetze"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2307.16605",
    "title": "VPP: Efficient Conditional 3D Generation via Voxel-Point Progressive  Representation",
    "abstract": " Comments: Accepted at NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2307.16605",
    "authors": [
      "Zekun Qi",
      "Muzhou Yu",
      "Runpei Dong",
      "Kaisheng Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.03723",
    "title": "Dimensionality Reduction for Improving Out-of-Distribution Detection in  Medical Image Segmentation",
    "abstract": " Comments: This preprint has not undergone peer review or any post-submission improvements or corrections. The Version of Record of this contribution is published in the proceedings of UNSURE 2023, Lecture Notes in Computer Science, vol 14291, and is available online at this https URL ",
    "url": "https://arxiv.org/abs/2308.03723",
    "authors": [
      "McKell Woodland",
      "Nihil Patel",
      "Mais Al Taie",
      "Joshua P. Yung",
      "Tucker J. Netherton",
      "Ankit B. Patel",
      "Kristy K. Brock"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.06838",
    "title": "Generalizing Topological Graph Neural Networks with Paths",
    "abstract": " Title: Generalizing Topological Graph Neural Networks with Paths ",
    "url": "https://arxiv.org/abs/2308.06838",
    "authors": [
      "Quang Truong",
      "Peter Chin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.08963",
    "title": "CONVERT:Contrastive Graph Clustering with Reliable Augmentation",
    "abstract": " Title: CONVERT:Contrastive Graph Clustering with Reliable Augmentation ",
    "url": "https://arxiv.org/abs/2308.08963",
    "authors": [
      "Xihong Yang",
      "Cheng Tan",
      "Yue Liu",
      "Ke Liang",
      "Siwei Wang",
      "Sihang Zhou",
      "Jun Xia",
      "Stan Z. Li",
      "Xinwang Liu",
      "En Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.03374",
    "title": "Physics Informed Neural Networks for Modeling of 3D Flow-Thermal  Problems",
    "abstract": " Title: Physics Informed Neural Networks for Modeling of 3D Flow-Thermal  Problems ",
    "url": "https://arxiv.org/abs/2309.03374",
    "authors": [
      "Saakaar Bhatnagar",
      "Andrew Comerford",
      "Araz Banaeizadeh"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2309.07871",
    "title": "Gradient Dynamics in Linear Quadratic Network Games with Time-Varying  Connectivity and Population Fluctuation",
    "abstract": " Comments: 8 pages, 2 figures, Extended version of the original paper to appear in the proceedings of the 2023 IEEE Conference on Decision and Control (CDC). Updated numerical example ",
    "url": "https://arxiv.org/abs/2309.07871",
    "authors": [
      "Feras Al Taha",
      "Kiran Rokade",
      "Francesca Parise"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2309.08420",
    "title": "FedDCSR: Federated Cross-domain Sequential Recommendation via  Disentangled Representation Learning",
    "abstract": " Title: FedDCSR: Federated Cross-domain Sequential Recommendation via  Disentangled Representation Learning ",
    "url": "https://arxiv.org/abs/2309.08420",
    "authors": [
      "Hongyu Zhang",
      "Dongyi Zheng",
      "Xu Yang",
      "Jiyuan Feng",
      "Qing Liao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2309.10532",
    "title": "A Cognitively-Inspired Neural Architecture for Visual Abstract Reasoning  Using Contrastive Perceptual and Conceptual Processing",
    "abstract": " Title: A Cognitively-Inspired Neural Architecture for Visual Abstract Reasoning  Using Contrastive Perceptual and Conceptual Processing ",
    "url": "https://arxiv.org/abs/2309.10532",
    "authors": [
      "Yuan Yang",
      "Deepayan Sanyal",
      "James Ainooson",
      "Joel Michelson",
      "Effat Farhana",
      "Maithilee Kunda"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.13609",
    "title": "Vulnerabilities in Video Quality Assessment Models: The Challenge of  Adversarial Attacks",
    "abstract": " Title: Vulnerabilities in Video Quality Assessment Models: The Challenge of  Adversarial Attacks ",
    "url": "https://arxiv.org/abs/2309.13609",
    "authors": [
      "Ao-Xiang Zhang",
      "Yu Ran",
      "Weixuan Tang",
      "Yuan-Gen Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2309.15302",
    "title": "STERLING: Self-Supervised Terrain Representation Learning from  Unconstrained Robot Experience",
    "abstract": " Comments: Project website: this https URL ",
    "url": "https://arxiv.org/abs/2309.15302",
    "authors": [
      "Haresh Karnan",
      "Elvin Yang",
      "Daniel Farkash",
      "Garrett Warnell",
      "Joydeep Biswas",
      "Peter Stone"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.05202",
    "title": "Enhancing Cross-Dataset Performance of Distracted Driving Detection With  Score-Softmax Classifier",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2310.05202",
    "authors": [
      "Cong Duan",
      "Zixuan Liu",
      "Jiahao Xia",
      "Minghai Zhang",
      "Jiacai Liao",
      "Libo Cao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.08045",
    "title": "Model Predictive Inferential Control of Neural State-Space Models for  Autonomous Vehicle Motion Planning",
    "abstract": " Title: Model Predictive Inferential Control of Neural State-Space Models for  Autonomous Vehicle Motion Planning ",
    "url": "https://arxiv.org/abs/2310.08045",
    "authors": [
      "Iman Askari",
      "Xumein Tu",
      "Shen Zeng",
      "Huazhen Fang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.09503",
    "title": "JM3D & JM3D-LLM: Elevating 3D Representation with Joint Multi-modal Cues",
    "abstract": " Comments: 16 pages, 4 figures, 10 tables ",
    "url": "https://arxiv.org/abs/2310.09503",
    "authors": [
      "Jiayi Ji",
      "Haowei Wang",
      "Changli Wu",
      "Yiwei Ma",
      "Xiaoshuai Sun",
      "Rongrong Ji"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.10092",
    "title": "Label Differential Privacy via Aggregation",
    "abstract": " Title: Label Differential Privacy via Aggregation ",
    "url": "https://arxiv.org/abs/2310.10092",
    "authors": [
      "Anand Brahmbhatt",
      "Rishi Saket",
      "Shreyas Havaldar",
      "Anshul Nasery",
      "Aravindan Raghuveer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.10321",
    "title": "Hamming Encoder: Mining Discriminative k-mers for Discrete Sequence  Classification",
    "abstract": " Comments: 12 pages ",
    "url": "https://arxiv.org/abs/2310.10321",
    "authors": [
      "Junjie Dong",
      "Mudi Jiang",
      "Lianyu Hu",
      "Zengyou He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10404",
    "title": "LLM4SGG: Large Language Model for Weakly Supervised Scene Graph  Generation",
    "abstract": " Comments: 24 pages, Preprint ",
    "url": "https://arxiv.org/abs/2310.10404",
    "authors": [
      "Kibum Kim",
      "Kanghoon Yoon",
      "Jaehyeong Jeon",
      "Yeonjun In",
      "Jinyoung Moon",
      "Donghyun Kim",
      "Chanyoung Park"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.11710",
    "title": "Learning Co-Speech Gesture for Multimodal Aphasia Type Detection",
    "abstract": " Comments: EMNLP 2023 accepted ",
    "url": "https://arxiv.org/abs/2310.11710",
    "authors": [
      "Daeun Lee",
      "Sejung Son",
      "Hyolim Jeon",
      "Seungbae Kim",
      "Jinyoung Han"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.11755",
    "title": "RGM: A Robust Generalist Matching Model",
    "abstract": " Comments: 17 pages. Code is available at: this https URL ",
    "url": "https://arxiv.org/abs/2310.11755",
    "authors": [
      "Songyan Zhang",
      "Xinyu Sun",
      "Hao Chen",
      "Bo Li",
      "Chunhua Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.12632",
    "title": "Towards a Deep Learning-based Online Quality Prediction System for  Welding Processes",
    "abstract": " Comments: Accepted for CIRP CMS '23 ",
    "url": "https://arxiv.org/abs/2310.12632",
    "authors": [
      "Yannik Hahn",
      "Robert Maack",
      "Guido Buchholz",
      "Marion Purrio",
      "Matthias Angerhausen",
      "Hasan Tercan",
      "Tobias Meisen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.12737",
    "title": "A new complex variable solution on noncircular shallow tunnelling with  reasonable far-field displacement",
    "abstract": " Comments: 38 pages, 10 figures. arXiv admin note: text overlap with arXiv:2308.03994 (already rewritten to minimize the text overlap) ",
    "url": "https://arxiv.org/abs/2310.12737",
    "authors": [
      "Luo-bin Lin",
      "Fu-quan Chen",
      "Shang-shun Lin"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Complex Variables (math.CV)"
    ]
  },
  {
    "id": "arXiv:2310.12787",
    "title": "DT/MARS-CycleGAN: Improved Object Detection for MARS Phenotyping Robot",
    "abstract": " Title: DT/MARS-CycleGAN: Improved Object Detection for MARS Phenotyping Robot ",
    "url": "https://arxiv.org/abs/2310.12787",
    "authors": [
      "David Liu",
      "Zhengkun Li",
      "Zihao Wu",
      "Changying Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]