[
  {
    "id": "arXiv:2203.04298",
    "title": "CaSS: A Channel-aware Self-supervised Representation Learning Framework  for Multivariate Time Series Classification",
    "abstract": "Self-supervised representation learning of Multivariate Time Series (MTS) is a challenging task and attracts increasing research interests in recent years. Many previous works focus on the pretext task of self-supervised learning and usually neglect the complex problem of MTS encoding, leading to unpromising results. In this paper, we tackle this challenge from two aspects: encoder and pretext task, and propose a unified channel-aware self-supervised learning framework CaSS. Specifically, we first design a new Transformer-based encoder Channel-aware Transformer (CaT) to capture the complex relationships between different time channels of MTS. Second, we combine two novel pretext tasks Next Trend Prediction (NTP) and Contextual Similarity (CS) for the self-supervised representation learning with our proposed encoder. Extensive experiments are conducted on several commonly used benchmark datasets. The experimental results show that our framework achieves new state-of-the-art comparing with previous self-supervised MTS representation learning methods (up to +7.70\\% improvement on LSST dataset) and can be well applied to the downstream MTS classification. ",
    "url": "https://arxiv.org/abs/2203.04298",
    "authors": [
      "Yijiang Chen",
      "Xiangdong Zhou",
      "Zhen Xing",
      "Zhidan Liu",
      "Minyang Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.04311",
    "title": "Cluster Head Detection for Hierarchical UAV Swarm With Graph  Self-supervised Learning",
    "abstract": "In this paper, we study the cluster head detection problem of a two-level unmanned aerial vehicle (UAV) swarm network (USNET) with multiple UAV clusters, where the inherent follow strategy (IFS) of low-level follower UAVs (FUAVs) with respect to high-level cluster head UAVs (HUAVs) is unknown. We first propose a graph attention self-supervised learning algorithm (GASSL) to detect the HUAVs of a single UAV cluster, where the GASSL can fit the IFS at the same time. Then, to detect the HUAVs in the USNET with multiple UAV clusters, we develop a multi-cluster graph attention self-supervised learning algorithm (MC-GASSL) based on the GASSL. The MC-GASSL clusters the USNET with a gated recurrent unit (GRU)-based metric learning scheme and finds the HUAVs in each cluster with GASSL. Numerical results show that the GASSL can detect the HUAVs in single UAV clusters obeying various kinds of IFSs with over 98% average accuracy. The simulation results also show that the clustering purity of the USNET with MC-GASSL exceeds that with traditional clustering algorithms by at least 10% average. Furthermore, the MC-GASSL can efficiently detect all the HUAVs in USNETs with various IFSs and cluster numbers with low detection redundancies. ",
    "url": "https://arxiv.org/abs/2203.04311",
    "authors": [
      "Zhiyu Mou",
      "Jun Liu",
      "Xiang Yun",
      "Feifei Gao",
      "Qihui Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.04347",
    "title": "An accurate IoT Intrusion Detection Framework using Apache Spark",
    "abstract": "The internet has caused tremendous changes since its appearance in the 1980s, and now, the Internet of Things (IoT) seems to be doing the same. The potential of IoT has made it the center of attention for many people, but, where some see an opportunity to contribute, others may see IoT networks as a target to be exploited. The high number of IoT devices makes them the perfect setup for staging denial-of-service attacks (DoS) that can have devastating consequences. This renders the need for cybersecurity measures such as intrusion detection systems (IDSs) evident. The aim of this paper is to build an IDS using the big data platform, Apache Spark. Apache Spark was used along with its ML library (MLlib) and the BoT-IoT dataset. The IDS was then tested and evaluated based on F-Measure (f1), as was the standard when evaluating imbalanced data. Two rounds of tests were performed, a partial dataset for minimizing bias, and the full BoT-IoT dataset for exploring big data and ML capabilities in a security setting. For the partial dataset, the Random Forest algorithm had the highest performance for binary classification at an average f1 measure of 99.7%, as well as 99.6% for main category classification, and an 88.5% f1 measure for sub category classification. As for the complete dataset, the Decision Tree algorithm scored the highest f1 measures for all conducted tests; 97.9% for binary classification, 79% for main category classification, and 77% for sub category classification. ",
    "url": "https://arxiv.org/abs/2203.04347",
    "authors": [
      "Mohamed Abushwereb",
      "Mouhammd Alkasassbeh",
      "Mohammad Almseidin",
      "Muhannad Mustafa"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2203.04353",
    "title": "Unrolled Primal-Dual Networks for Lensless Cameras",
    "abstract": "Conventional image reconstruction models for lensless cameras often assume that each measurement results from convolving a given scene with a single experimentally measured point-spread function. These image reconstruction models fall short in simulating lensless cameras truthfully as these models are not sophisticated enough to account for optical aberrations or scenes with depth variations. Our work shows that learning a supervised primal-dual reconstruction method results in image quality matching state of the art in the literature without demanding a large network capacity. This improvement stems from our primary finding that embedding learnable forward and adjoint models in a learned primal-dual optimization framework can even improve the quality of reconstructed images (+5dB PSNR) compared to works that do not correct for the model error. In addition, we built a proof-of-concept lensless camera prototype that uses a pseudo-random phase mask to demonstrate our point. Finally, we share the extensive evaluation of our learned model based on an open dataset and a dataset from our proof-of-concept lensless camera prototype. ",
    "url": "https://arxiv.org/abs/2203.04353",
    "authors": [
      "Oliver Kingshott",
      "Nick Antipa",
      "Emrah Bostan",
      "Kaan Akşit"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04356",
    "title": "Which side are you on? Insider-Outsider classification in  conspiracy-theoretic social media",
    "abstract": "Social media is a breeding ground for threat narratives and related conspiracy theories. In these, an outside group threatens the integrity of an inside group, leading to the emergence of sharply defined group identities: Insiders -- agents with whom the authors identify and Outsiders -- agents who threaten the insiders. Inferring the members of these groups constitutes a challenging new NLP task: (i) Information is distributed over many poorly-constructed posts; (ii) Threats and threat agents are highly contextual, with the same post potentially having multiple agents assigned to membership in either group; (iii) An agent's identity is often implicit and transitive; and (iv) Phrases used to imply Outsider status often do not follow common negative sentiment patterns. To address these challenges, we define a novel Insider-Outsider classification task. Because we are not aware of any appropriate existing datasets or attendant models, we introduce a labeled dataset (CT5K) and design a model (NP2IO) to address this task. NP2IO leverages pretrained language modeling to classify Insiders and Outsiders. NP2IO is shown to be robust, generalizing to noun phrases not seen during training, and exceeding the performance of non-trivial baseline models by $20\\%$. ",
    "url": "https://arxiv.org/abs/2203.04356",
    "authors": [
      "Pavan Holur",
      "Tianyi Wang",
      "Shadi Shahsavari",
      "Timothy Tangherlini",
      "Vwani Roychowdhury"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.04368",
    "title": "Deep Learning Neural Networks for Emotion Classification from Text:  Enhanced Leaky Rectified Linear Unit Activation and Weighted Loss",
    "abstract": "Accurate emotion classification for online reviews is vital for business organizations to gain deeper insights into markets. Although deep learning has been successfully implemented in this area, accuracy and processing time are still major problems preventing it from reaching its full potential. This paper proposes an Enhanced Leaky Rectified Linear Unit activation and Weighted Loss (ELReLUWL) algorithm for enhanced text emotion classification and faster parameter convergence speed. This algorithm includes the definition of the inflection point and the slope for inputs on the left side of the inflection point to avoid gradient saturation. It also considers the weight of samples belonging to each class to compensate for the influence of data imbalance. Convolutional Neural Network (CNN) combined with the proposed algorithm to increase the classification accuracy and decrease the processing time by eliminating the gradient saturation problem and minimizing the negative effect of data imbalance, demonstrated on a binary sentiment problem. The results show that the proposed solution achieves better classification performance in different data scenarios and different review types. The proposed model takes less convergence time to achieve model optimization with seven epochs against the current convergence time of 11.5 epochs on average. The proposed solution improves accuracy and reduces the processing time of text emotion classification. The solution provides an average class accuracy of 96.63% against a current average accuracy of 91.56%. It also provides a processing time of 23.3 milliseconds compared to the current average processing time of 33.2 milliseconds. Finally, this study solves the issues of gradient saturation and data imbalance. It enhances overall average class accuracy and decreases processing time. ",
    "url": "https://arxiv.org/abs/2203.04368",
    "authors": [
      "Hui Yang",
      "Abeer Alsadoon",
      "P.W.C. Prasad",
      "Thair Al-Dala'in",
      "Tarik A. Rashid",
      "Angelika Maag",
      "Omar Hisham Alsadoon"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2203.04374",
    "title": "Code Red: The Business Impact of Code Quality -- A Quantitative Study of  39 Proprietary Production Codebases",
    "abstract": "Code quality remains an abstract concept that fails to get traction at the business level. Consequently, software companies keep trading code quality for time-to-market and new features. The resulting technical debt is estimated to waste up to 42% of developers' time. At the same time, there is a global shortage of software developers, meaning that developer productivity is key to software businesses. Our overall mission is to make code quality a business concern, not just a technical aspect. Our first goal is to understand how code quality impacts 1) the number of reported defects, 2) the time to resolve issues, and 3) the predictability of resolving issues on time. We analyze 39 proprietary production codebases from a variety of domains using the CodeScene tool based on a combination of source code analysis, version-control mining, and issue information from Jira. By analyzing activity in 30,737 files, we find that low quality code contains 15 times more defects than high quality code. Furthermore, resolving issues in low quality code takes on average 124% more time in development. Finally, we report that issue resolutions in low quality code involve higher uncertainty manifested as 9 times longer maximum cycle times. This study provides evidence that code quality cannot be dismissed as a technical concern. With 15 times fewer defects, twice the development speed, and substantially more predictable issue resolution times, the business advantage of high quality code should be unmistakably clear. ",
    "url": "https://arxiv.org/abs/2203.04374",
    "authors": [
      "Adam Tornhill",
      "Markus Borg"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2203.04376",
    "title": "Unsupervised Data Splitting Scheme for Federated Edge Learning in IoT  Networks",
    "abstract": "Federated Edge Learning (FEEL) is a promising distributed learning technique that aims to train a shared global model while reducing communication costs and promoting users' privacy. However, the training process might significantly occupy a long time due to the nature of the used data for training, which leads to higher energy consumption and therefore impacts the model convergence. To tackle this issue, we propose a data-driven federated edge learning scheme that tends to select suitable participating nodes based on quality data and energy. First, we design an unsupervised data-aware splitting scheme that partitions the node's local data into diverse samples used for training. We incorporate a similarity index to select quality data that enhances the training performance. Then, we propose a heuristic participating nodes selection scheme to minimize the communication and computation energy consumption, as well as the amount of communication rounds. The obtained results show that the proposed scheme substantially outperforms the vanilla FEEL in terms of energy consumption and the number of communication rounds. ",
    "url": "https://arxiv.org/abs/2203.04376",
    "authors": [
      "Boubakr Nour",
      "Soumaya Cherkaoui"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2203.04378",
    "title": "Logic-based AI for Interpretable Board Game Winner Prediction with  Tsetlin Machine",
    "abstract": "Hex is a turn-based two-player connection game with a high branching factor, making the game arbitrarily complex with increasing board sizes. As such, top-performing algorithms for playing Hex rely on accurate evaluation of board positions using neural networks. However, the limited interpretability of neural networks is problematic when the user wants to understand the reasoning behind the predictions made. In this paper, we propose to use propositional logic expressions to describe winning and losing board game positions, facilitating precise visual interpretation. We employ a Tsetlin Machine (TM) to learn these expressions from previously played games, describing where pieces must be located or not located for a board position to be strong. Extensive experiments on $6\\times6$ boards compare our TM-based solution with popular machine learning algorithms like XGBoost, InterpretML, decision trees, and neural networks, considering various board configurations with $2$ to $22$ moves played. On average, the TM testing accuracy is $92.1\\%$, outperforming all the other evaluated algorithms. We further demonstrate the global interpretation of the logical expressions and map them down to particular board game configurations to investigate local interpretability. We believe the resulting interpretability establishes building blocks for accurate assistive AI and human-AI collaboration, also for more complex prediction tasks. ",
    "url": "https://arxiv.org/abs/2203.04378",
    "authors": [
      "Charul Giri",
      "Ole-Christoffer Granmo",
      "Herke van Hoof",
      "Christian D. Blakely"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04381",
    "title": "Formation Control of Nonlinear Multi-Agent Systems Using Three-Layer  Neural Networks",
    "abstract": "This paper considers a leader-following formation control problem for heterogeneous, second-order, uncertain, input-affine, nonlinear multi-agent systems modeled by a directed graph. A tunable, three-layer neural network (NN) is proposed with an input layer, two hidden layers, and an output layer to approximate an unknown nonlinearity. Unlike commonly used trial and error efforts to select the number of neurons in a conventional NN, in this case an \\textit{a priori} knowledge allows one to set up the number of neurons in each layer. The NN weights tuning laws are derived using the Lyapunov theory. The leader-following and formation control problems are addressed by a robust integral of the sign of the error (RISE) feedback and a NN-based control. The RISE feedback term compensates for unknown leader dynamics and the unknown, bounded disturbance in the agent error dynamics. The NN-based term compensates for the unknown nonlinearity in the dynamics of multi-agent systems, and semi-global asymptotic tracking results are rigorously proven using the Lyapunov stability theory. The results of the paper are compared with two previous results to evaluate the efficiency and performance of the proposed method. ",
    "url": "https://arxiv.org/abs/2203.04381",
    "authors": [
      "Kiarash Aryankia",
      "Rastko R. Selmic"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.04383",
    "title": "A Novel Deep Learning Model for Hotel Demand and Revenue Prediction amid  COVID-19",
    "abstract": "The COVID-19 pandemic has significantly impacted the tourism and hospitality sector. Public policies such as travel restrictions and stay-at-home orders had significantly affected tourist activities and service businesses' operations and profitability. To this end, it is essential to develop an interpretable forecast model that supports managerial and organizational decision-making. We developed DemandNet, a novel deep learning framework for predicting time series data under the influence of the COVID-19 pandemic. The framework starts by selecting the top static and dynamic features embedded in the time series data. Then, it includes a nonlinear model which can provide interpretable insight into the previously seen data. Lastly, a prediction model is developed to leverage the above characteristics to make robust long-term forecasts. We evaluated the framework using daily hotel demand and revenue data from eight cities in the US. Our findings reveal that DemandNet outperforms the state-of-art models and can accurately predict the impact of the COVID-19 pandemic on hotel demand and revenues. ",
    "url": "https://arxiv.org/abs/2203.04383",
    "authors": [
      "Ashkan Farhangi",
      "Arthur Huang",
      "Zhishan Guo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2203.04405",
    "title": "Art-Attack: Black-Box Adversarial Attack via Evolutionary Art",
    "abstract": "Deep neural networks (DNNs) have achieved state-of-the-art performance in many tasks but have shown extreme vulnerabilities to attacks generated by adversarial examples. Many works go with a white-box attack that assumes total access to the targeted model including its architecture and gradients. A more realistic assumption is the black-box scenario where an attacker only has access to the targeted model by querying some input and observing its predicted class probabilities. Different from most prevalent black-box attacks that make use of substitute models or gradient estimation, this paper proposes a gradient-free attack by using a concept of evolutionary art to generate adversarial examples that iteratively evolves a set of overlapping transparent shapes. To evaluate the effectiveness of our proposed method, we attack three state-of-the-art image classification models trained on the CIFAR-10 dataset in a targeted manner. We conduct a parameter study outlining the impact the number and type of shapes have on the proposed attack's performance. In comparison to state-of-the-art black-box attacks, our attack is more effective at generating adversarial examples and achieves a higher attack success rate on all three baseline models. ",
    "url": "https://arxiv.org/abs/2203.04405",
    "authors": [
      "Phoenix Williams",
      "Ke Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2203.04406",
    "title": "Routing with Privacy for Drone Package Delivery Systems",
    "abstract": "Unmanned aerial vehicles (UAVs), or drones, are increasingly being used to deliver goods from vendors to customers. To safely conduct these operations at scale, drones are required to broadcast position information as codified in remote identification (remote ID) regulations. However, location broadcast of package delivery drones introduces a privacy risk for customers using these delivery services: Third-party observers may leverage broadcast drone trajectories to link customers with their purchases, potentially resulting in a wide range of privacy risks. We propose a probabilistic definition of privacy risk based on the likelihood of associating a customer to a vendor given a package delivery route. Next, we quantify these risks, enabling drone operators to assess privacy risks when planning delivery routes. We then evaluate the impacts of various factors (e.g., drone capacity) on privacy and consider the trade-offs between privacy and delivery wait times. Finally, we propose heuristics for generating routes with privacy guarantees to avoid exhaustive enumeration of all possible routes and evaluate their performance on several realistic delivery scenarios. ",
    "url": "https://arxiv.org/abs/2203.04406",
    "authors": [
      "Geoffrey Ding",
      "Alex Berke",
      "Karthik Gopalakrishnan",
      "Kwassi H. Degue",
      "Hamsa Balakrishnan",
      "Max Z. Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.04412",
    "title": "ImageNet-Patch: A Dataset for Benchmarking Machine Learning Robustness  against Adversarial Patches",
    "abstract": "Adversarial patches are optimized contiguous pixel blocks in an input image that cause a machine-learning model to misclassify it. However, their optimization is computationally demanding, and requires careful hyperparameter tuning, potentially leading to suboptimal robustness evaluations. To overcome these issues, we propose ImageNet-Patch, a dataset to benchmark machine-learning models against adversarial patches. It consists of a set of patches, optimized to generalize across different models, and readily applicable to ImageNet data after preprocessing them with affine transformations. This process enables an approximate yet faster robustness evaluation, leveraging the transferability of adversarial perturbations. We showcase the usefulness of this dataset by testing the effectiveness of the computed patches against 127 models. We conclude by discussing how our dataset could be used as a benchmark for robustness, and how our methodology can be generalized to other domains. We open source our dataset and evaluation code at https://github.com/pralab/ImageNet-Patch. ",
    "url": "https://arxiv.org/abs/2203.04412",
    "authors": [
      "Maura Pintor",
      "Daniele Angioni",
      "Angelo Sotgiu",
      "Luca Demetrio",
      "Ambra Demontis",
      "Battista Biggio",
      "Fabio Roli"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04413",
    "title": "Score matching enables causal discovery of nonlinear additive noise  models",
    "abstract": "This paper demonstrates how to recover causal graphs from the score of the data distribution in non-linear additive (Gaussian) noise models. Using score matching algorithms as a building block, we show how to design a new generation of scalable causal discovery methods. To showcase our approach, we also propose a new efficient method for approximating the score's Jacobian, enabling to recover the causal graph. Empirically, we find that the new algorithm, called SCORE, is competitive with state-of-the-art causal discovery methods while being significantly faster. ",
    "url": "https://arxiv.org/abs/2203.04413",
    "authors": [
      "Paul Rolland",
      "Volkan Cevher",
      "Matthäus Kleindessner",
      "Chris Russel",
      "Bernhard Schölkopf",
      "Dominik Janzing",
      "Francesco Locatello"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04419",
    "title": "Survival Prediction of Brain Cancer with Incomplete Radiology,  Pathology, Genomics, and Demographic Data",
    "abstract": "Integrating cross-department multi-modal data (e.g., radiological, pathological, genomic, and clinical data) is ubiquitous in brain cancer diagnosis and survival prediction. To date, such an integration is typically conducted by human physicians (and panels of experts), which can be subjective and semi-quantitative. Recent advances in multi-modal deep learning, however, have opened a door to leverage such a process to a more objective and quantitative manner. Unfortunately, the prior arts of using four modalities on brain cancer survival prediction are limited by a \"complete modalities\" setting (i.e., with all modalities available). Thus, there are still open questions on how to effectively predict brain cancer survival from the incomplete radiological, pathological, genomic, and demographic data (e.g., one or more modalities might not be collected for a patient). For instance, should we use both complete and incomplete data, and more importantly, how to use those data? To answer the preceding questions, we generalize the multi-modal learning on cross-department multi-modal data to a missing data setting. Our contribution is three-fold: 1) We introduce optimal multi-modal learning with missing data (MMD) pipeline with optimized hardware consumption and computational efficiency; 2) We extend multi-modal learning on radiological, pathological, genomic, and demographic data into missing data scenarios; 3) a large-scale public dataset (with 962 patients) is collected to systematically evaluate glioma tumor survival prediction using four modalities. The proposed method improved the C-index of survival prediction from 0.7624 to 0.8053. ",
    "url": "https://arxiv.org/abs/2203.04419",
    "authors": [
      "Can Cui",
      "Han Liu",
      "Quan Liu",
      "Ruining Deng",
      "Zuhayr Asad",
      "Yaohong WangShilin Zhao",
      "Haichun Yang",
      "Bennett A. Landman",
      "Yuankai Huo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04421",
    "title": "Leveraging Smooth Attention Prior for Multi-Agent Trajectory Prediction",
    "abstract": "Multi-agent interactions are important to model for forecasting other agents' behaviors and trajectories. At a certain time, to forecast a reasonable future trajectory, each agent needs to pay attention to the interactions with only a small group of most relevant agents instead of unnecessarily paying attention to all the other agents. However, existing attention modeling works ignore that human attention in driving does not change rapidly, and may introduce fluctuating attention across time steps. In this paper, we formulate an attention model for multi-agent interactions based on a total variation temporal smoothness prior and propose a trajectory prediction architecture that leverages the knowledge of these attended interactions. We demonstrate how the total variation attention prior along with the new sequence prediction loss terms leads to smoother attention and more sample-efficient learning of multi-agent trajectory prediction, and show its advantages in terms of prediction accuracy by comparing it with the state-of-the-art approaches on both synthetic and naturalistic driving data. We demonstrate the performance of our algorithm for trajectory prediction on the INTERACTION dataset on our website. ",
    "url": "https://arxiv.org/abs/2203.04421",
    "authors": [
      "Zhangjie Cao",
      "Erdem Bıyık",
      "Guy Rosman",
      "Dorsa Sadigh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.04445",
    "title": "Self-Supervision, Remote Sensing and Abstraction: Representation  Learning Across 3 Million Locations",
    "abstract": "Self-supervision based deep learning classification approaches have received considerable attention in academic literature. However, the performance of such methods on remote sensing imagery domains remains under-explored. In this work, we explore contrastive representation learning methods on the task of imagery-based city classification, an important problem in urban computing. We use satellite and map imagery across 2 domains, 3 million locations and more than 1500 cities. We show that self-supervised methods can build a generalizable representation from as few as 200 cities, with representations achieving over 95\\% accuracy in unseen cities with minimal additional training. We also find that the performance discrepancy of such methods, when compared to supervised methods, induced by the domain discrepancy between natural imagery and abstract imagery is significant for remote sensing imagery. We compare all analysis against existing supervised models from academic literature and open-source our models for broader usage and further criticism. ",
    "url": "https://arxiv.org/abs/2203.04445",
    "authors": [
      "Sachith Seneviratne",
      "Kerry A. Nice",
      "Jasper S. Wijnands",
      "Mark Stevenson",
      "Jason Thompson"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04446",
    "title": "Tune your Place Recognition: Self-Supervised Domain Calibration via  Robust SLAM",
    "abstract": "Visual place recognition techniques based on deep learning, which have imposed themselves as the state-of-the-art in recent years, do not always generalize well to environments that are visually different from the training set. Thus, to achieve top performance, it is sometimes necessary to fine-tune the networks to the target environment. To this end, we propose a completely self-supervised domain calibration procedure based on robust pose graph estimation from Simultaneous Localization and Mapping (SLAM) as the supervision signal without requiring GPS or manual labeling. We first show that the training samples produced by our technique are sufficient to train a visual place recognition system from a pre-trained classification model. Then, we show that our approach can improve the performance of a state-of-the-art technique on a target environment dissimilar from the training set. We believe that this approach will help practitioners to deploy more robust place recognition solutions in real-world applications. ",
    "url": "https://arxiv.org/abs/2203.04446",
    "authors": [
      "Pierre-Yves Lajoie",
      "Giovanni Beltrame"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.04450",
    "title": "CIDER: Exploiting Hyperspherical Embeddings for Out-of-Distribution  Detection",
    "abstract": "Out-of-distribution (OOD) detection is a critical task for reliable machine learning. Recent advances in representation learning give rise to developments in distance-based OOD detection, where testing samples are detected as OOD if they are relatively far away from the centroids or prototypes of in-distribution (ID) classes. However, prior methods directly take off-the-shelf loss functions that suffice for classifying ID samples, but are not optimally designed for OOD detection. In this paper, we propose CIDER, a simple and effective representation learning framework by exploiting hyperspherical embeddings for OOD detection. CIDER jointly optimizes two losses to promote strong ID-OOD separability: (1) a dispersion loss that promotes large angular distances among different class prototypes, and (2) a compactness loss that encourages samples to be close to their class prototypes. We show that CIDER is effective under various settings and establishes state-of-the-art performance. On a hard OOD detection task CIFAR-100 vs. CIFAR-10, our method substantially improves the AUROC by 14.20% compared to the embeddings learned by the cross-entropy loss. ",
    "url": "https://arxiv.org/abs/2203.04450",
    "authors": [
      "Yifei Ming",
      "Yiyou Sun",
      "Ousmane Dia",
      "Yixuan Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04451",
    "title": "Transitions between peace and systemic war as bifurcations in a signed  network dynamical system",
    "abstract": "We investigate structural features and processes associated with the onset of systemic conflict using an approach which integrates complex systems theory with network modeling and analysis. We present a signed network model of cooperation and conflict dynamics in the context of international relations between states. The model evolves ties between nodes under the influence of a structural balance force and a dyad-specific force. Model simulations exhibit a sharp bifurcation from peace to systemic war as structural balance pressures increase, a bistable regime in which both peace and war stable equilibria exist, and a hysteretic reverse bifurcation from war to peace. We show how the analytical expression we derive for the peace-to-war bifurcation condition implies that polarized network structure increases susceptibility to systemic war. We develop a framework for identifying patterns of relationship perturbations that are most destabilizing and apply it to the network of European great powers before World War I. We also show that the model exhibits critical slowing down, in which perturbations to the peace equilibrium take longer to decay as the system draws closer to the bifurcation. We discuss how our results relate to international relations theories on the causes and catalysts of systemic war. ",
    "url": "https://arxiv.org/abs/2203.04451",
    "authors": [
      "Megan Morrison",
      "J. Nathan Kutz",
      "Michael Gabbay"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2203.04453",
    "title": "Machine Learning in NextG Networks via Generative Adversarial Networks",
    "abstract": "Generative Adversarial Networks (GANs) are Machine Learning (ML) algorithms that have the ability to address competitive resource allocation problems together with detection and mitigation of anomalous behavior. In this paper, we investigate their use in next-generation (NextG) communications within the context of cognitive networks to address i) spectrum sharing, ii) detecting anomalies, and iii) mitigating security attacks. GANs have the following advantages. First, they can learn and synthesize field data, which can be costly, time consuming, and nonrepeatable. Second, they enable pre-training classifiers by using semi-supervised data. Third, they facilitate increased resolution. Fourth, they enable the recovery of corrupted bits in the spectrum. The paper provides the basics of GANs, a comparative discussion on different kinds of GANs, performance measures for GANs in computer vision and image processing as well as wireless applications, a number of datasets for wireless applications, performance measures for general classifiers, a survey of the literature on GANs for i)-iii) above, and future research directions. As a use case of GAN for NextG communications, we show that a GAN can be effectively applied for anomaly detection in signal classification (e.g., user authentication) outperforming another state-of-the-art ML technique such as an autoencoder. ",
    "url": "https://arxiv.org/abs/2203.04453",
    "authors": [
      "Ender Ayanoglu",
      "Kemal Davaslioglu",
      "Yalin E. Sagduyu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04455",
    "title": "Pruning Graph Convolutional Networks to select meaningful graph  frequencies for fMRI decoding",
    "abstract": "Graph Signal Processing is a promising framework to manipulate brain signals as it allows to encompass the spatial dependencies between the activity in regions of interest in the brain. In this work, we are interested in better understanding what are the graph frequencies that are the most useful to decode fMRI signals. To this end, we introduce a deep learning architecture and adapt a pruning methodology to automatically identify such frequencies. We experiment with various datasets, architectures and graphs, and show that low graph frequencies are consistently identified as the most important for fMRI decoding, with a stronger contribution for the functional graph over the structural one. We believe that this work provides novel insights on how graph-based methods can be deployed to increase fMRI decoding accuracy and interpretability. ",
    "url": "https://arxiv.org/abs/2203.04455",
    "authors": [
      "Yassine El Ouahidi",
      "Hugo Tessier",
      "Giulia Lioi",
      "Nicolas Farrugia",
      "Bastien Pasdeloup",
      "Vincent Gripon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.04456",
    "title": "Probabilistic Rotation Representation With an Efficiently Computable  Bingham Loss Function and Its Application to Pose Estimation",
    "abstract": "In recent years, a deep learning framework has been widely used for object pose estimation. While quaternion is a common choice for rotation representation of 6D pose, it cannot represent an uncertainty of the observation. In order to handle the uncertainty, Bingham distribution is one promising solution because this has suitable features, such as a smooth representation over SO(3), in addition to the ambiguity representation. However, it requires the complex computation of the normalizing constants. This is the bottleneck of loss computation in training neural networks based on Bingham representation. As such, we propose a fast-computable and easy-to-implement loss function for Bingham distribution. We also show not only to examine the parametrization of Bingham distribution but also an application based on our loss function. ",
    "url": "https://arxiv.org/abs/2203.04456",
    "authors": [
      "Hiroya Sato",
      "Takuya Ikeda",
      "Koichi Nishiwaki"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.04459",
    "title": "Contextual Networks and Unsupervised Ranking of Sentences",
    "abstract": "We construct a contextual network to represent a document with syntactic and semantic relations between word-sentence pairs, based on which we devise an unsupervised algorithm called CNATAR (Contextual Network And Text Analysis Rank) to score sentences, and rank them through a bi-objective 0-1 knapsack maximization problem over topic analysis and sentence scores. We show that CNATAR outperforms the combined ranking of the three human judges provided on the SummBank dataset under both ROUGE and BLEU metrics, which in term significantly outperforms each individual judge's ranking. Moreover, CNATAR produces so far the highest ROUGE scores over DUC-02, and outperforms previous supervised algorithms on the CNN/DailyMail and NYT datasets. We also compare the performance of CNATAR and the latest supervised neural-network summarization models and compute oracle results. ",
    "url": "https://arxiv.org/abs/2203.04459",
    "authors": [
      "Hao Zhang",
      "You Zhou",
      "Jie Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04463",
    "title": "Autonomous Mosquito Habitat Detection Using Satellite Imagery and  Convolutional Neural Networks for Disease Risk Mapping",
    "abstract": "Mosquitoes are known vectors for disease transmission that cause over one million deaths globally each year. The majority of natural mosquito habitats are areas containing standing water that are challenging to detect using conventional ground-based technology on a macro scale. Contemporary approaches, such as drones, UAVs, and other aerial imaging technology are costly when implemented and are only most accurate on a finer spatial scale whereas the proposed convolutional neural network(CNN) approach can be applied for disease risk mapping and further guide preventative efforts on a more global scale. By assessing the performance of autonomous mosquito habitat detection technology, the transmission of mosquito-borne diseases can be prevented in a cost-effective manner. This approach aims to identify the spatiotemporal distribution of mosquito habitats in extensive areas that are difficult to survey using ground-based technology by employing computer vision on satellite imagery for proof of concept. The research presents an evaluation and the results of 3 different CNN models to determine their accuracy of predicting large-scale mosquito habitats. For this approach, a dataset was constructed containing a variety of geographical features. Larger land cover variables such as ponds/lakes, inlets, and rivers were utilized to classify mosquito habitats while minute sites were omitted for higher accuracy on a larger scale. Using the dataset, multiple CNN networks were trained and evaluated for accuracy of habitat prediction. Utilizing a CNN-based approach on readily available satellite imagery is cost-effective and scalable, unlike most aerial imaging technology. Testing revealed that YOLOv4 obtained greater accuracy in mosquito habitat detection for identifying large-scale mosquito habitats. ",
    "url": "https://arxiv.org/abs/2203.04463",
    "authors": [
      "Sriram Elango",
      "Nandini Ramachandran",
      "Russanne Low"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04466",
    "title": "The Combinatorial Brain Surgeon: Pruning Weights That Cancel One Another  in Neural Networks",
    "abstract": "Neural networks tend to achieve better accuracy with training if they are larger -- even if the resulting models are overparameterized. Nevertheless, carefully removing such excess parameters before, during, or after training may also produce models with similar or even improved accuracy. In many cases, that can be curiously achieved by heuristics as simple as removing a percentage of the weights with the smallest absolute value -- even though magnitude is not a perfect proxy for weight relevance. With the premise that obtaining significantly better performance from pruning depends on accounting for the combined effect of removing multiple weights, we revisit one of the classic approaches for impact-based pruning: the Optimal Brain Surgeon~(OBS). We propose a tractable heuristic for solving the combinatorial extension of OBS, in which we select weights for simultaneous removal, as well as a systematic update of the remaining weights. Our selection method outperforms other methods under high sparsity, and the weight update is advantageous even when combined with the other methods. ",
    "url": "https://arxiv.org/abs/2203.04466",
    "authors": [
      "Xin Yu",
      "Thiago Serra",
      "Shandian Zhe",
      "Srikumar Ramalingam"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04467",
    "title": "Boilerplate Detection via Semantic Classification of TextBlocks",
    "abstract": "We present a hierarchical neural network model called SemText to detect HTML boilerplate based on a novel semantic representation of HTML tags, class names, and text blocks. We train SemText on three published datasets of news webpages and fine-tune it using a small number of development data in CleanEval and GoogleTrends-2017. We show that SemText achieves the state-of-the-art accuracy on these datasets. We then demonstrate the robustness of SemText by showing that it also detects boilerplate effectively on out-of-domain community-based question-answer webpages. ",
    "url": "https://arxiv.org/abs/2203.04467",
    "authors": [
      "Hao Zhang",
      "Jie Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04478",
    "title": "3SD: Self-Supervised Saliency Detection With No Labels",
    "abstract": "We present a conceptually simple self-supervised method for saliency detection. Our method generates and uses pseudo-ground truth labels for training. The generated pseudo-GT labels don't require any kind of human annotations (e.g., pixel-wise labels or weak labels like scribbles). Recent works show that features extracted from classification tasks provide important saliency cues like structure and semantic information of salient objects in the image. Our method, called 3SD, exploits this idea by adding a branch for a self-supervised classification task in parallel with salient object detection, to obtain class activation maps (CAM maps). These CAM maps along with the edges of the input image are used to generate the pseudo-GT saliency maps to train our 3SD network. Specifically, we propose a contrastive learning-based training on multiple image patches for the classification task. We show the multi-patch classification with contrastive loss improves the quality of the CAM maps compared to naive classification on the entire image. Experiments on six benchmark datasets demonstrate that without any labels, our 3SD method outperforms all existing weakly supervised and unsupervised methods, and its performance is on par with the fully-supervised methods. Code is available at :https://github.com/rajeevyasarla/3SD ",
    "url": "https://arxiv.org/abs/2203.04478",
    "authors": [
      "Rajeev Yasarla",
      "Renliang Weng",
      "Wongun Choi",
      "Vishal Patel",
      "Amir Sadeghian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04503",
    "title": "An Energy Sharing Mechanism Considering Network Constraints and Market  Power Limitation",
    "abstract": "As the number of prosumers with distributed energy resources (DERs) grows, the conventional centralized operation scheme may suffer from conflicting interests, privacy concerns, and incentive inadequacies. In this paper, we propose an energy sharing mechanism to address the above challenges. It takes into account network constraints and fairness among prosumers. In the proposed energy sharing market, all prosumers play a generalized Nash game. The market equilibrium is proven to have nice features in a large market or when it is a variational equilibrium. To deal with the possible market failure, inefficiency, or instability in general cases, we introduce a price regulation policy to avoid market power exploitation. The improved energy sharing mechanism with price regulation can guarantee existence and uniqueness of a socially near-optimal market equilibrium. Some advantageous properties are proven, such as individual rationality of prosumers, an elegant structure of sharing prices, and the tendency towards social optimum with an increasing number of prosumers. For implementation, a practical bidding process is developed with convergence condition. Experimental results validate the theoretical outcomes and show the practicability of our model and method. ",
    "url": "https://arxiv.org/abs/2203.04503",
    "authors": [
      "Yue Chen",
      "Changhong Zhao",
      "Steven H. Low",
      "Adam Wierman"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2203.04511",
    "title": "Revealing the Excitation Causality between Climate and Political  Violence via a Neural Forward-Intensity Poisson Process",
    "abstract": "The causal mechanism between climate and political violence is fraught with complex mechanisms. Current quantitative causal models rely on one or more assumptions: (1) the climate drivers persistently generate conflict, (2) the causal mechanisms have a linear relationship with the conflict generation parameter, and/or (3) there is sufficient data to inform the prior distribution. Yet, we know conflict drivers often excite a social transformation process which leads to violence (e.g., drought forces agricultural producers to join urban militia), but further climate effects do not necessarily contribute to further violence. Therefore, not only is this bifurcation relationship highly non-linear, there is also often a lack of data to support prior assumptions for high resolution modeling. Here, we aim to overcome the aforementioned causal modeling challenges by proposing a neural forward-intensity Poisson process (NFIPP) model. The NFIPP is designed to capture the potential non-linear causal mechanism in climate induced political violence, whilst being robust to sparse and timing-uncertain data. Our results span 20 recent years and reveal an excitation-based causal link between extreme climate events and political violence across diverse countries. Our climate-induced conflict model results are cross-validated against qualitative climate vulnerability indices. Furthermore, we label historical events that either improve or reduce our predictability gain, demonstrating the importance of domain expertise in informing interpretation. ",
    "url": "https://arxiv.org/abs/2203.04511",
    "authors": [
      "Schyler C. Sun",
      "Bailu Jin",
      "Zhuangkun Wei",
      "Weisi Guo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2203.04515",
    "title": "Structure and Distribution Metric for Quantifying the Quality of  Uncertainty: Assessing Gaussian Processes, Deep Neural Nets, and Deep Neural  Operators for Regression",
    "abstract": "We propose two bounded comparison metrics that may be implemented to arbitrary dimensions in regression tasks. One quantifies the structure of uncertainty and the other quantifies the distribution of uncertainty. The structure metric assesses the similarity in shape and location of uncertainty with the true error, while the distribution metric quantifies the supported magnitudes between the two. We apply these metrics to Gaussian Processes (GPs), Ensemble Deep Neural Nets (DNNs), and Ensemble Deep Neural Operators (DNOs) on high-dimensional and nonlinear test cases. We find that comparing a model's uncertainty estimates with the model's squared error provides a compelling ground truth assessment. We also observe that both DNNs and DNOs, especially when compared to GPs, provide encouraging metric values in high dimensions with either sparse or plentiful data. ",
    "url": "https://arxiv.org/abs/2203.04515",
    "authors": [
      "Ethan Pickering",
      "Themistoklis P. Sapsis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.04516",
    "title": "Update Compression for Deep Neural Networks on the Edge",
    "abstract": "An increasing number of artificial intelligence (AI) applications involve the execution of deep neural networks (DNNs) on edge devices. Many practical reasons motivate the need to update the DNN model on the edge device post-deployment, such as refining the model, concept drift, or outright change in the learning task. In this paper, we consider the scenario where retraining can be done on the server side based on a copy of the DNN model, with only the necessary data transmitted to the edge to update the deployed model. However, due to bandwidth constraints, we want to minimise the transmission required to achieve the update. We develop a simple approach based on matrix factorisation to compress the model update -- this differs from compressing the model itself. The key idea is to preserve existing knowledge in the current model and optimise only small additional parameters for the update which can be used to reconstitute the model on the edge. We compared our method to similar techniques used in federated learning; our method usually requires less than half of the update size of existing methods to achieve the same accuracy. ",
    "url": "https://arxiv.org/abs/2203.04516",
    "authors": [
      "Bo Chen",
      "Ali Bakhshi",
      "Gustavo Batista",
      "Brian Ng",
      "Tat-Jun Chin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04524",
    "title": "Multi-Agent Active Search using Detection and Location Uncertainty",
    "abstract": "Active search refers to the task of autonomous robots (agents) detecting objects of interest (targets) in a search space using decision making algorithms that adapt to the history of their observations. It has important applications in search and rescue missions, wildlife patrolling and environment monitoring. Active search algorithms must contend with two types of uncertainty: detection uncertainty and location uncertainty. Prior work has typically focused on one of these while ignoring or engineering away the other. The more common approach in robotics is to focus on location uncertainty and remove detection uncertainty by thresholding the detection probability to zero or one. On the other hand, it is common in the sparse signal processing literature to assume the target location is accurate and focus on the uncertainty of its detection. In this work, we propose an inference method to jointly handle both target detection and location uncertainty. We then build a decision making algorithm on this inference method that uses Thompson sampling to enable efficient active search in both the single agent and multi-agent settings. We perform experiments in simulation over varying number of agents and targets to show that our inference and decision making algorithms outperform competing baselines that only account for either target detection or location uncertainty. ",
    "url": "https://arxiv.org/abs/2203.04524",
    "authors": [
      "Arundhati Banerjee",
      "Ramina Ghods",
      "Jeff Schneider"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2203.04537",
    "title": "Fast Road Segmentation via Uncertainty-aware Symmetric Network",
    "abstract": "The high performance of RGB-D based road segmentation methods contrasts with their rare application in commercial autonomous driving, which is owing to two reasons: 1) the prior methods cannot achieve high inference speed and high accuracy in both ways; 2) the different properties of RGB and depth data are not well-exploited, limiting the reliability of predicted road. In this paper, based on the evidence theory, an uncertainty-aware symmetric network (USNet) is proposed to achieve a trade-off between speed and accuracy by fully fusing RGB and depth data. Firstly, cross-modal feature fusion operations, which are indispensable in the prior RGB-D based methods, are abandoned. We instead separately adopt two light-weight subnetworks to learn road representations from RGB and depth inputs. The light-weight structure guarantees the real-time inference of our method. Moreover, a multiscale evidence collection (MEC) module is designed to collect evidence in multiple scales for each modality, which provides sufficient evidence for pixel class determination. Finally, in uncertainty-aware fusion (UAF) module, the uncertainty of each modality is perceived to guide the fusion of the two subnetworks. Experimental results demonstrate that our method achieves a state-of-the-art accuracy with real-time inference speed of 43+ FPS. The source code is available at https://github.com/morancyc/USNet. ",
    "url": "https://arxiv.org/abs/2203.04537",
    "authors": [
      "Yicong Chang",
      "Feng Xue",
      "Fei Sheng",
      "Wenteng Liang",
      "Anlong Ming"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.04570",
    "title": "CP-ViT: Cascade Vision Transformer Pruning via Progressive Sparsity  Prediction",
    "abstract": "Vision transformer (ViT) has achieved competitive accuracy on a variety of computer vision applications, but its computational cost impedes the deployment on resource-limited mobile devices. We explore the sparsity in ViT and observe that informative patches and heads are sufficient for accurate image recognition. In this paper, we propose a cascade pruning framework named CP-ViT by predicting sparsity in ViT models progressively and dynamically to reduce computational redundancy while minimizing the accuracy loss. Specifically, we define the cumulative score to reserve the informative patches and heads across the ViT model for better accuracy. We also propose the dynamic pruning ratio adjustment technique based on layer-aware attention range. CP-ViT has great general applicability for practical deployment, which can be applied to a wide range of ViT models and can achieve superior accuracy with or without fine-tuning. Extensive experiments on ImageNet, CIFAR-10, and CIFAR-100 with various pre-trained models have demonstrated the effectiveness and efficiency of CP-ViT. By progressively pruning 50\\% patches, our CP-ViT method reduces over 40\\% FLOPs while maintaining accuracy loss within 1\\%. ",
    "url": "https://arxiv.org/abs/2203.04570",
    "authors": [
      "Zhuoran Song",
      "Yihong Xu",
      "Zhezhi He",
      "Li Jiang",
      "Naifeng Jing",
      "Xiaoyao Liang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.04607",
    "title": "Practical No-box Adversarial Attacks with Training-free Hybrid Image  Transformation",
    "abstract": "In recent years, the adversarial vulnerability of deep neural networks (DNNs) has raised increasing attention. Among all the threat models, no-box attacks are the most practical but extremely challenging since they neither rely on any knowledge of the target model or similar substitute model, nor access the dataset for training a new substitute model. Although a recent method has attempted such an attack in a loose sense, its performance is not good enough and computational overhead of training is expensive. In this paper, we move a step forward and show the existence of a \\textbf{training-free} adversarial perturbation under the no-box threat model, which can be successfully used to attack different DNNs in real-time. Motivated by our observation that high-frequency component (HFC) domains in low-level features and plays a crucial role in classification, we attack an image mainly by manipulating its frequency components. Specifically, the perturbation is manipulated by suppression of the original HFC and adding of noisy HFC. We empirically and experimentally analyze the requirements of effective noisy HFC and show that it should be regionally homogeneous, repeating and dense. Extensive experiments on the ImageNet dataset demonstrate the effectiveness of our proposed no-box method. It attacks ten well-known models with a success rate of \\textbf{98.13\\%} on average, which outperforms state-of-the-art no-box attacks by \\textbf{29.39\\%}. Furthermore, our method is even competitive to mainstream transfer-based black-box attacks. ",
    "url": "https://arxiv.org/abs/2203.04607",
    "authors": [
      "Qilong Zhang",
      "Chaoning Zhang",
      "Chaoqun Li",
      "Jingkuan Song",
      "Lianli Gao",
      "Heng Tao Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04613",
    "title": "Object-Based Visual Camera Pose Estimation From Ellipsoidal Model and  3D-Aware Ellipse Prediction",
    "abstract": "In this paper, we propose a method for initial camera pose estimation from just a single image which is robust to viewing conditions and does not require a detailed model of the scene. This method meets the growing need of easy deployment of robotics or augmented reality applications in any environments, especially those for which no accurate 3D model nor huge amount of ground truth data are available. It exploits the ability of deep learning techniques to reliably detect objects regardless of viewing conditions. Previous works have also shown that abstracting the geometry of a scene of objects by an ellipsoid cloud allows to compute the camera pose accurately enough for various application needs. Though promising, these approaches use the ellipses fitted to the detection bounding boxes as an approximation of the imaged objects. In this paper, we go one step further and propose a learning-based method which detects improved elliptic approximations of objects which are coherent with the 3D ellipsoids in terms of perspective projection. Experiments prove that the accuracy of the computed pose significantly increases thanks to our method. This is achieved with very little effort in terms of training data acquisition - a few hundred calibrated images of which only three need manual object annotation. Code and models are released at https://gitlab.inria.fr/tangram/3d-aware-ellipses-for-visual-localization ",
    "url": "https://arxiv.org/abs/2203.04613",
    "authors": [
      "Matthieu Zins",
      "Gilles Simon",
      "Marie-Odile Berger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04616",
    "title": "PALI-NLP at SemEval-2022 Task 4: Discriminative Fine-tuning of Deep  Transformers for Patronizing and Condescending Language Detection",
    "abstract": "Patronizing and condescending language (PCL) has a large harmful impact and is difficult to detect, both for human judges and existing NLP systems. At SemEval-2022 Task 4, we propose a novel Transformer-based model and its ensembles to accurately understand such language context for PCL detection. To facilitate comprehension of the subtle and subjective nature of PCL, two fine-tuning strategies are applied to capture discriminative features from diverse linguistic behaviour and categorical distribution. The system achieves remarkable results on the official ranking, namely 1st in Subtask 1 and 5th in Subtask 2. Extensive experiments on the task demonstrate the effectiveness of our system and its strategies. ",
    "url": "https://arxiv.org/abs/2203.04616",
    "authors": [
      "Dou Hu",
      "Mengyuan Zhou",
      "Xiyang Du",
      "Mengfei Yuan",
      "Meizhi Jin",
      "Lianxin Jiang",
      "Yang Mo",
      "Xiaofeng Shi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.04623",
    "title": "Evaluation and Generation of Physical Adversarial Patch",
    "abstract": "Recent studies have revealed the vulnerability of face recognition models against physical adversarial patches, which raises security concerns about the deployed face recognition systems. However, it is still challenging to ensure the reproducibility for most attack algorithms under complex physical conditions, which leads to the lack of a systematic evaluation of the existing methods. It is therefore imperative to develop a framework that can enable a comprehensive evaluation of the vulnerability of face recognition in the physical world. To this end, we propose to simulate the complex transformations of faces in the physical world via 3D-face modeling, which serves as a digital counterpart of physical faces. The generic framework allows us to control different face variations and physical conditions to conduct reproducible evaluations comprehensively. With this digital simulator, we further propose a Face3DAdv method considering the 3D face transformations and realistic physical variations. Extensive experiments validate that Face3DAdv can significantly improve the effectiveness of diverse physically realizable adversarial patches in both simulated and physical environments, against various white-box and black-box face recognition models. ",
    "url": "https://arxiv.org/abs/2203.04623",
    "authors": [
      "Xiao Yang",
      "Yinpeng Dong",
      "Tianyu Pang",
      "Zihao Xiao",
      "Hang Su",
      "Jun Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04640",
    "title": "Memory Efficient Continual Learning for Neural Text Classification",
    "abstract": "Learning text classifiers based on pre-trained language models has become the standard practice in natural language processing applications. Unfortunately, training large neural language models, such as transformers, from scratch is very costly and requires a vast amount of training data, which might not be available in the application domain of interest. Moreover, in many real-world scenarios, classes are uncovered as more data is seen, calling for class-incremental modelling approaches. In this work we devise a method to perform text classification using pre-trained models on a sequence of classification tasks provided in sequence. We formalize the problem as a continual learning problem where the algorithm learns new tasks without performance degradation on the previous ones and without re-training the model from scratch. We empirically demonstrate that our method requires significantly less model parameters compared to other state of the art methods and that it is significantly faster at inference time. The tight control on the number of model parameters, and so the memory, is not only improving efficiency. It is making possible the usage of the algorithm in real-world applications where deploying a solution with a constantly increasing memory consumption is just unrealistic. While our method suffers little forgetting, it retains a predictive performance on-par with state of the art but less memory efficient methods. ",
    "url": "https://arxiv.org/abs/2203.04640",
    "authors": [
      "Beyza Ermis",
      "Giovanni Zappella",
      "Martin Wistuba",
      "Cedric Archambeau"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.04651",
    "title": "Slangvolution: A Causal Analysis of Semantic Change and Frequency  Dynamics in Slang",
    "abstract": "Languages are continuously undergoing changes, and the mechanisms that underlie these changes are still a matter of debate. In this work, we approach language evolution through the lens of causality in order to model not only how various distributional factors associate with language change, but how they causally affect it. In particular, we study slang, which is an informal language that is typically restricted to a specific group or social setting. We analyze the semantic change and frequency shift of slang words and compare them to those of standard, nonslang words. With causal discovery and causal inference techniques, we measure the effect that word type (slang/nonslang) has on both semantic change and frequency shift, as well as its relationship to frequency, polysemy and part of speech. Our analysis provides some new insights in the study of semantic change, e.g., we show that slang words undergo less semantic change but tend to have larger frequency shifts over time. ",
    "url": "https://arxiv.org/abs/2203.04651",
    "authors": [
      "Daphna Keidar",
      "Andreas Opedal",
      "Zhijing Jin",
      "Mrinmaya Sachan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.04682",
    "title": "Reliable IoT Firmware Updates: A Large-scale Mesh Network Performance  Investigation",
    "abstract": "Internet of Things (IoT) networks require regular firmware updates to ensure enhanced security and stability. As we move towards methodologies of codifying security and policy decisions and exchanging them over IoT large-scale deployments (security-as-a-code), these demands should be considered a routine operation. However, rolling out firmware updates to large-scale networks presents a crucial challenge for constrained wireless environments with large numbers of IoT devices. This paper initially investigates how the current state-of-the-art protocols operate in such adverse conditions by measuring various Quality-of-Service (QoS) Key Performance Indicators (KPIs) of the shared wireless medium. We later discuss how Concurrent Transmissions (CT) can extend the scalability of IoT protocols and ensure reliable firmware roll-outs over large geographical areas. Measuring KPIs such as the mesh join time, the throughput, and the number of nodes forming a network, we provide great insight into how an IoT environment will behave under a large-scale firmware roll-out. Finally, we conducted our performance investigation over the UMBRELLA platform, a real-world IoT testbed deployed in Bristol, UK. This ensures our findings represent a realistic IoT scenario and meet the strict QoS requirements of today's IoT applications. ",
    "url": "https://arxiv.org/abs/2203.04682",
    "authors": [
      "Ioannis Mavromatis",
      "Aleksandar Stanoev",
      "Anthony J. Portelli",
      "Charles Lockie",
      "Marius Ammann",
      "Yichao Jin",
      "Mahesh Sooriyabandara"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2203.04686",
    "title": "The Cross-evaluation of Machine Learning-based Network Intrusion  Detection Systems",
    "abstract": "Enhancing Network Intrusion Detection Systems (NIDS) with supervised Machine Learning (ML) is tough. ML-NIDS must be trained and evaluated, operations requiring data where benign and malicious samples are clearly labelled. Such labels demand costly expert knowledge, resulting in a lack of real deployments, as well as on papers always relying on the same outdated data. The situation improved recently, as some efforts disclosed their labelled datasets. However, most past works used such datasets just as a 'yet another' testbed, overlooking the added potential provided by such availability. In contrast, we promote using such existing labelled data to cross-evaluate ML-NIDS. Such approach received only limited attention and, due to its complexity, requires a dedicated treatment. We hence propose the first cross-evaluation model. Our model highlights the broader range of realistic use-cases that can be assessed via cross-evaluations, allowing the discovery of still unknown qualities of state-of-the-art ML-NIDS. For instance, their detection surface can be extended--at no additional labelling cost. However, conducting such cross-evaluations is challenging. Hence, we propose the first framework, XeNIDS, for reliable cross-evaluations based on Network Flows. By using XeNIDS on six well-known datasets, we demonstrate the concealed potential, but also the risks, of cross-evaluations of ML-NIDS. ",
    "url": "https://arxiv.org/abs/2203.04686",
    "authors": [
      "Giovanni Apruzzese",
      "Luca Pajola",
      "Mauro Conti"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2203.04692",
    "title": "FragmGAN: Generative Adversarial Nets for Fragmentary Data Imputation  and Prediction",
    "abstract": "Modern scientific research and applications very often encounter \"fragmentary data\" which brings big challenges to imputation and prediction. By leveraging the structure of response patterns, we propose a unified and flexible framework based on Generative Adversarial Nets (GAN) to deal with fragmentary data imputation and label prediction at the same time. Unlike most of the other generative model based imputation methods that either have no theoretical guarantee or only consider Missing Completed At Random (MCAR), the proposed FragmGAN has theoretical guarantees for imputation with data Missing At Random (MAR) while no hint mechanism is needed. FragmGAN trains a predictor with the generator and discriminator simultaneously. This linkage mechanism shows significant advantages for predictive performances in extensive experiments. ",
    "url": "https://arxiv.org/abs/2203.04692",
    "authors": [
      "Fang Fang",
      "Shenliao Bao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.04696",
    "title": "Robust Federated Learning Against Adversarial Attacks for Speech Emotion  Recognition",
    "abstract": "Due to the development of machine learning and speech processing, speech emotion recognition has been a popular research topic in recent years. However, the speech data cannot be protected when it is uploaded and processed on servers in the internet-of-things applications of speech emotion recognition. Furthermore, deep neural networks have proven to be vulnerable to human-indistinguishable adversarial perturbations. The adversarial attacks generated from the perturbations may result in deep neural networks wrongly predicting the emotional states. We propose a novel federated adversarial learning framework for protecting both data and deep neural networks. The proposed framework consists of i) federated learning for data privacy, and ii) adversarial training at the training stage and randomisation at the testing stage for model robustness. The experiments show that our proposed framework can effectively protect the speech data locally and improve the model robustness against a series of adversarial attacks. ",
    "url": "https://arxiv.org/abs/2203.04696",
    "authors": [
      "Yi Chang",
      "Sofiane Laridi",
      "Zhao Ren",
      "Gregory Palmer",
      "Björn W. Schuller",
      "Marco Fisichella"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.04702",
    "title": "ModulE: Module Embedding for Knowledge Graphs",
    "abstract": "Knowledge graph embedding (KGE) has been shown to be a powerful tool for predicting missing links of a knowledge graph. However, existing methods mainly focus on modeling relation patterns, while simply embed entities to vector spaces, such as real field, complex field and quaternion space. To model the embedding space from a more rigorous and theoretical perspective, we propose a novel general group theory-based embedding framework for rotation-based models, in which both entities and relations are embedded as group elements. Furthermore, in order to explore more available KGE models, we utilize a more generic group structure, module, a generalization notion of vector space. Specifically, under our framework, we introduce a more generic embedding method, ModulE, which projects entities to a module. Following the method of ModulE, we build three instantiating models: ModulE$_{\\mathbb{R},\\mathbb{C}}$, ModulE$_{\\mathbb{R},\\mathbb{H}}$ and ModulE$_{\\mathbb{H},\\mathbb{H}}$, by adopting different module structures. Experimental results show that ModulE$_{\\mathbb{H},\\mathbb{H}}$ which embeds entities to a module over non-commutative ring, achieves state-of-the-art performance on multiple benchmark datasets. ",
    "url": "https://arxiv.org/abs/2203.04702",
    "authors": [
      "Jingxuan Chai",
      "Guangming Shi"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.04708",
    "title": "A Unified Transformer Framework for Group-based Segmentation:  Co-Segmentation, Co-Saliency Detection and Video Salient Object Detection",
    "abstract": "Humans tend to mine objects by learning from a group of images or several frames of video since we live in a dynamic world. In the computer vision area, many researches focus on co-segmentation (CoS), co-saliency detection (CoSD) and video salient object detection (VSOD) to discover the co-occurrent objects. However, previous approaches design different networks on these similar tasks separately, and they are difficult to apply to each other, which lowers the upper bound of the transferability of deep learning frameworks. Besides, they fail to take full advantage of the cues among inter- and intra-feature within a group of images. In this paper, we introduce a unified framework to tackle these issues, term as UFO (Unified Framework for Co-Object Segmentation). Specifically, we first introduce a transformer block, which views the image feature as a patch token and then captures their long-range dependencies through the self-attention mechanism. This can help the network to excavate the patch structured similarities among the relevant objects. Furthermore, we propose an intra-MLP learning module to produce self-mask to enhance the network to avoid partial activation. Extensive experiments on four CoS benchmarks (PASCAL, iCoseg, Internet and MSRC), three CoSD benchmarks (Cosal2015, CoSOD3k, and CocA) and four VSOD benchmarks (DAVIS16, FBMS, ViSal and SegV2) show that our method outperforms other state-of-the-arts on three different tasks in both accuracy and speed by using the same network architecture , which can reach 140 FPS in real-time. ",
    "url": "https://arxiv.org/abs/2203.04708",
    "authors": [
      "Yukun Su",
      "Jingliang Deng",
      "Ruizhou Sun",
      "Guosheng Lin",
      "Qingyao Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04711",
    "title": "On a linear fused Gromov-Wasserstein distance for graph structured data",
    "abstract": "We present a framework for embedding graph structured data into a vector space, taking into account node features and topology of a graph into the optimal transport (OT) problem. Then we propose a novel distance between two graphs, named linearFGW, defined as the Euclidean distance between their embeddings. The advantages of the proposed distance are twofold: 1) it can take into account node feature and structure of graphs for measuring the similarity between graphs in a kernel-based framework, 2) it can be much faster for computing kernel matrix than pairwise OT-based distances, particularly fused Gromov-Wasserstein, making it possible to deal with large-scale data sets. After discussing theoretical properties of linearFGW, we demonstrate experimental results on classification and clustering tasks, showing the effectiveness of the proposed linearFGW. ",
    "url": "https://arxiv.org/abs/2203.04711",
    "authors": [
      "Dai Hai Nguyen",
      "Koji Tsuda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04734",
    "title": "Anomaly Detection for Unmanned Aerial Vehicle Sensor Data Using a  Stacked Recurrent Autoencoder Method with Dynamic Thresholding",
    "abstract": "With substantial recent developments in aviation technologies, Unmanned Aerial Vehicles (UAVs) are becoming increasingly integrated in commercial and military operations internationally. Research into the applications of aircraft data is essential in improving safety, reducing operational costs, and developing the next frontier of aerial technology. Having an outlier detection system that can accurately identify anomalous behaviour in aircraft is crucial for these reasons. This paper proposes a system incorporating a Long Short-Term Memory (LSTM) Deep Learning Autoencoder based method with a novel dynamic thresholding algorithm and weighted loss function for anomaly detection of a UAV dataset, in order to contribute to the ongoing efforts that leverage innovations in machine learning and data analysis within the aviation industry. The dynamic thresholding and weighted loss functions showed promising improvements to the standard static thresholding method, both in accuracy-related performance metrics and in speed of true fault detection. ",
    "url": "https://arxiv.org/abs/2203.04734",
    "authors": [
      "Victoria Bell1",
      "Divish Rengasamy",
      "Benjamin Rothwell",
      "Grazziela P Figueredo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04738",
    "title": "Parallel Training of GRU Networks with a Multi-Grid Solver for Long  Sequences",
    "abstract": "Parallelizing Gated Recurrent Unit (GRU) networks is a challenging task, as the training procedure of GRU is inherently sequential. Prior efforts to parallelize GRU have largely focused on conventional parallelization strategies such as data-parallel and model-parallel training algorithms. However, when the given sequences are very long, existing approaches are still inevitably performance limited in terms of training time. In this paper, we present a novel parallel training scheme (called parallel-in-time) for GRU based on a multigrid reduction in time (MGRIT) solver. MGRIT partitions a sequence into multiple shorter sub-sequences and trains the sub-sequences on different processors in parallel. The key to achieving speedup is a hierarchical correction of the hidden state to accelerate end-to-end communication in both the forward and backward propagation phases of gradient descent. Experimental results on the HMDB51 dataset, where each video is an image sequence, demonstrate that the new parallel training scheme achieves up to 6.5$\\times$ speedup over a serial approach. As efficiency of our new parallelization strategy is associated with the sequence length, our parallel GRU algorithm achieves significant performance improvement as the sequence length increases. ",
    "url": "https://arxiv.org/abs/2203.04738",
    "authors": [
      "Gordon Euhyun Moon",
      "Eric C. Cyr"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04740",
    "title": "Trust levels in social networks",
    "abstract": "In this paper, we study trust levels in social networks from the perspective of Dunbar's number. ",
    "url": "https://arxiv.org/abs/2203.04740",
    "authors": [
      "Santanu Acharjee",
      "Akhil Thomas Panicker"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2203.04746",
    "title": "SkinningNet: Two-Stream Graph Convolutional Neural Network for Skinning  Prediction of Synthetic Characters",
    "abstract": "This work presents SkinningNet, an end-to-end Two-Stream Graph Neural Network architecture that computes skinning weights from an input mesh and its associated skeleton, without making any assumptions on shape class and structure of the provided mesh. Whereas previous methods pre-compute handcrafted features that relate the mesh and the skeleton or assume a fixed topology of the skeleton, the proposed method extracts this information in an end-to-end learnable fashion by jointly learning the best relationship between mesh vertices and skeleton joints. The proposed method exploits the benefits of the novel Multi-Aggregator Graph Convolution that combines the results of different aggregators during the summarizing step of the Message-Passing scheme, helping the operation to generalize for unseen topologies. Experimental results demonstrate the effectiveness of the contributions of our novel architecture, with SkinningNet outperforming current state-of-the-art alternatives. ",
    "url": "https://arxiv.org/abs/2203.04746",
    "authors": [
      "Albert Mosella-Montoro",
      "Javier Ruiz-Hidalgo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04771",
    "title": "Multiscale Convolutional Transformer with Center Mask Pretraining for  Hyperspectral Image Classificationtion",
    "abstract": "Hyperspectral images (HSI) not only have a broad macroscopic field of view but also contain rich spectral information, and the types of surface objects can be identified through spectral information, which is one of the main applications in hyperspectral image related research.In recent years, more and more deep learning methods have been proposed, among which convolutional neural networks (CNN) are the most influential. However, CNN-based methods are difficult to capture long-range dependencies, and also require a large amount of labeled data for model training.Besides, most of the self-supervised training methods in the field of HSI classification are based on the reconstruction of input samples, and it is difficult to achieve effective use of unlabeled samples. To address the shortcomings of CNN networks, we propose a noval multi-scale convolutional embedding module for HSI to realize effective extraction of spatial-spectral information, which can be better combined with Transformer network.In order to make more efficient use of unlabeled data, we propose a new self-supervised pretask. Similar to Mask autoencoder, but our pre-training method only masks the corresponding token of the central pixel in the encoder, and inputs the remaining token into the decoder to reconstruct the spectral information of the central pixel.Such a pretask can better model the relationship between the central feature and the domain feature, and obtain more stable training results. ",
    "url": "https://arxiv.org/abs/2203.04771",
    "authors": [
      "Yifan Wang",
      "Sen Jia",
      "Zhongfan Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04774",
    "title": "Tailored vertex ordering for faster triangle listing in large graphs",
    "abstract": "Listing triangles is a fundamental graph problem with many applications, and large graphs require fast algorithms. Vertex ordering allows to orient the edges from lower to higher vertex indices, and state-of-the-art triangle listing algorithms use this to accelerate their execution and to bound their time complexity. Yet, only two basic orderings have been tested. In this paper, we show that studying the precise cost of algorithms instead of their bounded complexity leads to faster solutions. We introduce cost functions that link ordering properties with the running time of a given algorithm. We prove that their minimization is NP-hard and propose heuristics to obtain new orderings with different trade-offs between cost reduction and ordering time. Using datasets with up to two billion edges, we show that our heuristics accelerate the listing of triangles by an average of 30% when the ordering is already given as an input, and 15% when the ordering time is included. ",
    "url": "https://arxiv.org/abs/2203.04774",
    "authors": [
      "Fabrice Lécuyer",
      "Louis Jachiet",
      "Clémence Magnien",
      "Lionel Tabourier"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2203.04776",
    "title": "NURSE: eNd-UseR IoT malware detection tool for Smart homEs",
    "abstract": "Traditional techniques to detect malware infections were not meant to be used by the end-user and current malware removal tools and security software cannot handle the heterogeneity of IoT devices. In this paper, we design, develop and evaluate a tool, called NURSE, to fill this information gap, i.e., enabling end-users to detect IoT-malware infections in their home networks. NURSE follows a modular approach to analyze IoT traffic as captured by means of an ARP spoofing technique which does not require any network modification or specific hardware. Thus, NURSE provides zero-configuration IoT traffic analysis within everybody's reach. After testing NURSE in 83 different IoT network scenarios with a wide variety of IoT device types, results show that NURSE identifies malware-infected IoT devices with high accuracy (86.7%) using device network behavior and contacted destinations. ",
    "url": "https://arxiv.org/abs/2203.04776",
    "authors": [
      "Antoine d'Estalenx",
      "Carlos H. Gañán"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2203.04799",
    "title": "Evaluation of YOLO Models with Sliced Inference for Small Object  Detection",
    "abstract": "Small object detection has major applications in the fields of UAVs, surveillance, farming and many others. In this work we investigate the performance of state of the art Yolo based object detection models for the task of small object detection as they are one of the most popular and easy to use object detection models. We evaluated YOLOv5 and YOLOX models in this study. We also investigate the effects of slicing aided inference and fine-tuning the model for slicing aided inference. We used the VisDrone2019Det dataset for training and evaluating our models. This dataset is challenging in the sense that most objects are relatively small compared to the image sizes. This work aims to benchmark the YOLOv5 and YOLOX models for small object detection. We have seen that sliced inference increases the AP50 score in all experiments, this effect was greater for the YOLOv5 models compared to the YOLOX models. The effects of sliced fine-tuning and sliced inference combined produced substantial improvement for all models. The highest AP50 score was achieved by the YOLOv5- Large model on the VisDrone2019Det test-dev subset with the score being 48.8. ",
    "url": "https://arxiv.org/abs/2203.04799",
    "authors": [
      "Muhammed Can Keles",
      "Batuhan Salmanoglu",
      "Mehmet Serdar Guzel",
      "Baran Gursoy",
      "Gazi Erkan Bostanci"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04812",
    "title": "A high-precision self-supervised monocular visual odometry in foggy  weather based on robust cycled generative adversarial networks and multi-task  learning aided depth estimation",
    "abstract": "This paper proposes a high-precision self-supervised monocular VO, which is specifically designed for navigation in foggy weather. A cycled generative adversarial network is designed to obtain high-quality self-supervised loss via forcing the forward and backward half-cycle to output consistent estimation. Moreover, gradient-based loss and perceptual loss are introduced to eliminate the interference of complex photometric change on self-supervised loss in foggy weather. To solve the ill-posed problem of depth estimation, a self-supervised multi-task learning aided depth estimation module is designed based on the strong correlation between the depth estimation and transmission map calculation of hazy images in foggy weather. The experimental results on the synthetic foggy KITTI dataset show that the proposed self-supervised monocular VO performs better in depth and pose estimation than other state-of-the-art monocular VO in the literature, indicating the designed method is more suitable for foggy weather. ",
    "url": "https://arxiv.org/abs/2203.04812",
    "authors": [
      "Xiuyuan Li",
      "Jiangang Yu",
      "Fengchao Li",
      "Guowen An"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04813",
    "title": "Social Engineering Attacks and Defenses in the Physical World vs.  Cyberspace: A Contrast Study",
    "abstract": "Social engineering attacks are phenomena that are equally applicable to both the physical world and cyberspace. These attacks in the physical world have been studied for a much longer time than their counterpart in cyberspace. This motivates us to investigate how social engineering attacks in the physical world and cyberspace relate to each other, including their common characteristics and unique features. For this purpose, we propose a methodology to unify social engineering attacks and defenses in the physical world and cyberspace into a single framework, including: (i) a systematic model based on psychological principles for describing these attacks; (ii) a systematization of these attacks; and (iii) a systematization of defenses against them. Our study leads to several insights, which shed light on future research directions towards adequately defending against social engineering attacks in cyberspace. ",
    "url": "https://arxiv.org/abs/2203.04813",
    "authors": [
      "Rosana Montañez Rodriguez",
      "Adham Atyabi",
      "Shouhuai"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2203.04821",
    "title": "Neural Network Training on In-memory-computing Hardware with Radix-4  Gradients",
    "abstract": "Deep learning training involves a large number of operations, which are dominated by high dimensionality Matrix-Vector Multiplies (MVMs). This has motivated hardware accelerators to enhance compute efficiency, but where data movement and accessing are proving to be key bottlenecks. In-Memory Computing (IMC) is an approach with the potential to overcome this, whereby computations are performed in-place within dense 2-D memory. However, IMC fundamentally trades efficiency and throughput gains for dynamic-range limitations, raising distinct challenges for training, where compute precision requirements are seen to be substantially higher than for inferencing. This paper explores training on IMC hardware by leveraging two recent developments: (1) a training algorithm enabling aggressive quantization through a radix-4 number representation; (2) IMC leveraging compute based on precision capacitors, whereby analog noise effects can be made well below quantization effects. Energy modeling calibrated to a measured silicon prototype implemented in 16nm CMOS shows that energy savings of over 400x can be achieved with full quantizer adaptability, where all training MVMs can be mapped to IMC, and 3x can be achieved for two-level quantizer adaptability, where two of the three training MVMs can be mapped to IMC. ",
    "url": "https://arxiv.org/abs/2203.04821",
    "authors": [
      "Christopher Grimm",
      "Naveen Verma"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.04822",
    "title": "A high-precision underwater object detection based on joint  self-supervised deblurring and improved spatial transformer network",
    "abstract": "Deep learning-based underwater object detection (UOD) remains a major challenge due to the degraded visibility and difficulty to obtain sufficient underwater object images captured from various perspectives for training. To address these issues, this paper presents a high-precision UOD based on joint self-supervised deblurring and improved spatial transformer network. A self-supervised deblurring subnetwork is introduced into the designed multi-task learning aided object detection architecture to force the shared feature extraction module to output clean features for detection subnetwork. Aiming at alleviating the limitation of insufficient photos from different perspectives, an improved spatial transformer network is designed based on perspective transformation, adaptively enriching image features within the network. The experimental results show that the proposed UOD approach achieved 47.9 mAP in URPC2017 and 70.3 mAP in URPC2018, outperforming many state-of-the-art UOD methods and indicating the designed method is more suitable for UOD. ",
    "url": "https://arxiv.org/abs/2203.04822",
    "authors": [
      "Xiuyuan Li",
      "Fengchao Li",
      "Jiangang Yu",
      "Guowen An"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04836",
    "title": "Max Weight Independent Set in graphs with no long claws: An analog of  the Gyárfás' path argument",
    "abstract": "We revisit recent developments for the Maximum Weight Independent Set problem in graphs excluding a subdivided claw $S_{t,t,t}$ as an induced subgraph [Chudnovsky, Pilipczuk, Pilipczuk, Thomass\\'{e}, SODA 2020] and provide a subexponential-time algorithm with improved running time $2^{\\mathcal{O}(\\sqrt{n}\\log n)}$ and a quasipolynomial-time approximation scheme with improved running time $2^{\\mathcal{O}(\\varepsilon^{-1} \\log^{5} n)}$. The Gy\\'arf\\'as' path argument, a powerful tool that is the main building block for many algorithms in $P_t$-free graphs, ensures that given an $n$-vertex $P_t$-free graph, in polynomial time we can find a set $P$ of at most $t-1$ vertices, such that every connected component of $G-N[P]$ has at most $n/2$ vertices. Our main technical contribution is an analog of this result for $S_{t,t,t}$-free graphs: given an $n$-vertex $S_{t,t,t}$-free graph, in polynomial time we can find a set $P$ of $\\mathcal{O}(t \\log n)$ vertices and an extended strip decomposition (an appropriate analog of the decomposition into connected components) of $G-N[P]$ such that every particle (an appropriate analog of a connected component to recurse on) of the said extended strip decomposition has at most $n/2$ vertices. ",
    "url": "https://arxiv.org/abs/2203.04836",
    "authors": [
      "Konrad Majewski",
      "Tomáš Masařík",
      "Jana Novotná",
      "Karolina Okrasa",
      "Marcin Pilipczuk",
      "Paweł Rzążewski",
      "Marek Sokołowski"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2203.04855",
    "title": "Binary Classification Under $\\ell_0$ Attacks for General Noise  Distribution",
    "abstract": "Adversarial examples have recently drawn considerable attention in the field of machine learning due to the fact that small perturbations in the data can result in major performance degradation. This phenomenon is usually modeled by a malicious adversary that can apply perturbations to the data in a constrained fashion, such as being bounded in a certain norm. In this paper, we study this problem when the adversary is constrained by the $\\ell_0$ norm; i.e., it can perturb a certain number of coordinates in the input, but has no limit on how much it can perturb those coordinates. Due to the combinatorial nature of this setting, we need to go beyond the standard techniques in robust machine learning to address this problem. We consider a binary classification scenario where $d$ noisy data samples of the true label are provided to us after adversarial perturbations. We introduce a classification method which employs a nonlinear component called truncation, and show in an asymptotic scenario, as long as the adversary is restricted to perturb no more than $\\sqrt{d}$ data samples, we can almost achieve the optimal classification error in the absence of the adversary, i.e. we can completely neutralize adversary's effect. Surprisingly, we observe a phase transition in the sense that using a converse argument, we show that if the adversary can perturb more than $\\sqrt{d}$ coordinates, no classifier can do better than a random guess. ",
    "url": "https://arxiv.org/abs/2203.04855",
    "authors": [
      "Payam Delgosha",
      "Hamed Hassani",
      "Ramtin Pedarsani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2203.04865",
    "title": "A Unified Network Equilibrium for E-Hailing Platform Operation and  Customer Mode Choice",
    "abstract": "This paper aims to combine both economic and network user equilibrium for ride-sourcing and ride-pooling services, while endogenously optimizing the pooling sequence of two origin-destination (OD) pairs. With the growing popularity of ride-sourcing and ride-pooling services provided by transportation network companies (TNC), there lacks a theoretical network equilibrium model that accounts for the emerging ride-pooling service, due to the challenge in enumerating all possible combinations of OD pairs pooling and sequencing. This paper proposes a unified network equilibrium framework that integrates three modules, including travelers' modal choice between e-pooling and e-solo services, e-platforms' decision on vehicle dispatching and driver-passenger matching, and network congestion. To facilitate the representation of vehicle and passenger OD flows and pooling options, a layered OD hypergraph is created encompassing ride-sourcing and ride-pooling services over origins and destination nodes. Numerical examples are performed on both small and large road networks to demonstrate the efficiency of our model. The proposed equilibrium framework can efficiently assist policymakers and urban planners to evaluate the impact of TNCs on traffic congestion, and also help TNCs with pricing and fleet sizing optimization. ",
    "url": "https://arxiv.org/abs/2203.04865",
    "authors": [
      "Xu Chen",
      "Xuan Di"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.04874",
    "title": "VGQ-CNN: Moving Beyond Fixed Cameras and Top-Grasps for Grasp Quality  Prediction",
    "abstract": "We present the Versatile Grasp Quality Convolutional Neural Network (VGQ-CNN), a grasp quality prediction network for 6-DOF grasps. VGQ-CNN can be used when evaluating grasps for objects seen from a wide range of camera poses or mobile robots without the need to retrain the network. By defining the grasp orientation explicitly as an input to the network, VGQ-CNN can evaluate 6-DOF grasp poses, moving beyond the 4-DOF grasps used in most image-based grasp evaluation methods like GQ-CNN. We train VGQ-CNN on our new Versatile Grasp dataset (VG-dset), containing 6-DOF grasps observed from a wide range of camera poses. VGQ-CNN achieves a balanced accuracy of 82.1% on our test-split while generalising to a variety of camera poses. Meanwhile, it achieves competitive performance for overhead cameras and top-grasps with a balanced accuracy of 74.2% compared to GQ-CNN's 76.6%. We also propose a modified network architecture, FAST-VGQ-CNN, that speeds up inference using a shared encoder architecture and can make 128 grasp quality predictions in 12ms on a CPU. Code and data are available at https://figshare.com/s/b12b37b14b747b10524e. ",
    "url": "https://arxiv.org/abs/2203.04874",
    "authors": [
      "A. Konrad",
      "J. McDonald",
      "R. Villing"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04880",
    "title": "An Environmental Feature Representation in I-vector Space for Room  Verification and Metadata Estimation",
    "abstract": "This paper investigates the application of environmental feature representations for room verification tasks and acoustic meta-data estimation. Audio recordings contain both speaker and non-speaker information. We refer to the non-speaker-related information, including channel and other environmental factors, as e-vectors. I-vectors, commonly used in speaker identification, are extracted in the total variability space and capture both speaker and channel-environment information without discrimination. Accordingly, e-vectors can be extracted from i-vectors using methods such as linear discriminant analysis. In this paper, we first demonstrate that e-vectors can be successfully applied to room verification tasks with a low equal error rate. Second, we propose two methods for estimating metadata information -- signal-to-noise (SNR) and reverberation (T60) -- from these e-vectors. When comparing our system to contemporary global SNR estimation methods, in terms of accuracy, we perform favorably even with low dimensional i-vectors. Lastly, we show that room verification tasks can be improved if e-vectors are augmented with the extracted metadata information. ",
    "url": "https://arxiv.org/abs/2203.04880",
    "authors": [
      "Desmond Caulley"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.04888",
    "title": "Efficient Image Representation Learning with Federated Sampled Softmax",
    "abstract": "Learning image representations on decentralized data can bring many benefits in cases where data cannot be aggregated across data silos. Softmax cross entropy loss is highly effective and commonly used for learning image representations. Using a large number of classes has proven to be particularly beneficial for the descriptive power of such representations in centralized learning. However, doing so on decentralized data with Federated Learning is not straightforward as the demand on FL clients' computation and communication increases proportionally to the number of classes. In this work we introduce federated sampled softmax (FedSS), a resource-efficient approach for learning image representation with Federated Learning. Specifically, the FL clients sample a set of classes and optimize only the corresponding model parameters with respect to a sampled softmax objective that approximates the global full softmax objective. We examine the loss formulation and empirically show that our method significantly reduces the number of parameters transferred to and optimized by the client devices, while performing on par with the standard full softmax method. This work creates a possibility for efficiently learning image representations on decentralized data with a large number of classes under the federated setting. ",
    "url": "https://arxiv.org/abs/2203.04888",
    "authors": [
      "Sagar M. Waghmare",
      "Hang Qi",
      "Huizhong Chen",
      "Mikhail Sirotenko",
      "Tomer Meron"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04921",
    "title": "The Severity Prediction of The Binary And Multi-Class Cardiovascular  Disease -- A Machine Learning-Based Fusion Approach",
    "abstract": "In today's world, a massive amount of data is available in almost every sector. This data has become an asset as we can use this enormous amount of data to find information. Mainly health care industry contains many data consisting of patient and disease-related information. By using the machine learning technique, we can look for hidden data patterns to predict various diseases. Recently CVDs, or cardiovascular disease, have become a leading cause of death around the world. The number of death due to CVDs is frightening. That is why many researchers are trying their best to design a predictive model that can save many lives using the data mining model. In this research, some fusion models have been constructed to diagnose CVDs along with its severity. Machine learning(ML) algorithms like artificial neural network, SVM, logistic regression, decision tree, random forest, and AdaBoost have been applied to the heart disease dataset to predict disease. Randomoversampler was implemented because of the class imbalance in multiclass classification. To improve the performance of classification, a weighted score fusion approach was taken. At first, the models were trained. After training, two algorithms' decision was combined using a weighted sum rule. A total of three fusion models have been developed from the six ML algorithms. The results were promising in the performance parameter. The proposed approach has been experimented with different test training ratios for binary and multiclass classification problems, and for both of them, the fusion models performed well. The highest accuracy for multiclass classification was found as 75%, and it was 95% for binary. The code can be found in : https://github.com/hafsa-kibria/Weighted_score_fusion_model_heart_disease_prediction ",
    "url": "https://arxiv.org/abs/2203.04921",
    "authors": [
      "Hafsa Binte Kibria",
      "Abdul Matin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.04928",
    "title": "DISCO: Comprehensive and Explainable Disinformation Detection",
    "abstract": "Disinformation refers to false information deliberately spread to influence the general public, and the negative impact of disinformation on society can be observed for numerous issues, such as political agendas and manipulating financial markets. In this paper, we identify prevalent challenges and advances related to automated disinformation detection from multiple aspects, and propose a comprehensive and explainable disinformation detection framework called DISCO. It leverages the heterogeneity of disinformation and addresses the prediction opaqueness. Then we provide a demonstration of DISCO on a real-world fake news detection task with satisfactory detection accuracy and explanation. The demo video and source code of DISCO is now publicly available. We expect that our demo could pave the way for addressing the limitations of identification, comprehension, and explainability as a whole. ",
    "url": "https://arxiv.org/abs/2203.04928",
    "authors": [
      "Dongqi Fu",
      "Yikun Ban",
      "Hanghang Tong",
      "Ross Maciejewski",
      "Jingrui He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2203.04937",
    "title": "Addressing Bias in Visualization Recommenders by Identifying Trends in  Training Data: Improving VizML Through a Statistical Analysis of the Plotly  Community Feed",
    "abstract": "Machine learning is a promising approach to visualization recommendation due to its high scalability and representational power. Researchers can create a neural network to predict visualizations from input data by training it over a corpus of datasets and visualization examples. However, these machine learning models can reflect trends in their training data that may negatively affect their performance. Our research project aims to address training bias in machine learning visualization recommendation systems by identifying trends in the training data through statistical analysis. ",
    "url": "https://arxiv.org/abs/2203.04937",
    "authors": [
      "Allen Tu",
      "Priyanka Mehta",
      "Alexander Wu",
      "Nandhini Krishnan",
      "Amar Mujumdar"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04289",
    "title": "Self-supervised learning for analysis of temporal and morphological drug  effects in cancer cell imaging data",
    "abstract": "In this work, we propose two novel methodologies to study temporal and morphological phenotypic effects caused by different experimental conditions using imaging data. As a proof of concept, we apply them to analyze drug effects in 2D cancer cell cultures. We train a convolutional autoencoder on 1M images dataset with random augmentations and multi-crops to use as feature extractor. We systematically compare it to the pretrained state-of-the-art models. We further use the feature extractor in two ways. First, we apply distance-based analysis and dynamic time warping to cluster temporal patterns of 31 drugs. We identify clusters allowing annotation of drugs as having cytotoxic, cytostatic, mixed or no effect. Second, we implement an adversarial/regularized learning setup to improve classification of 31 drugs and visualize image regions that contribute to the improvement. We increase top-3 classification accuracy by 8% on average and mine examples of morphological feature importance maps. We provide the feature extractor and the weights to foster transfer learning applications in biology. We also discuss utility of other pretrained models and applicability of our methods to other types of biomedical data. ",
    "url": "https://arxiv.org/abs/2203.04289",
    "authors": [
      "Andrei Dmitrenko",
      "Mauro M. Masiero",
      "Nicola Zamboni"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2203.04290",
    "title": "Residual Aligner Network",
    "abstract": "Image registration is important for medical imaging, the estimation of the spatial transformation between different images. Many previous studies have used learning-based methods for coarse-to-fine registration to efficiently perform 3D image registration. The coarse-to-fine approach, however, is limited when dealing with the different motions of nearby objects. Here we propose a novel Motion-Aware (MA) structure that captures the different motions in a region. The MA structure incorporates a novel Residual Aligner (RA) module which predicts the multi-head displacement field used to disentangle the different motions of multiple neighbouring objects. Compared with other deep learning methods, the network based on the MA structure and RA module achieve one of the most accurate unsupervised inter-subject registration on the 9 organs of assorted sizes in abdominal CT scans, with the highest-ranked registration of the veins (Dice Similarity Coefficient / Average surface distance: 62\\%/4.9mm for the vena cava and 34\\%/7.9mm for the portal and splenic vein), with a half-sized structure and more efficient computation. Applied to the segmentation of lungs in chest CT scans, the new network achieves results which were indistinguishable from the best-ranked networks (94\\%/3.0mm). Additionally, the theorem on predicted motion pattern and the design of MA structure are validated by further analysis. ",
    "url": "https://arxiv.org/abs/2203.04290",
    "authors": [
      "Jian-Qing Zheng",
      "Ziyang Wang",
      "Baoru Huang",
      "Ngee Han Lim",
      "Bartlomiej W. Papiez"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04306",
    "title": "Diffusion Models for Medical Anomaly Detection",
    "abstract": "In medical applications, weakly supervised anomaly detection methods are of great interest, as only image-level annotations are required for training. Current anomaly detection methods mainly rely on generative adversarial networks or autoencoder models. Those models are often complicated to train or have difficulties to preserve fine details in the image. We present a novel weakly supervised anomaly detection method based on denoising diffusion implicit models. We combine the deterministic iterative noising and denoising scheme with classifier guidance for image-to-image translation between diseased and healthy subjects. Our method generates very detailed anomaly maps without the need for a complex training procedure. We evaluate our method on the BRATS2020 dataset for brain tumor detection and the CheXpert dataset for detecting pleural effusions. ",
    "url": "https://arxiv.org/abs/2203.04306",
    "authors": [
      "Julia Wolleb",
      "Florentin Bieder",
      "Robin Sandkühler",
      "Philippe C. Cattin"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04308",
    "title": "Breast cancer detection using artificial intelligence techniques: A  systematic literature review",
    "abstract": "Cancer is one of the most dangerous diseases to humans, and yet no permanent cure has been developed for it. Breast cancer is one of the most common cancer types. According to the National Breast Cancer foundation, in 2020 alone, more than 276,000 new cases of invasive breast cancer and more than 48,000 non-invasive cases were diagnosed in the US. To put these figures in perspective, 64% of these cases are diagnosed early in the disease's cycle, giving patients a 99% chance of survival. Artificial intelligence and machine learning have been used effectively in detection and treatment of several dangerous diseases, helping in early diagnosis and treatment, and thus increasing the patient's chance of survival. Deep learning has been designed to analyze the most important features affecting detection and treatment of serious diseases. For example, breast cancer can be detected using genes or histopathological imaging. Analysis at the genetic level is very expensive, so histopathological imaging is the most common approach used to detect breast cancer. In this research work, we systematically reviewed previous work done on detection and treatment of breast cancer using genetic sequencing or histopathological imaging with the help of deep learning and machine learning. We also provide recommendations to researchers who will work in this field ",
    "url": "https://arxiv.org/abs/2203.04308",
    "authors": [
      "Ali Bou Nassif",
      "Manar Abu Talib",
      "Qassim Nasir",
      "Yaman Afadar",
      "Omar Elgendy"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2203.04313",
    "title": "Multi-Scale Adaptive Network for Single Image Denoising",
    "abstract": "Multi-scale architectures have shown effectiveness in a variety of tasks including single image denoising, thanks to appealing cross-scale complementarity. However, existing methods treat different scale features equally without considering their scale-specific characteristics, i.e., the within-scale characteristics are ignored. In this paper, we reveal this missing piece for multi-scale architecture design and accordingly propose a novel Multi-Scale Adaptive Network (MSANet) for single image denoising. To be specific, MSANet simultaneously embraces the within-scale characteristics and the cross-scale complementarity thanks to three novel neural blocks, i.e., adaptive feature block (AFeB), adaptive multi-scale block (AMB), and adaptive fusion block (AFuB). In brief, AFeB is designed to adaptively select details and filter noises, which is highly expected for fine-grained features. AMB could enlarge the receptive field and aggregate the multi-scale information, which is designed to satisfy the demands of both fine- and coarse-grained features. AFuB devotes to adaptively sampling and transferring the features from one scale to another scale, which is used to fuse the features with varying characteristics from coarse to fine. Extensive experiments on both three real and six synthetic noisy image datasets show the superiority of MSANet compared with 12 methods. ",
    "url": "https://arxiv.org/abs/2203.04313",
    "authors": [
      "Yuanbiao Gou",
      "Peng Hu",
      "Jiancheng Lv",
      "Xi Peng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04317",
    "title": "MICDIR: Multi-scale Inverse-consistent Deformable Image Registration  using UNetMSS with Self-Constructing Graph Latent",
    "abstract": "Image registration is the process of bringing different images into a common coordinate system - a technique widely used in various applications of computer vision, such as remote sensing, image retrieval, and most commonly in medical imaging. Deep Learning based techniques have been applied successfully to tackle various complex medical image processing problems, including medical image registration. Over the years, several image registration techniques have been proposed using deep learning. Deformable image registration techniques such as Voxelmorph have been successful in capturing finer changes and providing smoother deformations. However, Voxelmorph, as well as ICNet and FIRE, do not explicitly encode global dependencies (i.e. the overall anatomical view of the supplied image) and therefore can not track large deformations. In order to tackle the aforementioned problems, this paper extends the Voxelmorph approach in three different ways. To improve the performance in case of small as well as large deformations, supervision of the model at different resolutions have been integrated using a multi-scale UNet. To support the network to learn and encode the minute structural co-relations of the given image-pairs, a self-constructing graph network (SCGNet) has been used as the latent of the multi-scale UNet - which can improve the learning process of the model and help the model to generalise better. And finally, to make the deformations inverse-consistent, cycle consistency loss has been employed. On the task of registration of brain MRIs, the proposed method achieved significant improvements over ANTs and VoxelMorph, obtaining a Dice score of 0.8013$\\pm$0.0243 for intramodal and 0.6211$\\pm$0.0309 for intermodal, while VoxelMorph achieved 0.7747$\\pm$0.0260 and 0.6071$\\pm$0.0510, respectively. ",
    "url": "https://arxiv.org/abs/2203.04317",
    "authors": [
      "Soumick Chatterjee",
      "Himanshi Bajaj",
      "Istiyak H. Siddiquee",
      "Nandish Bandi Subbarayappa",
      "Steve Simon",
      "Suraj Bangalore Shashidhar",
      "Oliver Speck",
      "Andreas Nürnberge"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2203.04396",
    "title": "Embedding Temporal Convolutional Networks for Energy-Efficient PPG-Based  Heart Rate Monitoring",
    "abstract": "Photoplethysmography (PPG) sensors allow for non-invasive and comfortable heart-rate (HR) monitoring, suitable for compact wrist-worn devices. Unfortunately, Motion Artifacts (MAs) severely impact the monitoring accuracy, causing high variability in the skin-to-sensor interface. Several data fusion techniques have been introduced to cope with this problem, based on combining PPG signals with inertial sensor data. Until know, both commercial and reasearch solutions are computationally efficient but not very robust, or strongly dependent on hand-tuned parameters, which leads to poor generalization performance. % In this work, we tackle these limitations by proposing a computationally lightweight yet robust deep learning-based approach for PPG-based HR estimation. Specifically, we derive a diverse set of Temporal Convolutional Networks (TCN) for HR estimation, leveraging Neural Architecture Search (NAS). Moreover, we also introduce ActPPG, an adaptive algorithm that selects among multiple HR estimators depending on the amount of MAs, to improve energy efficiency. We validate our approaches on two benchmark datasets, achieving as low as 3.84 Beats per Minute (BPM) of Mean Absolute Error (MAE) on PPGDalia, which outperforms the previous state-of-the-art. Moreover, we deploy our models on a low-power commercial microcontroller (STM32L4), obtaining a rich set of Pareto optimal solutions in the complexity vs. accuracy space. ",
    "url": "https://arxiv.org/abs/2203.04396",
    "authors": [
      "Alessio Burrello",
      "Daniele Jahier Pagliari",
      "Pierangelo Maria Rapa",
      "Matilde Semilia",
      "Matteo Risso",
      "Tommaso Polonelli",
      "Massimo Poncino",
      "Luca Benini",
      "Simone Benatti"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04583",
    "title": "Language Adaptive Cross-lingual Speech Representation Learning with  Sparse Sharing Sub-networks",
    "abstract": "Unsupervised cross-lingual speech representation learning (XLSR) has recently shown promising results in speech recognition by leveraging vast amounts of unlabeled data across multiple languages. However, standard XLSR model suffers from language interference problem due to the lack of language specific modeling ability. In this work, we investigate language adaptive training on XLSR models. More importantly, we propose a novel language adaptive pre-training approach based on sparse sharing sub-networks. It makes room for language specific modeling by pruning out unimportant parameters for each language, without requiring any manually designed language specific component. After pruning, each language only maintains a sparse sub-network, while the sub-networks are partially shared with each other. Experimental results on a downstream multilingual speech recognition task show that our proposed method significantly outperforms baseline XLSR models on both high resource and low resource languages. Besides, our proposed method consistently outperforms other adaptation methods and requires fewer parameters. ",
    "url": "https://arxiv.org/abs/2203.04583",
    "authors": [
      "Yizhou Lu",
      "Mingkun Huang",
      "Xinghua Qu",
      "Pengfei Wei",
      "Zejun Ma"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2203.04609",
    "title": "Application of Lie Group-based Neural Network Method to Nonlinear  Dynamical Systems",
    "abstract": "In this paper, a Lie group-based neural network method is proposed for solving initial value problems of non linear dynamics. Due to its single-layer structure (MLP), the approach is substantially cheaper than the multilayer perceptron method used in literature. The higher performance ability of the method is demonstrated by several examples. ",
    "url": "https://arxiv.org/abs/2203.04609",
    "authors": [
      "Ying Wen",
      "Temuer Chaolu"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2203.04614",
    "title": "Uni4Eye: Unified 2D and 3D Self-supervised Pre-training via Masked Image  Modeling Transformer for Ophthalmic Image Classification",
    "abstract": "A large-scale labeled dataset is a key factor for the success of supervised deep learning in computer vision. However, a limited number of annotated data is very common, especially in ophthalmic image analysis, since manual annotation is time-consuming and labor-intensive. Self-supervised learning (SSL) methods bring huge opportunities for better utilizing unlabeled data, as they do not need massive annotations. With an attempt to use as many as possible unlabeled ophthalmic images, it is necessary to break the dimension barrier, simultaneously making use of both 2D and 3D images. In this paper, we propose a universal self-supervised Transformer framework, named Uni4Eye, to discover the inherent image property and capture domain-specific feature embedding in ophthalmic images. Uni4Eye can serve as a global feature extractor, which builds its basis on a Masked Image Modeling task with a Vision Transformer (ViT) architecture. We employ a Unified Patch Embedding module to replace the origin patch embedding module in ViT for jointly processing both 2D and 3D input images. Besides, we design a dual-branch multitask decoder module to simultaneously perform two reconstruction tasks on the input image and its gradient map, delivering discriminative representations for better convergence. We evaluate the performance of our pre-trained Uni4Eye encoder by fine-tuning it on six downstream ophthalmic image classification tasks. The superiority of Uni4Eye is successfully established through comparisons to other state-of-the-art SSL pre-training methods. ",
    "url": "https://arxiv.org/abs/2203.04614",
    "authors": [
      "Zhiyuan Cai",
      "Huaqing He",
      "Li Lin",
      "Xiaoying Tang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04666",
    "title": "Quantum neural networks force fields generation",
    "abstract": "Accurate molecular force fields are of paramount importance for the efficient implementation of molecular dynamics techniques at large scales. In the last decade, machine learning methods have demonstrated impressive performances in predicting accurate values for energy and forces when trained on finite size ensembles generated with ab initio techniques. At the same time, quantum computers have recently started to offer new viable computational paradigms to tackle such problems. On the one hand, quantum algorithms may notably be used to extend the reach of electronic structure calculations. On the other hand, quantum machine learning is also emerging as an alternative and promising path to quantum advantage. Here we follow this second route and establish a direct connection between classical and quantum solutions for learning neural network potentials. To this end, we design a quantum neural network architecture and apply it successfully to different molecules of growing complexity. The quantum models exhibit larger effective dimension with respect to classical counterparts and can reach competitive performances, thus pointing towards potential quantum advantages in natural science applications via quantum machine learning. ",
    "url": "https://arxiv.org/abs/2203.04666",
    "authors": [
      "Oriel Kiss",
      "Francesco Tacchino",
      "Sofia Vallecorsa",
      "Ivano Tavernelli"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "Chemical Physics (physics.chem-ph)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2203.04695",
    "title": "Structured Multi-task Learning for Molecular Property Prediction",
    "abstract": "Multi-task learning for molecular property prediction is becoming increasingly important in drug discovery. However, in contrast to other domains, the performance of multi-task learning in drug discovery is still not satisfying as the number of labeled data for each task is too limited, which calls for additional data to complement the data scarcity. In this paper, we study multi-task learning for molecular property prediction in a novel setting, where a relation graph between tasks is available. We first construct a dataset including around 400 tasks as well as a task relation graph. Then to better utilize such relation graph, we propose a method called SGNN-EBM to systematically investigate the structured task modeling from two perspectives. (1) In the \\emph{latent} space, we model the task representations by applying a state graph neural network (SGNN) on the relation graph. (2) In the \\emph{output} space, we employ structured prediction with the energy-based model (EBM), which can be efficiently trained through noise-contrastive estimation (NCE) approach. Empirical results justify the effectiveness of SGNN-EBM. Code is available on https://github.com/chao1224/SGNN-EBM. ",
    "url": "https://arxiv.org/abs/2203.04695",
    "authors": [
      "Shengchao Liu",
      "Meng Qu",
      "Zuobai Zhang",
      "Huiyu Cai",
      "Jian Tang"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.04697",
    "title": "Non-equilibrium molecular geometries in graph neural networks",
    "abstract": "Graph neural networks have become a powerful framework for learning complex structure-property relationships and fast screening of chemical compounds. Recently proposed methods have demonstrated that using 3D geometry information of the molecule along with the bonding structure can lead to more accurate prediction on a wide range of properties. A common practice is to use 3D geometries computed through density functional theory (DFT) for both training and testing of models. However, the computational time needed for DFT calculations can be prohibitively large. Moreover, many of the properties that we aim to predict can often be obtained with little or no overhead on top of the DFT calculations used to produce the 3D geometry information, voiding the need for a predictive model. To be practically useful for high-throughput chemical screening and drug discovery, it is desirable to work with 3D geometries obtained using less-accurate but much more efficient non-DFT methods. In this work we investigate the impact of using non-DFT conformations in the training and the testing of existing models and propose a data augmentation method for improving the prediction accuracy of classical forcefield-derived geometries. ",
    "url": "https://arxiv.org/abs/2203.04697",
    "authors": [
      "Ali Raza",
      "E. Adrian Henle",
      "Xiaoli Fern"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04767",
    "title": "A practical framework for multi-domain speech recognition and an  instance sampling method to neural language modeling",
    "abstract": "Automatic speech recognition (ASR) systems used on smart phones or vehicles are usually required to process speech queries from very different domains. In such situations, a vanilla ASR system usually fails to perform well on every domain. This paper proposes a multi-domain ASR framework for Tencent Map, a navigation app used on smart phones and in-vehicle infotainment systems. The proposed framework consists of three core parts: a basic ASR module to generate n-best lists of a speech query, a text classification module to determine which domain the speech query belongs to, and a reranking module to rescore n-best lists using domain-specific language models. In addition, an instance sampling based method to training neural network language models (NNLMs) is proposed to address the data imbalance problem in multi-domain ASR. In experiments, the proposed framework was evaluated on navigation domain and music domain, since navigating and playing music are two main features of Tencent Map. Compared to a general ASR system, the proposed framework achieves a relative 13% $\\sim$ 22% character error rate reduction on several test sets collected from Tencent Map and our in-car voice assistant. ",
    "url": "https://arxiv.org/abs/2203.04767",
    "authors": [
      "Yike Zhang",
      "Xiaobing Feng",
      "Yi Liu",
      "Songjun Cao",
      "Long Ma"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2203.04769",
    "title": "Autoregressive based Drift Detection Method",
    "abstract": "In the classic machine learning framework, models are trained on historical data and used to predict future values. It is assumed that the data distribution does not change over time (stationarity). However, in real-world scenarios, the data generation process changes over time and the model has to adapt to the new incoming data. This phenomenon is known as concept drift and leads to a decrease in the predictive model's performance. In this study, we propose a new concept drift detection method based on autoregressive models called ADDM. This method can be integrated into any machine learning algorithm from deep neural networks to simple linear regression model. Our results show that this new concept drift detection method outperforms the state-of-the-art drift detection methods, both on synthetic data sets and real-world data sets. Our approach is theoretically guaranteed as well as empirical and effective for the detection of various concept drifts. In addition to the drift detector, we proposed a new method of concept drift adaptation based on the severity of the drift. ",
    "url": "https://arxiv.org/abs/2203.04769",
    "authors": [
      "Mansour Zoubeirou A Mayaki",
      "Michel Riveill"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04876",
    "title": "Structural & Granger CAUSALITY for IoT Digital Twin",
    "abstract": "In this foundational expository article on the application of Causality Analysis in IoT, we establish the basic theory and algorithms for estimating Structural and Granger causality factors from measured multichannel sensor data (vector timeseries). Vector timeseries is modeled as a Structural Vector Autoregressive (SVAR) model; utilizing Kalman Filter and Independent Component Analysis (ICA) methods, Structural and generalized Granger causality factors are estimated. The estimated causal factors are presented as a Fence graph which we call Causal Digital Twin. Practical applications of Causal Digital Twin are demonstrated on NASA Prognostic Data Repository Bearing data collection. Use of Causal Digital Twin for counterfactual experiments are indicated. Causal Digital Twin is a horizontal solution that applies to diverse use cases in multiple industries such as Industrial, Manufacturing, Automotive, Consumer, Building and Smart City. ",
    "url": "https://arxiv.org/abs/2203.04876",
    "authors": [
      "PG Madhavan"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.04920",
    "title": "Why Interpretable Causal Inference is Important for High-Stakes Decision  Making for Critically Ill Patients and How To Do It",
    "abstract": "Many fundamental problems affecting the care of critically ill patients lead to similar analytical challenges: physicians cannot easily estimate the effects of at-risk medical conditions or treatments because the causal effects of medical conditions and drugs are entangled. They also cannot easily perform studies: there are not enough high-quality data for high-dimensional observational causal inference, and RCTs often cannot ethically be conducted. However, mechanistic knowledge is available, including how drugs are absorbed into the body, and the combination of this knowledge with the limited data could potentially suffice -- if we knew how to combine them. In this work, we present a framework for interpretable estimation of causal effects for critically ill patients under exactly these complex conditions: interactions between drugs and observations over time, patient data sets that are not large, and mechanistic knowledge that can substitute for lack of data. We apply this framework to an extremely important problem affecting critically ill patients, namely the effect of seizures and other potentially harmful electrical events in the brain (called epileptiform activity -- EA) on outcomes. Given the high stakes involved and the high noise in the data, interpretability is critical for troubleshooting such complex problems. Interpretability of our matched groups allowed neurologists to perform chart reviews to verify the quality of our causal analysis. For instance, our work indicates that a patient who experiences a high level of seizure-like activity (75% high EA burden) and is untreated for a six-hour window, has, on average, a 16.7% increased chance of adverse outcomes such as severe brain damage, lifetime disability, or death. We find that patients with mild but long-lasting EA (average EA burden >= 50%) have their risk of an adverse outcome increased by 11.2%. ",
    "url": "https://arxiv.org/abs/2203.04920",
    "authors": [
      "Harsh Parikh",
      "Kentaro Hoffman",
      "Haoqi Sun",
      "Wendong Ge",
      "Jin Jing",
      "Rajesh Amerineni",
      "Lin Liu",
      "Jimeng Sun",
      "Sahar Zafar",
      "Aaron Struck",
      "Alexander Volfovsky",
      "Cynthia Rudin",
      "M. Brandon Westover"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2003.10774",
    "title": "Notes on Equitable Partitions into Matching Forests in Mixed Graphs and  into $b$-branchings in Digraphs",
    "abstract": " Title: Notes on Equitable Partitions into Matching Forests in Mixed Graphs and  into $b$-branchings in Digraphs ",
    "url": "https://arxiv.org/abs/2003.10774",
    "authors": [
      "Kenjiro Takazawa"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2005.09007",
    "title": "U$^2$-Net: Going Deeper with Nested U-Structure for Salient Object  Detection",
    "abstract": " Comments: Accepted in Pattern Recognition 2020 ",
    "url": "https://arxiv.org/abs/2005.09007",
    "authors": [
      "Xuebin Qin",
      "Zichen Zhang",
      "Chenyang Huang",
      "Masood Dehghan",
      "Osmar R. Zaiane",
      "Martin Jagersand"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2006.07001",
    "title": "Markov Random Geometric Graph (MRGG): A Growth Model for Temporal  Dynamic Networks",
    "abstract": " Title: Markov Random Geometric Graph (MRGG): A Growth Model for Temporal  Dynamic Networks ",
    "url": "https://arxiv.org/abs/2006.07001",
    "authors": [
      "Quentin Duchemin",
      "Yohann de Castro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2007.02859",
    "title": "Weight Distribution of Classical Codes Influences Robust Quantum  Metrology",
    "abstract": " Comments: 20 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2007.02859",
    "authors": [
      "Yingkai Ouyang",
      "Narayanan Rengaswamy"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2007.07993",
    "title": "Bitcoin Transaction Forecasting with Deep Network Representation  Learning",
    "abstract": " Title: Bitcoin Transaction Forecasting with Deep Network Representation  Learning ",
    "url": "https://arxiv.org/abs/2007.07993",
    "authors": [
      "Wenqi Wei",
      "Qi Zhang",
      "Ling Liu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2008.11238",
    "title": "A Pipeline to Understand Emerging Illness via Social Media Data  Analysis: A Case Study on Breast Implant Illness",
    "abstract": " Comments: The manuscript has been accepted at the JMIR Medical Informatics ",
    "url": "https://arxiv.org/abs/2008.11238",
    "authors": [
      "Vishal Dey",
      "Peter Krasniak",
      "Minh Nguyen",
      "Clara Lee",
      "Xia Ning"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2009.05303",
    "title": "CatGCN: Graph Convolutional Networks with Categorical Node Features",
    "abstract": " Comments: Accepted by TKDE as a regular paper ",
    "url": "https://arxiv.org/abs/2009.05303",
    "authors": [
      "Weijian Chen",
      "Fuli Feng",
      "Qifan Wang",
      "Xiangnan He",
      "Chonggang Song",
      "Guohui Ling",
      "Yongdong Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2011.10520",
    "title": "Rethinking Weight Decay For Efficient Neural Network Pruning",
    "abstract": " Comments: 23 pages, 18 figures, published at Journal of Imaging, update : added new results, rewrite ",
    "url": "https://arxiv.org/abs/2011.10520",
    "authors": [
      "Hugo Tessier",
      "Vincent Gripon",
      "Mathieu Léonardon",
      "Matthieu Arzel",
      "Thomas Hannagan",
      "David Bertrand"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2011.11974",
    "title": "UKPGAN: A General Self-Supervised Keypoint Detector",
    "abstract": " Comments: Accepted to CVPR2022 ",
    "url": "https://arxiv.org/abs/2011.11974",
    "authors": [
      "Yang You",
      "Wenhai Liu",
      "Yanjie Ze",
      "Yong-Lu Li",
      "Weiming Wang",
      "Cewu Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2011.12001",
    "title": "Canonical Voting: Towards Robust Oriented Bounding Box Detection in 3D  Scenes",
    "abstract": " Comments: Accepted to CVPR2022 ",
    "url": "https://arxiv.org/abs/2011.12001",
    "authors": [
      "Yang You",
      "Zelin Ye",
      "Yujing Lou",
      "Chengkun Li",
      "Yong-Lu Li",
      "Lizhuang Ma",
      "Weiming Wang",
      "Cewu Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2102.04252",
    "title": "HINT: Hierarchical Interaction Network for Trial Outcome Prediction  Leveraging Web Data",
    "abstract": " Title: HINT: Hierarchical Interaction Network for Trial Outcome Prediction  Leveraging Web Data ",
    "url": "https://arxiv.org/abs/2102.04252",
    "authors": [
      "Tianfan Fu",
      "Kexin Huang",
      "Cao Xiao",
      "Lucas M. Glass",
      "Jimeng Sun"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.04447",
    "title": "SCTN: Sparse Convolution-Transformer Network for Scene Flow Estimation",
    "abstract": " Comments: Accepted to the 36th AAAI Conference on Artificial Intelligence (AAAI 2022) ",
    "url": "https://arxiv.org/abs/2105.04447",
    "authors": [
      "Bing Li",
      "Cheng Zheng",
      "Silvio Giancola",
      "Bernard Ghanem"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2105.04642",
    "title": "SUPR-GAN: SUrgical PRediction GAN for Event Anticipation in Laparoscopic  and Robotic Surgery",
    "abstract": " Comments: RA-L ICRA 2022 ",
    "url": "https://arxiv.org/abs/2105.04642",
    "authors": [
      "Yutong Ban",
      "Guy Rosman",
      "Jennifer A. Eckhoff",
      "Thomas M. Ward",
      "Daniel A. Hashimoto",
      "Taisei Kondo",
      "Hidekazu Iwaki",
      "Ozanan R. Meireles",
      "Daniela Rus"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.06543",
    "title": "Policy Optimization in Dynamic Bayesian Network Hybrid Models of  Biomanufacturing Processes",
    "abstract": " Comments: 36 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2105.06543",
    "authors": [
      "Hua Zheng",
      "Wei Xie",
      "Ilya O. Ryzhov",
      "Dongming Xie"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.10488",
    "title": "Understanding the Performance of Knowledge Graph Embeddings in Drug  Discovery",
    "abstract": " Title: Understanding the Performance of Knowledge Graph Embeddings in Drug  Discovery ",
    "url": "https://arxiv.org/abs/2105.10488",
    "authors": [
      "Stephen Bonner",
      "Ian P Barrett",
      "Cheng Ye",
      "Rowan Swiers",
      "Ola Engkvist",
      "Charles Tapley Hoyt",
      "William L Hamilton"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.01621",
    "title": "ERANNs: Efficient Residual Audio Neural Networks for Audio Pattern  Recognition",
    "abstract": " Comments: Experiments with UrbanSound8K was added. The quality of the manuscript and language was significantly improved. The paper is under consideration at Pattern Recognition Letters ",
    "url": "https://arxiv.org/abs/2106.01621",
    "authors": [
      "Sergey Verbitskiy",
      "Vladimir Berikov",
      "Viacheslav Vyshegorodtsev"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2106.03917",
    "title": "Mixture Outlier Exposure: Towards Out-of-Distribution Detection in  Fine-grained Environments",
    "abstract": " Title: Mixture Outlier Exposure: Towards Out-of-Distribution Detection in  Fine-grained Environments ",
    "url": "https://arxiv.org/abs/2106.03917",
    "authors": [
      "Jingyang Zhang",
      "Nathan Inkawhich",
      "Randolph Linderman",
      "Yiran Chen",
      "Hai Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.04928",
    "title": "Reliable Adversarial Distillation with Unreliable Teachers",
    "abstract": " Comments: ICLR2022 ",
    "url": "https://arxiv.org/abs/2106.04928",
    "authors": [
      "Jianing Zhu",
      "Jiangchao Yao",
      "Bo Han",
      "Jingfeng Zhang",
      "Tongliang Liu",
      "Gang Niu",
      "Jingren Zhou",
      "Jianliang Xu",
      "Hongxia Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.02517",
    "title": "Multi-task Federated Edge Learning (MtFEEL) in Wireless Networks",
    "abstract": " Title: Multi-task Federated Edge Learning (MtFEEL) in Wireless Networks ",
    "url": "https://arxiv.org/abs/2108.02517",
    "authors": [
      "Sawan Singh Mahara",
      "Shruti M.",
      "B. N. Bharath",
      "Akash Murthy"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.03594",
    "title": "MAF-GNN: Multi-adaptive Spatiotemporal-flow Graph Neural Network for  Traffic Speed Forecasting",
    "abstract": " Comments: The method has defects and needs to be improved ",
    "url": "https://arxiv.org/abs/2108.03594",
    "authors": [
      "Yaobin Xu",
      "Weitang Liu",
      "Zhongyi Jiang",
      "Zixuan Xu",
      "Tingyun Mao",
      "Lili Chen",
      "Mingwei Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.09711",
    "title": "FEDI: Few-shot learning based on Earth Mover's Distance algorithm  combined with deep residual network to identify diabetic retinopathy",
    "abstract": " Comments: The article has been significantly revised ",
    "url": "https://arxiv.org/abs/2108.09711",
    "authors": [
      "Liangrui Pan",
      "Boya Ji",
      "Peng Xi",
      "Xiaoqi Wang",
      "Mitchai Chongcheawchamnan",
      "Shaoliang Peng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.12492",
    "title": "Disrupting Adversarial Transferability in Deep Neural Networks",
    "abstract": " Comments: 20 pages, 13 figures ",
    "url": "https://arxiv.org/abs/2108.12492",
    "authors": [
      "Christopher Wiedeman",
      "Ge Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2108.13113",
    "title": "BDD-Based Algorithm for SCC Decomposition of Edge-Coloured Graphs",
    "abstract": " Title: BDD-Based Algorithm for SCC Decomposition of Edge-Coloured Graphs ",
    "url": "https://arxiv.org/abs/2108.13113",
    "authors": [
      "Nikola Beneš",
      "Luboš Brim",
      "Samuel Pastva",
      "David Šafránek"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2109.07723",
    "title": "Targeted Attack on Deep RL-based Autonomous Driving with Learned Visual  Patterns",
    "abstract": " Comments: 7 pages, 4 figures; Accepted at ICRA 2022 ",
    "url": "https://arxiv.org/abs/2109.07723",
    "authors": [
      "Prasanth Buddareddygari",
      "Travis Zhang",
      "Yezhou Yang",
      "Yi Ren"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.08975",
    "title": "AirLoop: Lifelong Loop Closure Detection",
    "abstract": " Title: AirLoop: Lifelong Loop Closure Detection ",
    "url": "https://arxiv.org/abs/2109.08975",
    "authors": [
      "Dasong Gao",
      "Chen Wang",
      "Sebastian Scherer"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.03336",
    "title": "Frame Averaging for Invariant and Equivariant Network Design",
    "abstract": " Title: Frame Averaging for Invariant and Equivariant Network Design ",
    "url": "https://arxiv.org/abs/2110.03336",
    "authors": [
      "Omri Puny",
      "Matan Atzmon",
      "Heli Ben-Hamu",
      "Ishan Misra",
      "Aditya Grover",
      "Edward J. Smith",
      "Yaron Lipman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.05419",
    "title": "Bottom-Up Constituency Parsing and Nested Named Entity Recognition with  Pointer Networks",
    "abstract": " Comments: ACL 2022 camera ready ",
    "url": "https://arxiv.org/abs/2110.05419",
    "authors": [
      "Songlin Yang",
      "Kewei Tu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2110.07480",
    "title": "Fusing Heterogeneous Factors with Triaffine Mechanism for Nested Named  Entity Recognition",
    "abstract": " Comments: Accepted by ACL 2022 Findings, Long Paper ",
    "url": "https://arxiv.org/abs/2110.07480",
    "authors": [
      "Zheng Yuan",
      "Chuanqi Tan",
      "Songfang Huang",
      "Fei Huang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2110.09741",
    "title": "Trajectory Prediction with Linguistic Representations",
    "abstract": " Comments: Accepted in ICRA 2022 ",
    "url": "https://arxiv.org/abs/2110.09741",
    "authors": [
      "Yen-Ling Kuo",
      "Xin Huang",
      "Andrei Barbu",
      "Stephen G. McGill",
      "Boris Katz",
      "John J. Leonard",
      "Guy Rosman"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.00841",
    "title": "Free Probability, Newton lilypads and hyperbolicity of Jacobians as a  solution to the problem of tuning the architecture of neural networks",
    "abstract": " Comments: 22 pages, 4 figures ; v1: Preliminary version ; v2: Added numerical benchmarks, and changed presentation ",
    "url": "https://arxiv.org/abs/2111.00841",
    "authors": [
      "Reda Chhaibi",
      "Tariq Daouda",
      "Ezechiel Kahn"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2111.04084",
    "title": "Statistical physics of exchangeable sparse simple networks, multiplex  networks and simplicial complexes",
    "abstract": " Comments: (25 pages, 1 figure) ",
    "url": "https://arxiv.org/abs/2111.04084",
    "authors": [
      "Ginestra Bianconi"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2111.04879",
    "title": "EvoLearner: Learning Description Logics with Evolutionary Algorithms",
    "abstract": " Comments: Accepted at WWW 2022 ",
    "url": "https://arxiv.org/abs/2111.04879",
    "authors": [
      "Stefan Heindorf",
      "Lukas Blübaum",
      "Nick Düsterhus",
      "Till Werner",
      "Varun Nandkumar Golani",
      "Caglar Demir",
      "Axel-Cyrille Ngonga Ngomo"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2111.07439",
    "title": "Improving Compound Activity Classification via Deep Transfer and  Representation Learning",
    "abstract": " Comments: This manuscript has been accepted at ACS Omega ",
    "url": "https://arxiv.org/abs/2111.07439",
    "authors": [
      "Vishal Dey",
      "Raghu Machiraju",
      "Xia Ning"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2111.13626",
    "title": "Hidden Markov Modeling over Graphs",
    "abstract": " Comments: Accepted to IEEE Data Science and Learning Workshop 2022 ",
    "url": "https://arxiv.org/abs/2111.13626",
    "authors": [
      "Mert Kayaalp",
      "Virginia Bordignon",
      "Stefan Vlaski",
      "Ali H. Sayed"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Multiagent Systems (cs.MA)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2111.13854",
    "title": "A novel knowledge graph development for industry design: A case study on  indirect coal liquefaction process",
    "abstract": " Comments: accepted by Computers in industry ",
    "url": "https://arxiv.org/abs/2111.13854",
    "authors": [
      "Zhenhua Wang",
      "Beike Zhang",
      "Dong Gao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2112.00459",
    "title": "Information Theoretic Representation Distillation",
    "abstract": " Title: Information Theoretic Representation Distillation ",
    "url": "https://arxiv.org/abs/2112.00459",
    "authors": [
      "Roy Miles",
      "Adrián López Rodríguez",
      "Krystian Mikolajczyk"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.03478",
    "title": "Generative Adversarial Networks for Labeled Data Creation for Structural  Monitoring and Damage Detection",
    "abstract": " Title: Generative Adversarial Networks for Labeled Data Creation for Structural  Monitoring and Damage Detection ",
    "url": "https://arxiv.org/abs/2112.03478",
    "authors": [
      "Furkan Luleci",
      "F. Necati Catbas",
      "Onur Avci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.08025",
    "title": "TLogic: Temporal Logical Rules for Explainable Link Forecasting on  Temporal Knowledge Graphs",
    "abstract": " Comments: Accepted at AAAI 2022 (36th AAAI Conference on Artificial Intelligence) ",
    "url": "https://arxiv.org/abs/2112.08025",
    "authors": [
      "Yushan Liu",
      "Yunpu Ma",
      "Marcel Hildebrandt",
      "Mitchell Joblin",
      "Volker Tresp"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.08088",
    "title": "Image-Adaptive YOLO for Object Detection in Adverse Weather Conditions",
    "abstract": " Comments: AAAI 2022, Preprint version with Appendix ",
    "url": "https://arxiv.org/abs/2112.08088",
    "authors": [
      "Wenyu Liu",
      "Gaofeng Ren",
      "Runsheng Yu",
      "Shi Guo",
      "Jianke Zhu",
      "Lei Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.14971",
    "title": "Contrastive Fine-grained Class Clustering via Generative Adversarial  Networks",
    "abstract": " Comments: ICLR 2022 ",
    "url": "https://arxiv.org/abs/2112.14971",
    "authors": [
      "Yunji Kim",
      "Jung-Woo Ha"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.05216",
    "title": "The Fairness Field Guide: Perspectives from Social and Formal Sciences",
    "abstract": " Comments: 40 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2201.05216",
    "authors": [
      "Alycia N. Carey",
      "Xintao Wu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.07199",
    "title": "Invariant Representation Driven Neural Classifier for Anti-QCD Jet  Tagging",
    "abstract": " Comments: 30 pages, 14 figures. References added; typos corrected. A few new results added ",
    "url": "https://arxiv.org/abs/2201.07199",
    "authors": [
      "Taoli Cheng",
      "Aaron Courville"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Experiment (hep-ex)"
    ]
  },
  {
    "id": "arXiv:2201.13392",
    "title": "MHSnet: Multi-head and Spatial Attention Network with False-Positive  Reduction for Pulmonary Nodules Detection",
    "abstract": " Title: MHSnet: Multi-head and Spatial Attention Network with False-Positive  Reduction for Pulmonary Nodules Detection ",
    "url": "https://arxiv.org/abs/2201.13392",
    "authors": [
      "Juanyun Mai",
      "Minghao Wang",
      "Jiayin Zheng",
      "Yanbo Shao",
      "Zhaoqi Diao",
      "Xinliang Fu",
      "Yulong Chen",
      "Jianyu Xiao",
      "Jian You",
      "Airu Yin",
      "Yang Yang",
      "Xiangcheng Qiu",
      "Jinsheng Tao",
      "Bo Wang",
      "Hua Ji"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.00804",
    "title": "Automatic event detection in football using tracking data",
    "abstract": " Comments: 32 pages, 18 figures ",
    "url": "https://arxiv.org/abs/2202.00804",
    "authors": [
      "Ferran Vidal-Codina",
      "Nicolas Evans",
      "Bahaeddine El Fakir",
      "Johsan Billingham"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.11099",
    "title": "Roto-Translation Equivariant Super-Resolution of Two-Dimensional Flows  Using Convolutional Neural Networks",
    "abstract": " Title: Roto-Translation Equivariant Super-Resolution of Two-Dimensional Flows  Using Convolutional Neural Networks ",
    "url": "https://arxiv.org/abs/2202.11099",
    "authors": [
      "Yuki Yasuda"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)"
    ]
  },
  {
    "id": "arXiv:2203.01116",
    "title": "Superiorized Adaptive Projected Subgradient Method with Application to  MIMO Detection",
    "abstract": " Comments: Submitted to IEEE Transactions on Signal Processing for possible publication ",
    "url": "https://arxiv.org/abs/2203.01116",
    "authors": [
      "Jochen Fink",
      "Renato L. G. Cavalcante",
      "Slawomir Stanczak"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2203.01994",
    "title": "Fast Neural Architecture Search for Lightweight Dense Prediction  Networks",
    "abstract": " Comments: 15 pages, 11 figures, 8 tables. arXiv admin note: substantial text overlap with arXiv:2108.11105 ",
    "url": "https://arxiv.org/abs/2203.01994",
    "authors": [
      "Lam Huynh",
      "Esa Rahtu",
      "Jiri Matas",
      "Janne Heikkila"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.03093",
    "title": "Derivative-Free Placement Optimization for Multi-UAV Wireless Networks  with Channel Knowledge Map",
    "abstract": " Title: Derivative-Free Placement Optimization for Multi-UAV Wireless Networks  with Channel Knowledge Map ",
    "url": "https://arxiv.org/abs/2203.03093",
    "authors": [
      "Haoyun Li",
      "Peiming Li",
      "Jie Xu",
      "Junting Chen",
      "Yong Zeng"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2203.03818",
    "title": "Shadows can be Dangerous: Stealthy and Effective Physical-world  Adversarial Attack by Natural Phenomenon",
    "abstract": " Comments: This paper has been accepted by CVPR2022. Code: this https URL ",
    "url": "https://arxiv.org/abs/2203.03818",
    "authors": [
      "Yiqi Zhong",
      "Xianming Liu",
      "Deming Zhai",
      "Junjun Jiang",
      "Xiangyang Ji"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.03916",
    "title": "Estimating the average causal effect of intervention in continuous  variables using machine learning",
    "abstract": " Title: Estimating the average causal effect of intervention in continuous  variables using machine learning ",
    "url": "https://arxiv.org/abs/2203.03916",
    "authors": [
      "Yoshiaki Kitazawa"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  }
]