[
  {
    "id": "arXiv:2205.06296",
    "title": "Integrating User and Item Reviews in Deep Cooperative Neural Networks  for Movie Recommendation",
    "abstract": "User evaluations include a significant quantity of information across online platforms. This information source has been neglected by the majority of existing recommendation systems, despite its potential to ease the sparsity issue and enhance the quality of suggestions. This work presents a deep model for concurrently learning item attributes and user behaviour from review text. Deep Cooperative Neural Networks (DeepCoNN) is the suggested model consisting of two parallel neural networks connected in their final layers. One of the networks focuses on learning user behaviour from reviews submitted by the user, while the other network learns item attributes from user reviews. On top, a shared layer is added to connect these two networks. Similar to factorization machine approaches, the shared layer allows latent factors acquired for people and things to interact with each other. On a number of datasets, DeepCoNN surpasses all baseline recommendation systems, according to experimental findings. ",
    "url": "https://arxiv.org/abs/2205.06296",
    "authors": [
      "Aristeidis Karras",
      "Christos Karras"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06315",
    "title": "Interface Networks for Failure Localization in Power Systems",
    "abstract": "Transmission power systems usually consist of interconnected sub-grids that are operated relatively independently. When a failure happens, it is desirable to localize its impact within the sub-grid where the failure occurs. This paper introduces three interface networks to connect sub-grids, achieving better failure localization while maintaining robust network connectivity. The proposed interface networks are validated with numerical experiments on the IEEE 118-bus test network under both DC and AC power flow models. ",
    "url": "https://arxiv.org/abs/2205.06315",
    "authors": [
      "Chen Liang",
      "Alessandro Zocca",
      "Steven H. Low",
      "Adam Wierman"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2205.06345",
    "title": "From Users to (Sense)Makers: On the Pivotal Role of Stigmergic Social  Annotation in the Quest for Collective Sensemaking",
    "abstract": "The web has become a dominant epistemic environment, influencing people's beliefs at a global scale. However, online epistemic environments are increasingly polluted, impairing societies' ability to coordinate effectively in the face of global crises. We argue that centralized platforms are a main source of epistemic pollution, and that healthier environments require redesigning how we collectively govern attention. Inspired by decentralization and open source software movements, we propose Open Source Attention, a socio-technical framework for \"freeing\" human attention from control by platforms, through a decentralized eco-system for creating, storing and querying stigmergic markers; the digital traces of human attention. ",
    "url": "https://arxiv.org/abs/2205.06345",
    "authors": [
      "Ronen Tamari",
      "Daniel Friedman",
      "William Fischer",
      "Lauren Hebert",
      "Dafna Shahaf"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2205.06351",
    "title": "Interpretable Climate Change Modeling With Progressive Cascade Networks",
    "abstract": "Typical deep learning approaches to modeling high-dimensional data often result in complex models that do not easily reveal a new understanding of the data. Research in the deep learning field is very actively pursuing new methods to interpret deep neural networks and to reduce their complexity. An approach is described here that starts with linear models and incrementally adds complexity only as supported by the data. An application is shown in which models that map global temperature and precipitation to years are trained to investigate patterns associated with changes in climate. ",
    "url": "https://arxiv.org/abs/2205.06351",
    "authors": [
      "Charles Anderson",
      "Jason Stock",
      "David Anderson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06359",
    "title": "Deep Learning for Prawn Farming: Forecasting and Anomaly Detection",
    "abstract": "We present a decision support system for managing water quality in prawn ponds. The system uses various sources of data and deep learning models in a novel way to provide 24-hour forecasting and anomaly detection of water quality parameters. It provides prawn farmers with tools to proactively avoid a poor growing environment, thereby optimising growth and reducing the risk of losing stock. This is a major shift for farmers who are forced to manage ponds by reactively correcting poor water quality conditions. To our knowledge, we are the first to apply Transformer as an anomaly detection model, and the first to apply anomaly detection in general to this aquaculture problem. Our technical contributions include adapting ForecastNet for multivariate data and adapting Transformer and the Attention model to incorporate weather forecast data into their decoders. We attain an average mean absolute percentage error of 12% for dissolved oxygen forecasts and we demonstrate two anomaly detection case studies. The system is successfully running in its second year of deployment on a commercial prawn farm. ",
    "url": "https://arxiv.org/abs/2205.06359",
    "authors": [
      "Joel Janek Dabrowski",
      "Ashfaqur Rahman",
      "Andrew Hellicar",
      "Mashud Rana",
      "Stuart Arnold"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06365",
    "title": "Fractional-Step Runge--Kutta Methods: Representation and Linear  Stability Analysis",
    "abstract": "Fractional-step methods are a popular and powerful divide-and-conquer approach for the numerical solution of differential equations. When the integrators of the fractional steps are Runge--Kutta methods, such methods can be written as generalized additive Runge--Kutta (GARK) methods, and thus the representation and analysis of such methods can be done through the GARK framework. We show how the general Butcher tableau representation and linear stability of such methods are related to the coefficients of the splitting method, the individual sub-integrators, and the order in which they are applied. We use this framework to explain some observations in the literature about fractional-step methods such as the choice of sub-integrators, the order in which they are applied, and the role played by negative splitting coefficients in the stability of the method. ",
    "url": "https://arxiv.org/abs/2205.06365",
    "authors": [
      "Raymond J. Spiteri",
      "Siqi Wei"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2205.06369",
    "title": "How to Combine Membership-Inference Attacks on Multiple Updated Models",
    "abstract": "A large body of research has shown that machine learning models are vulnerable to membership inference (MI) attacks that violate the privacy of the participants in the training data. Most MI research focuses on the case of a single standalone model, while production machine-learning platforms often update models over time, on data that often shifts in distribution, giving the attacker more information. This paper proposes new attacks that take advantage of one or more model updates to improve MI. A key part of our approach is to leverage rich information from standalone MI attacks mounted separately against the original and updated models, and to combine this information in specific ways to improve attack effectiveness. We propose a set of combination functions and tuning methods for each, and present both analytical and quantitative justification for various options. Our results on four public datasets show that our attacks are effective at using update information to give the adversary a significant advantage over attacks on standalone models, but also compared to a prior MI attack that takes advantage of model updates in a related machine-unlearning setting. We perform the first measurements of the impact of distribution shift on MI attacks with model updates, and show that a more drastic distribution shift results in significantly higher MI risk than a gradual shift. Our code is available at https://www.github.com/stanleykywu/model-updates. ",
    "url": "https://arxiv.org/abs/2205.06369",
    "authors": [
      "Matthew Jagielski",
      "Stanley Wu",
      "Alina Oprea",
      "Jonathan Ullman",
      "Roxana Geambasu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.06401",
    "title": "PoisonedEncoder: Poisoning the Unlabeled Pre-training Data in  Contrastive Learning",
    "abstract": "Contrastive learning pre-trains an image encoder using a large amount of unlabeled data such that the image encoder can be used as a general-purpose feature extractor for various downstream tasks. In this work, we propose PoisonedEncoder, a data poisoning attack to contrastive learning. In particular, an attacker injects carefully crafted poisoning inputs into the unlabeled pre-training data, such that the downstream classifiers built based on the poisoned encoder for multiple target downstream tasks simultaneously classify attacker-chosen, arbitrary clean inputs as attacker-chosen, arbitrary classes. We formulate our data poisoning attack as a bilevel optimization problem, whose solution is the set of poisoning inputs; and we propose a contrastive-learning-tailored method to approximately solve it. Our evaluation on multiple datasets shows that PoisonedEncoder achieves high attack success rates while maintaining the testing accuracy of the downstream classifiers built upon the poisoned encoder for non-attacker-chosen inputs. We also evaluate five defenses against PoisonedEncoder, including one pre-processing, three in-processing, and one post-processing defenses. Our results show that these defenses can decrease the attack success rate of PoisonedEncoder, but they also sacrifice the utility of the encoder or require a large clean pre-training dataset. ",
    "url": "https://arxiv.org/abs/2205.06401",
    "authors": [
      "Hongbin Liu",
      "Jinyuan Jia",
      "Neil Zhenqiang Gong"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06404",
    "title": "Fast Conditional Network Compression Using Bayesian HyperNetworks",
    "abstract": "We introduce a conditional compression problem and propose a fast framework for tackling it. The problem is how to quickly compress a pretrained large neural network into optimal smaller networks given target contexts, e.g. a context involving only a subset of classes or a context where only limited compute resource is available. To solve this, we propose an efficient Bayesian framework to compress a given large network into much smaller size tailored to meet each contextual requirement. We employ a hypernetwork to parameterize the posterior distribution of weights given conditional inputs and minimize a variational objective of this Bayesian neural network. To further reduce the network sizes, we propose a new input-output group sparsity factorization of weights to encourage more sparseness in the generated weights. Our methods can quickly generate compressed networks with significantly smaller sizes than baseline methods. ",
    "url": "https://arxiv.org/abs/2205.06404",
    "authors": [
      "Phuoc Nguyen",
      "Truyen Tran",
      "Ky Le",
      "Sunil Gupta",
      "Santu Rana",
      "Dang Nguyen",
      "Trong Nguyen",
      "Shannon Ryan",
      "Svetha Venkatesh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.06440",
    "title": "Exploiting Variational Domain-Invariant User Embedding for Partially  Overlapped Cross Domain Recommendation",
    "abstract": "Cross-Domain Recommendation (CDR) has been popularly studied to utilize different domain knowledge to solve the cold-start problem in recommender systems. Most of the existing CDR models assume that both the source and target domains share the same overlapped user set for knowledge transfer. However, only few proportion of users simultaneously activate on both the source and target domains in practical CDR tasks. In this paper, we focus on the Partially Overlapped Cross-Domain Recommendation (POCDR) problem, that is, how to leverage the information of both the overlapped and non-overlapped users to improve recommendation performance. Existing approaches cannot fully utilize the useful knowledge behind the non-overlapped users across domains, which limits the model performance when the majority of users turn out to be non-overlapped. To address this issue, we propose an end-to-end dual-autoencoder with Variational Domain-invariant Embedding Alignment (VDEA) model, a cross-domain recommendation framework for the POCDR problem, which utilizes dual variational autoencoders with both local and global embedding alignment for exploiting domain-invariant user embedding. VDEA first adopts variational inference to capture collaborative user preferences, and then utilizes Gromov-Wasserstein distribution co-clustering optimal transport to cluster the users with similar rating interaction behaviors. Our empirical studies on Douban and Amazon datasets demonstrate that VDEA significantly outperforms the state-of-the-art models, especially under the POCDR setting. ",
    "url": "https://arxiv.org/abs/2205.06440",
    "authors": [
      "Weiming Liu",
      "Xiaolin Zheng",
      "Mengling Hu",
      "Chaochao Chen"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2205.06451",
    "title": "Modularity in NEAT Reinforcement Learning Networks",
    "abstract": "Modularity is essential to many well-performing structured systems, as it is a useful means of managing complexity [8]. An analysis of modularity in neural networks produced by machine learning algorithms can offer valuable insight into the workings of such algorithms and how modularity can be leveraged to improve performance. However, this property is often overlooked in the neuroevolutionary literature, so the modular nature of many learning algorithms is unknown. This property was assessed on the popular algorithm \"NeuroEvolution of Augmenting Topologies\" (NEAT) for standard simulation benchmark control problems due to NEAT's ability to optimise network topology. This paper shows that NEAT networks seem to rapidly increase in modularity over time with the rate and convergence dependent on the problem. Interestingly, NEAT tends towards increasingly modular networks even when network fitness converges. It was shown that the ideal level of network modularity in the explored parameter space is highly dependent on other network variables, dispelling theories that modularity has a straightforward relationship to network performance. This is further proven in this paper by demonstrating that rewarding modularity directly did not improve fitness. ",
    "url": "https://arxiv.org/abs/2205.06451",
    "authors": [
      "Humphrey Munn",
      "Marcus Gallagher"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06456",
    "title": "Simple and Effective Relation-based Embedding Propagation for Knowledge  Representation Learning",
    "abstract": "Relational graph neural networks have garnered particular attention to encode graph context in knowledge graphs (KGs). Although they achieved competitive performance on small KGs, how to efficiently and effectively utilize graph context for large KGs remains an open problem. To this end, we propose the Relation-based Embedding Propagation (REP) method. It is a post-processing technique to adapt pre-trained KG embeddings with graph context. As relations in KGs are directional, we model the incoming head context and the outgoing tail context separately. Accordingly, we design relational context functions with no external parameters. Besides, we use averaging to aggregate context information, making REP more computation-efficient. We theoretically prove that such designs can avoid information distortion during propagation. Extensive experiments also demonstrate that REP has significant scalability while improving or maintaining prediction quality. Notably, it averagely brings about 10% relative improvement to triplet-based embedding methods on OGBL-WikiKG2 and takes 5%-83% time to achieve comparable results as the state-of-the-art GC-OTE. ",
    "url": "https://arxiv.org/abs/2205.06456",
    "authors": [
      "Huijuan Wang",
      "Siming Dai",
      "Weiyue Su",
      "Hui Zhong",
      "Zeyang Fang",
      "Zhengjie Huang",
      "Shikun Feng",
      "Zeyu Chen",
      "Yu Sun",
      "Dianhai Yu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.06468",
    "title": "Monocular Human Digitization via Implicit Re-projection Networks",
    "abstract": "We present an approach to generating 3D human models from images. The key to our framework is that we predict double-sided orthographic depth maps and color images from a single perspective projected image. Our framework consists of three networks. The first network predicts normal maps to recover geometric details such as wrinkles in the clothes and facial regions. The second network predicts shade-removed images for the front and back views by utilizing the predicted normal maps. The last multi-headed network takes both normal maps and shade-free images and predicts depth maps while selectively fusing photometric and geometric information through multi-headed attention gates. Experimental results demonstrate that our method shows visually plausible results and competitive performance in terms of various evaluation metrics over state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2205.06468",
    "authors": [
      "Min-Gyu Park",
      "Ju-Mi Kang",
      "Je Woo Kim",
      "Ju Hong Yoon"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.06469",
    "title": "l-Leaks: Membership Inference Attacks with Logits",
    "abstract": "Machine Learning (ML) has made unprecedented progress in the past several decades. However, due to the memorability of the training data, ML is susceptible to various attacks, especially Membership Inference Attacks (MIAs), the objective of which is to infer the model's training data. So far, most of the membership inference attacks against ML classifiers leverage the shadow model with the same structure as the target model. However, empirical results show that these attacks can be easily mitigated if the shadow model is not clear about the network structure of the target model. In this paper, We present attacks based on black-box access to the target model. We name our attack \\textbf{l-Leaks}. The l-Leaks follows the intuition that if an established shadow model is similar enough to the target model, then the adversary can leverage the shadow model's information to predict a target sample's membership.The logits of the trained target model contain valuable sample knowledge. We build the shadow model by learning the logits of the target model and making the shadow model more similar to the target model. Then shadow model will have sufficient confidence in the member samples of the target model. We also discuss the effect of the shadow model's different network structures to attack results. Experiments over different networks and datasets demonstrate that both of our attacks achieve strong performance. ",
    "url": "https://arxiv.org/abs/2205.06469",
    "authors": [
      "Shuhao Li",
      "Yajie Wang",
      "Yuanzhang Li",
      "Yu-an Tan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.06482",
    "title": "Opportunistic Routing aided Cooperative Communication Network with  Energy-Harvesting Nodes",
    "abstract": "In this paper, a cooperative communication network based on two energy-harvesting (EH) decode-and-forward (DF) relays which harvest energy from the ambience using buffers with harvest-store-use (HSU) architecture is considered. For improving the data delivery in this network, an opportunistic routing (OR) algorithm considering channel status information (CSI), location and energy buffer status of relays is proposed. For the sake of deriving the theoretical expressions for limiting distribution of energy stored in buffers with discrete-time continuous-state space Markov chain (DCSMC) model, the probabilities that the packet to be forwarded exists in one and more transmitting nodes are obtained based on the state transition matrix (STM). Moreover, the closed-form expressions for outage probability and throughput of the network based on the CSI and the limiting distributions of energy stored in buffers are presented. Numerous experiments have been performed to verify the derived theoretical expressions. ",
    "url": "https://arxiv.org/abs/2205.06482",
    "authors": [
      "Wannian An",
      "Chen Dong",
      "Xiaodong Xu",
      "Chao Xu",
      "Shujun Han",
      "Lei Teng"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2205.06495",
    "title": "Coded Caching at the Edge of Satellite Networks",
    "abstract": "Caching multimedia contents at the network edge is a key solution to decongest the amount of traffic in the backhaul link. In this paper, we extend and analyze the coded caching technique [1] in an unexplored scenario, i.e. at the edge of two-tier heterogeneous networks with an arbitrary number of users. We characterize the performance of such scheme by deriving a closed-form expression of the average backhaul load and reveal a significant gain compared to other benchmark caching schemes proposed in the literature. ",
    "url": "https://arxiv.org/abs/2205.06495",
    "authors": [
      "Estefania Recayte"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2205.06504",
    "title": "DualCF: Efficient Model Extraction Attack from Counterfactual  Explanations",
    "abstract": "Cloud service providers have launched Machine-Learning-as-a-Service (MLaaS) platforms to allow users to access large-scale cloudbased models via APIs. In addition to prediction outputs, these APIs can also provide other information in a more human-understandable way, such as counterfactual explanations (CF). However, such extra information inevitably causes the cloud models to be more vulnerable to extraction attacks which aim to steal the internal functionality of models in the cloud. Due to the black-box nature of cloud models, however, a vast number of queries are inevitably required by existing attack strategies before the substitute model achieves high fidelity. In this paper, we propose a novel simple yet efficient querying strategy to greatly enhance the querying efficiency to steal a classification model. This is motivated by our observation that current querying strategies suffer from decision boundary shift issue induced by taking far-distant queries and close-to-boundary CFs into substitute model training. We then propose DualCF strategy to circumvent the above issues, which is achieved by taking not only CF but also counterfactual explanation of CF (CCF) as pairs of training samples for the substitute model. Extensive and comprehensive experimental evaluations are conducted on both synthetic and real-world datasets. The experimental results favorably illustrate that DualCF can produce a high-fidelity model with fewer queries efficiently and effectively. ",
    "url": "https://arxiv.org/abs/2205.06504",
    "authors": [
      "Yongjie Wang",
      "Hangwei Qian",
      "Chunyan Miao"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06507",
    "title": "Precise Change Point Detection using Spectral Drift Detection",
    "abstract": "The notion of concept drift refers to the phenomenon that the data generating distribution changes over time; as a consequence machine learning models may become inaccurate and need adjustment. In this paper we consider the problem of detecting those change points in unsupervised learning. Many unsupervised approaches rely on the discrepancy between the sample distributions of two time windows. This procedure is noisy for small windows, hence prone to induce false positives and not able to deal with more than one drift event in a window. In this paper we rely on structural properties of drift induced signals, which use spectral properties of kernel embedding of distributions. Based thereon we derive a new unsupervised drift detection algorithm, investigate its mathematical properties, and demonstrate its usefulness in several experiments. ",
    "url": "https://arxiv.org/abs/2205.06507",
    "authors": [
      "Fabian Hinder",
      "André Artelt",
      "Valerie Vaquet",
      "Barbara Hammer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06531",
    "title": "Task Allocation for Energy Optimization in Fog Computing Networks with  Latency Constraints",
    "abstract": "Fog networks offer computing resources with varying capacities at different distances from end users. A Fog Node (FN) closer to the network edge may have less powerful computing resources compared to the cloud, but processing of computational tasks in an FN limits long-distance transmission. How should the tasks be distributed between fog and cloud nodes? We formulate a universal non-convex Mixed-Integer Nonlinear Programming (MINLP) problem minimizing task transmission- and processing-related energy with delay constraints to answer this question. It is transformed with Successive Convex Approximation (SCA) and decomposed using the primal and dual decomposition techniques. Two practical algorithms called Energy-EFFicient Resource Allocation (EEFFRA) and Low-Complexity (LC)-EEFFRA are proposed. They allow for successful distribution of network requests between FNs and the cloud in various scenarios significantly reducing the average energy cost and decreasing the number of computational requests with unmet delay requirements. ",
    "url": "https://arxiv.org/abs/2205.06531",
    "authors": [
      "Bartosz Kopras",
      "Bartosz Bossy",
      "Filip Idzikowski",
      "Paweł Kryszkiewicz",
      "Hanna Bogucka"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2205.06532",
    "title": "Addressing Confounding Feature Issue for Causal Recommendation",
    "abstract": "In recommender system, some feature directly affects whether an interaction would happen, making the happened interactions not necessarily indicate user preference. For instance, short videos are objectively easier to be finished even though the user does not like the video. We term such feature as confounding feature, and video length is a confounding feature in video recommendation. If we fit a model on such interaction data, just as done by most data-driven recommender systems, the model will be biased to recommend short videos more, and deviate from user actual requirement. This work formulates and addresses the problem from the causal perspective. Assuming there are some factors affecting both the confounding feature and other item features, e.g., the video creator, we find the confounding feature opens a backdoor path behind user item matching and introduces spurious correlation. To remove the effect of backdoor path, we propose a framework named Deconfounding Causal Recommendation (DCR), which performs intervened inference with do-calculus. Nevertheless, evaluating do calculus requires to sum over the prediction on all possible values of confounding feature, significantly increasing the time cost. To address the efficiency challenge, we further propose a mixture-of experts (MoE) model architecture, modeling each value of confounding feature with a separate expert module. Through this way, we retain the model expressiveness with few additional costs. We demonstrate DCR on the backbone model of neural factorization machine (NFM), showing that DCR leads to more accurate prediction of user preference with small inference time cost. ",
    "url": "https://arxiv.org/abs/2205.06532",
    "authors": [
      "Xiangnan He",
      "Yang Zhang",
      "Fuli Feng",
      "Chonggang Song",
      "Lingling Yi",
      "Guohui Ling",
      "Yongdong Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2205.06537",
    "title": "Productivity Assessment of Neural Code Completion",
    "abstract": "Neural code synthesis has reached a point where snippet generation is accurate enough to be considered for integration into human software development workflows. Commercial products aim to increase programmers' productivity, without being able to measure it directly. In this case study, we asked users of GitHub Copilot about its impact on their productivity, and sought to find a reflection of their perception in directly measurable user data. We find that the rate with which shown suggestions are accepted, rather than more specific metrics regarding the persistence of completions in the code over time, drives developers' perception of productivity. ",
    "url": "https://arxiv.org/abs/2205.06537",
    "authors": [
      "Albert Ziegler",
      "Eirini Kalliamvakou",
      "Shawn Simister",
      "Ganesh Sittampalam",
      "Alice Li",
      "Andrew Rice",
      "Devon Rifkin",
      "Edward Aftandilian"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06544",
    "title": "A Self-aware Personal Assistant for Making Personalized Privacy  Decisions",
    "abstract": "Many software systems, such as online social networks enable users to share information about themselves. While the action of sharing is simple, it requires an elaborate thought process on privacy: what to share, with whom to share, and for what purposes. Thinking about these for each piece of content to be shared is tedious. Recent approaches to tackle this problem build personal assistants that can help users by learning what is private over time and recommending privacy labels such as private or public to individual content that a user considers sharing. However, privacy is inherently ambiguous and highly personal. Existing approaches to recommend privacy decisions do not address these aspects of privacy sufficiently. Ideally, a personal assistant should be able to adjust its recommendation based on a given user, considering that user's privacy understanding. Moreover, the personal assistant should be able to assess when its recommendation would be uncertain and let the user make the decision on her own. Accordingly, this paper proposes a personal assistant that uses evidential deep learning to classify content based on its privacy label. An important characteristic of the personal assistant is that it can model its uncertainty in its decisions explicitly, determine that it does not know the answer, and delegate from making a recommendation when its uncertainty is high. By factoring in the user's own understanding of privacy, such as risk factors or own labels, the personal assistant can personalize its recommendations per user. We evaluate our proposed personal assistant using a well-known data set. Our results show that our personal assistant can accurately identify uncertain cases, personalize them to its user's needs, and thus helps users preserve their privacy well. ",
    "url": "https://arxiv.org/abs/2205.06544",
    "authors": [
      "Gonul Ayci",
      "Murat Sensoy",
      "Arzucan ÖzgÜr",
      "Pinar Yolum"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.06547",
    "title": "Uninorm-like parametric activation functions for human-understandable  neural models",
    "abstract": "We present a deep learning model for finding human-understandable connections between input features. Our approach uses a parameterized, differentiable activation function, based on the theoretical background of nilpotent fuzzy logic and multi-criteria decision-making (MCDM). The learnable parameter has a semantic meaning indicating the level of compensation between input features. The neural network determines the parameters using gradient descent to find human-understandable relationships between input features. We demonstrate the utility and effectiveness of the model by successfully applying it to classification problems from the UCI Machine Learning Repository. ",
    "url": "https://arxiv.org/abs/2205.06547",
    "authors": [
      "Orsolya Csiszár",
      "Luca Sára Pusztaházi",
      "Lehel Dénes-Fazakas",
      "Michael S. Gashler",
      "Vladik Kreinovich",
      "Gábor Csiszár"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06548",
    "title": "Meta Balanced Network for Fair Face Recognition",
    "abstract": "Although deep face recognition has achieved impressive progress in recent years, controversy has arisen regarding discrimination based on skin tone, questioning their deployment into real-world scenarios. In this paper, we aim to systematically and scientifically study this bias from both data and algorithm aspects. First, using the dermatologist approved Fitzpatrick Skin Type classification system and Individual Typology Angle, we contribute a benchmark called Identity Shades (IDS) database, which effectively quantifies the degree of the bias with respect to skin tone in existing face recognition algorithms and commercial APIs. Further, we provide two skin-tone aware training datasets, called BUPT-Globalface dataset and BUPT-Balancedface dataset, to remove bias in training data. Finally, to mitigate the algorithmic bias, we propose a novel meta-learning algorithm, called Meta Balanced Network (MBN), which learns adaptive margins in large margin loss such that the model optimized by this loss can perform fairly across people with different skin tones. To determine the margins, our method optimizes a meta skewness loss on a clean and unbiased meta set and utilizes backward-on-backward automatic differentiation to perform a second order gradient descent step on the current margins. Extensive experiments show that MBN successfully mitigates bias and learns more balanced performance for people with different skin tones in face recognition. The proposed datasets are available at this http URL ",
    "url": "https://arxiv.org/abs/2205.06548",
    "authors": [
      "Mei Wang",
      "Yaobin Zhang",
      "Weihong Deng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.06549",
    "title": "Unsupervised Structure-Texture Separation Network for Oracle Character  Recognition",
    "abstract": "Oracle bone script is the earliest-known Chinese writing system of the Shang dynasty and is precious to archeology and philology. However, real-world scanned oracle data are rare and few experts are available for annotation which make the automatic recognition of scanned oracle characters become a challenging task. Therefore, we aim to explore unsupervised domain adaptation to transfer knowledge from handprinted oracle data, which are easy to acquire, to scanned domain. We propose a structure-texture separation network (STSN), which is an end-to-end learning framework for joint disentanglement, transformation, adaptation and recognition. First, STSN disentangles features into structure (glyph) and texture (noise) components by generative models, and then aligns handprinted and scanned data in structure feature space such that the negative influence caused by serious noises can be avoided when adapting. Second, transformation is achieved via swapping the learned textures across domains and a classifier for final classification is trained to predict the labels of the transformed scanned characters. This not only guarantees the absolute separation, but also enhances the discriminative ability of the learned features. Extensive experiments on Oracle-241 dataset show that STSN outperforms other adaptation methods and successfully improves recognition performance on scanned data even when they are contaminated by long burial and careless excavation. ",
    "url": "https://arxiv.org/abs/2205.06549",
    "authors": [
      "Mei Wang",
      "Weihong Deng",
      "Cheng-Lin Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.06560",
    "title": "Kronecker Decomposition for Knowledge Graph Embeddings",
    "abstract": "Knowledge graph embedding research has mainly focused on learning continuous representations of entities and relations tailored towards the link prediction problem. Recent results indicate an ever increasing predictive ability of current approaches on benchmark datasets. However, this effectiveness often comes with the cost of over-parameterization and increased computationally complexity. The former induces extensive hyperparameter optimization to mitigate malicious overfitting. The latter magnifies the importance of winning the hardware lottery. Here, we investigate a remedy for the first problem. We propose a technique based on Kronecker decomposition to reduce the number of parameters in a knowledge graph embedding model, while retaining its expressiveness. Through Kronecker decomposition, large embedding matrices are split into smaller embedding matrices during the training process. Hence, embeddings of knowledge graphs are not plainly retrieved but reconstructed on the fly. The decomposition ensures that elementwise interactions between three embedding vectors are extended with interactions within each embedding vector. This implicitly reduces redundancy in embedding vectors and encourages feature reuse. To quantify the impact of applying Kronecker decomposition on embedding matrices, we conduct a series of experiments on benchmark datasets. Our experiments suggest that applying Kronecker decomposition on embedding matrices leads to an improved parameter efficiency on all benchmark datasets. Moreover, empirical evidence suggests that reconstructed embeddings entail robustness against noise in the input knowledge graph. To foster reproducible research, we provide an open-source implementation of our approach, including training and evaluation scripts as well as pre-trained models in our knowledge graph embedding framework (https://github.com/dice-group/dice-embeddings). ",
    "url": "https://arxiv.org/abs/2205.06560",
    "authors": [
      "Caglar Demir",
      "Julian Lienen",
      "Axel-Cyrille Ngonga Ngomo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.06564",
    "title": "An Ethical Black Box for Social Robots: a draft Open Standard",
    "abstract": "This paper introduces a draft open standard for the robot equivalent of an aircraft flight data recorder, which we call an ethical black box. This is a device, or software module, capable of securely recording operational data (sensor, actuator and control decisions) for a social robot, in order to support the investigation of accidents or near-miss incidents. The open standard, presented as an annex to this paper, is offered as a first draft for discussion within the robot ethics community. Our intention is to publish further drafts following feedback, in the hope that the standard will become a useful reference for social robot designers, operators and robot accident/incident investigators. ",
    "url": "https://arxiv.org/abs/2205.06564",
    "authors": [
      "Alan F.T. Winfield",
      "Anouk van Maris",
      "Pericle Salvini",
      "Marina Jirotka"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2205.06568",
    "title": "Self-Supervised Masking for Unsupervised Anomaly Detection and  Localization",
    "abstract": "Recently, anomaly detection and localization in multimedia data have received significant attention among the machine learning community. In real-world applications such as medical diagnosis and industrial defect detection, anomalies only present in a fraction of the images. To extend the reconstruction-based anomaly detection architecture to the localized anomalies, we propose a self-supervised learning approach through random masking and then restoring, named Self-Supervised Masking (SSM) for unsupervised anomaly detection and localization. SSM not only enhances the training of the inpainting network but also leads to great improvement in the efficiency of mask prediction at inference. Through random masking, each image is augmented into a diverse set of training triplets, thus enabling the autoencoder to learn to reconstruct with masks of various sizes and shapes during training. To improve the efficiency and effectiveness of anomaly detection and localization at inference, we propose a novel progressive mask refinement approach that progressively uncovers the normal regions and finally locates the anomalous regions. The proposed SSM method outperforms several state-of-the-arts for both anomaly detection and anomaly localization, achieving 98.3% AUC on Retinal-OCT and 93.9% AUC on MVTec AD, respectively. ",
    "url": "https://arxiv.org/abs/2205.06568",
    "authors": [
      "Chaoqin Huang",
      "Qinwei Xu",
      "Yanfeng Wang",
      "Yu Wang",
      "Ya Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.06570",
    "title": "Convergence of Deep Neural Networks with General Activation Functions  and Pooling",
    "abstract": "Deep neural networks, as a powerful system to represent high dimensional complex functions, play a key role in deep learning. Convergence of deep neural networks is a fundamental issue in building the mathematical foundation for deep learning. We investigated the convergence of deep ReLU networks and deep convolutional neural networks in two recent researches (arXiv:2107.12530, 2109.13542). Only the Rectified Linear Unit (ReLU) activation was studied therein, and the important pooling strategy was not considered. In this current work, we study the convergence of deep neural networks as the depth tends to infinity for two other important activation functions: the leaky ReLU and the sigmoid function. Pooling will also be studied. As a result, we prove that the sufficient condition established in arXiv:2107.12530, 2109.13542 is still sufficient for the leaky ReLU networks. For contractive activation functions such as the sigmoid function, we establish a weaker sufficient condition for uniform convergence of deep neural networks. ",
    "url": "https://arxiv.org/abs/2205.06570",
    "authors": [
      "Wentao Huang",
      "Yuesheng Xu",
      "Haizhang Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Functional Analysis (math.FA)"
    ]
  },
  {
    "id": "arXiv:2205.06571",
    "title": "Convergence Analysis of Deep Residual Networks",
    "abstract": "Various powerful deep neural network architectures have made great contribution to the exciting successes of deep learning in the past two decades. Among them, deep Residual Networks (ResNets) are of particular importance because they demonstrated great usefulness in computer vision by winning the first place in many deep learning competitions. Also, ResNets were the first class of neural networks in the development history of deep learning that are really deep. It is of mathematical interest and practical meaning to understand the convergence of deep ResNets. We aim at characterizing the convergence of deep ResNets as the depth tends to infinity in terms of the parameters of the networks. Toward this purpose, we first give a matrix-vector description of general deep neural networks with shortcut connections and formulate an explicit expression for the networks by using the notions of activation domains and activation matrices. The convergence is then reduced to the convergence of two series involving infinite products of non-square matrices. By studying the two series, we establish a sufficient condition for pointwise convergence of ResNets. Our result is able to give justification for the design of ResNets. We also conduct experiments on benchmark machine learning data to verify our results. ",
    "url": "https://arxiv.org/abs/2205.06571",
    "authors": [
      "Wentao Huang",
      "Haizhang Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Functional Analysis (math.FA)"
    ]
  },
  {
    "id": "arXiv:2205.06573",
    "title": "Knowledge Graph Question Answering Datasets and Their Generalizability:  Are They Enough for Future Research?",
    "abstract": "Existing approaches on Question Answering over Knowledge Graphs (KGQA) have weak generalizability. That is often due to the standard i.i.d. assumption on the underlying dataset. Recently, three levels of generalization for KGQA were defined, namely i.i.d., compositional, zero-shot. We analyze 25 well-known KGQA datasets for 5 different Knowledge Graphs (KGs). We show that according to this definition many existing and online available KGQA datasets are either not suited to train a generalizable KGQA system or that the datasets are based on discontinued and out-dated KGs. Generating new datasets is a costly process and, thus, is not an alternative to smaller research groups and companies. In this work, we propose a mitigation method for re-splitting available KGQA datasets to enable their applicability to evaluate generalization, without any cost and manual effort. We test our hypothesis on three KGQA datasets, i.e., LC-QuAD, LC-QuAD 2.0 and QALD-9). Experiments on re-splitted KGQA datasets demonstrate its effectiveness towards generalizability. The code and a unified way to access 18 available datasets is online at https://github.com/semantic-systems/KGQA-datasets as well as https://github.com/semantic-systems/KGQA-datasets-generalization. ",
    "url": "https://arxiv.org/abs/2205.06573",
    "authors": [
      "Longquan Jiang",
      "Ricardo Usbeck"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.06576",
    "title": "Distribution-Aware Graph Representation Learning for Transient Stability  Assessment of Power System",
    "abstract": "The real-time transient stability assessment (TSA) plays a critical role in the secure operation of the power system. Although the classic numerical integration method, \\textit{i.e.} time-domain simulation (TDS), has been widely used in industry practice, it is inevitably trapped in a high computational complexity due to the high latitude sophistication of the power system. In this work, a data-driven power system estimation method is proposed to quickly predict the stability of the power system before TDS reaches the end of simulating time windows, which can reduce the average simulation time of stability assessment without loss of accuracy. As the topology of the power system is in the form of graph structure, graph neural network based representation learning is naturally suitable for learning the status of the power system. Motivated by observing the distribution information of crucial active power and reactive power on the power system's bus nodes, we thus propose a distribution-aware learning~(DAL) module to explore an informative graph representation vector for describing the status of a power system. Then, TSA is re-defined as a binary classification task, and the stability of the system is determined directly from the resulting graph representation without numerical integration. Finally, we apply our method to the online TSA task. The case studies on the IEEE 39-bus system and Polish 2383-bus system demonstrate the effectiveness of our proposed method. ",
    "url": "https://arxiv.org/abs/2205.06576",
    "authors": [
      "Kaixuan Chen",
      "Shunyu Liu",
      "Na Yu",
      "Rong Yan",
      "Quan Zhang",
      "Jie Song",
      "Zunlei Feng",
      "Mingli Song"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.06603",
    "title": "Improving Contextual Representation with Gloss Regularized Pre-training",
    "abstract": "Though achieving impressive results on many NLP tasks, the BERT-like masked language models (MLM) encounter the discrepancy between pre-training and inference. In light of this gap, we investigate the contextual representation of pre-training and inference from the perspective of word probability distribution. We discover that BERT risks neglecting the contextual word similarity in pre-training. To tackle this issue, we propose an auxiliary gloss regularizer module to BERT pre-training (GR-BERT), to enhance word semantic similarity. By predicting masked words and aligning contextual embeddings to corresponding glosses simultaneously, the word similarity can be explicitly modeled. We design two architectures for GR-BERT and evaluate our model in downstream tasks. Experimental results show that the gloss regularizer benefits BERT in word-level and sentence-level semantic representation. The GR-BERT achieves new state-of-the-art in lexical substitution task and greatly promotes BERT sentence representation in both unsupervised and supervised STS tasks. ",
    "url": "https://arxiv.org/abs/2205.06603",
    "authors": [
      "Yu Lin",
      "Zhecheng An",
      "Peihao Wu",
      "Zejun Ma"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06618",
    "title": "The Devil is in the Details: On the Pitfalls of Vocabulary Selection in  Neural Machine Translation",
    "abstract": "Vocabulary selection, or lexical shortlisting, is a well-known technique to improve latency of Neural Machine Translation models by constraining the set of allowed output words during inference. The chosen set is typically determined by separately trained alignment model parameters, independent of the source-sentence context at inference time. While vocabulary selection appears competitive with respect to automatic quality metrics in prior work, we show that it can fail to select the right set of output words, particularly for semantically non-compositional linguistic phenomena such as idiomatic expressions, leading to reduced translation quality as perceived by humans. Trading off latency for quality by increasing the size of the allowed set is often not an option in real-world scenarios. We propose a model of vocabulary selection, integrated into the neural translation model, that predicts the set of allowed output words from contextualized encoder representations. This restores translation quality of an unconstrained system, as measured by human evaluations on WMT newstest2020 and idiomatic expressions, at an inference latency competitive with alignment-based selection using aggressive thresholds, thereby removing the dependency on separately trained alignment models. ",
    "url": "https://arxiv.org/abs/2205.06618",
    "authors": [
      "Tobias Domhan",
      "Eva Hasler",
      "Ke Tran",
      "Sony Trenous",
      "Bill Byrne",
      "Felix Hieber"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06628",
    "title": "Algorithms for spanning trees of unweighted networks",
    "abstract": "Spanning tree of a network or a graph is a subgraph connecting all the nodes with the minimum number of edges. Spanning tree retains the connectivity of a network and possibly other structural properties, and is one of the simplest techniques for network simplification or sampling, and for revealing its backbone or skeleton. The Prim's algorithm and the Kruskal's algorithm are well known algorithms for computing a spanning tree of a weighted network. In this paper, we study the performance of these algorithms on unweighted networks, and compare them to different priority-first search algorithms. We show that the distances between the nodes and the diameter of a network are best preserved by an algorithm based on the breadth-first search node traversal. The algorithm computes a spanning tree with properties of a balanced tree and a power-law node degree distribution. We support our results by experiments on synthetic graphs and more than a thousand real networks, and demonstrate different practical applications of computed spanning trees. We conclude that, if a spanning tree is supposed to retain the distances between the nodes or the diameter of an unweighted network, then the breadth-first search algorithm should be the preferred choice. ",
    "url": "https://arxiv.org/abs/2205.06628",
    "authors": [
      "Lovro Šubelj"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2205.06637",
    "title": "Energy-Delay Minimization of Task Migration Based on Game Theory in  MEC-assisted Vehicular Networks",
    "abstract": "Roadside units (RSUs), which have strong computing capability and are close to vehicle nodes, have been widely used to process delay- and computation-intensive tasks of vehicle nodes. However, due to their high mobility, vehicles may drive out of the coverage of RSUs before receiving the task processing results. In this paper, we propose a mobile edge computing-assisted vehicular network, where vehicles can offload their tasks to a nearby vehicle via a vehicle-to-vehicle (V2V) link or a nearby RSU via a vehicle-to-infrastructure link. These tasks are also migrated by a V2V link or an infrastructure-to-infrastructure (I2I) link to avoid the scenario where the vehicles cannot receive the processed task from the RSUs. Considering mutual interference from the same link of offloading tasks and migrating tasks, we construct a vehicle offloading decision-based game to minimize the computation overhead. We prove that the game can always achieve Nash equilibrium and convergence by exploiting the finite improvement property. We then propose a task migration (TM) algorithm that includes three task-processing methods and two task-migration methods. Based on the TM algorithm, computation overhead minimization offloading (COMO) algorithm is presented. Extensive simulation results show that the proposed TM and COMO algorithms reduce the computation overhead and increase the success rate of task processing. ",
    "url": "https://arxiv.org/abs/2205.06637",
    "authors": [
      "Haipeng Wang",
      "Tiejun Lv",
      "Zhipeng Lin",
      "Jie Zeng"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.06641",
    "title": "Privacy Preserving Release of Mobile Sensor Data",
    "abstract": "Sensors embedded in mobile smart devices can monitor users' activity with high accuracy to provide a variety of services to end-users ranging from precise geolocation, health monitoring, and handwritten word recognition. However, this involves the risk of accessing and potentially disclosing sensitive information of individuals to the apps that may lead to privacy breaches. In this paper, we aim to minimize privacy leakages that may lead to user identification on mobile devices through user tracking and distinguishability while preserving the functionality of apps and services. We propose a privacy-preserving mechanism that effectively handles the sensor data fluctuations (e.g., inconsistent sensor readings while walking, sitting, and running at different times) by formulating the data as time-series modeling and forecasting. The proposed mechanism also uses the notion of correlated noise-series against noise filtering attacks from an adversary, which aims to filter out the noise from the perturbed data to re-identify the original data. Unlike existing solutions, our mechanism keeps running in isolation without the interaction of a user or a service provider. We perform rigorous experiments on benchmark datasets and show that our proposed mechanism limits user tracking and distinguishability threats to a significant extent compared to the original data while maintaining a reasonable level of utility of functionalities. In general, we show that our obfuscation mechanism reduces the user trackability threat by 60\\% across all the datasets while maintaining the utility loss below 0.5 Mean Absolute Error (MAE). We also observe that our mechanism is more effective in large datasets. For example, with the Swipes dataset, the distinguishability risk is reduced by 60\\% on average while the utility loss is below 0.5 MAE. ",
    "url": "https://arxiv.org/abs/2205.06641",
    "authors": [
      "Rahat Masood",
      "Wing Yan Cheng",
      "Dinusha Vatsalan",
      "Deepak Mishra",
      "Hassan Jameel Asghar",
      "Mohamed Ali Kaafar"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.06658",
    "title": "A weighted first-order formulation for solving anisotropic diffusion  equations with deep neural networks",
    "abstract": "In this paper, a new weighted first-order formulation is proposed for solving the anisotropic diffusion equations with deep neural networks. For many numerical schemes, the accurate approximation of anisotropic heat flux is crucial for the overall accuracy. In this work, the heat flux is firstly decomposed into two components along the two eigenvectors of the diffusion tensor, thus the anisotropic heat flux approximation is converted into the approximation of two isotropic components. Moreover, to handle the possible jump of the diffusion tensor across the interface, the weighted first-order formulation is obtained by multiplying this first-order formulation by a weighted function. By the decaying property of the weighted function, the weighted first-order formulation is always well-defined in the pointwise way. Finally, the weighted first-order formulation is solved with deep neural network approximation. Compared to the neural network approximation with the original second-order elliptic formulation, the proposed method can significantly improve the accuracy, especially for the discontinuous anisotropic diffusion problems. ",
    "url": "https://arxiv.org/abs/2205.06658",
    "authors": [
      "Hui Xie",
      "Chuanlei Zhai",
      "Li Liu",
      "Heng Yong"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2205.06661",
    "title": "FLAD: Adaptive Federated Learning for DDoS Attack Detection",
    "abstract": "Federated Learning (FL) has been recently receiving increasing consideration from the cybersecurity community as a way to collaboratively train deep learning models with distributed profiles of cyberthreats, with no disclosure of training data. Nevertheless, the adoption of FL in cybersecurity is still in its infancy, and a range of practical aspects have not been properly addressed yet. Indeed, the Federated Averaging algorithm at the core of the FL concept requires the availability of test data to control the FL process. Although this might be feasible in some domains, test network traffic of newly discovered attacks cannot be always shared without disclosing sensitive information. In this paper, we address the convergence of the FL process in dynamic cybersecurity scenarios, where the trained model must be frequently updated with new recent attack profiles to empower all members of the federation with latest detection features. To this aim, we propose FLAD (adaptive Federated Learning Approach to DDoS attack detection), a FL solution for cybersecurity applications based on an adaptive mechanism that orchestrates the FL process by dynamically assigning more computation to those members whose attacks profiles are harder to learn, without the need of sharing any test data to monitor the performance of the trained model. Using a recent dataset of DDoS attacks, we demonstrate that FLAD outperforms the original FL algorithm in terms of convergence time and accuracy across a range of unbalanced datasets of heterogeneous DDoS attacks. We also show the robustness of our approach in a realistic scenario, where we retrain the deep learning model multiple times to introduce the profiles of new attacks on a pre-trained model. ",
    "url": "https://arxiv.org/abs/2205.06661",
    "authors": [
      "Roberto Doriguzzi-Corin",
      "Domenico Siracusa"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.06666",
    "title": "The Case for a Legal Compliance API for the Enforcement of the EU's  Digital Services Act on Social Media Platforms",
    "abstract": "In the course of under a year, the European Commission has launched some of the most important regulatory proposals to date on platform governance. The Commission's goals behind cross-sectoral regulation of this sort include the protection of markets and democracies alike. While all these acts propose sophisticated rules for setting up new enforcement institutions and procedures, one aspect remains highly unclear: how digital enforcement will actually take place in practice. Focusing on the Digital Services Act (DSA), this discussion paper critically addresses issues around social media data access for the purpose of digital enforcement and proposes the use of a legal compliance application programming interface (API) as a means to facilitate compliance with the DSA and complementary European and national regulation. To contextualize this discussion, the paper pursues two scenarios that exemplify the harms arising out of content monetization affecting a particularly vulnerable category of social media users: children. The two scenarios are used to further reflect upon essential issues surrounding data access and legal compliance with the DSA and further applicable legal standards in the field of labour and consumer law. ",
    "url": "https://arxiv.org/abs/2205.06666",
    "authors": [
      "Catalina Goanta",
      "Thales Bertaglia",
      "Adriana Iamnitchi"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.06672",
    "title": "Local Attention Graph-based Transformer for Multi-target Genetic  Alteration Prediction",
    "abstract": "Classical multiple instance learning (MIL) methods are often based on the identical and independent distributed assumption between instances, hence neglecting the potentially rich contextual information beyond individual entities. On the other hand, Transformers with global self-attention modules have been proposed to model the interdependencies among all instances. However, in this paper we question: Is global relation modeling using self-attention necessary, or can we appropriately restrict self-attention calculations to local regimes in large-scale whole slide images (WSIs)? We propose a general-purpose local attention graph-based Transformer for MIL (LA-MIL), introducing an inductive bias by explicitly contextualizing instances in adaptive local regimes of arbitrary size. Additionally, an efficiently adapted loss function enables our approach to learn expressive WSI embeddings for the joint analysis of multiple biomarkers. We demonstrate that LA-MIL achieves state-of-the-art results in mutation prediction for gastrointestinal cancer, outperforming existing models on important biomarkers such as microsatellite instability for colorectal cancer. This suggests that local self-attention sufficiently models dependencies on par with global modules. Our implementation will be published. ",
    "url": "https://arxiv.org/abs/2205.06672",
    "authors": [
      "Daniel Reisenbüchler",
      "Sophia J. Wagner",
      "Melanie Boxberg",
      "Tingying Peng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06684",
    "title": "The Effectiveness of Temporal Dependency in Deepfake Video Detection",
    "abstract": "Deepfakes are a form of synthetic image generation used to generate fake videos of individuals for malicious purposes. The resulting videos may be used to spread misinformation, reduce trust in media, or as a form of blackmail. These threats necessitate automated methods of deepfake video detection. This paper investigates whether temporal information can improve the deepfake detection performance of deep learning models. To investigate this, we propose a framework that classifies new and existing approaches by their defining characteristics. These are the types of feature extraction: automatic or manual, and the temporal relationship between frames: dependent or independent. We apply this framework to investigate the effect of temporal dependency on a model's deepfake detection performance. We find that temporal dependency produces a statistically significant (p < 0.05) increase in performance in classifying real images for the model using automatic feature selection, demonstrating that spatio-temporal information can increase the performance of deepfake video detection models. ",
    "url": "https://arxiv.org/abs/2205.06684",
    "authors": [
      "Will Rowan",
      "Nick Pears"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.06691",
    "title": "LSCDiscovery: A shared task on semantic change discovery and detection  in Spanish",
    "abstract": "We present the first shared task on semantic change discovery and detection in Spanish and create the first dataset of Spanish words manually annotated for semantic change using the DURel framework (Schlechtweg et al., 2018). The task is divided in two phases: 1) Graded Change Discovery, and 2) Binary Change Detection. In addition to introducing a new language the main novelty with respect to the previous tasks consists in predicting and evaluating changes for all vocabulary words in the corpus. Six teams participated in phase 1 and seven teams in phase 2 of the shared task, and the best system obtained a Spearman rank correlation of 0.735 for phase 1 and an F1 score of 0.716 for phase 2. We describe the systems developed by the competing teams, highlighting the techniques that were particularly useful and discuss the limits of these approaches. ",
    "url": "https://arxiv.org/abs/2205.06691",
    "authors": [
      "Frank D. Zamora-Reina",
      "Felipe Bravo-Marquez",
      "Dominik Schlechtweg"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.06704",
    "title": "Hyper-parameter tuning of physics-informed neural networks: Application  to Helmholtz problems",
    "abstract": "We consider physics-informed neural networks [Raissi et al., J. Comput. Phys. 278 (2019) 686-707] for forward physical problems. In order to find optimal PINNs configuration, we introduce a hyper-parameter tuning procedure via Gaussian processes-based Bayesian optimization. We apply the procedure to Helmholtz problems for bounded domains and conduct a thorough study, focusing on: (i) performance, (ii) the collocation points density $r$ and (iii) the frequency $\\kappa$, confirming the applicability and necessity of the method. Numerical experiments are performed in two and three dimensions, including comparison to finite element methods. ",
    "url": "https://arxiv.org/abs/2205.06704",
    "authors": [
      "Paul Escapil-Inchauspé",
      "Gonzalo A. Ruz"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.06708",
    "title": "The Capacity of Causal Adversarial Channels",
    "abstract": "We characterize the capacity for the discrete-time arbitrarily varying channel with discrete inputs, outputs, and states when (a) the encoder and decoder do not share common randomness, (b) the input and state are subject to cost constraints, (c) the transition matrix of the channel is deterministic given the state, and (d) at each time step the adversary can only observe the current and past channel inputs when choosing the state at that time. The achievable strategy involves stochastic encoding together with list decoding and a disambiguation step. The converse uses a two-phase \"babble-and-push\" strategy where the adversary chooses the state randomly in the first phase, list decodes the output, and then chooses state inputs to symmetrize the channel in the second phase. These results generalize prior work on specific channels models (additive, erasure) to general discrete alphabets and models. ",
    "url": "https://arxiv.org/abs/2205.06708",
    "authors": [
      "Yihan Zhang",
      "Sidharth Jaggi",
      "Michael Langberg",
      "Anand D. Sarwate"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2205.06716",
    "title": "A Vision Inspired Neural Network for Unsupervised Anomaly Detection in  Unordered Data",
    "abstract": "A fundamental problem in the field of unsupervised machine learning is the detection of anomalies corresponding to rare and unusual observations of interest; reasons include for their rejection, accommodation or further investigation. Anomalies are intuitively understood to be something unusual or inconsistent, whose occurrence sparks immediate attention. More formally anomalies are those observations-under appropriate random variable modelling-whose expectation of occurrence with respect to a grouping of prior interest is less than one; such a definition and understanding has been used to develop the parameter-free perception anomaly detection algorithm. The present work seeks to establish important and practical connections between the approach used by the perception algorithm and prior decades of research in neurophysiology and computational neuroscience; particularly that of information processing in the retina and visual cortex. The algorithm is conceptualised as a neuron model which forms the kernel of an unsupervised neural network that learns to signal unexpected observations as anomalies. Both the network and neuron display properties observed in biological processes including: immediate intelligence; parallel processing; redundancy; global degradation; contrast invariance; parameter-free computation, dynamic thresholds and non-linear processing. A robust and accurate model for anomaly detection in univariate and multivariate data is built using this network as a concrete application. ",
    "url": "https://arxiv.org/abs/2205.06716",
    "authors": [
      "Nassir Mohammad"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2205.06723",
    "title": "Multi-encoder Network for Parameter Reduction of a Kernel-based  Interpolation Architecture",
    "abstract": "Video frame interpolation involves the synthesis of new frames from existing ones. Convolutional neural networks (CNNs) have been at the forefront of the recent advances in this field. One popular CNN-based approach involves the application of generated kernels to the input frames to obtain an interpolated frame. Despite all the benefits interpolation methods offer, many of these networks require a lot of parameters, with more parameters meaning a heavier computational burden. Reducing the size of the model typically impacts performance negatively. This paper presents a method for parameter reduction for a popular flow-less kernel-based network (Adaptive Collaboration of Flows). Through our technique of removing the layers that require the most parameters and replacing them with smaller encoders, we reduce the number of parameters of the network and even achieve better performance compared to the original method. This is achieved by deploying rotation to force each individual encoder to learn different features from the input images. Ablations are conducted to justify design choices and an evaluation on how our method performs on full-length videos is presented. ",
    "url": "https://arxiv.org/abs/2205.06723",
    "authors": [
      "Issa Khalifeh",
      "Marc Gorriz Blanch",
      "Ebroul Izquierdo",
      "Marta Mrak"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.06732",
    "title": "Hybridized Discontinuous Galerkin Methods for a Multiple Network  Poroelasticity Model with Medical Applications",
    "abstract": "The quasi-static multiple network poroelastic theory (MPET) model, first introduced in the context of geomechanics, has recently found new applications in medicine. In practice, the parameters in the MPET equations can vary over several orders of magnitude which makes their stable discretization and fast solution a challenging task. Here, a new efficient parameter-robust hybridized discontinuous Galerkin method, which also features fluid mass conservation, is proposed for the MPET model. Its stability analysis which is crucial for the well-posedness of the discrete problem is performed and cost-efficient fast parameter-robust preconditioners are derived. We present a series of numerical computations for a 4-network MPET model of a human brain which support the performance of the new algorithms. ",
    "url": "https://arxiv.org/abs/2205.06732",
    "authors": [
      "Johannes Kraus",
      "Philip L. Lederer",
      "Maria Lymbery",
      "Kevin Osthues",
      "Joachim Schöberl"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2205.06747",
    "title": "Augmented Reality Appendages for Robots: Design Considerations and  Recommendations for Maximizing Social and Functional Perception",
    "abstract": "In order to address the limitations of gestural capabilities in physical robots, researchers in Virtual, Augmented, Mixed Reality Human-Robot Interaction (VAM-HRI) have been using augmented-reality visualizations that increase robot expressivity and improve user perception (e.g., social presence). While a multitude of virtual robot deictic gestures (e.g., pointing to an object) have been implemented to improve interactions within VAM-HRI, such systems are often reported to have tradeoffs between functional and social user perceptions of robots, creating a need for a unified approach that considers both attributes. We performed a literature analysis that selected factors that were noted to significantly influence either user perception or task efficiency and propose a set of design considerations and recommendations that address those factors by combining anthropomorphic and non-anthropomorphic virtual gestures based on the motivation of the interaction, visibility of the target and robot, salience of the target, and distance between the target and robot. The proposed recommendations provide the VAM-HRI community with starting points for selecting appropriate gesture types for a multitude of interaction contexts. ",
    "url": "https://arxiv.org/abs/2205.06747",
    "authors": [
      "Ipek Goktan",
      "Karen Ly",
      "Thomas R. Groechel",
      "Maja J. Mataric"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2205.06761",
    "title": "Exploring the structure-property relations of thin-walled, 2D extruded  lattices using neural networks",
    "abstract": "This paper investigates the structure-property relations of thin-walled lattices under dynamic longitudinal compression, characterized by their cross-sections and heights. These relations elucidate the interactions of different geometric features of a design on mechanical response, including energy absorption. We proposed a combinatorial, key-based design system to generate different lattice designs and used the finite element method to simulate their response with the Johnson-Cook material model. Using an autoencoder, we encoded the cross-sectional images of the lattices into latent design feature vectors, which were supplied to the neural network model to generate predictions. The trained models can accurately predict lattice energy absorption curves in the key-based design system and can be extended to new designs outside of the system via transfer learning. ",
    "url": "https://arxiv.org/abs/2205.06761",
    "authors": [
      "Junyan He",
      "Shashank Kushwaha",
      "Diab Abueidda",
      "Iwona Jasiuk"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06771",
    "title": "Empowered Neural Cellular Automata",
    "abstract": "Information-theoretic fitness functions are becoming increasingly popular to produce generally useful, task-independent behaviors. One such universal function, dubbed empowerment, measures the amount of control an agent exerts on its environment via its sensorimotor system. Specifically, empowerment attempts to maximize the mutual information between an agent's actions and its received sensor states at a later point in time. Traditionally, empowerment has been applied to a conventional sensorimotor apparatus, such as a robot. Here, we expand the approach to a distributed, multi-agent sensorimotor system embodied by a neural cellular automaton (NCA). We show that the addition of empowerment as a secondary objective in the evolution of NCA to perform the task of morphogenesis, growing and maintaining a pre-specified shape, results in higher fitness compared to evolving for morphogenesis alone. Results suggest there may be a synergistic relationship between morphogenesis and empowerment. That is, indirectly selecting for coordination between neighboring cells over the duration of development is beneficial to the developmental process itself. Such a finding may have applications in developmental biology by providing potential mechanisms of communication between cells during growth from a single cell to a multicellular, target morphology. Source code for the experiments in this paper can be found at: \\url{https://github.com/caitlingrasso/empowered-nca}. ",
    "url": "https://arxiv.org/abs/2205.06771",
    "authors": [
      "Caitlin Grasso",
      "Josh Bongard"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.06773",
    "title": "Optimized Partitioning and Priority Assignment of Real-Time Applications  on Heterogeneous Platforms with Hardware Acceleration",
    "abstract": "Hardware accelerators, such as those based on GPUs and FPGAs, offer an excellent opportunity to efficiently parallelize functionalities. Recently, modern embedded platforms started being equipped with such accelerators, resulting in a compelling choice for emerging, highly computational intensive workloads, like those required by next-generation autonomous driving systems. Alongside the need for computational efficiency, such workloads are commonly characterized by real-time requirements, which need to be satisfied to guarantee the safe and correct behavior of the system. To this end, this paper proposes a holistic framework to help designers partition real-time applications on heterogeneous platforms with hardware accelerators. The proposed model is inspired by a realistic setup of an advanced driving assistance system presented in the WATERS 2019 Challenge by Bosch, further generalized to encompass a broader range of heterogeneous architectures. The resulting analysis is linearized and used to encode an optimization problem that jointly (i) guarantees timing constraints, (ii) finds a suitable task-to-core mapping, (iii) assigns a priority to each task, and (iv) selects which computations to accelerate, seeking for the most convenient trade-off between the smaller worst-case execution time provided by accelerators and synchronization and queuing delays. ",
    "url": "https://arxiv.org/abs/2205.06773",
    "authors": [
      "Daniel Casini",
      "Paolo Pazzaglia",
      "Alessandro Biondi",
      "Marco Di Natale"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2205.06780",
    "title": "Automatic Root Cause Quantification for Missing Edges in JavaScript Call  Graphs (Extended Version)",
    "abstract": "Building sound and precise static call graphs for real-world JavaScript applications poses an enormous challenge, due to many hard-to-analyze language features. Further, the relative importance of these features may vary depending on the call graph algorithm being used and the class of applications being analyzed. In this paper, we present a technique to automatically quantify the relative importance of different root causes of call graph unsoundness for a set of target applications. The technique works by identifying the dynamic function data flows relevant to each call edge missed by the static analysis, correctly handling cases with multiple root causes and inter-dependent calls. We apply our approach to perform a detailed study of the recall of a state-of-the-art call graph construction technique on a set of framework-based web applications. The study yielded a number of useful insights. We found that while dynamic property accesses were the most common root cause of missed edges across the benchmarks, other root causes varied in importance depending on the benchmark, potentially useful information for an analysis designer. Further, with our approach, we could quickly identify and fix a recall issue in the call graph builder we studied, and also quickly assess whether a recent analysis technique for Node.js-based applications would be helpful for browser-based code. All of our code and data is publicly available, and many components of our technique can be re-used to facilitate future studies. ",
    "url": "https://arxiv.org/abs/2205.06780",
    "authors": [
      "Madhurima Chakraborty",
      "Renzo Olivares",
      "Manu Sridharan",
      "Behnaz Hassanshahi"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2205.06783",
    "title": "Embodied-Symbolic Contrastive Graph Self-Supervised Learning for  Molecular Graphs",
    "abstract": "Dual embodied-symbolic concept representations are the foundation for deep learning and symbolic AI integration. We discuss the use of dual embodied-symbolic concept representations for molecular graph representation learning, specifically with exemplar-based contrastive self-supervised learning (SSL). The embodied representations are learned from molecular graphs, and the symbolic representations are learned from the corresponding Chemical knowledge graph (KG). We use the Chemical KG to enhance molecular graphs with symbolic (semantic) knowledge and generate their augmented molecular graphs. We treat a molecular graph and its semantically augmented molecular graph as exemplars of the same semantic class, and use the pairs as positive pairs in exemplar-based contrastive SSL. ",
    "url": "https://arxiv.org/abs/2205.06783",
    "authors": [
      "Daniel T. Chang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06793",
    "title": "Bandwidth Cost of Code Conversions in the Split Regime",
    "abstract": "Distributed storage systems must store large amounts of data over long periods of time. To avoid data loss due to device failures, an $[n,k]$ erasure code is used to encode $k$ data symbols into a codeword of $n$ symbols that are stored across different devices. However, device failure rates change throughout the life of the data, and tuning $n$ and $k$ according to these changes has been shown to save significant storage space. Code conversion is the process of converting multiple codewords of an initial $[n^I,k^I]$ code into codewords of a final $[n^F,k^F]$ code that decode to the same set of data symbols. In this paper, we study conversion bandwidth, defined as the total amount of data transferred between nodes during conversion. In particular, we consider the case where the initial and final codes are MDS and a single initial codeword is split into several final codewords ($k^I=\\lambda^F k^F$ for integer $\\lambda^F \\geq 2$), called the split regime. We derive lower bounds on the conversion bandwidth in the split regime and propose constructions that significantly reduce conversion bandwidth and are optimal for certain parameters. ",
    "url": "https://arxiv.org/abs/2205.06793",
    "authors": [
      "Francisco Maturana",
      "K. V. Rashmi"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2205.06800",
    "title": "Distributed Transmission Control for Wireless Networks using Multi-Agent  Reinforcement Learning",
    "abstract": "We examine the problem of transmission control, i.e., when to transmit, in distributed wireless communications networks through the lens of multi-agent reinforcement learning. Most other works using reinforcement learning to control or schedule transmissions use some centralized control mechanism, whereas our approach is fully distributed. Each transmitter node is an independent reinforcement learning agent and does not have direct knowledge of the actions taken by other agents. We consider the case where only a subset of agents can successfully transmit at a time, so each agent must learn to act cooperatively with other agents. An agent may decide to transmit a certain number of steps into the future, but this decision is not communicated to the other agents, so it the task of the individual agents to attempt to transmit at appropriate times. We achieve this collaborative behavior through studying the effects of different actions spaces. We are agnostic to the physical layer, which makes our approach applicable to many types of networks. We submit that approaches similar to ours may be useful in other domains that use multi-agent reinforcement learning with independent agents. ",
    "url": "https://arxiv.org/abs/2205.06800",
    "authors": [
      "Collin Farquhar",
      "Prem Sagar Pattanshetty Vasanth Kumar",
      "Anu Jagannath",
      "Jithin Jagannath"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2205.06806",
    "title": "Goal-Guided Neural Cellular Automata: Learning to Control  Self-Organising Systems",
    "abstract": "Inspired by cellular growth and self-organization, Neural Cellular Automata (NCAs) have been capable of \"growing\" artificial cells into images, 3D structures, and even functional machines. NCAs are flexible and robust computational systems but -- similarly to many other self-organizing systems -- inherently uncontrollable during and after their growth process. We present an approach to control these type of systems called Goal-Guided Neural Cellular Automata (GoalNCA), which leverages goal encodings to control cell behavior dynamically at every step of cellular growth. This approach enables the NCA to continually change behavior, and in some cases, generalize its behavior to unseen scenarios. We also demonstrate the robustness of the NCA with its ability to preserve task performance, even when only a portion of cells receive goal information. ",
    "url": "https://arxiv.org/abs/2205.06806",
    "authors": [
      "Shyam Sudhakaran",
      "Elias Najarro",
      "Sebastian Risi"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06807",
    "title": "Transformation-Interaction-Rational Representation for Symbolic  Regression",
    "abstract": "Symbolic Regression searches for a function form that approximates a dataset often using Genetic Programming. Since there is usually no restriction to what form the function can have, Genetic Programming may return a hard to understand model due to non-linear function chaining or long expressions. A novel representation called Interaction-Transformation was recently proposed to alleviate this problem. In this representation, the function form is restricted to an affine combination of terms generated as the application of a single univariate function to the interaction of selected variables. This representation obtained competing solutions on standard benchmarks. Despite the initial success, a broader set of benchmarking functions revealed the limitations of the constrained representation. In this paper we propose an extension to this representation, called Transformation-Interaction-Rational representation that defines a new function form as the rational of two Interaction-Transformation functions. Additionally, the target variable can also be transformed with an univariate function. The main goal is to improve the approximation power while still constraining the overall complexity of the expression. We tested this representation with a standard Genetic Programming with crossover and mutation. The results show a great improvement when compared to its predecessor and a state-of-the-art performance for a large benchmark. ",
    "url": "https://arxiv.org/abs/2205.06807",
    "authors": [
      "Fabricio Olivetti de Franca"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06811",
    "title": "Nearly Optimal Algorithms for Linear Contextual Bandits with Adversarial  Corruptions",
    "abstract": "We study the linear contextual bandit problem in the presence of adversarial corruption, where the reward at each round is corrupted by an adversary, and the corruption level (i.e., the sum of corruption magnitudes over the horizon) is $C\\geq 0$. The best-known algorithms in this setting are limited in that they either are computationally inefficient or require a strong assumption on the corruption, or their regret is at least $C$ times worse than the regret without corruption. In this paper, to overcome these limitations, we propose a new algorithm based on the principle of optimism in the face of uncertainty. At the core of our algorithm is a weighted ridge regression where the weight of each chosen action depends on its confidence up to some threshold. We show that for both known $C$ and unknown $C$ cases, our algorithm with proper choice of hyperparameter achieves a regret that nearly matches the lower bounds. Thus, our algorithm is nearly optimal up to logarithmic factors for both cases. Notably, our algorithm achieves the near-optimal regret for both corrupted and uncorrupted cases ($C=0$) simultaneously. ",
    "url": "https://arxiv.org/abs/2205.06811",
    "authors": [
      "Jiafan He",
      "Dongruo Zhou",
      "Tong Zhang",
      "Quanquan Gu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.06313",
    "title": "Detailed Balanced Chemical Reaction Networks as Generalized Boltzmann  Machines",
    "abstract": "Can a micron sized sack of interacting molecules understand, and adapt to a constantly-fluctuating environment? Cellular life provides an existence proof in the affirmative, but the principles that allow for life's existence are far from being proven. One challenge in engineering and understanding biochemical computation is the intrinsic noise due to chemical fluctuations. In this paper, we draw insights from machine learning theory, chemical reaction network theory, and statistical physics to show that the broad and biologically relevant class of detailed balanced chemical reaction networks is capable of representing and conditioning complex distributions. These results illustrate how a biochemical computer can use intrinsic chemical noise to perform complex computations. Furthermore, we use our explicit physical model to derive thermodynamic costs of inference. ",
    "url": "https://arxiv.org/abs/2205.06313",
    "authors": [
      "William Poole",
      "Thomas Ouldridge",
      "Manoj Gopalkrishnan",
      "Erik Winfree"
    ],
    "subjectives": [
      "Molecular Networks (q-bio.MN)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06445",
    "title": "Personalized Adversarial Data Augmentation for Dysarthric and Elderly  Speech Recognition",
    "abstract": "Despite the rapid progress of automatic speech recognition (ASR) technologies targeting normal speech, accurate recognition of dysarthric and elderly speech remains highly challenging tasks to date. It is difficult to collect large quantities of such data for ASR system development due to the mobility issues often found among these users. To this end, data augmentation techniques play a vital role. In contrast to existing data augmentation techniques only modifying the speaking rate or overall shape of spectral contour, fine-grained spectro-temporal differences between dysarthric, elderly and normal speech are modelled using a novel set of speaker dependent (SD) generative adversarial networks (GAN) based data augmentation approaches in this paper. These flexibly allow both: a) temporal or speed perturbed normal speech spectra to be modified and closer to those of an impaired speaker when parallel speech data is available; and b) for non-parallel data, the SVD decomposed normal speech spectral basis features to be transformed into those of a target elderly speaker before being re-composed with the temporal bases to produce the augmented data for state-of-the-art TDNN and Conformer ASR system training. Experiments are conducted on four tasks: the English UASpeech and TORGO dysarthric speech corpora; the English DementiaBank Pitt and Cantonese JCCOCC MoCA elderly speech datasets. The proposed GAN based data augmentation approaches consistently outperform the baseline speed perturbation method by up to 0.91% and 3.0% absolute (9.61% and 6.4% relative) WER reduction on the TORGO and DementiaBank data respectively. Consistent performance improvements are retained after applying LHUC based speaker adaptation. ",
    "url": "https://arxiv.org/abs/2205.06445",
    "authors": [
      "Zengrui Jin",
      "Mengzhe Geng",
      "Jiajun Deng",
      "Tianzi Wang",
      "Shujie Hu",
      "Guinan Li",
      "Xunying Liu"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.06450",
    "title": "A microstructure estimation Transformer inspired by sparse  representation for diffusion MRI",
    "abstract": "Diffusion magnetic resonance imaging (dMRI) is an important tool in characterizing tissue microstructure based on biophysical models, which are complex and highly non-linear. Resolving microstructures with optimization techniques is prone to estimation errors and requires dense sampling in the q-space. Deep learning based approaches have been proposed to overcome these limitations. Motivated by the superior performance of the Transformer, in this work, we present a learning-based framework based on Transformer, namely, a Microstructure Estimation Transformer with Sparse Coding (METSC) for dMRI-based microstructure estimation with downsampled q-space data. To take advantage of the Transformer while addressing its limitation in large training data requirements, we explicitly introduce an inductive bias - model bias into the Transformer using a sparse coding technique to facilitate the training process. Thus, the METSC is composed with three stages, an embedding stage, a sparse representation stage, and a mapping stage. The embedding stage is a Transformer-based structure that encodes the signal to ensure the voxel is represented effectively. In the sparse representation stage, a dictionary is constructed by solving a sparse reconstruction problem that unfolds the Iterative Hard Thresholding (IHT) process. The mapping stage is essentially a decoder that computes the microstructural parameters from the output of the second stage, based on the weighted sum of normalized dictionary coefficients where the weights are also learned. We tested our framework on two dMRI models with downsampled q-space data, including the intravoxel incoherent motion (IVIM) model and the neurite orientation dispersion and density imaging (NODDI) model. The proposed method achieved up to 11.25 folds of acceleration in scan time and outperformed the other state-of-the-art learning-based methods. ",
    "url": "https://arxiv.org/abs/2205.06450",
    "authors": [
      "Tianshu Zheng",
      "Cong Sun",
      "Weihao Zheng",
      "Wen Shi",
      "Haotian Li",
      "Yi Sun",
      "Yi Zhang",
      "Guangbin Wang",
      "Chuyang Ye",
      "Dan Wu"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.06487",
    "title": "Asymptotics for connected graphs and irreducible tournaments",
    "abstract": "We compute the whole asymptotic expansion of the probability that a large uniform labeled graph is connected, and of the probability that a large uniform labeled tournament is irreducible. In both cases, we provide a combinatorial interpretation of the involved coefficients. ",
    "url": "https://arxiv.org/abs/2205.06487",
    "authors": [
      "Thierry Monteil",
      "Khaydar Nurligareev"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2205.06520",
    "title": "Simplex Closing Probabilities in Directed Graphs",
    "abstract": "Recent work in mathematical neuroscience has calculated the directed graph homology of the directed simplicial complex given by the brains sparse adjacency graph, the so called connectome. These biological connectomes show an abundance of both high-dimensional directed simplices and Betti-numbers in all viable dimensions - in contrast to Erd\\H{o}s-R\\'enyi-graphs of comparable size and density. An analysis of synthetically trained connectomes reveals similar findings, raising questions about the graphs comparability and the nature of origin of the simplices. We present a new method capable of delivering insight into the emergence of simplices and thus simplicial abundance. Our approach allows to easily distinguish simplex-rich connectomes of different origin. The method relies on the novel concept of an almost-d-simplex, that is, a simplex missing exactly one edge, and consequently the almost-d-simplex closing probability by dimension. We also describe a fast algorithm to identify almost-d-simplices in a given graph. Applying this method to biological and artificial data allows us to identify a mechanism responsible for simplex emergence, and suggests this mechanism is responsible for the simplex signature of the excitatory subnetwork of a statistical reconstruction of the mouse primary visual cortex. Our highly optimised code for this new method is publicly available. ",
    "url": "https://arxiv.org/abs/2205.06520",
    "authors": [
      "Florian Unger",
      "Jonathan Krebs",
      "Michael G. Müller"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Algebraic Topology (math.AT)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2205.06589",
    "title": "Discrete density comonads and graph parameters",
    "abstract": "Game comonads have brought forth a new approach to studying finite model theory categorically. By representing model comparison games semantically as comonads, they allow important logical and combinatorial properties to be exressed in terms of their Eilenberg-Moore coalgebras. As a result, a number of results from finite model theory, such as preservation theorems and homomorphism counting theorems, have been formalised and parameterised by comonads, giving rise to new results simply by varying the comonad. In this paper we study the limits of the comonadic approach in the combinatorial and homomorphism-counting aspect of the theory, regardless of whether any model comparison games are involved. We show that any standard graph parameter has a corresponding comonad, classifying the same class. This comonad is constructed via a simple Kan extension formula, making it the initial solution to this problem and, furthermore, automatically admitting a homomorphism-counting theorem. ",
    "url": "https://arxiv.org/abs/2205.06589",
    "authors": [
      "Samson Abramsky",
      "Tomáš Jakl",
      "Thomas Paine"
    ],
    "subjectives": [
      "Category Theory (math.CT)",
      "Logic in Computer Science (cs.LO)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2205.06673",
    "title": "Univariate and Multivariate LSTM Model for Short-Term Stock Market  Prediction",
    "abstract": "Designing robust and accurate prediction models has been a viable research area since a long time. While proponents of a well-functioning market predictors believe that it is difficult to accurately predict market prices but many scholars disagree. Robust and accurate prediction systems will not only be helpful to the businesses but also to the individuals in making their financial investments. This paper presents an LSTM model with two different input approaches for predicting the short-term stock prices of two Indian companies, Reliance Industries and Infosys Ltd. Ten years of historic data (2012-2021) is taken from the yahoo finance website to carry out analysis of proposed approaches. In the first approach, closing prices of two selected companies are directly applied on univariate LSTM model. For the approach second, technical indicators values are calculated from the closing prices and then collectively applied on Multivariate LSTM model. Short term market behaviour for upcoming days is evaluated. Experimental outcomes revel that approach one is useful to determine the future trend but multivariate LSTM model with technical indicators found to be useful in accurately predicting the future price behaviours. ",
    "url": "https://arxiv.org/abs/2205.06673",
    "authors": [
      "Vishal Kuber",
      "Divakar Yadav",
      "Arun Kr Yadav"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06675",
    "title": "Research on the correlation between text emotion mining and stock market  based on deep learning",
    "abstract": "This paper discusses how to crawl the data of financial forums such as stock bar, and conduct emotional analysis combined with the in-depth learning model. This paper will use the Bert model to train the financial corpus and predict the Shenzhen stock index. Through the comparative study of the maximal information coefficient (MIC), it is found that the emotional characteristics obtained by applying the BERT model to the financial corpus can be reflected in the fluctuation of the stock market, which is conducive to effectively improve the prediction accuracy. At the same time, this paper combines in-depth learning with financial texts to further explore the impact mechanism of investor sentiment on the stock market through in-depth learning, which will help the national regulatory authorities and policy departments to formulate more reasonable policies and guidelines for maintaining the stability of the stock market. ",
    "url": "https://arxiv.org/abs/2205.06675",
    "authors": [
      "Chenrui Zhang"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06758",
    "title": "Improving Astronomical Time-series Classification via Data Augmentation  with Generative Adversarial Networks",
    "abstract": "Due to the latest advances in technology, telescopes with significant sky coverage will produce millions of astronomical alerts per night that must be classified both rapidly and automatically. Currently, classification consists of supervised machine learning algorithms whose performance is limited by the number of existing annotations of astronomical objects and their highly imbalanced class distributions. In this work, we propose a data augmentation methodology based on Generative Adversarial Networks (GANs) to generate a variety of synthetic light curves from variable stars. Our novel contributions, consisting of a resampling technique and an evaluation metric, can assess the quality of generative models in unbalanced datasets and identify GAN-overfitting cases that the Fr\\'echet Inception Distance does not reveal. We applied our proposed model to two datasets taken from the Catalina and Zwicky Transient Facility surveys. The classification accuracy of variable stars is improved significantly when training with synthetic data and testing with real data with respect to the case of using only real data. ",
    "url": "https://arxiv.org/abs/2205.06758",
    "authors": [
      "Germán García-Jara",
      "Pavlos Protopapas",
      "Pablo A. Estévez"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06791",
    "title": "Multiple Domain Causal Networks",
    "abstract": "Observational studies are regarded as economic alternatives to randomized trials, often used in their stead to investigate and determine treatment efficacy. Due to lack of sample size, observational studies commonly combine data from multiple sources or different sites/centers. Despite the benefits of an increased sample size, a naive combination of multicenter data may result in incongruities stemming from center-specific protocols for generating cohorts or reactions towards treatments distinct to a given center, among other things. These issues arise in a variety of other contexts, including capturing a treatment effect related to an individual's unique biological characteristics. Existing methods for estimating heterogeneous treatment effects have not adequately addressed the multicenter context, but rather treat it simply as a means to obtain sufficient sample size. Additionally, previous approaches to estimating treatment effects do not straightforwardly generalize to the multicenter design, especially when required to provide treatment insights for patients from a new, unobserved center. To address these shortcomings, we propose Multiple Domain Causal Networks (MDCN), an approach that simultaneously strengthens the information sharing between similar centers while addressing the selection bias in treatment assignment through learning of a new feature embedding. In empirical evaluations, MDCN is consistently more accurate when estimating the heterogeneous treatment effect in new centers compared to benchmarks that adjust solely based on treatment imbalance or general center differences. Finally, we justify our approach by providing theoretical analyses that demonstrate that MDCN improves on the generalization bound of the new, unobserved target center. ",
    "url": "https://arxiv.org/abs/2205.06791",
    "authors": [
      "Tianhui Zhou",
      "William E. Carson IV",
      "Michael Hunter Klein",
      "David Carlson"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2002.04999",
    "title": "Differentiable Graph Module (DGM) for Graph Convolutional Networks",
    "abstract": " Title: Differentiable Graph Module (DGM) for Graph Convolutional Networks ",
    "url": "https://arxiv.org/abs/2002.04999",
    "authors": [
      "Anees Kazi",
      "Luca Cosmo",
      "Seyed-Ahmad Ahmadi",
      "Nassir Navab",
      "Michael Bronstein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2003.12641",
    "title": "Self-Supervised Learning for Domain Adaptation on Point-Clouds",
    "abstract": " Title: Self-Supervised Learning for Domain Adaptation on Point-Clouds ",
    "url": "https://arxiv.org/abs/2003.12641",
    "authors": [
      "Idan Achituve",
      "Haggai Maron",
      "Gal Chechik"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2003.13620",
    "title": "Latent-Graph Learning for Disease Prediction",
    "abstract": " Title: Latent-Graph Learning for Disease Prediction ",
    "url": "https://arxiv.org/abs/2003.13620",
    "authors": [
      "Luca Cosmo",
      "Anees Kazi",
      "Seyed-Ahmad Ahmadi",
      "Nassir Navab",
      "Michael Bronstein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2004.02580",
    "title": "Distributed Processing of k Shortest Path Queries over Dynamic Road  Networks",
    "abstract": " Comments: A shorter version of this technical report has been accepted for publication as a full paper in ACM SIGMOD 2020: International Conference on Management of Data ",
    "url": "https://arxiv.org/abs/2004.02580",
    "authors": [
      "Ziqiang Yu",
      "Xiaohui Yu",
      "Nick Koudas",
      "Yang Liu",
      "Yifan Li",
      "Yueting Chen",
      "Dingyu Yang"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2005.06382",
    "title": "Super-Resolution Domain Adaptation Networks for Semantic Segmentation  via Pixel and Output Level Aligning",
    "abstract": " Title: Super-Resolution Domain Adaptation Networks for Semantic Segmentation  via Pixel and Output Level Aligning ",
    "url": "https://arxiv.org/abs/2005.06382",
    "authors": [
      "Junfeng Wu",
      "Zhenjie Tang",
      "Congan Xu",
      "Enhai Liu",
      "Long Gao",
      "Wenjun Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2005.08482",
    "title": "Variational Hyper-Encoding Networks",
    "abstract": " Comments: Accepted ECML-2021 ",
    "url": "https://arxiv.org/abs/2005.08482",
    "authors": [
      "Phuoc Nguyen",
      "Truyen Tran",
      "Sunil Gupta",
      "Santu Rana",
      "Hieu-Chi Dam",
      "Svetha Venkatesh"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2005.11319",
    "title": "Adaptive Network Response to Line Failures in Power Systems",
    "abstract": " Comments: Accepted to IEEE Transactions on Control of Network Systems. arXiv admin note: text overlap with arXiv:1904.05461 ",
    "url": "https://arxiv.org/abs/2005.11319",
    "authors": [
      "Chen Liang",
      "Linqi Guo",
      "Alessandro Zocca",
      "Steven H. Low",
      "Adam Wierman"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2008.06471",
    "title": "Self-Sampling for Neural Point Cloud Consolidation",
    "abstract": " Comments: TOG 2021 ",
    "url": "https://arxiv.org/abs/2008.06471",
    "authors": [
      "Gal Metzer",
      "Rana Hanocka",
      "Raja Giryes",
      "Daniel Cohen-Or"
    ],
    "subjectives": [
      "Graphics (cs.GR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2011.08165",
    "title": "Generating Target Graph Couplings for QAOA from Native Quantum Hardware  Couplings",
    "abstract": " Title: Generating Target Graph Couplings for QAOA from Native Quantum Hardware  Couplings ",
    "url": "https://arxiv.org/abs/2011.08165",
    "authors": [
      "Joel Rajakumar",
      "Jai Moondra",
      "Bryan Gard",
      "Swati Gupta",
      "Creston D. Herold"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Computational Complexity (cs.CC)",
      "Optimization and Control (math.OC)",
      "Atomic Physics (physics.atom-ph)"
    ]
  },
  {
    "id": "arXiv:2011.08675",
    "title": "Non-Local Robust Quaternion Matrix Completion for Color Images and  Videos Inpainting",
    "abstract": " Comments: 34 pages, 17 figures ",
    "url": "https://arxiv.org/abs/2011.08675",
    "authors": [
      "Zhigang Jia",
      "Qiyu Jin",
      "Michael K. Ng",
      "Xile Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2103.04550",
    "title": "No Weighted-Regret Learning in Adversarial Bandits with Delays",
    "abstract": " Comments: Accepted to JMLR. This is an extended journal version of the preliminary conference paper \"Online EXP3 Learning in Adversarial Bandits with Delayed Feedback\" published in Neurips 2019 ",
    "url": "https://arxiv.org/abs/2103.04550",
    "authors": [
      "Ilai Bistritz",
      "Zhengyuan Zhou",
      "Xi Chen",
      "Nicholas Bambos",
      "Jose Blanchet"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2103.12323",
    "title": "Anomaly Detection using Principles of Human Perception",
    "abstract": " Title: Anomaly Detection using Principles of Human Perception ",
    "url": "https://arxiv.org/abs/2103.12323",
    "authors": [
      "Nassir Mohammad"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2103.15140",
    "title": "Scaling the weight parameters in Markov logic networks and relational  logistic regression models",
    "abstract": " Title: Scaling the weight parameters in Markov logic networks and relational  logistic regression models ",
    "url": "https://arxiv.org/abs/2103.15140",
    "authors": [
      "Felix Weitkämper"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2104.00735",
    "title": "Graph Attention Networks for Channel Estimation in RIS-assisted  Satellite IoT Communications",
    "abstract": " Comments: 10 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2104.00735",
    "authors": [
      "Kürşat Tekbıyık",
      "Güneş Karabulut Kurt",
      "Ali Rıza Ekti",
      "Halim Yanikomeroglu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2105.02095",
    "title": "Two-layer neural networks with values in a Banach space",
    "abstract": " Title: Two-layer neural networks with values in a Banach space ",
    "url": "https://arxiv.org/abs/2105.02095",
    "authors": [
      "Yury Korolev"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Functional Analysis (math.FA)",
      "Numerical Analysis (math.NA)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2106.03725",
    "title": "Stability to Deformations in Manifold Neural Networks",
    "abstract": " Comments: 17 pages; 5 figures ",
    "url": "https://arxiv.org/abs/2106.03725",
    "authors": [
      "Zhiyang Wang",
      "Luana Ruiz",
      "Alejandro Ribeiro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.04007",
    "title": "On the Coupling of Depth and Egomotion Networks for Self-Supervised  Structure from Motion",
    "abstract": " Comments: Accepted to the IEEE Robotics and Automation Letters (RA-L); to appear in 2022 ",
    "url": "https://arxiv.org/abs/2106.04007",
    "authors": [
      "Brandon Wagstaff",
      "Valentin Peretroukhin",
      "Jonathan Kelly"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2106.13970",
    "title": "Intrinsically Motivated Self-supervised Learning in Reinforcement  Learning",
    "abstract": " Title: Intrinsically Motivated Self-supervised Learning in Reinforcement  Learning ",
    "url": "https://arxiv.org/abs/2106.13970",
    "authors": [
      "Yue Zhao",
      "Chenzhuang Du",
      "Hang Zhao",
      "Tiejun Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.05225",
    "title": "Compositional Vulnerability Detection with Insecurity Separation Logic",
    "abstract": " Title: Compositional Vulnerability Detection with Insecurity Separation Logic ",
    "url": "https://arxiv.org/abs/2107.05225",
    "authors": [
      "Toby Murray",
      "Pengbo Yan",
      "Gidon Ernst"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Cryptography and Security (cs.CR)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2108.11299",
    "title": "Uncertify: Attacks Against Neural Network Certification",
    "abstract": " Title: Uncertify: Attacks Against Neural Network Certification ",
    "url": "https://arxiv.org/abs/2108.11299",
    "authors": [
      "Tobias Lorenz",
      "Marta Kwiatkowska",
      "Mario Fritz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.03748",
    "title": "A robust approach for deep neural networks in presence of label noise:  relabelling and filtering instances during training",
    "abstract": " Comments: 24 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2109.03748",
    "authors": [
      "Anabel Gómez-Ríos",
      "Julián Luengo",
      "Francisco Herrera"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2110.05043",
    "title": "Robust Safety for Move",
    "abstract": " Title: Robust Safety for Move ",
    "url": "https://arxiv.org/abs/2110.05043",
    "authors": [
      "Marco Patrignani",
      "Sam Blackshear"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2110.15163",
    "title": "Authentication Attacks on Projection-based Cancelable Biometric Schemes  (long version)",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:1910.01389 by other authors ",
    "url": "https://arxiv.org/abs/2110.15163",
    "authors": [
      "Axel Durbet",
      "Pascal Lafourcade",
      "Denis Migdal",
      "Kevin Thiry-Atighehchi",
      "Paul-Marie Grollemund"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.09298",
    "title": "SeCGAN: Parallel Conditional Generative Adversarial Networks for Face  Editing via Semantic Consistency",
    "abstract": " Comments: Accepted by CVPR 2022 AI for Content Creation (AI4CC) workshop ",
    "url": "https://arxiv.org/abs/2111.09298",
    "authors": [
      "Jiaze Sun",
      "Binod Bhattarai",
      "Zhixiang Chen",
      "Tae-Kyun Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.12379",
    "title": "Efficient Anomaly Detection Using Self-Supervised Multi-Cue Tasks",
    "abstract": " Title: Efficient Anomaly Detection Using Self-Supervised Multi-Cue Tasks ",
    "url": "https://arxiv.org/abs/2111.12379",
    "authors": [
      "Loic Jezequel",
      "Ngoc-Son Vu",
      "Jean Beaudet",
      "Aymeric Histace"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.03125",
    "title": "An arbitrary-order fully discrete Stokes complex on general polyhedral  meshes",
    "abstract": " Comments: 45 pages, 7 figures. Major modifications done for use in 3 dimensions. See the second version for an analysis focused on the 2-dimensional case ",
    "url": "https://arxiv.org/abs/2112.03125",
    "authors": [
      "Marien-Lorenzo Hanot"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2112.09943",
    "title": "Exploiting Expert-guided Symmetry Detection in Offline Reinforcement  Learning",
    "abstract": " Comments: Preprint - Under review ",
    "url": "https://arxiv.org/abs/2112.09943",
    "authors": [
      "Giorgio Angelotti",
      "Nicolas Drougard",
      "Caroline P. C. Chanel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.12670",
    "title": "The interplay between ranking and communities in networks",
    "abstract": " Title: The interplay between ranking and communities in networks ",
    "url": "https://arxiv.org/abs/2112.12670",
    "authors": [
      "Laura Iacovissi",
      "Caterina De Bacco"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Physics and Society (physics.soc-ph)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2201.01018",
    "title": "CHERRY: a Computational metHod for accuratE pRediction of  virus-pRokarYotic interactions using a graph encoder-decoder model",
    "abstract": " Comments: 20 pages, 14 figures ",
    "url": "https://arxiv.org/abs/2201.01018",
    "authors": [
      "Jiayu Shang",
      "Yanni Sun"
    ],
    "subjectives": [
      "Genomics (q-bio.GN)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.02639",
    "title": "MERLOT Reserve: Neural Script Knowledge through Vision and Language and  Sound",
    "abstract": " Comments: CVPR 2022. Project page at this https URL ",
    "url": "https://arxiv.org/abs/2201.02639",
    "authors": [
      "Rowan Zellers",
      "Jiasen Lu",
      "Ximing Lu",
      "Youngjae Yu",
      "Yanpeng Zhao",
      "Mohammadreza Salehi",
      "Aditya Kusupati",
      "Jack Hessel",
      "Ali Farhadi",
      "Yejin Choi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2201.09095",
    "title": "Excitation allocation for generic identifiability of linear dynamic  networks with fixed modules",
    "abstract": " Title: Excitation allocation for generic identifiability of linear dynamic  networks with fixed modules ",
    "url": "https://arxiv.org/abs/2201.09095",
    "authors": [
      "H. J. Dreef",
      "S. Shi",
      "X. Cheng",
      "M. C. F. Donkers",
      "P. M. J. Van den Hof"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2202.03974",
    "title": "Rainbow Differential Privacy",
    "abstract": " Comments: To appear in the 2022 IEEE International Symposium on Information Theory ",
    "url": "https://arxiv.org/abs/2202.03974",
    "authors": [
      "Ziqi Zhou",
      "Onur Günlü",
      "Rafael G. L. D'Oliveira",
      "Muriel Médard",
      "Parastoo Sadeghi",
      "Rafael F. Schaefer"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Information Retrieval (cs.IR)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.09177",
    "title": "Space4HGNN: A Novel, Modularized and Reproducible Platform to Evaluate  Heterogeneous Graph Neural Network",
    "abstract": " Comments: SIGIR2022 ",
    "url": "https://arxiv.org/abs/2202.09177",
    "authors": [
      "Tianyu Zhao",
      "Cheng Yang",
      "Yibo Li",
      "Quan Gan",
      "Zhenyi Wang",
      "Fengqi Liang",
      "Huan Zhao",
      "Yingxia Shao",
      "Xiao Wang",
      "Chuan Shi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.00531",
    "title": "Towards deep learning-powered IVF: A large public benchmark for  morphokinetic parameter prediction",
    "abstract": " Title: Towards deep learning-powered IVF: A large public benchmark for  morphokinetic parameter prediction ",
    "url": "https://arxiv.org/abs/2203.00531",
    "authors": [
      "Tristan Gomez",
      "Magalie Feyeux",
      "Nicolas Normand",
      "Laurent David",
      "Perrine Paul-Gilloteaux",
      "Thomas Fréour",
      "Harold Mouchère"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.08827",
    "title": "Discovering the building blocks of dark matter halo density profiles  with neural networks",
    "abstract": " Comments: 12 pages, 6 figures. Minor changes to match version accepted for publication in PRD ",
    "url": "https://arxiv.org/abs/2203.08827",
    "authors": [
      "Luisa Lucie-Smith",
      "Hiranya V. Peiris",
      "Andrew Pontzen",
      "Brian Nord",
      "Jeyan Thiyagalingam",
      "Davide Piras"
    ],
    "subjectives": [
      "Cosmology and Nongalactic Astrophysics (astro-ph.CO)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.02441",
    "title": "Imaging Conductivity from Current Density Magnitude using Neural  Networks",
    "abstract": " Comments: 29 pp, 9 figures (several typos are corrected in the new version), to appear at Inverse Problems ",
    "url": "https://arxiv.org/abs/2204.02441",
    "authors": [
      "Bangti Jin",
      "Xiyao Li",
      "Xiliang Lu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.05381",
    "title": "Self-supervised Vision Transformers for Joint SAR-optical Representation  Learning",
    "abstract": " Comments: 4 pages, 1 figure; IGARSS 2022 ",
    "url": "https://arxiv.org/abs/2204.05381",
    "authors": [
      "Yi Wang",
      "Conrad M Albrecht",
      "Xiao Xiang Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12415",
    "title": "Automatic Monitoring of Fruit Ripening Rooms by UHF RFID Sensor Network  and Machine Learning",
    "abstract": " Comments: Accepted for publication in \"IEEE Journal of Radio Frequency Identification\" ",
    "url": "https://arxiv.org/abs/2204.12415",
    "authors": [
      "Cecilia Occhiuzzi",
      "Francesca Camera",
      "Michele D'Orazio",
      "Nicola D'Uva",
      "Sara Amendola",
      "Giulio Maria Bianco",
      "Carolina Miozzi",
      "Luigi Garavaglia",
      "Eugenio Martinelli",
      "Gaetano Marrocco"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.01432",
    "title": "ARCADE: Adversarially Regularized Convolutional Autoencoder for Network  Anomaly Detection",
    "abstract": " Title: ARCADE: Adversarially Regularized Convolutional Autoencoder for Network  Anomaly Detection ",
    "url": "https://arxiv.org/abs/2205.01432",
    "authors": [
      "Willian T. Lunardi",
      "Martin Andreoni Lopez",
      "Jean-Pierre Giacalone"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2205.03661",
    "title": "Arrhythmia Classifier using Binarized Convolutional Neural Network for  Resource-Constrained Devices",
    "abstract": " Comments: IEEE-CISCE 2022 ",
    "url": "https://arxiv.org/abs/2205.03661",
    "authors": [
      "Ao Wang",
      "Wenxing Xu",
      "Hanshi Sun",
      "Ninghao Pu",
      "Zijin Liu",
      "Hao Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.03727",
    "title": "Exact recovery algorithm for Planted Bipartite Graph in Semi-random  Graphs",
    "abstract": " Comments: 46 pages ",
    "url": "https://arxiv.org/abs/2205.03727",
    "authors": [
      "Akash Kumar",
      "Anand Louis",
      "Rameesh Paul"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2205.05740",
    "title": "Surface Representation for Point Clouds",
    "abstract": " Comments: CVPR 2022 Oral. Code available at this https URL ",
    "url": "https://arxiv.org/abs/2205.05740",
    "authors": [
      "Haoxi Ran",
      "Jun Liu",
      "Chengjie Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2205.05783",
    "title": "MEWS: Real-time Social Media Manipulation Detection and Analysis",
    "abstract": " Title: MEWS: Real-time Social Media Manipulation Detection and Analysis ",
    "url": "https://arxiv.org/abs/2205.05783",
    "authors": [
      "Trenton W. Ford",
      "William Theisen",
      "Michael Yankoski",
      "Tom Henry",
      "Farah Khashman",
      "Katherine R. Dearstyne",
      "Tim Weninger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2205.06204",
    "title": "F3A-GAN: Facial Flow for Face Animation with Generative Adversarial  Networks",
    "abstract": " Title: F3A-GAN: Facial Flow for Face Animation with Generative Adversarial  Networks ",
    "url": "https://arxiv.org/abs/2205.06204",
    "authors": [
      "Xintian Wu",
      "Qihang Zhang",
      "Yiming Wu",
      "Huanyu Wang",
      "Songyuan Li",
      "Lingyun Sun",
      "Xi Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.06205",
    "title": "kNN-Embed: Locally Smoothed Embedding Mixtures For Multi-interest  Candidate Retrieval",
    "abstract": " Title: kNN-Embed: Locally Smoothed Embedding Mixtures For Multi-interest  Candidate Retrieval ",
    "url": "https://arxiv.org/abs/2205.06205",
    "authors": [
      "Ahmed El-Kishky",
      "Thomas Markovich",
      "Kenny Leung",
      "Frank Portman",
      "Aria Haghighi",
      "Ying Xiao"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  }
]