[
  {
    "id": "arXiv:2109.06488",
    "title": "Multilevel profiling of situation and dialogue-based deep networks for  movie genre classification using movie trailers",
    "abstract": "Automated movie genre classification has emerged as an active and essential area of research and exploration. Short duration movie trailers provide useful insights about the movie as video content consists of the cognitive and the affective level features. Previous approaches were focused upon either cognitive or affective content analysis. In this paper, we propose a novel multi-modality: situation, dialogue, and metadata-based movie genre classification framework that takes both cognition and affect-based features into consideration. A pre-features fusion-based framework that takes into account: situation-based features from a regular snapshot of a trailer that includes nouns and verbs providing the useful affect-based mapping with the corresponding genres, dialogue (speech) based feature from audio, metadata which together provides the relevant information for cognitive and affect based video analysis. We also develop the English movie trailer dataset (EMTD), which contains 2000 Hollywood movie trailers belonging to five popular genres: Action, Romance, Comedy, Horror, and Science Fiction, and perform cross-validation on the standard LMTD-9 dataset for validating the proposed framework. The results demonstrate that the proposed methodology for movie genre classification has performed excellently as depicted by the F1 scores, precision, recall, and area under the precision-recall curves. ",
    "url": "https://arxiv.org/abs/2109.06488",
    "authors": [
      "Dinesh Kumar Vishwakarma",
      "Mayank Jindal",
      "Ayush Mittal",
      "Aditya Sharma"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2109.06651",
    "title": "CropDefender: deep watermark which is more convenient to train and more  robust against cropping",
    "abstract": "Digital image watermarking, which is a technique for invisibly embedding information into an image, is used in fields such as property rights protection. In recent years, some research has proposed the use of neural networks to add watermarks to natural images. We take StegaStamp as an example for our research. Whether facing traditional image editing methods, such as brightness, contrast, saturation adjustment, or style change like 1-bit conversion, GAN, StegaStamp has robustness far beyond traditional watermarking techniques, but it still has two drawbacks: it is vulnerable to cropping and is hard to train. We found that the causes of vulnerability to cropping is not the loss of information on the edge, but the movement of watermark position. By explicitly introducing the perturbation of cropping into the training, the cropping resistance is significantly improved. For the problem of difficult training, we introduce instance normalization to solve the vanishing gradient, set losses' weights as learnable parameters to reduce the number of hyperparameters, and use sigmoid to restrict pixel values of the generated image. ",
    "url": "https://arxiv.org/abs/2109.06651",
    "authors": [
      "Jiayu Ding",
      "Yuchen Cao",
      "Changhao Shi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.06706",
    "title": "A graph complexity measure based on the spectral analysis of the Laplace  operator",
    "abstract": "In this work we introduce a concept of complexity for undirected graphs in terms of the spectral analysis of the Laplacian operator defined by the incidence matrix of the graph. Precisely, we compute the norm of the vector of eigenvalues of both the graph and its complement and take their product. Doing so, we obtain a quantity that satisfies two basic properties that are the expected for a measure of complexity. First,complexity of fully connected and fully disconnected graphs vanish. Second, complexity of complementary graphs coincide. This notion of complexity allows us to distinguish different kinds of graphs by placing them in a \"croissant-shaped\" region of the plane link density - complexity, highlighting some features like connectivity,concentration, uniformity or regularity and existence of clique-like clusters. Indeed, considering graphs with a fixed number of nodes, by plotting the link density versus the complexity we find that graphs generated by different methods take place at different regions of the plane. We consider some generated graphs, in particular the Erd\\\"os-R\\'enyi, the Watts-Strogatz and the Barab\\'asi-Albert models. Also, we place some particular, let us say deterministic, to wit, lattices, stars, hyper-concentrated and cliques-containing graphs. It is worthy noticing that these deterministic classical models of graphs depict the boundary of the croissant-shaped region. Finally, as an application to graphs generated by real measurements, we consider the brain connectivity graphs from two epileptic patients obtained from magnetoencephalography (MEG) recording, both in a baseline period and in ictal periods .In this case, our definition of complexity could be used as a tool for discerning between states, by the analysis of differences at distinct frequencies of the MEG recording. ",
    "url": "https://arxiv.org/abs/2109.06706",
    "authors": [
      "Diego M. Mateos",
      "Federico Morana",
      "Hugo Aimar"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2109.06721",
    "title": "Linear block and convolutional MDS codes to required rate, distance and  type",
    "abstract": "Algebraic methods for the design of series of maximum distance separable (MDS) linear block and convolutional codes to required specifications and types are presented. Algorithms are given to design codes to required rate andrequired error-correcting capability and required types. Infinite series of block codes with rate approaching a given rational $R$ with $0<R<1$ and relative distance over length approaching $(1-R)$ are designed. These can be designed over fields of given characteristic $p$ or over fields of prime order and can of of specified typessuch as (i) dual-containing under Euclidean inner product, (ii) dual-containing under Hermitian inner product, (iii) quantum error-correcting, (iv) linear complementary dual (LCD). Convolutional codes to required rate and distance are designed and infinite series of convolutional codes with rate approaching a given rational $R$ and distance over length approaching $2(1-R)$. Properties, including distances, are shown algebraically and algebraic explicit efficient decoding methods are known. ",
    "url": "https://arxiv.org/abs/2109.06721",
    "authors": [
      "Ted Hurley"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2109.06786",
    "title": "Multiple shooting with neural differential equations",
    "abstract": "Neural differential equations have recently emerged as a flexible data-driven/hybrid approach to model time-series data. This work experimentally demonstrates that if the data contains oscillations, then standard fitting of a neural differential equation may give flattened out trajectory that fails to describe the data. We then introduce the multiple shooting method and present successful demonstrations of this method for the fitting of a neural differential equation to two datasets (synthetic and experimental) that the standard approach fails to fit. Constraints introduced by multiple shooting can be satisfied using a penalty or augmented Lagrangian method. ",
    "url": "https://arxiv.org/abs/2109.06786",
    "authors": [
      "Evren Mert Turan",
      "Johannes Jäschke"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.06294",
    "title": "On the regularized risk of distributionally robust learning over deep  neural networks",
    "abstract": "In this paper we explore the relation between distributionally robust learning and different forms of regularization to enforce robustness of deep neural networks. In particular, starting from a concrete min-max distributionally robust problem, and using tools from optimal transport theory, we derive first order and second order approximations to the distributionally robust problem in terms of appropriate regularized risk minimization problems. In the context of deep ResNet models, we identify the structure of the resulting regularization problems as mean-field optimal control problems where the number and dimension of state variables is within a dimension-free factor of the dimension of the original unrobust problem. Using the Pontryagin maximum principles associated to these problems we motivate a family of scalable algorithms for the training of robust neural networks. Our analysis recovers some results and algorithms known in the literature (in settings explained throughout the paper) and provides many other theoretical and algorithmic insights that to our knowledge are novel. In our analysis we employ tools that we deem useful for a future analysis of more general adversarial learning problems. ",
    "url": "https://arxiv.org/abs/2109.06294",
    "authors": [
      "Camilo Garcia Trillos",
      "Nicolas Garcia Trillos"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2109.06755",
    "title": "Construction of $k$-matchings and $k$-regular subgraphs in graph  products",
    "abstract": "A $k$-matching $M$ of a graph $G=(V,E)$ is a subset $M\\subseteq E$ such that each connected component in the subgraph $F = (V,M)$ of $G$ is either a single-vertex graph or $k$-regular, i.e., each vertex has degree $k$. In this contribution, we are interested in $k$-matchings within the four standard graph products: the Cartesian, strong, direct and lexicographic product. As we shall see, the problem of finding non-empty $k$-matchings ($k\\geq 3$) in graph products is NP-complete. Due to the general intractability of this problem, we focus on distinct polynomial-time constructions of $k$-matchings in a graph product $G\\star H$ that are based on $k_G$-matchings $M_G$ and $k_H$-matchings $M_H$ of its factors $G$ and $H$, respectively. In particular, we are interested in properties of the factors that have to be satisfied such that these constructions yield a maximum $k$-matching in the respective products. Such constructions are also called \"well-behaved\" and we provide several characterizations for this type of $k$-matchings. Our specific constructions of $k$-matchings in graph products satisfy the property of being weak-homomorphism preserving, i.e., constructed matched edges in the product are never \"projected\" to unmatched edges in the factors. This leads to the concept of weak-homomorphism preserving $k$-matchings. Although the specific $k$-matchings constructed here are not always maximum $k$-matchings of the products, they have always maximum size among all weak-homomorphism preserving $k$-matchings. Not all weak-homomorphism preserving $k$-matchings, however, can be constructed in our manner. We will, therefore, determine the size of maximum-sized elements among all weak-homomorphims preserving $k$-matching within the respective graph products, provided that the matchings in the factors satisfy some general assumptions. ",
    "url": "https://arxiv.org/abs/2109.06755",
    "authors": [
      "Anna Lindeberg",
      "Marc Hellmuth"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2109.06849",
    "title": "A geometric perspective on functional outlier detection",
    "abstract": "We consider functional outlier detection from a geometric perspective, specifically: for functional data sets drawn from a functional manifold which is defined by the data's modes of variation in amplitude and phase. Based on this manifold, we develop a conceptualization of functional outlier detection that is more widely applicable and realistic than previously proposed. Our theoretical and experimental analyses demonstrate several important advantages of this perspective: It considerably improves theoretical understanding and allows to describe and analyse complex functional outlier scenarios consistently and in full generality, by differentiating between structurally anomalous outlier data that are off-manifold and distributionally outlying data that are on-manifold but at its margins. This improves practical feasibility of functional outlier detection: We show that simple manifold learning methods can be used to reliably infer and visualize the geometric structure of functional data sets. We also show that standard outlier detection methods requiring tabular data inputs can be applied to functional data very successfully by simply using their vector-valued representations learned from manifold learning methods as input features. Our experiments on synthetic and real data sets demonstrate that this approach leads to outlier detection performances at least on par with existing functional data-specific methods in a large variety of settings, without the highly specialized, complex methodology and narrow domain of application these methods often entail. ",
    "url": "https://arxiv.org/abs/2109.06849",
    "authors": [
      "Moritz Herrmann",
      "Fabian Scheipl"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:2109.06856",
    "title": "Performance of a Markovian neural network versus dynamic programming on  a fishing control problem",
    "abstract": "Fishing quotas are unpleasant but efficient to control the productivity of a fishing site. A popular model has a stochastic differential equation for the biomass on which a stochastic dynamic programming or a Hamilton-Jacobi-Bellman algorithm can be used to find the stochastic control -- the fishing quota. We compare the solutions obtained by dynamic programming against those obtained with a neural network which preserves the Markov property of the solution. The method is extended to a similar multi species model to check its robustness in high dimension. ",
    "url": "https://arxiv.org/abs/2109.06856",
    "authors": [
      "Mathieu Laurière",
      "Gilles Pagès",
      "Olivier Pironneau"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2006.03151",
    "title": "Hidden Markov models as recurrent neural networks: an application to  Alzheimer's disease",
    "abstract": " Title: Hidden Markov models as recurrent neural networks: an application to  Alzheimer's disease ",
    "url": "https://arxiv.org/abs/2006.03151",
    "authors": [
      "Matt Baucum",
      "Anahita Khojandi",
      "Theodore Papamarkou"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2006.15032",
    "title": "Numerical analysis of a structure-preserving space-discretization for an  anisotropic and heterogeneous boundary controlled N-dimensional wave equation  as port-Hamiltonian system",
    "abstract": " Comments: 35 pages, 1 figure, submitted ",
    "url": "https://arxiv.org/abs/2006.15032",
    "authors": [
      "Ghislain Haine",
      "Denis Matignon",
      "Anass Serhani"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2008.05801",
    "title": "An explicit construction of graphs of bounded degree that are far from  being Hamiltonian",
    "abstract": " Comments: 16 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2008.05801",
    "authors": [
      "Isolde Adler",
      "Noleen Köhler"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Computational Complexity (cs.CC)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2011.08225",
    "title": "Automatic selection of clustering algorithms using supervised graph  embedding",
    "abstract": " Title: Automatic selection of clustering algorithms using supervised graph  embedding ",
    "url": "https://arxiv.org/abs/2011.08225",
    "authors": [
      "Noy Cohen-Shapira",
      "Lior Rokach"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2108.07942",
    "title": "Algorithmic techniques for finding resistance distances on structured  graphs",
    "abstract": " Title: Algorithmic techniques for finding resistance distances on structured  graphs ",
    "url": "https://arxiv.org/abs/2108.07942",
    "authors": [
      "E. J. Evans",
      "A. E. Francis"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2108.11781",
    "title": "On the use of test smells for prediction of flaky tests",
    "abstract": " Title: On the use of test smells for prediction of flaky tests ",
    "url": "https://arxiv.org/abs/2108.11781",
    "authors": [
      "B. H. P. Camara",
      "M. A. G. Silva",
      "A. T. Endo",
      "S. R. Vergilio"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.05373",
    "title": "An efficient and robust monolithic approach to phase-field quasi-static  brittle fracture using a modified Newton method",
    "abstract": " Comments: Accepted manuscript: Added references, added Armijo algorithm, more details on modified Newton algorithm, added mesh sensitivity analysis, comparison with original extrapolated scheme in Annex ",
    "url": "https://arxiv.org/abs/2109.05373",
    "authors": [
      "O. Lampron",
      "D. Therriault",
      "M. Lévesque"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2109.06152",
    "title": "Enumerating independent sets in Abelian Cayley graphs",
    "abstract": " Comments: 21 pages ",
    "url": "https://arxiv.org/abs/2109.06152",
    "authors": [
      "Aditya Potukuchi",
      "Liana Yepremyan"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  }
]