[
  {
    "id": "arXiv:2108.06452",
    "title": "AdaGNN: A multi-modal latent representation meta-learner for GNNs based  on AdaBoosting",
    "abstract": "As a special field in deep learning, Graph Neural Networks (GNNs) focus on extracting intrinsic network features and have drawn unprecedented popularity in both academia and industry. Most of the state-of-the-art GNN models offer expressive, robust, scalable and inductive solutions empowering social network recommender systems with rich network features that are computationally difficult to leverage with graph traversal based methods. Most recent GNNs follow an encoder-decoder paradigm to encode high dimensional heterogeneous information from a subgraph onto one low dimensional embedding space. However, one single embedding space usually fails to capture all aspects of graph signals. In this work, we propose boosting-based meta learner for GNNs, which automatically learns multiple projections and the corresponding embedding spaces that captures different aspects of the graph signals. As a result, similarities between sub-graphs are quantified by embedding proximity on multiple embedding spaces. AdaGNN performs exceptionally well for applications with rich and diverse node neighborhood information. Moreover, AdaGNN is compatible with any inductive GNNs for both node-level and edge-level tasks. ",
    "url": "https://arxiv.org/abs/2108.06452",
    "authors": [
      "Qinyi Zhu",
      "Yiou Xiao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2108.06482",
    "title": "Extended level set method: a multiphase representation with perfect  symmetric property, and its application to multi material topology  optimization",
    "abstract": "This paper provides an extended level set (X-LS) based topology optimiza- tion method for multi material design. In the proposed method, each zero level set of a level set function {\\phi}ij represents the boundary between materials i and j. Each increase or decrease of {\\phi}ij corresponds to a material change between the two materials. This approach reduces the dependence of the initial configuration in the optimization calculation and simplifies the sensitivity analysis. First, the topology optimization problem is formulated in the X-LS representation. Next, the reaction-diffusion equation that updates the level set function is introduced, and an optimization algorithm that solves the equilibrium equations and the reaction-diffusion equation using the fi- nite element method is constructed. Finally, the validity and utility of the proposed topology optimization method are confirmed using two- and three- dimensional numerical examples. ",
    "url": "https://arxiv.org/abs/2108.06482",
    "authors": [
      "Masaki Noda",
      "Yuki Noguchi",
      "Takayuki Yamada"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2108.06518",
    "title": "Disease-oriented image embedding with pseudo-scanner standardization for  content-based image retrieval on 3D brain MRI",
    "abstract": "To build a robust and practical content-based image retrieval (CBIR) system that is applicable to a clinical brain MRI database, we propose a new framework -- Disease-oriented image embedding with pseudo-scanner standardization (DI-PSS) -- that consists of two core techniques, data harmonization and a dimension reduction algorithm. Our DI-PSS uses skull stripping and CycleGAN-based image transformations that map to a standard brain followed by transformation into a brain image taken with a given reference scanner. Then, our 3D convolutioinal autoencoders (3D-CAE) with deep metric learning acquires a low-dimensional embedding that better reflects the characteristics of the disease. The effectiveness of our proposed framework was tested on the T1-weighted MRIs selected from the Alzheimer's Disease Neuroimaging Initiative and the Parkinson's Progression Markers Initiative. We confirmed that our PSS greatly reduced the variability of low-dimensional embeddings caused by different scanner and datasets. Compared with the baseline condition, our PSS reduced the variability in the distance from Alzheimer's disease (AD) to clinically normal (CN) and Parkinson disease (PD) cases by 15.8-22.6% and 18.0-29.9%, respectively. These properties allow DI-PSS to generate lower dimensional representations that are more amenable to disease classification. In AD and CN classification experiments based on spectral clustering, PSS improved the average accuracy and macro-F1 by 6.2% and 10.7%, respectively. Given the potential of the DI-PSS for harmonizing images scanned by MRI scanners that were not used to scan the training data, we expect that the DI-PSS is suitable for application to a large number of legacy MRIs scanned in heterogeneous environments. ",
    "url": "https://arxiv.org/abs/2108.06518",
    "authors": [
      "Hayato Arai",
      "Yuto Onga",
      "Kumpei Ikuta",
      "Yusuke Chayama",
      "Hitoshi Iyatomi",
      "Kenichi Oishi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.06663",
    "title": "HCR-Net: A deep learning based script independent handwritten character  recognition network",
    "abstract": "Handwritten character recognition (HCR) is a challenging learning problem in pattern recognition, mainly due to similarity in structure of characters, different handwriting styles, noisy datasets and a large variety of languages and scripts. HCR problem is studied extensively for a few decades but there is very limited research on script independent models. This is because of factors, like, diversity of scripts, focus of the most of conventional research efforts on handcrafted feature extraction techniques which are language/script specific and are not always available, and unavailability of public datasets and codes to reproduce the results. On the other hand, deep learning has witnessed huge success in different areas of pattern recognition, including HCR, and provides end-to-end learning, i.e., automated feature extraction and recognition. In this paper, we have proposed a novel deep learning architecture which exploits transfer learning and image-augmentation for end-to-end learning for script independent handwritten character recognition, called HCR-Net. The network is based on a novel transfer learning approach for HCR, where some of lower layers of a pre-trained VGG16 network are utilised. Due to transfer learning and image-augmentation, HCR-Net provides faster training, better performance and better generalisations. The experimental results on publicly available datasets of Bangla, Punjabi, Hindi, English, Swedish, Urdu, Farsi, Tibetan, Kannada, Malayalam, Telugu, Marathi, Nepali and Arabic languages prove the efficacy of HCR-Net and establishes several new benchmarks. For reproducibility of the results and for the advancements of the HCR research, complete code is publicly released at \\href{https://github.com/jmdvinodjmd/HCR-Net}{GitHub}. ",
    "url": "https://arxiv.org/abs/2108.06663",
    "authors": [
      "Vinod Kumar Chauhan",
      "Sukhdeep Singh",
      "Anuj Sharma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.06920",
    "title": "A complex network approach to time series analysis with application in  diagnosis of neuromuscular disorders",
    "abstract": "Electromyography (EMG) refers to a biomedical signal indicating neuromuscular activity and muscle morphology. Experts accurately diagnose neuromuscular disorders using this time series. Modern data analysis techniques have recently led to introducing novel approaches for mapping time series data to graphs and complex networks with applications in diverse fields, including medicine. The resulting networks develop a completely different visual acuity that can be used to complement physician findings of time series. This can lead to a more enriched analysis, reduced error, more accurate diagnosis of the disease, and increased accuracy and speed of the treatment process. The mapping process may cause the loss of essential data from the time series and not retain all the time series features. As a result, achieving an approach that can provide a good representation of the time series while maintaining essential features is crucial. This paper proposes a new approach to network development named GraphTS to overcome the limited accuracy of existing methods through EMG time series using the visibility graph method. For this purpose, EMG signals are pre-processed and mapped to a complex network by a standard visibility graph algorithm. The resulting networks can differentiate between healthy and patient samples. In the next step, the properties of the developed networks are given in the form of a feature matrix as input to classifiers after extracting optimal features. Performance evaluation of the proposed approach with deep neural network shows 99.30% accuracy for training data and 99.18% for test data. Therefore, in addition to enriched network representation and covering the features of time series for healthy, myopathy, and neuropathy EMG, the proposed technique improves accuracy, precision, recall, and F-score. ",
    "url": "https://arxiv.org/abs/2108.06920",
    "authors": [
      "Samaneh Samiei",
      "Nasser Ghadiri",
      "Behnaz Ansari"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.06964",
    "title": "Partial differential equations on hypergraphs and networks of surfaces:  derivation and hybrid discretizations",
    "abstract": "We introduce a general, analytical framework to express and to approximate partial differential equations (PDEs) numerically on graphs and networks of surfaces---generalized by the term hypergraphs. To this end, we consider PDEs on hypergraphs as singular limits of PDEs in networks of thin domains (such as fault planes, pipes, etc.), and we observe that (mixed) hybrid formulations offer useful tools to formulate such PDEs. Thus, our numerical framework is based on hybrid finite element methods (in particular, the class of hybrid discontinuous Galerkin methods). ",
    "url": "https://arxiv.org/abs/2108.06964",
    "authors": [
      "Andreas Rupp",
      "Markus Gahn",
      "Guido Kanschat"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Analysis of PDEs (math.AP)",
      "Geometric Topology (math.GT)"
    ]
  },
  {
    "id": "arXiv:2108.07046",
    "title": "WiseR: An end-to-end structure learning and deployment framework for  causal graphical models",
    "abstract": "Structure learning offers an expressive, versatile and explainable approach to causal and mechanistic modeling of complex biological data. We present wiseR, an open source application for learning, evaluating and deploying robust causal graphical models using graph neural networks and Bayesian networks. We demonstrate the utility of this application through application on for biomarker discovery in a COVID-19 clinical dataset. ",
    "url": "https://arxiv.org/abs/2108.07046",
    "authors": [
      "Shubham Maheshwari",
      "Khushbu Pahwa",
      "Tavpritesh Sethi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.07135",
    "title": "Vehicle-counting with Automatic Region-of-Interest and  Driving-Trajectory detection",
    "abstract": "Vehicle counting systems can help with vehicle analysis and traffic incident detection. Unfortunately, most existing methods require some level of human input to identify the Region of interest (ROI), movements of interest, or to establish a reference point or line to count vehicles from traffic cameras. This work introduces a method to count vehicles from traffic videos that automatically identifies the ROI for the camera, as well as the driving trajectories of the vehicles. This makes the method feasible to use with Pan-Tilt-Zoom cameras, which are frequently used in developing countries. Preliminary results indicate that the proposed method achieves an average intersection over the union of 57.05% for the ROI and a mean absolute error of just 17.44% at counting vehicles of the traffic video cameras tested. ",
    "url": "https://arxiv.org/abs/2108.07135",
    "authors": [
      "Malolan Vasu",
      "Nelson Abreu",
      "Raysa Vásquez",
      "Christian López"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2005.01699",
    "title": "Guarantees on learning depth-2 neural networks under a data-poisoning  attack",
    "abstract": " Comments: 21 pages ",
    "url": "https://arxiv.org/abs/2005.01699",
    "authors": [
      "Sayar Karmakar",
      "Anirbit Mukherjee",
      "Ramchandran Muthukumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2011.07397",
    "title": "Quantum communication capacity transition of complex quantum networks",
    "abstract": " Comments: 11 pages 13 figures ",
    "url": "https://arxiv.org/abs/2011.07397",
    "authors": [
      "Quntao Zhuang",
      "Bingzhi Zhang"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2012.02241",
    "title": "Quantum Internet under random breakdowns and intentional attacks",
    "abstract": " Comments: 12 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2012.02241",
    "authors": [
      "Bingzhi Zhang",
      "Quntao Zhuang"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2107.04510",
    "title": "Hacking VMAF and VMAF NEG: vulnerability to different preprocessing  methods",
    "abstract": " Title: Hacking VMAF and VMAF NEG: vulnerability to different preprocessing  methods ",
    "url": "https://arxiv.org/abs/2107.04510",
    "authors": [
      "Maksim Siniukov",
      "Anastasia Antsiferova",
      "Dmitriy Kulikov",
      "Dmitriy Vatolin"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2107.07432",
    "title": "Hierarchical graph neural nets can capture long-range interactions",
    "abstract": " Title: Hierarchical graph neural nets can capture long-range interactions ",
    "url": "https://arxiv.org/abs/2107.07432",
    "authors": [
      "Ladislav Rampášek",
      "Guy Wolf"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  }
]