[
  {
    "id": "arXiv:2301.09667",
    "title": "Improving Performance of Object Detection using the Mechanisms of Visual  Recognition in Humans",
    "abstract": "Object recognition systems are usually trained and evaluated on high resolution images. However, in real world applications, it is common that the images have low resolutions or have small sizes. In this study, we first track the performance of the state-of-the-art deep object recognition network, Faster- RCNN, as a function of image resolution. The results reveals negative effects of low resolution images on recognition performance. They also show that different spatial frequencies convey different information about the objects in recognition process. It means multi-resolution recognition system can provides better insight into optimal selection of features that results in better recognition of objects. This is similar to the mechanisms of the human visual systems that are able to implement multi-scale representation of a visual scene simultaneously. Then, we propose a multi-resolution object recognition framework rather than a single-resolution network. The proposed framework is evaluated on the PASCAL VOC2007 database. The experimental results show the performance of our adapted multi-resolution Faster-RCNN framework outperforms the single-resolution Faster-RCNN on input images with various resolutions with an increase in the mean Average Precision (mAP) of 9.14% across all resolutions and 1.2% on the full-spectrum images. Furthermore, the proposed model yields robustness of the performance over a wide range of spatial frequencies. ",
    "url": "https://arxiv.org/abs/2301.09667",
    "authors": [
      "Amir Ghasemi",
      "Fatemeh Mottaghian",
      "Akram Bayat"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09689",
    "title": "Graph Neural Networks for Decentralized Multi-Agent Perimeter Defense",
    "abstract": "In this work, we study the problem of decentralized multi-agent perimeter defense that asks for computing actions for defenders with local perceptions and communications to maximize the capture of intruders. One major challenge for practical implementations is to make perimeter defense strategies scalable for large-scale problem instances. To this end, we leverage graph neural networks (GNNs) to develop an imitation learning framework that learns a mapping from defenders' local perceptions and their communication graph to their actions. The proposed GNN-based learning network is trained by imitating a centralized expert algorithm such that the learned actions are close to that generated by the expert algorithm. We demonstrate that our proposed network performs closer to the expert algorithm and is superior to other baseline algorithms by capturing more intruders. Our GNN-based network is trained at a small scale and can be generalized to large-scale cases. We run perimeter defense games in scenarios with different team sizes and configurations to demonstrate the performance of the learned network. ",
    "url": "https://arxiv.org/abs/2301.09689",
    "authors": [
      "Elijah S. Lee",
      "Lifeng Zhou",
      "Alejandro Ribeiro",
      "Vijay Kumar"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09724",
    "title": "Long-tail Detection with Effective Class-Margins",
    "abstract": "Large-scale object detection and instance segmentation face a severe data imbalance. The finer-grained object classes become, the less frequent they appear in our datasets. However, at test-time, we expect a detector that performs well for all classes and not just the most frequent ones. In this paper, we provide a theoretical understanding of the long-trail detection problem. We show how the commonly used mean average precision evaluation metric on an unknown test set is bound by a margin-based binary classification error on a long-tailed object detection training set. We optimize margin-based binary classification error with a novel surrogate objective called \\textbf{Effective Class-Margin Loss} (ECM). The ECM loss is simple, theoretically well-motivated, and outperforms other heuristic counterparts on LVIS v1 benchmark over a wide range of architecture and detectors. Code is available at \\url{https://github.com/janghyuncho/ECM-Loss}. ",
    "url": "https://arxiv.org/abs/2301.09724",
    "authors": [
      "Jang Hyun Cho",
      "Philipp Krähenbühl"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09732",
    "title": "Backdoor Attacks in Peer-to-Peer Federated Learning",
    "abstract": "We study backdoor attacks in peer-to-peer federated learning systems on different graph topologies and datasets. We show that only 5% attacker nodes are sufficient to perform a backdoor attack with 42% attack success without decreasing the accuracy on clean data by more than 2%. We also demonstrate that the attack can be amplified by the attacker crashing a small number of nodes. We evaluate defenses proposed in the context of centralized federated learning and show they are ineffective in peer-to-peer settings. Finally, we propose a defense that mitigates the attacks by applying different clipping norms to the model updates received from peers and local model trained by a node. ",
    "url": "https://arxiv.org/abs/2301.09732",
    "authors": [
      "Gokberk Yar",
      "Cristina Nita-Rotaru",
      "Alina Oprea"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.09734",
    "title": "Topological Structure is Predictive of Deep Neural Network Success in  Learning",
    "abstract": "Machine learning has become a fundamental tool in modern science, yet its limitations are still not fully understood. Using a simple children's game, we show that the topological structure of the underlying training data can have a dramatic effect on the ability of a deep neural network (DNN) classifier to learn to classify data. We then take insights obtained from this toy model and apply them to two physical data sets (one from particle physics and one from acoustics), which are known to be amenable to classification by DNN's. We show that the simplicity in their topological structure explains the majority of the DNN's ability to operate on these data sets by showing that fully interpretable topological classifiers are able to perform nearly as well as their DNN counterparts. ",
    "url": "https://arxiv.org/abs/2301.09734",
    "authors": [
      "Christopher Griffin",
      "Trevor Karn",
      "Benjamin Apple"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2301.09740",
    "title": "DODEM: DOuble DEfense Mechanism Against Adversarial Attacks Towards  Secure Industrial Internet of Things Analytics",
    "abstract": "Industrial Internet of Things (I-IoT) is a collaboration of devices, sensors, and networking equipment to monitor and collect data from industrial operations. Machine learning (ML) methods use this data to make high-level decisions with minimal human intervention. Data-driven predictive maintenance (PDM) is a crucial ML-based I-IoT application to find an optimal maintenance schedule for industrial assets. The performance of these ML methods can seriously be threatened by adversarial attacks where an adversary crafts perturbed data and sends it to the ML model to deteriorate its prediction performance. The models should be able to stay robust against these attacks where robustness is measured by how much perturbation in input data affects model performance. Hence, there is a need for effective defense mechanisms that can protect these models against adversarial attacks. In this work, we propose a double defense mechanism to detect and mitigate adversarial attacks in I-IoT environments. We first detect if there is an adversarial attack on a given sample using novelty detection algorithms. Then, based on the outcome of our algorithm, marking an instance as attack or normal, we select adversarial retraining or standard training to provide a secondary defense layer. If there is an attack, adversarial retraining provides a more robust model, while we apply standard training for regular samples. Since we may not know if an attack will take place, our adaptive mechanism allows us to consider irregular changes in data. The results show that our double defense strategy is highly efficient where we can improve model robustness by up to 64.6% and 52% compared to standard and adversarial retraining, respectively. ",
    "url": "https://arxiv.org/abs/2301.09740",
    "authors": [
      "Onat Gungor",
      "Tajana Rosing",
      "Baris Aksanli"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09742",
    "title": "Topological Understanding of Neural Networks, a survey",
    "abstract": "We look at the internal structure of neural networks which is usually treated as a black box. The easiest and the most comprehensible thing to do is to look at a binary classification and try to understand the approach a neural network takes. We review the significance of different activation functions, types of network architectures associated to them, and some empirical data. We find some interesting observations and a possibility to build upon the ideas to verify the process for real datasets. We suggest some possible experiments to look forward to in three different directions. ",
    "url": "https://arxiv.org/abs/2301.09742",
    "authors": [
      "Tushar Pandey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Algebraic Topology (math.AT)"
    ]
  },
  {
    "id": "arXiv:2301.09748",
    "title": "Analysis of UAV Corridors in Cellular Networks",
    "abstract": "In this article, we introduce a new mathematical framework for the analysis and design of UAV corridors in cellular networks, while considering a realistic network deployment, antenna radiation pattern, and propagation channel model. By leveraging quantization theory, we optimize the electrical tilts of existing ground cellular base stations to maximize the coverage of both legacy ground users and UAVs flying along specified aerial routes. Our practical case study shows that the optimized network results in a cell partitioning that significantly differs from the usual hexagonal pattern, and that it can successfully guarantee coverage all over the UAV corridors without degrading the perceived signal strength on the ground. ",
    "url": "https://arxiv.org/abs/2301.09748",
    "authors": [
      "Saeed Karimi-Bidhendi",
      "Giovanni Geraci",
      "Hamid Jafarkhani"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2301.09749",
    "title": "Learning Rewards and Skills to Follow Commands with A Data Efficient  Visual-Audio Representation",
    "abstract": "Based on the recent advancements in representation learning, we propose a novel framework for command-following robots with raw sensor inputs. Previous RL-based methods are either difficult to continuously improve after the deployment or require a large number of new labels during the fine-tuning. Motivated by (self-)supervised contrastive learning literature, we propose a novel representation, named VAR++, that generates an intrinsic reward function for command-following robot tasks by associating images with sound commands. After the robot is deployed in a new domain, the representation can be updated intuitively and data-efficiently by non-experts, and the robot is able to fulfill sound commands without any hand-crafted reward functions. We demonstrate our approach on various sound types and robotic tasks, including navigation and manipulation with raw sensor inputs. In the simulated experiments, we show that our system can continually self-improve in previously unseen scenarios given fewer new labeled data, yet achieves better performance, compared with previous methods. ",
    "url": "https://arxiv.org/abs/2301.09749",
    "authors": [
      "Peixin Chang",
      "Shuijing Liu",
      "Tianchen Ji",
      "Neeloy Chakraborty",
      "D. Livingston McPherson",
      "Katherine Driggs-Campbell"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.09771",
    "title": "Automation and AI Technology in Surface Mining With a Brief Introduction  to Open-Pit Operations in the Pilbara",
    "abstract": "This survey article provides a synopsis on some of the engineering problems, technological innovations, robotic development and automation efforts encountered in the mining industry -- particularly in the Pilbara iron-ore region of Western Australia. The goal is to paint the technology landscape and highlight issues relevant to an engineering audience to raise awareness of AI and automation trends in mining. It assumes the reader has no prior knowledge of mining and builds context gradually through focused discussion and short summaries of common open-pit mining operations. The principal activities that take place may be categorized in terms of resource development, mine-, rail- and port operations. From mineral exploration to ore shipment, there are roughly nine steps in between. These include: geological assessment, mine planning and development, production drilling and assaying, blasting and excavation, transportation of ore and waste, crush and screen, stockpile and load-out, rail network distribution, and ore-car dumping. The objective is to briefly describe what each of these processes involves and identify some of the challenges/opportunities from the perspective of a decade-long industry-university R&D collaboration. ",
    "url": "https://arxiv.org/abs/2301.09771",
    "authors": [
      "Raymond Leung",
      "Andrew J Hill",
      "Arman Melkumyan"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "General Literature (cs.GL)"
    ]
  },
  {
    "id": "arXiv:2301.09772",
    "title": "SONIA: an immersive customizable virtual reality system for the  education and exploration of brain networks",
    "abstract": "While mastery of neuroanatomy is important for the investigation of the brain, there is an increasing interest in exploring the neural pathways to better understand the roles of neural circuitry in brain functions. To tackle the limitations of traditional 2D-display-based neuronavigation software in intuitively visualizing complex 3D anatomies, several virtual reality (VR) and augmented reality (AR) solutions have been proposed to facilitate neuroanatomical education. However, with the increasing knowledge on brain connectivity and the functioning of the sub-systems, there is still a lack of similar software solutions for the education and exploration of these topics, which demand more elaborate visualization and interaction strategies. To address this gap, we designed the immerSive custOmizable Neuro learnIng plAform (SONIA), a novel user-friendly VR software system with a multi-scale interaction paradigm that allows flexible customization of learning materials. With both quantitative and qualitative evaluations through user studies, the proposed system is shown to have high usability, attractive visual design, and good educational value. As the first immersive system that integrates customizable design and detailed narratives of the brain sub-systems for the education of neuroanatomy and brain connectivity, SONIA showcases new potential directions and provides valuable insights regarding medical learning and exploration in VR. ",
    "url": "https://arxiv.org/abs/2301.09772",
    "authors": [
      "Owen Hellum",
      "Christopher Steele",
      "Yiming Xiao"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2301.09792",
    "title": "Reverse Logistics Network Design to Estimate the Economic and  Environmental Impacts of Take-back Legislation: A Case Study for E-waste  Management System in Washington State",
    "abstract": "In recent years, recycling and disposal of end-of-life (EOL) electronic products has attracted considerable attention in response to concerns over resource recovery and environmental impacts of electronic waste (e-waste). In many countries, legislation to make manufacturers responsible for taking e-waste at the end of their useful lives either has been adopted or is being considered. In this paper, by capturing different stages in the life-cycle of EOL electronic products (or, e-waste) generated from private or small-entity users, we develop two different formulations of a reverse logistics network, i.e. system-optimum model and user-optimum model, to estimate both economic and environmental effects of take-back legislation. In this system, e-waste is collected through user drop-off at designated collection sites. While we study the whole reverse logistics network associated with recycling and remanufacturing of e-waste in the system-optimum model and obtain an optimum solution from the policy maker's perspective, we split the logistics network into two distinct parts in the user-optimum model in order to derive an optimum solution from the users' standpoint. Implementing the proposed models on an illustrative example shows how they are capable of estimating the economic and environmental impacts of take-back legislation in various stages of e-waste's life-cycle. ",
    "url": "https://arxiv.org/abs/2301.09792",
    "authors": [
      "Hadi Moheb-Alizadeh",
      "Amir Hossein Sadeghi",
      "Amirreza Sahebi fakhrabad",
      "Megan Kramer Jaunich",
      "Eda Kemahlioglu-Ziya",
      "Robert B Handfield"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2301.09801",
    "title": "Heterogeneous Domain Adaptation for IoT Intrusion Detection: A Geometric  Graph Alignment Approach",
    "abstract": "Data scarcity hinders the usability of data-dependent algorithms when tackling IoT intrusion detection (IID). To address this, we utilise the data rich network intrusion detection (NID) domain to facilitate more accurate intrusion detection for IID domains. In this paper, a Geometric Graph Alignment (GGA) approach is leveraged to mask the geometric heterogeneities between domains for better intrusion knowledge transfer. Specifically, each intrusion domain is formulated as a graph where vertices and edges represent intrusion categories and category-wise interrelationships, respectively. The overall shape is preserved via a confused discriminator incapable to identify adjacency matrices between different intrusion domain graphs. A rotation avoidance mechanism and a centre point matching mechanism is used to avoid graph misalignment due to rotation and symmetry, respectively. Besides, category-wise semantic knowledge is transferred to act as vertex-level alignment. To exploit the target data, a pseudo-label election mechanism that jointly considers network prediction, geometric property and neighbourhood information is used to produce fine-grained pseudo-label assignment. Upon aligning the intrusion graphs geometrically from different granularities, the transferred intrusion knowledge can boost IID performance. Comprehensive experiments on several intrusion datasets demonstrate state-of-the-art performance of the GGA approach and validate the usefulness of GGA constituting components. ",
    "url": "https://arxiv.org/abs/2301.09801",
    "authors": [
      "Jiashu Wu",
      "Hao Dai",
      "Yang Wang",
      "Kejiang Ye",
      "Chengzhong Xu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.09810",
    "title": "Balanced Allocations with Heterogeneous Bins: The Power of Memory",
    "abstract": "We consider the allocation of $m$ balls (jobs) into $n$ bins (servers). In the standard Two-Choice process, at each step $t=1,2,\\ldots,m$ we first sample two bins uniformly at random and place a ball in the least loaded bin. It is well-known that for any $m \\geq n$, this results in a gap (difference between the maximum and average load) of $\\log_2 \\log n + \\Theta(1)$ (with high probability). In this work, we consider the Memory process [Mitzenmacher, Prabhakar and Shah 2002] where instead of two choices, we only sample one bin per step but we have access to a cache which can store the location of one bin. Mitzenmacher, Prabhakar and Shah showed that in the lightly loaded case ($m = n$), the Memory process achieves a gap of $\\mathcal{O}(\\log \\log n)$. Extending the setting of Mitzenmacher et al. in two ways, we first allow the number of balls $m$ to be arbitrary, which includes the challenging heavily loaded case where $m \\geq n$. Secondly, we follow the heterogeneous bins model of Wieder [Wieder 2007], where the sampling distribution of bins can be biased up to some arbitrary multiplicative constant. Somewhat surprisingly, we prove that even in this setting, the Memory process still achieves an $\\mathcal{O}(\\log \\log n)$ gap bound. This is in stark contrast with the Two-Choice (or any $d$-Choice with $d=\\mathcal{O}(1)$) process, where it is known that the gap diverges as $m \\rightarrow \\infty$ [Wieder 2007]. Further, we show that for any sampling distribution independent of $m$ (but possibly dependent on $n$) the Memory process has a gap that can be bounded independently of $m$. Finally, we prove a tight gap bound of $\\mathcal{O}(\\log n)$ for Memory in another relaxed setting with heterogeneous (weighted) balls and a cache which can only be maintained for two steps. ",
    "url": "https://arxiv.org/abs/2301.09810",
    "authors": [
      "Dimitrios Los",
      "Thomas Sauerwald",
      "John Sylvester"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2301.09813",
    "title": "Slice-and-Forge: Making Better Use of Caches for Graph Convolutional  Network Accelerators",
    "abstract": "Graph convolutional networks (GCNs) are becoming increasingly popular as they can process a wide variety of data formats that prior deep neural networks cannot easily support. One key challenge in designing hardware accelerators for GCNs is the vast size and randomness in their data access patterns which greatly reduces the effectiveness of the limited on-chip cache. Aimed at improving the effectiveness of the cache by mitigating the irregular data accesses, prior studies often employ the vertex tiling techniques used in traditional graph processing applications. While being effective at enhancing the cache efficiency, those approaches are often sensitive to the tiling configurations where the optimal setting heavily depends on target input datasets. Furthermore, the existing solutions require manual tuning through trial-and-error or rely on sub-optimal analytical models. In this paper, we propose Slice-and-Forge (SnF), an efficient hardware accelerator for GCNs which greatly improves the effectiveness of the limited on-chip cache. SnF chooses a tiling strategy named feature slicing that splits the features into vertical slices and processes them in the outermost loop of the execution. This particular choice results in a repetition of the identical computational patterns over irregular graph data over multiple rounds. Taking advantage of such repetitions, SnF dynamically tunes its tile size. Our experimental results reveal that SnF can achieve 1.73x higher performance in geomean compared to prior work on multi-engine settings, and 1.46x higher performance in geomean on small scale settings, without the need for off-line analyses. ",
    "url": "https://arxiv.org/abs/2301.09813",
    "authors": [
      "Mingi Yoo",
      "Jaeyong Song",
      "Hyeyoon Lee",
      "Jounghoo Lee",
      "Namhyung Kim",
      "Youngsok Kim",
      "Jinho Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2301.09816",
    "title": "SMART: Self-supervised Multi-task pretrAining with contRol Transformers",
    "abstract": "Self-supervised pretraining has been extensively studied in language and vision domains, where a unified model can be easily adapted to various downstream tasks by pretraining representations without explicit labels. When it comes to sequential decision-making tasks, however, it is difficult to properly design such a pretraining approach that can cope with both high-dimensional perceptual information and the complexity of sequential control over long interaction horizons. The challenge becomes combinatorially more complex if we want to pretrain representations amenable to a large variety of tasks. To tackle this problem, in this work, we formulate a general pretraining-finetuning pipeline for sequential decision making, under which we propose a generic pretraining framework \\textit{Self-supervised Multi-task pretrAining with contRol Transformer (SMART)}. By systematically investigating pretraining regimes, we carefully design a Control Transformer (CT) coupled with a novel control-centric pretraining objective in a self-supervised manner. SMART encourages the representation to capture the common essential information relevant to short-term control and long-term control, which is transferrable across tasks. We show by extensive experiments in DeepMind Control Suite that SMART significantly improves the learning efficiency among seen and unseen downstream tasks and domains under different learning scenarios including Imitation Learning (IL) and Reinforcement Learning (RL). Benefiting from the proposed control-centric objective, SMART is resilient to distribution shift between pretraining and finetuning, and even works well with low-quality pretraining datasets that are randomly collected. ",
    "url": "https://arxiv.org/abs/2301.09816",
    "authors": [
      "Yanchao Sun",
      "Shuang Ma",
      "Ratnesh Madaan",
      "Rogerio Bonatti",
      "Furong Huang",
      "Ashish Kapoor"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.09821",
    "title": "Topological Trajectory Prediction with Homotopy Classes",
    "abstract": "Trajectory prediction in a cluttered environment is key to many important robotics tasks such as autonomous navigation. However, there are an infinite number of possible trajectories to consider. To simplify the space of trajectories under consideration, we utilise homotopy classes to partition the space into countably many mathematically equivalent classes. All members within a class demonstrate identical high-level motion with respect to the environment, i.e., travelling above or below an obstacle. This allows high-level prediction of a trajectory in terms of a sparse label identifying its homotopy class. We therefore present a light-weight learning framework based on variable-order Markov processes to learn and predict homotopy classes and thus high-level agent motion. By informing a Gaussian Mixture Model (GMM) with our homotopy class predictions, we see great improvements in low-level trajectory prediction compared to a naive GMM on a real dataset. ",
    "url": "https://arxiv.org/abs/2301.09821",
    "authors": [
      "Jennifer Wakulicz",
      "Ki Myung Brian Lee",
      "Teresa Vidal-Calleja",
      "Robert Fitch"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.09851",
    "title": "Neighborhood Homophily-Guided Graph Convolutional Network",
    "abstract": "Graph neural networks (GNNs) have achieved remarkable advances in graph-oriented tasks. However, many real-world graphs contain heterophily or low homophily, challenging the homophily assumption of classical GNNs and resulting in low performance. Although many studies have emerged to improve the universality of GNNs, they rarely consider the label reuse and the correlation of their proposed metrics and models. In this paper, we first design a new metric, named Neighborhood Homophily (\\textit{NH}), to measure the label complexity or purity in the neighborhood of nodes. Furthermore, we incorporate this metric into the classical graph convolutional network (GCN) architecture and propose \\textbf{N}eighborhood \\textbf{H}omophily-\\textbf{G}uided \\textbf{G}raph \\textbf{C}onvolutional \\textbf{N}etwork (\\textbf{NHGCN}). In this framework, nodes are grouped by estimated \\textit{NH} values to achieve intra-group weight sharing during message propagation and aggregation. Then the generated node predictions are used to estimate and update new \\textit{NH} values. The two processes of metric estimation and model inference are alternately optimized to achieve better node classification. Extensive experiments on both homophilous and heterophilous benchmarks demonstrate that \\textbf{NHGCN} achieves state-of-the-art overall performance on semi-supervised node classification for the universality problem. ",
    "url": "https://arxiv.org/abs/2301.09851",
    "authors": [
      "Shengbo Gong",
      "Jiajun Zhou",
      "Chenxuan Xie",
      "Qi Xuan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09876",
    "title": "Using Knowledge Graphs for Performance Prediction of Modular  Optimization Algorithms",
    "abstract": "Empirical data plays an important role in evolutionary computation research. To make better use of the available data, ontologies have been proposed in the literature to organize their storage in a structured way. However, the full potential of these formal methods to capture our domain knowledge has yet to be demonstrated. In this work, we evaluate a performance prediction model built on top of the extension of the recently proposed OPTION ontology. More specifically, we first extend the OPTION ontology with the vocabulary needed to represent modular black-box optimization algorithms. Then, we use the extended OPTION ontology, to create knowledge graphs with fixed-budget performance data for two modular algorithm frameworks, modCMA, and modDE, for the 24 noiseless BBOB benchmark functions. We build the performance prediction model using a knowledge graph embedding-based methodology. Using a number of different evaluation scenarios, we show that a triple classification approach, a fairly standard predictive modeling task in the context of knowledge graphs, can correctly predict whether a given algorithm instance will be able to achieve a certain target precision for a given problem instance. This approach requires feature representation of algorithms and problems. While the latter is already well developed, we hope that our work will motivate the community to collaborate on appropriate algorithm representations. ",
    "url": "https://arxiv.org/abs/2301.09876",
    "authors": [
      "Ana Kostovska",
      "Diederick Vermetten",
      "Sašo Džeroski",
      "Panče Panov",
      "Tome Eftimov",
      "Carola Doerr"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.09879",
    "title": "Data Augmentation Alone Can Improve Adversarial Training",
    "abstract": "Adversarial training suffers from the issue of robust overfitting, which seriously impairs its generalization performance. Data augmentation, which is effective at preventing overfitting in standard training, has been observed by many previous works to be ineffective in mitigating overfitting in adversarial training. This work proves that, contrary to previous findings, data augmentation alone can significantly boost accuracy and robustness in adversarial training. We find that the hardness and the diversity of data augmentation are important factors in combating robust overfitting. In general, diversity can improve both accuracy and robustness, while hardness can boost robustness at the cost of accuracy within a certain limit and degrade them both over that limit. To mitigate robust overfitting, we first propose a new crop transformation, Cropshift, which has improved diversity compared to the conventional one (Padcrop). We then propose a new data augmentation scheme, based on Cropshift, with much improved diversity and well-balanced hardness. Empirically, our augmentation method achieves the state-of-the-art accuracy and robustness for data augmentations in adversarial training. Furthermore, when combined with weight averaging it matches, or even exceeds, the performance of the best contemporary regularization methods for alleviating robust overfitting. Code is available at: https://github.com/TreeLLi/DA-Alone-Improves-AT. ",
    "url": "https://arxiv.org/abs/2301.09879",
    "authors": [
      "Lin Li",
      "Michael Spratling"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09892",
    "title": "Learning Effective Strategies for Moving Target Defense with Switching  Costs",
    "abstract": "Moving Target Defense (MTD) has emerged as a key technique in various security applications as it takes away the attacker's ability to perform reconnaissance for exploiting a system's vulnerabilities. However, most of the existing research in the field assumes unrealistic access to information about the attacker's motivations and/or actions when developing MTD strategies. Many of the existing approaches also assume complete knowledge regarding the vulnerabilities of a system and how each of these vulnerabilities can be exploited by an attacker. In this work, we aim to create algorithms that generate effective Moving Target Defense strategies that do not rely on prior knowledge about the attackers. Our work assumes that the only way the defender receives information about its own reward is via interaction with the attacker in a repeated game setting. Depending on the amount of information that can be obtained from the interactions, we devise two different algorithms using multi-armed bandit formulation to identify efficient strategies. We then evaluate our algorithms using data mined from the National Vulnerability Database to showcase that they match the performance of the state-of-the-art techniques, despite using a lot less amount of information. ",
    "url": "https://arxiv.org/abs/2301.09892",
    "authors": [
      "Vignesh Viswanathan",
      "Megha Bose",
      "Praveen Paruchuri"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.09906",
    "title": "Transfer Learning for Olfactory Object Detection",
    "abstract": "We investigate the effect of style and category similarity in multiple datasets used for object detection pretraining. We find that including an additional stage of object-detection pretraining can increase the detection performance considerably. While our experiments suggest that style similarities between pre-training and target datasets are less important than matching categories, further experiments are needed to verify this hypothesis. ",
    "url": "https://arxiv.org/abs/2301.09906",
    "authors": [
      "Mathias Zinnen",
      "Prathmesh Madhu",
      "Peter Bell",
      "Andreas Maier",
      "Vincent Christlein"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09919",
    "title": "Opportunities and Challenges in Neural Dialog Tutoring",
    "abstract": "Designing dialog tutors has been challenging as it involves modeling the diverse and complex pedagogical strategies employed by human tutors. Although there have been significant recent advances in neural conversational systems using large language models and growth in available dialog corpora, dialog tutoring has largely remained unaffected by these advances. In this paper, we rigorously analyze various generative language models on two dialog tutoring datasets for language learning using automatic and human evaluations to understand the new opportunities brought by these advances as well as the challenges we must overcome to build models that would be usable in real educational settings. We find that although current approaches can model tutoring in constrained learning scenarios when the number of concepts to be taught and possible teacher strategies are small, they perform poorly in less constrained scenarios. Our human quality evaluation shows that both models and ground-truth annotations exhibit low performance in terms of equitable tutoring, which measures learning opportunities for students and how engaging the dialog is. To understand the behavior of our models in a real tutoring setting, we conduct a user study using expert annotators and find a significantly large number of model reasoning errors in 45% of conversations. Finally, we connect our findings to outline future work. ",
    "url": "https://arxiv.org/abs/2301.09919",
    "authors": [
      "Jakub Macina",
      "Nico Daheim",
      "Lingzhi Wang",
      "Tanmay Sinha",
      "Manu Kapur",
      "Iryna Gurevych",
      "Mrinmaya Sachan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.09939",
    "title": "Solving the Discretised Neutron Diffusion Equations using Neural  Networks",
    "abstract": "This paper presents a new approach which uses the tools within Artificial Intelligence (AI) software libraries as an alternative way of solving partial differential equations (PDEs) that have been discretised using standard numerical methods. In particular, we describe how to represent numerical discretisations arising from the finite volume and finite element methods by pre-determining the weights of convolutional layers within a neural network. As the weights are defined by the discretisation scheme, no training of the network is required and the solutions obtained are identical (accounting for solver tolerances) to those obtained with standard codes often written in Fortran or C++. We also explain how to implement the Jacobi method and a multigrid solver using the functions available in AI libraries. For the latter, we use a U-Net architecture which is able to represent a sawtooth multigrid method. A benefit of using AI libraries in this way is that one can exploit their power and their built-in technologies. For example, their executions are already optimised for different computer architectures, whether it be CPUs, GPUs or new-generation AI processors. In this article, we apply the proposed approach to eigenvalue problems in reactor physics where neutron transport is described by diffusion theory. For a fuel assembly benchmark, we demonstrate that the solution obtained from our new approach is the same (accounting for solver tolerances) as that obtained from the same discretisation coded in a standard way using Fortran. We then proceed to solve a reactor core benchmark using the new approach. ",
    "url": "https://arxiv.org/abs/2301.09939",
    "authors": [
      "T. R. F. Phillips",
      "C. E. Heaney",
      "C. Boyang",
      "A. G. Buchan",
      "C. C. Pain"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2301.09984",
    "title": "Fair and skill-diverse student group formation via constrained k-way  graph partitioning",
    "abstract": "Forming the right combination of students in a group promises to enable a powerful and effective environment for learning and collaboration. However, defining a group of students is a complex task which has to satisfy multiple constraints. This work introduces an unsupervised algorithm for fair and skill-diverse student group formation. This is achieved by taking account of student course marks and sensitive attributes provided by the education office. The skill sets of students are determined using unsupervised dimensionality reduction of course mark data via the Laplacian eigenmap. The problem is formulated as a constrained graph partitioning problem, whereby the diversity of skill sets in each group are maximised, group sizes are upper and lower bounded according to available resources, and `balance' of a sensitive attribute is lower bounded to enforce fairness in group formation. This optimisation problem is solved using integer programming and its effectiveness is demonstrated on a dataset of student course marks from Imperial College London. ",
    "url": "https://arxiv.org/abs/2301.09984",
    "authors": [
      "Alexander Jenkins",
      "Imad Jaimoukha",
      "Ljubisa Stankovic",
      "Danilo Mandic"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2301.09991",
    "title": "Solving the Discretised Neutron Diffusion Equations using Neural  Networks: Applications in neutron transport",
    "abstract": "In this paper we solve the Boltzmann transport equation using AI libraries. The reason why this is attractive is because it enables one to use the highly optimised software within AI libraries, enabling one to run on different computer architectures and enables one to tap into the vast quantity of community based software that has been developed for AI and ML applications e.g. mixed arithmetic precision or model parallelism. Here we take the first steps towards developing this approach for the Boltzmann transport equation and develop the necessary methods in order to do that effectively. This includes: 1) A space-angle multigrid solution method that can extract the level of parallelism necessary to run efficiently on GPUs or new AI computers. 2) A new Convolutional Finite Element Method (ConvFEM) that greatly simplifies the implementation of high order finite elements (quadratic to quintic, say). 3) A new non-linear Petrov-Galerkin method that introduces dissipation anisotropically. ",
    "url": "https://arxiv.org/abs/2301.09991",
    "authors": [
      "T. R. F. Phillips",
      "C. E. Heaney",
      "C. Boyang",
      "A. G. Buchan",
      "C. C. Pain"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2301.10015",
    "title": "Deep Attention-Based Alignment Network for Melody Generation from  Incomplete Lyrics",
    "abstract": "We propose a deep attention-based alignment network, which aims to automatically predict lyrics and melody with given incomplete lyrics as input in a way similar to the music creation of humans. Most importantly, a deep neural lyrics-to-melody net is trained in an encoder-decoder way to predict possible pairs of lyrics-melody when given incomplete lyrics (few keywords). The attention mechanism is exploited to align the predicted lyrics with the melody during the lyrics-to-melody generation. The qualitative and quantitative evaluation metrics reveal that the proposed method is indeed capable of generating proper lyrics and corresponding melody for composing new songs given a piece of incomplete seed lyrics. ",
    "url": "https://arxiv.org/abs/2301.10015",
    "authors": [
      "Gurunath Reddy M",
      "Zhe Zhang",
      "Yi Yu",
      "Florian Harscoet",
      "Simon Canales",
      "Suhua Tang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2301.10022",
    "title": "Koopman neural operator as a mesh-free solver of non-linear partial  differential equations",
    "abstract": "The lacking of analytic solutions of diverse partial differential equations (PDEs) gives birth to series of computational techniques for numerical solutions. In machine learning, numerous latest advances of solver designs are accomplished in developing neural operators, a kind of mesh-free approximators of the infinite-dimensional operators that map between different parameterization spaces of equation solutions. Although neural operators exhibit generalization capacities for learning an entire PDE family simultaneously, they become less accurate and explainable while learning long-term behaviours of non-linear PDE families. In this paper, we propose Koopman neural operator (KNO), a new neural operator, to overcome these challenges. With the same objective of learning an infinite-dimensional mapping between Banach spaces that serves as the solution operator of target PDE family, our approach differs from existing models by formulating a non-linear dynamic system of equation solution. By approximating the Koopman operator, an infinite-dimensional linear operator governing all possible observations of the dynamic system, to act on the flow mapping of dynamic system, we can equivalently learn the solution of an entire non-linear PDE family by solving simple linear prediction problems. In zero-shot prediction and long-term prediction experiments on representative PDEs (e.g., the Navier-Stokes equation), KNO exhibits notable advantages in breaking the tradeoff between accuracy and efficiency (e.g., model size) while previous state-of-the-art models are limited. These results suggest that more efficient PDE solvers can be developed by the joint efforts from physics and machine learning. ",
    "url": "https://arxiv.org/abs/2301.10022",
    "authors": [
      "Wei Xiong",
      "Xiaomeng Huang",
      "Ziyang Zhang",
      "Ruixuan Deng",
      "Pei Sun",
      "Yang Tian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Computational Physics (physics.comp-ph)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2301.10031",
    "title": "Treewidth is NP-Complete on Cubic Graphs (and related results)",
    "abstract": "In this paper, we give a very simple proof that Treewidth is NP-complete; this proof also shows NP-completeness on the class of co-bipartite graphs. We then improve the result by Bodlaender and Thilikos from 1997 that Treewidth is NP-complete on graphs with maximum degree at most 9, by showing that Treewidth is NP-complete on cubic graphs. ",
    "url": "https://arxiv.org/abs/2301.10031",
    "authors": [
      "Hans L. Bodlaender",
      "Édouard Bonnet",
      "Lars Jaffke",
      "Dušan Knop",
      "Paloma T. Lima",
      "Martin Milanič",
      "Sebastian Ordyniak",
      "Sukanya Pandey",
      "Ondřej Suchý"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)",
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2301.10034",
    "title": "Open-World Multi-Task Control Through Goal-Aware Representation Learning  and Adaptive Horizon Prediction",
    "abstract": "We study the problem of learning goal-conditioned policies in Minecraft, a popular, widely accessible yet challenging open-ended environment for developing human-level multi-task agents. We first identify two main challenges of learning such policies: 1) the indistinguishability of tasks from the state distribution, due to the vast scene diversity, and 2) the non-stationary nature of environment dynamics caused by partial observability. To tackle the first challenge, we propose Goal-Sensitive Backbone (GSB) for the policy to encourage the emergence of goal-relevant visual state representations. To tackle the second challenge, the policy is further fueled by an adaptive horizon prediction module that helps alleviate the learning uncertainty brought by the non-stationary dynamics. Experiments on 20 Minecraft tasks show that our method significantly outperforms the best baseline so far; in many of them, we double the performance. Our ablation and exploratory studies then explain how our approach beat the counterparts and also unveil the surprising bonus of zero-shot generalization to new scenes (biomes). We hope our agent could help shed some light on learning goal-conditioned, multi-task agents in challenging, open-ended environments like Minecraft. ",
    "url": "https://arxiv.org/abs/2301.10034",
    "authors": [
      "Shaofei Cai",
      "Zihao Wang",
      "Xiaojian Ma",
      "Anji Liu",
      "Yitao Liang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.10052",
    "title": "Event Detection in Football using Graph Convolutional Networks",
    "abstract": "The massive growth of data collection in sports has opened numerous avenues for professional teams and media houses to gain insights from this data. The data collected includes per frame player and ball trajectories, and event annotations such as passes, fouls, cards, goals, etc. Graph Convolutional Networks (GCNs) have recently been employed to process this highly unstructured tracking data which can be otherwise difficult to model because of lack of clarity on how to order players in a sequence and how to handle missing objects of interest. In this thesis, we focus on the goal of automatic event detection from football videos. We show how to model the players and the ball in each frame of the video sequence as a graph, and present the results for graph convolutional layers and pooling methods that can be used to model the temporal context present around each action. ",
    "url": "https://arxiv.org/abs/2301.10052",
    "authors": [
      "Aditya Sangram Singh Rana"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.10053",
    "title": "A Linear Reconstruction Approach for Attribute Inference Attacks against  Synthetic Data",
    "abstract": "Personal data collected at scale from surveys or digital devices offers important insights for statistical analysis and scientific research. Safely sharing such data while protecting privacy is however challenging. Anonymization allows data to be shared while minimizing privacy risks, but traditional anonymization techniques have been repeatedly shown to provide limited protection against re-identification attacks in practice. Among modern anonymization techniques, synthetic data generation (SDG) has emerged as a potential solution to find a good tradeoff between privacy and statistical utility. Synthetic data is typically generated using algorithms that learn the statistical distribution of the original records, to then generate \"artificial\" records that are structurally and statistically similar to the original ones. Yet, the fact that synthetic records are \"artificial\" does not, per se, guarantee that privacy is protected. In this work, we systematically evaluate the tradeoffs between protecting privacy and preserving statistical utility for a wide range of synthetic data generation algorithms. Modeling privacy as protection against attribute inference attacks (AIAs), we extend and adapt linear reconstruction attacks, which have not been previously studied in the context of synthetic data. While prior work suggests that AIAs may be effective only on few outlier records, we show they can be very effective even on randomly selected records. We evaluate attacks on synthetic datasets ranging from 10^3 to 10^6 records, showing that even for the same generative model, the attack effectiveness can drastically increase when a larger number of synthetic records is generated. Overall, our findings prove that synthetic data is subject to privacy-utility tradeoffs just like other anonymization techniques: when good utility is preserved, attribute inference can be a risk for many data subjects. ",
    "url": "https://arxiv.org/abs/2301.10053",
    "authors": [
      "Meenatchi Sundaram Muthu Selva Annamalai",
      "Andrea Gadotti",
      "Luc Rocher"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.10115",
    "title": "A Robust Hypothesis Test for Tree Ensemble Pruning",
    "abstract": "Gradient boosted decision trees are some of the most popular algorithms in applied machine learning. They are a flexible and powerful tool that can robustly fit to any tabular dataset in a scalable and computationally efficient way. One of the most critical parameters to tune when fitting these models are the various penalty terms used to distinguish signal from noise in the current model. These penalties are effective in practice, but are lacking in robust theoretical justifications. In this paper we develop and present a novel theoretically justified hypothesis test of split quality for gradient boosted tree ensembles and demonstrate that using this method instead of the common penalty terms leads to a significant reduction in out of sample loss. Additionally, this method provides a theoretically well-justified stopping condition for the tree growing algorithm. We also present several innovative extensions to the method, opening the door for a wide variety of novel tree pruning algorithms. ",
    "url": "https://arxiv.org/abs/2301.10115",
    "authors": [
      "Daniel de Marchi",
      "Matthew Welch",
      "Michael Kosorok"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.10119",
    "title": "Minimal Value-Equivalent Partial Models for Scalable and Robust Planning  in Lifelong Reinforcement Learning",
    "abstract": "Learning models of the environment from pure interaction is often considered an essential component of building lifelong reinforcement learning agents. However, the common practice in model-based reinforcement learning is to learn models that model every aspect of the agent's environment, regardless of whether they are important in coming up with optimal decisions or not. In this paper, we argue that such models are not particularly well-suited for performing scalable and robust planning in lifelong reinforcement learning scenarios and we propose new kinds of models that only model the relevant aspects of the environment, which we call \"minimal value-equivalent partial models\". After providing a formal definition for these models, we provide theoretical results demonstrating the scalability advantages of performing planning with such models and then perform experiments to empirically illustrate our theoretical results. Then, we provide some useful heuristics on how to learn these kinds of models with deep learning architectures and empirically demonstrate that models learned in such a way can allow for performing planning that is robust to distribution shifts and compounding model errors. Overall, both our theoretical and empirical results suggest that minimal value-equivalent partial models can provide significant benefits to performing scalable and robust planning in lifelong reinforcement learning scenarios. ",
    "url": "https://arxiv.org/abs/2301.10119",
    "authors": [
      "Safa Alver",
      "Doina Precup"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.10134",
    "title": "Bipartite Graph Diffusion Model for Human Interaction Generation",
    "abstract": "The generation of natural human motion interactions is a hot topic in computer vision and computer animation. It is a challenging task due to the diversity of possible human motion interactions. Diffusion models, which have already shown remarkable generative capabilities in other domains, are a good candidate for this task. In this paper, we introduce a novel bipartite graph diffusion method (BiGraphDiff) to generate human motion interactions between two persons. Specifically, bipartite node sets are constructed to model the inherent geometric constraints between skeleton nodes during interactions. The interaction graph diffusion model is transformer-based, combining some state-of-the-art motion methods. We show that the proposed achieves new state-of-the-art results on leading benchmarks for the human interaction generation task. ",
    "url": "https://arxiv.org/abs/2301.10134",
    "authors": [
      "Baptiste Chopin",
      "Hao Tang",
      "Mohamed Daoudi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.10152",
    "title": "How Jellyfish Characterise Alternating Group Equivariant Neural Networks",
    "abstract": "We provide a full characterisation of all of the possible alternating group ($A_n$) equivariant neural networks whose layers are some tensor power of $\\mathbb{R}^{n}$. In particular, we find a basis of matrices for the learnable, linear, $A_n$-equivariant layer functions between such tensor power spaces in the standard basis of $\\mathbb{R}^{n}$. We also describe how our approach generalises to the construction of neural networks that are equivariant to local symmetries. ",
    "url": "https://arxiv.org/abs/2301.10152",
    "authors": [
      "Edward Pearce-Crump"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Combinatorics (math.CO)",
      "Representation Theory (math.RT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.10159",
    "title": "Computational Solar Energy -- Ensemble Learning Methods for Prediction  of Solar Power Generation based on Meteorological Parameters in Eastern India",
    "abstract": "The challenges in applications of solar energy lies in its intermittency and dependency on meteorological parameters such as; solar radiation, ambient temperature, rainfall, wind-speed etc., and many other physical parameters like dust accumulation etc. Hence, it is important to estimate the amount of solar photovoltaic (PV) power generation for a specific geographical location. Machine learning (ML) models have gained importance and are widely used for prediction of solar power plant performance. In this paper, the impact of weather parameters on solar PV power generation is estimated by several Ensemble ML (EML) models like Bagging, Boosting, Stacking, and Voting for the first time. The performance of chosen ML algorithms is validated by field dataset of a 10kWp solar PV power plant in Eastern India region. Furthermore, a complete test-bed framework has been designed for data mining as well as to select appropriate learning models. It also supports feature selection and reduction for dataset to reduce space and time complexity of the learning models. The results demonstrate greater prediction accuracy of around 96% for Stacking and Voting EML models. The proposed work is a generalized one and can be very useful for predicting the performance of large-scale solar PV power plants also. ",
    "url": "https://arxiv.org/abs/2301.10159",
    "authors": [
      "Debojyoti Chakraborty",
      "Jayeeta Mondal",
      "Hrishav Bakul Barua",
      "Ankur Bhattacharjee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Computers and Society (cs.CY)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.10165",
    "title": "Lexi: Self-Supervised Learning of the UI Language",
    "abstract": "Humans can learn to operate the user interface (UI) of an application by reading an instruction manual or how-to guide. Along with text, these resources include visual content such as UI screenshots and images of application icons referenced in the text. We explore how to leverage this data to learn generic visio-linguistic representations of UI screens and their components. These representations are useful in many real applications, such as accessibility, voice navigation, and task automation. Prior UI representation models rely on UI metadata (UI trees and accessibility labels), which is often missing, incompletely defined, or not accessible. We avoid such a dependency, and propose Lexi, a pre-trained vision and language model designed to handle the unique features of UI screens, including their text richness and context sensitivity. To train Lexi we curate the UICaption dataset consisting of 114k UI images paired with descriptions of their functionality. We evaluate Lexi on four tasks: UI action entailment, instruction-based UI image retrieval, grounding referring expressions, and UI entity recognition. ",
    "url": "https://arxiv.org/abs/2301.10165",
    "authors": [
      "Pratyay Banerjee",
      "Shweti Mahajan",
      "Kushal Arora",
      "Chitta Baral",
      "Oriana Riva"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.10171",
    "title": "Spectral Cross-Domain Neural Network with Soft-adaptive Threshold  Spectral Enhancement",
    "abstract": "Electrocardiography (ECG) signals can be considered as multi-variable time-series. The state-of-the-art ECG data classification approaches, based on either feature engineering or deep learning techniques, treat separately spectral and time domains in machine learning systems. No spectral-time domain communication mechanism inside the classifier model can be found in current approaches, leading to difficulties in identifying complex ECG forms. In this paper, we proposed a novel deep learning model named Spectral Cross-domain neural network (SCDNN) with a new block called Soft-adaptive threshold spectral enhancement (SATSE), to simultaneously reveal the key information embedded in spectral and time domains inside the neural network. More precisely, the domain-cross information is captured by a general Convolutional neural network (CNN) backbone, and different information sources are merged by a self-adaptive mechanism to mine the connection between time and spectral domains. In SATSE, the knowledge from time and spectral domains is extracted via the Fast Fourier Transformation (FFT) with soft trainable thresholds in modified Sigmoid functions. The proposed SCDNN is tested with several classification tasks implemented on the public ECG databases \\textit{PTB-XL} and \\textit{MIT-BIH}. SCDNN outperforms the state-of-the-art approaches with a low computational cost regarding a variety of metrics in all classification tasks on both databases, by finding appropriate domains from the infinite spectral mapping. The convergence of the trainable thresholds in the spectral domain is also numerically investigated in this paper. The robust performance of SCDNN provides a new perspective to exploit knowledge across deep learning models from time and spectral domains. The repository can be found: https://github.com/DL-WG/SCDNN-TS ",
    "url": "https://arxiv.org/abs/2301.10171",
    "authors": [
      "Che Liu",
      "Sibo Cheng",
      "Weiping Ding",
      "Rossella Arcucci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.10173",
    "title": "Accurate Detection of Paroxysmal Atrial Fibrillation with Certified-GAN  and Neural Architecture Search",
    "abstract": "This paper presents a novel machine learning framework for detecting Paroxysmal Atrial Fibrillation (PxAF), a pathological characteristic of Electrocardiogram (ECG) that can lead to fatal conditions such as heart attack. To enhance the learning process, the framework involves a Generative Adversarial Network (GAN) along with a Neural Architecture Search (NAS) in the data preparation and classifier optimization phases. The GAN is innovatively invoked to overcome the class imbalance of the training data by producing the synthetic ECG for PxAF class in a certified manner. The effect of the certified GAN is statistically validated. Instead of using a general-purpose classifier, the NAS automatically designs a highly accurate convolutional neural network architecture customized for the PxAF classification task. Experimental results show that the accuracy of the proposed framework exhibits a high value of 99% which not only enhances state-of-the-art by up to 5.1%, but also improves the classification performance of the two widely-accepted baseline methods, ResNet-18, and Auto-Sklearn, by 2.2% and 6.1%. ",
    "url": "https://arxiv.org/abs/2301.10173",
    "authors": [
      "Mehdi Asadi",
      "Fatemeh Poursalim",
      "Mohammad Loni",
      "Masoud Daneshtalab",
      "Mikael Sjödin",
      "Arash Gharehbaghi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.10186",
    "title": "ViHOS: Hate Speech Spans Detection for Vietnamese",
    "abstract": "The rise in hateful and offensive language directed at other users is one of the adverse side effects of the increased use of social networking platforms. This could make it difficult for human moderators to review tagged comments filtered by classification systems. To help address this issue, we present the ViHOS (Vietnamese Hate and Offensive Spans) dataset, the first human-annotated corpus containing 26k spans on 11k comments. We also provide definitions of hateful and offensive spans in Vietnamese comments as well as detailed annotation guidelines. Besides, we conduct experiments with various state-of-the-art models. Specifically, XLM-R$_{Large}$ achieved the best F1-scores in Single span detection and All spans detection, while PhoBERT$_{Large}$ obtained the highest in Multiple spans detection. Finally, our error analysis demonstrates the difficulties in detecting specific types of spans in our data for future research. Disclaimer: This paper contains real comments that could be considered profane, offensive, or abusive. ",
    "url": "https://arxiv.org/abs/2301.10186",
    "authors": [
      "Phu Gia Hoang",
      "Canh Duc Luu",
      "Khanh Quoc Tran",
      "Kiet Van Nguyen",
      "Ngan Luu-Thuy Nguyen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.10208",
    "title": "A Simple Adaptive Unfolding Network for Hyperspectral Image  Reconstruction",
    "abstract": "We present a simple, efficient, and scalable unfolding network, SAUNet, to simplify the network design with an adaptive alternate optimization framework for hyperspectral image (HSI) reconstruction. SAUNet customizes a Residual Adaptive ADMM Framework (R2ADMM) to connect each stage of the network via a group of learnable parameters to promote the usage of mask prior, which greatly stabilizes training and solves the accuracy degradation issue. Additionally, we introduce a simple convolutional modulation block (CMB), which leads to efficient training, easy scale-up, and less computation. Coupling these two designs, SAUNet can be scaled to non-trivial 13 stages with continuous improvement. Without bells and whistles, SAUNet improves both performance and speed compared with the previous state-of-the-art counterparts, which makes it feasible for practical high-resolution HSI reconstruction scenarios. We set new records on CAVE and KAIST HSI reconstruction benchmarks. Code and models are available at https://github.com/hustvl/SAUNet. ",
    "url": "https://arxiv.org/abs/2301.10208",
    "authors": [
      "Junyu Wang",
      "Shijie Wang",
      "Wenyu Liu",
      "Zengqiang Zheng",
      "Xinggang Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2301.10216",
    "title": "C-SAR: SAT Attack Resistant Logic Locking for RSFQ Circuits",
    "abstract": "Since the development of semiconductor technologies, exascale computing and its associated applications have required increasing degrees of efficiency. Semiconductor-transistor-based circuits (STbCs) have struggled in increasing the GHz frequency. Emerging as an alternative to STbC, the superconducting electrons (SCE) technology promises higher-speed clock frequencies at ultra-low power consumption. The rapid single flux quantum (RSFQ) circuits have a theoretical potential for three orders of magnitude reduction in power while operating at clock frequencies higher than 100 GHz. Although the security in semiconductor technology has been extensively researched and developed, the security design in the superconducting field requires field demands attention. In this paper, C-SAR is presented that aims to protect the superconducting circuit electronics from Boolean satisfiability (SAT) based attacks. The SAT attack is an attack that can break all the existing combinational logic locking techniques. C-SAR can immunize against SAT attacks by increasing the key search space and prolonging the clock cycles of attack inputs. Even in the worst case of C-SAR, in face of S-SAT a specially designed SAT attack, C-SAR can also soar the attack cost exponentially with key bits first, then linearly with the length of camouflaged DFF array. We have shown in this work that the cost of C-SAR is manageable as it only linearly increases as a function of key bits. ",
    "url": "https://arxiv.org/abs/2301.10216",
    "authors": [
      "Junyao Zhang"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)",
      "Hardware Architecture (cs.AR)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.10221",
    "title": "Social Metaverse: Challenges and Solutions",
    "abstract": "Social metaverse is a shared digital space combining a series of interconnected virtual worlds for users to play, shop, work, and socialize. In parallel with the advances of artificial intelligence (AI) and growing awareness of data privacy concerns, federated learning (FL) is promoted as a paradigm shift towards privacy-preserving AI-empowered social metaverse. However, challenges including privacy-utility tradeoff, learning reliability, and AI model thefts hinder the deployment of FL in real metaverse applications. In this paper, we exploit the pervasive social ties among users/avatars to advance a social-aware hierarchical FL framework, i.e., SocialFL for a better privacy-utility tradeoff in the social metaverse. Then, an aggregator-free robust FL mechanism based on blockchain is devised with a new block structure and an improved consensus protocol featured with on/off-chain collaboration. Furthermore, based on smart contracts and digital watermarks, an automatic federated AI (FedAI) model ownership provenance mechanism is designed to prevent AI model thefts and collusive avatars in social metaverse. Experimental findings validate the feasibility and effectiveness of proposed framework. Finally, we envision promising future research directions in this emerging area. ",
    "url": "https://arxiv.org/abs/2301.10221",
    "authors": [
      "Yuntao Wang",
      "Zhou Su",
      "Miao Yan"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2301.10229",
    "title": "ETHNO-DAANN: Ethnographic Engagement Classification by Deep Adversarial  Transfer Learning",
    "abstract": "Student motivation is a key research agenda due to the necessity of both postcolonial education reform and youth job-market adaptation in ongoing fourth industrial revolution. Post-communism era teachers are prompted to analyze student ethnicity information such as background, origin with the aim of providing better education. With the proliferation of smart-device data, ever-increasing demand for distance learning platforms and various survey results of virtual learning, we are fortunate to have some access to student engagement data. In this research, we are motivated to address the following questions: can we predict student engagement from ethnographic information when we have limited labeled knowledge? If the answer is yes, can we tell which features are most influential in ethnographic engagement learning? In this context, we have proposed a deep neural network based transfer learning algorithm ETHNO-DAANN with adversarial adaptation for ethnographic engagement prediction. We conduct a survey among participants about ethnicity-based student motivation to figure out the most influential feature helpful in final prediction. Thus, our research stands as a general solution for ethnographic motivation parameter estimation in case of limited labeled data. ",
    "url": "https://arxiv.org/abs/2301.10229",
    "authors": [
      "Rossi Kamal",
      "Zuzana Kubincova",
      "Mosaddek Hossain Kamal",
      "Upama Kabir"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2201.11620",
    "title": "Domain generalization in deep learning-based mass detection in  mammography: A large-scale multi-center study",
    "abstract": "Computer-aided detection systems based on deep learning have shown great potential in breast cancer detection. However, the lack of domain generalization of artificial neural networks is an important obstacle to their deployment in changing clinical environments. In this work, we explore the domain generalization of deep learning methods for mass detection in digital mammography and analyze in-depth the sources of domain shift in a large-scale multi-center setting. To this end, we compare the performance of eight state-of-the-art detection methods, including Transformer-based models, trained in a single domain and tested in five unseen domains. Moreover, a single-source mass detection training pipeline is designed to improve the domain generalization without requiring images from the new domain. The results show that our workflow generalizes better than state-of-the-art transfer learning-based approaches in four out of five domains while reducing the domain shift caused by the different acquisition protocols and scanner manufacturers. Subsequently, an extensive analysis is performed to identify the covariate shifts with bigger effects on the detection performance, such as due to differences in patient age, breast density, mass size, and mass malignancy. Ultimately, this comprehensive study provides key insights and best practices for future research on domain generalization in deep learning-based breast cancer detection. ",
    "url": "https://arxiv.org/abs/2201.11620",
    "authors": [
      "Lidia Garrucho",
      "Kaisar Kushibar",
      "Socayna Jouide",
      "Oliver Diaz",
      "Laura Igual",
      "Karim Lekadir"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.03834",
    "title": "HQAlign: Aligning nanopore reads for SV detection using current-level  modeling",
    "abstract": "Motivation: Detection of structural variants (SV) from the alignment of sample DNA reads to the reference genome is an important problem in understanding human diseases. Long reads that can span repeat regions, along with an accurate alignment of these long reads play an important role in identifying novel SVs. Long read sequencers such as nanopore sequencing can address this problem by providing very long reads but with high error rates, making accurate alignment challenging. Many errors induced by nanopore sequencing have a bias because of the physics of the sequencing process and proper utilization of these error characteristics can play an important role in designing a robust aligner for SV detection problems. In this paper, we design and evaluate HQAlign, an aligner for SV detection using nanopore sequenced reads. The key ideas of HQAlign include (i) using basecalled nanopore reads along with the nanopore physics to improve alignments for SVs (ii) incorporating SV specific changes to the alignment pipeline (iii) adapting these into existing state-of-the-art long read aligner pipeline, minimap2 (v2.24), for efficient alignments. Results: We show that HQAlign captures about 4%-6% complementary SVs across different datasets which are missed by minimap2 alignments while having a standalone performance at par with minimap2 for real nanopore reads data. For the common SV calls between HQAlign and minimap2, HQAlign improves the start and the end breakpoint accuracy for about 10%-50% of SVs across different datasets. Moreover, HQAlign improves the alignment rate to 89.35% from minimap2 85.64% for nanopore reads alignment to recent telomere-to-telomere CHM13 assembly, and it improves to 86.65% from 83.48% for nanopore reads alignment to GRCh37 human genome. ",
    "url": "https://arxiv.org/abs/2301.03834",
    "authors": [
      "Dhaivat Joshi",
      "Suhas Diggavi",
      "Mark J.P. Chaisson",
      "Sreeram Kannan"
    ],
    "subjectives": [
      "Genomics (q-bio.GN)",
      "Other Computer Science (cs.OH)"
    ]
  },
  {
    "id": "arXiv:2301.09696",
    "title": "Optimizing the Noise in Self-Supervised Learning: from Importance  Sampling to Noise-Contrastive Estimation",
    "abstract": "Self-supervised learning is an increasingly popular approach to unsupervised learning, achieving state-of-the-art results. A prevalent approach consists in contrasting data points and noise points within a classification task: this requires a good noise distribution which is notoriously hard to specify. While a comprehensive theory is missing, it is widely assumed that the optimal noise distribution should in practice be made equal to the data distribution, as in Generative Adversarial Networks (GANs). We here empirically and theoretically challenge this assumption. We turn to Noise-Contrastive Estimation (NCE) which grounds this self-supervised task as an estimation problem of an energy-based model of the data. This ties the optimality of the noise distribution to the sample efficiency of the estimator, which is rigorously defined as its asymptotic variance, or mean-squared error. In the special case where the normalization constant only is unknown, we show that NCE recovers a family of Importance Sampling estimators for which the optimal noise is indeed equal to the data distribution. However, in the general case where the energy is also unknown, we prove that the optimal noise density is the data density multiplied by a correction term based on the Fisher score. In particular, the optimal noise distribution is different from the data distribution, and is even from a different family. Nevertheless, we soberly conclude that the optimal noise may be hard to sample from, and the gain in efficiency can be modest compared to choosing the noise distribution equal to the data's. ",
    "url": "https://arxiv.org/abs/2301.09696",
    "authors": [
      "Omar Chehab",
      "Alexandre Gramfort",
      "Aapo Hyvarinen"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09756",
    "title": "Earthquake Magnitude and b value prediction model using Extreme Learning  Machine",
    "abstract": "Earthquake prediction has been a challenging research area for many decades, where the future occurrence of this highly uncertain calamity is predicted. In this paper, several parametric and non-parametric features were calculated, where the non-parametric features were calculated using the parametric features. $8$ seismic features were calculated using Gutenberg-Richter law, the total recurrence, and the seismic energy release. Additionally, criterions such as Maximum Relevance and Maximum Redundancy were applied to choose the pertinent features. These features along with others were used as input for an Extreme Learning Machine (ELM) Regression Model. Magnitude and time data of $5$ decades from the Assam-Guwahati region were used to create this model for magnitude prediction. The Testing Accuracy and Testing Speed were computed taking the Root Mean Squared Error (RMSE) as the parameter for evaluating the mode. As confirmed by the results, ELM shows better scalability with much faster training and testing speed (up to a thousand times faster) than traditional Support Vector Machines. The testing RMSE came out to be around $0.097$. To further test the model's robustness -- magnitude-time data from California was used to calculate the seismic indicators which were then fed into an ELM and then tested on the Assam-Guwahati region. The model proves to be robust and can be implemented in early warning systems as it continues to be a major part of Disaster Response and management. ",
    "url": "https://arxiv.org/abs/2301.09756",
    "authors": [
      "Gunbir Singh Baveja",
      "Jaspreet Singh"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09834",
    "title": "Implementation of the Critical Wave Groups Method with Computational  Fluid Dynamics and Neural Networks",
    "abstract": "Accurate and efficient prediction of extreme ship responses continues to be a challenging problem in ship hydrodynamics. Probabilistic frameworks in conjunction with computationally efficient numerical hydrodynamic tools have been developed that allow researchers and designers to better understand extremes. However, the ability of these hydrodynamic tools to represent the physics quantitatively during extreme events is limited. Previous research successfully implemented the critical wave groups (CWG) probabilistic method with computational fluid dynamics (CFD). Although the CWG method allows for less simulation time than a Monte Carlo approach, the large quantity of simulations required is cost prohibitive. The objective of the present paper is to reduce the computational cost of implementing CWG with CFD, through the construction of long short-term memory (LSTM) neural networks. After training the models with a limited quantity of simulations, the models can provide a larger quantity of predictions to calculate the probability. The new framework is demonstrated with a 2-D midship section of the Office of Naval Research Tumblehome (ONRT) hull in Sea State 7 and beam seas at zero speed. The new framework is able to produce predictions that are representative of a purely CFD-driven CWG framework, with two orders of magnitude of computational cost savings. ",
    "url": "https://arxiv.org/abs/2301.09834",
    "authors": [
      "Kevin M. Silva",
      "Kevin J. Maki"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2301.09994",
    "title": "Optical convolutional neural network with atomic nonlinearity",
    "abstract": "Due to their high degree of parallelism, fast processing speeds and low power consumption, analog optical functional elements offer interesting routes for realizing neuro-morphic computer hardware. For instance, convolutional neural networks lend themselves to analog optical implementations by exploiting the Fourier-transform characteristics of suitable designed optical setups. However, the efficient implementation of optical nonlinearities for such neural networks still represents challenges. In this work, we report on the realization and characterization of a three-layer optical convolutional neural network where the linear part is based on a 4f-imaging system and the optical nonlinearity is realized via the absorption profile of a cesium atomic vapor cell. This system classifies the handwritten digital dataset MNIST with 83.96% accuracy, which agrees well with corresponding simulations. Our results thus demonstrate the viability of utilizing atomic nonlinearities in neural network architectures with low power consumption. ",
    "url": "https://arxiv.org/abs/2301.09994",
    "authors": [
      "Mingwei Yang",
      "Elizabeth Robertson",
      "Luisa Esguerra",
      "Kurt Busch",
      "Janik Wolters"
    ],
    "subjectives": [
      "Optics (physics.optics)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2301.10153",
    "title": "Sequential Graph Attention Learning for Predicting Dynamic Stock Trends  (Student Abstract)",
    "abstract": "The stock market is characterized by a complex relationship between companies and the market. This study combines a sequential graph structure with attention mechanisms to learn global and local information within temporal time. Specifically, our proposed \"GAT-AGNN\" module compares model performance across multiple industries as well as within single industries. The results show that the proposed framework outperforms the state-of-the-art methods in predicting stock trends across multiple industries on Taiwan Stock datasets. ",
    "url": "https://arxiv.org/abs/2301.10153",
    "authors": [
      "Tzu-Ya Lai",
      "Wen Jung Cheng",
      "Jun-En Ding"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.10164",
    "title": "Lowering Detection in Sport Climbing Based on Orientation of the Sensor  Enhanced Quickdraw",
    "abstract": "Tracking climbers' activity to improve services and make the best use of their infrastructure is a concern for climbing gyms. Each climbing session must be analyzed from beginning till lowering of the climber. Therefore, spotting the climbers descending is crucial since it indicates when the ascent has come to an end. This problem must be addressed while preserving privacy and convenience of the climbers and the costs of the gyms. To this aim, a hardware prototype is developed to collect data using accelerometer sensors attached to a piece of climbing equipment mounted on the wall, called quickdraw, that connects the climbing rope to the bolt anchors. The corresponding sensors are configured to be energy-efficient, hence become practical in terms of expenses and time consumption for replacement when using in large quantity in a climbing gym. This paper describes hardware specifications, studies data measured by the sensors in ultra-low power mode, detect sensors' orientation patterns during lowering different routes, and develop an supervised approach to identify lowering. ",
    "url": "https://arxiv.org/abs/2301.10164",
    "authors": [
      "Sadaf Moaveninejad",
      "Andrea Janes"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.10166",
    "title": "Leveraging Vision-Language Models for Granular Market Change Prediction",
    "abstract": "Predicting future direction of stock markets using the historical data has been a fundamental component in financial forecasting. This historical data contains the information of a stock in each specific time span, such as the opening, closing, lowest, and highest price. Leveraging this data, the future direction of the market is commonly predicted using various time-series models such as Long-Short Term Memory networks. This work proposes modeling and predicting market movements with a fundamentally new approach, namely by utilizing image and byte-based number representation of the stock data processed with the recently introduced Vision-Language models. We conduct a large set of experiments on the hourly stock data of the German share index and evaluate various architectures on stock price prediction using historical stock data. We conduct a comprehensive evaluation of the results with various metrics to accurately depict the actual performance of various approaches. Our evaluation results show that our novel approach based on representation of stock data as text (bytes) and image significantly outperforms strong deep learning-based baselines. ",
    "url": "https://arxiv.org/abs/2301.10166",
    "authors": [
      "Christopher Wimmer",
      "Navid Rekabsaz"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.10167",
    "title": "EEG Opto-processor: epileptic seizure detection using diffractive  photonic computing units",
    "abstract": "Electroencephalography (EEG) analysis extracts critical information from brain signals, which has provided fundamental support for various applications, including brain-disease diagnosis and brain-computer interface. However, the real-time processing of large-scale EEG signals at high energy efficiency has placed great challenges for electronic processors on edge computing devices. Here, we propose the EEG opto-processor based on diffractive photonic computing units (DPUs) to effectively process the extracranial and intracranial EEG signals and perform epileptic seizure detection. The signals of EEG channels within a second-time window are optically encoded as inputs to the constructed diffractive neural networks for classification, which monitors the brain state to determine whether it's the symptom of an epileptic seizure or not. We developed both the free-space and integrated DPUs as edge computing systems and demonstrated their applications for real-time epileptic seizure detection with the benchmark datasets, i.e., the CHB-MIT extracranial EEG dataset and Epilepsy-iEEG-Multicenter intracranial EEG dataset, at high computing performance. Along with the channel selection mechanism, both the numerical evaluations and experimental results validated the sufficient high classification accuracies of the proposed opto-processors for supervising the clinical diagnosis. Our work opens up a new research direction of utilizing photonic computing techniques for processing large-scale EEG signals in promoting its broader applications. ",
    "url": "https://arxiv.org/abs/2301.10167",
    "authors": [
      "Tao Yan",
      "Maoqi Zhang",
      "Sen Wan",
      "Kaifeng Shang",
      "Haiou Zhang",
      "Xun Cao",
      "Xing Lin",
      "Qionghai Dai"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2301.10168",
    "title": "CovidRhythm: A Deep Learning Model for Passive Prediction of Covid-19  using Biobehavioral Rhythms Derived from Wearable Physiological Data",
    "abstract": "To investigate whether a deep learning model can detect Covid-19 from disruptions in the human body's physiological (heart rate) and rest-activity rhythms (rhythmic dysregulation) caused by the SARS-CoV-2 virus. We propose CovidRhythm, a novel Gated Recurrent Unit (GRU) Network with Multi-Head Self-Attention (MHSA) that combines sensor and rhythmic features extracted from heart rate and activity (steps) data gathered passively using consumer-grade smart wearable to predict Covid-19. A total of 39 features were extracted (standard deviation, mean, min/max/avg length of sedentary and active bouts) from wearable sensor data. Biobehavioral rhythms were modeled using nine parameters (mesor, amplitude, acrophase, and intra-daily variability). These features were then input to CovidRhythm for predicting Covid-19 in the incubation phase (one day before biological symptoms manifest). A combination of sensor and biobehavioral rhythm features achieved the highest AUC-ROC of 0.79 [Sensitivity = 0.69, Specificity=0.89, F$_{0.1}$ = 0.76], outperforming prior approaches in discriminating Covid-positive patients from healthy controls using 24 hours of historical wearable physiological. Rhythmic features were the most predictive of Covid-19 infection when utilized either alone or in conjunction with sensor features. Sensor features predicted healthy subjects best. Circadian rest-activity rhythms that combine 24h activity and sleep information were the most disrupted. CovidRhythm demonstrates that biobehavioral rhythms derived from consumer-grade wearable data can facilitate timely Covid-19 detection. To the best of our knowledge, our work is the first to detect Covid-19 using deep learning and biobehavioral rhythms features derived from consumer-grade wearable data. ",
    "url": "https://arxiv.org/abs/2301.10168",
    "authors": [
      "Atifa Sarwar",
      "Emmanuel O. Agu"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.10177",
    "title": "Co-channel Interference Management for the Next-Generation Heterogeneous  Networks using Deep Leaning",
    "abstract": "The connectivity of public-safety mobile users (MU) in the co-existence of a public-safety network (PSN), unmanned aerial vehicles (UAVs), and LTE-based railway networks (LRN) needs a thorough investigation. UAVs are deployed as mobile base stations (BSs) for cell-edge coverage enhancement for MU. The co-existence of heterogeneous networks gives rise to the issue of co-channel interference due to the utilization of the same frequency band. By considering both sharing and non-sharing of radio access channels (RAC), we analyze co-channel interference in the downlink system of PSN, UAV, and LRN. As the LRN control signal demands high reliability and low latency, we provide higher priority to LRN users when allocating resources from the LRN RAC shared with MUs. Moreover, UAVs are deployed at the cell edge to increase the performance of cell-edge users. Therefore, interference control techniques enable LRN, PSN, and UAVs to cohabit in a scenario of sharing RAC. By offloading more PSN UEs to the LRN or UAVs, the resource utilization of the LRN and UAVs BSs is enhanced. In this paper, we aim to adopt deep learning (DL) based on enhanced inter-cell-interference coordination (eICIC) and further enhanced ICIC (FeICIC) strategies to deal with the interference from the PSN to the LRN and UAVs. Among LRN, PSN BS, and UAVs, a DL-based coordinated multipoint (CoMP) link technique is utilized to enhance the performance of PSN MUs. Therefore, if radio access channels are shared, utilization of DL-based FeICIC and CoMP for coordinated scheduling gives the best performance. ",
    "url": "https://arxiv.org/abs/2301.10177",
    "authors": [
      "Ishtiaq Ahmad",
      "Aftab Hussain"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2009.01797",
    "title": "A Wholistic View of Continual Learning with Deep Neural Networks:  Forgotten Lessons and the Bridge to Active and Open World Learning",
    "abstract": " Comments: Accepted for publication at Neural Networks in open-access form. Final version available at: this https URL ",
    "url": "https://arxiv.org/abs/2009.01797",
    "authors": [
      "Martin Mundt",
      "Yongwon Hong",
      "Iuliia Pliushch",
      "Visvanathan Ramesh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2009.01822",
    "title": "Fine-grained Early Frequency Attention for Deep Speaker Representation  Learning",
    "abstract": " Title: Fine-grained Early Frequency Attention for Deep Speaker Representation  Learning ",
    "url": "https://arxiv.org/abs/2009.01822",
    "authors": [
      "Amirhossein Hajavi",
      "Ali Etemad"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2102.11598",
    "title": "Gradient-adjusted Incremental Target Propagation Provides Effective  Credit Assignment in Deep Neural Networks",
    "abstract": " Title: Gradient-adjusted Incremental Target Propagation Provides Effective  Credit Assignment in Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2102.11598",
    "authors": [
      "Sander Dalm",
      "Nasir Ahmad",
      "Luca Ambrogioni",
      "Marcel van Gerven"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.07738",
    "title": "Noise Robust Core-Stable Coalitions of Hedonic Games",
    "abstract": " Comments: Accepted in Asian Conference on Machine Learning 2022. To appear in Proceedings of Machine Learning Research 189, 2022 ",
    "url": "https://arxiv.org/abs/2109.07738",
    "authors": [
      "Prashant Trivedi",
      "Nandyala Hemachandra"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2110.11205",
    "title": "Robustness through Data Augmentation Loss Consistency",
    "abstract": " Comments: 40 pages ",
    "url": "https://arxiv.org/abs/2110.11205",
    "authors": [
      "Tianjian Huang",
      "Shaunak Halbe",
      "Chinnadhurai Sankar",
      "Pooyan Amini",
      "Satwik Kottur",
      "Alborz Geramifard",
      "Meisam Razaviyayn",
      "Ahmad Beirami"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.07911",
    "title": "On the Tradeoff between Energy, Precision, and Accuracy in Federated  Quantized Neural Networks",
    "abstract": " Comments: This paper is submitted to IEEE International Conference on Communications 2022 ",
    "url": "https://arxiv.org/abs/2111.07911",
    "authors": [
      "Minsu Kim",
      "Walid Saad",
      "Mohammad Mozaffari",
      "Merouane Debbah"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2111.09076",
    "title": "To Trust or Not To Trust Prediction Scores for Membership Inference  Attacks",
    "abstract": " Comments: 15 pages, 8 figures, 10 tables ",
    "url": "https://arxiv.org/abs/2111.09076",
    "authors": [
      "Dominik Hintersdorf",
      "Lukas Struppek",
      "Kristian Kersting"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.05567",
    "title": "An Annotation-based Approach for Finding Bugs in Neural Network Programs",
    "abstract": " Comments: New content: (1) discussing test oracles in the related work section, (2) adding future work, and (3) discussing the possibility of using other back-ends ",
    "url": "https://arxiv.org/abs/2112.05567",
    "authors": [
      "Mohammad Rezaalipour",
      "Carlo A. Furia"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2201.11620",
    "title": "Domain generalization in deep learning-based mass detection in  mammography: A large-scale multi-center study",
    "abstract": " Title: Domain generalization in deep learning-based mass detection in  mammography: A large-scale multi-center study ",
    "url": "https://arxiv.org/abs/2201.11620",
    "authors": [
      "Lidia Garrucho",
      "Kaisar Kushibar",
      "Socayna Jouide",
      "Oliver Diaz",
      "Laura Igual",
      "Karim Lekadir"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.06174",
    "title": "Source-Free Progressive Graph Learning for Open-Set Domain Adaptation",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2006.12087 ",
    "url": "https://arxiv.org/abs/2202.06174",
    "authors": [
      "Yadan Luo",
      "Zijian Wang",
      "Zhuoxiao Chen",
      "Zi Huang",
      "Mahsa Baktashmotlagh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.07993",
    "title": "Planckian Jitter: countering the color-crippling effects of color jitter  on self-supervised training",
    "abstract": " Comments: Accepted at Eleventh International Conference on Learning Representations (ICLR 2023) ",
    "url": "https://arxiv.org/abs/2202.07993",
    "authors": [
      "Simone Zini",
      "Alex Gomez-Villa",
      "Marco Buzzelli",
      "Bartłomiej Twardowski",
      "Andrew D. Bagdanov",
      "Joost van de Weijer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.15651",
    "title": "Gaze-based Object Detection in the Wild",
    "abstract": " Title: Gaze-based Object Detection in the Wild ",
    "url": "https://arxiv.org/abs/2203.15651",
    "authors": [
      "Daniel Weber",
      "Wolfgang Fuhl",
      "Andreas Zell",
      "Enkelejda Kasneci"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.01234",
    "title": "Incorporating functional summary information in Bayesian neural networks  using a Dirichlet process likelihood approach",
    "abstract": " Comments: Accepted in AISTATS 2023 ",
    "url": "https://arxiv.org/abs/2207.01234",
    "authors": [
      "Vishnu Raj",
      "Tianyu Cui",
      "Markus Heinonen",
      "Pekka Marttinen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.08988",
    "title": "The 8-Point Algorithm as an Inductive Bias for Relative Pose Prediction  by ViTs",
    "abstract": " Comments: Accepted to 3DV 2022; Project Page: this https URL Revision: Fixed Epipolar Lines in Figure 3, Figure 10 ",
    "url": "https://arxiv.org/abs/2208.08988",
    "authors": [
      "Chris Rockwell",
      "Justin Johnson",
      "David F. Fouhey"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.10531",
    "title": "RAIN: RegulArization on Input and Network for Black-Box Domain  Adaptation",
    "abstract": " Title: RAIN: RegulArization on Input and Network for Black-Box Domain  Adaptation ",
    "url": "https://arxiv.org/abs/2208.10531",
    "authors": [
      "Qucheng Peng",
      "Zhengming Ding",
      "Lingjuan Lyu",
      "Lichao Sun",
      "Chen Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.11300",
    "title": "E-NeRF: Neural Radiance Fields from a Moving Event Camera",
    "abstract": " Comments: revised RAL version + added suppl. material ",
    "url": "https://arxiv.org/abs/2208.11300",
    "authors": [
      "Simon Klenk",
      "Lukas Koestler",
      "Davide Scaramuzza",
      "Daniel Cremers"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2208.12268",
    "title": "FedPrompt: Communication-Efficient and Privacy Preserving Prompt Tuning  in Federated Learning",
    "abstract": " Title: FedPrompt: Communication-Efficient and Privacy Preserving Prompt Tuning  in Federated Learning ",
    "url": "https://arxiv.org/abs/2208.12268",
    "authors": [
      "Haodong Zhao",
      "Wei Du",
      "Fangqi Li",
      "Peixuan Li",
      "Gongshen Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.09809",
    "title": "High-resolution synthesis of high-density breast mammograms: Application  to improved fairness in deep learning based mass detection",
    "abstract": " Comments: 9 figures, 4 tables ",
    "url": "https://arxiv.org/abs/2209.09809",
    "authors": [
      "Lidia Garrucho",
      "Kaisar Kushibar",
      "Richard Osuala",
      "Oliver Diaz",
      "Alessandro Catanese",
      "Javier del Riego",
      "Maciej Bobowicz",
      "Fredrik Strand",
      "Laura Igual",
      "Karim Lekadir"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.01078",
    "title": "Unsupervised Model Selection for Time-series Anomaly Detection",
    "abstract": " Comments: Accepted at International Conference on Learning Representations (ICLR) 2023 with a notable-top-25% recommendation. Reviewer, AC and author discussion available at this https URL ",
    "url": "https://arxiv.org/abs/2210.01078",
    "authors": [
      "Mononito Goswami",
      "Cristian Challu",
      "Laurent Callot",
      "Lenon Minorics",
      "Andrey Kan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.01953",
    "title": "Robust Fair Clustering: A Novel Fairness Attack and Defense Framework",
    "abstract": " Comments: Accepted to the 11th International Conference on Learning Representations (ICLR 2023) ",
    "url": "https://arxiv.org/abs/2210.01953",
    "authors": [
      "Anshuman Chhabra",
      "Peizhao Li",
      "Prasant Mohapatra",
      "Hongfu Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2210.05051",
    "title": "Spreading Processes with Mutations over Multi-layer Networks",
    "abstract": " Title: Spreading Processes with Mutations over Multi-layer Networks ",
    "url": "https://arxiv.org/abs/2210.05051",
    "authors": [
      "Mansi Sood",
      "Anirudh Sridhar",
      "Rashad Eletreby",
      "Chai Wah Wu",
      "Simon A. Levin",
      "H. Vincent Poor",
      "Osman Yagan"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2210.09224",
    "title": "Self-Supervised Learning Through Efference Copies",
    "abstract": " Comments: Accepted at NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2210.09224",
    "authors": [
      "Franz Scherr",
      "Qinghai Guo",
      "Timoleon Moraitis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2210.10460",
    "title": "Antifragile Control Systems: The case of an oscillator-based network  model of urban road traffic dynamics",
    "abstract": " Title: Antifragile Control Systems: The case of an oscillator-based network  model of urban road traffic dynamics ",
    "url": "https://arxiv.org/abs/2210.10460",
    "authors": [
      "Cristian Axenie",
      "Margherita Grossi"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2210.14891",
    "title": "Broken Neural Scaling Laws",
    "abstract": " Title: Broken Neural Scaling Laws ",
    "url": "https://arxiv.org/abs/2210.14891",
    "authors": [
      "Ethan Caballero",
      "Kshitij Gupta",
      "Irina Rish",
      "David Krueger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.14977",
    "title": "Knowledge Transfer For On-Device Speech Emotion Recognition with Neural  Structured Learning",
    "abstract": " Comments: Submitted to ICASSP 2023; revised according to reviews ",
    "url": "https://arxiv.org/abs/2210.14977",
    "authors": [
      "Yi Chang",
      "Zhao Ren",
      "Thanh Tam Nguyen",
      "Kun Qian",
      "Björn W. Schuller"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2211.02239",
    "title": "Towards Asteroid Detection in Microlensing Surveys with Deep Learning",
    "abstract": " Comments: 15 pages, 17 figures, to be published in Astronomy and Computing ",
    "url": "https://arxiv.org/abs/2211.02239",
    "authors": [
      "Preeti Cowan",
      "Ian A. Bond",
      "Napoleon H. Reyes"
    ],
    "subjectives": [
      "Earth and Planetary Astrophysics (astro-ph.EP)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.05637",
    "title": "Description Graphs, Matrix-Power Stabilizations and Graph Isomorphism in  Polynomial Time",
    "abstract": " Comments: In this version, some related references are added. An explicit proof to Theorem 9 is sketched in the appendix. The proofs in Section 7-10 to our main results are rewritten with WL process for consistency ",
    "url": "https://arxiv.org/abs/2211.05637",
    "authors": [
      "Rui Xue"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2211.08327",
    "title": "Weighted Sum-Rate Maximization With Causal Inference for Latent  Interference Estimation",
    "abstract": " Comments: 7 pages ",
    "url": "https://arxiv.org/abs/2211.08327",
    "authors": [
      "Lei You"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2211.10908",
    "title": "ESTAS: Effective and Stable Trojan Attacks in Self-supervised Encoders  with One Target Unlabelled Sample",
    "abstract": " Comments: 10 pages, 7 figures, 6 tables ",
    "url": "https://arxiv.org/abs/2211.10908",
    "authors": [
      "Jiaqi Xue",
      "Qian Lou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.08479",
    "title": "Neural Implicit k-Space for Binning-free Non-Cartesian Cardiac MR  Imaging",
    "abstract": " Title: Neural Implicit k-Space for Binning-free Non-Cartesian Cardiac MR  Imaging ",
    "url": "https://arxiv.org/abs/2212.08479",
    "authors": [
      "Wenqi Huang",
      "Hongwei Li",
      "Jiazhen Pan",
      "Gastao Cruz",
      "Daniel Rueckert",
      "Kerstin Hammernik"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2212.10699",
    "title": "PaletteNeRF: Palette-based Appearance Editing of Neural Radiance Fields",
    "abstract": " Title: PaletteNeRF: Palette-based Appearance Editing of Neural Radiance Fields ",
    "url": "https://arxiv.org/abs/2212.10699",
    "authors": [
      "Zhengfei Kuang",
      "Fujun Luan",
      "Sai Bi",
      "Zhixin Shu",
      "Gordon Wetzstein",
      "Kalyan Sunkavalli"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2301.02819",
    "title": "ExcelFormer: A Neural Network Surpassing GBDTs on Tabular Data",
    "abstract": " Title: ExcelFormer: A Neural Network Surpassing GBDTs on Tabular Data ",
    "url": "https://arxiv.org/abs/2301.02819",
    "authors": [
      "Jintai Chen",
      "Jiahuan Yan",
      "Danny Ziyi Chen",
      "Jian Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08893",
    "title": "Spatial Attention Kinetic Networks with E(n)-Equivariance",
    "abstract": " Title: Spatial Attention Kinetic Networks with E(n)-Equivariance ",
    "url": "https://arxiv.org/abs/2301.08893",
    "authors": [
      "Yuanqing Wang",
      "John D. Chodera"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Applied Physics (physics.app-ph)"
    ]
  },
  {
    "id": "arXiv:2301.09213",
    "title": "FRAME: Fast and Robust Autonomous 3D point cloud Map-merging for  Egocentric multi-robot exploration",
    "abstract": " Comments: to be published ",
    "url": "https://arxiv.org/abs/2301.09213",
    "authors": [
      "Nikolaos Stathoulopoulos",
      "Anton Koval",
      "Ali-akbar Agha-mohammadi",
      "George Nikolakopoulos"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09524",
    "title": "RF+clust for Leave-One-Problem-Out Performance Prediction",
    "abstract": " Comments: To appear at EvoApps 2023 ",
    "url": "https://arxiv.org/abs/2301.09524",
    "authors": [
      "Ana Nikolikj",
      "Carola Doerr",
      "Tome Eftimov"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  }
]