[
  {
    "id": "arXiv:2209.02700",
    "title": "Language-aware Domain Generalization Network for Cross-Scene  Hyperspectral Image Classification",
    "abstract": "Text information including extensive prior knowledge about land cover classes has been ignored in hyperspectral image classification (HSI) tasks. It is necessary to explore the effectiveness of linguistic mode in assisting HSI classification. In addition, the large-scale pre-training image-text foundation models have demonstrated great performance in a variety of downstream applications, including zero-shot transfer. However, most domain generalization methods have never addressed mining linguistic modal knowledge to improve the generalization performance of model. To compensate for the inadequacies listed above, a Language-aware Domain Generalization Network (LDGnet) is proposed to learn cross-domain invariant representation from cross-domain shared prior knowledge. The proposed method only trains on the source domain (SD) and then transfers the model to the target domain (TD). The dual-stream architecture including image encoder and text encoder is used to extract visual and linguistic features, in which coarse-grained and fine-grained text representations are designed to extract two levels of linguistic features. Furthermore, linguistic features are used as cross-domain shared semantic space, and visual-linguistic alignment is completed by supervised contrastive learning in semantic space. Extensive experiments on three datasets demonstrate the superiority of the proposed method when compared with state-of-the-art techniques. ",
    "url": "https://arxiv.org/abs/2209.02700",
    "authors": [
      "Yuxiang Zhang",
      "Mengmeng Zhang",
      "Wei Li",
      "Shuai Wang",
      "Ran Tao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.02702",
    "title": "An IoT-Enriched Event Log for Process Mining in Smart Factories",
    "abstract": "Modern technologies such as the Internet of Things (IoT) are becoming increasingly important in various domains, including Business Process Management (BPM) research. One main research area in BPM is process mining, which can be used to analyze event logs, e.g., for checking the conformance of running processes. However, there are only a few IoT-based event logs available for research purposes. Some of them are artificially generated and the problem occurs that they do not always completely reflect the actual physical properties of smart environments. In this paper, we present an IoT-enriched XES event log that is generated by a physical smart factory. For this purpose, we create the SensorStream XES extension for representing IoT-data in event logs. Finally, we present some preliminary analysis and properties of the log. ",
    "url": "https://arxiv.org/abs/2209.02702",
    "authors": [
      "Lukas Malburg",
      "Joscha Grüger",
      "Ralph Bergmann"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2209.02749",
    "title": "Scalable Regularization of Scene Graph Generation Models using Symbolic  Theories",
    "abstract": "Several techniques have recently aimed to improve the performance of deep learning models for Scene Graph Generation (SGG) by incorporating background knowledge. State-of-the-art techniques can be divided into two families: one where the background knowledge is incorporated into the model in a subsymbolic fashion, and another in which the background knowledge is maintained in symbolic form. Despite promising results, both families of techniques face several shortcomings: the first one requires ad-hoc, more complex neural architectures increasing the training or inference cost; the second one suffers from limited scalability w.r.t. the size of the background knowledge. Our work introduces a regularization technique for injecting symbolic background knowledge into neural SGG models that overcomes the limitations of prior art. Our technique is model-agnostic, does not incur any cost at inference time, and scales to previously unmanageable background knowledge sizes. We demonstrate that our technique can improve the accuracy of state-of-the-art SGG models, by up to 33%. ",
    "url": "https://arxiv.org/abs/2209.02749",
    "authors": [
      "Davide Buffelli",
      "Efthymia Tsamoura"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.02764",
    "title": "Change Detection for Local Explainability in Evolving Data Streams",
    "abstract": "As complex machine learning models are increasingly used in sensitive applications like banking, trading or credit scoring, there is a growing demand for reliable explanation mechanisms. Local feature attribution methods have become a popular technique for post-hoc and model-agnostic explanations. However, attribution methods typically assume a stationary environment in which the predictive model has been trained and remains stable. As a result, it is often unclear how local attributions behave in realistic, constantly evolving settings such as streaming and online applications. In this paper, we discuss the impact of temporal change on local feature attributions. In particular, we show that local attributions can become obsolete each time the predictive model is updated or concept drift alters the data generating distribution. Consequently, local feature attributions in data streams provide high explanatory power only when combined with a mechanism that allows us to detect and respond to local changes over time. To this end, we present CDLEEDS, a flexible and model-agnostic framework for detecting local change and concept drift. CDLEEDS serves as an intuitive extension of attribution-based explanation techniques to identify outdated local attributions and enable more targeted recalculations. In experiments, we also show that the proposed framework can reliably detect both local and global concept drift. Accordingly, our work contributes to a more meaningful and robust explainability in online machine learning. ",
    "url": "https://arxiv.org/abs/2209.02764",
    "authors": [
      "Johannes Haug",
      "Alexander Braun",
      "Stefan Zürn",
      "Gjergji Kasneci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.02765",
    "title": "Depression Symptoms Modelling from Social Media Text: An Active Learning  Approach",
    "abstract": "A fundamental component of user-level social media language based clinical depression modelling is depression symptoms detection (DSD). Unfortunately, there does not exist any DSD dataset that reflects both the clinical insights and the distribution of depression symptoms from the samples of self-disclosed depressed population. In our work, we describe an Active Learning (AL) framework which uses an initial supervised learning model that leverages 1) a state-of-the-art large mental health forum text pre-trained language model further fine-tuned on a clinician annotated DSD dataset, 2) a Zero-Shot learning model for DSD, and couples them together to harvest depression symptoms related samples from our large self-curated Depression Tweets Repository (DTR). Our clinician annotated dataset is the largest of its kind. Furthermore, DTR is created from the samples of tweets in self-disclosed depressed users Twitter timeline from two datasets, including one of the largest benchmark datasets for user-level depression detection from Twitter. This further helps preserve the depression symptoms distribution of self-disclosed Twitter users tweets. Subsequently, we iteratively retrain our initial DSD model with the harvested data. We discuss the stopping criteria and limitations of this AL process, and elaborate the underlying constructs which play a vital role in the overall AL process. We show that we can produce a final dataset which is the largest of its kind. Furthermore, a DSD and a Depression Post Detection (DPD) model trained on it achieves significantly better accuracy than their initial version. ",
    "url": "https://arxiv.org/abs/2209.02765",
    "authors": [
      "Nawshad Farruque",
      "Randy Goebel",
      "Sudhakar Sivapalan",
      "Osmar Zaiane"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.02792",
    "title": "Side-channel attack analysis on in-memory computing architectures",
    "abstract": "In-memory computing (IMC) systems have great potential for accelerating data-intensive tasks such as deep neural networks (DNNs). As DNN models are generally highly proprietary, the neural network architectures become valuable targets for attacks. In IMC systems, since the whole model is mapped on chip and weight memory read can be restricted, the system acts as a \"black box\" for customers. However, the localized and stationary weight and data patterns may subject IMC systems to other attacks. In this paper, we propose a side-channel attack methodology on IMC architectures. We show that it is possible to extract model architectural information from power trace measurements without any prior knowledge of the neural network. We first developed a simulation framework that can emulate the dynamic power traces of the IMC macros. We then performed side-channel attacks to extract information such as the stored layer type, layer sequence, output channel/feature size and convolution kernel size from power traces of the IMC macros. Based on the extracted information, full networks can potentially be reconstructed without any knowledge of the neural network. Finally, we discuss potential countermeasures for building IMC systems that offer resistance to these model extraction attack. ",
    "url": "https://arxiv.org/abs/2209.02792",
    "authors": [
      "Ziyu Wang",
      "Fan-hsuan Meng",
      "Yongmo Park",
      "Jason K. Eshraghian",
      "Wei D. Lu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2209.02797",
    "title": "Fusion of Satellite Images and Weather Data with Transformer Networks  for Downy Mildew Disease Detection",
    "abstract": "Crop diseases significantly affect the quantity and quality of agricultural production. In a context where the goal of precision agriculture is to minimize or even avoid the use of pesticides, weather and remote sensing data with deep learning can play a pivotal role in detecting crop diseases, allowing localized treatment of crops. However, combining heterogeneous data such as weather and images remains a hot topic and challenging task. Recent developments in transformer architectures have shown the possibility of fusion of data from different domains, for instance text-image. The current trend is to custom only one transformer to create a multimodal fusion model. Conversely, we propose a new approach to realize data fusion using three transformers. In this paper, we first solved the missing satellite images problem, by interpolating them with a ConvLSTM model. Then, proposed a multimodal fusion architecture that jointly learns to process visual and weather information. The architecture is built from three main components, a Vision Transformer and two transformer-encoders, allowing to fuse both image and weather modalities. The results of the proposed method are promising achieving 97\\% overall accuracy. ",
    "url": "https://arxiv.org/abs/2209.02797",
    "authors": [
      "William Maillet",
      "Maryam Ouhami",
      "Adel Hafiane"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.02809",
    "title": "Localizing Load-Altering Attacks Against Power Grids Using Deep Capsule  Nets",
    "abstract": "Recent research has shown that the security of power grids can be seriously threatened by botnet-type cyber attacks that target a large number of high-wattage smart electrical appliances owned by end-users. Accurate detection and localization of such attacks is of critical importance in limiting the damage. To this end, the paper proposes a novel technique using capsule networks (CNs) tailored to the power grid security application that uses the frequency and phase angle data monitored by phasor measurement units (PMUs). With the benefit of vector output from capsules and dynamic routing agreements between them, CNs can obtain accurate detection and localization performance. To demonstrate the efficiency of the suggested technique, we compare the developed CN with benchmark data-driven methodologies, including two-dimensional convolutional neural networks (2D-CNN), one-dimensional CNN (1D-CNN), deep multi-layer perceptrons (MLP), and support vector machines (SVM). Simulations are performed on IEEE 14-, 39-, and 57-bus systems, considering various real-world issues such as PMU delays, noisy data, and missing data points. The results show that CNs significantly outperform other techniques, thus making them suitable for the aforementioned cyber security applications. ",
    "url": "https://arxiv.org/abs/2209.02809",
    "authors": [
      "Hamidreza Jahangir",
      "Subhash Lakshminarayana",
      "Carsten Maple"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2209.02812",
    "title": "Increasing Adverse Drug Events extraction robustness on social media:  case study on negation and speculation",
    "abstract": "In the last decade, an increasing number of users have started reporting Adverse Drug Events (ADE) on social media platforms, blogs, and health forums. Given the large volume of reports, pharmacovigilance has focused on ways to use Natural Language Processing (NLP) techniques to rapidly examine these large collections of text, detecting mentions of drug-related adverse reactions to trigger medical investigations. However, despite the growing interest in the task and the advances in NLP, the robustness of these models in face of linguistic phenomena such as negations and speculations is an open research question. Negations and speculations are pervasive phenomena in natural language, and can severely hamper the ability of an automated system to discriminate between factual and nonfactual statements in text. In this paper we take into consideration four state-of-the-art systems for ADE detection on social media texts. We introduce SNAX, a benchmark to test their performance against samples containing negated and speculated ADEs, showing their fragility against these phenomena. We then introduce two possible strategies to increase the robustness of these models, showing that both of them bring significant increases in performance, lowering the number of spurious entities predicted by the models by 60% for negation and 80% for speculations. ",
    "url": "https://arxiv.org/abs/2209.02812",
    "authors": [
      "Simone Scaboro",
      "Beatrice Portelli",
      "Emmanuele Chersoni",
      "Enrico Santus",
      "Giuseppe Serra"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.02824",
    "title": "CP-AGCN: Pytorch-based Attention Informed Graph Convolutional Network  for Identifying Infants at Risk of Cerebral Palsy",
    "abstract": "Early prediction is clinically considered one of the essential parts of cerebral palsy (CP) treatment. We propose to implement a low-cost and interpretable classification system for supporting CP prediction based on General Movement Assessment (GMA). We design a Pytorch-based attention-informed graph convolutional network to early identify infants at risk of CP from skeletal data extracted from RGB videos. We also design a frequency-binning module for learning the CP movements in the frequency domain while filtering noise. Our system only requires consumer-grade RGB videos for training to support interactive-time CP prediction by providing an interpretable CP classification result. ",
    "url": "https://arxiv.org/abs/2209.02824",
    "authors": [
      "Haozheng Zhang",
      "Edmond S. L. Ho",
      "Hubert P. H. Shum"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2209.02832",
    "title": "Impact of Colour Variation on Robustness of Deep Neural Networks",
    "abstract": "Deep neural networks (DNNs) have have shown state-of-the-art performance for computer vision applications like image classification, segmentation and object detection. Whereas recent advances have shown their vulnerability to manual digital perturbations in the input data, namely adversarial attacks. The accuracy of the networks is significantly affected by the data distribution of their training dataset. Distortions or perturbations on color space of input images generates out-of-distribution data, which make networks more likely to misclassify them. In this work, we propose a color-variation dataset by distorting their RGB color on a subset of the ImageNet with 27 different combinations. The aim of our work is to study the impact of color variation on the performance of DNNs. We perform experiments on several state-of-the-art DNN architectures on the proposed dataset, and the result shows a significant correlation between color variation and loss of accuracy. Furthermore, based on the ResNet50 architecture, we demonstrate some experiments of the performance of recently proposed robust training techniques and strategies, such as Augmix, revisit, and free normalizer, on our proposed dataset. Experimental results indicate that these robust training techniques can improve the robustness of deep networks to color variation. ",
    "url": "https://arxiv.org/abs/2209.02832",
    "authors": [
      "Chengyin Hu",
      "Weiwen Shi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2209.02835",
    "title": "Security and Privacy of IP-ICN Coexistence: A Comprehensive Survey",
    "abstract": "Internet usage has changed from its first design. Hence, the current Internet must cope with some limitations, including performance degradation, availability of IP addresses, and multiple security and privacy issues. Nevertheless, to unsettle the current Internet's network layer i.e., Internet Protocol with ICN is a challenging, expensive task. It also requires worldwide coordination among Internet Service Providers , backbone, and Autonomous Services. Additionally, history showed that technology changes e.g., from 3G to 4G, from IPv4 to IPv6 are not immediate, and usually, the replacement includes a long coexistence period between the old and new technology. Similarly, we believe that the process of replacement of the current Internet will surely transition through the coexistence of IP and ICN. Although the tremendous amount of security and privacy issues of the current Internet taught us the importance of securely designing the architectures, only a few of the proposed architectures place the security-by-design. Therefore, this article aims to provide the first comprehensive Security and Privacy analysis of the state-of-the-art coexistence architectures. Additionally, it yields a horizontal comparison of security and privacy among three deployment approaches of IP and ICN protocol i.e., overlay, underlay, and hybrid and a vertical comparison among ten considered security and privacy features. As a result of our analysis, emerges that most of the architectures utterly fail to provide several SP features including data and traffic flow confidentiality, availability and communication anonymity. We believe this article draws a picture of the secure combination of current and future protocol stacks during the coexistence phase that the Internet will definitely walk across. ",
    "url": "https://arxiv.org/abs/2209.02835",
    "authors": [
      "Enkeleda Bardhi",
      "Mauro Conti",
      "Riccardo Lazzeretti",
      "Eleonora Losiouk"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2209.02840",
    "title": "A Fourth-Order Embedded Boundary Finite Volume Method for the Unsteady  Stokes Equations with Complex Geometries",
    "abstract": "A fourth-order finite volume embedded boundary (EB) method is presented for the unsteady Stokes equations. The algorithm represents complex geometries on a Cartesian grid using EB, employing a technique to mitigate the \"small cut-cell\" problem without mesh modifications, cell merging, or state redistribution. Spatial discretizations are based on a weighted least-squares technique that has been extended to fourth-order operators and boundary conditions, including an approximate projection to enforce the divergence-free constraint. Solutions are advanced in time using a fourth-order additive implicit-explicit Runge-Kutta method, with the viscous and source terms treated implicitly and explicitly, respectively. Formal accuracy of the method is demonstrated with several grid convergence studies, and results are shown for an application with a complex bio-inspired material. The developed method achieves fourth-order accuracy and is stable despite the pervasive small cells arising from complex geometries. ",
    "url": "https://arxiv.org/abs/2209.02840",
    "authors": [
      "Nathaniel Overton-Katz",
      "Xinfeng Gao",
      "Stephen Guzik",
      "Oscar Antepara",
      "Daniel T. Graves",
      "Hans Johansen"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2209.02850",
    "title": "Inversion of Time-Lapse Surface Gravity Data for Detection of 3D CO$_2$  Plumes via Deep Learning",
    "abstract": "We introduce three algorithms that invert simulated gravity data to 3D subsurface rock/flow properties. The first algorithm is a data-driven, deep learning-based approach, the second mixes a deep learning approach with physical modeling into a single workflow, and the third considers the time dependence of surface gravity monitoring. The target application of these proposed algorithms is the prediction of subsurface CO$_2$ plumes as a complementary tool for monitoring CO$_2$ sequestration deployments. Each proposed algorithm outperforms traditional inversion methods and produces high-resolution, 3D subsurface reconstructions in near real-time. Our proposed methods achieve Dice scores of up to 0.8 for predicted plume geometry and near perfect data misfit in terms of $\\mu$Gals. These results indicate that combining 4D surface gravity monitoring with deep learning techniques represents a low-cost, rapid, and non-intrusive method for monitoring CO$_2$ storage sites. ",
    "url": "https://arxiv.org/abs/2209.02850",
    "authors": [
      "Adrian Celaya",
      "Bertrand Denel",
      "Yen Sun",
      "Mauricio Araya-Polo",
      "Antony Price"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Geophysics (physics.geo-ph)"
    ]
  },
  {
    "id": "arXiv:2209.02851",
    "title": "Code Code Evolution: Understanding How People Change Data Science  Notebooks Over Time",
    "abstract": "Sensemaking is the iterative process of identifying, extracting, and explaining insights from data, where each iteration is referred to as the \"sensemaking loop.\" Although recent work observes snapshots of the sensemaking loop within computational notebooks, none measure shifts in sensemaking behaviors over time -- between exploration and explanation. This gap limits our ability to understand the full scope of the sensemaking process and thus our ability to design tools to fully support sensemaking. We contribute the first quantitative method to characterize how sensemaking evolves within data science computational notebooks. To this end, we conducted a quantitative study of 2,574 Jupyter notebooks mined from GitHub. First, we identify data science-focused notebooks that have undergone significant iterations. Second, we present regression models that automatically characterize sensemaking activity within individual notebooks by assigning them a score representing their position within the sensemaking spectrum. Finally, we use our regression models to calculate and analyze shifts in notebook scores across GitHub versions. Our results show that notebook authors participate in a diverse range of sensemaking tasks over time, such as annotation, branching analysis, and documentation. Finally, we propose design recommendations for extending notebook environments to support the sensemaking behaviors we observed. ",
    "url": "https://arxiv.org/abs/2209.02851",
    "authors": [
      "Deepthi Raghunandan",
      "Aayushi Roy",
      "Shenzhi Shi",
      "Niklas Elmqvist",
      "Leilani Battle"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Mathematical Software (cs.MS)"
    ]
  },
  {
    "id": "arXiv:2209.02865",
    "title": "DC-MRTA: Decentralized Multi-Robot Task Allocation and Navigation in  Complex Environments",
    "abstract": "We present a novel reinforcement learning (RL) based task allocation and decentralized navigation algorithm for mobile robots in warehouse environments. Our approach is designed for scenarios in which multiple robots are used to perform various pick up and delivery tasks. We consider the problem of joint decentralized task allocation and navigation and present a two level approach to solve it. At the higher level, we solve the task allocation by formulating it in terms of Markov Decision Processes and choosing the appropriate rewards to minimize the Total Travel Delay (TTD). At the lower level, we use a decentralized navigation scheme based on ORCA that enables each robot to perform these tasks in an independent manner, and avoid collisions with other robots and dynamic obstacles. We combine these lower and upper levels by defining rewards for the higher level as the feedback from the lower level navigation algorithm. We perform extensive evaluation in complex warehouse layouts with large number of agents and highlight the benefits over state-of-the-art algorithms based on myopic pickup distance minimization and regret-based task selection. We observe improvement up to 14% in terms of task completion time and up-to 40% improvement in terms of computing collision-free trajectories for the robots. ",
    "url": "https://arxiv.org/abs/2209.02865",
    "authors": [
      "Aakriti Agrawal",
      "Senthil Hariharan",
      "Amrit Singh Bedi",
      "Dinesh Manocha"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2209.02869",
    "title": "Interpretations Steered Network Pruning via Amortized Inferred Saliency  Maps",
    "abstract": "Convolutional Neural Networks (CNNs) compression is crucial to deploying these models in edge devices with limited resources. Existing channel pruning algorithms for CNNs have achieved plenty of success on complex models. They approach the pruning problem from various perspectives and use different metrics to guide the pruning process. However, these metrics mainly focus on the model's `outputs' or `weights' and neglect its `interpretations' information. To fill in this gap, we propose to address the channel pruning problem from a novel perspective by leveraging the interpretations of a model to steer the pruning process, thereby utilizing information from both inputs and outputs of the model. However, existing interpretation methods cannot get deployed to achieve our goal as either they are inefficient for pruning or may predict non-coherent explanations. We tackle this challenge by introducing a selector model that predicts real-time smooth saliency masks for pruned models. We parameterize the distribution of explanatory masks by Radial Basis Function (RBF)-like functions to incorporate geometric prior of natural images in our selector model's inductive bias. Thus, we can obtain compact representations of explanations to reduce the computational costs of our pruning method. We leverage our selector model to steer the network pruning by maximizing the similarity of explanatory representations for the pruned and original models. Extensive experiments on CIFAR-10 and ImageNet benchmark datasets demonstrate the efficacy of our proposed method. Our implementations are available at \\url{https://github.com/Alii-Ganjj/InterpretationsSteeredPruning} ",
    "url": "https://arxiv.org/abs/2209.02869",
    "authors": [
      "Alireza Ganjdanesh",
      "Shangqian Gao",
      "Heng Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.02876",
    "title": "Self-supervised multimodal neuroimaging yields predictive  representations for a spectrum of Alzheimer's phenotypes",
    "abstract": "Recent neuroimaging studies that focus on predicting brain disorders via modern machine learning approaches commonly include a single modality and rely on supervised over-parameterized models.However, a single modality provides only a limited view of the highly complex brain. Critically, supervised models in clinical settings lack accurate diagnostic labels for training. Coarse labels do not capture the long-tailed spectrum of brain disorder phenotypes, which leads to a loss of generalizability of the model that makes them less useful in diagnostic settings. This work presents a novel multi-scale coordinated framework for learning multiple representations from multimodal neuroimaging data. We propose a general taxonomy of informative inductive biases to capture unique and joint information in multimodal self-supervised fusion. The taxonomy forms a family of decoder-free models with reduced computational complexity and a propensity to capture multi-scale relationships between local and global representations of the multimodal inputs. We conduct a comprehensive evaluation of the taxonomy using functional and structural magnetic resonance imaging (MRI) data across a spectrum of Alzheimer's disease phenotypes and show that self-supervised models reveal disorder-relevant brain regions and multimodal links without access to the labels during pre-training. The proposed multimodal self-supervised learning yields representations with improved classification performance for both modalities. The concomitant rich and flexible unsupervised deep learning framework captures complex multimodal relationships and provides predictive performance that meets or exceeds that of a more narrow supervised classification analysis. We present elaborate quantitative evidence of how this framework can significantly advance our search for missing links in complex brain disorders. ",
    "url": "https://arxiv.org/abs/2209.02876",
    "authors": [
      "Alex Fedorov",
      "Eloy Geenjaar",
      "Lei Wu",
      "Tristan Sylvain",
      "Thomas P. DeRamus",
      "Margaux Luck",
      "Maria Misiura",
      "R Devon Hjelm",
      "Sergey M. Plis",
      "Vince D. Calhoun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2209.02877",
    "title": "SUNet: Scale-aware Unified Network for Panoptic Segmentation",
    "abstract": "Panoptic segmentation combines the advantages of semantic and instance segmentation, which can provide both pixel-level and instance-level environmental perception information for intelligent vehicles. However, it is challenged with segmenting objects of various scales, especially on extremely large and small ones. In this work, we propose two lightweight modules to mitigate this problem. First, Pixel-relation Block is designed to model global context information for large-scale things, which is based on a query-independent formulation and brings small parameter increments. Then, Convectional Network is constructed to collect extra high-resolution information for small-scale stuff, supplying more appropriate semantic features for the downstream segmentation branches. Based on these two modules, we present an end-to-end Scale-aware Unified Network (SUNet), which is more adaptable to multi-scale objects. Extensive experiments on Cityscapes and COCO demonstrate the effectiveness of the proposed methods. ",
    "url": "https://arxiv.org/abs/2209.02877",
    "authors": [
      "Weihao Yan",
      "Yeqiang Qian",
      "Chunxiang Wang",
      "Ming Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.02884",
    "title": "Multi-Grained Angle Representation for Remote Sensing Object Detection",
    "abstract": "Arbitrary-oriented object detection (AOOD) plays a significant role for image understanding in remote sensing scenarios. The existing AOOD methods face the challenges of ambiguity and high costs in angle representation. To this end, a multi-grained angle representation (MGAR) method, consisting of coarse-grained angle classification (CAC) and fine-grained angle regression (FAR), is proposed. Specifically, the designed CAC avoids the ambiguity of angle prediction by discrete angular encoding (DAE) and reduces complexity by coarsening the granularity of DAE. Based on CAC, FAR is developed to refine the angle prediction with much lower costs than narrowing the granularity of DAE. Furthermore, an Intersection over Union (IoU) aware FAR-Loss (IFL) is designed to improve accuracy of angle prediction using an adaptive re-weighting mechanism guided by IoU. Extensive experiments are performed on several public remote sensing datasets, which demonstrate the effectiveness of the proposed MGAR. Moreover, experiments on embedded devices demonstrate that the proposed MGAR is also friendly for lightweight deployments. ",
    "url": "https://arxiv.org/abs/2209.02884",
    "authors": [
      "Hao Wang",
      "Zhanchao Huang",
      "Zhengchao Chen",
      "Ying Song",
      "Wei Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.02899",
    "title": "Context Recovery and Knowledge Retrieval: A Novel Two-Stream Framework  for Video Anomaly Detection",
    "abstract": "Video anomaly detection aims to find the events in a video that do not conform to the expected behavior. The prevalent methods mainly detect anomalies by snippet reconstruction or future frame prediction error. However, the error is highly dependent on the local context of the current snippet and lacks the understanding of normality. To address this issue, we propose to detect anomalous events not only by the local context, but also according to the consistency between the testing event and the knowledge about normality from the training data. Concretely, we propose a novel two-stream framework based on context recovery and knowledge retrieval, where the two streams can complement each other. For the context recovery stream, we propose a spatiotemporal U-Net which can fully utilize the motion information to predict the future frame. Furthermore, we propose a maximum local error mechanism to alleviate the problem of large recovery errors caused by complex foreground objects. For the knowledge retrieval stream, we propose an improved learnable locality-sensitive hashing, which optimizes hash functions via a Siamese network and a mutual difference loss. The knowledge about normality is encoded and stored in hash tables, and the distance between the testing event and the knowledge representation is used to reveal the probability of anomaly. Finally, we fuse the anomaly scores from the two streams to detect anomalies. Extensive experiments demonstrate the effectiveness and complementarity of the two streams, whereby the proposed two-stream framework achieves state-of-the-art performance on four datasets. ",
    "url": "https://arxiv.org/abs/2209.02899",
    "authors": [
      "Congqi Cao",
      "Yue Lu",
      "Yanning Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.02902",
    "title": "Defending Against Backdoor Attack on Graph Nerual Network by  Explainability",
    "abstract": "Backdoor attack is a powerful attack algorithm to deep learning model. Recently, GNN's vulnerability to backdoor attack has been proved especially on graph classification task. In this paper, we propose the first backdoor detection and defense method on GNN. Most backdoor attack depends on injecting small but influential trigger to the clean sample. For graph data, current backdoor attack focus on manipulating the graph structure to inject the trigger. We find that there are apparent differences between benign samples and malicious samples in some explanatory evaluation metrics, such as fidelity and infidelity. After identifying the malicious sample, the explainability of the GNN model can help us capture the most significant subgraph which is probably the trigger in a trojan graph. We use various dataset and different attack settings to prove the effectiveness of our defense method. The attack success rate all turns out to decrease considerably. ",
    "url": "https://arxiv.org/abs/2209.02902",
    "authors": [
      "Bingchen Jiang",
      "Zhao Li"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.02908",
    "title": "PERFECT: A Hyperbolic Embedding for Joint User and Community Alignment",
    "abstract": "Social network alignment shows fundamental importance in a wide spectrum of applications. To the best of our knowledge, existing studies mainly focus on network alignment at the individual user level, requiring abundant common information between shared individual users. For the networks that cannot meet such requirements, social community structures actually provide complementary and critical information at a slightly coarse-grained level, alignment of which will provide additional information for user alignment. In turn, user alignment also reveals more clues for community alignment. Hence, in this paper, we introduce the problem of joint social network alignment, which aims to align users and communities across social networks simultaneously. Key challenges lie in that 1) how to learn the representations of both users and communities, and 2) how to make user alignment and community alignment benefit from each other. To address these challenges, we first elaborate on the characteristics of real-world networks with the notion of delta-hyperbolicity, and show the superiority of hyperbolic space for representing social networks. Then, we present a novel hyperbolic embedding approach for the joint social network alignment, referred to as PERFECT, in a unified optimization. Extensive experiments on real-world datasets show the superiority of PERFECT in both user alignment and community alignment. ",
    "url": "https://arxiv.org/abs/2209.02908",
    "authors": [
      "Li Sun",
      "Zhongbao Zhang",
      "Jiawei Zhang",
      "Feiyang Wang",
      "Yang Du",
      "Sen Su",
      "Philip S. Yu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.02911",
    "title": "Social Media Engagement and Cryptocurrency Performance",
    "abstract": "We study the problem of predicting the future performance of cryptocurrencies using social media data. We propose a new model to measure the engagement of users with topics discussed on social media based on interactions with social media posts. This model overcomes the limitations of previous volume and sentiment based approaches. We use this model to estimate engagement coefficients for 48 cryptocurrencies created between 2019 and 2021 using data from Twitter from the first month of the cryptocurrencies' existence. We find that the future returns of the cryptocurrencies are dependent on the engagement coefficients. Cryptocurrencies whose engagement coefficients are too low or too high have lower returns. Low engagement coefficients signal a lack of interest, while high engagement coefficients signal artificial activity which is likely from automated accounts known as bots. We measure the amount of bot posts for the cryptocurrencies and find that generally, cryptocurrencies with more bot posts have lower future returns. While future returns are dependent on both the bot activity and engagement coefficient, the dependence is strongest for the engagement coefficient, especially for short-term returns. We show that simple investment strategies which select cryptocurrencies with engagement coefficients exceeding a fixed threshold perform well for holding times of a few months. ",
    "url": "https://arxiv.org/abs/2209.02911",
    "authors": [
      "Khizar Qureshi",
      "Tauhid Zaman"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2209.02912",
    "title": "Optimal Sensor Placement in Body Surface Networks using Gaussian  Processes",
    "abstract": "This paper explores a new sequential selection framework for the optimal sensor placement (OSP) in Electrocardiography imaging networks (ECGI). The proposed methodology incorporates the use a recent experimental design method for the sequential selection of landmarkings on biological objects, namely, Gaussian process landmarking (GPLMK) for better exploration of the candidate sensors. The two experimental design methods work as a source of the training and the validation locations which is fitted using a spatiotemporal Gaussian process (STGP). The STGP is fitted using the training set to predict for the current validation set generated using GPLMK, and the sensor with the largest prediction absolute error is selected from the current validation set and added to the selected sensors. Next, a new validation set is generated and predicted using the current training set. The process continues until selecting a specific number of sensor locations. The study is conducted on a dataset of body surface potential mapping (BSPM) of 352 electrodes of four human subjects. A number of 30 sensor locations is selected using the proposed algorithm. The selected sensor locations achieved average $R^2 = 94.40 \\%$ for estimating the whole-body QRS segment. The proposed method adds to design efforts for a more clinically practical ECGI system by improving its wearability and reduce the design cost as well. ",
    "url": "https://arxiv.org/abs/2209.02912",
    "authors": [
      "Emad Alenany",
      "Changqing Cheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2209.02916",
    "title": "Hardware Acceleration of Sampling Algorithms in Sample and Aggregate  Graph Neural Networks",
    "abstract": "Sampling is an important process in many GNN structures in order to train larger datasets with a smaller computational complexity. However, compared to other processes in GNN (such as aggregate, backward propagation), the sampling process still costs tremendous time, which limits the speed of training. To reduce the time of sampling, hardware acceleration is an ideal choice. However, state of the art GNN acceleration proposal did not specify how to accelerate the sampling process. What's more, directly accelerating traditional sampling algorithms will make the structure of the accelerator very complicated. In this work, we made two contributions: (1) Proposed a new neighbor sampler: CONCAT Sampler, which can be easily accelerated on hardware level while guaranteeing the test accuracy. (2) Designed a CONCAT-sampler-accelerator based on FPGA, with which the neighbor sampling process boosted to about 300-1000 times faster compared to the sampling process without it. ",
    "url": "https://arxiv.org/abs/2209.02916",
    "authors": [
      "Yuchen Gui",
      "Boyi Wei",
      "Wei Yuan",
      "Xi Jin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2209.02939",
    "title": "Grouping-matrix based Graph Pooling with Adaptive Number of Clusters",
    "abstract": "Graph pooling is a crucial operation for encoding hierarchical structures within graphs. Most existing graph pooling approaches formulate the problem as a node clustering task which effectively captures the graph topology. Conventional methods ask users to specify an appropriate number of clusters as a hyperparameter, then assume that all input graphs share the same number of clusters. In inductive settings where the number of clusters can vary, however, the model should be able to represent this variation in its pooling layers in order to learn suitable clusters. Thus we propose GMPool, a novel differentiable graph pooling architecture that automatically determines the appropriate number of clusters based on the input data. The main intuition involves a grouping matrix defined as a quadratic form of the pooling operator, which induces use of binary classification probabilities of pairwise combinations of nodes. GMPool obtains the pooling operator by first computing the grouping matrix, then decomposing it. Extensive evaluations on molecular property prediction tasks demonstrate that our method outperforms conventional methods. ",
    "url": "https://arxiv.org/abs/2209.02939",
    "authors": [
      "Sung Moon Ko",
      "Sungjun Cho",
      "Dae-Woong Jeong",
      "Sehui Han",
      "Moontae Lee",
      "Honglak Lee"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.02948",
    "title": "Assessing Software Privacy using the Privacy Flow-Graph",
    "abstract": "We increasingly rely on digital services and the conveniences they provide. Processing of personal data is integral to such services and thus privacy and data protection are a growing concern, and governments have responded with regulations such as the EU's GDPR. Following this, organisations that make software have legal obligations to document the privacy and data protection of their software. This work must involve both software developers that understand the code and the organisation's data protection officer or legal department that understands privacy and the requirements of a Data Protection and Impact Assessment (DPIA). To help developers and non-technical people such as lawyers document the privacy and data protection behaviour of software, we have developed an automatic software analysis technique. This technique is based on static program analysis to characterise the flow of privacy-related data. The results of the analysis can be presented as a graph of privacy flows and operations -- that is understandable also for non-technical people. We argue that our technique facilitates collaboration between technical and non-technical people in documenting the privacy behaviour of the software. We explain how to use the results produced by our technique to answer a series of privacy-relevant questions needed for a DPIA. To illustrate our work, we show both detailed and abstract analysis results from applying our analysis technique to the secure messaging service Signal and to the client of the cloud service NextCloud and show how their privacy flow-graphs inform the writing of a DPIA. ",
    "url": "https://arxiv.org/abs/2209.02948",
    "authors": [
      "Feiyang Tang",
      "Bjarte M. Østvold"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2209.02952",
    "title": "BiFuse++: Self-supervised and Efficient Bi-projection Fusion for 360  Depth Estimation",
    "abstract": "Due to the rise of spherical cameras, monocular 360 depth estimation becomes an important technique for many applications (e.g., autonomous systems). Thus, state-of-the-art frameworks for monocular 360 depth estimation such as bi-projection fusion in BiFuse are proposed. To train such a framework, a large number of panoramas along with the corresponding depth ground truths captured by laser sensors are required, which highly increases the cost of data collection. Moreover, since such a data collection procedure is time-consuming, the scalability of extending these methods to different scenes becomes a challenge. To this end, self-training a network for monocular depth estimation from 360 videos is one way to alleviate this issue. However, there are no existing frameworks that incorporate bi-projection fusion into the self-training scheme, which highly limits the self-supervised performance since bi-projection fusion can leverage information from different projection types. In this paper, we propose BiFuse++ to explore the combination of bi-projection fusion and the self-training scenario. To be specific, we propose a new fusion module and Contrast-Aware Photometric Loss to improve the performance of BiFuse and increase the stability of self-training on real-world videos. We conduct both supervised and self-supervised experiments on benchmark datasets and achieve state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2209.02952",
    "authors": [
      "Fu-En Wang",
      "Yu-Hsuan Yeh",
      "Yi-Hsuan Tsai",
      "Wei-Chen Chiu",
      "Min Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.02957",
    "title": "A Weakly Supervised Learning Framework for Salient Object Detection via  Hybrid Labels",
    "abstract": "Fully-supervised salient object detection (SOD) methods have made great progress, but such methods often rely on a large number of pixel-level annotations, which are time-consuming and labour-intensive. In this paper, we focus on a new weakly-supervised SOD task under hybrid labels, where the supervision labels include a large number of coarse labels generated by the traditional unsupervised method and a small number of real labels. To address the issues of label noise and quantity imbalance in this task, we design a new pipeline framework with three sophisticated training strategies. In terms of model framework, we decouple the task into label refinement sub-task and salient object detection sub-task, which cooperate with each other and train alternately. Specifically, the R-Net is designed as a two-stream encoder-decoder model equipped with Blender with Guidance and Aggregation Mechanisms (BGA), aiming to rectify the coarse labels for more reliable pseudo-labels, while the S-Net is a replaceable SOD network supervised by the pseudo labels generated by the current R-Net. Note that, we only need to use the trained S-Net for testing. Moreover, in order to guarantee the effectiveness and efficiency of network training, we design three training strategies, including alternate iteration mechanism, group-wise incremental mechanism, and credibility verification mechanism. Experiments on five SOD benchmarks show that our method achieves competitive performance against weakly-supervised/unsupervised methods both qualitatively and quantitatively. ",
    "url": "https://arxiv.org/abs/2209.02957",
    "authors": [
      "Runmin Cong",
      "Qi Qin",
      "Chen Zhang",
      "Qiuping Jiang",
      "Shiqi Wang",
      "Yao Zhao",
      "Sam Kwong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.02962",
    "title": "Adam Mickiewicz University at WMT 2022: NER-Assisted and Quality-Aware  Neural Machine Translation",
    "abstract": "This paper presents Adam Mickiewicz University's (AMU) submissions to the constrained track of the WMT 2022 General MT Task. We participated in the Ukrainian $\\leftrightarrow$ Czech translation directions. The systems are a weighted ensemble of four models based on the Transformer (big) architecture. The models use source factors to utilize the information about named entities present in the input. Each of the models in the ensemble was trained using only the data provided by the shared task organizers. A noisy back-translation technique was used to augment the training corpora. One of the models in the ensemble is a document-level model, trained on parallel and synthetic longer sequences. During the sentence-level decoding process, the ensemble generated the n-best list. The n-best list was merged with the n-best list generated by a single document-level model which translated multiple sentences at a time. Finally, existing quality estimation models and minimum Bayes risk decoding were used to rerank the n-best list so that the best hypothesis was chosen according to the COMET evaluation metric. According to the automatic evaluation results, our systems rank first in both translation directions. ",
    "url": "https://arxiv.org/abs/2209.02962",
    "authors": [
      "Artur Nowakowski",
      "Gabriela Pałka",
      "Kamil Guttmann",
      "Mikołaj Pokrywka"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.02971",
    "title": "Non-Standard Vietnamese Word Detection and Normalization for  Text-to-Speech",
    "abstract": "Converting written texts into their spoken forms is an essential problem in any text-to-speech (TTS) systems. However, building an effective text normalization solution for a real-world TTS system face two main challenges: (1) the semantic ambiguity of non-standard words (NSWs), e.g., numbers, dates, ranges, scores, abbreviations, and (2) transforming NSWs into pronounceable syllables, such as URL, email address, hashtag, and contact name. In this paper, we propose a new two-phase normalization approach to deal with these challenges. First, a model-based tagger is designed to detect NSWs. Then, depending on NSW types, a rule-based normalizer expands those NSWs into their final verbal forms. We conducted three empirical experiments for NSW detection using Conditional Random Fields (CRFs), BiLSTM-CNN-CRF, and BERT-BiGRU-CRF models on a manually annotated dataset including 5819 sentences extracted from Vietnamese news articles. In the second phase, we propose a forward lexicon-based maximum matching algorithm to split down the hashtag, email, URL, and contact name. The experimental results of the tagging phase show that the average F1 scores of the BiLSTM-CNN-CRF and CRF models are above 90.00%, reaching the highest F1 of 95.00% with the BERT-BiGRU-CRF model. Overall, our approach has low sentence error rates, at 8.15% with CRF and 7.11% with BiLSTM-CNN-CRF taggers, and only 6.67% with BERT-BiGRU-CRF tagger. ",
    "url": "https://arxiv.org/abs/2209.02971",
    "authors": [
      "Huu-Tien Dang",
      "Thi-Hai-Yen Vuong",
      "Xuan-Hieu Phan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.02973",
    "title": "Foundations of probability-raising causality in Markov decision  processes",
    "abstract": "This work introduces a novel cause-effect relation in Markov decision processes using the probability-raising principle. Initially, sets of states as causes and effects are considered, which is subsequently extended to regular path properties as effects and then as causes. The paper lays the mathematical foundations and analyzes the algorithmic properties of these cause-effect relations. This includes algorithms for checking cause conditions given an effect and deciding the existence of probability-raising causes. As the definition allows for sub-optimal coverage properties, quality measures for causes inspired by concepts of statistical analysis are studied. These include recall, coverage ratio and f-score. The computational complexity for finding optimal causes with respect to these measures is analyzed. ",
    "url": "https://arxiv.org/abs/2209.02973",
    "authors": [
      "Christel Baier",
      "Jakob Piribauer",
      "Robin Ziemek"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2209.02976",
    "title": "YOLOv6: A Single-Stage Object Detection Framework for Industrial  Applications",
    "abstract": "For years, the YOLO series has been the de facto industry-level standard for efficient object detection. The YOLO community has prospered overwhelmingly to enrich its use in a multitude of hardware platforms and abundant scenarios. In this technical report, we strive to push its limits to the next level, stepping forward with an unwavering mindset for industry application. Considering the diverse requirements for speed and accuracy in the real environment, we extensively examine the up-to-date object detection advancements either from industry or academia. Specifically, we heavily assimilate ideas from recent network design, training strategies, testing techniques, quantization, and optimization methods. On top of this, we integrate our thoughts and practice to build a suite of deployment-ready networks at various scales to accommodate diversified use cases. With the generous permission of YOLO authors, we name it YOLOv6. We also express our warm welcome to users and contributors for further enhancement. For a glimpse of performance, our YOLOv6-N hits 35.9% AP on the COCO dataset at a throughput of 1234 FPS on an NVIDIA Tesla T4 GPU. YOLOv6-S strikes 43.5% AP at 495 FPS, outperforming other mainstream detectors at the same scale~(YOLOv5-S, YOLOX-S, and PPYOLOE-S). Our quantized version of YOLOv6-S even brings a new state-of-the-art 43.3% AP at 869 FPS. Furthermore, YOLOv6-M/L also achieves better accuracy performance (i.e., 49.5%/52.3%) than other detectors with a similar inference speed. We carefully conducted experiments to validate the effectiveness of each component. Our code is made available at https://github.com/meituan/YOLOv6. ",
    "url": "https://arxiv.org/abs/2209.02976",
    "authors": [
      "Chuyi Li",
      "Lulu Li",
      "Hongliang Jiang",
      "Kaiheng Weng",
      "Yifei Geng",
      "Liang Li",
      "Zaidan Ke",
      "Qingyuan Li",
      "Meng Cheng",
      "Weiqiang Nie",
      "Yiduo Li",
      "Bo Zhang",
      "Yufei Liang",
      "Linyuan Zhou",
      "Xiaoming Xu",
      "Xiangxiang Chu",
      "Xiaoming Wei",
      "Xiaolin Wei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.02977",
    "title": "Error Estimates and Physics Informed Augmentation of Neural Networks for  Thermally Coupled Incompressible Navier Stokes Equations",
    "abstract": "Physics Informed Neural Networks (PINNs) are shown to be a promising method for the approximation of Partial Differential Equations (PDEs). PINNs approximate the PDE solution by minimizing physics-based loss functions over a given domain. Despite substantial progress in the application of PINNs to a range of problem classes, investigation of error estimation and convergence properties of PINNs, which is important for establishing the rationale behind their good empirical performance, has been lacking. This paper presents convergence analysis and error estimates of PINNs for a multi-physics problem of thermally coupled incompressible Navier-Stokes equations. Through a model problem of Beltrami flow it is shown that a small training error implies a small generalization error. \\textit{Posteriori} convergence rates of total error with respect to the training residual and collocation points are presented. This is of practical significance in determining appropriate number of training parameters and training residual thresholds to get good PINNs prediction of thermally coupled steady state laminar flows. These convergence rates are then generalized to different spatial geometries as well as to different flow parameters that lie in the laminar regime. A pressure stabilization term in the form of pressure Poisson equation is added to the PDE residuals for PINNs. This physics informed augmentation is shown to improve accuracy of the pressure field by an order of magnitude as compared to the case without augmentation. Results from PINNs are compared to the ones obtained from stabilized finite element method and good properties of PINNs are highlighted. ",
    "url": "https://arxiv.org/abs/2209.02977",
    "authors": [
      "Shoaib Goraya",
      "Nahil Sobh",
      "Arif Masud"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2209.02981",
    "title": "VGStore: A Multimodal Extension to SPARQL for Querying RDF Scene Graph",
    "abstract": "Semantic Web technology has successfully facilitated many RDF models with rich data representation methods. It also has the potential ability to represent and store multimodal knowledge bases such as multimodal scene graphs. However, most existing query languages, especially SPARQL, barely explore the implicit multimodal relationships like semantic similarity, spatial relations, etc. We first explored this issue by organizing a large-scale scene graph dataset, namely Visual Genome, in the RDF graph database. Based on the proposed RDF-stored multimodal scene graph, we extended SPARQL queries to answer questions containing relational reasoning about color, spatial, etc. Further demo (i.e., VGStore) shows the effectiveness of customized queries and displaying multimodal data. ",
    "url": "https://arxiv.org/abs/2209.02981",
    "authors": [
      "Yanzeng Li",
      "Zilong Zheng",
      "Wenjuan Han",
      "Lei Zou"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.02994",
    "title": "Robust Numerical Methods for Singularly Perturbed Differential  Equations--Supplements",
    "abstract": "The second edition of the book \"Roos, Stynes, Tobiska -- Robust Numerical Methods for Singularly Perturbed Differential Equations\" appeared many years ago and was for many years a reliable guide into the world of numerical methods for singularly perturbed problems. Since then many new results came into the game, we present some selected ones and the related sources. ",
    "url": "https://arxiv.org/abs/2209.02994",
    "authors": [
      "Hans-Görg Roos"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2209.02997",
    "title": "On the Transferability of Adversarial Examples between Encrypted Models",
    "abstract": "Deep neural networks (DNNs) are well known to be vulnerable to adversarial examples (AEs). In addition, AEs have adversarial transferability, namely, AEs generated for a source model fool other (target) models. In this paper, we investigate the transferability of models encrypted for adversarially robust defense for the first time. To objectively verify the property of transferability, the robustness of models is evaluated by using a benchmark attack method, called AutoAttack. In an image-classification experiment, the use of encrypted models is confirmed not only to be robust against AEs but to also reduce the influence of AEs in terms of the transferability of models. ",
    "url": "https://arxiv.org/abs/2209.02997",
    "authors": [
      "Miki Tanaka",
      "Isao Echizen",
      "Hitoshi Kiya"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.03013",
    "title": "Quantitative probing: Validating causal models using quantitative domain  knowledge",
    "abstract": "We present quantitative probing as a model-agnostic framework for validating causal models in the presence of quantitative domain knowledge. The method is constructed as an analogue of the train/test split in correlation-based machine learning and as an enhancement of current causal validation strategies that are consistent with the logic of scientific discovery. The effectiveness of the method is illustrated using Pearl's sprinkler example, before a thorough simulation-based investigation is conducted. Limits of the technique are identified by studying exemplary failing scenarios, which are furthermore used to propose a list of topics for future research and improvements of the presented version of quantitative probing. The code for integrating quantitative probing into causal analysis, as well as the code for the presented simulation-based studies of the effectiveness of quantitative probing is provided in two separate open-source Python packages. ",
    "url": "https://arxiv.org/abs/2209.03013",
    "authors": [
      "Daniel Grünbaum",
      "Maike L. Stern",
      "Elmar W. Lang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2209.03034",
    "title": "Not All Instances Contribute Equally: Instance-adaptive Class  Representation Learning for Few-Shot Visual Recognition",
    "abstract": "Few-shot visual recognition refers to recognize novel visual concepts from a few labeled instances. Many few-shot visual recognition methods adopt the metric-based meta-learning paradigm by comparing the query representation with class representations to predict the category of query instance. However, current metric-based methods generally treat all instances equally and consequently often obtain biased class representation, considering not all instances are equally significant when summarizing the instance-level representations for the class-level representation. For example, some instances may contain unrepresentative information, such as too much background and information of unrelated concepts, which skew the results. To address the above issues, we propose a novel metric-based meta-learning framework termed instance-adaptive class representation learning network (ICRL-Net) for few-shot visual recognition. Specifically, we develop an adaptive instance revaluing network with the capability to address the biased representation issue when generating the class representation, by learning and assigning adaptive weights for different instances according to their relative significance in the support set of corresponding class. Additionally, we design an improved bilinear instance representation and incorporate two novel structural losses, i.e., intra-class instance clustering loss and inter-class representation distinguishing loss, to further regulate the instance revaluation process and refine the class representation. We conduct extensive experiments on four commonly adopted few-shot benchmarks: miniImageNet, tieredImageNet, CIFAR-FS, and FC100 datasets. The experimental results compared with the state-of-the-art approaches demonstrate the superiority of our ICRL-Net. ",
    "url": "https://arxiv.org/abs/2209.03034",
    "authors": [
      "Mengya Han",
      "Yibing Zhan",
      "Yong Luo",
      "Bo Du",
      "Han Hu",
      "Yonggang Wen",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.03050",
    "title": "Cerberus: Exploring Federated Prediction of Security Events",
    "abstract": "Modern defenses against cyberattacks increasingly rely on proactive approaches, e.g., to predict the adversary's next actions based on past events. Building accurate prediction models requires knowledge from many organizations; alas, this entails disclosing sensitive information, such as network structures, security postures, and policies, which might often be undesirable or outright impossible. In this paper, we explore the feasibility of using Federated Learning (FL) to predict future security events. To this end, we introduce Cerberus, a system enabling collaborative training of Recurrent Neural Network (RNN) models for participating organizations. The intuition is that FL could potentially offer a middle-ground between the non-private approach where the training data is pooled at a central server and the low-utility alternative of only training local models. We instantiate Cerberus on a dataset obtained from a major security company's intrusion prevention product and evaluate it vis-a-vis utility, robustness, and privacy, as well as how participants contribute to and benefit from the system. Overall, our work sheds light on both the positive aspects and the challenges of using FL for this task and paves the way for deploying federated approaches to predictive security. ",
    "url": "https://arxiv.org/abs/2209.03050",
    "authors": [
      "Mohammad Naseri",
      "Yufei Han",
      "Enrico Mariconti",
      "Yun Shen",
      "Gianluca Stringhini",
      "Emiliano De Cristofaro"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.03056",
    "title": "Parallel and Streaming Wavelet Neural Networks for Classification and  Regression under Apache Spark",
    "abstract": "Wavelet neural networks (WNN) have been applied in many fields to solve regression as well as classification problems. After the advent of big data, as data gets generated at a brisk pace, it is imperative to analyze it as soon as it is generated owing to the fact that the nature of the data may change dramatically in short time intervals. This is necessitated by the fact that big data is all pervasive and throws computational challenges for data scientists. Therefore, in this paper, we built an efficient Scalable, Parallelized Wavelet Neural Network (SPWNN) which employs the parallel stochastic gradient algorithm (SGD) algorithm. SPWNN is designed and developed under both static and streaming environments in the horizontal parallelization framework. SPWNN is implemented by using Morlet and Gaussian functions as activation functions. This study is conducted on big datasets like gas sensor data which has more than 4 million samples and medical research data which has more than 10,000 features, which are high dimensional in nature. The experimental analysis indicates that in the static environment, SPWNN with Morlet activation function outperformed SPWNN with Gaussian on the classification datasets. However, in the case of regression, the opposite was observed. In contrast, in the streaming environment i.e., Gaussian outperformed Morlet on the classification and Morlet outperformed Gaussian on the regression datasets. Overall, the proposed SPWNN architecture achieved a speedup of 1.32-1.40. ",
    "url": "https://arxiv.org/abs/2209.03056",
    "authors": [
      "Eduru Harindra Venkatesh",
      "Yelleti Vivek",
      "Vadlamani Ravi",
      "Orsu Shiva Shankar"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2209.03070",
    "title": "Legal Detection of AI Products Based on Formal Argumentation and Legal  Ontology",
    "abstract": "Ontology is a popular method for knowledge representation in different domains, including the legal domain, and description logics (DL) is commonly used as its description language. To handle reasoning based on inconsistent DL-based legal ontologies, the current paper presents a structured argumentation framework particularly for reasoning in legal contexts on the basis of ASPIC+, and translates the legal ontology into formulas and rules of an argumentation theory. With a particular focus on the design of autonomous vehicles from the perspective of legal AI, we show that using this combined theory of formal argumentation and DL-based legal ontology, acceptable assertions can be obtained based on inconsistent ontologies, and the traditional reasoning tasks of DL ontologies can also be accomplished. In addition, a formal definition of explanations for the result of reasoning is presented. ",
    "url": "https://arxiv.org/abs/2209.03070",
    "authors": [
      "Zhe Yu",
      "Yiwei Lu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.03097",
    "title": "Obtaining Robust Control and Navigation Policies for Multi-Robot  Navigation via Deep Reinforcement Learning",
    "abstract": "Multi-robot navigation is a challenging task in which multiple robots must be coordinated simultaneously within dynamic environments. We apply deep reinforcement learning (DRL) to learn a decentralized end-to-end policy which maps raw sensor data to the command velocities of the agent. In order to enable the policy to generalize, the training is performed in different environments and scenarios. The learned policy is tested and evaluated in common multi-robot scenarios like switching a place, an intersection and a bottleneck situation. This policy allows the agent to recover from dead ends and to navigate through complex environments. ",
    "url": "https://arxiv.org/abs/2209.03097",
    "authors": [
      "Christian Jestel",
      "Hartmut Surmann",
      "Jonas Stenzel",
      "Oliver Urbann",
      "Marius Brehler"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.03099",
    "title": "Passive and Privacy-preserving Human Localization via mmWave Access  Points for Social Distancing",
    "abstract": "The pandemic outbreak has profoundly changed our life, especially our social habits and communication behaviors. While this dramatic shock has heavily impacted human interaction rules, novel localization techniques are emerging to help society in complying with new policies, such as social distancing. Wireless sensing and machine learning are well suited to alleviate viruses propagation in a privacy-preserving manner. However, its wide deployment requires cost-effective installation and operational solutions. In public environments, individual localization information-such as social distancing-needs to be monitored to avoid safety threats when not properly observed. To this end, the high penetration of wireless devices can be exploited to continuously analyze-and-learn the propagation environment, thereby passively detecting breaches and triggering alerts if required. In this paper, we describe a novel passive and privacy-preserving human localization solution that relies on the directive transmission properties of mmWave communications to monitor social distancing and notify people in the area in case of violations. Thus, addressing the social distancing challenge in a privacy-preserving and cost-efficient manner. Our solution provides an overall accuracy of about 99% in the tested scenarios. ",
    "url": "https://arxiv.org/abs/2209.03099",
    "authors": [
      "Francesco Devoti",
      "Vincenzo Sciancalepore",
      "Xavier Costa-Perez"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2209.03102",
    "title": "MSMDFusion: Fusing LiDAR and Camera at Multiple Scales with Multi-Depth  Seeds for 3D Object Detection",
    "abstract": "Fusing LiDAR and camera information is essential for achieving accurate and reliable 3D object detection in autonomous driving systems. However, this is challenging due to the difficulty of combining multi-granularity geometric and semantic features from two drastically different modalities. Recent approaches aim at exploring the semantic densities of camera features through lifting points in 2D camera images (referred to as seeds) into 3D space for fusion, and they can be roughly divided into 1) early fusion of raw points that aims at augmenting the 3D point cloud at the early input stage, and 2) late fusion of BEV (bird-eye view) maps that merges LiDAR and camera BEV features before the detection head. While both have their merits in enhancing the representation power of the combined features, this single-level fusion strategy is a suboptimal solution to the aforementioned challenge. Their major drawbacks are the inability to interact the multi-granularity semantic features from two distinct modalities sufficiently. To this end, we propose a novel framework that focuses on the multi-scale progressive interaction of the multi-granularity LiDAR and camera features. Our proposed method, abbreviated as MDMSFusion, achieves state-of-the-art results in 3D object detection, with 69.1 mAP and 71.8 NDS on nuScenes validation set, and 70.8 mAP and 73.2 NDS on nuScenes test set, which rank 1st and 2nd respectively among single-model non-ensemble approaches by the time of submission. ",
    "url": "https://arxiv.org/abs/2209.03102",
    "authors": [
      "Yang Jiao",
      "Zequn Jie",
      "Shaoxiang Chen",
      "Jingjing Chen",
      "Xiaolin Wei",
      "Lin Ma",
      "Yu-Gang Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.03132",
    "title": "MSSPN: Automatic First Arrival Picking using Multi-Stage Segmentation  Picking Network",
    "abstract": "Picking the first arrival times of prestack gathers is called First Arrival Time (FAT) picking, which is an indispensable step in seismic data processing, and is mainly solved manually in the past. With the current increasing density of seismic data collection, the efficiency of manual picking has been unable to meet the actual needs. Therefore, automatic picking methods have been greatly developed in recent decades, especially those based on deep learning. However, few of the current supervised deep learning-based method can avoid the dependence on labeled samples. Besides, since the gather data is a set of signals which are greatly different from the natural images, it is difficult for the current method to solve the FAT picking problem in case of a low Signal to Noise Ratio (SNR). In this paper, for hard rock seismic gather data, we propose a Multi-Stage Segmentation Pickup Network (MSSPN), which solves the generalization problem across worksites and the picking problem in the case of low SNR. In MSSPN, there are four sub-models to simulate the manually picking processing, which is assumed to four stages from coarse to fine. Experiments on seven field datasets with different qualities show that our MSSPN outperforms benchmarks by a large margin.Particularly, our method can achieve more than 90\\% accurate picking across worksites in the case of medium and high SNRs, and even fine-tuned model can achieve 88\\% accurate picking of the dataset with low SNR. ",
    "url": "https://arxiv.org/abs/2209.03132",
    "authors": [
      "Hongtao Wang",
      "Jiangshe Zhang",
      "Xiaoli Wei",
      "Chunxia Zhang",
      "Zhenbo Guo",
      "Li Long",
      "Yicheng Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2209.03144",
    "title": "A New Heterogeneous Graph Representation in a Social Media Platform:  Steemit",
    "abstract": "Recently, temporal graphs have substituted dynamic graphs as many real-world problems evolve in continuous time rather than in discrete time, and besides time almost all problems are designed in a heterogeneous format rather than a homogeneous one. However, most existing graph representations do not consider time in their components. To this end, in this paper, we present a new heterogeneous graph representation including time in every single component of the graph, i.e., nodes and edges. We also introduce four time-dependent queries to address machine learning or deep learning problems. Our findings reveal that considering the size of the enormous graphs, our time-dependent queries execute efficiently. In order to show the expressive power of time in graph representation, we construct a graph for a new social media platform (Steemit), and address a DL prediction task using graph neural networks (GNNs). Predicting the payout for a newly published post is one of the most fascinating classification problems in the Steemit setting, and we address this problem with two approaches followed by GNN models. ",
    "url": "https://arxiv.org/abs/2209.03144",
    "authors": [
      "Negar Maleki",
      "Balaji Padamanabhan",
      "Kaushik Dutta"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.03147",
    "title": "Network Intrusion Detection with Limited Labeled Data",
    "abstract": "With the increasing dependency of daily life over computer networks, the importance of these networks security becomes prominent. Different intrusion attacks to networks have been designed and the attackers are working on improving them. Thus the ability to detect intrusion with limited number of labeled data is desirable to provide networks with higher level of security. In this paper we design an intrusion detection system based on a deep neural network. The proposed system is based on self-supervised contrastive learning where a huge amount of unlabeled data can be used to generate informative representation suitable for various downstream tasks with limited number of labeled data. Using different experiments, we have shown that the proposed system presents an accuracy of 94.05% over the UNSW-NB15 dataset, an improvement of 4.22% in comparison to previous method based on self-supervised learning. Our simulations have also shown impressive results when the size of labeled training data is limited. The performance of the resulting Encoder Block trained on UNSW-NB15 dataset has also been tested on other datasets for representation extraction which shows competitive results in downstream tasks. ",
    "url": "https://arxiv.org/abs/2209.03147",
    "authors": [
      "S. Lotfi",
      "M. Modirrousta",
      "S. Shashaani",
      "S. Amini",
      "M. Aliyari Shoorehdeli"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.03148",
    "title": "Improving Out-of-Distribution Detection via Epistemic Uncertainty  Adversarial Training",
    "abstract": "The quantification of uncertainty is important for the adoption of machine learning, especially to reject out-of-distribution (OOD) data back to human experts for review. Yet progress has been slow, as a balance must be struck between computational efficiency and the quality of uncertainty estimates. For this reason many use deep ensembles of neural networks or Monte Carlo dropout for reasonable uncertainty estimates at relatively minimal compute and memory. Surprisingly, when we focus on the real-world applicable constraint of $\\leq 1\\%$ false positive rate (FPR), prior methods fail to reliably detect OOD samples as such. Notably, even Gaussian random noise fails to trigger these popular OOD techniques. We help to alleviate this problem by devising a simple adversarial training scheme that incorporates an attack of the epistemic uncertainty predicted by the dropout ensemble. We demonstrate this method improves OOD detection performance on standard data (i.e., not adversarially crafted), and improves the standardized partial AUC from near-random guessing performance to $\\geq 0.75$. ",
    "url": "https://arxiv.org/abs/2209.03148",
    "authors": [
      "Derek Everett",
      "Andre T. Nguyen",
      "Luke E. Richards",
      "Edward Raff"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.03149",
    "title": "MultiViz: A Gephi Plugin for Scalable Visualization of Multi-Layer  Networks",
    "abstract": "The process of visually presenting networks is an effective way to understand entity relationships within the networks since it reveals the overall structure and topology of the network. Real networks are extremely difficult to visualize due to their immense complexity, which includes vast amounts of data, several types of interactions, various subsystems and several levels of connectivity as well as changes over time. This paper introduces the \"MultiViz Plugin,\" a plugin for gephi, an open-source software tool for graph visualization and modification, in order to to visualize complex networks in a multi-layer manner. A collection of settings are availabe through the plugin to transform an existing network into a multi-layered network. The plugin supports several layout algorithms and lets user to choose which property of the network to be used as the layer. The goal of the study is to give the user complete control over how the network is visualized in a multi-layer fashion. We demonstrate the ability of the plugin to visualize multi-layer data using a real-life complex multi-layer datasets. ",
    "url": "https://arxiv.org/abs/2209.03149",
    "authors": [
      "Jayamohan Pillai C.S.",
      "Ayan Chatterjee",
      "Geetha M.",
      "Amitava Mukherjee"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.03150",
    "title": "Remote Work Optimization with Robust Multi-channel Graph Neural Networks",
    "abstract": "The spread of COVID-19 leads to the global shutdown of many corporate offices, and encourages companies to open more opportunities that allow employees to work from a remote location. As the workplace type expands from onsite offices to remote areas, an emerging challenge for an online hiring marketplace is how these remote opportunities and user intentions to work remotely can be modeled and matched without prior information. Despite the unprecedented amount of remote jobs posted amid COVID-19, there is no existing approach that can be directly applied. Introducing a brand new workplace type naturally leads to the cold-start problem, which is particularly more common for less active job seekers. It is challenging, if not impossible, to onboard a new workplace type for any predictive model if existing information sources can provide little information related to a new category of jobs, including data from resumes and job descriptions. Hence, in this work, we aim to propose a principled approach that jointly models the remoteness of job seekers and job opportunities with limited information, which also suffices the needs of web-scale applications. Existing research on the emerging type of remote workplace mainly focuses on qualitative studies, and classic predictive modeling approaches are inapplicable considering the problem of cold-start and information scarcity. We precisely try to close this gap with a novel graph neural architecture. Extensive experiments on large-scale data from real-world applications have been conducted to validate the superiority of the proposed approach over competitive baselines. The improvement may translate to more rapid onboarding of the new workplace type that can benefit job seekers who are interested in working remotely. ",
    "url": "https://arxiv.org/abs/2209.03150",
    "authors": [
      "Qinyi Zhu",
      "Liang Wu",
      "Qi Guo",
      "Liangjie Hong"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.03151",
    "title": "MRF-PINN: A Multi-Receptive-Field convolutional physics-informed neural  network for solving partial differential equations",
    "abstract": "Physics-informed neural networks (PINN) can achieve lower development and solving cost than traditional partial differential equation (PDE) solvers in scenarios such as reconstructing the physics field and solving the inverse problem. Due to the advantages of parameter sharing, spatial feature extraction and low inference cost, convolutional neural networks (CNN) are increasingly used in PINN. To adapt convolutional PINN to different equations, researchers have to spend much time tuning critical hyperparameters. Furthermore, the effects of finite difference accuracy, model complexity, and mesh resolution on the prediction result of convolutional PINN are unclear. To fill the above research gaps, in this paper, (1) A Multi-Receptive-Field PINN (MRF-PINN) model is constructed to adapt different equation types and mesh resolutions without manual tuning.(2) The generality and advantages of the MRF-PINN are verified in three typical linear PDEs (elliptic, parabolic, hyperbolic) and nonlinear PDEs (Navier-Stokes equations). (3) The contribution of each receptive field to the final MRF-PINN result is analyzed, and the influence of finite difference accuracy, model complexity (channel number) and mesh resolution on the MRF-PINN result is tested. This paper shows that MRF-PINN can adapt to completely different equation types and mesh resolutions without any hyperparameter tuning. Further, the solving error is significantly decreased under high-order finite difference, large channel number, and high mesh resolution, which is expected to become a general convolutional PINN scheme. ",
    "url": "https://arxiv.org/abs/2209.03151",
    "authors": [
      "Shihong Zhang",
      "Chi Zhang",
      "Bosen Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Analysis of PDEs (math.AP)",
      "Computational Physics (physics.comp-ph)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2209.03157",
    "title": "FasterX: Real-Time Object Detection Based on Edge GPUs for UAV  Applications",
    "abstract": "Real-time object detection on Unmanned Aerial Vehicles (UAVs) is a challenging issue due to the limited computing resources of edge GPU devices as Internet of Things (IoT) nodes. To solve this problem, in this paper, we propose a novel lightweight deep learning architectures named FasterX based on YOLOX model for real-time object detection on edge GPU. First, we design an effective and lightweight PixSF head to replace the original head of YOLOX to better detect small objects, which can be further embedded in the depthwise separable convolution (DS Conv) to achieve a lighter head. Then, a slimmer structure in the Neck layer termed as SlimFPN is developed to reduce parameters of the network, which is a trade-off between accuracy and speed. Furthermore, we embed attention module in the Head layer to improve the feature extraction effect of the prediction head. Meanwhile, we also improve the label assignment strategy and loss function to alleviate category imbalance and box optimization problems of the UAV dataset. Finally, auxiliary heads are presented for online distillation to improve the ability of position embedding and feature extraction in PixSF head. The performance of our lightweight models are validated experimentally on the NVIDIA Jetson NX and Jetson Nano GPU embedded platforms.Extensive experiments show that FasterX models achieve better trade-off between accuracy and latency on VisDrone2021 dataset compared to state-of-the-art models. ",
    "url": "https://arxiv.org/abs/2209.03157",
    "authors": [
      "Wei Zhou",
      "Xuanlin Min",
      "Rui Hu",
      "Yiwen Long",
      "Huan Luo",
      "JunYi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2209.03162",
    "title": "Machine Learning-based Automatic Annotation and Detection of COVID-19  Fake News",
    "abstract": "COVID-19 impacted every part of the world, although the misinformation about the outbreak traveled faster than the virus. Misinformation spread through online social networks (OSN) often misled people from following correct medical practices. In particular, OSN bots have been a primary source of disseminating false information and initiating cyber propaganda. Existing work neglects the presence of bots that act as a catalyst in the spread and focuses on fake news detection in 'articles shared in posts' rather than the post (textual) content. Most work on misinformation detection uses manually labeled datasets that are hard to scale for building their predictive models. In this research, we overcome this challenge of data scarcity by proposing an automated approach for labeling data using verified fact-checked statements on a Twitter dataset. In addition, we combine textual features with user-level features (such as followers count and friends count) and tweet-level features (such as number of mentions, hashtags and urls in a tweet) to act as additional indicators to detect misinformation. Moreover, we analyzed the presence of bots in tweets and show that bots change their behavior over time and are most active during the misinformation campaign. We collected 10.22 Million COVID-19 related tweets and used our annotation model to build an extensive and original ground truth dataset for classification purposes. We utilize various machine learning models to accurately detect misinformation and our best classification model achieves precision (82%), recall (96%), and false positive rate (3.58%). Also, our bot analysis indicates that bots generated approximately 10% of misinformation tweets. Our methodology results in substantial exposure of false information, thus improving the trustworthiness of information disseminated through social media platforms. ",
    "url": "https://arxiv.org/abs/2209.03162",
    "authors": [
      "Mohammad Majid Akhtar",
      "Bibhas Sharma",
      "Ishan Karunanayake",
      "Rahat Masood",
      "Muhammad Ikram",
      "Salil S. Kanhere"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.03166",
    "title": "Explainable Artificial Intelligence to Detect Image Spam Using  Convolutional Neural Network",
    "abstract": "Image spam threat detection has continually been a popular area of research with the internet's phenomenal expansion. This research presents an explainable framework for detecting spam images using Convolutional Neural Network(CNN) algorithms and Explainable Artificial Intelligence (XAI) algorithms. In this work, we use CNN model to classify image spam respectively whereas the post-hoc XAI methods including Local Interpretable Model Agnostic Explanation (LIME) and Shapley Additive Explanations (SHAP) were deployed to provide explanations for the decisions that the black-box CNN models made about spam image detection. We train and then evaluate the performance of the proposed approach on a 6636 image dataset including spam images and normal images collected from three different publicly available email corpora. The experimental results show that the proposed framework achieved satisfactory detection results in terms of different performance metrics whereas the model-independent XAI algorithms could provide explanations for the decisions of different models which could be utilized for comparison for the future study. ",
    "url": "https://arxiv.org/abs/2209.03166",
    "authors": [
      "Zhibo Zhang",
      "Ernesto Damiani",
      "Hussam Al Hamadi",
      "Chan Yeob Yeun",
      "Fatma Taher"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.03175",
    "title": "On the utility and protection of optimization with differential privacy  and classic regularization techniques",
    "abstract": "Nowadays, owners and developers of deep learning models must consider stringent privacy-preservation rules of their training data, usually crowd-sourced and retaining sensitive information. The most widely adopted method to enforce privacy guarantees of a deep learning model nowadays relies on optimization techniques enforcing differential privacy. According to the literature, this approach has proven to be a successful defence against several models' privacy attacks, but its downside is a substantial degradation of the models' performance. In this work, we compare the effectiveness of the differentially-private stochastic gradient descent (DP-SGD) algorithm against standard optimization practices with regularization techniques. We analyze the resulting models' utility, training performance, and the effectiveness of membership inference and model inversion attacks against the learned models. Finally, we discuss differential privacy's flaws and limits and empirically demonstrate the often superior privacy-preserving properties of dropout and l2-regularization. ",
    "url": "https://arxiv.org/abs/2209.03175",
    "authors": [
      "Eugenio Lomurno",
      "Matteo matteucci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.03184",
    "title": "Combining Sequential and Aggregated Data for Churn Prediction in Casual  Freemium Games",
    "abstract": "In freemium games, the revenue from a player comes from the in-app purchases made and the advertisement to which that player is exposed. The longer a player is playing the game, the higher will be the chances that he or she will generate a revenue within the game. Within this scenario, it is extremely important to be able to detect promptly when a player is about to quit playing (churn) in order to react and attempt to retain the player within the game, thus prolonging his or her game lifetime. In this article we investigate how to improve the current state-of-the-art in churn prediction by combining sequential and aggregate data using different neural network architectures. The results of the comparative analysis show that the combination of the two data types grants an improvement in the prediction accuracy over predictors based on either purely sequential or purely aggregated data. ",
    "url": "https://arxiv.org/abs/2209.03184",
    "authors": [
      "Jeppe Theiss Kristensen",
      "Paolo Burelli"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.03190",
    "title": "Efficient Implementation of Non-linear Flow Law Using Neural Network  into the Abaqus Explicit FEM code",
    "abstract": "Machine learning techniques are increasingly used to predict material behavior in scientific applications and offer a significant advantage over conventional numerical methods. In this work, an Artificial Neural Network (ANN) model is used in a finite element formulation to define the flow law of a metallic material as a function of plastic strain, plastic strain rate and temperature. First, we present the general structure of the neural network, its operation and focus on the ability of the network to deduce, without prior learning, the derivatives of the flow law with respect to the model inputs. In order to validate the robustness and accuracy of the proposed model, we compare and analyze the performance of several network architectures with respect to the analytical formulation of a Johnson-Cook behavior law for a 42CrMo4 steel. In a second part, after having selected an Artificial Neural Network architecture with $2$ hidden layers, we present the implementation of this model in the Abaqus Explicit computational code in the form of a VUHARD subroutine. The predictive capability of the proposed model is then demonstrated during the numerical simulation of two test cases: the necking of a circular bar and a Taylor impact test. The results obtained show a very high capability of the ANN to replace the analytical formulation of a Johnson-Cook behavior law in a finite element code, while remaining competitive in terms of numerical simulation time compared to a classical approach. ",
    "url": "https://arxiv.org/abs/2209.03190",
    "authors": [
      "Olivier Pantalé",
      "Pierre Tize Mha",
      "Amèvi Tongne"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.03198",
    "title": "When Are Names Similar Or the Same? Introducing the Code Names Matcher  Library",
    "abstract": "Program code contains functions, variables, and data structures that are represented by names. To promote human understanding, these names should describe the role and use of the code elements they represent. But the names given by developers show high variability, reflecting the tastes of each developer, with different words used for the same meaning or the same words used for different meanings. This makes comparing names hard. A precise comparison should be based on matching identical words, but also take into account possible variations on the words (including spelling and typing errors), reordering of the words, matching between synonyms, and so on. To facilitate this we developed a library of comparison functions specifically targeted to comparing names in code. The different functions calculate the similarity between names in different ways, so a researcher can choose the one appropriate for his specific needs. All of them share an attempt to reflect human perceptions of similarity, at the possible expense of lexical matching. ",
    "url": "https://arxiv.org/abs/2209.03198",
    "authors": [
      "Moshe Munk",
      "Dror G. Feitelson"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2209.03225",
    "title": "Hardware faults that matter: Understanding and Estimating the safety  impact of hardware faults on object detection DNNs",
    "abstract": "Object detection neural network models need to perform reliably in highly dynamic and safety-critical environments like automated driving or robotics. Therefore, it is paramount to verify the robustness of the detection under unexpected hardware faults like soft errors that can impact a systems perception module. Standard metrics based on average precision produce model vulnerability estimates at the object level rather than at an image level. As we show in this paper, this does not provide an intuitive or representative indicator of the safety-related impact of silent data corruption caused by bit flips in the underlying memory but can lead to an over- or underestimation of typical fault-induced hazards. With an eye towards safety-related real-time applications, we propose a new metric IVMOD (Image-wise Vulnerability Metric for Object Detection) to quantify vulnerability based on an incorrect image-wise object detection due to false positive (FPs) or false negative (FNs) objects, combined with a severity analysis. The evaluation of several representative object detection models shows that even a single bit flip can lead to a severe silent data corruption event with potentially critical safety implications, with e.g., up to (much greater than) 100 FPs generated, or up to approx. 90% of true positives (TPs) are lost in an image. Furthermore, with a single stuck-at-1 fault, an entire sequence of images can be affected, causing temporally persistent ghost detections that can be mistaken for actual objects (covering up to approx. 83% of the image). Furthermore, actual objects in the scene are continuously missed (up to approx. 64% of TPs are lost). Our work establishes a detailed understanding of the safety-related vulnerability of such critical workloads against hardware faults. ",
    "url": "https://arxiv.org/abs/2209.03225",
    "authors": [
      "Syed Qutub",
      "Florian Geissler",
      "Yang Peng",
      "Ralf Grafe",
      "Michael Paulitsch",
      "Gereon Hinz",
      "Alois Knoll"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2209.03230",
    "title": "AutoPruner: Transformer-Based Call Graph Pruning",
    "abstract": "Constructing a static call graph requires trade-offs between soundness and precision. Program analysis techniques for constructing call graphs are unfortunately usually imprecise. To address this problem, researchers have recently proposed call graph pruning empowered by machine learning to post-process call graphs constructed by static analysis. A machine learning model is built to capture information from the call graph by extracting structural features for use in a random forest classifier. It then removes edges that are predicted to be false positives. Despite the improvements shown by machine learning models, they are still limited as they do not consider the source code semantics and thus often are not able to effectively distinguish true and false positives. In this paper, we present a novel call graph pruning technique, AutoPruner, for eliminating false positives in call graphs via both statistical semantic and structural analysis. Given a call graph constructed by traditional static analysis tools, AutoPruner takes a Transformer-based approach to capture the semantic relationships between the caller and callee functions associated with each edge in the call graph. To do so, AutoPruner fine-tunes a model of code that was pre-trained on a large corpus to represent source code based on descriptions of its semantics. Next, the model is used to extract semantic features from the functions related to each edge in the call graph. AutoPruner uses these semantic features together with the structural features extracted from the call graph to classify each edge via a feed-forward neural network. Our empirical evaluation on a benchmark dataset of real-world programs shows that AutoPruner outperforms the state-of-the-art baselines, improving on F-measure by up to 13% in identifying false-positive edges in a static call graph. ",
    "url": "https://arxiv.org/abs/2209.03230",
    "authors": [
      "Thanh Le-Cong",
      "Hong Jin Kang",
      "Truong Giang Nguyen",
      "Stefanus Agus Haryono",
      "David Lo",
      "Xuan-Bach D. Le",
      "Huynh Quyet Thang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.03255",
    "title": "No More Attacks on Proof-of-Stake Ethereum?",
    "abstract": "The latest message driven (LMD) greedy heaviest observed sub-tree (GHOST) consensus protocol is a critical component of future proof-of-stake (PoS) Ethereum. In its current form, the protocol is brittle and intricate to reason about, as evidenced by recent attacks, patching attempts, and G\\\"orli testnet reorgs. We present Goldfish, which can be seen as a considerably simplified variant of the current protocol, and prove that it is secure and reorg resilient in synchronous networks with dynamic participation, assuming a majority of the nodes (called validators) follows the protocol honestly. Furthermore, we show that subsampling validators can improve the communication efficiency of Goldfish, and that Goldfish is composable with finality gadgets and accountability gadgets. The aforementioned properties make Goldfish a credible candidate for a future protocol upgrade of PoS Ethereum, as well as a versatile pedagogical example. Akin to traditional propose-and-vote-style consensus protocols, Goldfish is organized into slots, at the beginning of which a leader proposes a block containing new transactions, and subsequently members of a committee take a vote towards block confirmation. But instead of using quorums, Goldfish is powered by a new mechanism that carefully synchronizes the inclusion and exclusion of votes in honest validators' views. ",
    "url": "https://arxiv.org/abs/2209.03255",
    "authors": [
      "Francesco D'Amato",
      "Joachim Neu",
      "Ertem Nusret Tas",
      "David Tse"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2209.03276",
    "title": "Inverse modeling of nonisothermal multiphase poromechanics using  physics-informed neural networks",
    "abstract": "We propose a solution strategy for parameter identification in multiphase thermo-hydro-mechanical (THM) processes in porous media using physics-informed neural networks (PINNs). We employ a dimensionless form of the THM governing equations that is particularly well suited for the inverse problem, and we leverage the sequential multiphysics PINN solver we developed in previous work. We validate the proposed inverse-modeling approach on multiple benchmark problems, including Terzaghi's isothermal consolidation problem, Barry-Mercer's isothermal injection-production problem, and nonisothermal consolidation of an unsaturated soil layer. We report the excellent performance of the proposed sequential PINN-THM inverse solver, thus paving the way for the application of PINNs to inverse modeling of complex nonlinear multiphysics problems. ",
    "url": "https://arxiv.org/abs/2209.03276",
    "authors": [
      "Danial Amini",
      "Ehsan Haghighat",
      "Ruben Juanes"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2209.03299",
    "title": "Geometric multimodal representation learning",
    "abstract": "Graph-centric artificial intelligence (graph AI) has achieved remarkable success in modeling interacting systems prevalent in nature, from dynamical systems in biology to particle physics. The increasing heterogeneity of data calls for graph neural architectures that can combine multiple inductive biases. However, combining data from various sources is challenging because appropriate inductive bias may vary by data modality. Multimodal learning methods fuse multiple data modalities while leveraging cross-modal dependencies to address this challenge. Here, we survey 140 studies in graph-centric AI and realize that diverse data types are increasingly brought together using graphs and fed into sophisticated multimodal models. These models stratify into image-, language-, and knowledge-grounded multimodal learning. We put forward an algorithmic blueprint for multimodal graph learning based on this categorization. The blueprint serves as a way to group state-of-the-art architectures that treat multimodal data by choosing appropriately four different components. This effort can pave the way for standardizing the design of sophisticated multimodal architectures for highly complex real-world problems. ",
    "url": "https://arxiv.org/abs/2209.03299",
    "authors": [
      "Yasha Ektefaie",
      "George Dasoulas",
      "Ayush Noori",
      "Maha Farhat",
      "Marinka Zitnik"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.03322",
    "title": "Joint Learning of Deep Texture and High-Frequency Features for  Computer-Generated Image Detection",
    "abstract": "Distinguishing between computer-generated (CG) and natural photographic (PG) images is of great importance to verify the authenticity and originality of digital images. However, the recent cutting-edge generation methods enable high qualities of synthesis in CG images, which makes this challenging task even trickier. To address this issue, a joint learning strategy with deep texture and high-frequency features for CG image detection is proposed. We first formulate and deeply analyze the different acquisition processes of CG and PG images. Based on the finding that multiple different modules in image acquisition will lead to different sensitivity inconsistencies to the convolutional neural network (CNN)-based rendering in images, we propose a deep texture rendering module for texture difference enhancement and discriminative texture representation. Specifically, the semantic segmentation map is generated to guide the affine transformation operation, which is used to recover the texture in different regions of the input image. Then, the combination of the original image and the high-frequency components of the original and rendered images are fed into a multi-branch neural network equipped with attention mechanisms, which refines intermediate features and facilitates trace exploration in spatial and channel dimensions respectively. Extensive experiments on two public datasets and a newly constructed dataset with more realistic and diverse images show that the proposed approach outperforms existing methods in the field by a clear margin. Besides, results also demonstrate the detection robustness and generalization ability of the proposed approach to postprocessing operations and generative adversarial network (GAN) generated images. ",
    "url": "https://arxiv.org/abs/2209.03322",
    "authors": [
      "Qiang Xu",
      "Shan Jia",
      "Xinghao Jiang",
      "Tanfeng Sun",
      "Zhe Wang",
      "Hong Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.03336",
    "title": "Detection and Mapping of Specular Surfaces Using Multibounce Lidar  Returns",
    "abstract": "We propose methods that use specular, multibounce lidar returns to detect and map specular surfaces that might be invisible to conventional lidar systems that rely on direct, single-scatter returns. We derive expressions that relate the time- and angle-of-arrival of these multibounce returns to scattering points on the specular surface, and then use these expressions to formulate techniques for retrieving specular surface geometry when the scene is scanned by a single beam or illuminated with a multi-beam flash. We also consider the special case of transparent specular surfaces, for which surface reflections can be mixed together with light that scatters off of objects lying behind the surface. ",
    "url": "https://arxiv.org/abs/2209.03336",
    "authors": [
      "Connor Henley",
      "Siddharth Somasundaram",
      "Joseph Hollmann",
      "Ramesh Raskar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2209.03341",
    "title": "Large Scale Enrichment and Statistical Cyber Characterization of Network  Traffic",
    "abstract": "Modern network sensors continuously produce enormous quantities of raw data that are beyond the capacity of human analysts. Cross-correlation of network sensors increases this challenge by enriching every network event with additional metadata. These large volumes of enriched network data present opportunities to statistically characterize network traffic and quickly answer a key question: \"What are the primary cyber characteristics of my network data?\" The Python GraphBLAS and PyD4M analysis frameworks enable anonymized statistical analysis to be performed quickly and efficiently on very large network data sets. This approach is tested using billions of anonymized network data samples from the largest Internet observatory (CAIDA Telescope) and tens of millions of anonymized records from the largest commercially available background enrichment capability (GreyNoise). The analysis confirms that most of the enriched variables follow expected heavy-tail distributions and that a large fraction of the network traffic is due to a small number of cyber activities. This information can simplify the cyber analysts' task by enabling prioritization of cyber activities based on statistical prevalence. ",
    "url": "https://arxiv.org/abs/2209.03341",
    "authors": [
      "Ivan Kawaminami",
      "Arminda Estrada",
      "Youssef Elsakkary",
      "Hayden Jananthan",
      "Aydın Buluç",
      "Tim Davis",
      "Daniel Grant",
      "Michael Jones",
      "Chad Meiners",
      "Andrew Morris",
      "Sandeep Pisharody",
      "Jeremy Kepner"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2209.03345",
    "title": "Data Leakage in Notebooks: Static Detection and Better Processes",
    "abstract": "Data science pipelines to train and evaluate models with machine learning may contain bugs just like any other code. Leakage between training and test data can lead to overestimating the model's accuracy during offline evaluations, possibly leading to deployment of low-quality models in production. Such leakage can happen easily by mistake or by following poor practices, but may be tedious and challenging to detect manually. We develop a static analysis approach to detect common forms of data leakage in data science code. Our evaluation shows that our analysis accurately detects data leakage and that such leakage is pervasive among over 100,000 analyzed public notebooks. We discuss how our static analysis approach can help both practitioners and educators, and how leakage prevention can be designed into the development process. ",
    "url": "https://arxiv.org/abs/2209.03345",
    "authors": [
      "Chenyang Yang",
      "Rachel A Brower-Sinning",
      "Grace A. Lewis",
      "Christian Kästner"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2209.02881",
    "title": "Improving Self-supervised Learning for Out-of-distribution Task via  Auxiliary Classifier",
    "abstract": "In real world scenarios, out-of-distribution (OOD) datasets may have a large distributional shift from training datasets. This phenomena generally occurs when a trained classifier is deployed on varying dynamic environments, which causes a significant drop in performance. To tackle this issue, we are proposing an end-to-end deep multi-task network in this work. Observing a strong relationship between rotation prediction (self-supervised) accuracy and semantic classification accuracy on OOD tasks, we introduce an additional auxiliary classification head in our multi-task network along with semantic classification and rotation prediction head. To observe the influence of this addition classifier in improving the rotation prediction head, our proposed learning method is framed into bi-level optimisation problem where the upper-level is trained to update the parameters for semantic classification and rotation prediction head. In the lower-level optimisation, only the auxiliary classification head is updated through semantic classification head by fixing the parameters of the semantic classification head. The proposed method has been validated through three unseen OOD datasets where it exhibits a clear improvement in semantic classification accuracy than other two baseline methods. Our code is available on GitHub \\url{https://github.com/harshita-555/OSSL} ",
    "url": "https://arxiv.org/abs/2209.02881",
    "authors": [
      "Harshita Boonlia",
      "Tanmoy Dam",
      "Md Meftahul Ferdaus",
      "Sreenatha G. Anavatti",
      "Ankan Mullick"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.02895",
    "title": "Constructing Optimal Contraction Trees for Tensor Network Quantum  Circuit Simulation",
    "abstract": "One of the key problems in tensor network based quantum circuit simulation is the construction of a contraction tree which minimizes the cost of the simulation, where the cost can be expressed in the number of operations as a proxy for the simulation running time. This same problem arises in a variety of application areas, such as combinatorial scientific computing, marginalization in probabilistic graphical models, and solving constraint satisfaction problems. In this paper, we reduce the computationally hard portion of this problem to one of graph linear ordering, and demonstrate how existing approaches in this area can be utilized to achieve results up to several orders of magnitude better than existing state of the art methods for the same running time. To do so, we introduce a novel polynomial time algorithm for constructing an optimal contraction tree from a given order. Furthermore, we introduce a fast and high quality linear ordering solver, and demonstrate its applicability as a heuristic for providing orderings for contraction trees. Finally, we compare our solver with competing methods for constructing contraction trees in quantum circuit simulation on a collection of randomly generated Quantum Approximate Optimization Algorithm Max Cut circuits and show that our method achieves superior results on a majority of tested quantum circuits. Reproducibility: Our source code and data are available at https://github.com/cameton/HPEC2022_ContractionTrees. ",
    "url": "https://arxiv.org/abs/2209.02895",
    "authors": [
      "Cameron Ibrahim",
      "Danylo Lykov",
      "Zichang He",
      "Yuri Alexeev",
      "Ilya Safro"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2209.02929",
    "title": "Deep Learning for Medical Imaging From Diagnosis Prediction to its  Counterfactual Explanation",
    "abstract": "Deep neural networks (DNN) have achieved unprecedented performance in computer-vision tasks almost ubiquitously in business, technology, and science. While substantial efforts are made to engineer highly accurate architectures and provide usable model explanations, most state-of-the-art approaches are first designed for natural vision and then translated to the medical domain. This dissertation seeks to address this gap by proposing novel architectures that integrate the domain-specific constraints of medical imaging into the DNN model and explanation design. ",
    "url": "https://arxiv.org/abs/2209.02929",
    "authors": [
      "Sumedha Singla"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.03042",
    "title": "Graph Neural Networks for Low-Energy Event Classification &  Reconstruction in IceCube",
    "abstract": "IceCube, a cubic-kilometer array of optical sensors built to detect atmospheric and astrophysical neutrinos between 1 GeV and 1 PeV, is deployed 1.45 km to 2.45 km below the surface of the ice sheet at the South Pole. The classification and reconstruction of events from the in-ice detectors play a central role in the analysis of data from IceCube. Reconstructing and classifying events is a challenge due to the irregular detector geometry, inhomogeneous scattering and absorption of light in the ice and, below 100 GeV, the relatively low number of signal photons produced per event. To address this challenge, it is possible to represent IceCube events as point cloud graphs and use a Graph Neural Network (GNN) as the classification and reconstruction method. The GNN is capable of distinguishing neutrino events from cosmic-ray backgrounds, classifying different neutrino event types, and reconstructing the deposited energy, direction and interaction vertex. Based on simulation, we provide a comparison in the 1-100 GeV energy range to the current state-of-the-art maximum likelihood techniques used in current IceCube analyses, including the effects of known systematic uncertainties. For neutrino event classification, the GNN increases the signal efficiency by 18% at a fixed false positive rate (FPR), compared to current IceCube methods. Alternatively, the GNN offers a reduction of the FPR by over a factor 8 (to below half a percent) at a fixed signal efficiency. For the reconstruction of energy, direction, and interaction vertex, the resolution improves by an average of 13%-20% compared to current maximum likelihood techniques in the energy range of 1-30 GeV. The GNN, when run on a GPU, is capable of processing IceCube events at a rate nearly double of the median IceCube trigger rate of 2.7 kHz, which opens the possibility of using low energy neutrinos in online searches for transient events. ",
    "url": "https://arxiv.org/abs/2209.03042",
    "authors": [
      "R. Abbasi",
      "M. Ackermann",
      "J. Adams",
      "N. Aggarwal",
      "J. A. Aguilar",
      "M. Ahlers",
      "M. Ahrens",
      "J.M. Alameddine",
      "A. A. Alves Jr.",
      "N. M. Amin",
      "K. Andeen",
      "T. Anderson",
      "G. Anton",
      "C. Argüelles",
      "Y. Ashida",
      "S. Athanasiadou",
      "S. Axani",
      "X. Bai",
      "A. Balagopal V.",
      "M. Baricevic",
      "S. W. Barwick",
      "V. Basu",
      "R. Bay",
      "J. J. Beatty",
      "K.-H. Becker",
      "J. Becker Tjus",
      "J. Beise",
      "C. Bellenghi",
      "S. Benda",
      "S. BenZvi",
      "D. Berley",
      "E. Bernardini",
      "D. Z. Besson",
      "G. Binder",
      "D. Bindig",
      "E. Blaufuss",
      "S. Blot",
      "F. Bontempo",
      "J. Y. Book",
      "J. Borowka",
      "C. Boscolo Meneguolo",
      "S. Böser",
      "O. Botner",
      "J. Böttcher",
      "E. Bourbeau",
      "J. Braun",
      "B. Brinson",
      "J. Brostean-Kaiser",
      "R. T. Burley",
      "R. S. Busse",
      "M. A. Campana",
      "E. G. Carnie-Bronca",
      "C. Chen",
      "Z. Chen",
      "D. Chirkin",
      "K. Choi",
      "B. A. Clark",
      "L. Classen",
      "A. Coleman",
      "G. H. Collin",
      "A. Connolly",
      "J. M. Conrad"
    ],
    "subjectives": [
      "High Energy Physics - Experiment (hep-ex)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Instrumentation and Detectors (physics.ins-det)"
    ]
  },
  {
    "id": "arXiv:2209.03171",
    "title": "Machine Learning Partners in Criminal Networks",
    "abstract": "Recent research has shown that criminal networks have complex organizational structures, but whether this can be used to predict static and dynamic properties of criminal networks remains little explored. Here, by combining graph representation learning and machine learning methods, we show that structural properties of political corruption, police intelligence, and money laundering networks can be used to recover missing criminal partnerships, distinguish among different types of criminal and legal associations, as well as predict the total amount of money exchanged among criminal agents, all with outstanding accuracy. We also show that our approach can anticipate future criminal associations during the dynamic growth of corruption networks with significant accuracy. Thus, similar to evidence found at crime scenes, we conclude that structural patterns of criminal networks carry crucial information about illegal activities, which allows machine learning methods to predict missing information and even anticipate future criminal behavior. ",
    "url": "https://arxiv.org/abs/2209.03171",
    "authors": [
      "Diego D. Lopes",
      "Bruno R. da Cunha",
      "Alvaro F. Martins",
      "Sebastian Goncalves",
      "Ervin K.Lenzi",
      "Quentin S. Hanley",
      "Matjaz Perc",
      "Haroldo V. Ribeiro"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.03329",
    "title": "Minimum-entropy causal inference and its application in brain network  analysis",
    "abstract": "Identification of the causal relationship between multivariate time series is a ubiquitous problem in data science. Granger causality measure (GCM) and conditional Granger causality measure (cGCM) are widely used statistical methods for causal inference and effective connectivity analysis in neuroimaging research. Both GCM and cGCM have frequency-domain formulations that are developed based on a heuristic algorithm for matrix decompositions. The goal of this work is to generalize GCM and cGCM measures and their frequency-domain formulations by using a theoretic framework for minimum entropy (ME) estimation. The proposed ME-estimation method extends the classical theory of minimum mean squared error (MMSE) estimation for stochastic processes. It provides three formulations of cGCM that include Geweke's original time-domain cGCM as a special case. But all three frequency-domain formulations of cGCM are different from previous methods. Experimental results based on simulations have shown that one of the proposed frequency-domain cGCM has enhanced sensitivity and specificity in detecting network connections compared to other methods. In an example based on in vivo functional magnetic resonance imaging, the proposed frequency-domain measure cGCM can significantly enhance the consistency between the structural and effective connectivity of human brain networks. ",
    "url": "https://arxiv.org/abs/2209.03329",
    "authors": [
      "Lipeng Ning"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Information Theory (cs.IT)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:1909.11799",
    "title": "Manifold Oblique Random Forests: Towards Closing the Gap on  Convolutional Deep Networks",
    "abstract": " Comments: Updated manuscript based on review at SIMODS ",
    "url": "https://arxiv.org/abs/1909.11799",
    "authors": [
      "Adam Li",
      "Ronan Perry",
      "Chester Huynh",
      "Tyler M. Tomita",
      "Ronak Mehta",
      "Jesus Arroyo",
      "Jesse Patsolic",
      "Benjamin Falk",
      "Joshua T. Vogelstein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2007.08445",
    "title": "Hierarchical Interaction Networks with Rethinking Mechanism for  Document-level Sentiment Analysis",
    "abstract": " Comments: 17 pages, accepted by ECML-PKDD 2020 ",
    "url": "https://arxiv.org/abs/2007.08445",
    "authors": [
      "Lingwei Wei",
      "Dou Hu",
      "Wei Zhou",
      "Xuehai Tang",
      "Xiaodan Zhang",
      "Xin Wang",
      "Jizhong Han",
      "Songlin Hu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2011.08577",
    "title": "Multi Receptive Field Network for Semantic Segmentation",
    "abstract": " Comments: Accept by WACV 2020 ",
    "url": "https://arxiv.org/abs/2011.08577",
    "authors": [
      "Jianlong Yuan",
      "Zelu Deng",
      "Shu Wang",
      "Zhenbo Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2012.01724",
    "title": "Parallel Residual Bi-Fusion Feature Pyramid Network for Accurate  Single-Shot Object Detection",
    "abstract": " Comments: accepted by IEEE transactions on Image Processing ",
    "url": "https://arxiv.org/abs/2012.01724",
    "authors": [
      "Ping-Yang Chen",
      "Ming-Ching Chang",
      "Jun-Wei Hsieh",
      "Yong-Sheng Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2104.03765",
    "title": "Robust Self-Ensembling Network for Hyperspectral Image Classification",
    "abstract": " Title: Robust Self-Ensembling Network for Hyperspectral Image Classification ",
    "url": "https://arxiv.org/abs/2104.03765",
    "authors": [
      "Yonghao Xu",
      "Bo Du",
      "Liangpei Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.12964",
    "title": "Continual Novelty Detection",
    "abstract": " Comments: Collas 2022 ",
    "url": "https://arxiv.org/abs/2106.12964",
    "authors": [
      "Rahaf Aljundi",
      "Daniel Olmeda Reino",
      "Nikolay Chumerin",
      "Richard E. Turner"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.00584",
    "title": "On the functional graph of the power map over finite groups",
    "abstract": " Title: On the functional graph of the power map over finite groups ",
    "url": "https://arxiv.org/abs/2107.00584",
    "authors": [
      "Claudio Qureshi",
      "Lucas Reis"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2108.09136",
    "title": "Unsupervised Domain-adaptive Hash for Networks",
    "abstract": " Title: Unsupervised Domain-adaptive Hash for Networks ",
    "url": "https://arxiv.org/abs/2108.09136",
    "authors": [
      "Tao He",
      "Lianli Gao",
      "Jingkuan Song",
      "Yuan-Fang Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2109.10708",
    "title": "A Note on the Modeling Power of Different Graph Types",
    "abstract": " Title: A Note on the Modeling Power of Different Graph Types ",
    "url": "https://arxiv.org/abs/2109.10708",
    "authors": [
      "Josephine M. Thomas",
      "Silvia Beddar-Wiesing",
      "Alice Moallemy-Oureh",
      "Rüdiger Nather"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Computational Complexity (cs.CC)",
      "Data Structures and Algorithms (cs.DS)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2111.10759",
    "title": "Adversarial Mask: Real-World Universal Adversarial Attack on Face  Recognition Model",
    "abstract": " Comments: 16 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2111.10759",
    "authors": [
      "Alon Zolfi",
      "Shai Avidan",
      "Yuval Elovici",
      "Asaf Shabtai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.12408",
    "title": "Markov Chain Generative Adversarial Neural Networks for Solving Bayesian  Inverse Problems in Physics Applications",
    "abstract": " Title: Markov Chain Generative Adversarial Neural Networks for Solving Bayesian  Inverse Problems in Physics Applications ",
    "url": "https://arxiv.org/abs/2111.12408",
    "authors": [
      "Nikolaj T. Mücke",
      "Benjamin Sanderse",
      "Sander Bohté",
      "Cornelis W. Oosterlee"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2111.14094",
    "title": "Topic Driven Adaptive Network for Cross-Domain Sentiment Classification",
    "abstract": " Title: Topic Driven Adaptive Network for Cross-Domain Sentiment Classification ",
    "url": "https://arxiv.org/abs/2111.14094",
    "authors": [
      "Yicheng Zhu",
      "Yiqiao Qiu",
      "Qingyuan Wu",
      "Fu Lee Wang",
      "Yanghui Rao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.02962",
    "title": "DANets: Deep Abstract Networks for Tabular Data Classification and  Regression",
    "abstract": " Comments: @inproceedings{danets, title={DANets: Deep Abstract Networks for Tabular Data Classification and Regression}, author={Chen, Jintai and Liao, Kuanlun and Wan, Yao and Chen, Danny Z and Wu, Jian}, booktitle={AAAI}, year={2022} } ",
    "url": "https://arxiv.org/abs/2112.02962",
    "authors": [
      "Jintai Chen",
      "Kuanlun Liao",
      "Yao Wan",
      "Danny Z. Chen",
      "Jian Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.03533",
    "title": "A Time-domain Real-valued Generalized Wiener Filter for Multi-channel  Neural Separation Systems",
    "abstract": " Title: A Time-domain Real-valued Generalized Wiener Filter for Multi-channel  Neural Separation Systems ",
    "url": "https://arxiv.org/abs/2112.03533",
    "authors": [
      "Yi Luo"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2112.11950",
    "title": "POD-Galerkin reduced order models and physics-informed neural networks  for solving inverse problems for the Navier-Stokes equations",
    "abstract": " Comments: Second version with additional test case ",
    "url": "https://arxiv.org/abs/2112.11950",
    "authors": [
      "Saddam Hijazi",
      "Melina Freitag",
      "Niels Landwehr"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2201.05587",
    "title": "Transfer-Tuning: Reusing Auto-Schedules for Efficient Tensor Program  Code Generation",
    "abstract": " Comments: 12 pages, 8 figures, in PACT 2022 ",
    "url": "https://arxiv.org/abs/2201.05587",
    "authors": [
      "Perry Gibson",
      "José Cano"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Performance (cs.PF)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2201.07406",
    "title": "Fooling MOSS Detection with Pretrained Language Models",
    "abstract": " Comments: To appear in the Proceedings of the 29th ACM International Conference on Information & Knowledge Management (CIKM) ",
    "url": "https://arxiv.org/abs/2201.07406",
    "authors": [
      "Stella Biderman",
      "Edward Raff"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.10069",
    "title": "Link Prediction with Contextualized Self-Supervision",
    "abstract": " Comments: Accepted by TKDE, 14 pages ",
    "url": "https://arxiv.org/abs/2201.10069",
    "authors": [
      "Daokun Zhang",
      "Jie Yin",
      "Philip S. Yu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.07001",
    "title": "Handcrafted Histological Transformer (H2T): Unsupervised Representation  of Whole Slide Images",
    "abstract": " Title: Handcrafted Histological Transformer (H2T): Unsupervised Representation  of Whole Slide Images ",
    "url": "https://arxiv.org/abs/2202.07001",
    "authors": [
      "Quoc Dang Vu",
      "Kashif Rajpoot",
      "Shan E Ahmed Raza",
      "Nasir Rajpoot"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.00407",
    "title": "A modified SIRD model for Covid19 spread prediction using ensemble  neural networks",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2007.13494 ",
    "url": "https://arxiv.org/abs/2203.00407",
    "authors": [
      "Marian Petrica",
      "Ionel Popescu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Populations and Evolution (q-bio.PE)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2203.01830",
    "title": "Understanding microbiome dynamics via interpretable graph representation  learning",
    "abstract": " Title: Understanding microbiome dynamics via interpretable graph representation  learning ",
    "url": "https://arxiv.org/abs/2203.01830",
    "authors": [
      "Kateryna Melnyk",
      "Kuba Weimann",
      "Tim O.F. Conrad"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.12145",
    "title": "Out of Distribution Detection, Generalization, and Robustness Triangle  with Maximum Probability Theorem",
    "abstract": " Title: Out of Distribution Detection, Generalization, and Robustness Triangle  with Maximum Probability Theorem ",
    "url": "https://arxiv.org/abs/2203.12145",
    "authors": [
      "Amir Emad Marvasti",
      "Ehsan Emad Marvasti",
      "Ulas Bagci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.17045",
    "title": "Wasserstein Distributionally Robust Control of Partially Observable  Linear Systems: Tractable Approximation and Performance Guarantee",
    "abstract": " Comments: Accepted to be presented at CDC 22 ",
    "url": "https://arxiv.org/abs/2203.17045",
    "authors": [
      "Astghik Hakobyan",
      "Insoon Yang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.00804",
    "title": "Diffusion dynamics of competing information on networks",
    "abstract": " Comments: 8 pages + supplemental material ",
    "url": "https://arxiv.org/abs/2204.00804",
    "authors": [
      "Teruyoshi Kobayashi"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.00910",
    "title": "Characterizing Spontaneous Ideation Contest on Social Media: Case Study  on the Name Change of Facebook to Meta",
    "abstract": " Comments: 10 pages, 13 figures ",
    "url": "https://arxiv.org/abs/2204.00910",
    "authors": [
      "Kunihiro Miyazaki",
      "Takayuki Uchiba",
      "Haewoon Kwak",
      "Jisun An"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.03361",
    "title": "Robust Event-Driven Interactions in Cooperative Multi-Agent Learning",
    "abstract": " Title: Robust Event-Driven Interactions in Cooperative Multi-Agent Learning ",
    "url": "https://arxiv.org/abs/2204.03361",
    "authors": [
      "Daniel Jarne Ornia",
      "Manuel Mazo Jr"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.07832",
    "title": "A Contrastive Cross-Channel Data Augmentation Framework for Aspect-based  Sentiment Analysis",
    "abstract": " Comments: COLING 2022 ",
    "url": "https://arxiv.org/abs/2204.07832",
    "authors": [
      "Bing Wang",
      "Liang Ding",
      "Qihuang Zhong",
      "Ximing Li",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.03105",
    "title": "LPGNet: Link Private Graph Networks for Node Classification",
    "abstract": " Comments: Accepted at CCS'22 ",
    "url": "https://arxiv.org/abs/2205.03105",
    "authors": [
      "Aashish Kolluri",
      "Teodora Baluta",
      "Bryan Hooi",
      "Prateek Saxena"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2205.10128",
    "title": "Neural-Symbolic Models for Logical Queries on Knowledge Graphs",
    "abstract": " Comments: ICML 2022 ",
    "url": "https://arxiv.org/abs/2205.10128",
    "authors": [
      "Zhaocheng Zhu",
      "Mikhail Galkin",
      "Zuobai Zhang",
      "Jian Tang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.14371",
    "title": "GLITCH: Automated Polyglot Security Smell Detection in Infrastructure as  Code",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:1907.07159 by other authors ",
    "url": "https://arxiv.org/abs/2205.14371",
    "authors": [
      "Nuno Saavedra",
      "João F. Ferreira"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2206.05238",
    "title": "Dimensional Modeling of Emotions in Text with Appraisal Theories: Corpus  Creation, Annotation Reliability, and Prediction",
    "abstract": " Comments: accepted for publication in the Computational Linguistics Journal in Issue No 1, March 2023; 71 pages, 13 figures, 19 tables ",
    "url": "https://arxiv.org/abs/2206.05238",
    "authors": [
      "Enrica Troiano",
      "Laura Oberländer",
      "Roman Klinger"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2206.06257",
    "title": "Distributed Adversarial Training to Robustify Deep Neural Networks at  Scale",
    "abstract": " Title: Distributed Adversarial Training to Robustify Deep Neural Networks at  Scale ",
    "url": "https://arxiv.org/abs/2206.06257",
    "authors": [
      "Gaoyuan Zhang",
      "Songtao Lu",
      "Yihua Zhang",
      "Xiangyi Chen",
      "Pin-Yu Chen",
      "Quanfu Fan",
      "Lee Martie",
      "Lior Horesh",
      "Mingyi Hong",
      "Sijia Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.11033",
    "title": "GesSure- A Robust Face-Authentication enabled Dynamic Gesture  Recognition GUI Application",
    "abstract": " Comments: Accepted at International Conference on Artificial Intelligence Advances (AIAD 2022) ",
    "url": "https://arxiv.org/abs/2207.11033",
    "authors": [
      "Ankit Jha",
      "Ishita",
      "Pratham G. Shenwai",
      "Ayush Batra",
      "Siddharth Kotian",
      "Piyush Modi"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.11788",
    "title": "Privacy Against Inference Attacks in Vertical Federated Learning",
    "abstract": " Title: Privacy Against Inference Attacks in Vertical Federated Learning ",
    "url": "https://arxiv.org/abs/2207.11788",
    "authors": [
      "Borzoo Rassouli",
      "Morteza Varasteh",
      "Deniz Gunduz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2207.11871",
    "title": "Towards Complex Document Understanding By Discrete Reasoning",
    "abstract": " Comments: Accepted by ACM Multimedia 2022 ",
    "url": "https://arxiv.org/abs/2207.11871",
    "authors": [
      "Fengbin Zhu",
      "Wenqiang Lei",
      "Fuli Feng",
      "Chao Wang",
      "Haozhou Zhang",
      "Tat-Seng Chua"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.00780",
    "title": "Visual correspondence-based explanations improve AI robustness and  human-AI team accuracy",
    "abstract": " Title: Visual correspondence-based explanations improve AI robustness and  human-AI team accuracy ",
    "url": "https://arxiv.org/abs/2208.00780",
    "authors": [
      "Giang Nguyen",
      "Mohammad Reza Taesiri",
      "Anh Nguyen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.06971",
    "title": "Handling Interference in Integrated HAPS-Terrestrial Networks through  Radio Resource Management",
    "abstract": " Comments: 7 pages, 3 figures, under review in IEEE letters ",
    "url": "https://arxiv.org/abs/2208.06971",
    "authors": [
      "Afsoon Alidadi Shamsabadi",
      "Animesh Yadav",
      "Omid Abbasi",
      "Halim Yanikomeroglu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.08165",
    "title": "Towards Open-vocabulary Scene Graph Generation with Prompt-based  Finetuning",
    "abstract": " Title: Towards Open-vocabulary Scene Graph Generation with Prompt-based  Finetuning ",
    "url": "https://arxiv.org/abs/2208.08165",
    "authors": [
      "Tao He",
      "Lianli Gao",
      "Jingkuan Song",
      "Yuan-Fang Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.12543",
    "title": "The Parameterized Complexity Binary CSP for Graphs with a Small Vertex  Cover and Related Results",
    "abstract": " Title: The Parameterized Complexity Binary CSP for Graphs with a Small Vertex  Cover and Related Results ",
    "url": "https://arxiv.org/abs/2208.12543",
    "authors": [
      "Hans L. Bodlaender"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2208.12940",
    "title": "Actor-identified Spatiotemporal Action Detection --- Detecting Who Is  Doing What in Videos",
    "abstract": " Title: Actor-identified Spatiotemporal Action Detection --- Detecting Who Is  Doing What in Videos ",
    "url": "https://arxiv.org/abs/2208.12940",
    "authors": [
      "Fan Yang",
      "Norimichi Ukita",
      "Sakriani Sakti",
      "Satoshi Nakamura"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.13252",
    "title": "MANDO: Multi-Level Heterogeneous Graph Embeddings for Fine-Grained  Detection of Smart Contract Vulnerabilities",
    "abstract": " Comments: Accepted at the 9th IEEE International Conference on Data Science and Advanced Analytics (DSAA 2022 - Research Track) ",
    "url": "https://arxiv.org/abs/2208.13252",
    "authors": [
      "Hoang H. Nguyen",
      "Nhat-Minh Nguyen",
      "Chunyao Xie",
      "Zahra Ahmadi",
      "Daniel Kudendo",
      "Thanh-Nam Doan",
      "Lingxiao Jiang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.14812",
    "title": "Domain Shift-oriented Machine Anomalous Sound Detection Model Based on  Self-Supervised Learning",
    "abstract": " Title: Domain Shift-oriented Machine Anomalous Sound Detection Model Based on  Self-Supervised Learning ",
    "url": "https://arxiv.org/abs/2208.14812",
    "authors": [
      "Jing-ke Yan",
      "Xin Wang",
      "Qin Wang",
      "Qin Qin",
      "Huang-he Li",
      "Peng-fei Ye",
      "Yue-ping He",
      "Jing Zeng"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2209.00209",
    "title": "Invariant and Dual Invariant Subspaces of $k$-valued Networks",
    "abstract": " Comments: 13 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2209.00209",
    "authors": [
      "Daizhan Cheng",
      "Hongsheng Qi",
      "Xiao Zhang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2209.00721",
    "title": "Generalizing intrusion detection for heterogeneous networks: A  stacked-unsupervised federated learning approach",
    "abstract": " Comments: Preprint, 32 pages ",
    "url": "https://arxiv.org/abs/2209.00721",
    "authors": [
      "Gustavo de Carvalho Bertoli",
      "Lourenço Alves Pereira Junior",
      "Aldri Luiz dos Santos",
      "Osamu Saotome"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.01336",
    "title": "Graph Fourier transforms on directed product graphs",
    "abstract": " Title: Graph Fourier transforms on directed product graphs ",
    "url": "https://arxiv.org/abs/2209.01336",
    "authors": [
      "Cheng Cheng",
      "Yang Chen",
      "Jeon Yu Lee",
      "Qiyu Sun"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2209.02012",
    "title": "Human and social capital strategies for Mafia network disruption",
    "abstract": " Title: Human and social capital strategies for Mafia network disruption ",
    "url": "https://arxiv.org/abs/2209.02012",
    "authors": [
      "Annamaria Ficara",
      "Francesco Curreri",
      "Giacomo Fiumara",
      "Pasquale De Meo"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.02317",
    "title": "Layer or Representation Space: What makes BERT-based Evaluation Metrics  Robust?",
    "abstract": " Comments: COLING 2022 camera-ready version ",
    "url": "https://arxiv.org/abs/2209.02317",
    "authors": [
      "Doan Nam Long Vu",
      "Nafise Sadat Moosavi",
      "Steffen Eger"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  }
]