[
  {
    "id": "arXiv:2308.16207",
    "title": "MASA-TCN: Multi-anchor Space-aware Temporal Convolutional Neural  Networks for Continuous and Discrete EEG Emotion Recognition",
    "abstract": "Emotion recognition using electroencephalogram (EEG) mainly has two scenarios: classification of the discrete labels and regression of the continuously tagged labels. Although many algorithms were proposed for classification tasks, there are only a few methods for regression tasks. For emotion regression, the label is continuous in time. A natural method is to learn the temporal dynamic patterns. In previous studies, long short-term memory (LSTM) and temporal convolutional neural networks (TCN) were utilized to learn the temporal contextual information from feature vectors of EEG. However, the spatial patterns of EEG were not effectively extracted. To enable the spatial learning ability of TCN towards better regression and classification performances, we propose a novel unified model, named MASA-TCN, for EEG emotion regression and classification tasks. The space-aware temporal layer enables TCN to additionally learn from spatial relations among EEG electrodes. Besides, a novel multi-anchor block with attentive fusion is proposed to learn dynamic temporal dependencies. Experiments on two publicly available datasets show MASA-TCN achieves higher results than the state-of-the-art methods for both EEG emotion regression and classification tasks. The code is available at https://github.com/yi-ding-cs/MASA-TCN. ",
    "url": "https://arxiv.org/abs/2308.16207",
    "authors": [
      "Yi Ding",
      "Su Zhang",
      "Chuangao Tang",
      "Cuntai Guan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16246",
    "title": "Active Neural Mapping",
    "abstract": "We address the problem of active mapping with a continually-learned neural scene representation, namely Active Neural Mapping. The key lies in actively finding the target space to be explored with efficient agent movement, thus minimizing the map uncertainty on-the-fly within a previously unseen environment. In this paper, we examine the weight space of the continually-learned neural field, and show empirically that the neural variability, the prediction robustness against random weight perturbation, can be directly utilized to measure the instant uncertainty of the neural map. Together with the continuous geometric information inherited in the neural map, the agent can be guided to find a traversable path to gradually gain knowledge of the environment. We present for the first time an active mapping system with a coordinate-based implicit neural representation for online scene reconstruction. Experiments in the visually-realistic Gibson and Matterport3D environment demonstrate the efficacy of the proposed method. ",
    "url": "https://arxiv.org/abs/2308.16246",
    "authors": [
      "Zike Yan",
      "Haoxiang Yang",
      "Hongbin Zha"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16258",
    "title": "Robust Principles: Architectural Design Principles for Adversarially  Robust CNNs",
    "abstract": "Our research aims to unify existing works' diverging opinions on how architectural components affect the adversarial robustness of CNNs. To accomplish our goal, we synthesize a suite of three generalizable robust architectural design principles: (a) optimal range for depth and width configurations, (b) preferring convolutional over patchify stem stage, and (c) robust residual block design through adopting squeeze and excitation blocks and non-parametric smooth activation functions. Through extensive experiments across a wide spectrum of dataset scales, adversarial training methods, model parameters, and network design spaces, our principles consistently and markedly improve AutoAttack accuracy: 1-3 percentage points (pp) on CIFAR-10 and CIFAR-100, and 4-9 pp on ImageNet. The code is publicly available at https://github.com/poloclub/robust-principles. ",
    "url": "https://arxiv.org/abs/2308.16258",
    "authors": [
      "ShengYun Peng",
      "Weilin Xu",
      "Cory Cornelius",
      "Matthew Hull",
      "Kevin Li",
      "Rahul Duggal",
      "Mansi Phute",
      "Jason Martin",
      "Duen Horng Chau"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16259",
    "title": "Materials Informatics Transformer: A Language Model for Interpretable  Materials Properties Prediction",
    "abstract": "Recently, the remarkable capabilities of large language models (LLMs) have been illustrated across a variety of research domains such as natural language processing, computer vision, and molecular modeling. We extend this paradigm by utilizing LLMs for material property prediction by introducing our model Materials Informatics Transformer (MatInFormer). Specifically, we introduce a novel approach that involves learning the grammar of crystallography through the tokenization of pertinent space group information. We further illustrate the adaptability of MatInFormer by incorporating task-specific data pertaining to Metal-Organic Frameworks (MOFs). Through attention visualization, we uncover the key features that the model prioritizes during property prediction. The effectiveness of our proposed model is empirically validated across 14 distinct datasets, hereby underscoring its potential for high throughput screening through accurate material property prediction. ",
    "url": "https://arxiv.org/abs/2308.16259",
    "authors": [
      "Hongshuo Huang",
      "Rishikesh Magar",
      "Changwen Xu",
      "Amir Bariti Farimani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Materials Science (cond-mat.mtrl-sci)",
      "Chemical Physics (physics.chem-ph)"
    ]
  },
  {
    "id": "arXiv:2308.16262",
    "title": "Causal Strategic Learning with Competitive Selection",
    "abstract": "We study the problem of agent selection in causal strategic learning under multiple decision makers and address two key challenges that come with it. Firstly, while much of prior work focuses on studying a fixed pool of agents that remains static regardless of their evaluations, we consider the impact of selection procedure by which agents are not only evaluated, but also selected. When each decision maker unilaterally selects agents by maximising their own utility, we show that the optimal selection rule is a trade-off between selecting the best agents and providing incentives to maximise the agents' improvement. Furthermore, this optimal selection rule relies on incorrect predictions of agents' outcomes. Hence, we study the conditions under which a decision maker's optimal selection rule will not lead to deterioration of agents' outcome nor cause unjust reduction in agents' selection chance. To that end, we provide an analytical form of the optimal selection rule and a mechanism to retrieve the causal parameters from observational data, under certain assumptions on agents' behaviour. Secondly, when there are multiple decision makers, the interference between selection rules introduces another source of biases in estimating the underlying causal parameters. To address this problem, we provide a cooperative protocol which all decision makers must collectively adopt to recover the true causal parameters. Lastly, we complement our theoretical results with simulation studies. Our results highlight not only the importance of causal modeling as a strategy to mitigate the effect of gaming, as suggested by previous work, but also the need of a benevolent regulator to enable it. ",
    "url": "https://arxiv.org/abs/2308.16262",
    "authors": [
      "Kiet Q. H. Vo",
      "Muneeb Aadil",
      "Siu Lun Chau",
      "Krikamol Muandet"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16279",
    "title": "Classification of Anomalies in Telecommunication Network KPI Time Series",
    "abstract": "The increasing complexity and scale of telecommunication networks have led to a growing interest in automated anomaly detection systems. However, the classification of anomalies detected on network Key Performance Indicators (KPI) has received less attention, resulting in a lack of information about anomaly characteristics and classification processes. To address this gap, this paper proposes a modular anomaly classification framework. The framework assumes separate entities for the anomaly classifier and the detector, allowing for a distinct treatment of anomaly detection and classification tasks on time series. The objectives of this study are (1) to develop a time series simulator that generates synthetic time series resembling real-world network KPI behavior, (2) to build a detection model to identify anomalies in the time series, (3) to build classification models that accurately categorize detected anomalies into predefined classes (4) to evaluate the classification framework performance on simulated and real-world network KPI time series. This study has demonstrated the good performance of the anomaly classification models trained on simulated anomalies when applied to real-world network time series data. ",
    "url": "https://arxiv.org/abs/2308.16279",
    "authors": [
      "Korantin Bordeau-Aubert",
      "Justin Whatley",
      "Sylvain Nadeau",
      "Tristan Glatard",
      "Brigitte Jaumard"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16298",
    "title": "Publishing Wikipedia usage data with strong privacy guarantees",
    "abstract": "For almost 20 years, the Wikimedia Foundation has been publishing statistics about how many people visited each Wikipedia page on each day. This data helps Wikipedia editors determine where to focus their efforts to improve the online encyclopedia, and enables academic research. In June 2023, the Wikimedia Foundation, helped by Tumult Labs, addressed a long-standing request from Wikipedia editors and academic researchers: it started publishing these statistics with finer granularity, including the country of origin in the daily counts of page views. This new data publication uses differential privacy to provide robust guarantees to people browsing or editing Wikipedia. This paper describes this data publication: its goals, the process followed from its inception to its deployment, the algorithms used to produce the data, and the outcomes of the data release. ",
    "url": "https://arxiv.org/abs/2308.16298",
    "authors": [
      "Temilola Adeleye",
      "Skye Berghel",
      "Damien Desfontaines",
      "Michael Hay",
      "Isaac Johnson",
      "Cléo Lemoisson",
      "Ashwin Machanavajjhala",
      "Tom Magerlein",
      "Gabriele Modena",
      "David Pujol",
      "Daniel Simmons-Marengo",
      "Hal Triedman"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.16311",
    "title": "Neural network-based multiscale modeling of finite strain  magneto-elasticity with relaxed convexity criteria",
    "abstract": "We present a framework for the multiscale modeling of finite strain magneto-elasticity based on physics-augmented neural networks (NNs). By using a set of problem specific invariants as input, an energy functional as the output and by adding several non-trainable expressions to the overall total energy density functional, the model fulfills multiple physical principles by construction, e.g., thermodynamic consistency and material symmetry. Three NN-based models with varying requirements in terms of an extended polyconvexity condition of the magneto-elastic potential are presented. First, polyconvexity, which is a global concept, is enforced via input convex neural networks (ICNNs). Afterwards, we formulate a relaxed local version of the polyconvexity and fulfill it in a weak sense by adding a tailored loss term. As an alternative, a loss term to enforce the weaker requirement of strong ellipticity locally is proposed, which can be favorable to obtain a better trade-off between compatibility with data and physical constraints. Databases for training of the models are generated via computational homogenization for both compressible and quasi-incompressible magneto-active polymers (MAPs). Thereby, to reduce the computational cost, 2D statistical volume elements and an invariant-based sampling technique for the pre-selection of relevant states are used. All models are calibrated by using the database, whereby interpolation and extrapolation are considered separately. Furthermore, the performance of the NN models is compared to a conventional model from the literature. The numerical study suggests that the proposed physics-augmented NN approach is advantageous over the conventional model for MAPs. Thereby, the two more flexible NN models in combination with the weakly enforced local polyconvexity lead to good results, whereas the model based only on ICNNs has proven to be too restrictive. ",
    "url": "https://arxiv.org/abs/2308.16311",
    "authors": [
      "Karl A. Kalina",
      "Philipp Gebhart",
      "Jörg Brummund",
      "Lennart Linden",
      "WaiChing Sun",
      "Markus Kästner"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2308.16316",
    "title": "Ten Years of Generative Adversarial Nets (GANs): A survey of the  state-of-the-art",
    "abstract": "Since their inception in 2014, Generative Adversarial Networks (GANs) have rapidly emerged as powerful tools for generating realistic and diverse data across various domains, including computer vision and other applied areas. Consisting of a discriminative network and a generative network engaged in a Minimax game, GANs have revolutionized the field of generative modeling. In February 2018, GAN secured the leading spot on the ``Top Ten Global Breakthrough Technologies List'' issued by the Massachusetts Science and Technology Review. Over the years, numerous advancements have been proposed, leading to a rich array of GAN variants, such as conditional GAN, Wasserstein GAN, CycleGAN, and StyleGAN, among many others. This survey aims to provide a general overview of GANs, summarizing the latent architecture, validation metrics, and application areas of the most widely recognized variants. We also delve into recent theoretical developments, exploring the profound connection between the adversarial principle underlying GAN and Jensen-Shannon divergence, while discussing the optimality characteristics of the GAN framework. The efficiency of GAN variants and their model architectures will be evaluated along with training obstacles as well as training solutions. In addition, a detailed discussion will be provided, examining the integration of GANs with newly developed deep learning frameworks such as Transformers, Physics-Informed Neural Networks, Large Language models, and Diffusion models. Finally, we reveal several issues as well as future research outlines in this field. ",
    "url": "https://arxiv.org/abs/2308.16316",
    "authors": [
      "Tanujit Chakraborty",
      "Ujjwal Reddy K S",
      "Shraddha M. Naik",
      "Madhurima Panja",
      "Bayapureddy Manvitha"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16325",
    "title": "Two-Stage Violence Detection Using ViTPose and Classification Models at  Smart Airports",
    "abstract": "This study introduces an innovative violence detection framework tailored to the unique requirements of smart airports, where prompt responses to violent situations are crucial. The proposed framework harnesses the power of ViTPose for human pose estimation. It employs a CNN - BiLSTM network to analyse spatial and temporal information within keypoints sequences, enabling the accurate classification of violent behaviour in real time. Seamlessly integrated within the SAFE (Situational Awareness for Enhanced Security framework of SAAB, the solution underwent integrated testing to ensure robust performance in real world scenarios. The AIRTLab dataset, characterized by its high video quality and relevance to surveillance scenarios, is utilized in this study to enhance the model's accuracy and mitigate false positives. As airports face increased foot traffic in the post pandemic era, implementing AI driven violence detection systems, such as the one proposed, is paramount for improving security, expediting response times, and promoting data informed decision making. The implementation of this framework not only diminishes the probability of violent events but also assists surveillance teams in effectively addressing potential threats, ultimately fostering a more secure and protected aviation sector. Codes are available at: https://github.com/Asami-1/GDP. ",
    "url": "https://arxiv.org/abs/2308.16325",
    "authors": [
      "İrem Üstek",
      "Jay Desai",
      "Iván López Torrecillas",
      "Sofiane Abadou",
      "Jinjie Wang",
      "Quentin Fever",
      "Sandhya Rani Kasthuri",
      "Yang Xing",
      "Weisi Guo",
      "Antonios Tsourdos"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16328",
    "title": "Debunking Disinformation: Revolutionizing Truth with NLP in Fake News  Detection",
    "abstract": "The Internet and social media have altered how individuals access news in the age of instantaneous information distribution. While this development has increased access to information, it has also created a significant problem: the spread of fake news and information. Fake news is rapidly spreading on digital platforms, which has a negative impact on the media ecosystem, public opinion, decision-making, and social cohesion. Natural Language Processing(NLP), which offers a variety of approaches to identify content as authentic, has emerged as a potent weapon in the growing war against disinformation. This paper takes an in-depth look at how NLP technology can be used to detect fake news and reveals the challenges and opportunities it presents. ",
    "url": "https://arxiv.org/abs/2308.16328",
    "authors": [
      "Li He",
      "Siyi Hu",
      "Ailun Pei"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16372",
    "title": "Artificial to Spiking Neural Networks Conversion for Scientific Machine  Learning",
    "abstract": "We introduce a method to convert Physics-Informed Neural Networks (PINNs), commonly used in scientific machine learning, to Spiking Neural Networks (SNNs), which are expected to have higher energy efficiency compared to traditional Artificial Neural Networks (ANNs). We first extend the calibration technique of SNNs to arbitrary activation functions beyond ReLU, making it more versatile, and we prove a theorem that ensures the effectiveness of the calibration. We successfully convert PINNs to SNNs, enabling computational efficiency for diverse regression tasks in solving multiple differential equations, including the unsteady Navier-Stokes equations. We demonstrate great gains in terms of overall efficiency, including Separable PINNs (SPINNs), which accelerate the training process. Overall, this is the first work of this kind and the proposed method achieves relatively good accuracy with low spike rates. ",
    "url": "https://arxiv.org/abs/2308.16372",
    "authors": [
      "Qian Zhang",
      "Chenxi Wu",
      "Adar Kahana",
      "Youngeun Kim",
      "Yuhang Li",
      "George Em Karniadakis",
      "Priyadarshini Panda"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2308.16375",
    "title": "A Survey on Privacy in Graph Neural Networks: Attacks, Preservation, and  Applications",
    "abstract": "Graph Neural Networks (GNNs) have gained significant attention owing to their ability to handle graph-structured data and the improvement in practical applications. However, many of these models prioritize high utility performance, such as accuracy, with a lack of privacy consideration, which is a major concern in modern society where privacy attacks are rampant. To address this issue, researchers have started to develop privacy-preserving GNNs. Despite this progress, there is a lack of a comprehensive overview of the attacks and the techniques for preserving privacy in the graph domain. In this survey, we aim to address this gap by summarizing the attacks on graph data according to the targeted information, categorizing the privacy preservation techniques in GNNs, and reviewing the datasets and applications that could be used for analyzing/solving privacy issues in GNNs. We also outline potential directions for future research in order to build better privacy-preserving GNNs. ",
    "url": "https://arxiv.org/abs/2308.16375",
    "authors": [
      "Yi Zhang",
      "Yuying Zhao",
      "Zhaoqing Li",
      "Xueqi Cheng",
      "Yu Wang",
      "Olivera Kotevska",
      "Philip S. Yu",
      "Tyler Derr"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.16380",
    "title": "3D vision-based structural masonry damage detection",
    "abstract": "The detection of masonry damage is essential for preventing potentially disastrous outcomes. Manual inspection can, however, take a long time and be hazardous to human inspectors. Automation of the inspection process using novel computer vision and machine learning algorithms can be a more efficient and safe solution to prevent further deterioration of the masonry structures. Most existing 2D vision-based methods are limited to qualitative damage classification, 2D localization, and in-plane quantification. In this study, we present a 3D vision-based methodology for accurate masonry damage detection, which offers a more robust solution with a greater field of view, depth of vision, and the ability to detect failures in complex environments. First, images of the masonry specimens are collected to generate a 3D point cloud. Second, 3D point clouds processing methods are developed to evaluate the masonry damage. We demonstrate the effectiveness of our approach through experiments on structural masonry components. Our experiments showed the proposed system can effectively classify damage states and localize and quantify critical damage features. The result showed the proposed method can improve the level of autonomy during the inspection of masonry structures. ",
    "url": "https://arxiv.org/abs/2308.16380",
    "authors": [
      "Elmira Faraji Zonouz",
      "Xiao Pan",
      "Yu-Cheng Hsu",
      "Tony Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16381",
    "title": "Wasserstein Distributionally Robust Chance Constrained Trajectory  Optimization for Mobile Robots within Uncertain Safe Corridor",
    "abstract": "Safe corridor-based Trajectory Optimization (TO) presents an appealing approach for collision-free path planning of autonomous robots, offering global optimality through its convex formulation. The safe corridor is constructed based on the perceived map, however, the non-ideal perception induces uncertainty, which is rarely considered in trajectory generation. In this paper, we propose Distributionally Robust Safe Corridor Constraints (DRSCCs) to consider the uncertainty of the safe corridor. Then, we integrate DRSCCs into the trajectory optimization framework using Bernstein basis polynomials. Theoretically, we rigorously prove that the trajectory optimization problem incorporating DRSCCs is equivalent to a computationally efficient, convex quadratic program. Compared to the nominal TO, our method enhances navigation safety by significantly reducing the infeasible motions in presence of uncertainty. Moreover, the proposed approach is validated through two robotic applications, a micro Unmanned Aerial Vehicle (UAV) and a quadruped robot Unitree A1. ",
    "url": "https://arxiv.org/abs/2308.16381",
    "authors": [
      "Shaohang Xu",
      "Haolin Ruan",
      "Wentao Zhang",
      "Yian Wang",
      "Lijun Zhu",
      "Chin Pang Ho"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.16382",
    "title": "A stochastic block model for community detection in attributed networks",
    "abstract": "Community detection is an important content in complex network analysis. The existing community detection methods in attributed networks mostly focus on only using network structure, while the methods of integrating node attributes is mainly for the traditional community structures, and cannot detect multipartite structures and mixture structures in network. In addition, the model-based community detection methods currently proposed for attributed networks do not fully consider unique topology information of nodes, such as betweenness centrality and clustering coefficient. Therefore, a stochastic block model that integrates betweenness centrality and clustering coefficient of nodes for community detection in attributed networks, named BCSBM, is proposed in this paper. Different from other generative models for attributed networks, the generation process of links and attributes in BCSBM model follows the Poisson distribution, and the probability between community is considered based on the stochastic block model. Moreover, the betweenness centrality and clustering coefficient of nodes are introduced into the process of links and attributes generation. Finally, the expectation maximization algorithm is employed to estimate the parameters of the BCSBM model, and the node-community memberships is obtained through the hard division process, so the community detection is completed. By experimenting on six real-work networks containing different network structures, and comparing with the community detection results of five algorithms, the experimental results show that the BCSBM model not only inherits the advantages of the stochastic block model and can detect various network structures, but also has good data fitting ability due to introducing the betweenness centrality and clustering coefficient of nodes. Overall, the performance of this model is superior to other five compared algorithms. ",
    "url": "https://arxiv.org/abs/2308.16382",
    "authors": [
      "Xiao Wang",
      "Fang Dai",
      "Wenyan Guo",
      "Junfeng Wang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.16385",
    "title": "BenchTemp: A General Benchmark for Evaluating Temporal Graph Neural  Networks",
    "abstract": "To handle graphs in which features or connectivities are evolving over time, a series of temporal graph neural networks (TGNNs) have been proposed. Despite the success of these TGNNs, the previous TGNN evaluations reveal several limitations regarding four critical issues: 1) inconsistent datasets, 2) inconsistent evaluation pipelines, 3) lacking workload diversity, and 4) lacking efficient comparison. Overall, there lacks an empirical study that puts TGNN models onto the same ground and compares them comprehensively. To this end, we propose BenchTemp, a general benchmark for evaluating TGNN models on various workloads. BenchTemp provides a set of benchmark datasets so that different TGNN models can be fairly compared. Further, BenchTemp engineers a standard pipeline that unifies the TGNN evaluation. With BenchTemp, we extensively compare the representative TGNN models on different tasks (e.g., link prediction and node classification) and settings (transductive and inductive), w.r.t. both effectiveness and efficiency metrics. We have made BenchTemp publicly available at https://github.com/qianghuangwhu/benchtemp. ",
    "url": "https://arxiv.org/abs/2308.16385",
    "authors": [
      "Qiang Huang",
      "Jiawei Jiang",
      "Xi Susie Rao",
      "Ce Zhang",
      "Zhichao Han",
      "Zitao Zhang",
      "Xin Wang",
      "Yongjun He",
      "Quanqing Xu",
      "Yang Zhao",
      "Chuang Hu",
      "Shuo Shang",
      "Bo Du"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16391",
    "title": "Improving Robustness and Accuracy of Ponzi Scheme Detection on Ethereum  Using Time-Dependent Features",
    "abstract": "The rapid development of blockchain has led to more and more funding pouring into the cryptocurrency market, which also attracted cybercriminals' interest in recent years. The Ponzi scheme, an old-fashioned fraud, is now popular on the blockchain, causing considerable financial losses to many crypto-investors. A few Ponzi detection methods have been proposed in the literature, most of which detect a Ponzi scheme based on its smart contract source code or opcode. The contract-code-based approach, while achieving very high accuracy, is not robust: first, the source codes of a majority of contracts on Ethereum are not available, and second, a Ponzi developer can fool a contract-code-based detection model by obfuscating the opcode or inventing a new profit distribution logic that cannot be detected (since these models were trained on existing Ponzi logics only). A transaction-based approach could improve the robustness of detection because transactions, unlike smart contracts, are harder to be manipulated. However, the current transaction-based detection models achieve fairly low accuracy. We address this gap in the literature by developing new detection models that rely only on the transactions, hence guaranteeing the robustness, and moreover, achieve considerably higher Accuracy, Precision, Recall, and F1-score than existing transaction-based models. This is made possible thanks to the introduction of novel time-dependent features that capture Ponzi behaviours characteristics derived from our comprehensive data analyses on Ponzi and non-Ponzi data from the XBlock-ETH repository ",
    "url": "https://arxiv.org/abs/2308.16391",
    "authors": [
      "Phuong Duy Huynh",
      "Son Hoang Dau",
      "Xiaodong Li",
      "Phuc Luong",
      "Emanuele Viterbo"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)",
      "Statistical Finance (q-fin.ST)"
    ]
  },
  {
    "id": "arXiv:2308.16400",
    "title": "Channel Estimation for XL-MIMO Systems with Polar-Domain Multi-Scale  Residual Dense Network",
    "abstract": "Extremely large-scale multiple-input multiple-output (XL-MIMO) is a promising technique to enable versatile applications for future wireless communications.To realize the huge potential performance gain, accurate channel state information is a fundamental technical prerequisite. In conventional massive MIMO, the channel is often modeled by the far-field planar-wavefront with rich sparsity in the angular domain that facilitates the design of low-complexity channel estimation. However, this sparsity is not conspicuous in XL-MIMO systems due to the non-negligible near-field spherical-wavefront. To address the inherent performance loss of the angular-domain channel estimation schemes, we first propose the polar-domain multiple residual dense network (P-MRDN) for XL-MIMO systems based on the polar-domain sparsity of the near-field channel by improving the existing MRDN scheme. Furthermore, a polar-domain multi-scale residual dense network (P-MSRDN) is designed to improve the channel estimation accuracy. Finally, simulation results reveal the superior performance of the proposed schemes compared with existing benchmark schemes and the minimal influence of the channel sparsity on the proposed schemes. ",
    "url": "https://arxiv.org/abs/2308.16400",
    "authors": [
      "Hao Lei",
      "Jiayi Zhang",
      "Huahua Xiao",
      "Xiaodan Zhang",
      "Bo Ai",
      "Derrick Wing Kwan Ng"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.16403",
    "title": "Balancing between the Local and Global Structures (LGS) in Graph  Embedding",
    "abstract": "We present a method for balancing between the Local and Global Structures (LGS) in graph embedding, via a tunable parameter. Some embedding methods aim to capture global structures, while others attempt to preserve local neighborhoods. Few methods attempt to do both, and it is not always possible to capture well both local and global information in two dimensions, which is where most graph drawing live. The choice of using a local or a global embedding for visualization depends not only on the task but also on the structure of the underlying data, which may not be known in advance. For a given graph, LGS aims to find a good balance between the local and global structure to preserve. We evaluate the performance of LGS with synthetic and real-world datasets and our results indicate that it is competitive with the state-of-the-art methods, using established quality metrics such as stress and neighborhood preservation. We introduce a novel quality metric, cluster distance preservation, to assess intermediate structure capture. All source-code, datasets, experiments and analysis are available online. ",
    "url": "https://arxiv.org/abs/2308.16403",
    "authors": [
      "Jacob Miller",
      "Vahan Huroyan",
      "Stephen Kobourov"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computational Geometry (cs.CG)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16404",
    "title": "Deformation Robust Text Spotting with Geometric Prior",
    "abstract": "The goal of text spotting is to perform text detection and recognition in an end-to-end manner. Although the diversity of luminosity and orientation in scene texts has been widely studied, the font diversity and shape variance of the same character are ignored in recent works, since most characters in natural images are rendered in standard fonts. To solve this problem, we present a Chinese Artistic Dataset, termed as ARText, which contains 33,000 artistic images with rich shape deformation and font diversity. Based on this database, we develop a deformation robust text spotting method (DR TextSpotter) to solve the recognition problem of complex deformation of characters in different fonts. Specifically, we propose a geometric prior module to highlight the important features based on the unsupervised landmark detection sub-network. A graph convolution network is further constructed to fuse the character features and landmark features, and then performs semantic reasoning to enhance the discrimination for different characters. The experiments are conducted on ARText and IC19-ReCTS datasets. Our results demonstrate the effectiveness of our proposed method. ",
    "url": "https://arxiv.org/abs/2308.16404",
    "authors": [
      "Xixuan Hao",
      "Aozhong Zhang",
      "Xianze Meng",
      "Bin Fu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16406",
    "title": "CktGNN: Circuit Graph Neural Network for Electronic Design Automation",
    "abstract": "The electronic design automation of analog circuits has been a longstanding challenge in the integrated circuit field due to the huge design space and complex design trade-offs among circuit specifications. In the past decades, intensive research efforts have mostly been paid to automate the transistor sizing with a given circuit topology. By recognizing the graph nature of circuits, this paper presents a Circuit Graph Neural Network (CktGNN) that simultaneously automates the circuit topology generation and device sizing based on the encoder-dependent optimization subroutines. Particularly, CktGNN encodes circuit graphs using a two-level GNN framework (of nested GNN) where circuits are represented as combinations of subgraphs in a known subgraph basis. In this way, it significantly improves design efficiency by reducing the number of subgraphs to perform message passing. Nonetheless, another critical roadblock to advancing learning-assisted circuit design automation is a lack of public benchmarks to perform canonical assessment and reproducible research. To tackle the challenge, we introduce Open Circuit Benchmark (OCB), an open-sourced dataset that contains $10$K distinct operational amplifiers with carefully-extracted circuit specifications. OCB is also equipped with communicative circuit generation and evaluation capabilities such that it can help to generalize CktGNN to design various analog circuits by producing corresponding datasets. Experiments on OCB show the extraordinary advantages of CktGNN through representation-based optimization frameworks over other recent powerful GNN baselines and human experts' manual designs. Our work paves the way toward a learning-based open-sourced design automation for analog circuits. Our source code is available at \\url{https://github.com/zehao-dong/CktGNN}. ",
    "url": "https://arxiv.org/abs/2308.16406",
    "authors": [
      "Zehao Dong",
      "Weidong Cao",
      "Muhan Zhang",
      "Dacheng Tao",
      "Yixin Chen",
      "Xuan Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16418",
    "title": "End-Edge Coordinated Joint Encoding and Neural Enhancement for Low-Light  Video Analytics",
    "abstract": "In this paper, we investigate video analytics in low-light environments, and propose an end-edge coordinated system with joint video encoding and enhancement. It adaptively transmits low-light videos from cameras and performs enhancement and inference tasks at the edge. Firstly, according to our observations, both encoding and enhancement for low-light videos have a significant impact on inference accuracy, which directly influences bandwidth and computation overhead. Secondly, due to the limitation of built-in computation resources, cameras perform encoding and transmitting frames to the edge. The edge executes neural enhancement to process low contrast, detail loss, and color distortion on low-light videos before inference. Finally, an adaptive controller is designed at the edge to select quantization parameters and scales of neural enhancement networks, aiming to improve the inference accuracy and meet the latency requirements. Extensive real-world experiments demon-strate that, the proposed system can achieve a better trade-off between communication and computation resources and optimize the inference accuracy. ",
    "url": "https://arxiv.org/abs/2308.16418",
    "authors": [
      "Yuanyi He",
      "Peng Yang",
      "Tian Qin",
      "Ning Zhang"
    ],
    "subjectives": [
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2308.16421",
    "title": "Sequential Pitch Distributions for Raga Detection",
    "abstract": "Raga is a fundamental melodic concept in Indian Art Music (IAM). It is characterized by complex patterns. All performances and compositions are based on the raga framework. Raga and tonic detection have been a long-standing research problem in the field of Music Information Retrieval. In this paper, we attempt to detect the raga using a novel feature to extract sequential or temporal information from an audio sample. We call these Sequential Pitch Distributions (SPD), which are distributions taken over pitch values between two given pitch values over time. We also achieve state-of-the-art results on both Hindustani and Carnatic music raga data sets with an accuracy of 99% and 88.13%, respectively. SPD gives a great boost in accuracy over a standard pitch distribution. The main goal of this paper, however, is to present an alternative approach to modeling the temporal aspects of the melody and thereby deducing the raga. ",
    "url": "https://arxiv.org/abs/2308.16421",
    "authors": [
      "Vishwaas Narasinh",
      "Senthil Raja G"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2308.16425",
    "title": "On the Equivalence between Implicit and Explicit Neural Networks: A  High-dimensional Viewpoint",
    "abstract": "Implicit neural networks have demonstrated remarkable success in various tasks. However, there is a lack of theoretical analysis of the connections and differences between implicit and explicit networks. In this paper, we study high-dimensional implicit neural networks and provide the high dimensional equivalents for the corresponding conjugate kernels and neural tangent kernels. Built upon this, we establish the equivalence between implicit and explicit networks in high dimensions. ",
    "url": "https://arxiv.org/abs/2308.16425",
    "authors": [
      "Zenan Ling",
      "Zhenyu Liao",
      "Robert C. Qiu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.16429",
    "title": "Solving Poisson Problems in Polygonal Domains with Singularity Enriched  Physics Informed Neural Networks",
    "abstract": "Physics informed neural networks (PINNs) represent a very powerful class of numerical solvers for partial differential equations using deep neural networks, and have been successfully applied to many diverse problems. However, when applying the method to problems involving singularity, e.g., point sources or geometric singularities, the obtained approximations often have low accuracy, due to limited regularity of the exact solution. In this work, we investigate PINNs for solving Poisson equations in polygonal domains with geometric singularities and mixed boundary conditions. We propose a novel singularity enriched PINN (SEPINN), by explicitly incorporating the singularity behavior of the analytic solution, e.g., corner singularity, mixed boundary condition and edge singularities, into the ansatz space, and present a convergence analysis of the scheme. We present extensive numerical simulations in two and three-dimensions to illustrate the efficiency of the method, and also a comparative study with existing neural network based approaches. ",
    "url": "https://arxiv.org/abs/2308.16429",
    "authors": [
      "Tianhao Hu",
      "Bangti Jin",
      "Zhi Zhou"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2308.16437",
    "title": "AntM$^{2}$C: A Large Scale Dataset For Multi-Scenario Multi-Modal CTR  Prediction",
    "abstract": "Click-through rate (CTR) prediction is a crucial issue in recommendation systems. There has been an emergence of various public CTR datasets. However, existing datasets primarily suffer from the following limitations. Firstly, users generally click different types of items from multiple scenarios, and modeling from multiple scenarios can provide a more comprehensive understanding of users. Existing datasets only include data for the same type of items from a single scenario. Secondly, multi-modal features are essential in multi-scenario prediction as they address the issue of inconsistent ID encoding between different scenarios. The existing datasets are based on ID features and lack multi-modal features. Third, a large-scale dataset can provide a more reliable evaluation of models, fully reflecting the performance differences between models. The scale of existing datasets is around 100 million, which is relatively small compared to the real-world CTR prediction. To address these limitations, we propose AntM$^{2}$C, a Multi-Scenario Multi-Modal CTR dataset based on industrial data from Alipay. Specifically, AntM$^{2}$C provides the following advantages: 1) It covers CTR data of 5 different types of items, providing insights into the preferences of users for different items, including advertisements, vouchers, mini-programs, contents, and videos. 2) Apart from ID-based features, AntM$^{2}$C also provides 2 multi-modal features, raw text and image features, which can effectively establish connections between items with different IDs. 3) AntM$^{2}$C provides 1 billion CTR data with 200 features, including 200 million users and 6 million items. It is currently the largest-scale CTR dataset available. Based on AntM$^{2}$C, we construct several typical CTR tasks and provide comparisons with baseline methods. The dataset homepage is available at https://www.atecup.cn/home. ",
    "url": "https://arxiv.org/abs/2308.16437",
    "authors": [
      "Zhaoxin Huan",
      "Ke Ding",
      "Ang Li",
      "Xiaolu Zhang",
      "Xu Min",
      "Yong He",
      "Liang Zhang",
      "Jun Zhou",
      "Linjian Mo",
      "Jinjie Gu",
      "Zhongyi Liu",
      "Wenliang Zhong",
      "Guannan Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16441",
    "title": "Contrastive Representation Learning Based on Multiple Node-centered  Subgraphs",
    "abstract": "As the basic element of graph-structured data, node has been recognized as the main object of study in graph representation learning. A single node intuitively has multiple node-centered subgraphs from the whole graph (e.g., one person in a social network has multiple social circles based on his different relationships). We study this intuition under the framework of graph contrastive learning, and propose a multiple node-centered subgraphs contrastive representation learning method to learn node representation on graphs in a self-supervised way. Specifically, we carefully design a series of node-centered regional subgraphs of the central node. Then, the mutual information between different subgraphs of the same node is maximized by contrastive loss. Experiments on various real-world datasets and different downstream tasks demonstrate that our model has achieved state-of-the-art results. ",
    "url": "https://arxiv.org/abs/2308.16441",
    "authors": [
      "Dong Li",
      "Wenjun Wang",
      "Minglai Shao",
      "Chen Zhao"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16454",
    "title": "Adversarial Finetuning with Latent Representation Constraint to Mitigate  Accuracy-Robustness Tradeoff",
    "abstract": "This paper addresses the tradeoff between standard accuracy on clean examples and robustness against adversarial examples in deep neural networks (DNNs). Although adversarial training (AT) improves robustness, it degrades the standard accuracy, thus yielding the tradeoff. To mitigate this tradeoff, we propose a novel AT method called ARREST, which comprises three components: (i) adversarial finetuning (AFT), (ii) representation-guided knowledge distillation (RGKD), and (iii) noisy replay (NR). AFT trains a DNN on adversarial examples by initializing its parameters with a DNN that is standardly pretrained on clean examples. RGKD and NR respectively entail a regularization term and an algorithm to preserve latent representations of clean examples during AFT. RGKD penalizes the distance between the representations of the standardly pretrained and AFT DNNs. NR switches input adversarial examples to nonadversarial ones when the representation changes significantly during AFT. By combining these components, ARREST achieves both high standard accuracy and robustness. Experimental results demonstrate that ARREST mitigates the tradeoff more effectively than previous AT-based methods do. ",
    "url": "https://arxiv.org/abs/2308.16454",
    "authors": [
      "Satoshi Suzuki",
      "Shin'ya Yamaguchi",
      "Shoichiro Takeda",
      "Sekitoshi Kanai",
      "Naoki Makishima",
      "Atsushi Ando",
      "Ryo Masumura"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16458",
    "title": "BioCoder: A Benchmark for Bioinformatics Code Generation with Contextual  Pragmatic Knowledge",
    "abstract": "Pre-trained language models like ChatGPT have significantly improved code generation. As these models scale up, there is an increasing need for the output to handle more intricate tasks. Moreover, in bioinformatics, generating functional programs poses additional notable challenges due to the amount of domain knowledge, the need for complicated data operations, and intricate functional dependencies between the operations. Here, we present BioCoder, a benchmark developed to evaluate existing pre-trained models in generating bioinformatics code. In relation to function-code generation, BioCoder covers potential package dependencies, class declarations, and global variables. It incorporates 1026 functions and 1243 methods in Python and Java from GitHub and 253 examples from the Rosalind Project. BioCoder incorporates a fuzz-testing framework for evaluation, and we have applied it to evaluate many models including InCoder, CodeGen, CodeGen2, SantaCoder, StarCoder, StarCoder+, InstructCodeT5+, and ChatGPT. Our detailed analysis of these models emphasizes the importance of domain knowledge, pragmatic code generation, and contextual understanding. Our dataset, benchmark, Docker images, and scripts required for testing are all available at https://github.com/gersteinlab/biocoder. ",
    "url": "https://arxiv.org/abs/2308.16458",
    "authors": [
      "Xiangru Tang",
      "Bill Qian",
      "Rick Gao",
      "Jiakang Chen",
      "Xinyun Chen",
      "Mark Gerstein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.16461",
    "title": "Domain Adaptive Synapse Detection with Weak Point Annotations",
    "abstract": "The development of learning-based methods has greatly improved the detection of synapses from electron microscopy (EM) images. However, training a model for each dataset is time-consuming and requires extensive annotations. Additionally, it is difficult to apply a learned model to data from different brain regions due to variations in data distributions. In this paper, we present AdaSyn, a two-stage segmentation-based framework for domain adaptive synapse detection with weak point annotations. In the first stage, we address the detection problem by utilizing a segmentation-based pipeline to obtain synaptic instance masks. In the second stage, we improve model generalizability on target data by regenerating square masks to get high-quality pseudo labels. Benefiting from our high-accuracy detection results, we introduce the distance nearest principle to match paired pre-synapses and post-synapses. In the WASPSYN challenge at ISBI 2023, our method ranks the 1st place. ",
    "url": "https://arxiv.org/abs/2308.16461",
    "authors": [
      "Qi Chen",
      "Wei Huang",
      "Yueyi Zhang",
      "Zhiwei Xiong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16469",
    "title": "Link Prediction for Wikipedia Articles as a Natural Language Inference  Task",
    "abstract": "Link prediction task is vital to automatically understanding the structure of large knowledge bases. In this paper, we present our system to solve this task at the Data Science and Advanced Analytics 2023 Competition \"Efficient and Effective Link Prediction\" (DSAA-2023 Competition) with a corpus containing 948,233 training and 238,265 for public testing. This paper introduces an approach to link prediction in Wikipedia articles by formulating it as a natural language inference (NLI) task. Drawing inspiration from recent advancements in natural language processing and understanding, we cast link prediction as an NLI task, wherein the presence of a link between two articles is treated as a premise, and the task is to determine whether this premise holds based on the information presented in the articles. We implemented our system based on the Sentence Pair Classification for Link Prediction for the Wikipedia Articles task. Our system achieved 0.99996 Macro F1-score and 1.00000 Macro F1-score for the public and private test sets, respectively. Our team UIT-NLP ranked 3rd in performance on the private test set, equal to the scores of the first and second places. Our code is publicly for research purposes. ",
    "url": "https://arxiv.org/abs/2308.16469",
    "authors": [
      "Chau-Thang Phan",
      "Quoc-Nam Nguyen",
      "Kiet Van Nguyen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.16470",
    "title": "Domain-adaptive Message Passing Graph Neural Network",
    "abstract": "Cross-network node classification (CNNC), which aims to classify nodes in a label-deficient target network by transferring the knowledge from a source network with abundant labels, draws increasing attention recently. To address CNNC, we propose a domain-adaptive message passing graph neural network (DM-GNN), which integrates graph neural network (GNN) with conditional adversarial domain adaptation. DM-GNN is capable of learning informative representations for node classification that are also transferrable across networks. Firstly, a GNN encoder is constructed by dual feature extractors to separate ego-embedding learning from neighbor-embedding learning so as to jointly capture commonality and discrimination between connected nodes. Secondly, a label propagation node classifier is proposed to refine each node's label prediction by combining its own prediction and its neighbors' prediction. In addition, a label-aware propagation scheme is devised for the labeled source network to promote intra-class propagation while avoiding inter-class propagation, thus yielding label-discriminative source embeddings. Thirdly, conditional adversarial domain adaptation is performed to take the neighborhood-refined class-label information into account during adversarial domain adaptation, so that the class-conditional distributions across networks can be better matched. Comparisons with eleven state-of-the-art methods demonstrate the effectiveness of the proposed DM-GNN. ",
    "url": "https://arxiv.org/abs/2308.16470",
    "authors": [
      "Xiao Shen",
      "Shirui Pan",
      "Kup-Sze Choi",
      "Xi Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16510",
    "title": "Robust GAN inversion",
    "abstract": "Recent advancements in real image editing have been attributed to the exploration of Generative Adversarial Networks (GANs) latent space. However, the main challenge of this procedure is GAN inversion, which aims to map the image to the latent space accurately. Existing methods that work on extended latent space $W+$ are unable to achieve low distortion and high editability simultaneously. To address this issue, we propose an approach which works in native latent space $W$ and tunes the generator network to restore missing image details. We introduce a novel regularization strategy with learnable coefficients obtained by training randomized StyleGAN 2 model - WRanGAN. This method outperforms traditional approaches in terms of reconstruction quality and computational efficiency, achieving the lowest distortion with 4 times fewer parameters. Furthermore, we observe a slight improvement in the quality of constructing hyperplanes corresponding to binary image attributes. We demonstrate the effectiveness of our approach on two complex datasets: Flickr-Faces-HQ and LSUN Church. ",
    "url": "https://arxiv.org/abs/2308.16510",
    "authors": [
      "Egor Sevriugov",
      "Ivan Oseledets"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.16516",
    "title": "Curvature-based Pooling within Graph Neural Networks",
    "abstract": "Over-squashing and over-smoothing are two critical issues, that limit the capabilities of graph neural networks (GNNs). While over-smoothing eliminates the differences between nodes making them indistinguishable, over-squashing refers to the inability of GNNs to propagate information over long distances, as exponentially many node states are squashed into fixed-size representations. Both phenomena share similar causes, as both are largely induced by the graph topology. To mitigate these problems in graph classification tasks, we propose CurvPool, a novel pooling method. CurvPool exploits the notion of curvature of a graph to adaptively identify structures responsible for both over-smoothing and over-squashing. By clustering nodes based on the Balanced Forman curvature, CurvPool constructs a graph with a more suitable structure, allowing deeper models and the combination of distant information. We compare it to other state-of-the-art pooling approaches and establish its competitiveness in terms of classification accuracy, computational complexity, and flexibility. CurvPool outperforms several comparable methods across all considered tasks. The most consistent results are achieved by pooling densely connected clusters using the sum aggregation, as this allows additional information about the size of each pool. ",
    "url": "https://arxiv.org/abs/2308.16516",
    "authors": [
      "Cedric Sanders",
      "Andreas Roth",
      "Thomas Liebig"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16518",
    "title": "MS23D: A 3D Object Detection Method Using Multi-Scale Semantic Feature  Points to Construct 3D Feature Layers",
    "abstract": "Lidar point clouds, as a type of data with accurate distance perception, can effectively represent the motion and posture of objects in three-dimensional space. However, the sparsity and disorderliness of point clouds make it challenging to extract features directly from them. Many studies have addressed this issue by transforming point clouds into regular voxel representations. However, these methods often lead to the loss of fine-grained local feature information due to downsampling. Moreover, the sparsity of point clouds poses difficulties in efficiently aggregating features in 3D feature layers using voxel-based two-stage methods. To address these issues, this paper proposes a two-stage 3D detection framework called MS$^{2}$3D. In MS$^{2}$3D, we utilize small-sized voxels to extract fine-grained local features and large-sized voxels to capture long-range local features. Additionally, we propose a method for constructing 3D feature layers using multi-scale semantic feature points, enabling the transformation of sparse 3D feature layers into more compact representations. Furthermore, we compute the offset between feature points in the 3D feature layers and the centroid of objects, aiming to bring them as close as possible to the object's center. It significantly enhances the efficiency of feature aggregation. To validate the effectiveness of our method, we evaluated our method on the KITTI dataset and ONCE dataset together. ",
    "url": "https://arxiv.org/abs/2308.16518",
    "authors": [
      "Yongxin Shao",
      "Aihong Tan",
      "Tianhong Yan",
      "Zhetao Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16527",
    "title": "Unsupervised Recognition of Unknown Objects for Open-World Object  Detection",
    "abstract": "Open-World Object Detection (OWOD) extends object detection problem to a realistic and dynamic scenario, where a detection model is required to be capable of detecting both known and unknown objects and incrementally learning newly introduced knowledge. Current OWOD models, such as ORE and OW-DETR, focus on pseudo-labeling regions with high objectness scores as unknowns, whose performance relies heavily on the supervision of known objects. While they can detect the unknowns that exhibit similar features to the known objects, they suffer from a severe label bias problem that they tend to detect all regions (including unknown object regions) that are dissimilar to the known objects as part of the background. To eliminate the label bias, this paper proposes a novel approach that learns an unsupervised discriminative model to recognize true unknown objects from raw pseudo labels generated by unsupervised region proposal methods. The resulting model can be further refined by a classification-free self-training method which iteratively extends pseudo unknown objects to the unlabeled regions. Experimental results show that our method 1) significantly outperforms the prior SOTA in detecting unknown objects while maintaining competitive performance of detecting known object classes on the MS COCO dataset, and 2) achieves better generalization ability on the LVIS and Objects365 datasets. ",
    "url": "https://arxiv.org/abs/2308.16527",
    "authors": [
      "Ruohuan Fang",
      "Guansong Pang",
      "Lei Zhou",
      "Xiao Bai",
      "Jin Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16529",
    "title": "Developing Social Robots with Empathetic Non-Verbal Cues Using Large  Language Models",
    "abstract": "We propose augmenting the empathetic capacities of social robots by integrating non-verbal cues. Our primary contribution is the design and labeling of four types of empathetic non-verbal cues, abbreviated as SAFE: Speech, Action (gesture), Facial expression, and Emotion, in a social robot. These cues are generated using a Large Language Model (LLM). We developed an LLM-based conversational system for the robot and assessed its alignment with social cues as defined by human counselors. Preliminary results show distinct patterns in the robot's responses, such as a preference for calm and positive social emotions like 'joy' and 'lively', and frequent nodding gestures. Despite these tendencies, our approach has led to the development of a social robot capable of context-aware and more authentic interactions. Our work lays the groundwork for future studies on human-robot interactions, emphasizing the essential role of both verbal and non-verbal cues in creating social and empathetic robots. ",
    "url": "https://arxiv.org/abs/2308.16529",
    "authors": [
      "Yoon Kyung Lee",
      "Yoonwon Jung",
      "Gyuyi Kang",
      "Sowon Hahn"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.16549",
    "title": "Thesis Distillation: Investigating The Impact of Bias in NLP Models on  Hate Speech Detection",
    "abstract": "This paper is a summary of the work in my PhD thesis. In which, I investigate the impact of bias in NLP models on the task of hate speech detection from three perspectives: explainability, offensive stereotyping bias, and fairness. I discuss the main takeaways from my thesis and how they can benefit the broader NLP community. Finally, I discuss important future research directions. The findings of my thesis suggest that bias in NLP models impacts the task of hate speech detection from all three perspectives. And that unless we start incorporating social sciences in studying bias in NLP models, we will not effectively overcome the current limitations of measuring and mitigating bias in NLP models. ",
    "url": "https://arxiv.org/abs/2308.16549",
    "authors": [
      "Fatma Elsafoury"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.16562",
    "title": "The Power of MEME: Adversarial Malware Creation with Model-Based  Reinforcement Learning",
    "abstract": "Due to the proliferation of malware, defenders are increasingly turning to automation and machine learning as part of the malware detection tool-chain. However, machine learning models are susceptible to adversarial attacks, requiring the testing of model and product robustness. Meanwhile, attackers also seek to automate malware generation and evasion of antivirus systems, and defenders try to gain insight into their methods. This work proposes a new algorithm that combines Malware Evasion and Model Extraction (MEME) attacks. MEME uses model-based reinforcement learning to adversarially modify Windows executable binary samples while simultaneously training a surrogate model with a high agreement with the target model to evade. To evaluate this method, we compare it with two state-of-the-art attacks in adversarial malware creation, using three well-known published models and one antivirus product as targets. Results show that MEME outperforms the state-of-the-art methods in terms of evasion capabilities in almost all cases, producing evasive malware with an evasion rate in the range of 32-73%. It also produces surrogate models with a prediction label agreement with the respective target models between 97-99%. The surrogate could be used to fine-tune and improve the evasion rate in the future. ",
    "url": "https://arxiv.org/abs/2308.16562",
    "authors": [
      "Maria Rigaki",
      "Sebastian Garcia"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16570",
    "title": "MONDEO: Multistage Botnet Detection",
    "abstract": "Mobile devices have widespread to become the most used piece of technology. Due to their characteristics, they have become major targets for botnet-related malware. FluBot is one example of botnet malware that infects mobile devices. In particular, FluBot is a DNS-based botnet that uses Domain Generation Algorithms (DGA) to establish communication with the Command and Control Server (C2). MONDEO is a multistage mechanism with a flexible design to detect DNS-based botnet malware. MONDEO is lightweight and can be deployed without requiring the deployment of software, agents, or configuration in mobile devices, allowing easy integration in core networks. MONDEO comprises four detection stages: Blacklisting/Whitelisting, Query rate analysis, DGA analysis, and Machine learning evaluation. It was created with the goal of processing streams of packets to identify attacks with high efficiency, in the distinct phases. MONDEO was tested against several datasets to measure its efficiency and performance, being able to achieve high performance with RandomForest classifiers. The implementation is available at github. ",
    "url": "https://arxiv.org/abs/2308.16570",
    "authors": [
      "Duarte Dias",
      "Bruno Sousa",
      "Nuno Antunes"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16577",
    "title": "Improving Mandarin Prosodic Structure Prediction with Multi-level  Contextual Information",
    "abstract": "For text-to-speech (TTS) synthesis, prosodic structure prediction (PSP) plays an important role in producing natural and intelligible speech. Although inter-utterance linguistic information can influence the speech interpretation of the target utterance, previous works on PSP mainly focus on utilizing intrautterance linguistic information of the current utterance only. This work proposes to use inter-utterance linguistic information to improve the performance of PSP. Multi-level contextual information, which includes both inter-utterance and intrautterance linguistic information, is extracted by a hierarchical encoder from character level, utterance level and discourse level of the input text. Then a multi-task learning (MTL) decoder predicts prosodic boundaries from multi-level contextual information. Objective evaluation results on two datasets show that our method achieves better F1 scores in predicting prosodic word (PW), prosodic phrase (PPH) and intonational phrase (IPH). It demonstrates the effectiveness of using multi-level contextual information for PSP. Subjective preference tests also indicate the naturalness of synthesized speeches are improved. ",
    "url": "https://arxiv.org/abs/2308.16577",
    "authors": [
      "Jie Chen",
      "Changhe Song",
      "Deyi Tuo",
      "Xixin Wu",
      "Shiyin Kang",
      "Zhiyong Wu",
      "Helen Meng"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2308.16599",
    "title": "A Causal Discovery Approach To Learn How Urban Form Shapes Sustainable  Mobility Across Continents",
    "abstract": "Global sustainability requires low-carbon urban transport systems, shaped by adequate infrastructure, deployment of low-carbon transport modes and shifts in travel behavior. To adequately implement alterations in infrastructure, it's essential to grasp the location-specific cause-and-effect mechanisms that the constructed environment has on travel. Yet, current research falls short in representing causal relationships between the 6D urban form variables and travel, generalizing across different regions, and modeling urban form effects at high spatial resolution. Here, we address all three gaps by utilizing a causal discovery and an explainable machine learning framework to detect urban form effects on intra-city travel based on high-resolution mobility data of six cities across three continents. We show that both distance to city center, demographics and density indirectly affect other urban form features. By considering the causal relationships, we find that location-specific influences align across cities, yet vary in magnitude. In addition, the spread of the city and the coverage of jobs across the city are the strongest determinants of travel-related emissions, highlighting the benefits of compact development and associated benefits. Differences in urban form effects across the cities call for a more holistic definition of 6D measures. Our work is a starting point for location-specific analysis of urban form effects on mobility behavior using causal discovery approaches, which is highly relevant for city planners and municipalities across continents. ",
    "url": "https://arxiv.org/abs/2308.16599",
    "authors": [
      "Felix Wagner",
      "Florian Nachtigall",
      "Lukas Franken",
      "Nikola Milojevic-Dupont",
      "Rafael H.M. Pereira",
      "Nicolas Koch",
      "Jakob Runge",
      "Marta Gonzalez",
      "Felix Creutzig"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2308.16609",
    "title": "Towards Long-Tailed Recognition for Graph Classification via  Collaborative Experts",
    "abstract": "Graph classification, aiming at learning the graph-level representations for effective class assignments, has received outstanding achievements, which heavily relies on high-quality datasets that have balanced class distribution. In fact, most real-world graph data naturally presents a long-tailed form, where the head classes occupy much more samples than the tail classes, it thus is essential to study the graph-level classification over long-tailed data while still remaining largely unexplored. However, most existing long-tailed learning methods in visions fail to jointly optimize the representation learning and classifier training, as well as neglect the mining of the hard-to-classify classes. Directly applying existing methods to graphs may lead to sub-optimal performance, since the model trained on graphs would be more sensitive to the long-tailed distribution due to the complex topological characteristics. Hence, in this paper, we propose a novel long-tailed graph-level classification framework via Collaborative Multi-expert Learning (CoMe) to tackle the problem. To equilibrate the contributions of head and tail classes, we first develop balanced contrastive learning from the view of representation learning, and then design an individual-expert classifier training based on hard class mining. In addition, we execute gated fusion and disentangled knowledge distillation among the multiple experts to promote the collaboration in a multi-expert framework. Comprehensive experiments are performed on seven widely-used benchmark datasets to demonstrate the superiority of our method CoMe over state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2308.16609",
    "authors": [
      "Siyu Yi",
      "Zhengyang Mao",
      "Wei Ju",
      "Yongdao Zhou",
      "Luchen Liu",
      "Xiao Luo",
      "Ming Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2308.16612",
    "title": "Neural Gradient Regularizer",
    "abstract": "Owing to its significant success, the prior imposed on gradient maps has consistently been a subject of great interest in the field of image processing. Total variation (TV), one of the most representative regularizers, is known for its ability to capture the sparsity of gradient maps. Nonetheless, TV and its variants often underestimate the gradient maps, leading to the weakening of edges and details whose gradients should not be zero in the original image. Recently, total deep variation (TDV) has been introduced, assuming the sparsity of feature maps, which provides a flexible regularization learned from large-scale datasets for a specific task. However, TDV requires retraining when the image or task changes, limiting its versatility. In this paper, we propose a neural gradient regularizer (NGR) that expresses the gradient map as the output of a neural network. Unlike existing methods, NGR does not rely on the sparsity assumption, thereby avoiding the underestimation of gradient maps. NGR is applicable to various image types and different image processing tasks, functioning in a zero-shot learning fashion, making it a versatile and plug-and-play regularizer. Extensive experimental results demonstrate the superior performance of NGR over state-of-the-art counterparts for a range of different tasks, further validating its effectiveness and versatility. ",
    "url": "https://arxiv.org/abs/2308.16612",
    "authors": [
      "Shuang Xu",
      "Yifan Wang",
      "Zixiang Zhao",
      "Jiangjun Peng",
      "Xiangyong Cao",
      "Deyu Meng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.16615",
    "title": "High Accuracy Location Information Extraction from Social Network Texts  Using Natural Language Processing",
    "abstract": "Terrorism has become a worldwide plague with severe consequences for the development of nations. Besides killing innocent people daily and preventing educational activities from taking place, terrorism is also hindering economic growth. Machine Learning (ML) and Natural Language Processing (NLP) can contribute to fighting terrorism by predicting in real-time future terrorist attacks if accurate data is available. This paper is part of a research project that uses text from social networks to extract necessary information to build an adequate dataset for terrorist attack prediction. We collected a set of 3000 social network texts about terrorism in Burkina Faso and used a subset to experiment with existing NLP solutions. The experiment reveals that existing solutions have poor accuracy for location recognition, which our solution resolves. We will extend the solution to extract dates and action information to achieve the project's goal. ",
    "url": "https://arxiv.org/abs/2308.16615",
    "authors": [
      "Lossan Bonde",
      "Severin Dembele"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16622",
    "title": "Developing a Scalable Benchmark for Assessing Large Language Models in  Knowledge Graph Engineering",
    "abstract": "As the field of Large Language Models (LLMs) evolves at an accelerated pace, the critical need to assess and monitor their performance emerges. We introduce a benchmarking framework focused on knowledge graph engineering (KGE) accompanied by three challenges addressing syntax and error correction, facts extraction and dataset generation. We show that while being a useful tool, LLMs are yet unfit to assist in knowledge graph generation with zero-shot prompting. Consequently, our LLM-KG-Bench framework provides automatic evaluation and storage of LLM responses as well as statistical data and visualization tools to support tracking of prompt engineering and model performance. ",
    "url": "https://arxiv.org/abs/2308.16622",
    "authors": [
      "Lars-Peter Meyer",
      "Johannes Frey",
      "Kurt Junghanns",
      "Felix Brei",
      "Kirill Bulert",
      "Sabine Gründer-Fahrer",
      "Michael Martin"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2308.16632",
    "title": "3D-STMN: Dependency-Driven Superpoint-Text Matching Network for  End-to-End 3D Referring Expression Segmentation",
    "abstract": "In 3D Referring Expression Segmentation (3D-RES), the earlier approach adopts a two-stage paradigm, extracting segmentation proposals and then matching them with referring expressions. However, this conventional paradigm encounters significant challenges, most notably in terms of the generation of lackluster initial proposals and a pronounced deceleration in inference speed. Recognizing these limitations, we introduce an innovative end-to-end Superpoint-Text Matching Network (3D-STMN) that is enriched by dependency-driven insights. One of the keystones of our model is the Superpoint-Text Matching (STM) mechanism. Unlike traditional methods that navigate through instance proposals, STM directly correlates linguistic indications with their respective superpoints, clusters of semantically related points. This architectural decision empowers our model to efficiently harness cross-modal semantic relationships, primarily leveraging densely annotated superpoint-text pairs, as opposed to the more sparse instance-text pairs. In pursuit of enhancing the role of text in guiding the segmentation process, we further incorporate the Dependency-Driven Interaction (DDI) module to deepen the network's semantic comprehension of referring expressions. Using the dependency trees as a beacon, this module discerns the intricate relationships between primary terms and their associated descriptors in expressions, thereby elevating both the localization and segmentation capacities of our model. Comprehensive experiments on the ScanRefer benchmark reveal that our model not only set new performance standards, registering an mIoU gain of 11.7 points but also achieve a staggering enhancement in inference speed, surpassing traditional methods by 95.7 times. The code and models are available at https://github.com/sosppxo/3D-STMN. ",
    "url": "https://arxiv.org/abs/2308.16632",
    "authors": [
      "Changli Wu",
      "Yiwei Ma",
      "Qi Chen",
      "Haowei Wang",
      "Gen Luo",
      "Jiayi Ji",
      "Xiaoshuai Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16639",
    "title": "Security Allocation in Networked Control Systems under Stealthy Attacks",
    "abstract": "This paper considers the problem of security allocation in a networked control system under stealthy attacks in which the system is comprised of interconnected subsystems represented by vertices. A malicious adversary selects a single vertex on which to conduct a stealthy data injection attack to maximally disrupt the local performance while remaining undetected. On the other hand, a defender selects several vertices on which to allocate defense resources against the adversary. First, the objectives of the adversary and the defender with uncertain targets are formulated in probabilistic ways, resulting in an expected worst-case impact of stealthy attacks. Next, we provide a graph-theoretic necessary and sufficient condition under which the cost for the defender and the expected worst-case impact of stealthy attacks are bounded. This condition enables the defender to restrict the admissible actions to a subset of available vertex sets. Then, we cast the problem of security allocation in a Stackelberg game-theoretic framework. Finally, the contribution of this paper is highlighted by utilizing the proposed admissible actions of the defender in the context of large-scale networks. A numerical example of a 50-vertex networked control system is presented to validate the obtained results. ",
    "url": "https://arxiv.org/abs/2308.16639",
    "authors": [
      "Anh Tung Nguyen",
      "André M. H. Teixeira",
      "Alexander Medvedev"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.16665",
    "title": "Fault Injection on Embedded Neural Networks: Impact of a Single  Instruction Skip",
    "abstract": "With the large-scale integration and use of neural network models, especially in critical embedded systems, their security assessment to guarantee their reliability is becoming an urgent need. More particularly, models deployed in embedded platforms, such as 32-bit microcontrollers, are physically accessible by adversaries and therefore vulnerable to hardware disturbances. We present the first set of experiments on the use of two fault injection means, electromagnetic and laser injections, applied on neural networks models embedded on a Cortex M4 32-bit microcontroller platform. Contrary to most of state-of-the-art works dedicated to the alteration of the internal parameters or input values, our goal is to simulate and experimentally demonstrate the impact of a specific fault model that is instruction skip. For that purpose, we assessed several modification attacks on the control flow of a neural network inference. We reveal integrity threats by targeting several steps in the inference program of typical convolutional neural network models, which may be exploited by an attacker to alter the predictions of the target models with different adversarial goals. ",
    "url": "https://arxiv.org/abs/2308.16665",
    "authors": [
      "Clement Gaine",
      "Pierre-Alain Moellic",
      "Olivier Potin",
      "Jean-Max Dutertre"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16684",
    "title": "Everyone Can Attack: Repurpose Lossy Compression as a Natural Backdoor  Attack",
    "abstract": "The vulnerabilities to backdoor attacks have recently threatened the trustworthiness of machine learning models in practical applications. Conventional wisdom suggests that not everyone can be an attacker since the process of designing the trigger generation algorithm often involves significant effort and extensive experimentation to ensure the attack's stealthiness and effectiveness. Alternatively, this paper shows that there exists a more severe backdoor threat: anyone can exploit an easily-accessible algorithm for silent backdoor attacks. Specifically, this attacker can employ the widely-used lossy image compression from a plethora of compression tools to effortlessly inject a trigger pattern into an image without leaving any noticeable trace; i.e., the generated triggers are natural artifacts. One does not require extensive knowledge to click on the \"convert\" or \"save as\" button while using tools for lossy image compression. Via this attack, the adversary does not need to design a trigger generator as seen in prior works and only requires poisoning the data. Empirically, the proposed attack consistently achieves 100% attack success rate in several benchmark datasets such as MNIST, CIFAR-10, GTSRB and CelebA. More significantly, the proposed attack can still achieve almost 100% attack success rate with very small (approximately 10%) poisoning rates in the clean label setting. The generated trigger of the proposed attack using one lossy compression algorithm is also transferable across other related compression algorithms, exacerbating the severity of this backdoor threat. This work takes another crucial step toward understanding the extensive risks of backdoor attacks in practice, urging practitioners to investigate similar attacks and relevant backdoor mitigation methods. ",
    "url": "https://arxiv.org/abs/2308.16684",
    "authors": [
      "Sze Jue Yang",
      "Quang Nguyen",
      "Chee Seng Chan",
      "Khoa Doan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16689",
    "title": "ViLTA: Enhancing Vision-Language Pre-training through Textual  Augmentation",
    "abstract": "Vision-language pre-training (VLP) methods are blossoming recently, and its crucial goal is to jointly learn visual and textual features via a transformer-based architecture, demonstrating promising improvements on a variety of vision-language tasks. Prior arts usually focus on how to align visual and textual features, but strategies for improving the robustness of model and speeding up model convergence are left insufficiently explored. In this paper, we propose a novel method ViLTA, comprising of two components to further facilitate the model to learn fine-grained representations among image-text pairs. For Masked Language Modeling (MLM), we propose a cross-distillation method to generate soft labels to enhance the robustness of model, which alleviates the problem of treating synonyms of masked words as negative samples in one-hot labels. For Image-Text Matching (ITM), we leverage the current language encoder to synthesize hard negatives based on the context of language input, encouraging the model to learn high-quality representations by increasing the difficulty of the ITM task. By leveraging the above techniques, our ViLTA can achieve better performance on various vision-language tasks. Extensive experiments on benchmark datasets demonstrate that the effectiveness of ViLTA and its promising potential for vision-language pre-training. ",
    "url": "https://arxiv.org/abs/2308.16689",
    "authors": [
      "Weihan Wang",
      "Zhen Yang",
      "Bin Xu",
      "Juanzi Li",
      "Yankui Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16700",
    "title": "Exact and Efficient Bayesian Inference for Privacy Risk Quantification  (Extended Version)",
    "abstract": "Data analysis has high value both for commercial and research purposes. However, disclosing analysis results may pose severe privacy risk to individuals. Privug is a method to quantify privacy risks of data analytics programs by analyzing their source code. The method uses probability distributions to model attacker knowledge and Bayesian inference to update said knowledge based on observable outputs. Currently, Privug uses Markov Chain Monte Carlo (MCMC) to perform inference, which is a flexible but approximate solution. This paper presents an exact Bayesian inference engine based on multivariate Gaussian distributions to accurately and efficiently quantify privacy risks. The inference engine is implemented for a subset of Python programs that can be modeled as multivariate Gaussian models. We evaluate the method by analyzing privacy risks in programs to release public statistics. The evaluation shows that our method accurately and efficiently analyzes privacy risks, and outperforms existing methods. Furthermore, we demonstrate the use of our engine to analyze the effect of differential privacy in public statistics. ",
    "url": "https://arxiv.org/abs/2308.16700",
    "authors": [
      "Rasmus C. Rønneberg",
      "Raúl Pardo",
      "Andrzej Wąsowski"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.16703",
    "title": "Fault Injection and Safe-Error Attack for Extraction of Embedded Neural  Network Models",
    "abstract": "Model extraction emerges as a critical security threat with attack vectors exploiting both algorithmic and implementation-based approaches. The main goal of an attacker is to steal as much information as possible about a protected victim model, so that he can mimic it with a substitute model, even with a limited access to similar training data. Recently, physical attacks such as fault injection have shown worrying efficiency against the integrity and confidentiality of embedded models. We focus on embedded deep neural network models on 32-bit microcontrollers, a widespread family of hardware platforms in IoT, and the use of a standard fault injection strategy - Safe Error Attack (SEA) - to perform a model extraction attack with an adversary having a limited access to training data. Since the attack strongly depends on the input queries, we propose a black-box approach to craft a successful attack set. For a classical convolutional neural network, we successfully recover at least 90% of the most significant bits with about 1500 crafted inputs. These information enable to efficiently train a substitute model, with only 8% of the training dataset, that reaches high fidelity and near identical accuracy level than the victim model. ",
    "url": "https://arxiv.org/abs/2308.16703",
    "authors": [
      "Kevin Hector",
      "Pierre-Alain Moellic",
      "Mathieu Dumont",
      "Jean-Max Dutertre"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16707",
    "title": "Causal Analysis of First-Year Course Approval Delays in an Engineering  Major Through Inference Techniques",
    "abstract": "The study addresses the problem of delays in the approval of first-year courses in the Civil Engineering Major at the National University of Tucum\\'an, Argentina. Students take an average of 5 years to pass these subjects. Using the DoWhy and Causal Discovery Toolbox tools, we looked to identify the underlying causes of these delays. The analysis revealed that the regulatory structure of the program and the evaluation methods play a crucial role in this delay. Specifically, the accumulation of regular subjects without passing a final exam was identified as a key factor. These findings can guide interventions to improve student success rates and the effectiveness of the education system in general. ",
    "url": "https://arxiv.org/abs/2308.16707",
    "authors": [
      "Hugo Roger Paz"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2308.16718",
    "title": "Robust Representation Learning for Unreliable Partial Label Learning",
    "abstract": "Partial Label Learning (PLL) is a type of weakly supervised learning where each training instance is assigned a set of candidate labels, but only one label is the ground-truth. However, this idealistic assumption may not always hold due to potential annotation inaccuracies, meaning the ground-truth may not be present in the candidate label set. This is known as Unreliable Partial Label Learning (UPLL) that introduces an additional complexity due to the inherent unreliability and ambiguity of partial labels, often resulting in a sub-optimal performance with existing methods. To address this challenge, we propose the Unreliability-Robust Representation Learning framework (URRL) that leverages unreliability-robust contrastive learning to help the model fortify against unreliable partial labels effectively. Concurrently, we propose a dual strategy that combines KNN-based candidate label set correction and consistency-regularization-based label disambiguation to refine label quality and enhance the ability of representation learning within the URRL framework. Extensive experiments demonstrate that the proposed method outperforms state-of-the-art PLL methods on various datasets with diverse degrees of unreliability and ambiguity. Furthermore, we provide a theoretical analysis of our approach from the perspective of the expectation maximization (EM) algorithm. Upon acceptance, we pledge to make the code publicly accessible. ",
    "url": "https://arxiv.org/abs/2308.16718",
    "authors": [
      "Yu Shi",
      "Dong-Dong Wu",
      "Xin Geng",
      "Min-Ling Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16729",
    "title": "JavaScript Dead Code Identification, Elimination, and Empirical  Assessment",
    "abstract": "Web apps are built by using a combination of HTML, CSS, and JavaScript. While building modern web apps, it is common practice to make use of third-party libraries and frameworks, as to improve developers' productivity and code quality. Alongside these benefits, the adoption of such libraries results in the introduction of JavaScript dead code, i.e., code implementing unused functionalities. The costs for downloading and parsing dead code can negatively contribute to the loading time and resource usage of web apps. The goal of our study is two-fold. First, we present Lacuna, an approach for automatically detecting and eliminating JavaScript dead code from web apps. The proposed approach supports both static and dynamic analyses, it is extensible and can be applied to any JavaScript code base, without imposing constraints on the coding style or on the use of specific JavaScript constructs. Secondly, by leveraging Lacuna we conduct an experiment to empirically evaluate the run-time overhead of JavaScript dead code in terms of energy consumption, performance, network usage, and resource usage in the context of mobile web apps. We applied Lacuna four times on 30 mobile web apps independently developed by third-party developers, each time eliminating dead code according to a different optimization level provided by Lacuna. Afterward, each different version of the web app is executed on an Android device, while collecting measures to assess the potential run-time overhead caused by dead code. Experimental results, among others, highlight that the removal of JavaScript dead code has a positive impact on the loading time of mobile web apps, while significantly reducing the number of bytes transferred over the network. ",
    "url": "https://arxiv.org/abs/2308.16729",
    "authors": [
      "Ivano Malavolta",
      "Kishan Nirghin",
      "Gian Luca Scoccia",
      "Simone Romano",
      "Salvatore Lombardi",
      "Giuseppe Scanniello",
      "Patricia Lago"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.16737",
    "title": "Robust Networked Federated Learning for Localization",
    "abstract": "This paper addresses the problem of localization, which is inherently non-convex and non-smooth in a federated setting where the data is distributed across a multitude of devices. Due to the decentralized nature of federated environments, distributed learning becomes essential for scalability and adaptability. Moreover, these environments are often plagued by outlier data, which presents substantial challenges to conventional methods, particularly in maintaining estimation accuracy and ensuring algorithm convergence. To mitigate these challenges, we propose a method that adopts an $L_1$-norm robust formulation within a distributed sub-gradient framework, explicitly designed to handle these obstacles. Our approach addresses the problem in its original form, without resorting to iterative simplifications or approximations, resulting in enhanced computational efficiency and improved estimation accuracy. We demonstrate that our method converges to a stationary point, highlighting its effectiveness and reliability. Through numerical simulations, we confirm the superior performance of our approach, notably in outlier-rich environments, which surpasses existing state-of-the-art localization methods. ",
    "url": "https://arxiv.org/abs/2308.16737",
    "authors": [
      "Reza Mirzaeifard",
      "Naveen K. D. Venkategowda",
      "Stefan Werner"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16744",
    "title": "MS-BioGraphs: Sequence Similarity Graph Datasets",
    "abstract": "Progress in High-Performance Computing in general, and High-Performance Graph Processing in particular, is highly dependent on the availability of publicly-accessible, relevant, and realistic data sets. To ensure continuation of this progress, we (i) investigate and optimize the process of generating large sequence similarity graphs as an HPC challenge and (ii) demonstrate this process in creating MS-BioGraphs, a new family of publicly available real-world edge-weighted graph datasets with up to $2.5$ trillion edges, that is, $6.6$ times greater than the largest graph published recently. The largest graph is created by matching (i.e., all-to-all similarity aligning) $1.7$ billion protein sequences. The MS-BioGraphs family includes also seven subgraphs with different sizes and direction types. We describe two main challenges we faced in generating large graph datasets and our solutions, that are, (i) optimizing data structures and algorithms for this multi-step process and (ii) WebGraph parallel compression technique. We present a comparative study of structural characteristics of MS-BioGraphs. The datasets are available online on https://blogs.qub.ac.uk/DIPSA/MS-BioGraphs . ",
    "url": "https://arxiv.org/abs/2308.16744",
    "authors": [
      "Mohsen Koohi Esfahani",
      "Paolo Boldi",
      "Hans Vandierendonck",
      "Peter Kilpatrick",
      "Sebastiano Vigna"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Hardware Architecture (cs.AR)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Discrete Mathematics (cs.DM)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2308.16763",
    "title": "Ladder-of-Thought: Using Knowledge as Steps to Elevate Stance Detection",
    "abstract": "Chain-of-Thought Prompting (CoT) reinforces the reasoning capabilities of Large Language Models (LLMs) through the generation of intermediate rationales. However, these enhancements predominantly benefit large-scale models, leaving small LMs without significant performance improvements when directly applying CoT. Despite the advanced reasoning capabilities of LLMs, CoT relies primarily on their pre-trained internal knowledge. The external knowledge that is previously unknown to the model remains unexploited. This omission becomes pronounced in tasks such as stance detection, where the external background knowledge plays a pivotal role. Additionally, the large-scale architecture of LLMs inevitably present efficiency challenges during deployment. To address these challenges, we introduce the Ladder-of-Thought (LoT) for stance detection. Grounded in a dual-phase Cascaded Optimization framework, LoT directs the model to incorporate high-quality external knowledge, enhancing the intermediate rationales it generates. These bolstered rationales subsequently serve as the foundation for more precise predictions - akin to how a ladder facilitates reaching elevated goals. LoT achieves a balance between efficiency and accuracy, making it an adaptable and efficient framework for stance detection. Our empirical evaluations underscore LoT's effectiveness, marking a 16% improvement over ChatGPT and a 10% enhancement compared to ChatGPT with CoT. ",
    "url": "https://arxiv.org/abs/2308.16763",
    "authors": [
      "Kairui Hu",
      "Ming Yan",
      "Joey Tianyi Zhou",
      "Ivor W. Tsang",
      "Wen Haw Chong",
      "Yong Keong Yap"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16775",
    "title": "Efficacy of Neural Prediction-Based NAS for Zero-Shot NAS Paradigm",
    "abstract": "In prediction-based Neural Architecture Search (NAS), performance indicators derived from graph convolutional networks have shown significant success. These indicators, achieved by representing feed-forward structures as component graphs through one-hot encoding, face a limitation: their inability to evaluate architecture performance across varying search spaces. In contrast, handcrafted performance indicators (zero-shot NAS), which use the same architecture with random initialization, can generalize across multiple search spaces. Addressing this limitation, we propose a novel approach for zero-shot NAS using deep learning. Our method employs Fourier sum of sines encoding for convolutional kernels, enabling the construction of a computational feed-forward graph with a structure similar to the architecture under evaluation. These encodings are learnable and offer a comprehensive view of the architecture's topological information. An accompanying multi-layer perceptron (MLP) then ranks these architectures based on their encodings. Experimental results show that our approach surpasses previous methods using graph convolutional networks in terms of correlation on the NAS-Bench-201 dataset and exhibits a higher convergence rate. Moreover, our extracted feature representation trained on each NAS-Benchmark is transferable to other NAS-Benchmarks, showing promising generalizability across multiple search spaces. The code is available at: https://github.com/minh1409/DFT-NPZS-NAS ",
    "url": "https://arxiv.org/abs/2308.16775",
    "authors": [
      "Minh Le",
      "Nhan Nguyen",
      "Ngoc Hoang Luong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16797",
    "title": "Simple LLM Prompting is State-of-the-Art for Robust and Multilingual  Dialogue Evaluation",
    "abstract": "Despite significant research effort in the development of automatic dialogue evaluation metrics, little thought is given to evaluating dialogues other than in English. At the same time, ensuring metrics are invariant to semantically similar responses is also an overlooked topic. In order to achieve the desired properties of robustness and multilinguality for dialogue evaluation metrics, we propose a novel framework that takes advantage of the strengths of current evaluation models with the newly-established paradigm of prompting Large Language Models (LLMs). Empirical results show our framework achieves state of the art results in terms of mean Spearman correlation scores across several benchmarks and ranks first place on both the Robust and Multilingual tasks of the DSTC11 Track 4 \"Automatic Evaluation Metrics for Open-Domain Dialogue Systems\", proving the evaluation capabilities of prompted LLMs. ",
    "url": "https://arxiv.org/abs/2308.16797",
    "authors": [
      "John Mendonça",
      "Patrícia Pereira",
      "João Paulo Carvalho",
      "Alon Lavie",
      "Isabel Trancoso"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.16800",
    "title": "Rank Collapse Causes Over-Smoothing and Over-Correlation in Graph Neural  Networks",
    "abstract": "Our study reveals new theoretical insights into over-smoothing and feature over-correlation in deep graph neural networks. We show the prevalence of invariant subspaces, demonstrating a fixed relative behavior that is unaffected by feature transformations. Our work clarifies recent observations related to convergence to a constant state and a potential over-separation of node states, as the amplification of subspaces only depends on the spectrum of the aggregation function. In linear scenarios, this leads to node representations being dominated by a low-dimensional subspace with an asymptotic convergence rate independent of the feature transformations. This causes a rank collapse of the node representations, resulting in over-smoothing when smooth vectors span this subspace, and over-correlation even when over-smoothing is avoided. Guided by our theory, we propose a sum of Kronecker products as a beneficial property that can provably prevent over-smoothing, over-correlation, and rank collapse. We empirically extend our insights to the non-linear case, demonstrating the inability of existing models to capture linearly independent features. ",
    "url": "https://arxiv.org/abs/2308.16800",
    "authors": [
      "Andreas Roth",
      "Thomas Liebig"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16801",
    "title": "Multiscale Residual Learning of Graph Convolutional Sequence Chunks for  Human Motion Prediction",
    "abstract": "A new method is proposed for human motion prediction by learning temporal and spatial dependencies. Recently, multiscale graphs have been developed to model the human body at higher abstraction levels, resulting in more stable motion prediction. Current methods however predetermine scale levels and combine spatially proximal joints to generate coarser scales based on human priors, even though movement patterns in different motion sequences vary and do not fully comply with a fixed graph of spatially connected joints. Another problem with graph convolutional methods is mode collapse, in which predicted poses converge around a mean pose with no discernible movements, particularly in long-term predictions. To tackle these issues, we propose ResChunk, an end-to-end network which explores dynamically correlated body components based on the pairwise relationships between all joints in individual sequences. ResChunk is trained to learn the residuals between target sequence chunks in an autoregressive manner to enforce the temporal connectivities between consecutive chunks. It is hence a sequence-to-sequence prediction network which considers dynamic spatio-temporal features of sequences at multiple levels. Our experiments on two challenging benchmark datasets, CMU Mocap and Human3.6M, demonstrate that our proposed method is able to effectively model the sequence information for motion prediction and outperform other techniques to set a new state-of-the-art. Our code is available at https://github.com/MohsenZand/ResChunk. ",
    "url": "https://arxiv.org/abs/2308.16801",
    "authors": [
      "Mohsen Zand",
      "Ali Etemad",
      "Michael Greenspan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16818",
    "title": "Irregular Traffic Time Series Forecasting Based on Asynchronous  Spatio-Temporal Graph Convolutional Network",
    "abstract": "Accurate traffic forecasting at intersections governed by intelligent traffic signals is critical for the advancement of an effective intelligent traffic signal control system. However, due to the irregular traffic time series produced by intelligent intersections, the traffic forecasting task becomes much more intractable and imposes three major new challenges: 1) asynchronous spatial dependency, 2) irregular temporal dependency among traffic data, and 3) variable-length sequence to be predicted, which severely impede the performance of current traffic forecasting methods. To this end, we propose an Asynchronous Spatio-tEmporal graph convolutional nEtwoRk (ASeer) to predict the traffic states of the lanes entering intelligent intersections in a future time window. Specifically, by linking lanes via a traffic diffusion graph, we first propose an Asynchronous Graph Diffusion Network to model the asynchronous spatial dependency between the time-misaligned traffic state measurements of lanes. After that, to capture the temporal dependency within irregular traffic state sequence, a learnable personalized time encoding is devised to embed the continuous time for each lane. Then we propose a Transformable Time-aware Convolution Network that learns meta-filters to derive time-aware convolution filters with transformable filter sizes for efficient temporal convolution on the irregular sequence. Furthermore, a Semi-Autoregressive Prediction Network consisting of a state evolution unit and a semiautoregressive predictor is designed to effectively and efficiently predict variable-length traffic state sequences. Extensive experiments on two real-world datasets demonstrate the effectiveness of ASeer in six metrics. ",
    "url": "https://arxiv.org/abs/2308.16818",
    "authors": [
      "Weijia Zhang",
      "Le Zhang",
      "Jindong Han",
      "Hao Liu",
      "Jingbo Zhou",
      "Yu Mei",
      "Hui Xiong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16856",
    "title": "Analysis and Optimization of Reconfigurable Intelligent Surfaces Based  on $S$-Parameters Multiport Network Theory",
    "abstract": "In this paper, we consider a reconfigurable intelligent surface (RIS) and model it by using multiport network theory. We first compare the representation of RIS by using $Z$-parameters and $S$-parameters, by proving their equivalence and discussing their distinct features. Then, we develop an algorithm for optimizing the RIS configuration in the presence of electromagnetic mutual coupling. We show that the proposed algorithm based on optimizing the $S$-parameters results in better performance than existing algorithms based on optimizing the $Z$-parameters. This is attributed to the fact that small perturbations of the step size of the proposed algorithm result in larger variations of the $S$-parameters, hence increasing the convergence speed of the algorithm. ",
    "url": "https://arxiv.org/abs/2308.16856",
    "authors": [
      "Andrea Abrardo",
      "Alberto Toccafondi",
      "Marco Di Renzo"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.16879",
    "title": "Adaptation Speed Analysis for Fairness-aware Causal Models",
    "abstract": "For example, in machine translation tasks, to achieve bidirectional translation between two languages, the source corpus is often used as the target corpus, which involves the training of two models with opposite directions. The question of which one can adapt most quickly to a domain shift is of significant importance in many fields. Specifically, consider an original distribution p that changes due to an unknown intervention, resulting in a modified distribution p*. In aligning p with p*, several factors can affect the adaptation rate, including the causal dependencies between variables in p. In real-life scenarios, however, we have to consider the fairness of the training process, and it is particularly crucial to involve a sensitive variable (bias) present between a cause and an effect variable. To explore this scenario, we examine a simple structural causal model (SCM) with a cause-bias-effect structure, where variable A acts as a sensitive variable between cause (X) and effect (Y). The two models, respectively, exhibit consistent and contrary cause-effect directions in the cause-bias-effect SCM. After conducting unknown interventions on variables within the SCM, we can simulate some kinds of domain shifts for analysis. We then compare the adaptation speeds of two models across four shift scenarios. Additionally, we prove the connection between the adaptation speeds of the two models across all interventions. ",
    "url": "https://arxiv.org/abs/2308.16879",
    "authors": [
      "Yujie Lin",
      "Chen Zhao",
      "Minglai Shao",
      "Xujiang Zhao",
      "Haifeng Chen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16882",
    "title": "Amplitude Prediction from Uplink to Downlink CSI against Receiver  Distortion in FDD Systems",
    "abstract": "In frequency division duplex (FDD) massive multiple-input multiple-output (mMIMO) systems, the reciprocity mismatch caused by receiver distortion seriously degrades the amplitude prediction performance of channel state information (CSI). To tackle this issue, from the perspective of distortion suppression and reciprocity calibration, a lightweight neural network-based amplitude prediction method is proposed in this paper. Specifically, with the receiver distortion at the base station (BS), conventional methods are employed to extract the amplitude feature of uplink CSI. Then, learning along the direction of the uplink wireless propagation channel, a dedicated and lightweight distortion-learning network (Dist-LeaNet) is designed to restrain the receiver distortion and calibrate the amplitude reciprocity between the uplink and downlink CSI. Subsequently, by cascading, a single hidden layer-based amplitude-prediction network (Amp-PreNet) is developed to accomplish amplitude prediction of downlink CSI based on the strong amplitude reciprocity. Simulation results show that, considering the receiver distortion in FDD systems, the proposed scheme effectively improves the amplitude prediction accuracy of downlink CSI while reducing the transmission and processing delay. ",
    "url": "https://arxiv.org/abs/2308.16882",
    "authors": [
      "Chaojin Qing",
      "Zilong Wang",
      "Qing Ye",
      "Wenhui Liu",
      "Linsi He"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.16891",
    "title": "GNFactor: Multi-Task Real Robot Learning with Generalizable Neural  Feature Fields",
    "abstract": "It is a long-standing problem in robotics to develop agents capable of executing diverse manipulation tasks from visual observations in unstructured real-world environments. To achieve this goal, the robot needs to have a comprehensive understanding of the 3D structure and semantics of the scene. In this work, we present $\\textbf{GNFactor}$, a visual behavior cloning agent for multi-task robotic manipulation with $\\textbf{G}$eneralizable $\\textbf{N}$eural feature $\\textbf{F}$ields. GNFactor jointly optimizes a generalizable neural field (GNF) as a reconstruction module and a Perceiver Transformer as a decision-making module, leveraging a shared deep 3D voxel representation. To incorporate semantics in 3D, the reconstruction module utilizes a vision-language foundation model ($\\textit{e.g.}$, Stable Diffusion) to distill rich semantic information into the deep 3D voxel. We evaluate GNFactor on 3 real robot tasks and perform detailed ablations on 10 RLBench tasks with a limited number of demonstrations. We observe a substantial improvement of GNFactor over current state-of-the-art methods in seen and unseen tasks, demonstrating the strong generalization ability of GNFactor. Our project website is https://yanjieze.com/GNFactor/ . ",
    "url": "https://arxiv.org/abs/2308.16891",
    "authors": [
      "Yanjie Ze",
      "Ge Yan",
      "Yueh-Hua Wu",
      "Annabella Macaluso",
      "Yuying Ge",
      "Jianglong Ye",
      "Nicklas Hansen",
      "Li Erran Li",
      "Xiaolong Wang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16896",
    "title": "PointOcc: Cylindrical Tri-Perspective View for Point-based 3D Semantic  Occupancy Prediction",
    "abstract": "Semantic segmentation in autonomous driving has been undergoing an evolution from sparse point segmentation to dense voxel segmentation, where the objective is to predict the semantic occupancy of each voxel in the concerned 3D space. The dense nature of the prediction space has rendered existing efficient 2D-projection-based methods (e.g., bird's eye view, range view, etc.) ineffective, as they can only describe a subspace of the 3D scene. To address this, we propose a cylindrical tri-perspective view to represent point clouds effectively and comprehensively and a PointOcc model to process them efficiently. Considering the distance distribution of LiDAR point clouds, we construct the tri-perspective view in the cylindrical coordinate system for more fine-grained modeling of nearer areas. We employ spatial group pooling to maintain structural details during projection and adopt 2D backbones to efficiently process each TPV plane. Finally, we obtain the features of each point by aggregating its projected features on each of the processed TPV planes without the need for any post-processing. Extensive experiments on both 3D occupancy prediction and LiDAR segmentation benchmarks demonstrate that the proposed PointOcc achieves state-of-the-art performance with much faster speed. Specifically, despite only using LiDAR, PointOcc significantly outperforms all other methods, including multi-modal methods, with a large margin on the OpenOccupancy benchmark. Code: https://github.com/wzzheng/PointOcc. ",
    "url": "https://arxiv.org/abs/2308.16896",
    "authors": [
      "Sicheng Zuo",
      "Wenzhao Zheng",
      "Yuanhui Huang",
      "Jie Zhou",
      "Jiwen Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16909",
    "title": "StyleInV: A Temporal Style Modulated Inversion Network for Unconditional  Video Generation",
    "abstract": "Unconditional video generation is a challenging task that involves synthesizing high-quality videos that are both coherent and of extended duration. To address this challenge, researchers have used pretrained StyleGAN image generators for high-quality frame synthesis and focused on motion generator design. The motion generator is trained in an autoregressive manner using heavy 3D convolutional discriminators to ensure motion coherence during video generation. In this paper, we introduce a novel motion generator design that uses a learning-based inversion network for GAN. The encoder in our method captures rich and smooth priors from encoding images to latents, and given the latent of an initially generated frame as guidance, our method can generate smooth future latent by modulating the inversion encoder temporally. Our method enjoys the advantage of sparse training and naturally constrains the generation space of our motion generator with the inversion network guided by the initial frame, eliminating the need for heavy discriminators. Moreover, our method supports style transfer with simple fine-tuning when the encoder is paired with a pretrained StyleGAN generator. Extensive experiments conducted on various benchmarks demonstrate the superiority of our method in generating long and high-resolution videos with decent single-frame quality and temporal consistency. ",
    "url": "https://arxiv.org/abs/2308.16909",
    "authors": [
      "Yuhan Wang",
      "Liming Jiang",
      "Chen Change Loy"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16910",
    "title": "Robust Variational Physics-Informed Neural Networks",
    "abstract": "We introduce a Robust version of the Variational Physics-Informed Neural Networks (RVPINNs) to approximate the Partial Differential Equations (PDEs) solution. We start from a weak Petrov-Galerkin formulation of the problem, select a discrete test space, and define a quadratic loss functional as in VPINNs. Whereas in VPINNs the loss depends upon the selected basis functions of a given test space, herein we minimize a loss based on the residual in the discrete dual norm, which is independent of the test space's choice of test basis functions. We demonstrate that this loss is a reliable and efficient estimator of the true error in the energy norm. The proposed loss function requires computation of the Gram matrix inverse, similar to what occurs in traditional residual minimization methods. To validate our theoretical findings, we test the performance and robustness of our algorithm in several advection-dominated-diffusion problems in one spatial dimension. We conclude that RVPINNs is a robust method. ",
    "url": "https://arxiv.org/abs/2308.16910",
    "authors": [
      "Sergio Rojas",
      "Paweł Maczuga",
      "Judit Muñoz-Matute",
      "David Pardo",
      "Maciej Paszynski"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2308.16257",
    "title": "On extremal factors of de Bruijn-like graphs",
    "abstract": "In 1972 Mykkeltveit proved that the maximum number of vertex-disjoint cycles in the de Bruijn graphs of order $n$ is attained by the pure cycling register rule, as conjectured by Golomb. We generalize this result to the tensor product of the de Bruijn graph of order $n$ and a simple cycle of size $k$, when $n$ divides $k$ or vice versa. We also develop counting formulae for a large family of cycling register rules, including the linear register rules proposed by Golomb. ",
    "url": "https://arxiv.org/abs/2308.16257",
    "authors": [
      "Nicolás Álvarez",
      "Verónica Becher",
      "Martín Mereb",
      "Ivo Pajor",
      "Carlos Miguel Soto"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2308.16264",
    "title": "Quantum Network Planning for Utility Maximization",
    "abstract": "Existing classical optical network infrastructure cannot be immediately used for quantum network applications due to photon loss. The first step towards enabling quantum networks is the integration of quantum repeaters into optical networks. However, the expenses and intrinsic noise inherent in quantum hardware underscore the need for an efficient deployment strategy that optimizes the allocation of quantum repeaters and memories. In this paper, we present a comprehensive framework for network planning, aiming to efficiently distributing quantum repeaters across existing infrastructure, with the objective of maximizing quantum network utility within an entanglement distribution network. We apply our framework to several cases including a preliminary illustration of a dumbbell network topology and real-world cases of the SURFnet and ESnet. We explore the effect of quantum memory multiplexing within quantum repeaters, as well as the influence of memory coherence time on quantum network utility. We further examine the effects of different fairness assumptions on network planning, uncovering their impacts on real-time network performance. ",
    "url": "https://arxiv.org/abs/2308.16264",
    "authors": [
      "Shahrooz Pouryousef",
      "Hassan Shapourian",
      "Alireza Shabani",
      "Ramana Kompella",
      "Don Towsley"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2308.16272",
    "title": "A numerical approach for the fractional Laplacian via deep neural  networks",
    "abstract": "We consider the fractional elliptic problem with Dirichlet boundary conditions on a bounded and convex domain $D$ of $\\mathbb{R}^d$, with $d \\geq 2$. In this paper, we perform a stochastic gradient descent algorithm that approximates the solution of the fractional problem via Deep Neural Networks. Additionally, we provide four numerical examples to test the efficiency of the algorithm, and each example will be studied for many values of $\\alpha \\in (1,2)$ and $d \\geq 2$. ",
    "url": "https://arxiv.org/abs/2308.16272",
    "authors": [
      "Nicolás Valenzuela"
    ],
    "subjectives": [
      "Analysis of PDEs (math.AP)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2308.16309",
    "title": "Inferring Compensatory Kinase Networks in Yeast using Prolog",
    "abstract": "Signalling pathways are conserved across different species, therefore making yeast a model organism to study these via disruption of kinase activity. Yeast has 159 genes that encode protein kinases and phosphatases, and 136 of these have counterparts in humans. Therefore any insight in this model organism could potentially offer indications of mechanisms of action in the human kinome. The study utilises a Prolog-based approach, data from a yeast kinase deletions strains study and publicly available kinase-protein associations. Prolog, a programming language that is well-suited for symbolic reasoning is used to reason over the data and infer compensatory kinase networks. This approach is based on the idea that when a kinase is knocked out, other kinases may compensate for this loss of activity. Background knowledge on kinases targeting proteins is used to guide the analysis. This knowledge is used to infer the potential compensatory interactions between kinases based on the changes in phosphorylation observed in the phosphoproteomics data from the yeast study. The results demonstrate the effectiveness of the Prolog-based approach in analysing complex cell signalling mechanisms in yeast. The inferred compensatory kinase networks provide new insights into the regulation of cell signalling in yeast and may aid in the identification of potential therapeutic targets for modulating signalling pathways in yeast and other organisms. ",
    "url": "https://arxiv.org/abs/2308.16309",
    "authors": [
      "George A. Elder",
      "Conrad Bessant"
    ],
    "subjectives": [
      "Molecular Networks (q-bio.MN)",
      "Symbolic Computation (cs.SC)"
    ]
  },
  {
    "id": "arXiv:2308.16422",
    "title": "DECODE: DilatEd COnvolutional neural network for Detecting  Extreme-mass-ratio inspirals",
    "abstract": "The detection of Extreme Mass Ratio Inspirals (EMRIs) is intricate due to their complex waveforms, extended duration, and low signal-to-noise ratio (SNR), making them more challenging to be identified compared to compact binary coalescences. While matched filtering-based techniques are known for their computational demands, existing deep learning-based methods primarily handle time-domain data and are often constrained by data duration and SNR. In addition, most existing work ignores time-delay interferometry (TDI) and applies the long-wavelength approximation in detector response calculations, thus limiting their ability to handle laser frequency noise. In this study, we introduce DECODE, an end-to-end model focusing on EMRI signal detection by sequence modeling in the frequency domain. Centered around a dilated causal convolutional neural network, trained on synthetic data considering TDI-1.5 detector response, DECODE can efficiently process a year's worth of multichannel TDI data with an SNR of around 50. We evaluate our model on 1-year data with accumulated SNR ranging from 50 to 120 and achieve a true positive rate of 96.3% at a false positive rate of 1%, keeping an inference time of less than 0.01 seconds. With the visualization of three showcased EMRI signals for interpretability and generalization, DECODE exhibits strong potential for future space-based gravitational wave data analyses. ",
    "url": "https://arxiv.org/abs/2308.16422",
    "authors": [
      "Tianyu Zhao",
      "Yue Zhou",
      "Ruijun Shi",
      "Zhoujian Cao",
      "Zhixiang Ren"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)",
      "General Relativity and Quantum Cosmology (gr-qc)"
    ]
  },
  {
    "id": "arXiv:2308.16483",
    "title": "Echocardiographic View Classification with Integrated  Out-of-Distribution Detection for Enhanced Automatic Echocardiographic  Analysis",
    "abstract": "In the rapidly evolving field of automatic echocardiographic analysis and interpretation, automatic view classification is a critical yet challenging task, owing to the inherent complexity and variability of echocardiographic data. This study presents ECHOcardiography VIew Classification with Out-of-Distribution dEtection (ECHO-VICODE), a novel deep learning-based framework that effectively addresses this challenge by training to classify 31 classes, surpassing previous studies and demonstrating its capacity to handle a wide range of echocardiographic views. Furthermore, ECHO-VICODE incorporates an integrated out-of-distribution (OOD) detection function, leveraging the relative Mahalanobis distance to effectively identify 'near-OOD' instances commonly encountered in echocardiographic data. Through extensive experimentation, we demonstrated the outstanding performance of ECHO-VICODE in terms of view classification and OOD detection, significantly reducing the potential for errors in echocardiographic analyses. This pioneering study significantly advances the domain of automated echocardiography analysis and exhibits promising prospects for substantial applications in extensive clinical research and practice. ",
    "url": "https://arxiv.org/abs/2308.16483",
    "authors": [
      "Jaeik Jeon",
      "Seongmin Ha",
      "Yeonyee E. Yoon",
      "Jiyeon Kim",
      "Hyunseok Jeong",
      "Dawun Jeong",
      "Yeonggul Jang",
      "Youngtaek Hong",
      "Hyuk-Jae Chang"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16488",
    "title": "RAMP: Retrieval-Augmented MOS Prediction via Confidence-based Dynamic  Weighting",
    "abstract": "Automatic Mean Opinion Score (MOS) prediction is crucial to evaluate the perceptual quality of the synthetic speech. While recent approaches using pre-trained self-supervised learning (SSL) models have shown promising results, they only partly address the data scarcity issue for the feature extractor. This leaves the data scarcity issue for the decoder unresolved and leading to suboptimal performance. To address this challenge, we propose a retrieval-augmented MOS prediction method, dubbed {\\bf RAMP}, to enhance the decoder's ability against the data scarcity issue. A fusing network is also proposed to dynamically adjust the retrieval scope for each instance and the fusion weights based on the predictive confidence. Experimental results show that our proposed method outperforms the existing methods in multiple scenarios. ",
    "url": "https://arxiv.org/abs/2308.16488",
    "authors": [
      "Hui Wang",
      "Shiwan Zhao",
      "Xiguang Zheng",
      "Yong Qin"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2308.16551",
    "title": "Object Detection for Caries or Pit and Fissure Sealing Requirement in  Children's First Permanent Molars",
    "abstract": "Dental caries is one of the most common oral diseases that, if left untreated, can lead to a variety of oral problems. It mainly occurs inside the pits and fissures on the occlusal/buccal/palatal surfaces of molars and children are a high-risk group for pit and fissure caries in permanent molars. Pit and fissure sealing is one of the most effective methods that is widely used in prevention of pit and fissure caries. However, current detection of pits and fissures or caries depends primarily on the experienced dentists, which ordinary parents do not have, and children may miss the remedial treatment without timely detection. To address this issue, we present a method to autodetect caries and pit and fissure sealing requirements using oral photos taken by smartphones. We use the YOLOv5 and YOLOX models and adopt a tiling strategy to reduce information loss during image pre-processing. The best result for YOLOXs model with tiling strategy is 72.3 mAP.5, while the best result without tiling strategy is 71.2. YOLOv5s6 model with/without tiling attains 70.9/67.9 mAP.5, respectively. We deploy the pre-trained network to mobile devices as a WeChat applet, allowing in-home detection by parents or children guardian. ",
    "url": "https://arxiv.org/abs/2308.16551",
    "authors": [
      "Chenyao Jiang",
      "Shiyao Zhai",
      "Hengrui Song",
      "Yuqing Ma",
      "Yachen Fan",
      "Yancheng Fang",
      "Dongmei Yu",
      "Canyang Zhang",
      "Sanyang Han",
      "Runming Wang",
      "Yong Liu",
      "Jianbo Li",
      "Peiwu Qin"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16573",
    "title": "Dual-Decoder Consistency via Pseudo-Labels Guided Data Augmentation for  Semi-Supervised Medical Image Segmentation",
    "abstract": "Medical image segmentation methods often rely on fully supervised approaches to achieve excellent performance, which is contingent upon having an extensive set of labeled images for training. However, annotating medical images is both expensive and time-consuming. Semi-supervised learning offers a solution by leveraging numerous unlabeled images alongside a limited set of annotated ones. In this paper, we introduce a semi-supervised medical image segmentation method based on the mean-teacher model, referred to as Dual-Decoder Consistency via Pseudo-Labels Guided Data Augmentation (DCPA). This method combines consistency regularization, pseudo-labels, and data augmentation to enhance the efficacy of semi-supervised segmentation. Firstly, the proposed model comprises both student and teacher models with a shared encoder and two distinct decoders employing different up-sampling strategies. Minimizing the output discrepancy between decoders enforces the generation of consistent representations, serving as regularization during student model training. Secondly, we introduce mixup operations to blend unlabeled data with labeled data, creating mixed data and thereby achieving data augmentation. Lastly, pseudo-labels are generated by the teacher model and utilized as labels for mixed data to compute unsupervised loss. We compare the segmentation results of the DCPA model with six state-of-the-art semi-supervised methods on three publicly available medical datasets. Beyond classical 10\\% and 20\\% semi-supervised settings, we investigate performance with less supervision (5\\% labeled data). Experimental outcomes demonstrate that our approach consistently outperforms existing semi-supervised medical image segmentation methods across the three semi-supervised settings. ",
    "url": "https://arxiv.org/abs/2308.16573",
    "authors": [
      "Yuanbin Chen",
      "Tao Wang",
      "Hui Tang",
      "Longxuan Zhao",
      "Ruige Zong",
      "Tao Tan",
      "Xinlin Zhang",
      "Tong Tong"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16664",
    "title": "What can we learn from quantum convolutional neural networks?",
    "abstract": "We can learn from analyzing quantum convolutional neural networks (QCNNs) that: 1) working with quantum data can be perceived as embedding physical system parameters through a hidden feature map; 2) their high performance for quantum phase recognition can be attributed to generation of a very suitable basis set during the ground state embedding, where quantum criticality of spin models leads to basis functions with rapidly changing features; 3) pooling layers of QCNNs are responsible for picking those basis functions that can contribute to forming a high-performing decision boundary, and the learning process corresponds to adapting the measurement such that few-qubit operators are mapped to full-register observables; 4) generalization of QCNN models strongly depends on the embedding type, and that rotation-based feature maps with the Fourier basis require careful feature engineering; 5) accuracy and generalization of QCNNs with readout based on a limited number of shots favor the ground state embeddings and associated physics-informed models. We demonstrate these points in simulation, where our results shed light on classification for physical processes, relevant for applications in sensing. Finally, we show that QCNNs with properly chosen ground state embeddings can be used for fluid dynamics problems, expressing shock wave solutions with good generalization and proven trainability. ",
    "url": "https://arxiv.org/abs/2308.16664",
    "authors": [
      "Chukwudubem Umeano",
      "Annie E. Paine",
      "Vincent E. Elfving",
      "Oleksandr Kyriienko"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16738",
    "title": "US-SFNet: A Spatial-Frequency Domain-based Multi-branch Network for  Cervical Lymph Node Lesions Diagnoses in Ultrasound Images",
    "abstract": "Ultrasound imaging serves as a pivotal tool for diagnosing cervical lymph node lesions. However, the diagnoses of these images largely hinge on the expertise of medical practitioners, rendering the process susceptible to misdiagnoses. Although rapidly developing deep learning has substantially improved the diagnoses of diverse ultrasound images, there remains a conspicuous research gap concerning cervical lymph nodes. The objective of our work is to accurately diagnose cervical lymph node lesions by leveraging a deep learning model. To this end, we first collected 3392 images containing normal lymph nodes, benign lymph node lesions, malignant primary lymph node lesions, and malignant metastatic lymph node lesions. Given that ultrasound images are generated by the reflection and scattering of sound waves across varied bodily tissues, we proposed the Conv-FFT Block. It integrates convolutional operations with the fast Fourier transform to more astutely model the images. Building upon this foundation, we designed a novel architecture, named US-SFNet. This architecture not only discerns variances in ultrasound images from the spatial domain but also adeptly captures microstructural alterations across various lesions in the frequency domain. To ascertain the potential of US-SFNet, we benchmarked it against 12 popular architectures through five-fold cross-validation. The results show that US-SFNet is SOTA and can achieve 92.89% accuracy, 90.46% precision, 89.95% sensitivity and 97.49% specificity, respectively. ",
    "url": "https://arxiv.org/abs/2308.16738",
    "authors": [
      "Yubiao Yue",
      "Jun Xue",
      "Haihua Liang",
      "Bingchun Luo",
      "Zhenzhang Li"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16754",
    "title": "Training Neural Networks Using Reproducing Kernel Space Interpolation  and Model Reduction",
    "abstract": "We introduce and study the theory of training neural networks using interpolation techniques from reproducing kernel Hilbert space theory. We generalize the method to Krein spaces, and show that widely-used neural network architectures are subsets of reproducing kernel Krein spaces (RKKS). We study the concept of \"associated Hilbert spaces\" of RKKS and develop techniques to improve upon the expressivity of various activation functions. Next, using concepts from the theory of functions of several complex variables, we prove a computationally applicable, multidimensional generalization of the celebrated Adamjan- Arov-Krein (AAK) theorem. The theorem yields a novel class of neural networks, called Prolongation Neural Networks (PNN). We demonstrate that, by applying the multidimensional AAK theorem to gain a PNN, one can gain performance superior to both our interpolatory methods and current state-of-the-art methods in noisy environments. We provide useful illustrations of our methods in practice. ",
    "url": "https://arxiv.org/abs/2308.16754",
    "authors": [
      "Eric Arthur Werneburg"
    ],
    "subjectives": [
      "Functional Analysis (math.FA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16859",
    "title": "Information Theoretically Optimal Sample Complexity of Learning  Dynamical Directed Acyclic Graphs",
    "abstract": "In this article, the optimal sample complexity of learning the underlying interaction/dependencies of a Linear Dynamical System (LDS) over a Directed Acyclic Graph (DAG) is studied. The sample complexity of learning a DAG's structure is well-studied for static systems, where the samples of nodal states are independent and identically distributed (i.i.d.). However, such a study is less explored for DAGs with dynamical systems, where the nodal states are temporally correlated. We call such a DAG underlying an LDS as \\emph{dynamical} DAG (DDAG). In particular, we consider a DDAG where the nodal dynamics are driven by unobserved exogenous noise sources that are wide-sense stationary (WSS) in time but are mutually uncorrelated, and have the same {power spectral density (PSD)}. Inspired by the static settings, a metric and an algorithm based on the PSD matrix of the observed time series are proposed to reconstruct the DDAG. The equal noise PSD assumption can be relaxed such that identifiability conditions for DDAG reconstruction are not violated. For the LDS with WSS (sub) Gaussian exogenous noise sources, it is shown that the optimal sample complexity (or length of state trajectory) needed to learn the DDAG is $n=\\Theta(q\\log(p/q))$, where $p$ is the number of nodes and $q$ is the maximum number of parents per node. To prove the sample complexity upper bound, a concentration bound for the PSD estimation is derived, under two different sampling strategies. A matching min-max lower bound using generalized Fano's inequality also is provided, thus showing the order optimality of the proposed algorithm. ",
    "url": "https://arxiv.org/abs/2308.16859",
    "authors": [
      "Mishfad Shaikh Veedu",
      "Deepjyoti Deka",
      "Murti V. Salapaka"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2308.16863",
    "title": "Self-pruning Graph Neural Network for Predicting Inflammatory Disease  Activity in Multiple Sclerosis from Brain MR Images",
    "abstract": "Multiple Sclerosis (MS) is a severe neurological disease characterized by inflammatory lesions in the central nervous system. Hence, predicting inflammatory disease activity is crucial for disease assessment and treatment. However, MS lesions can occur throughout the brain and vary in shape, size and total count among patients. The high variance in lesion load and locations makes it challenging for machine learning methods to learn a globally effective representation of whole-brain MRI scans to assess and predict disease. Technically it is non-trivial to incorporate essential biomarkers such as lesion load or spatial proximity. Our work represents the first attempt to utilize graph neural networks (GNN) to aggregate these biomarkers for a novel global representation. We propose a two-stage MS inflammatory disease activity prediction approach. First, a 3D segmentation network detects lesions, and a self-supervised algorithm extracts their image features. Second, the detected lesions are used to build a patient graph. The lesions act as nodes in the graph and are initialized with image features extracted in the first stage. Finally, the lesions are connected based on their spatial proximity and the inflammatory disease activity prediction is formulated as a graph classification task. Furthermore, we propose a self-pruning strategy to auto-select the most critical lesions for prediction. Our proposed method outperforms the existing baseline by a large margin (AUCs of 0.67 vs. 0.61 and 0.66 vs. 0.60 for one-year and two-year inflammatory disease activity, respectively). Finally, our proposed method enjoys inherent explainability by assigning an importance score to each lesion for the overall prediction. Code is available at https://github.com/chinmay5/ms_ida.git ",
    "url": "https://arxiv.org/abs/2308.16863",
    "authors": [
      "Chinmay Prabhakar",
      "Hongwei Bran Li",
      "Johannes C. Paetzold",
      "Timo Loehr",
      "Chen Niu",
      "Mark Mühlau",
      "Daniel Rueckert",
      "Benedikt Wiestler",
      "Bjoern Menze"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16886",
    "title": "Prediction of Diblock Copolymer Morphology via Machine Learning",
    "abstract": "A machine learning approach is presented to accelerate the computation of block polymer morphology evolution for large domains over long timescales. The strategy exploits the separation of characteristic times between coarse-grained particle evolution on the monomer scale and slow morphological evolution over mesoscopic scales. In contrast to empirical continuum models, the proposed approach learns stochastically driven defect annihilation processes directly from particle-based simulations. A UNet architecture that respects different boundary conditions is adopted, thereby allowing periodic and fixed substrate boundary conditions of arbitrary shape. Physical concepts are also introduced via the loss function and symmetries are incorporated via data augmentation. The model is validated using three different use cases. Explainable artificial intelligence methods are applied to visualize the morphology evolution over time. This approach enables the generation of large system sizes and long trajectories to investigate defect densities and their evolution under different types of confinement. As an application, we demonstrate the importance of accessing late-stage morphologies for understanding particle diffusion inside a single block. This work has implications for directed self-assembly and materials design in micro-electronics, battery materials, and membranes. ",
    "url": "https://arxiv.org/abs/2308.16886",
    "authors": [
      "Hyun Park",
      "Boyuan Yu",
      "Juhae Park",
      "Ge Sun",
      "Emad Tajkhorshid",
      "Juan J. de Pablo",
      "Ludwig Schneider"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.14818",
    "title": "Traceability Technology Adoption in Supply Chain Networks",
    "abstract": " Title: Traceability Technology Adoption in Supply Chain Networks ",
    "url": "https://arxiv.org/abs/2104.14818",
    "authors": [
      "Philippe Blaettchen",
      "Andre P. Calmon",
      "Georgina Hall"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Computational Complexity (cs.CC)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2106.14052",
    "title": "Combining Inductive and Deductive Reasoning for Query Answering over  Incomplete Knowledge Graphs",
    "abstract": " Title: Combining Inductive and Deductive Reasoning for Query Answering over  Incomplete Knowledge Graphs ",
    "url": "https://arxiv.org/abs/2106.14052",
    "authors": [
      "Medina Andresel",
      "Trung-Kien Tran",
      "Csaba Domokos",
      "Pasquale Minervini",
      "Daria Stepanova"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Databases (cs.DB)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.08060",
    "title": "Leveraging Image-based Generative Adversarial Networks for Time Series  Generation",
    "abstract": " Title: Leveraging Image-based Generative Adversarial Networks for Time Series  Generation ",
    "url": "https://arxiv.org/abs/2112.08060",
    "authors": [
      "Justin Hellermann",
      "Stefan Lessmann"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2201.12994",
    "title": "MGNN: Graph Neural Networks Inspired by Distance Geometry Problem",
    "abstract": " Comments: Accepted by KDD 2023 ",
    "url": "https://arxiv.org/abs/2201.12994",
    "authors": [
      "Guanyu Cui",
      "Zhewei Wei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2202.04053",
    "title": "DALL-Eval: Probing the Reasoning Skills and Social Biases of  Text-to-Image Generation Models",
    "abstract": " Comments: ICCV 2023 (34 pages; see appendix for version changelog) ",
    "url": "https://arxiv.org/abs/2202.04053",
    "authors": [
      "Jaemin Cho",
      "Abhay Zala",
      "Mohit Bansal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2206.07741",
    "title": "Edge Inference with Fully Differentiable Quantized Mixed Precision  Neural Networks",
    "abstract": " Title: Edge Inference with Fully Differentiable Quantized Mixed Precision  Neural Networks ",
    "url": "https://arxiv.org/abs/2206.07741",
    "authors": [
      "Clemens JS Schaefer",
      "Siddharth Joshi",
      "Shan Li",
      "Raul Blazquez"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.09379",
    "title": "0/1 Deep Neural Networks via Block Coordinate Descent",
    "abstract": " Title: 0/1 Deep Neural Networks via Block Coordinate Descent ",
    "url": "https://arxiv.org/abs/2206.09379",
    "authors": [
      "Hui Zhang",
      "Shenglong Zhou",
      "Geoffrey Ye Li",
      "Naihua Xiu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.00780",
    "title": "Visual correspondence-based explanations improve AI robustness and  human-AI team accuracy",
    "abstract": " Comments: NeurIPS 2022 conference paper ",
    "url": "https://arxiv.org/abs/2208.00780",
    "authors": [
      "Giang Nguyen",
      "Mohammad Reza Taesiri",
      "Anh Nguyen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.03450",
    "title": "Seeking Interpretability and Explainability in Binary Activated Neural  Networks",
    "abstract": " Title: Seeking Interpretability and Explainability in Binary Activated Neural  Networks ",
    "url": "https://arxiv.org/abs/2209.03450",
    "authors": [
      "Benjamin Leblanc",
      "Pascal Germain"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02373",
    "title": "Dynamical systems' based neural networks",
    "abstract": " Title: Dynamical systems' based neural networks ",
    "url": "https://arxiv.org/abs/2210.02373",
    "authors": [
      "Elena Celledoni",
      "Davide Murari",
      "Brynjulf Owren",
      "Carola-Bibiane Schönlieb",
      "Ferdia Sherry"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2210.05102",
    "title": "Pre-Training Representations of Binary Code Using Contrastive Learning",
    "abstract": " Title: Pre-Training Representations of Binary Code Using Contrastive Learning ",
    "url": "https://arxiv.org/abs/2210.05102",
    "authors": [
      "Yifan Zhang",
      "Chen Huang",
      "Yueke Zhang",
      "Kevin Cao",
      "Scott Thomas Andersen",
      "Huajie Shao",
      "Kevin Leach",
      "Yu Huang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.09134",
    "title": "Principled Pruning of Bayesian Neural Networks through Variational Free  Energy Minimization",
    "abstract": " Title: Principled Pruning of Bayesian Neural Networks through Variational Free  Energy Minimization ",
    "url": "https://arxiv.org/abs/2210.09134",
    "authors": [
      "Jim Beckers",
      "Bart van Erp",
      "Ziyue Zhao",
      "Kirill Kondrashov",
      "Bert de Vries"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2211.10892",
    "title": "Towards Realistic Out-of-Distribution Detection: A Novel Evaluation  Framework for Improving Generalization in OOD Detection",
    "abstract": " Title: Towards Realistic Out-of-Distribution Detection: A Novel Evaluation  Framework for Improving Generalization in OOD Detection ",
    "url": "https://arxiv.org/abs/2211.10892",
    "authors": [
      "Vahid Reza Khazaie",
      "Anthony Wong",
      "Mohammad Sabokrou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14424",
    "title": "Invertible normalizing flow neural networks by JKO scheme",
    "abstract": " Title: Invertible normalizing flow neural networks by JKO scheme ",
    "url": "https://arxiv.org/abs/2212.14424",
    "authors": [
      "Chen Xu",
      "Xiuyuan Cheng",
      "Yao Xie"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.00752",
    "title": "Point Cloud-based Proactive Link Quality Prediction for Millimeter-wave  Communications",
    "abstract": " Comments: Submitted to IEEE Transactions on Machine Learning in Communications and Networking ",
    "url": "https://arxiv.org/abs/2301.00752",
    "authors": [
      "Shoki Ohta",
      "Takayuki Nishio",
      "Riichi Kudo",
      "Kahoko Takahashi",
      "Hisashi Nagata"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2302.00049",
    "title": "Transformers Meet Directed Graphs",
    "abstract": " Comments: 29 pages ",
    "url": "https://arxiv.org/abs/2302.00049",
    "authors": [
      "Simon Geisler",
      "Yujia Li",
      "Daniel Mankowitz",
      "Ali Taylan Cemgil",
      "Stephan Günnemann",
      "Cosmin Paduraru"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.06677",
    "title": "System identification of neural systems: If we got it right, would we  know?",
    "abstract": " Title: System identification of neural systems: If we got it right, would we  know? ",
    "url": "https://arxiv.org/abs/2302.06677",
    "authors": [
      "Yena Han",
      "Tomaso Poggio",
      "Brian Cheung"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.12977",
    "title": "Fair Attribute Completion on Graph with Missing Attributes",
    "abstract": " Title: Fair Attribute Completion on Graph with Missing Attributes ",
    "url": "https://arxiv.org/abs/2302.12977",
    "authors": [
      "Dongliang Guo",
      "Zhixuan Chu",
      "Sheng Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.12059",
    "title": "Motion Matters: Neural Motion Transfer for Better Camera Physiological  Measurement",
    "abstract": " Comments: 17 pages, 6 figures, 15 tables ",
    "url": "https://arxiv.org/abs/2303.12059",
    "authors": [
      "Akshay Paruchuri",
      "Xin Liu",
      "Yulu Pan",
      "Shwetak Patel",
      "Daniel McDuff",
      "Soumyadip Sengupta"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.12743",
    "title": "DR.CPO: Diversified and Realistic 3D Augmentation via Iterative  Construction, Random Placement, and HPR Occlusion",
    "abstract": " Title: DR.CPO: Diversified and Realistic 3D Augmentation via Iterative  Construction, Random Placement, and HPR Occlusion ",
    "url": "https://arxiv.org/abs/2303.12743",
    "authors": [
      "Jungwook Shin",
      "Jaeill Kim",
      "Kyungeun Lee",
      "Hyunghun Cho",
      "Wonjong Rhee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2303.15487",
    "title": "Knowledge Enhanced Graph Neural Networks for Graph Completion",
    "abstract": " Title: Knowledge Enhanced Graph Neural Networks for Graph Completion ",
    "url": "https://arxiv.org/abs/2303.15487",
    "authors": [
      "Luisa Werner",
      "Nabil Layaïda",
      "Pierre Genevès",
      "Sarah Chlyah"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)",
      "Symbolic Computation (cs.SC)"
    ]
  },
  {
    "id": "arXiv:2304.03384",
    "title": "Beyond NeRF Underwater: Learning Neural Reflectance Fields for True  Color Correction of Marine Imagery",
    "abstract": " Comments: Robotics and Automation Letters (RA-L) VOL. 8, NO. 10, OCTOBER 2023 ",
    "url": "https://arxiv.org/abs/2304.03384",
    "authors": [
      "Tianyi Zhang",
      "Matthew Johnson-Roberson"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.05821",
    "title": "DUFormer: Solving Power Line Detection Task in Aerial Images using  Semantic Segmentation",
    "abstract": " Title: DUFormer: Solving Power Line Detection Task in Aerial Images using  Semantic Segmentation ",
    "url": "https://arxiv.org/abs/2304.05821",
    "authors": [
      "Deyu An",
      "Qiang Zhang",
      "Jianshu Chao",
      "Ting Li",
      "Feng Qiao",
      "Yong Deng",
      "Zhenpeng Bian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.11039",
    "title": "An Optimization Framework For Anomaly Detection Scores Refinement With  Side Information",
    "abstract": " Title: An Optimization Framework For Anomaly Detection Scores Refinement With  Side Information ",
    "url": "https://arxiv.org/abs/2304.11039",
    "authors": [
      "Ali Maatouk",
      "Fadhel Ayed",
      "Wenjie Li",
      "Yu Wang",
      "Hong Zhu",
      "Jiantao Ye"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.13455",
    "title": "From Chaos Comes Order: Ordering Event Representations for Object  Recognition and Detection",
    "abstract": " Comments: 15 pages, 11 figures, 2 tables, ICCV 2023 Camera Ready paper ",
    "url": "https://arxiv.org/abs/2304.13455",
    "authors": [
      "Nikola Zubić",
      "Daniel Gehrig",
      "Mathias Gehrig",
      "Davide Scaramuzza"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.14994",
    "title": "A Stable and Scalable Method for Solving Initial Value PDEs with Neural  Networks",
    "abstract": " Comments: ICLR 2023. Code available at this https URL ",
    "url": "https://arxiv.org/abs/2304.14994",
    "authors": [
      "Marc Finzi",
      "Andres Potapczynski",
      "Matthew Choptuik",
      "Andrew Gordon Wilson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.03619",
    "title": "Uncertainty Quantification for Fisher-Kolmogorov Equation on Graphs with  Application to Patient-Specific Alzheimer Disease",
    "abstract": " Title: Uncertainty Quantification for Fisher-Kolmogorov Equation on Graphs with  Application to Patient-Specific Alzheimer Disease ",
    "url": "https://arxiv.org/abs/2305.03619",
    "authors": [
      "Mattia Corti",
      "Francesca Bonizzoni",
      "Paola F. Antonietti",
      "Alfio M. Quarteroni"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2305.15777",
    "title": "Dynamic Data Augmentation via MCTS for Prostate MRI Segmentation",
    "abstract": " Title: Dynamic Data Augmentation via MCTS for Prostate MRI Segmentation ",
    "url": "https://arxiv.org/abs/2305.15777",
    "authors": [
      "Xinyue Xu",
      "Yuhan Hsi",
      "Haonan Wang",
      "Xiaomeng Li"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.19979",
    "title": "Knowledge Graph Embeddings in the Biomedical Domain: Are They Useful? A  Look at Link Prediction, Rule Learning, and Downstream Polypharmacy Tasks",
    "abstract": " Title: Knowledge Graph Embeddings in the Biomedical Domain: Are They Useful? A  Look at Link Prediction, Rule Learning, and Downstream Polypharmacy Tasks ",
    "url": "https://arxiv.org/abs/2305.19979",
    "authors": [
      "Aryo Pradipta Gema",
      "Dominik Grabarczyk",
      "Wolf De Wulf",
      "Piyush Borole",
      "Javier Antonio Alfaro",
      "Pasquale Minervini",
      "Antonio Vergari",
      "Ajitha Rajan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03027",
    "title": "Explicit feedback synthesis for nonlinear robust model predictive  control driven by quasi-interpolation",
    "abstract": " Comments: 31 Pages ",
    "url": "https://arxiv.org/abs/2306.03027",
    "authors": [
      "Siddhartha Ganguly",
      "Debasish Chatterjee"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2306.06345",
    "title": "Improving Non-autoregressive Translation Quality with Pretrained  Language Model, Embedding Distillation and Upsampling Strategy for CTC",
    "abstract": " Comments: 12 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2306.06345",
    "authors": [
      "Shen-sian Syu",
      "Juncheng Xie",
      "Hung-yi Lee"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2306.08149",
    "title": "Neural Mixed Effects for Nonlinear Personalized Predictions",
    "abstract": " Comments: camera-ready version ",
    "url": "https://arxiv.org/abs/2306.08149",
    "authors": [
      "Torsten Wörtwein",
      "Nicholas Allen",
      "Lisa B. Sheeber",
      "Randy P. Auerbach",
      "Jeffrey F. Cohn",
      "Louis-Philippe Morency"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.11737",
    "title": "Neural ShDF: Reviving an Efficient and Consistent Mesh Segmentation  Method",
    "abstract": " Comments: 9 pages, 13 figures, and 3 tables. Short paper and poster published and presented at SIGGRAPH 2023 ",
    "url": "https://arxiv.org/abs/2306.11737",
    "authors": [
      "Bruno Roy"
    ],
    "subjectives": [
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15142",
    "title": "LRANet: Towards Accurate and Efficient Scene Text Detection with  Low-Rank Approximation Network",
    "abstract": " Title: LRANet: Towards Accurate and Efficient Scene Text Detection with  Low-Rank Approximation Network ",
    "url": "https://arxiv.org/abs/2306.15142",
    "authors": [
      "Yuchen Su",
      "Zhineng Chen",
      "Zhiwen Shao",
      "Yuning Du",
      "Zhilong Ji",
      "Jinfeng Bai",
      "Yong Zhou",
      "Yu-Gang Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.17595",
    "title": "RBSR: Efficient and Flexible Recurrent Network for Burst  Super-Resolution",
    "abstract": " Comments: 17 pages ",
    "url": "https://arxiv.org/abs/2306.17595",
    "authors": [
      "Renlong Wu",
      "Zhilu Zhang",
      "Shuohao Zhang",
      "Hongzhi Zhang",
      "Wangmeng Zuo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.17670",
    "title": "Learning Delays in Spiking Neural Networks using Dilated Convolutions  with Learnable Spacings",
    "abstract": " Title: Learning Delays in Spiking Neural Networks using Dilated Convolutions  with Learnable Spacings ",
    "url": "https://arxiv.org/abs/2306.17670",
    "authors": [
      "Ilyass Hammouamri",
      "Ismail Khalfaoui-Hassani",
      "Timothée Masquelier"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.02329",
    "title": "Data-driven Predictive Latency for 5G: A Theoretical and Experimental  Analysis Using Network Measurements",
    "abstract": " Title: Data-driven Predictive Latency for 5G: A Theoretical and Experimental  Analysis Using Network Measurements ",
    "url": "https://arxiv.org/abs/2307.02329",
    "authors": [
      "Marco Skocaj",
      "Francesca Conserva",
      "Nicol Sarcone Grande",
      "Andrea Orsi",
      "Davide Micheli",
      "Giorgio Ghinamo",
      "Simone Bizzarri",
      "Roberto Verdone"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.04632",
    "title": "An End-To-End Analysis of Deep Learning-Based Remaining Useful Life  Algorithms for Satefy-Critical 5G-Enabled IIoT Networks",
    "abstract": " Comments: 6 pages, 4 figures. This work has been accepted for publication at IEEE PIMRC 2023 ",
    "url": "https://arxiv.org/abs/2307.04632",
    "authors": [
      "Lorenzo Mario Amorosa",
      "Nicolò Longhi",
      "Giampaolo Cuozzo",
      "Weronika Maria Bachan",
      "Valerio Lieti",
      "Enrico Buracchini",
      "Roberto Verdone"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2307.07873",
    "title": "Why Does Little Robustness Help? Understanding and Improving Adversarial  Transferability from Surrogate Training",
    "abstract": " Comments: IEEE Symposium on Security and Privacy (Oakland) 2024; Extended version of camera-ready ",
    "url": "https://arxiv.org/abs/2307.07873",
    "authors": [
      "Yechao Zhang",
      "Shengshan Hu",
      "Leo Yu Zhang",
      "Junyu Shi",
      "Minghui Li",
      "Xiaogeng Liu",
      "Wei Wan",
      "Hai Jin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09312",
    "title": "Multi-Modal Discussion Transformer: Integrating Text, Images and Graph  Transformers to Detect Hate Speech on Social Media",
    "abstract": " Comments: Under Submission ",
    "url": "https://arxiv.org/abs/2307.09312",
    "authors": [
      "Liam Hebert",
      "Gaurav Sahu",
      "Yuxuan Guo",
      "Nanda Kishore Sreenivas",
      "Lukasz Golab",
      "Robin Cohen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2307.10527",
    "title": "Manipulating Weights to Improve Stress-Graph Drawings of 3-Connected  Planar Graphs",
    "abstract": " Comments: Appears in the Proceedings of the 31st International Symposium on Graph Drawing and Network Visualization (GD 2023) ",
    "url": "https://arxiv.org/abs/2307.10527",
    "authors": [
      "Alvin Chiu",
      "David Eppstein",
      "Michael T. Goodrich"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2307.12751",
    "title": "ICF-SRSR: Invertible scale-Conditional Function for Self-Supervised  Real-world Single Image Super-Resolution",
    "abstract": " Title: ICF-SRSR: Invertible scale-Conditional Function for Self-Supervised  Real-world Single Image Super-Resolution ",
    "url": "https://arxiv.org/abs/2307.12751",
    "authors": [
      "Reyhaneh Neshatavar",
      "Mohsen Yavartanoo",
      "Sanghyun Son",
      "Kyoung Mu Lee"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.15034",
    "title": "Speeding up Fourier Neural Operators via Mixed Precision",
    "abstract": " Title: Speeding up Fourier Neural Operators via Mixed Precision ",
    "url": "https://arxiv.org/abs/2307.15034",
    "authors": [
      "Colin White",
      "Renbo Tu",
      "Jean Kossaifi",
      "Gennady Pekhimenko",
      "Kamyar Azizzadenesheli",
      "Anima Anandkumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2307.16109",
    "title": "A Message Passing Detection based Affine Frequency Division Multiplexing  Communication System",
    "abstract": " Comments: 8 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2307.16109",
    "authors": [
      "Lifan Wu",
      "Shan Luo",
      "Dongxiao Song",
      "Fan Yang",
      "Rongping Lin"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.03312",
    "title": "Symmetry-Preserving Program Representations for Learning Code Semantics",
    "abstract": " Title: Symmetry-Preserving Program Representations for Learning Code Semantics ",
    "url": "https://arxiv.org/abs/2308.03312",
    "authors": [
      "Kexin Pei",
      "Weichen Li",
      "Qirui Jin",
      "Shuyang Liu",
      "Scott Geng",
      "Lorenzo Cavallaro",
      "Junfeng Yang",
      "Suman Jana"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2308.08966",
    "title": "Weakly and Strongly Fan-Planar Graphs",
    "abstract": " Comments: Appears in the Proceedings of the 31st International Symposium on Graph Drawing and Network Visualization (GD 2023) ",
    "url": "https://arxiv.org/abs/2308.08966",
    "authors": [
      "Otfried Cheong",
      "Henry Förster",
      "Julia Katheder",
      "Maximilian Pfister",
      "Lena Schlipf"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2308.10161",
    "title": "ThermRad: A Multi-modal Dataset for Robust 3D Object Detection under  Challenging Conditions",
    "abstract": " Comments: 12 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2308.10161",
    "authors": [
      "Qiao Yan",
      "Yihan Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.10280",
    "title": "MacFormer: Map-Agent Coupled Transformer for Real-time and Robust  Trajectory Prediction",
    "abstract": " Comments: Accepted by IEEE Robotics and Automation Letters. 8 Pages, 9 Figures, 9 Tables. Video: this https URL ",
    "url": "https://arxiv.org/abs/2308.10280",
    "authors": [
      "Chen Feng",
      "Hangning Zhou",
      "Huadong Lin",
      "Zhigang Zhang",
      "Ziyao Xu",
      "Chi Zhang",
      "Boyu Zhou",
      "Shaojie Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.10902",
    "title": "CamP: Camera Preconditioning for Neural Radiance Fields",
    "abstract": " Comments: SIGGRAPH Asia 2023, Project page: this https URL ",
    "url": "https://arxiv.org/abs/2308.10902",
    "authors": [
      "Keunhong Park",
      "Philipp Henzler",
      "Ben Mildenhall",
      "Jonathan T. Barron",
      "Ricardo Martin-Brualla"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2308.10966",
    "title": "Decentralized Multi-Robot Social Navigation in Constrained Environments  via Game-Theoretic Control Barrier Functions",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2306.08815 ",
    "url": "https://arxiv.org/abs/2308.10966",
    "authors": [
      "Rohan Chandra",
      "Vrushabh Zinage",
      "Efstathios Bakolas",
      "Joydeep Biswas",
      "Peter Stone"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.11029",
    "title": "RBA-GCN: Relational Bilevel Aggregation Graph Convolutional Network for  Emotion Recognition",
    "abstract": " Title: RBA-GCN: Relational Bilevel Aggregation Graph Convolutional Network for  Emotion Recognition ",
    "url": "https://arxiv.org/abs/2308.11029",
    "authors": [
      "Lin Yuan",
      "Guoheng Huang",
      "Fenghuan Li",
      "Xiaochen Yuan",
      "Chi-Man Pun",
      "Guo Zhong"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.11155",
    "title": "xxMD: Benchmarking Neural Force Fields Using Extended Dynamics beyond  Equilibrium",
    "abstract": " Comments: 19 pages, many figures. Data available at this https URL ",
    "url": "https://arxiv.org/abs/2308.11155",
    "authors": [
      "Zihan Pengmei",
      "Yinan Shu",
      "Junyu Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Chemical Physics (physics.chem-ph)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2308.12319",
    "title": "RemovalNet: DNN Fingerprint Removal Attacks",
    "abstract": " Comments: some mistake ",
    "url": "https://arxiv.org/abs/2308.12319",
    "authors": [
      "Hongwei Yao",
      "Zheng Li",
      "Kunzhe Huang",
      "Jian Lou",
      "Zhan Qin",
      "Kui Ren"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.12628",
    "title": "TimeLighting: Guidance-enhanced Exploration of 2D Projections of  Temporal Graphs",
    "abstract": " Comments: Appears in the Proceedings of the 31st International Symposium on Graph Drawing and Network Visualization (GD 2023) ",
    "url": "https://arxiv.org/abs/2308.12628",
    "authors": [
      "Velitchko Filipov",
      "Davide Ceneda",
      "Daniel Archambault",
      "Alessio Arleo"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.13916",
    "title": "Exploring Large Language Models for Knowledge Graph Completion",
    "abstract": " Comments: Work in progress ",
    "url": "https://arxiv.org/abs/2308.13916",
    "authors": [
      "Liang Yao",
      "Jiazhen Peng",
      "Chengsheng Mao",
      "Yuan Luo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.14657",
    "title": "DeepHealthNet: Adolescent Obesity Prediction System Based on a Deep  Learning Framework",
    "abstract": " Title: DeepHealthNet: Adolescent Obesity Prediction System Based on a Deep  Learning Framework ",
    "url": "https://arxiv.org/abs/2308.14657",
    "authors": [
      "Ji-Hoon Jeong",
      "In-Gyu Lee",
      "Sung-Kyung Kim",
      "Tae-Eui Kam",
      "Seong-Whan Lee",
      "Euijong Lee"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.15791",
    "title": "Neural Video Compression with Temporal Layer-Adaptive Hierarchical  B-frame Coding",
    "abstract": " Title: Neural Video Compression with Temporal Layer-Adaptive Hierarchical  B-frame Coding ",
    "url": "https://arxiv.org/abs/2308.15791",
    "authors": [
      "Yeongwoong Kim",
      "Suyong Bahk",
      "Seungeon Kim",
      "Won Hee Lee",
      "Dokwan Oh",
      "Hui Yong Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.16145",
    "title": "CircleFormer: Circular Nuclei Detection in Whole Slide Images with  Circle Queries and Attention",
    "abstract": " Comments: Accepted at MICCAI 2023 ",
    "url": "https://arxiv.org/abs/2308.16145",
    "authors": [
      "Hengxu Zhang",
      "Pengpeng Liang",
      "Zhiyong Sun",
      "Bo Song",
      "Erkang Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16154",
    "title": "MMVP: Motion-Matrix-based Video Prediction",
    "abstract": " Comments: ICCV 2023 (Oral) ",
    "url": "https://arxiv.org/abs/2308.16154",
    "authors": [
      "Yiqi Zhong",
      "Luming Liang",
      "Ilya Zharkov",
      "Ulrich Neumann"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]