[
  {
    "id": "arXiv:2204.05995",
    "title": "Communication and Computation Assisted Sensing Information Freshness  Performance Analysis in Vehicular Networks",
    "abstract": "The timely sharing of raw sensing information in the vehicular networks (VNETs) is essential to safety. In order to improve the freshness of sensing information, joint scheduling of multi-dimensional resources such as communication and computation is required. However, the complex relevance among multi-dimensional resources is still unclear, and it is difficult to achieve efficient resource utilization. In this paper, we present a theoretical analysis for a novel metric Age of Information (AoI) on a communication and computation assisted spatial-temporal model. An uplink VNETs scenario where Road Side Units (RSUs) are deployed with computational resource is considered. The transmission and computation process is unified into a two-stage tandem queue and the expression of the average AoI is derived. The network interference is analyzed by modeling the VNETs as Cox Poisson Point Process based on stochastic geometry and the closed-form solution of the coverage probability and the expected data rate performance under the constraints of transmission resources is obtained. The simulation results reveal the basic relationship between communication and computation capacity and show that communication and computation should reach a tradeoff to improve resource utilization while ensuring real-time information requirement. ",
    "url": "https://arxiv.org/abs/2204.05995",
    "authors": [
      "Ning Jiang",
      "Shi Yan",
      "Zhuohan Liu",
      "Chunjing Hu",
      "Mugen Peng"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2204.05999",
    "title": "InCoder: A Generative Model for Code Infilling and Synthesis",
    "abstract": "Code is seldom written in a single left-to-right pass and is instead repeatedly edited and refined. We introduce InCoder, a unified generative model that can perform program synthesis (via left-to-right generation) as well as editing (via infilling). InCoder is trained to generate code files from a large corpus of permissively licensed code, where regions of code have been randomly masked and moved to the end of each file, allowing code infilling with bidirectional context. Our model is the first generative model that is able to directly perform zero-shot code infilling, which we evaluate on challenging tasks such as type inference, comment generation, and variable re-naming. We find that the ability to condition on bidirectional context substantially improves performance on these tasks, while still performing comparably on standard program synthesis benchmarks in comparison to left-to-right only models pretrained at similar scale. The InCoder models and code are publicly released. https://sites.google.com/view/incoder-code-models ",
    "url": "https://arxiv.org/abs/2204.05999",
    "authors": [
      "Daniel Fried",
      "Armen Aghajanyan",
      "Jessy Lin",
      "Sida Wang",
      "Eric Wallace",
      "Freda Shi",
      "Ruiqi Zhong",
      "Wen-tau Yih",
      "Luke Zettlemoyer",
      "Mike Lewis"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.06035",
    "title": "Optimal Cybersecurity Investments Using SIS Model: Weakly Connected  Networks",
    "abstract": "We study the problem of minimizing the (time) average security costs in large systems comprising many interdependent subsystems, where the state evolution is captured by a susceptible-infected-susceptible (SIS) model. The security costs reflect security investments, economic losses and recovery costs from infections and failures following successful attacks. However, unlike in existing studies, we assume that the underlying dependence graph is only weakly connected, but not strongly connected. When the dependence graph is not strongly connected, existing approaches to computing optimal security investments cannot be applied. Instead, we show that it is still possible to find a good solution by perturbing the problem and establishing necessary continuity results that then allow us to leverage the existing algorithms. ",
    "url": "https://arxiv.org/abs/2204.06035",
    "authors": [
      "Van Sy Mai",
      "Richard J. La",
      "Abdella Battou"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.06076",
    "title": "Hybrid Feature- and Similarity-Based Models for Prediction and  Interpretation using Large-Scale Observational Data",
    "abstract": "Introduction: Large-scale electronic health record(EHR) datasets often include simple informative features like patient age and complex data like care history that are not easily represented as individual features. Such complex data have the potential to both improve the quality of risk assessment and to enable a better understanding of causal factors leading to those risks. We propose a hybrid feature- and similarity-based model for supervised learning that combines feature and kernel learning approaches to take advantage of rich but heterogeneous observational data sources to create interpretable models for prediction and for investigation of causal relationships. Methods: The proposed hybrid model is fit by convex optimization with a sparsity-inducing penalty on the kernel portion. Feature and kernel coefficients can be fit sequentially or simultaneously. We compared our models to solely feature- and similarity-based approaches using synthetic data and using EHR data from a primary health care organization to predict risk of loneliness or social isolation. We also present a new strategy for kernel construction that is suited to high-dimensional indicator-coded EHR data. Results: The hybrid models had comparable or better predictive performance than the feature- and kernel-based approaches in both the synthetic and clinical case studies. The inherent interpretability of the hybrid model is used to explore client characteristics stratified by kernel coefficient direction in the clinical case study; we use simple examples to discuss opportunities and cautions of the two hybrid model forms when causal interpretations are desired. Conclusion: Hybrid feature- and similarity-based models provide an opportunity to capture complex, high-dimensional data within an additive model structure that supports improved prediction and interpretation relative to simple models and opaque complex models. ",
    "url": "https://arxiv.org/abs/2204.06076",
    "authors": [
      "Jacqueline K. Kueper",
      "Jennifer Rayner",
      "Daniel J. Lizotte"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.06098",
    "title": "Highly efficient reliability analysis of anisotropic heterogeneous  slopes: Machine Learning aided Monte Carlo method",
    "abstract": "Machine Learning (ML) algorithms are increasingly used as surrogate models to increase the efficiency of stochastic reliability analyses in geotechnical engineering. This paper presents a highly efficient ML aided reliability technique that is able to accurately predict the results of a Monte Carlo (MC) reliability study, and yet performs 500 times faster. A complete MC reliability analysis on anisotropic heterogeneous slopes consisting of 120,000 simulated samples is conducted in parallel to the proposed ML aided stochastic technique. Comparing the results of the complete MC study and the proposed ML aided technique, the expected errors of the proposed method are realistically examined. Circumventing the time-consuming computation of factors of safety for the training datasets, the proposed technique is more efficient than previous methods. Different ML models, including Random Forest (RF), Support Vector Machine (SVM) and Artificial Neural Networks (ANN) are presented, optimised and compared. The effects of the size and type of training and testing datasets are discussed. The expected errors of the ML predicted probability of failure are characterised by different levels of soil heterogeneity and anisotropy. Using only 1% of MC samples to train ML surrogate models, the proposed technique can accurately predict the probability of failure with mean errors limited to 0.7%. The proposed technique reduces the computational time required for our study from 306 days to only 14 hours, providing 500 times higher efficiency. ",
    "url": "https://arxiv.org/abs/2204.06098",
    "authors": [
      "Mohammad Aminpour",
      "Reza Alaie",
      "Navid Kardani",
      "Sara Moridpour",
      "Majidreza Nazem"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2204.06113",
    "title": "Liuer Mihou: A Practical Framework for Generating and Evaluating  Grey-box Adversarial Attacks against NIDS",
    "abstract": "Due to its high expressiveness and speed, Deep Learning (DL) has become an increasingly popular choice as the detection algorithm for Network-based Intrusion Detection Systems (NIDSes). Unfortunately, DL algorithms are vulnerable to adversarial examples that inject imperceptible modifications to the input and cause the DL algorithm to misclassify the input. Existing adversarial attacks in the NIDS domain often manipulate the traffic features directly, which hold no practical significance because traffic features cannot be replayed in a real network. It remains a research challenge to generate practical and evasive adversarial attacks. This paper presents the Liuer Mihou attack that generates practical and replayable adversarial network packets that can bypass anomaly-based NIDS deployed in the Internet of Things (IoT) networks. The core idea behind Liuer Mihou is to exploit adversarial transferability and generate adversarial packets on a surrogate NIDS constrained by predefined mutation operations to ensure practicality. We objectively analyse the evasiveness of Liuer Mihou against four ML-based algorithms (LOF, OCSVM, RRCF, and SOM) and the state-of-the-art NIDS, Kitsune. From the results of our experiment, we gain valuable insights into necessary conditions on the adversarial transferability of anomaly detection algorithms. Going beyond a theoretical setting, we replay the adversarial attack in a real IoT testbed to examine the practicality of Liuer Mihou. Furthermore, we demonstrate that existing feature-level adversarial defence cannot defend against Liuer Mihou and constructively criticise the limitations of feature-level adversarial defences. ",
    "url": "https://arxiv.org/abs/2204.06113",
    "authors": [
      "Ke He",
      "Dan Dongseong Kim",
      "Jing Sun",
      "Jeong Do Yoo",
      "Young Hun Lee",
      "Huy Kang Kim"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.06117",
    "title": "AdaTest:Reinforcement Learning and Adaptive Sampling for On-chip  Hardware Trojan Detection",
    "abstract": "This paper proposes AdaTest, a novel adaptive test pattern generation framework for efficient and reliable Hardware Trojan (HT) detection. HT is a backdoor attack that tampers with the design of victim integrated circuits (ICs). AdaTest improves the existing HT detection techniques in terms of scalability and accuracy of detecting smaller Trojans in the presence of noise and variations. To achieve high trigger coverage, AdaTest leverages Reinforcement Learning (RL) to produce a diverse set of test inputs. Particularly, we progressively generate test vectors with high reward values in an iterative manner. In each iteration, the test set is evaluated and adaptively expanded as needed. Furthermore, AdaTest integrates adaptive sampling to prioritize test samples that provide more information for HT detection, thus reducing the number of samples while improving the sample quality for faster exploration. We develop AdaTest with a Software/Hardware co-design principle and provide an optimized on-chip architecture solution. AdaTest's architecture minimizes the hardware overhead in two ways:(i) Deploying circuit emulation on programmable hardware to accelerate reward evaluation of the test input; (ii) Pipelining each computation stage in AdaTest by automatically constructing auxiliary circuit for test input generation, reward evaluation, and adaptive sampling. We evaluate AdaTest's performance on various HT benchmarks and compare it with two prior works that use logic testing for HT detection. Experimental results show that AdaTest engenders up to two orders of test generation speedup and two orders of test set size reduction compared to the prior works while achieving the same level or higher Trojan detection rate. ",
    "url": "https://arxiv.org/abs/2204.06117",
    "authors": [
      "Huili Chen",
      "Xinqiao Zhang",
      "Ke Huang",
      "Farinaz Koushanfar"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.06122",
    "title": "On the dynamics of credit history and social interaction features, and  their impact on creditworthiness assessment performance",
    "abstract": "For more than a half-century, credit risk management has used credit scoring models in each of its well-defined stages to manage credit risk. Application scoring is used to decide whether to grant a credit or not, while behavioral scoring is used mainly for portfolio management and to take preventive actions in case of default signals. In both cases, network data has recently been shown to be valuable to increase the predictive power of these models, especially when the borrower's historical data is scarce or not available. This study aims to understand the creditworthiness assessment performance dynamics and how it is influenced by the credit history, repayment behavior, and social network features. To accomplish this, we introduced a machine learning classification framework to analyze 97.000 individuals and companies from the moment they obtained their first loan to 12 months afterward. Our novel and massive dataset allow us to characterize each borrower according to their credit behavior, and social and economic relationships. Our research shows that borrowers' history increases performance at a decreasing rate during the first six months and then stabilizes. The most notable effect on perfomance of social networks features occurs at loan application; in personal scoring, this effect prevails a few months, while in business scoring adds value throughout the study period. These findings are of great value to improve credit risk management and optimize the use of traditional information and alternative data sources. ",
    "url": "https://arxiv.org/abs/2204.06122",
    "authors": [
      "Ricardo Muñoz-Cancino",
      "Cristián Bravo",
      "Sebastián A. Ríos",
      "Manuel Graña"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.06128",
    "title": "Are You Really Muted?: A Privacy Analysis of Mute Buttons in Video  Conferencing Apps",
    "abstract": "Video conferencing apps (VCAs) make it possible for previously private spaces -- bedrooms, living rooms, and kitchens -- into semi-public extensions of the office. For the most part, users have accepted these apps in their personal space without much thought about the permission models that govern the use of their private data during meetings. While access to a device's video camera is carefully controlled, little has been done to ensure the same level of privacy for accessing the microphone. In this work, we ask the question: what happens to the microphone data when a user clicks the mute button in a VCA? We first conduct a user study to analyze users' understanding of the permission model of the mute button. Then, using runtime binary analysis tools, we trace raw audio flow in many popular VCAs as it traverses the app from the audio driver to the network. We find fragmented policies for dealing with microphone data among VCAs -- some continuously monitor the microphone input during mute, and others do so periodically. One app transmits statistics of the audio to its telemetry servers while the app is muted. Using network traffic that we intercept en route to the telemetry server, we implement a proof-of-concept background activity classifier and demonstrate the feasibility of inferring the ongoing background activity during a meeting -- cooking, cleaning, typing, etc. We achieved 81.9% macro accuracy on identifying six common background activities using intercepted outgoing telemetry packets when a user is muted. ",
    "url": "https://arxiv.org/abs/2204.06128",
    "authors": [
      "Yucheng Yang",
      "Jack West",
      "George K. Thiruvathukal",
      "Neil Klingensmith",
      "Kassem Fawaz"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.06145",
    "title": "HIT at SemEval-2022 Task 2: Pre-trained Language Model for Idioms  Detection",
    "abstract": "The same multi-word expressions may have different meanings in different sentences. They can be mainly divided into two categories, which are literal meaning and idiomatic meaning. Non-contextual-based methods perform poorly on this problem, and we need contextual embedding to understand the idiomatic meaning of multi-word expressions correctly. We use a pre-trained language model, which can provide a context-aware sentence embedding, to detect whether multi-word expression in the sentence is idiomatic usage. ",
    "url": "https://arxiv.org/abs/2204.06145",
    "authors": [
      "Zheng Chu",
      "Ziqing Yang",
      "Yiming Cui",
      "Zhigang Chen",
      "Ming Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.06160",
    "title": "Neural Texture Extraction and Distribution for Controllable Person Image  Synthesis",
    "abstract": "We deal with the controllable person image synthesis task which aims to re-render a human from a reference image with explicit control over body pose and appearance. Observing that person images are highly structured, we propose to generate desired images by extracting and distributing semantic entities of reference images. To achieve this goal, a neural texture extraction and distribution operation based on double attention is described. This operation first extracts semantic neural textures from reference feature maps. Then, it distributes the extracted neural textures according to the spatial distributions learned from target poses. Our model is trained to predict human images in arbitrary poses, which encourages it to extract disentangled and expressive neural textures representing the appearance of different semantic entities. The disentangled representation further enables explicit appearance control. Neural textures of different reference images can be fused to control the appearance of the interested areas. Experimental comparisons show the superiority of the proposed model. Code is available at https://github.com/RenYurui/Neural-Texture-Extraction-Distribution. ",
    "url": "https://arxiv.org/abs/2204.06160",
    "authors": [
      "Yurui Ren",
      "Xiaoqing Fan",
      "Ge Li",
      "Shan Liu",
      "Thomas H. Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.06171",
    "title": "Self-Supervised Traffic Advisors: Distributed, Multi-view Traffic  Prediction for Smart Cities",
    "abstract": "Connected and Autonomous Vehicles (CAVs) are becoming more widely deployed, but it is unclear how to best deploy smart infrastructure to maximize their capabilities. One key challenge is to ensure CAVs can reliably perceive other agents, especially occluded ones. A further challenge is the desire for smart infrastructure to be autonomous and readily scalable to wide-area deployments, similar to modern traffic lights. The present work proposes the Self-Supervised Traffic Advisor (SSTA), an infrastructure edge device concept that leverages self-supervised video prediction in concert with a communication and co-training framework to enable autonomously predicting traffic throughout a smart city. An SSTA is a statically-mounted camera that overlooks an intersection or area of complex traffic flow that predicts traffic flow as future video frames and learns to communicate with neighboring SSTAs to enable predicting traffic before it appears in the Field of View (FOV). The proposed framework aims at three goals: (1) inter-device communication to enable high-quality predictions, (2) scalability to an arbitrary number of devices, and (3) lifelong online learning to ensure adaptability to changing circumstances. Finally, an SSTA can broadcast its future predicted video frames directly as information for CAVs to run their own post-processing for the purpose of control. ",
    "url": "https://arxiv.org/abs/2204.06171",
    "authors": [
      "Jiankai Sun",
      "Shreyas Kousik",
      "David Fridovich-Keil",
      "Mac Schwager"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.06173",
    "title": "Task-Driven Data Augmentation for Vision-Based Robotic Control",
    "abstract": "Today's robots often interface data-driven perception and planning models with classical model-based controllers. For example, drones often use computer vision models to estimate navigation waypoints that are tracked by model predictive control (MPC). Often, such learned perception/planning models produce erroneous waypoint predictions on out-of-distribution (OoD) or even adversarial visual inputs, which increase control cost. However, today's methods to train robust perception models are largely task-agnostic - they augment a dataset using random image transformations or adversarial examples targeted at the vision model in isolation. As such, they often introduce pixel perturbations that are ultimately benign for control, while missing those that are most adversarial. In contrast to prior work that synthesizes adversarial examples for single-step vision tasks, our key contribution is to efficiently synthesize adversarial scenarios for multi-step, model-based control. To do so, we leverage differentiable MPC methods to calculate the sensitivity of a model-based controller to errors in state estimation, which in turn guides how we synthesize adversarial inputs. We show that re-training vision models on these adversarial datasets improves control performance on OoD test scenarios by up to 28.2% compared to standard task-agnostic data augmentation. Our system is tested on examples of robotic navigation and vision-based control of an autonomous air vehicle. ",
    "url": "https://arxiv.org/abs/2204.06173",
    "authors": [
      "Shubhankar Agarwal",
      "Sandeep P. Chinchali"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.06180",
    "title": "Dynamic Neural Textures: Generating Talking-Face Videos with  Continuously Controllable Expressions",
    "abstract": "Recently, talking-face video generation has received considerable attention. So far most methods generate results with neutral expressions or expressions that are implicitly determined by neural networks in an uncontrollable way. In this paper, we propose a method to generate talking-face videos with continuously controllable expressions in real-time. Our method is based on an important observation: In contrast to facial geometry of moderate resolution, most expression information lies in textures. Then we make use of neural textures to generate high-quality talking face videos and design a novel neural network that can generate neural textures for image frames (which we called dynamic neural textures) based on the input expression and continuous intensity expression coding (CIEC). Our method uses 3DMM as a 3D model to sample the dynamic neural texture. The 3DMM does not cover the teeth area, so we propose a teeth submodule to complete the details in teeth. Results and an ablation study show the effectiveness of our method in generating high-quality talking-face videos with continuously controllable expressions. We also set up four baseline methods by combining existing representative methods and compare them with our method. Experimental results including a user study show that our method has the best performance. ",
    "url": "https://arxiv.org/abs/2204.06180",
    "authors": [
      "Zipeng Ye",
      "Zhiyao Sun",
      "Yu-Hui Wen",
      "Yanan Sun",
      "Tian Lv",
      "Ran Yi",
      "Yong-Jin Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2204.06201",
    "title": "Probing for Constituency Structure in Neural Language Models",
    "abstract": "In this paper, we investigate to which extent contextual neural language models (LMs) implicitly learn syntactic structure. More concretely, we focus on constituent structure as represented in the Penn Treebank (PTB). Using standard probing techniques based on diagnostic classifiers, we assess the accuracy of representing constituents of different categories within the neuron activations of a LM such as RoBERTa. In order to make sure that our probe focuses on syntactic knowledge and not on implicit semantic generalizations, we also experiment on a PTB version that is obtained by randomly replacing constituents with each other while keeping syntactic structure, i.e., a semantically ill-formed but syntactically well-formed version of the PTB. We find that 4 pretrained transfomer LMs obtain high performance on our probing tasks even on manipulated data, suggesting that semantic and syntactic knowledge in their representations can be separated and that constituency information is in fact learned by the LM. Moreover, we show that a complete constituency tree can be linearly separated from LM representations. ",
    "url": "https://arxiv.org/abs/2204.06201",
    "authors": [
      "David Arps",
      "Younes Samih",
      "Laura Kallmeyer",
      "Hassan Sajjad"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.06208",
    "title": "Rate Splitting Multiple Access Aided Mobile Edge Computing in Cognitive  Radio Networks",
    "abstract": "In this paper, we investigate rate splitting multiple access (RSMA) aided mobile edge computing (MEC) in a cognitive radio network. We propose a RSMA scheme that enables the secondary user to offload tasks to the MEC server utilizing dynamic rate splitting without deteriorating the primary user's offloading. The expressions for the optimal rate splitting parameters that maximize the achievable rate for the secondary user and successful computation probability of the proposed RSMA scheme are derived in closed-form. We formulate a problem to maximize successful computation probability by jointly optimizing task offloading ratio and task offloading time and obtain the optimal solutions in closed-form. Simulation results clarify that the proposed RSMA scheme achieves a higher successful computation probability than the existing non-orthogonal multiple access scheme. ",
    "url": "https://arxiv.org/abs/2204.06208",
    "authors": [
      "Hongwu Liu",
      "Yinghui Ye",
      "Zhiquan Bai",
      "Kyeong Jin Kim",
      "Theodoros A. Tsiftsis"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.06213",
    "title": "Defensive Patches for Robust Recognition in the Physical World",
    "abstract": "To operate in real-world high-stakes environments, deep learning systems have to endure noises that have been continuously thwarting their robustness. Data-end defense, which improves robustness by operations on input data instead of modifying models, has attracted intensive attention due to its feasibility in practice. However, previous data-end defenses show low generalization against diverse noises and weak transferability across multiple models. Motivated by the fact that robust recognition depends on both local and global features, we propose a defensive patch generation framework to address these problems by helping models better exploit these features. For the generalization against diverse noises, we inject class-specific identifiable patterns into a confined local patch prior, so that defensive patches could preserve more recognizable features towards specific classes, leading models for better recognition under noises. For the transferability across multiple models, we guide the defensive patches to capture more global feature correlations within a class, so that they could activate model-shared global perceptions and transfer better among models. Our defensive patches show great potentials to improve application robustness in practice by simply sticking them around target objects. Extensive experiments show that we outperform others by large margins (improve 20+\\% accuracy for both adversarial and corruption robustness on average in the digital and physical world). Our codes are available at https://github.com/nlsde-safety-team/DefensivePatch ",
    "url": "https://arxiv.org/abs/2204.06213",
    "authors": [
      "Jiakai Wang",
      "Zixin Yin",
      "Pengfei Hu",
      "Aishan Liu",
      "Renshuai Tao",
      "Haotong Qin",
      "Xianglong Liu",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.06223",
    "title": "On Validating Attack Trees with Attack Effects: An Approach from  Barwise-Seligman's Channel Theory",
    "abstract": "In security analysis, attack trees are a major tool for showing the structural decomposition of attacks and for supporting the evaluation of the quantitative properties (called attributes) of the attacks. However, the validities of decompositions are not established by attack trees themselves, and fallacious decisions about security may be made when the attack trees are inaccurate. This paper enriches attack trees with effects of attacks, with a formal system focusing on refinement scenarios. Relationships among effects indicate relationships among attacks and it allows for a systematic evaluation of attack decompositions. To describe effects this paper applies Barwise-Seligman's channel theory. Infomorphisms, in particular, play a significant role to connect effects with distinct granularities. As a result, the consistency of a decomposition is formally defined and a condition for it is stated. This framework is applied to a case study of a vehicular network system. As an application of the idea of consistency, possible degrees of mitigation for attacks in attack trees are discussed. ",
    "url": "https://arxiv.org/abs/2204.06223",
    "authors": [
      "Hideaki Nishihara",
      "Yasuyuki Kawanishi",
      "Daisuke Souma",
      "Hirotaka Yoshida"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.06230",
    "title": "Performance Analysis of Wireless Network Aided by Discrete-Phase-Shifter  IRS",
    "abstract": "Discrete phase shifters of intelligent reflecting surface (IRS) generates phase quantization error (QE) and degrades the receive performance at the receiver. To make an analysis of the performance loss caused by IRS with phase QE, based on the law of large numbers, the closed-form expressions of signal-to-noise ratio (SNR) performance loss (PL), achievable rate (AR), and bit error rate (BER) are successively derived under line-of-sight (LoS) channels and Rayleigh channels. Moreover, based on the Taylor series expansion, the approximate simple closed form of PL of IRS with approximate QE is also given. The simulation results show that the performance losses of SNR and AR decrease as the number of quantization bits increase, while they gradually increase with the number of IRS phase shifter elements increase. Regardless of LoS channels or Rayleigh channels, when the number of quantization bits is larger than or equal to 3, the performance losses of SNR and AR are less than 0.23dB and 0.08bits/s/Hz, respectively, and the BER performance degradation is trivial. In particular, the performance loss difference between IRS with QE and IRS with approximate QE is negligible when the number of quantization bits is not less than 2. ",
    "url": "https://arxiv.org/abs/2204.06230",
    "authors": [
      "Rongen Dong",
      "Yin Teng",
      "Zhongwen Sun",
      "Jun Zou",
      "Mengxing Huang",
      "Jun Li",
      "Feng Shu",
      "Jiangzhou Wang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.06233",
    "title": "Approximation of Lipschitz Functions using Deep Spline Neural Networks",
    "abstract": "Lipschitz-constrained neural networks have many applications in machine learning. Since designing and training expressive Lipschitz-constrained networks is very challenging, there is a need for improved methods and a better theoretical understanding. Unfortunately, it turns out that ReLU networks have provable disadvantages in this setting. Hence, we propose to use learnable spline activation functions with at least 3 linear regions instead. We prove that this choice is optimal among all component-wise $1$-Lipschitz activation functions in the sense that no other weight constrained architecture can approximate a larger class of functions. Additionally, this choice is at least as expressive as the recently introduced non component-wise Groupsort activation function for spectral-norm-constrained weights. Previously published numerical results support our theoretical findings. ",
    "url": "https://arxiv.org/abs/2204.06233",
    "authors": [
      "Sebastian Neumayer",
      "Alexis Goujon",
      "Pakshal Bohra",
      "Michael Unser"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2204.06240",
    "title": "CowClip: Reducing CTR Prediction Model Training Time from 12 hours to 10  minutes on 1 GPU",
    "abstract": "The click-through rate (CTR) prediction task is to predict whether a user will click on the recommended item. As mind-boggling amounts of data are produced online daily, accelerating CTR prediction model training is critical to ensuring an up-to-date model and reducing the training cost. One approach to increase the training speed is to apply large batch training. However, as shown in computer vision and natural language processing tasks, training with a large batch easily suffers from the loss of accuracy. Our experiments show that previous scaling rules fail in the training of CTR prediction neural networks. To tackle this problem, we first theoretically show that different frequencies of ids make it challenging to scale hyperparameters when scaling the batch size. To stabilize the training process in a large batch size setting, we develop the adaptive Column-wise Clipping (CowClip). It enables an easy and effective scaling rule for the embeddings, which keeps the learning rate unchanged and scales the L2 loss. We conduct extensive experiments with four CTR prediction networks on two real-world datasets and successfully scaled 128 times the original batch size without accuracy loss. In particular, for CTR prediction model DeepFM training on the Criteo dataset, our optimization framework enlarges the batch size from 1K to 128K with over 0.1% AUC improvement and reduces training time from 12 hours to 10 minutes on a single V100 GPU. Our code locates at https://github.com/zhengzangw/LargeBatchCTR. ",
    "url": "https://arxiv.org/abs/2204.06240",
    "authors": [
      "Zangwei Zheng",
      "Pengtai Xu",
      "Xuan Zou",
      "Da Tang",
      "Zhen Li",
      "Chenguang Xi",
      "Peng Wu",
      "Leqi Zou",
      "Yijie Zhu",
      "Ming Chen",
      "Xiangzhuo Ding",
      "Fuzhao Xue",
      "Ziheng Qing",
      "Youlong Cheng",
      "Yang You"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2204.06250",
    "title": "Large-scale multi-objective influence maximisation with network  downscaling",
    "abstract": "Finding the most influential nodes in a network is a computationally hard problem with several possible applications in various kinds of network-based problems. While several methods have been proposed for tackling the influence maximisation (IM) problem, their runtime typically scales poorly when the network size increases. Here, we propose an original method, based on network downscaling, that allows a multi-objective evolutionary algorithm (MOEA) to solve the IM problem on a reduced scale network, while preserving the relevant properties of the original network. The downscaled solution is then upscaled to the original network, using a mechanism based on centrality metrics such as PageRank. Our results on eight large networks (including two with $\\sim$50k nodes) demonstrate the effectiveness of the proposed method with a more than 10-fold runtime gain compared to the time needed on the original network, and an up to $82\\%$ time reduction compared to CELF. ",
    "url": "https://arxiv.org/abs/2204.06250",
    "authors": [
      "Elia Cunegatti",
      "Giovanni Iacca",
      "Doina Bucur"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.06255",
    "title": "Neural Operator with Regularity Structure for Modeling Dynamics Driven  by SPDEs",
    "abstract": "Stochastic partial differential equations (SPDEs) are significant tools for modeling dynamics in many areas including atmospheric sciences and physics. Neural Operators, generations of neural networks with capability of learning maps between infinite-dimensional spaces, are strong tools for solving parametric PDEs. However, they lack the ability to modeling SPDEs which usually have poor regularity due to the driving noise. As the theory of regularity structure has achieved great successes in analyzing SPDEs and provides the concept model feature vectors that well-approximate SPDEs' solutions, we propose the Neural Operator with Regularity Structure (NORS) which incorporates the feature vectors for modeling dynamics driven by SPDEs. We conduct experiments on various of SPDEs including the dynamic Phi41 model and the 2d stochastic Navier-Stokes equation, and the results demonstrate that the NORS is resolution-invariant, efficient, and achieves one order of magnitude lower error with a modest amount of data. ",
    "url": "https://arxiv.org/abs/2204.06255",
    "authors": [
      "Peiyan Hu",
      "Qi Meng",
      "Bingguang Chen",
      "Shiqi Gong",
      "Yue Wang",
      "Wei Chen",
      "Rongchan Zhu",
      "Zhi-Ming Ma",
      "Tie-Yan Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Analysis of PDEs (math.AP)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2204.06273",
    "title": "Towards A Critical Evaluation of Robustness for Deep Learning Backdoor  Countermeasures",
    "abstract": "Since Deep Learning (DL) backdoor attacks have been revealed as one of the most insidious adversarial attacks, a number of countermeasures have been developed with certain assumptions defined in their respective threat models. However, the robustness of these countermeasures is inadvertently ignored, which can introduce severe consequences, e.g., a countermeasure can be misused and result in a false implication of backdoor detection. For the first time, we critically examine the robustness of existing backdoor countermeasures with an initial focus on three influential model-inspection ones that are Neural Cleanse (S&P'19), ABS (CCS'19), and MNTD (S&P'21). Although the three countermeasures claim that they work well under their respective threat models, they have inherent unexplored non-robust cases depending on factors such as given tasks, model architectures, datasets, and defense hyper-parameter, which are \\textit{not even rooted from delicate adaptive attacks}. We demonstrate how to trivially bypass them aligned with their respective threat models by simply varying aforementioned factors. Particularly, for each defense, formal proofs or empirical studies are used to reveal its two non-robust cases where it is not as robust as it claims or expects, especially the recent MNTD. This work highlights the necessity of thoroughly evaluating the robustness of backdoor countermeasures to avoid their misleading security implications in unknown non-robust cases. ",
    "url": "https://arxiv.org/abs/2204.06273",
    "authors": [
      "Huming Qiu",
      "Hua Ma",
      "Zhi Zhang",
      "Alsharif Abuadbba",
      "Wei Kang",
      "Anmin Fu",
      "Yansong Gao"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.06277",
    "title": "Edge Labelled Graphs and Property Graphs; a comparison from the user  perspective",
    "abstract": "This study compares participant acceptance of the property graph and edge-labelled graph paradigms, as represented by Cypher and the proposed extensions to the W3C standards, RDF* and SPARQL*. In general, modelling preferences are consistent across the two paradigms. When presented with location information, participants preferred to create nodes to represent cities, rather than use metadata; although the preference was less marked for Cypher. In Cypher, participants showed little difference in preference between representing dates or population size as nodes. In RDF*, this choice was not necessary since both could be represented as literals. However, there was a significant preference for using the date as metadata to describe a triple containing population size, rather than vice versa. There was no significant difference overall in accuracy of interpretation of queries in the two paradigms; although in one specific case, the use of a reverse arrow in Cypher was interpreted significantly more accurately than the ^ symbol in SPARQL. Based on our results and on the comments of participants, we make some recommendations for modellers. Techniques for reifing RDF have attracted a great deal of research. Recently, a hybrid approach, employing some of the features of property graphs, has claimed to offer an improved technique for RDF reification. Query-time reasoning is also a requirement which has prompted a number of proposed extensions to SPARQL and which is only possible to a limited extent in the property graph paradigm. Another recent development, the hypergraph paradigm enables more powerful query-time reasoning. There is a need for more research into the user acceptance of these various more powerful approaches to modelling and querying. Such research should take account of complex modelling situations. ",
    "url": "https://arxiv.org/abs/2204.06277",
    "authors": [
      "Paul Warren",
      "Paul Mulholland"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2204.06299",
    "title": "TIB-VA at SemEval-2022 Task 5: A Multimodal Architecture for the  Detection and Classification of Misogynous Memes",
    "abstract": "The detection of offensive, hateful content on social media is a challenging problem that affects many online users on a daily basis. Hateful content is often used to target a group of people based on ethnicity, gender, religion and other factors. The hate or contempt toward women has been increasing on social platforms. Misogynous content detection is especially challenging when textual and visual modalities are combined to form a single context, e.g., an overlay text embedded on top of an image, also known as meme. In this paper, we present a multimodal architecture that combines textual and visual features in order to detect misogynous meme content. The proposed architecture is evaluated in the SemEval-2022 Task 5: MAMI - Multimedia Automatic Misogyny Identification challenge under the team name TIB-VA. Our solution obtained the best result in the Task-B where the challenge is to classify whether a given document is misogynous and further identify the main sub-classes of shaming, stereotype, objectification, and violence. ",
    "url": "https://arxiv.org/abs/2204.06299",
    "authors": [
      "Sherzod Hakimov",
      "Gullal S. Cheema",
      "Ralph Ewerth"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.06307",
    "title": "Multi-View Consistent Generative Adversarial Networks for 3D-aware Image  Synthesis",
    "abstract": "3D-aware image synthesis aims to generate images of objects from multiple views by learning a 3D representation. However, one key challenge remains: existing approaches lack geometry constraints, hence usually fail to generate multi-view consistent images. To address this challenge, we propose Multi-View Consistent Generative Adversarial Networks (MVCGAN) for high-quality 3D-aware image synthesis with geometry constraints. By leveraging the underlying 3D geometry information of generated images, i.e., depth and camera transformation matrix, we explicitly establish stereo correspondence between views to perform multi-view joint optimization. In particular, we enforce the photometric consistency between pairs of views and integrate a stereo mixup mechanism into the training process, encouraging the model to reason about the correct 3D shape. Besides, we design a two-stage training strategy with feature-level multi-view joint optimization to improve the image quality. Extensive experiments on three datasets demonstrate that MVCGAN achieves the state-of-the-art performance for 3D-aware image synthesis. ",
    "url": "https://arxiv.org/abs/2204.06307",
    "authors": [
      "Xuanmeng Zhang",
      "Zhedong Zheng",
      "Daiheng Gao",
      "Bang Zhang",
      "Pan Pan",
      "Yi Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.06340",
    "title": "Distributionally Robust Models with Parametric Likelihood Ratios",
    "abstract": "As machine learning models are deployed ever more broadly, it becomes increasingly important that they are not only able to perform well on their training distribution, but also yield accurate predictions when confronted with distribution shift. The Distributionally Robust Optimization (DRO) framework proposes to address this issue by training models to minimize their expected risk under a collection of distributions, to imitate test-time shifts. This is most commonly achieved by instance-level re-weighting of the training objective to emulate the likelihood ratio with possible test distributions, which allows for estimating their empirical risk via importance sampling (assuming that they are subpopulations of the training distribution). However, re-weighting schemes in the literature are usually limited due to the difficulty of keeping the optimization problem tractable and the complexity of enforcing normalization constraints. In this paper, we show that three simple ideas -- mini-batch level normalization, a KL penalty and simultaneous gradient updates -- allow us to train models with DRO using a broader class of parametric likelihood ratios. In a series of experiments on both image and text classification benchmarks, we find that models trained with the resulting parametric adversaries are consistently more robust to subpopulation shifts when compared to other DRO approaches, and that the method performs reliably well with little hyper-parameter tuning. Code to reproduce our experiments can be found at https://github.com/pmichel31415/P-DRO. ",
    "url": "https://arxiv.org/abs/2204.06340",
    "authors": [
      "Paul Michel",
      "Tatsunori Hashimoto",
      "Graham Neubig"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.06350",
    "title": "LDPC codes: comparing cluster graphs to factor graphs",
    "abstract": "We present a comparison study between a cluster and factor graph representation of LDPC codes. In probabilistic graphical models, cluster graphs retain useful dependence between random variables during inference, which are advantageous in terms of computational cost, convergence speed, and accuracy of marginal probabilities. This study investigates these benefits in the context of LDPC codes and shows that a cluster graph representation outperforms the traditional factor graph representation. ",
    "url": "https://arxiv.org/abs/2204.06350",
    "authors": [
      "J du Toit",
      "J du Preez",
      "R Wolhuter"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.06353",
    "title": "AHP: Learning to Negative Sample for Hyperedge Prediction",
    "abstract": "Hypergraphs (i.e., sets of hyperedges) naturally represent group relations (e.g., researchers co-authoring a paper and ingredients used together in a recipe), each of which corresponds to a hyperedge (i.e., a subset of nodes). Predicting future or missing hyperedges bears significant implication for many applications (e.g., collaboration and recipe recommendation). What makes hyperedge prediction particularly challenging is the vast number of non-hyperedge subsets, which grows exponentially with the number of nodes. Since it is prohibitive to use all of them as negative examples for model training, it is inevitable to sample a very small portion of them, and to this end, heuristic sampling schemes have been employed. However, trained models suffer from poor generalization capability for examples of different natures. In this paper, we propose AHP, an adversarial training-based hyperedge-prediction method. It learns to sample negative examples without relying on any heuristic schemes. Using six real hypergraphs, we show that AHP generalizes better to negative examples of various natures. It yields up to 28.2% higher AUROC than best existing methods and often even outperforms its variants with sampling schemes tailored to test sets. ",
    "url": "https://arxiv.org/abs/2204.06353",
    "authors": [
      "Hyunjin Hwang",
      "Seungwoo Lee",
      "Chanyoung Park",
      "Kijung Shin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.06371",
    "title": "Deep learning based automatic detection of offshore oil slicks using SAR  data and contextual information",
    "abstract": "Ocean surface monitoring, especially oil slick detection, has become mandatory due to its importance for oil exploration and risk prevention on ecosystems. For years, the detection task has been performed manually by photo-interpreters using Synthetic Aperture Radar (SAR) images with the help of contextual data such as wind. This tedious manual work cannot handle the increasing amount of data collected by the available sensors and thus requires automation. Literature reports conventional and semi-automated detection methods that generally focus either on oil slicks originating from anthropogenic (spills) or natural (seeps) sources on limited data collections. As an extension, this paper presents the automation of offshore oil slicks on an extensive database with both kinds of slicks. It builds upon the slick annotations of specialized photo-interpreters on Sentinel-1 SAR data for 4 years over 3 exploration and monitoring areas worldwide. All the considered SAR images and related annotation relate to real oil slick monitoring scenarios. Further, wind estimation is systematically computed to enrich the data collection. Paper contributions are the following : (i) a performance comparison of two deep learning approaches: semantic segmentation using FC-DenseNet and instance segmentation using Mask-RCNN. (ii) the introduction of meteorological information (wind speed) is deemed valuable for oil slick detection in the performance evaluation. The main results of this study show the effectiveness of slick detection by deep learning approaches, in particular FC-DenseNet, which captures more than 92% of oil instances in our test set. Furthermore, a strong correlation between model performances and contextual information such as slick size and wind speed is demonstrated in the performance evaluation. This work opens perspectives to design models that can fuse SAR and wind information to reduce the false alarm rate. ",
    "url": "https://arxiv.org/abs/2204.06371",
    "authors": [
      "Emna Amri",
      "Hermann Courteille",
      "A Benoit",
      "Philippe Bolon",
      "Dominique Dubucq",
      "Gilles Poulain",
      "Anthony Credoz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.06386",
    "title": "Efficient Deep Neural Network Accelerator Using Controlled Ferroelectric  Domain Dynamics",
    "abstract": "The current work reports an efficient deep neural network (DNN) accelerator where synaptic weight elements are controlled by ferroelectric domain dynamics. An integrated device-to-algorithm framework for benchmarking novel synaptic devices is used. In P(VDF-TrFE) based ferroelectric tunnel junctions, analog conductance states are measured using a custom pulsing protocol and associated custom circuits and array architectures for DNN training is simulated. Our results show precise control of polarization switching dynamics in multi-domain, polycrystalline ferroelectric thin films can produce considerable weight update linearity in metal-ferroelectric-semiconductor (MFS) tunnel junctions. Ultrafast switching and low junction current in these devices offer extremely energy efficient operation. Through an integrated platform of hardware development, characterization and modelling, we predict the available conductance range where linearity is expected under identical potentiating and depressing pulses for efficient DNN training and inference tasks. As an example, an analog crossbar based DNN accelerator with MFS junctions as synaptic weight elements showed ~ 93% training accuracy on large MNIST handwritten digit dataset while for cropped images, a 95% accuracy is achieved. One observed challenge is rather limited dynamic conductance range while operating under identical potentiating and depressing pulses below 1V. Investigation is underway for improving the dynamic conductance range without losing the weight update linearity. ",
    "url": "https://arxiv.org/abs/2204.06386",
    "authors": [
      "Sayani Majumdar"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Applied Physics (physics.app-ph)"
    ]
  },
  {
    "id": "arXiv:2204.06389",
    "title": "CRUSH: Contextually Regularized and User anchored Self-supervised Hate  speech Detection",
    "abstract": "The last decade has witnessed a surge in the interaction of people through social networking platforms. While there are several positive aspects of these social platforms, the proliferation has led them to become the breeding ground for cyber-bullying and hate speech. Recent advances in NLP have often been used to mitigate the spread of such hateful content. Since the task of hate speech detection is usually applicable in the context of social networks, we introduce CRUSH, a framework for hate speech detection using user-anchored self-supervision and contextual regularization. Our proposed approach secures ~ 1-12% improvement in test set metrics over best performing previous approaches on two types of tasks and multiple popular english social media datasets. ",
    "url": "https://arxiv.org/abs/2204.06389",
    "authors": [
      "Parag Dutta",
      "Souvic Chakraborty",
      "Sumegh Roychowdhury",
      "Animesh Mukherjee"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.06431",
    "title": "Stochastic Finite Volume Method for Uncertainty Quantification of  Transient Flow in Gas Pipeline Networks",
    "abstract": "We develop a weakly intrusive framework to simulate the propagation of uncertainty in solutions of generic hyperbolic partial differential equation systems on graph-connected domains with nodal coupling and boundary conditions. The method is based on the Stochastic Finite Volume (SFV) approach, and can be applied for uncertainty quantification (UQ) of the dynamical state of fluid flow over actuated transport networks. The numerical scheme has specific advantages for modeling intertemporal uncertainty in time-varying boundary parameters, which cannot be characterized by strict upper and lower (interval) bounds. We describe the scheme for a single pipe, and then formulate the controlled junction Riemann problem (JRP) that enables the extension to general network structures. We demonstrate the method's capabilities and performance characteristics using a standard benchmark test network. ",
    "url": "https://arxiv.org/abs/2204.06431",
    "authors": [
      "Svetlana Tokareva",
      "Anatoly Zlotnik",
      "Vitaliy Gyrya"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2204.06436",
    "title": "Label Augmentation with Reinforced Labeling for Weak Supervision",
    "abstract": "Weak supervision (WS) is an alternative to the traditional supervised learning to address the need for ground truth. Data programming is a practical WS approach that allows programmatic labeling data samples using labeling functions (LFs) instead of hand-labeling each data point. However, the existing approach fails to fully exploit the domain knowledge encoded into LFs, especially when the LFs' coverage is low. This is due to the common data programming pipeline that neglects to utilize data features during the generative process. This paper proposes a new approach called reinforced labeling (RL). Given an unlabeled dataset and a set of LFs, RL augments the LFs' outputs to cases not covered by LFs based on similarities among samples. Thus, RL can lead to higher labeling coverage for training an end classifier. The experiments on several domains (classification of YouTube comments, wine quality, and weather prediction) result in considerable gains. The new approach produces significant performance improvement, leading up to +21 points in accuracy and +61 points in F1 scores compared to the state-of-the-art data programming approach. ",
    "url": "https://arxiv.org/abs/2204.06436",
    "authors": [
      "Gürkan Solmaz",
      "Flavio Cirillo",
      "Fabio Maresca",
      "Anagha Gode Anil Kumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.06439",
    "title": "Receptive Field Analysis of Temporal Convolutional Networks for Monaural  Speech Dereverberation",
    "abstract": "Speech dereverberation is often an important requirement in robust speech processing tasks. Supervised deep learning (DL) models give state-of-the-art performance for single-channel speech dereverberation. Temporal convolutional networks (TCNs) are commonly used for sequence modelling in speech enhancement tasks. A feature of TCNs is that they have a receptive field (RF) dependant on the specific model configuration which determines the number of input frames that can be observed to produce an individual output frame. It has been shown that TCNs are capable of performing dereverberation of simulated speech data, however a thorough analysis, especially with focus on the RF is yet lacking in the literature. This paper analyses dereverberation performance depending on the model size and the RF of TCNs. Experiments using the WHAMR corpus which is extended to include room impulse responses (RIRs) with larger T60 values demonstrate that a larger RF can have significant improvement in performance when training smaller TCN models. It is also demonstrated that TCNs benefit from a wider RF when dereverberating RIRs with larger RT60 values. ",
    "url": "https://arxiv.org/abs/2204.06439",
    "authors": [
      "William Ravenscroft",
      "Stefan Goetze",
      "Thomas Hain"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.06447",
    "title": "CamBench -- Cryptographic API Misuse Detection Tool Benchmark Suite",
    "abstract": "Context: Cryptographic APIs are often misused in real-world applications. Therefore, many cryptographic API misuse detection tools have been introduced. However, there exists no established reference benchmark for a fair and comprehensive comparison and evaluation of these tools. While there are benchmarks, they often only address a subset of the domain or were only used to evaluate a subset of existing misuse detection tools. Objective: To fairly compare cryptographic API misuse detection tools and to drive future development in this domain, we will devise such a benchmark. Openness and transparency in the generation process are key factors to fairly generate and establish the needed benchmark. Method: We propose an approach where we derive the benchmark generation methodology from the literature which consists of general best practices in benchmarking and domain-specific benchmark generation. A part of this methodology is transparency and openness of the generation process, which is achieved by pre-registering this work. Based on our methodology we design CamBench, a fair \"Cryptographic API Misuse Detection Tool Benchmark Suite\". We will implement the first version of CamBench limiting the domain to Java, the JCA, and static analyses. Finally, we will use CamBench to compare current misuse detection tools and compare CamBench to related benchmarks of its domain. ",
    "url": "https://arxiv.org/abs/2204.06447",
    "authors": [
      "Michael Schlichtig",
      "Anna-Katharina Wickert",
      "Stefan Krüger",
      "Eric Bodden",
      "Mira Mezini"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.06454",
    "title": "DMCNet: Diversified Model Combination Network for Understanding  Engagement from Video Screengrabs",
    "abstract": "Engagement is an essential indicator of the Quality-of-Learning Experience (QoLE) and plays a major role in developing intelligent educational interfaces. The number of people learning through Massively Open Online Courses (MOOCs) and other online resources has been increasing rapidly because they provide us with the flexibility to learn from anywhere at any time. This provides a good learning experience for the students. However, such learning interface requires the ability to recognize the level of engagement of the students for a holistic learning experience. This is useful for both students and educators alike. However, understanding engagement is a challenging task, because of its subjectivity and ability to collect data. In this paper, we propose a variety of models that have been trained on an open-source dataset of video screengrabs. Our non-deep learning models are based on the combination of popular algorithms such as Histogram of Oriented Gradient (HOG), Support Vector Machine (SVM), Scale Invariant Feature Transform (SIFT) and Speeded Up Robust Features (SURF). The deep learning methods include Densely Connected Convolutional Networks (DenseNet-121), Residual Network (ResNet-18) and MobileNetV1. We show the performance of each models using a variety of metrics such as the Gini Index, Adjusted F-Measure (AGF), and Area Under receiver operating characteristic Curve (AUC). We use various dimensionality reduction techniques such as Principal Component Analysis (PCA) and t-Distributed Stochastic Neighbor Embedding (t-SNE) to understand the distribution of data in the feature sub-space. Our work will thereby assist the educators and students in obtaining a fruitful and efficient online learning experience. ",
    "url": "https://arxiv.org/abs/2204.06454",
    "authors": [
      "Sarthak Batra",
      "Hewei Wang",
      "Avishek Nag",
      "Philippe Brodeur",
      "Marianne Checkley",
      "Annette Klinkert",
      "Soumyabrata Dev"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.06471",
    "title": "Hybrid Neural Network Augmented Physics-based Models for Nonlinear  Filtering",
    "abstract": "In this paper we present a hybrid neural network augmented physics-based modeling (APBM) framework for Bayesian nonlinear latent space estimation. The proposed APBM strategy allows for model adaptation when new operation conditions come into play or the physics-based model is insufficient (or incomplete) to properly describe the latent phenomenon. One advantage of the APBMs and our estimation procedure is the capability of maintaining the physical interpretability of estimated states. Furthermore, we propose a constraint filtering approach to control the neural network contributions to the overall model. We also exploit assumed density filtering techniques and cubature integration rules to present a flexible estimation strategy that can easily deal with nonlinear models and high-dimensional latent spaces. Finally, we demonstrate the efficacy of our methodology by leveraging a target tracking scenario with nonlinear and incomplete measurement and acceleration models, respectively. ",
    "url": "https://arxiv.org/abs/2204.06471",
    "authors": [
      "Tales Imbiriba",
      "Ahmet Demirkaya",
      "Jindřich Duník",
      "Ondřej Straka",
      "Deniz Erdoğmuş",
      "Pau Closas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2204.06486",
    "title": "Bounding the difference between model predictive control and neural  networks",
    "abstract": "There is a growing debate on whether the future of feedback control systems will be dominated by data-driven or model-driven approaches. Each of these two approaches has their own complimentary set of advantages and disadvantages, however, only limited attempts have, so far, been developed to bridge the gap between them. To address this issue, this paper introduces a method to bound the worst-case error between feedback control policies based upon model predictive control (MPC) and neural networks (NNs). This result is leveraged into an approach to automatically synthesize MPC policies minimising the worst-case error with respect to a NN. Numerical examples highlight the application of the bounds, with the goal of the paper being to encourage a more quantitative understanding of the relationship between data-driven and model-driven control. ",
    "url": "https://arxiv.org/abs/2204.06486",
    "authors": [
      "Ross Drummond",
      "Stephen R. Duncan",
      "Matthew C. Turner",
      "Patricia Pauli",
      "Frank Allgöwer"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.06507",
    "title": "Out-of-distribution Detection with Deep Nearest Neighbors",
    "abstract": "Out-of-distribution (OOD) detection is a critical task for deploying machine learning models in the open world. Distance-based methods have demonstrated promise, where testing samples are detected as OOD if they are relatively far away from in-distribution (ID) data. However, prior methods impose a strong distributional assumption of the underlying feature space, which may not always hold. In this paper, we explore the efficacy of non-parametric nearest-neighbor distance for OOD detection, which has been largely overlooked in the literature. Unlike prior works, our method does not impose any distributional assumption, hence providing stronger flexibility and generality. We demonstrate the effectiveness of nearest-neighbor-based OOD detection on several benchmarks and establish superior performance. Under the same model trained on ImageNet-1k, our method substantially reduces the false positive rate (FPR@TPR95) by 24.77% compared to a strong baseline SSD+, which uses a parametric approach Mahalanobis distance in detection. ",
    "url": "https://arxiv.org/abs/2204.06507",
    "authors": [
      "Yiyou Sun",
      "Yifei Ming",
      "Xiaojin Zhu",
      "Yixuan Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.06508",
    "title": "FactGraph: Evaluating Factuality in Summarization with Semantic Graph  Representations",
    "abstract": "Despite recent improvements in abstractive summarization, most current approaches generate summaries that are not factually consistent with the source document, severely restricting their trust and usage in real-world applications. Recent works have shown promising improvements in factuality error identification using text or dependency arc entailments; however, they do not consider the entire semantic graph simultaneously. To this end, we propose FactGraph, a method that decomposes the document and the summary into structured meaning representations (MR), which are more suitable for factuality evaluation. MRs describe core semantic concepts and their relations, aggregating the main content in both document and summary in a canonical form, and reducing data sparsity. FactGraph encodes such graphs using a graph encoder augmented with structure-aware adapters to capture interactions among the concepts based on the graph connectivity, along with text representations using an adapter-based text encoder. Experiments on different benchmarks for evaluating factuality show that FactGraph outperforms previous approaches by up to 15%. Furthermore, FactGraph improves performance on identifying content verifiability errors and better captures subsentence-level factual inconsistencies. ",
    "url": "https://arxiv.org/abs/2204.06508",
    "authors": [
      "Leonardo F. R. Ribeiro",
      "Mengwen Liu",
      "Iryna Gurevych",
      "Markus Dreyer",
      "Mohit Bansal"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.06511",
    "title": "On Extremal Rates of Secure Storage over Graphs",
    "abstract": "A secure storage code maps $K$ source symbols, each of $L_w$ bits, to $N$ coded symbols, each of $L_v$ bits, such that each coded symbol is stored in a node of a graph. Each edge of the graph is either associated with $D$ of the $K$ source symbols such that from the pair of nodes connected by the edge, we can decode the $D$ source symbols and learn no information about the remaining $K-D$ source symbols; or the edge is associated with no source symbols such that from the pair of nodes connected by the edge, nothing about the $K$ source symbols is revealed. The ratio $L_w/L_v$ is called the symbol rate of a secure storage code and the highest possible symbol rate is called the capacity. We characterize all graphs over which the capacity of a secure storage code is equal to $1$, when $D = 1$. This result is generalized to $D> 1$, i.e., we characterize all graphs over which the capacity of a secure storage code is equal to $1/D$ under a mild condition that for any node, the source symbols associated with each of its connected edges do not include a common element. Further, we characterize all graphs over which the capacity of a secure storage code is equal to $2/D$. ",
    "url": "https://arxiv.org/abs/2204.06511",
    "authors": [
      "Zhou Li",
      "Hua Sun"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2204.06522",
    "title": "Graph Enhanced BERT for Query Understanding",
    "abstract": "Query understanding plays a key role in exploring users' search intents and facilitating users to locate their most desired information. However, it is inherently challenging since it needs to capture semantic information from short and ambiguous queries and often requires massive task-specific labeled data. In recent years, pre-trained language models (PLMs) have advanced various natural language processing tasks because they can extract general semantic information from large-scale corpora. Therefore, there are unprecedented opportunities to adopt PLMs for query understanding. However, there is a gap between the goal of query understanding and existing pre-training strategies -- the goal of query understanding is to boost search performance while existing strategies rarely consider this goal. Thus, directly applying them to query understanding is sub-optimal. On the other hand, search logs contain user clicks between queries and urls that provide rich users' search behavioral information on queries beyond their content. Therefore, in this paper, we aim to fill this gap by exploring search logs. In particular, to incorporate search logs into pre-training, we first construct a query graph where nodes are queries and two queries are connected if they lead to clicks on the same urls. Then we propose a novel graph-enhanced pre-training framework, GE-BERT, which can leverage both query content and the query graph. In other words, GE-BERT can capture both the semantic information and the users' search behavioral information of queries. Extensive experiments on various query understanding tasks have demonstrated the effectiveness of the proposed framework. ",
    "url": "https://arxiv.org/abs/2204.06522",
    "authors": [
      "Juanhui Li",
      "Yao Ma",
      "Wei Zeng",
      "Suqi Cheng",
      "Jiliang Tang",
      "Shuaiqiang Wang",
      "Dawei Yin"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.06531",
    "title": "Software Supply Chain Map: How Reuse Networks Expand",
    "abstract": "Clone-and-own is a typical code reuse approach because of its simplicity and efficiency. Cloned software components are maintained independently by a new owner. These clone-and-own operations can be occurred sequentially, that is, cloned components can be cloned again and owned by other new owners on the supply chain. In general, code reuse is not documented well, consequently, appropriate changes like security patches cannot be propagated to descendant software projects. However, the OpenChain Project defined identifying and tracking source code reuses as responsibilities of FLOSS software staffs. Hence supporting source code reuse awareness is in a real need. This paper studies software reuse relations in FLOSS ecosystem. Technically, clone-and-own reuses of source code can be identified by file-level clone set detection. Since change histories are associated with files, we can determine origins and destinations in reusing across multiple software by considering times. By building software supply chain maps, we find that clone-and-own is prevalent in FLOSS development, and set of files are reused widely and repeatedly. These observations open up future challenges of maintaining and tracking global software genealogies. ",
    "url": "https://arxiv.org/abs/2204.06531",
    "authors": [
      "Hideaki Hata",
      "Takashi Ishio"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.06552",
    "title": "Neural Vector Fields for Surface Representation and Inference",
    "abstract": "Neural implicit fields have recently been shown to represent 3D shapes accurately, opening up various applications in 3D shape analysis. Up to now, such implicit fields for 3D representation are scalar, encoding the signed distance or binary volume occupancy and more recently the unsigned distance. However, the first two can only represent closed shapes, while the unsigned distance has difficulties in accurate and fast shape inference. In this paper, we propose a Neural Vector Field for shape representation in order to overcome the two aforementioned problems. Mapping each point in space to the direction towards the closest surface, we can represent any type of shape. Similarly the shape mesh can be reconstructed by applying the marching cubes algorithm, with proposed small changes, on top of the inferred vector field. We compare the method on ShapeNet where the proposed new neural implicit field shows superior accuracy in representing both closed and open shapes outperforming previous methods. ",
    "url": "https://arxiv.org/abs/2204.06552",
    "authors": [
      "Edoardo Mello Rella",
      "Ajad Chhatkuli",
      "Ender Konukoglu",
      "Luc Van Gool"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.06062",
    "title": "Local and global topological complexity measures OF ReLU neural network  functions",
    "abstract": "We apply a generalized piecewise-linear (PL) version of Morse theory due to Grunert-Kuhnel-Rote to define and study new local and global notions of topological complexity for fully-connected feedforward ReLU neural network functions, F: R^n -> R. Along the way, we show how to construct, for each such F, a canonical polytopal complex K(F) and a deformation retract of the domain onto K(F), yielding a convenient compact model for performing calculations. We also give a combinatorial description of local complexity for depth 2 networks, and a construction showing that local complexity can be arbitrarily high. ",
    "url": "https://arxiv.org/abs/2204.06062",
    "authors": [
      "J. Elisenda Grigsby",
      "Kathryn Lindsey",
      "Marissa Masden"
    ],
    "subjectives": [
      "Algebraic Topology (math.AT)",
      "Computational Geometry (cs.CG)",
      "Machine Learning (cs.LG)",
      "Geometric Topology (math.GT)"
    ]
  },
  {
    "id": "arXiv:2204.06109",
    "title": "Prediction of motor insurance claims occurrence as an imbalanced machine  learning problem",
    "abstract": "The insurance industry, with its large datasets, is a natural place to use big data solutions. However it must be stressed, that significant number of applications for machine learning in insurance industry, like fraud detection or claim prediction, deals with the problem of machine learning on an imbalanced data set. This is due to the fact that frauds or claims are rare events when compared with the entire population of drivers. The problem of imbalanced learning is often hard to overcome. Therefore, the main goal of this work is to present and apply various methods of dealing with an imbalanced dataset in the context of claim occurrence prediction in car insurance. In addition, the above techniques are used to compare the results of machine learning algorithms in the context of claim occurrence prediction in car insurance. Our study covers the following techniques: logistic-regression, decision tree, random forest, xgBoost, feed-forward network. The problem is the classification one. ",
    "url": "https://arxiv.org/abs/2204.06109",
    "authors": [
      "Sebastian Baran",
      "Przemysław Rola"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.06274",
    "title": "Overparameterized Linear Regression under Adversarial Attacks",
    "abstract": "As machine learning models start to be used in critical applications, their vulnerabilities and brittleness become a pressing concern. Adversarial attacks are a popular framework for studying these vulnerabilities. In this work, we study the error of linear regression in the face of adversarial attacks. We provide bounds of the error in terms of the traditional risk and the parameter norm and show how these bounds can be leveraged and make it possible to use analysis from non-adversarial setups to study the adversarial risk. The usefulness of these results is illustrated by shedding light on whether or not overparameterized linear models can be adversarially robust. We show that adding features to linear models might be either a source of additional robustness or brittleness. We show that these differences appear due to scaling and how the $\\ell_1$ and $\\ell_2$ norms of random projections concentrate. We also show how the reformulation we propose allows for solving adversarial training as a convex optimization problem. This is then used as a tool to study how adversarial training and other regularization methods might affect the robustness of the estimated models. ",
    "url": "https://arxiv.org/abs/2204.06274",
    "authors": [
      "Antônio H. Ribeiro",
      "Thomas B. Schön"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2204.06445",
    "title": "Random Graph Embedding and Joint Sparse Regularization for Multi-label  Feature Selection",
    "abstract": "Multi-label learning is often used to mine the correlation between variables and multiple labels, and its research focuses on fully extracting the information between variables and labels. The $\\ell_{2,1}$ regularization is often used to get a sparse coefficient matrix, but the problem of multicollinearity among variables cannot be effectively solved. In this paper, the proposed model can choose the most relevant variables by solving a joint constraint optimization problem using the $\\ell_{2,1}$ regularization and Frobenius regularization. In manifold regularization, we carry out a random walk strategy based on the joint structure to construct a neighborhood graph, which is highly robust to outliers. In addition, we give an iterative algorithm of the proposed method and proved the convergence of this algorithm. The experiments on the real-world data sets also show that the comprehensive performance of our method is consistently better than the classical method. ",
    "url": "https://arxiv.org/abs/2204.06445",
    "authors": [
      "Haibao Li",
      "Hongzhi Zhai"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.06466",
    "title": "Grand canonical ensembles of sparse networks and Bayesian inference",
    "abstract": "Maximum entropy network ensembles have been very successful to model sparse network topologies and to solve challenging inference problems. However the sparse maximum entropy network models proposed so far have fixed number of nodes and are typically not exchangeable. Here we consider hierarchical models for exchangeable networks in the sparse limit, i.e. with the total number of links scaling linearly with the total number of nodes. The approach is grand canonical, i.e. the number of nodes of the network is not fixed a priori: it is finite but can be arbitrarily large. In this way the grand canonical network ensembles circumvent the difficulties in treating infinite sparse exchangeable networks which according to the Aldous-Hoover theorem must vanish. The approach can treat networks with given degree distribution or networks with given distribution of latent variables. When only a subgraph induced by a subset of nodes is known, this model allows a Bayesian estimation of the network size and the degree sequence (or the sequence of latent variables) of the entire network which can be used for network reconstruction. ",
    "url": "https://arxiv.org/abs/2204.06466",
    "authors": [
      "Ginestra Bianconi"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Social and Information Networks (cs.SI)",
      "Statistics Theory (math.ST)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2204.06478",
    "title": "BEHM-GAN: Bandwidth Extension of Historical Music using Generative  Adversarial Networks",
    "abstract": "Audio bandwidth extension aims to expand the spectrum of narrow-band audio signals. Although this topic has been broadly studied during recent years, the particular problem of extending the bandwidth of historical music recordings remains an open challenge. This paper proposes BEHM-GAN, a model based on generative adversarial networks, as a practical solution to this problem. The proposed method works with the complex spectrogram representation of audio and, thanks to a dedicated regularization strategy, can effectively extend the bandwidth of out-of-distribution real historical recordings. The BEHM-GAN is designed to be applied as a second step after denoising the recording to suppress any additive disturbances, such as clicks and background noise. We train and evaluate the method using solo piano classical music. The proposed method outperforms the compared baselines in both objective and subjective experiments. The results of a formal blind listening test show that BEHM-GAN significantly increases the perceptual sound quality in early-20th-century gramophone recordings. For several items, there is a substantial improvement in the mean opinion score after enhancing historical recordings with the proposed bandwidth-extension algorithm. This study represents a relevant step toward data-driven music restoration in real-world scenarios. ",
    "url": "https://arxiv.org/abs/2204.06478",
    "authors": [
      "Eloi Moliner",
      "Vesa Välimäki"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2002.11892",
    "title": "Efficient Multi-Agent Motion Planning in Continuous Workspaces Using  Medial-Axis-Based Swap Graphs",
    "abstract": " Title: Efficient Multi-Agent Motion Planning in Continuous Workspaces Using  Medial-Axis-Based Swap Graphs ",
    "url": "https://arxiv.org/abs/2002.11892",
    "authors": [
      "Liang He",
      "Zherong Pan",
      "Kiril Solovey",
      "Biao Jia",
      "Dinesh Manocha"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2101.10102",
    "title": "Towards Practical Robustness Analysis for DNNs based on PAC-Model  Learning",
    "abstract": " Title: Towards Practical Robustness Analysis for DNNs based on PAC-Model  Learning ",
    "url": "https://arxiv.org/abs/2101.10102",
    "authors": [
      "Renjue Li",
      "Pengfei Yang",
      "Cheng-Chao Huang",
      "Youcheng Sun",
      "Bai Xue",
      "Lijun Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2104.01481",
    "title": "Do We Need Anisotropic Graph Neural Networks?",
    "abstract": " Comments: Published as a conference paper at ICLR 2022 ",
    "url": "https://arxiv.org/abs/2104.01481",
    "authors": [
      "Shyam A. Tailor",
      "Felix L. Opolka",
      "Pietro Liò",
      "Nicholas D. Lane"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.01847",
    "title": "Social contagion and asset prices: Reddit's self-organised bull runs",
    "abstract": " Comments: This paper was originally put online as a departmental pre-print on the departmental website at this http URL and on MPRA on February 2, 2021 ",
    "url": "https://arxiv.org/abs/2104.01847",
    "authors": [
      "Valentina Semenova",
      "Julian Winkler"
    ],
    "subjectives": [
      "General Economics (econ.GN)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2104.12950",
    "title": "Document Structure aware Relational Graph Convolutional Networks for  Ontology Population",
    "abstract": " Comments: 8 pages single column, 5 figures. DLG4NLP Workshop at ICLR 2022 ",
    "url": "https://arxiv.org/abs/2104.12950",
    "authors": [
      "Abhay M Shalghar",
      "Ayush Kumar",
      "Balaji Ganesan",
      "Aswin Kannan",
      "Akshay Parekh",
      "Shobha G"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2105.04301",
    "title": "ADASYN-Random Forest Based Intrusion Detection Model",
    "abstract": " Comments: Accepted by SPML 2021 and hereby declared that the research of this paper has nothing to do with Linyue Zhou, so we deleted her name ",
    "url": "https://arxiv.org/abs/2105.04301",
    "authors": [
      "Zhewei Chen",
      "Wenwen Yu",
      "Linyue Zhou"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.09464",
    "title": "Content-Augmented Feature Pyramid Network with Light Linear Spatial  Transformers for Object Detection",
    "abstract": " Comments: 16 pages,7 figures,8 tables ",
    "url": "https://arxiv.org/abs/2105.09464",
    "authors": [
      "Yongxiang Gu",
      "Xiaolin Qin",
      "Yuncong Peng",
      "Lu Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2105.13856",
    "title": "Lightweight Cross-Lingual Sentence Representation Learning",
    "abstract": " Comments: ACL 2021 main conference ",
    "url": "https://arxiv.org/abs/2105.13856",
    "authors": [
      "Zhuoyuan Mao",
      "Prakhar Gupta",
      "Pei Wang",
      "Chenhui Chu",
      "Martin Jaggi",
      "Sadao Kurohashi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.08745",
    "title": "Global random walk solvers for reactive transport and biodegradation  processes in heterogeneous porous media",
    "abstract": " Comments: 23 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2107.08745",
    "authors": [
      "Nicolae Suciu",
      "Florin A. Radu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2107.08924",
    "title": "Epistemic Neural Networks",
    "abstract": " Title: Epistemic Neural Networks ",
    "url": "https://arxiv.org/abs/2107.08924",
    "authors": [
      "Ian Osband",
      "Zheng Wen",
      "Seyed Mohammad Asghari",
      "Vikranth Dwaracherla",
      "Morteza Ibrahimi",
      "Xiyuan Lu",
      "Benjamin Van Roy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2109.04379",
    "title": "Preservational Learning Improves Self-supervised Medical Image Models by  Reconstructing Diverse Contexts",
    "abstract": " Comments: Supplementary material is added. Codes are available at this https URL ",
    "url": "https://arxiv.org/abs/2109.04379",
    "authors": [
      "Hong-Yu Zhou",
      "Chixiang Lu",
      "Sibei Yang",
      "Xiaoguang Han",
      "Yizhou Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.12109",
    "title": "Autonomy and Perception for Space Mining",
    "abstract": " Comments: This paper describes our 3rd place and innovation award winning solution to the NASA Space Robotics Challenge Phase 2 ",
    "url": "https://arxiv.org/abs/2109.12109",
    "authors": [
      "Ragav Sachdeva",
      "Ravi Hammond",
      "James Bockman",
      "Alec Arthur",
      "Brandon Smart",
      "Dustin Craggs",
      "Anh-Dzung Doan",
      "Thomas Rowntree",
      "Elijah Schutz",
      "Adrian Orenstein",
      "Andy Yu",
      "Tat-Jun Chin",
      "Ian Reid"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.14779",
    "title": "Time Coordination of Multiple UAVs over Switching Communication Networks  with Digraph Topologies",
    "abstract": " Title: Time Coordination of Multiple UAVs over Switching Communication Networks  with Digraph Topologies ",
    "url": "https://arxiv.org/abs/2109.14779",
    "authors": [
      "Hyungsoo Kang",
      "Hyung-Jin Yoon",
      "Venanzio Cichella",
      "Naira Hovakimyan",
      "Petros Voulgaris"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2110.01456",
    "title": "Planning 5G Networks for Rural Fixed Wireless Access",
    "abstract": " Comments: 16 pages, 9 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2110.01456",
    "authors": [
      "Andrew Lappalainen",
      "Yuhao Zhang",
      "Catherine Rosenberg"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2110.07077",
    "title": "Modeling and Analysis of Intermittent Federated Learning Over  Cellular-Connected UAV Networks",
    "abstract": " Comments: 6 pages, 3 figures, conference ",
    "url": "https://arxiv.org/abs/2110.07077",
    "authors": [
      "Chun-Hung Liu",
      "Di-Chun Liang",
      "Rung-Hung Gau",
      "Lu Wei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2110.08547",
    "title": "Towards Making the Most of Multilingual Pretraining for Zero-Shot Neural  Machine Translation",
    "abstract": " Comments: Accepted to ACL 2022. Code will be available at [this https URL] ",
    "url": "https://arxiv.org/abs/2110.08547",
    "authors": [
      "Guanhua Chen",
      "Shuming Ma",
      "Yun Chen",
      "Dongdong Zhang",
      "Jia Pan",
      "Wenping Wang",
      "Furu Wei"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2110.14181",
    "title": "QU-net++: Image Quality Detection Framework for Segmentation of Medical  3D Image Stacks",
    "abstract": " Comments: 4 pages, 7 figures, 1 Table ",
    "url": "https://arxiv.org/abs/2110.14181",
    "authors": [
      "Sohini Roychowdhury"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.14763",
    "title": "Using PPP Information to Implement a Global Real-Time Virtual Network  DGNSS Approach",
    "abstract": " Comments: 14 pages, 8 tables, 4 figures, Code and data are available at this https URL ",
    "url": "https://arxiv.org/abs/2110.14763",
    "authors": [
      "Wang Hu",
      "Ashim Neupane",
      "Jay A. Farrell"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2111.05955",
    "title": "Keys to Accurate Feature Extraction Using Residual Spiking Neural  Networks",
    "abstract": " Comments: 16 pages, 6 figures, 17 tables ",
    "url": "https://arxiv.org/abs/2111.05955",
    "authors": [
      "Alex Vicente-Sola",
      "Davide L. Manna",
      "Paul Kirkland",
      "Gaetano Di Caterina",
      "Trevor Bihl"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.12696",
    "title": "A Lightweight Graph Transformer Network for Human Mesh Reconstruction  from 2D Human Pose",
    "abstract": " Title: A Lightweight Graph Transformer Network for Human Mesh Reconstruction  from 2D Human Pose ",
    "url": "https://arxiv.org/abs/2111.12696",
    "authors": [
      "Ce Zheng",
      "Matias Mendieta",
      "Pu Wang",
      "Aidong Lu",
      "Chen Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2112.00974",
    "title": "Consensus Graph Representation Learning for Better Grounded Image  Captioning",
    "abstract": " Comments: 9 pages, 5 figures, AAAI 2021 ",
    "url": "https://arxiv.org/abs/2112.00974",
    "authors": [
      "Wenqiao Zhang",
      "Haochen Shi",
      "Siliang Tang",
      "Jun Xiao",
      "Qiang Yu",
      "Yueting Zhuang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2112.06054",
    "title": "Deterministic and Discriminative Imitation (D2-Imitation): Revisiting  Adversarial Imitation for Sample Efficiency",
    "abstract": " Comments: AAAI 2022 ",
    "url": "https://arxiv.org/abs/2112.06054",
    "authors": [
      "Mingfei Sun",
      "Sam Devlin",
      "Katja Hofmann",
      "Shimon Whiteson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.06147",
    "title": "Self-Supervised Modality-Aware Multiple Granularity Pre-Training for  RGB-Infrared Person Re-Identification",
    "abstract": " Comments: 13 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2112.06147",
    "authors": [
      "Lin Wan",
      "Qianyan Jing",
      "Zongyuan Sun",
      "Chuang Zhang",
      "Zhihang Li",
      "Yehansen Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.04123",
    "title": "gDNA: Towards Generative Detailed Neural Avatars",
    "abstract": " Comments: Camera-ready for CVPR 2022. Project page: this https URL ",
    "url": "https://arxiv.org/abs/2201.04123",
    "authors": [
      "Xu Chen",
      "Tianjian Jiang",
      "Jie Song",
      "Jinlong Yang",
      "Michael J. Black",
      "Andreas Geiger",
      "Otmar Hilliges"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.07284",
    "title": "TranAD: Deep Transformer Networks for Anomaly Detection in Multivariate  Time Series Data",
    "abstract": " Comments: Accepted in VLDB 2022 ",
    "url": "https://arxiv.org/abs/2201.07284",
    "authors": [
      "Shreshth Tuli",
      "Giuliano Casale",
      "Nicholas R. Jennings"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.11147",
    "title": "OntoProtein: Protein Pretraining With Gene Ontology Embedding",
    "abstract": " Comments: Accepted by ICLR 2022. With small revisions. arXiv admin note: text overlap with arXiv:2009.11355 by other authors ",
    "url": "https://arxiv.org/abs/2201.11147",
    "authors": [
      "Ningyu Zhang",
      "Zhen Bi",
      "Xiaozhuan Liang",
      "Siyuan Cheng",
      "Haosen Hong",
      "Shumin Deng",
      "Jiazhang Lian",
      "Qiang Zhang",
      "Huajun Chen"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.11440",
    "title": "An Analysis on Ensemble Learning optimized Medical Image Classification  with Deep Convolutional Neural Networks",
    "abstract": " Comments: Code: this https URL ; Supplementary Material: this https URL ",
    "url": "https://arxiv.org/abs/2201.11440",
    "authors": [
      "Dominik Müller",
      "Iñaki Soto-Rey",
      "Frank Kramer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02194",
    "title": "Rethinking Reconstruction Autoencoder-Based Out-of-Distribution  Detection",
    "abstract": " Comments: Accepted('Poster' presentation) as main conference paper of CVPR2022 ",
    "url": "https://arxiv.org/abs/2203.02194",
    "authors": [
      "Yibo Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.03407",
    "title": "On convergence of neural network methods for solving elliptic interface  problems",
    "abstract": " Title: On convergence of neural network methods for solving elliptic interface  problems ",
    "url": "https://arxiv.org/abs/2203.03407",
    "authors": [
      "Sidi Wu",
      "Aiqing Zhu",
      "Yifa Tang",
      "Benzhuo Lu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2203.07561",
    "title": "Toward the Detection of Polyglot Files",
    "abstract": " Title: Toward the Detection of Polyglot Files ",
    "url": "https://arxiv.org/abs/2203.07561",
    "authors": [
      "Luke Koch",
      "Sean Oesch",
      "Mary Adkisson",
      "Sam Erwin",
      "Brian Weber",
      "Amul Chaulagain"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.10465",
    "title": "Inspection-L: A Self-Supervised GNN-Based Money Laundering Detection  System for Bitcoin",
    "abstract": " Title: Inspection-L: A Self-Supervised GNN-Based Money Laundering Detection  System for Bitcoin ",
    "url": "https://arxiv.org/abs/2203.10465",
    "authors": [
      "Wai Weng Lo",
      "Siamak Layeghy",
      "Marius Portmann"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Statistical Finance (q-fin.ST)"
    ]
  },
  {
    "id": "arXiv:2203.11011",
    "title": "Reinforced MOOCs Concept Recommendation in Heterogeneous Information  Networks",
    "abstract": " Title: Reinforced MOOCs Concept Recommendation in Heterogeneous Information  Networks ",
    "url": "https://arxiv.org/abs/2203.11011",
    "authors": [
      "Jibing Gong",
      "Yao Wan",
      "Ye Liu",
      "Xuewen Li",
      "Yi Zhao",
      "Cheng Wang",
      "Qing Li",
      "Wenzheng Feng",
      "Jie Tang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.15401",
    "title": "Neural Face Video Compression using Multiple Views",
    "abstract": " Title: Neural Face Video Compression using Multiple Views ",
    "url": "https://arxiv.org/abs/2203.15401",
    "authors": [
      "Anna Volokitin",
      "Stefan Brugger",
      "Ali Benlalah",
      "Sebastian Martin",
      "Brian Amberg",
      "Michael Tschannen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.17205",
    "title": "Leverage Your Local and Global Representations: A New Self-Supervised  Learning Strategy",
    "abstract": " Comments: accepted in CVPR 2022 ",
    "url": "https://arxiv.org/abs/2203.17205",
    "authors": [
      "Tong Zhang",
      "Congpei Qiu",
      "Wei Ke",
      "Sabine Süsstrunk",
      "Mathieu Salzmann"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.01297",
    "title": "Learning Dynamic Correlations in Spatiotemporal Graphs for Motion  Prediction",
    "abstract": " Title: Learning Dynamic Correlations in Spatiotemporal Graphs for Motion  Prediction ",
    "url": "https://arxiv.org/abs/2204.01297",
    "authors": [
      "Jiajun Fu",
      "Fuxing Yang",
      "Jianqin Yin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.02553",
    "title": "RODD: A Self-Supervised Approach for Robust Out-of-Distribution  Detection",
    "abstract": " Comments: Accepted in CVPR Art of Robustness Workshop Proceedings ",
    "url": "https://arxiv.org/abs/2204.02553",
    "authors": [
      "Umar Khalid",
      "Ashkan Esmaeili",
      "Nazmul Karim",
      "Nazanin Rahnavard"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.02752",
    "title": "Multi-Objective Evolutionary Beer Optimisation",
    "abstract": " Comments: 13 pages, 3 figures, 6 tables, GECCO ",
    "url": "https://arxiv.org/abs/2204.02752",
    "authors": [
      "Mohammad Majid al-Rifaie",
      "Marc Cavazza"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.03559",
    "title": "Practical Digital Disguises: Leveraging Face Swaps to Protect Patient  Privacy",
    "abstract": " Comments: 15 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2204.03559",
    "authors": [
      "Ethan Wilson",
      "Frederick Shic",
      "Jenny Skytta",
      "Eakta Jain"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.03652",
    "title": "PlutoNet: An Efficient Polyp Segmentation Network",
    "abstract": " Comments: 8 pages, 5 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2204.03652",
    "authors": [
      "Tugberk Erol",
      "Duygu Sarikaya"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.03793",
    "title": "Personal VAD 2.0: Optimizing Personal Voice Activity Detection for  On-Device Speech Recognition",
    "abstract": " Comments: Submitted to INTERSPEECH 2022 ",
    "url": "https://arxiv.org/abs/2204.03793",
    "authors": [
      "Shaojin Ding",
      "Rajeev Rikhye",
      "Qiao Liang",
      "Yanzhang He",
      "Quan Wang",
      "Arun Narayanan",
      "Tom O'Malley",
      "Ian McGraw"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.04707",
    "title": "Generative Adversarial Networks for Image Augmentation in Agriculture: A  Systematic Review",
    "abstract": " Comments: 32 pages, 15 figures ",
    "url": "https://arxiv.org/abs/2204.04707",
    "authors": [
      "Ebenezer Olaniyi",
      "Dong Chen",
      "Yuzhen Lu",
      "Yanbo Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.05490",
    "title": "Modelling Evolutionary and Stationary User Preferences for Temporal Sets  Prediction",
    "abstract": " Comments: 25 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2204.05490",
    "authors": [
      "Le Yu",
      "Zihang Liu",
      "Tongyu Zhu",
      "Leilei Sun",
      "Bowen Du",
      "Weifeng Lv"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.05562",
    "title": "FederatedScope-GNN: Towards a Unified, Comprehensive and Efficient  Package for Federated Graph Learning",
    "abstract": " Comments: We have released FederatedScope for users on this https URL ",
    "url": "https://arxiv.org/abs/2204.05562",
    "authors": [
      "Zhen Wang",
      "Weirui Kuang",
      "Yuexiang Xie",
      "Liuyi Yao",
      "Yaliang Li",
      "Bolin Ding",
      "Jingren Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  }
]