[
  {
    "id": "arXiv:2307.08705",
    "title": "Exploring Automated Code Evaluation Systems and Resources for Code  Analysis: A Comprehensive Survey",
    "abstract": "The automated code evaluation system (AES) is mainly designed to reliably assess user-submitted code. Due to their extensive range of applications and the accumulation of valuable resources, AESs are becoming increasingly popular. Research on the application of AES and their real-world resource exploration for diverse coding tasks is still lacking. In this study, we conducted a comprehensive survey on AESs and their resources. This survey explores the application areas of AESs, available resources, and resource utilization for coding tasks. AESs are categorized into programming contests, programming learning and education, recruitment, online compilers, and additional modules, depending on their application. We explore the available datasets and other resources of these systems for research, analysis, and coding tasks. Moreover, we provide an overview of machine learning-driven coding tasks, such as bug detection, code review, comprehension, refactoring, search, representation, and repair. These tasks are performed using real-life datasets. In addition, we briefly discuss the Aizu Online Judge platform as a real example of an AES from the perspectives of system design (hardware and software), operation (competition and education), and research. This is due to the scalability of the AOJ platform (programming education, competitions, and practice), open internal features (hardware and software), attention from the research community, open source data (e.g., solution codes and submission documents), and transparency. We also analyze the overall performance of this system and the perceived challenges over the years. ",
    "url": "https://arxiv.org/abs/2307.08705",
    "authors": [
      "Md. Mostafizer Rahman",
      "Yutaka Watanobe",
      "Atsushi Shirafuji",
      "Mohamed Hamada"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2307.08713",
    "title": "Intuitionistic Fuzzy Broad Learning System: Enhancing Robustness Against  Noise and Outliers",
    "abstract": "In the realm of data classification, broad learning system (BLS) has proven to be a potent tool that utilizes a layer-by-layer feed-forward neural network. It consists of feature learning and enhancement segments, working together to extract intricate features from input data. The traditional BLS treats all samples as equally significant, which makes it less robust and less effective for real-world datasets with noises and outliers. To address this issue, we propose the fuzzy BLS (F-BLS) model, which assigns a fuzzy membership value to each training point to reduce the influence of noises and outliers. In assigning the membership value, the F-BLS model solely considers the distance from samples to the class center in the original feature space without incorporating the extent of non-belongingness to a class. We further propose a novel BLS based on intuitionistic fuzzy theory (IF-BLS). The proposed IF-BLS utilizes intuitionistic fuzzy numbers based on fuzzy membership and non-membership values to assign scores to training points in the high-dimensional feature space by using a kernel function. We evaluate the performance of proposed F-BLS and IF-BLS models on 44 UCI benchmark datasets across diverse domains. Furthermore, Gaussian noise is added to some UCI datasets to assess the robustness of the proposed F-BLS and IF-BLS models. Experimental results demonstrate superior generalization performance of the proposed F-BLS and IF-BLS models compared to baseline models, both with and without Gaussian noise. Additionally, we implement the proposed F-BLS and IF-BLS models on the Alzheimers Disease Neuroimaging Initiative (ADNI) dataset, and promising results showcase the models effectiveness in real-world applications. The proposed methods offer a promising solution to enhance the BLS frameworks ability to handle noise and outliers. ",
    "url": "https://arxiv.org/abs/2307.08713",
    "authors": [
      "M. Sajid",
      "A.K. Malik",
      "M. Tanveer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.08763",
    "title": "Video-Mined Task Graphs for Keystep Recognition in Instructional Videos",
    "abstract": "Procedural activity understanding requires perceiving human actions in terms of a broader task, where multiple keysteps are performed in sequence across a long video to reach a final goal state -- such as the steps of a recipe or a DIY fix-it task. Prior work largely treats keystep recognition in isolation of this broader structure, or else rigidly confines keysteps to align with a predefined sequential script. We propose discovering a task graph automatically from how-to videos to represent probabilistically how people tend to execute keysteps, and then leverage this graph to regularize keystep recognition in novel videos. On multiple datasets of real-world instructional videos, we show the impact: more reliable zero-shot keystep localization and improved video representation learning, exceeding the state of the art. ",
    "url": "https://arxiv.org/abs/2307.08763",
    "authors": [
      "Kumar Ashutosh",
      "Santhosh Kumar Ramakrishnan",
      "Triantafyllos Afouras",
      "Kristen Grauman"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.08782",
    "title": "Unsupervised Learning of Distributional Properties can Supplement Human  Labeling and Increase Active Learning Efficiency in Anomaly Detection",
    "abstract": "Exfiltration of data via email is a serious cybersecurity threat for many organizations. Detecting data exfiltration (anomaly) patterns typically requires labeling, most often done by a human annotator, to reduce the high number of false alarms. Active Learning (AL) is a promising approach for labeling data efficiently, but it needs to choose an efficient order in which cases are to be labeled, and there are uncertainties as to what scoring procedure should be used to prioritize cases for labeling, especially when detecting rare cases of interest is crucial. We propose an adaptive AL sampling strategy that leverages the underlying prior data distribution, as well as model uncertainty, to produce batches of cases to be labeled that contain instances of rare anomalies. We show that (1) the classifier benefits from a batch of representative and informative instances of both normal and anomalous examples, (2) unsupervised anomaly detection plays a useful role in building the classifier in the early stages of training when relatively little labeling has been done thus far. Our approach to AL for anomaly detection outperformed existing AL approaches on three highly unbalanced UCI benchmarks and on one real-world redacted email data set. ",
    "url": "https://arxiv.org/abs/2307.08782",
    "authors": [
      "Jaturong Kongmanee",
      "Mark Chignell",
      "Khilan Jerath",
      "Abhay Raman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.08788",
    "title": "Uncovering Load-Altering Attacks Against N-1 Secure Power Grids: A  Rare-Event Sampling Approach",
    "abstract": "Load-altering attacks targetting a large number of IoT-based high-wattage devices (e.g., smart electric vehicle charging stations) can lead to serious disruptions of power grid operations. In this work, we aim to uncover spatiotemporal characteristics of LAAs that can lead to serious impact. The problem is challenging since existing protection measures such as $N-1$ security ensures that the power grid is naturally resilient to load changes. Thus, strategically injected load perturbations that lead to network failure can be regarded as \\emph{rare events}. To this end, we adopt a rare-event sampling approach to uncover LAAs distributed temporally and spatially across the power network. The key advantage of this sampling method is the ability of sampling efficiently from multi-modal conditional distributions with disconnected support. Furthermore, we systematically compare the impacts of static (one-time manipulation of demand) and dynamic (attack over multiple time periods) LAAs. We perform extensive simulations using benchmark IEEE test simulations. The results show (i) the superiority and the need for rare-event sampling in the context of uncovering LAAs as compared to other sampling methodologies, (ii) statistical analysis of attack characteristics and impacts of static and dynamic LAAs, and (iii) cascade sizes (due to LAA) for different network sizes and load conditions. ",
    "url": "https://arxiv.org/abs/2307.08788",
    "authors": [
      "Maldon Patrice Goodridge",
      "Subhash Lakshminarayana",
      "Alessandro Zocca"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.08807",
    "title": "Anomaly Detection with Selective Dictionary Learning",
    "abstract": "In this paper we present new methods of anomaly detection based on Dictionary Learning (DL) and Kernel Dictionary Learning (KDL). The main contribution consists in the adaption of known DL and KDL algorithms in the form of unsupervised methods, used for outlier detection. We propose a reduced kernel version (RKDL), which is useful for problems with large data sets, due to the large kernel matrix. We also improve the DL and RKDL methods by the use of a random selection of signals, which aims to eliminate the outliers from the training procedure. All our algorithms are introduced in an anomaly detection toolbox and are compared to standard benchmark results. ",
    "url": "https://arxiv.org/abs/2307.08807",
    "authors": [
      "Denis C. Ilie-Ablachim",
      "Bogdan Dumitrescu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.08832",
    "title": "Resource Augmentation Analysis of the Greedy Algorithm for the Online  Transportation Problem",
    "abstract": "We consider the online transportation problem set in a metric space containing parking garages of various capacities. Cars arrive over time, and must be assigned to an unfull parking garage upon their arrival. The objective is to minimize the aggregate distance that cars have to travel to their assigned parking garage. We show that the natural greedy algorithm, augmented with garages of $k\\ge3$ times the capacity, is $\\left(1 + \\frac{2}{k-2}\\right)$-competitive. ",
    "url": "https://arxiv.org/abs/2307.08832",
    "authors": [
      "Stephen Arndt",
      "Josh Ascher",
      "Kirk Pruhs"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2307.08839",
    "title": "Multishot Adversarial Network Decoding",
    "abstract": "We investigate adversarial network coding and decoding focusing on the multishot regime. Errors can occur on a proper subset of the network edges and are modeled via an adversarial channel. The paper contains both bounds and capacity-achieving schemes for the Diamond Network and the Mirrored Diamond Network. We also initiate the study of the generalizations of these networks. ",
    "url": "https://arxiv.org/abs/2307.08839",
    "authors": [
      "Giuseppe Cotardo",
      "Gretchen L. Matthews",
      "Alberto Ravagnani",
      "Julia Shapiro"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2307.08849",
    "title": "Autoregressive Diffusion Model for Graph Generation",
    "abstract": "Diffusion-based graph generative models have recently obtained promising results for graph generation. However, existing diffusion-based graph generative models are mostly one-shot generative models that apply Gaussian diffusion in the dequantized adjacency matrix space. Such a strategy can suffer from difficulty in model training, slow sampling speed, and incapability of incorporating constraints. We propose an \\emph{autoregressive diffusion} model for graph generation. Unlike existing methods, we define a node-absorbing diffusion process that operates directly in the discrete graph space. For forward diffusion, we design a \\emph{diffusion ordering network}, which learns a data-dependent node absorbing ordering from graph topology. For reverse generation, we design a \\emph{denoising network} that uses the reverse node ordering to efficiently reconstruct the graph by predicting the node type of the new node and its edges with previously denoised nodes at a time. Based on the permutation invariance of graph, we show that the two networks can be jointly trained by optimizing a simple lower bound of data likelihood. Our experiments on six diverse generic graph datasets and two molecule datasets show that our model achieves better or comparable generation performance with previous state-of-the-art, and meanwhile enjoys fast generation speed. ",
    "url": "https://arxiv.org/abs/2307.08849",
    "authors": [
      "Lingkai Kong",
      "Jiaming Cui",
      "Haotian Sun",
      "Yuchen Zhuang",
      "B. Aditya Prakash",
      "Chao Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.08850",
    "title": "LiDAR-BEVMTN: Real-Time LiDAR Bird's-Eye View Multi-Task Perception  Network for Autonomous Driving",
    "abstract": "LiDAR is crucial for robust 3D scene perception in autonomous driving. LiDAR perception has the largest body of literature after camera perception. However, multi-task learning across tasks like detection, segmentation, and motion estimation using LiDAR remains relatively unexplored, especially on automotive-grade embedded platforms. We present a real-time multi-task convolutional neural network for LiDAR-based object detection, semantics, and motion segmentation. The unified architecture comprises a shared encoder and task-specific decoders, enabling joint representation learning. We propose a novel Semantic Weighting and Guidance (SWAG) module to transfer semantic features for improved object detection selectively. Our heterogeneous training scheme combines diverse datasets and exploits complementary cues between tasks. The work provides the first embedded implementation unifying these key perception tasks from LiDAR point clouds achieving 3ms latency on the embedded NVIDIA Xavier platform. We achieve state-of-the-art results for two tasks, semantic and motion segmentation, and close to state-of-the-art performance for 3D object detection. By maximizing hardware efficiency and leveraging multi-task synergies, our method delivers an accurate and efficient solution tailored for real-world automated driving deployment. Qualitative results can be seen at https://youtu.be/H-hWRzv2lIY. ",
    "url": "https://arxiv.org/abs/2307.08850",
    "authors": [
      "Sambit Mohapatra",
      "Senthil Yogamani",
      "Varun Ravi Kumar",
      "Stefan Milz",
      "Heinrich Gotzig",
      "Patrick Mäder"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2307.08859",
    "title": "Curriculum Learning for Graph Neural Networks: A Multiview  Competence-based Approach",
    "abstract": "A curriculum is a planned sequence of learning materials and an effective one can make learning efficient and effective for both humans and machines. Recent studies developed effective data-driven curriculum learning approaches for training graph neural networks in language applications. However, existing curriculum learning approaches often employ a single criterion of difficulty in their training paradigms. In this paper, we propose a new perspective on curriculum learning by introducing a novel approach that builds on graph complexity formalisms (as difficulty criteria) and model competence during training. The model consists of a scheduling scheme which derives effective curricula by accounting for different views of sample difficulty and model competence during training. The proposed solution advances existing research in curriculum learning for graph neural networks with the ability to incorporate a fine-grained spectrum of graph difficulty criteria in their training paradigms. Experimental results on real-world link prediction and node classification tasks illustrate the effectiveness of the proposed approach. ",
    "url": "https://arxiv.org/abs/2307.08859",
    "authors": [
      "Nidhi Vakil",
      "Hadi Amiri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.08874",
    "title": "Latent Space Representations of Neural Algorithmic Reasoners",
    "abstract": "Neural Algorithmic Reasoning (NAR) is a research area focused on designing neural architectures that can reliably capture classical computation, usually by learning to execute algorithms. A typical approach is to rely on Graph Neural Network (GNN) architectures, which encode inputs in high-dimensional latent spaces that are repeatedly transformed during the execution of the algorithm. In this work we perform a detailed analysis of the structure of the latent space induced by the GNN when executing algorithms. We identify two possible failure modes: (i) loss of resolution, making it hard to distinguish similar values; (ii) inability to deal with values outside the range observed during training. We propose to solve the first issue by relying on a softmax aggregator, and propose to decay the latent space in order to deal with out-of-range values. We show that these changes lead to improvements on the majority of algorithms in the standard CLRS-30 benchmark when using the state-of-the-art Triplet-GMPNN processor. Our code is available at \\href{https://github.com/mirjanic/nar-latent-spaces}{https://github.com/mirjanic/nar-latent-spaces}. ",
    "url": "https://arxiv.org/abs/2307.08874",
    "authors": [
      "Vladimir V. Mirjanić",
      "Razvan Pascanu",
      "Petar Veličković"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.08875",
    "title": "Natural Actor-Critic for Robust Reinforcement Learning with Function  Approximation",
    "abstract": "We study robust reinforcement learning (RL) with the goal of determining a well-performing policy that is robust against model mismatch between the training simulator and the testing environment. Previous policy-based robust RL algorithms mainly focus on the tabular setting under uncertainty sets that facilitate robust policy evaluation, but are no longer tractable when the number of states scales up. To this end, we propose two novel uncertainty set formulations, one based on double sampling and the other on an integral probability metric. Both make large-scale robust RL tractable even when one only has access to a simulator. We propose a robust natural actor-critic (RNAC) approach that incorporates the new uncertainty sets and employs function approximation. We provide finite-time convergence guarantees for the proposed RNAC algorithm to the optimal robust policy within the function approximation error. Finally, we demonstrate the robust performance of the policy learned by our proposed RNAC approach in multiple MuJoCo environments and a real-world TurtleBot navigation task. ",
    "url": "https://arxiv.org/abs/2307.08875",
    "authors": [
      "Ruida Zhou",
      "Tao Liu",
      "Min Cheng",
      "Dileep Kalathil",
      "P. R. Kumar",
      "Chao Tian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2307.08877",
    "title": "Disentangling Node Attributes from Graph Topology for Improved  Generalizability in Link Prediction",
    "abstract": "Link prediction is a crucial task in graph machine learning with diverse applications. We explore the interplay between node attributes and graph topology and demonstrate that incorporating pre-trained node attributes improves the generalization power of link prediction models. Our proposed method, UPNA (Unsupervised Pre-training of Node Attributes), solves the inductive link prediction problem by learning a function that takes a pair of node attributes and predicts the probability of an edge, as opposed to Graph Neural Networks (GNN), which can be prone to topological shortcuts in graphs with power-law degree distribution. In this manner, UPNA learns a significant part of the latent graph generation mechanism since the learned function can be used to add incoming nodes to a growing graph. By leveraging pre-trained node attributes, we overcome observational bias and make meaningful predictions about unobserved nodes, surpassing state-of-the-art performance (3X to 34X improvement on benchmark datasets). UPNA can be applied to various pairwise learning tasks and integrated with existing link prediction models to enhance their generalizability and bolster graph generative models. ",
    "url": "https://arxiv.org/abs/2307.08877",
    "authors": [
      "Ayan Chatterjee",
      "Robin Walters",
      "Giulia Menichetti",
      "Tina Eliassi-Rad"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2307.08880",
    "title": "Modular Neural Network Approaches for Surgical Image Recognition",
    "abstract": "Deep learning-based applications have seen a lot of success in recent years. Text, audio, image, and video have all been explored with great success using deep learning approaches. The use of convolutional neural networks (CNN) in computer vision, in particular, has yielded reliable results. In order to achieve these results, a large amount of data is required. However, the dataset cannot always be accessible. Moreover, annotating data can be difficult and time-consuming. Self-training is a semi-supervised approach that managed to alleviate this problem and achieve state-of-the-art performances. Theoretical analysis even proved that it may result in a better generalization than a normal classifier. Another problem neural networks can face is the increasing complexity of modern problems, requiring a high computational and storage cost. One way to mitigate this issue, a strategy that has been inspired by human cognition known as modular learning, can be employed. The principle of the approach is to decompose a complex problem into simpler sub-tasks. This approach has several advantages, including faster learning, better generalization, and enables interpretability. In the first part of this paper, we introduce and evaluate different architectures of modular learning for Dorsal Capsulo-Scapholunate Septum (DCSS) instability classification. Our experiments have shown that modular learning improves performances compared to non-modular systems. Moreover, we found that weighted modular, that is to weight the output using the probabilities from the gating module, achieved an almost perfect classification. In the second part, we present our approach for data labeling and segmentation with self-training applied on shoulder arthroscopy images. ",
    "url": "https://arxiv.org/abs/2307.08880",
    "authors": [
      "Nosseiba Ben Salem",
      "Younes Bennani",
      "Joseph Karkazan",
      "Abir Barbara",
      "Charles Dacheux",
      "Thomas Gregory"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.08881",
    "title": "Examining the Effects of Degree Distribution and Homophily in Graph  Learning Models",
    "abstract": "Despite a surge in interest in GNN development, homogeneity in benchmarking datasets still presents a fundamental issue to GNN research. GraphWorld is a recent solution which uses the Stochastic Block Model (SBM) to generate diverse populations of synthetic graphs for benchmarking any GNN task. Despite its success, the SBM imposed fundamental limitations on the kinds of graph structure GraphWorld could create. In this work we examine how two additional synthetic graph generators can improve GraphWorld's evaluation; LFR, a well-established model in the graph clustering literature and CABAM, a recent adaptation of the Barabasi-Albert model tailored for GNN benchmarking. By integrating these generators, we significantly expand the coverage of graph space within the GraphWorld framework while preserving key graph properties observed in real-world networks. To demonstrate their effectiveness, we generate 300,000 graphs to benchmark 11 GNN models on a node classification task. We find GNN performance variations in response to homophily, degree distribution and feature signal. Based on these findings, we classify models by their sensitivity to the new generators under these properties. Additionally, we release the extensions made to GraphWorld on the GitHub repository, offering further evaluation of GNN performance on new graphs. ",
    "url": "https://arxiv.org/abs/2307.08881",
    "authors": [
      "Mustafa Yasir",
      "John Palowitch",
      "Anton Tsitsulin",
      "Long Tran-Thanh",
      "Bryan Perozzi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.08893",
    "title": "Evaluating unsupervised disentangled representation learning for genomic  discovery and disease risk prediction",
    "abstract": "High-dimensional clinical data have become invaluable resources for genetic studies, due to their accessibility in biobank-scale datasets and the development of high performance modeling techniques especially using deep learning. Recent work has shown that low dimensional embeddings of these clinical data learned by variational autoencoders (VAE) can be used for genome-wide association studies and polygenic risk prediction. In this work, we consider multiple unsupervised learning methods for learning disentangled representations, namely autoencoders, VAE, beta-VAE, and FactorVAE, in the context of genetic association studies. Using spirograms from UK Biobank as a running example, we observed improvements in the number of genome-wide significant loci, heritability, and performance of polygenic risk scores for asthma and chronic obstructive pulmonary disease by using FactorVAE or beta-VAE, compared to standard VAE or non-variational autoencoders. FactorVAEs performed effectively across multiple values of the regularization hyperparameter, while beta-VAEs were much more sensitive to the hyperparameter values. ",
    "url": "https://arxiv.org/abs/2307.08893",
    "authors": [
      "Taedong Yun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Genomics (q-bio.GN)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.08900",
    "title": "An Architecture for Provisioning In-Network Computing-Enabled Slices for  Holographic Applications in Next-Generation Networks",
    "abstract": "Applications such as holographic concerts are now emerging. However, their provisioning remains highly challenging. Requirements such as high bandwidth and ultra-low latency are still very challenging for the current network infrastructure. In-network computing (INC) is an emerging paradigm that enables the distribution of computing tasks across the network instead of computing on servers outside the network. It aims at tackling these two challenges. This article advocates the use of the INC paradigm to tackle holographic applications' high bandwidth and low latency challenges instead of the edge computing paradigm that has been used so far. Slicing brings flexibility to next-generation networks by enabling the deployment of applications/verticals with different requirements on the same network infrastructure. We propose an architecture that enables the provisioning of INC-enabled slices for holographic-type application deployment. The architecture is validated through a proof of concept and extensive simulations. Our experimental results show that INC significantly outperforms edge computing when it comes to these two key challenges. In addition, low jitter was maintained to preserve the hologram's stability. ",
    "url": "https://arxiv.org/abs/2307.08900",
    "authors": [
      "Fatemeh Aghaaliakbari",
      "Zakaria Ait Hmitti",
      "Marsa Rayani",
      "Manel Gherari",
      "Roch H. Glitho",
      "Halima Elbiaze",
      "Wessam Ajib"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.08902",
    "title": "On Computing In the Network: Covid-19 Coughs Detection Case Study",
    "abstract": "Computing in the network (COIN) is a promising technology that allows processing to be carried out within network devices such as switches and network interface cards. Time sensitive application can achieve their quality of service (QoS) target by flexibly distributing the caching and computing tasks in the cloud-edge-mist continuum. This paper highlights the advantages of in-network computing, comparing to edge computing, in terms of latency and traffic filtering. We consider a critical use case related to Covid-19 alert application in an airport setting. Arriving travelers are monitored through cough analysis so that potentially infected cases can be detected and isolated for medical tests. A performance comparison has been done between an architecture using in-network computing and another one using edge computing. We show using simulations that in-network computing outperforms edge computing in terms of Round Trip Time (RTT) and traffic filtering. ",
    "url": "https://arxiv.org/abs/2307.08902",
    "authors": [
      "Soukaina Ouledsidi Ali",
      "Zakaria Ait Hmitti",
      "Halima Elbiaze",
      "Roch Glitho"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2307.08905",
    "title": "Deep Reinforcement Learning-based Content Migration for Edge Content  Delivery Networks with Vehicular Nodes",
    "abstract": "With the explosive demands for data, content delivery networks are facing ever-increasing challenges to meet end-users quality-of-experience requirements, especially in terms of delay. Content can be migrated from surrogate servers to local caches closer to end-users to address delay challenges. Unfortunately, these local caches have limited capacities, and when they are fully occupied, it may sometimes be necessary to remove their lower-priority content to accommodate higher-priority content. At other times, it may be necessary to return previously removed content to local caches. Downloading this content from surrogate servers is costly from the perspective of network usage, and potentially detrimental to the end-user QoE in terms of delay. In this paper, we consider an edge content delivery network with vehicular nodes and propose a content migration strategy in which local caches offload their contents to neighboring edge caches whenever feasible, instead of removing their contents when they are fully occupied. This process ensures that more contents remain in the vicinity of end-users. However, selecting which contents to migrate and to which neighboring cache to migrate is a complicated problem. This paper proposes a deep reinforcement learning approach to minimize the cost. Our simulation scenarios realized up to a 70% reduction of content access delay cost compared to conventional strategies with and without content migration. ",
    "url": "https://arxiv.org/abs/2307.08905",
    "authors": [
      "Sepideh Malektaji",
      "Amin Ebrahimzadeh",
      "Halima Elbiaze",
      "Roch Glitho",
      "Somayeh Kianpishe"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.08910",
    "title": "Sharpness-Aware Graph Collaborative Filtering",
    "abstract": "Graph Neural Networks (GNNs) have achieved impressive performance in collaborative filtering. However, GNNs tend to yield inferior performance when the distributions of training and test data are not aligned well. Also, training GNNs requires optimizing non-convex neural networks with an abundance of local and global minima, which may differ widely in their performance at test time. Thus, it is essential to choose the minima carefully. Here we propose an effective training schema, called {gSAM}, under the principle that the \\textit{flatter} minima has a better generalization ability than the \\textit{sharper} ones. To achieve this goal, gSAM regularizes the flatness of the weight loss landscape by forming a bi-level optimization: the outer problem conducts the standard model training while the inner problem helps the model jump out of the sharp minima. Experimental results show the superiority of our gSAM. ",
    "url": "https://arxiv.org/abs/2307.08910",
    "authors": [
      "Huiyuan Chen",
      "Chin-Chia Michael Yeh",
      "Yujie Fan",
      "Yan Zheng",
      "Junpeng Wang",
      "Vivian Lai",
      "Mahashweta Das",
      "Hao Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2307.08913",
    "title": "Towards the Sparseness of Projection Head in Self-Supervised Learning",
    "abstract": "In recent years, self-supervised learning (SSL) has emerged as a promising approach for extracting valuable representations from unlabeled data. One successful SSL method is contrastive learning, which aims to bring positive examples closer while pushing negative examples apart. Many current contrastive learning approaches utilize a parameterized projection head. Through a combination of empirical analysis and theoretical investigation, we provide insights into the internal mechanisms of the projection head and its relationship with the phenomenon of dimensional collapse. Our findings demonstrate that the projection head enhances the quality of representations by performing contrastive loss in a projected subspace. Therefore, we propose an assumption that only a subset of features is necessary when minimizing the contrastive loss of a mini-batch of data. Theoretical analysis further suggests that a sparse projection head can enhance generalization, leading us to introduce SparseHead - a regularization term that effectively constrains the sparsity of the projection head, and can be seamlessly integrated with any self-supervised learning (SSL) approaches. Our experimental results validate the effectiveness of SparseHead, demonstrating its ability to improve the performance of existing contrastive methods. ",
    "url": "https://arxiv.org/abs/2307.08913",
    "authors": [
      "Zeen Song",
      "Xingzhe Su",
      "Jingyao Wang",
      "Wenwen Qiang",
      "Changwen Zheng",
      "Fuchun Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.08919",
    "title": "Accuracy versus time frontiers of semi-supervised and self-supervised  learning on medical images",
    "abstract": "For many applications of classifiers to medical images, a trustworthy label for each image can be difficult or expensive to obtain. In contrast, images without labels are more readily available. Two major research directions both promise that additional unlabeled data can improve classifier performance: self-supervised learning pretrains useful representations on unlabeled data only, then fine-tunes a classifier on these representations via the labeled set; semi-supervised learning directly trains a classifier on labeled and unlabeled data simultaneously. Recent methods from both directions have claimed significant gains on non-medical tasks, but do not systematically assess medical images and mostly compare only to methods in the same direction. This study contributes a carefully-designed benchmark to help answer a practitioner's key question: given a small labeled dataset and a limited budget of hours to spend on training, what gains from additional unlabeled images are possible and which methods best achieve them? Unlike previous benchmarks, ours uses realistic-sized validation sets to select hyperparameters, assesses runtime-performance tradeoffs, and bridges two research fields. By comparing 6 semi-supervised methods and 5 self-supervised methods to strong labeled-only baselines on 3 medical datasets with 30-1000 labels per class, we offer insights to resource-constrained, results-focused practitioners: MixMatch, SimCLR, and BYOL represent strong choices that were not surpassed by more recent methods. After much effort selecting hyperparameters on one dataset, we publish settings that enable strong methods to perform well on new medical tasks within a few hours, with further search over dozens of hours delivering modest additional gains. ",
    "url": "https://arxiv.org/abs/2307.08919",
    "authors": [
      "Zhe Huang",
      "Ruijie Jiang",
      "Shuchin Aeron",
      "Michael C. Hughes"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.08930",
    "title": "Unsupervised Deep Graph Matching Based on Cycle Consistency",
    "abstract": "We contribute to the sparsely populated area of unsupervised deep graph matching with application to keypoint matching in images. Contrary to the standard \\emph{supervised} approach, our method does not require ground truth correspondences between keypoint pairs. Instead, it is self-supervised by enforcing consistency of matchings between images of the same object category. As the matching and the consistency loss are discrete, their derivatives cannot be straightforwardly used for learning. We address this issue in a principled way by building our method upon the recent results on black-box differentiation of combinatorial solvers. This makes our method exceptionally flexible, as it is compatible with arbitrary network architectures and combinatorial solvers. Our experimental evaluation suggests that our technique sets a new state-of-the-art for unsupervised graph matching. ",
    "url": "https://arxiv.org/abs/2307.08930",
    "authors": [
      "Siddharth Tourani",
      "Carsten Rother",
      "Muhammad Haris Khan",
      "Bogdan Savchynskkyy"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.08934",
    "title": "Multi-stage Neural Networks: Function Approximator of Machine Precision",
    "abstract": "Deep learning techniques are increasingly applied to scientific problems, where the precision of networks is crucial. Despite being deemed as universal function approximators, neural networks, in practice, struggle to reduce the prediction errors below $O(10^{-5})$ even with large network size and extended training iterations. To address this issue, we developed the multi-stage neural networks that divides the training process into different stages, with each stage using a new network that is optimized to fit the residue from the previous stage. Across successive stages, the residue magnitudes decreases substantially and follows an inverse power-law relationship with the residue frequencies. The multi-stage neural networks effectively mitigate the spectral biases associated with regular neural networks, enabling them to capture the high frequency feature of target functions. We demonstrate that the prediction error from the multi-stage training for both regression problems and physics-informed neural networks can nearly reach the machine-precision $O(10^{-16})$ of double-floating point within a finite number of iterations. Such levels of accuracy are rarely attainable using single neural networks alone. ",
    "url": "https://arxiv.org/abs/2307.08934",
    "authors": [
      "Yongji Wang",
      "Ching-Yao Lai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2307.08939",
    "title": "Experimental Security Analysis of DNN-based Adaptive Cruise Control  under Context-Aware Perception Attacks",
    "abstract": "Adaptive Cruise Control (ACC) is a widely used driver assistance feature for maintaining desired speed and safe distance to the leading vehicles. This paper evaluates the security of the deep neural network (DNN) based ACC systems under stealthy perception attacks that strategically inject perturbations into camera data to cause forward collisions. We present a combined knowledge-and-data-driven approach to design a context-aware strategy for the selection of the most critical times for triggering the attacks and a novel optimization-based method for the adaptive generation of image perturbations at run-time. We evaluate the effectiveness of the proposed attack using an actual driving dataset and a realistic simulation platform with the control software from a production ACC system and a physical-world driving simulator while considering interventions by the driver and safety features such as Automatic Emergency Braking (AEB) and Forward Collision Warning (FCW). Experimental results show that the proposed attack achieves 142.9x higher success rate in causing accidents than random attacks and is mitigated 89.6% less by the safety features while being stealthy and robust to real-world factors and dynamic changes in the environment. This study provides insights into the role of human operators and basic safety interventions in preventing attacks. ",
    "url": "https://arxiv.org/abs/2307.08939",
    "authors": [
      "Xugui Zhou",
      "Anqi Chen",
      "Maxfield Kouzel",
      "Haotian Ren",
      "Morgan McCarty",
      "Cristina Nita-Rotaru",
      "Homa Alemzadeh"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.08944",
    "title": "Siamese Networks for Weakly Supervised Human Activity Recognition",
    "abstract": "Deep learning has been successfully applied to human activity recognition. However, training deep neural networks requires explicitly labeled data which is difficult to acquire. In this paper, we present a model with multiple siamese networks that are trained by using only the information about the similarity between pairs of data samples without knowing the explicit labels. The trained model maps the activity data samples into fixed size representation vectors such that the distance between the vectors in the representation space approximates the similarity of the data samples in the input space. Thus, the trained model can work as a metric for a wide range of different clustering algorithms. The training process minimizes a similarity loss function that forces the distance metric to be small for pairs of samples from the same kind of activity, and large for pairs of samples from different kinds of activities. We evaluate the model on three datasets to verify its effectiveness in segmentation and recognition of continuous human activity sequences. ",
    "url": "https://arxiv.org/abs/2307.08944",
    "authors": [
      "Taoran Sheng",
      "Manfred Huber"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.08955",
    "title": "Discretization-based ensemble model for robust learning in IoT",
    "abstract": "IoT device identification is the process of recognizing and verifying connected IoT devices to the network. This is an essential process for ensuring that only authorized devices can access the network, and it is necessary for network management and maintenance. In recent years, machine learning models have been used widely for automating the process of identifying devices in the network. However, these models are vulnerable to adversarial attacks that can compromise their accuracy and effectiveness. To better secure device identification models, discretization techniques enable reduction in the sensitivity of machine learning models to adversarial attacks contributing to the stability and reliability of the model. On the other hand, Ensemble methods combine multiple heterogeneous models to reduce the impact of remaining noise or errors in the model. Therefore, in this paper, we integrate discretization techniques and ensemble methods and examine it on model robustness against adversarial attacks. In other words, we propose a discretization-based ensemble stacking technique to improve the security of our ML models. We evaluate the performance of different ML-based IoT device identification models against white box and black box attacks using a real-world dataset comprised of network traffic from 28 IoT devices. We demonstrate that the proposed method enables robustness to the models for IoT device identification. ",
    "url": "https://arxiv.org/abs/2307.08955",
    "authors": [
      "Anahita Namvar",
      "Chandra Thapa",
      "Salil S. Kanhere"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.08982",
    "title": "Neural Network Pruning as Spectrum Preserving Process",
    "abstract": "Neural networks have achieved remarkable performance in various application domains. Nevertheless, a large number of weights in pre-trained deep neural networks prohibit them from being deployed on smartphones and embedded systems. It is highly desirable to obtain lightweight versions of neural networks for inference in edge devices. Many cost-effective approaches were proposed to prune dense and convolutional layers that are common in deep neural networks and dominant in the parameter space. However, a unified theoretical foundation for the problem mostly is missing. In this paper, we identify the close connection between matrix spectrum learning and neural network training for dense and convolutional layers and argue that weight pruning is essentially a matrix sparsification process to preserve the spectrum. Based on the analysis, we also propose a matrix sparsification algorithm tailored for neural network pruning that yields better pruning result. We carefully design and conduct experiments to support our arguments. Hence we provide a consolidated viewpoint for neural network pruning and enhance the interpretability of deep neural networks by identifying and preserving the critical neural weights. ",
    "url": "https://arxiv.org/abs/2307.08982",
    "authors": [
      "Shibo Yao",
      "Dantong Yu",
      "Ioannis Koutis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2307.08984",
    "title": "In Defense of Clip-based Video Relation Detection",
    "abstract": "Video Visual Relation Detection (VidVRD) aims to detect visual relationship triplets in videos using spatial bounding boxes and temporal boundaries. Existing VidVRD methods can be broadly categorized into bottom-up and top-down paradigms, depending on their approach to classifying relations. Bottom-up methods follow a clip-based approach where they classify relations of short clip tubelet pairs and then merge them into long video relations. On the other hand, top-down methods directly classify long video tubelet pairs. While recent video-based methods utilizing video tubelets have shown promising results, we argue that the effective modeling of spatial and temporal context plays a more significant role than the choice between clip tubelets and video tubelets. This motivates us to revisit the clip-based paradigm and explore the key success factors in VidVRD. In this paper, we propose a Hierarchical Context Model (HCM) that enriches the object-based spatial context and relation-based temporal context based on clips. We demonstrate that using clip tubelets can achieve superior performance compared to most video-based methods. Additionally, using clip tubelets offers more flexibility in model designs and helps alleviate the limitations associated with video tubelets, such as the challenging long-term object tracking problem and the loss of temporal information in long-term tubelet feature compression. Extensive experiments conducted on two challenging VidVRD benchmarks validate that our HCM achieves a new state-of-the-art performance, highlighting the effectiveness of incorporating advanced spatial and temporal context modeling within the clip-based paradigm. ",
    "url": "https://arxiv.org/abs/2307.08984",
    "authors": [
      "Meng Wei",
      "Long Chen",
      "Wei Ji",
      "Xiaoyu Yue",
      "Roger Zimmermann"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.08989",
    "title": "GraphCL-DTA: a graph contrastive learning with molecular semantics for  drug-target binding affinity prediction",
    "abstract": "Drug-target binding affinity prediction plays an important role in the early stages of drug discovery, which can infer the strength of interactions between new drugs and new targets. However, the performance of previous computational models is limited by the following drawbacks. The learning of drug representation relies only on supervised data, without taking into account the information contained in the molecular graph itself. Moreover, most previous studies tended to design complicated representation learning module, while uniformity, which is used to measure representation quality, is ignored. In this study, we propose GraphCL-DTA, a graph contrastive learning with molecular semantics for drug-target binding affinity prediction. In GraphCL-DTA, we design a graph contrastive learning framework for molecular graphs to learn drug representations, so that the semantics of molecular graphs are preserved. Through this graph contrastive framework, a more essential and effective drug representation can be learned without additional supervised data. Next, we design a new loss function that can be directly used to smoothly adjust the uniformity of drug and target representations. By directly optimizing the uniformity of representations, the representation quality of drugs and targets can be improved. The effectiveness of the above innovative elements is verified on two real datasets, KIBA and Davis. The excellent performance of GraphCL-DTA on the above datasets suggests its superiority to the state-of-the-art model. ",
    "url": "https://arxiv.org/abs/2307.08989",
    "authors": [
      "Xinxing Yang",
      "Genke Yang",
      "Jian Chu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2307.08992",
    "title": "Arbitrary point cloud upsampling via Dual Back-Projection Network",
    "abstract": "Point clouds acquired from 3D sensors are usually sparse and noisy. Point cloud upsampling is an approach to increase the density of the point cloud so that detailed geometric information can be restored. In this paper, we propose a Dual Back-Projection network for point cloud upsampling (DBPnet). A Dual Back-Projection is formulated in an up-down-up manner for point cloud upsampling. It not only back projects feature residues but also coordinates residues so that the network better captures the point correlations in the feature and space domains, achieving lower reconstruction errors on both uniform and non-uniform sparse point clouds. Our proposed method is also generalizable for arbitrary upsampling tasks (e.g. 4x, 5.5x). Experimental results show that the proposed method achieves the lowest point set matching losses with respect to the benchmark. In addition, the success of our approach demonstrates that generative networks are not necessarily needed for non-uniform point clouds. ",
    "url": "https://arxiv.org/abs/2307.08992",
    "authors": [
      "Zhi-Song Liu",
      "Zijia Wang",
      "Zhen Jia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09000",
    "title": "TractCloud: Registration-free tractography parcellation with a novel  local-global streamline point cloud representation",
    "abstract": "Diffusion MRI tractography parcellation classifies streamlines into anatomical fiber tracts to enable quantification and visualization for clinical and scientific applications. Current tractography parcellation methods rely heavily on registration, but registration inaccuracies can affect parcellation and the computational cost of registration is high for large-scale datasets. Recently, deep-learning-based methods have been proposed for tractography parcellation using various types of representations for streamlines. However, these methods only focus on the information from a single streamline, ignoring geometric relationships between the streamlines in the brain. We propose TractCloud, a registration-free framework that performs whole-brain tractography parcellation directly in individual subject space. We propose a novel, learnable, local-global streamline representation that leverages information from neighboring and whole-brain streamlines to describe the local anatomy and global pose of the brain. We train our framework on a large-scale labeled tractography dataset, which we augment by applying synthetic transforms including rotation, scaling, and translations. We test our framework on five independently acquired datasets across populations and health conditions. TractCloud significantly outperforms several state-of-the-art methods on all testing datasets. TractCloud achieves efficient and consistent whole-brain white matter parcellation across the lifespan (from neonates to elderly subjects, including brain tumor patients) without the need for registration. The robustness and high inference speed of TractCloud make it suitable for large-scale tractography data analysis. Our project page is available at https://tractcloud.github.io/. ",
    "url": "https://arxiv.org/abs/2307.09000",
    "authors": [
      "Tengfei Xue",
      "Yuqian Chen",
      "Chaoyi Zhang",
      "Alexandra J. Golby",
      "Nikos Makris",
      "Yogesh Rathi",
      "Weidong Cai",
      "Fan Zhang",
      "Lauren J. O'Donnell"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09002",
    "title": "CBSeq: A Channel-level Behavior Sequence For Encrypted Malware Traffic  Detection",
    "abstract": "Machine learning and neural networks have become increasingly popular solutions for encrypted malware traffic detection. They mine and learn complex traffic patterns, enabling detection by fitting boundaries between malware traffic and benign traffic. Compared with signature-based methods, they have higher scalability and flexibility. However, affected by the frequent variants and updates of malware, current methods suffer from a high false positive rate and do not work well for unknown malware traffic detection. It remains a critical task to achieve effective malware traffic detection. In this paper, we introduce CBSeq to address the above problems. CBSeq is a method that constructs a stable traffic representation, behavior sequence, to characterize attacking intent and achieve malware traffic detection. We novelly propose the channels with similar behavior as the detection object and extract side-channel content to construct behavior sequence. Unlike benign activities, the behavior sequences of malware and its variant's traffic exhibit solid internal correlations. Moreover, we design the MSFormer, a powerful Transformer-based multi-sequence fusion classifier. It captures the internal similarity of behavior sequence, thereby distinguishing malware traffic from benign traffic. Our evaluations demonstrate that CBSeq performs effectively in various known malware traffic detection and exhibits superior performance in unknown malware traffic detection, outperforming state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2307.09002",
    "authors": [
      "Susu Cui",
      "Cong Dong",
      "Meng Shen",
      "Yuling Liu",
      "Bo Jiang",
      "Zhigang Lu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.09004",
    "title": "Ord2Seq: Regard Ordinal Regression as Label Sequence Prediction",
    "abstract": "Ordinal regression refers to classifying object instances into ordinal categories. It has been widely studied in many scenarios, such as medical disease grading, movie rating, etc. Known methods focused only on learning inter-class ordinal relationships, but still incur limitations in distinguishing adjacent categories thus far. In this paper, we propose a simple sequence prediction framework for ordinal regression called Ord2Seq, which, for the first time, transforms each ordinal category label into a special label sequence and thus regards an ordinal regression task as a sequence prediction process. In this way, we decompose an ordinal regression task into a series of recursive binary classification steps, so as to subtly distinguish adjacent categories. Comprehensive experiments show the effectiveness of distinguishing adjacent categories for performance improvement and our new approach exceeds state-of-the-art performances in four different scenarios. Codes will be available upon acceptance. ",
    "url": "https://arxiv.org/abs/2307.09004",
    "authors": [
      "Jinhong Wang",
      "Yi Cheng",
      "Jintai Chen",
      "Tingting Chen",
      "Danny Chen",
      "Jian Wu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09020",
    "title": "Face-PAST: Facial Pose Awareness and Style Transfer Networks",
    "abstract": "Facial style transfer has been quite popular among researchers due to the rise of emerging technologies such as eXtended Reality (XR), Metaverse, and Non-Fungible Tokens (NFTs). Furthermore, StyleGAN methods along with transfer-learning strategies have reduced the problem of limited data to some extent. However, most of the StyleGAN methods overfit the styles while adding artifacts to facial images. In this paper, we propose a facial pose awareness and style transfer (Face-PAST) network that preserves facial details and structures while generating high-quality stylized images. Dual StyleGAN inspires our work, but in contrast, our work uses a pre-trained style generation network in an external style pass with a residual modulation block instead of a transform coding block. Furthermore, we use the gated mapping unit and facial structure, identity, and segmentation losses to preserve the facial structure and details. This enables us to train the network with a very limited amount of data while generating high-quality stylized images. Our training process adapts curriculum learning strategy to perform efficient and flexible style mixing in the generative space. We perform extensive experiments to show the superiority of Face-PAST in comparison to existing state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2307.09020",
    "authors": [
      "Sunder Ali Khowaja",
      "Ghulam Mujtaba",
      "Jiseok Yoon",
      "Ik Hyun Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09021",
    "title": "Towards a Neural Era in Dialogue Management for Collaboration: A  Literature Survey",
    "abstract": "Dialogue-based human-AI collaboration can revolutionize collaborative problem-solving, creative exploration, and social support. To realize this goal, the development of automated agents proficient in skills such as negotiating, following instructions, establishing common ground, and progressing shared tasks is essential. This survey begins by reviewing the evolution of dialogue management paradigms in collaborative dialogue systems, from traditional handcrafted and information-state based methods to AI planning-inspired approaches. It then shifts focus to contemporary data-driven dialogue management techniques, which seek to transfer deep learning successes from form-filling and open-domain settings to collaborative contexts. The paper proceeds to analyze a selected set of recent works that apply neural approaches to collaborative dialogue management, spotlighting prevailing trends in the field. This survey hopes to provide foundational background for future advancements in collaborative dialogue management, particularly as the dialogue systems community continues to embrace the potential of large language models. ",
    "url": "https://arxiv.org/abs/2307.09021",
    "authors": [
      "Amogh Mannekote"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.09027",
    "title": "Online Self-Supervised Thermal Water Segmentation for Aerial Vehicles",
    "abstract": "We present a new method to adapt an RGB-trained water segmentation network to target-domain aerial thermal imagery using online self-supervision by leveraging texture and motion cues as supervisory signals. This new thermal capability enables current autonomous aerial robots operating in near-shore environments to perform tasks such as visual navigation, bathymetry, and flow tracking at night. Our method overcomes the problem of scarce and difficult-to-obtain near-shore thermal data that prevents the application of conventional supervised and unsupervised methods. In this work, we curate the first aerial thermal near-shore dataset, show that our approach outperforms fully-supervised segmentation models trained on limited target-domain thermal data, and demonstrate real-time capabilities onboard an Nvidia Jetson embedded computing platform. Code and datasets used in this work will be available at: https://github.com/connorlee77/uav-thermal-water-segmentation. ",
    "url": "https://arxiv.org/abs/2307.09027",
    "authors": [
      "Connor Lee",
      "Jonathan Gustafsson Frennert",
      "Lu Gan",
      "Matthew Anderson",
      "Soon-Jo Chung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2307.09039",
    "title": "PottsMGNet: A Mathematical Explanation of Encoder-Decoder Based Neural  Networks",
    "abstract": "For problems in image processing and many other fields, a large class of effective neural networks has encoder-decoder-based architectures. Although these networks have made impressive performances, mathematical explanations of their architectures are still underdeveloped. In this paper, we study the encoder-decoder-based network architecture from the algorithmic perspective and provide a mathematical explanation. We use the two-phase Potts model for image segmentation as an example for our explanations. We associate the segmentation problem with a control problem in the continuous setting. Then, multigrid method and operator splitting scheme, the PottsMGNet, are used to discretize the continuous control model. We show that the resulting discrete PottsMGNet is equivalent to an encoder-decoder-based network. With minor modifications, it is shown that a number of the popular encoder-decoder-based neural networks are just instances of the proposed PottsMGNet. By incorporating the Soft-Threshold-Dynamics into the PottsMGNet as a regularizer, the PottsMGNet has shown to be robust with the network parameters such as network width and depth and achieved remarkable performance on datasets with very large noise. In nearly all our experiments, the new network always performs better or as good on accuracy and dice score than existing networks for image segmentation. ",
    "url": "https://arxiv.org/abs/2307.09039",
    "authors": [
      "Xue-Cheng Tai",
      "Hao Liu",
      "Raymond Chan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09045",
    "title": "6G Network Operation Support System",
    "abstract": "6G is the next-generation intelligent and integrated digital information infrastructure, characterized by ubiquitous interconnection, native intelligence, multi-dimensional perception, global coverage, green and low-carbon, native network security, etc. 6G will realize the transition from serving people and people-things communication to supporting the efficient connection of intelligent agents, and comprehensively leading the digital, intelligent and green transformation of the economy and the society. As the core support system for mobile communication network, 6G OSS needs to achieve high-level network automation, intelligence and digital twinning capabilities to achieve end-to-end autonomous network operation and maintenance, support the operation of typical 6G business scenarios and play a greater social responsibility in the fields of environment, society, and governance (ESG).This paper provides a detailed introduction to the overall vision, potential key technologies, and functional architecture of 6G OSS . It also presents an evolutionary roadmap and technological prospects for the OSS from 5G to 6G. ",
    "url": "https://arxiv.org/abs/2307.09045",
    "authors": [
      "Ye Ouyang",
      "Xiaozhou Ye",
      "Xidong Wang"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.09052",
    "title": "Connections between Operator-splitting Methods and Deep Neural Networks  with Applications in Image Segmentation",
    "abstract": "Deep neural network is a powerful tool for many tasks. Understanding why it is so successful and providing a mathematical explanation is an important problem and has been one popular research direction in past years. In the literature of mathematical analysis of deep deep neural networks, a lot of works are dedicated to establishing representation theories. How to make connections between deep neural networks and mathematical algorithms is still under development. In this paper, we give an algorithmic explanation for deep neural networks, especially in their connection with operator splitting and multigrid methods. We show that with certain splitting strategies, operator-splitting methods have the same structure as networks. Utilizing this connection and the Potts model for image segmentation, two networks inspired by operator-splitting methods are proposed. The two networks are essentially two operator-splitting algorithms solving the Potts model. Numerical experiments are presented to demonstrate the effectiveness of the proposed networks. ",
    "url": "https://arxiv.org/abs/2307.09052",
    "authors": [
      "Hao Liu",
      "Xue-Cheng Tai",
      "Raymond Chan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09065",
    "title": "Learning Adaptive Neighborhoods for Graph Neural Networks",
    "abstract": "Graph convolutional networks (GCNs) enable end-to-end learning on graph structured data. However, many works assume a given graph structure. When the input graph is noisy or unavailable, one approach is to construct or learn a latent graph structure. These methods typically fix the choice of node degree for the entire graph, which is suboptimal. Instead, we propose a novel end-to-end differentiable graph generator which builds graph topologies where each node selects both its neighborhood and its size. Our module can be readily integrated into existing pipelines involving graph convolution operations, replacing the predetermined or existing adjacency matrix with one that is learned, and optimized, as part of the general objective. As such it is applicable to any GCN. We integrate our module into trajectory prediction, point cloud classification and node classification pipelines resulting in improved accuracy over other structure-learning methods across a wide range of datasets and GCN backbones. ",
    "url": "https://arxiv.org/abs/2307.09065",
    "authors": [
      "Avishkar Saha",
      "Oscar Mendez",
      "Chris Russell",
      "Richard Bowden"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.09069",
    "title": "Mitigating Intersection Attacks in Anonymous Microblogging",
    "abstract": "Anonymous microblogging systems are known to be vulnerable to intersection attacks due to network churn. An adversary that monitors all communications can leverage the churn to learn who is publishing what with increasing confidence over time. In this paper, we propose a protocol for mitigating intersection attacks in anonymous microblogging systems by grouping users into anonymity sets based on similarities in their publishing behavior. The protocol provides a configurable communication schedule for users in each set to manage the inevitable trade-off between latency and bandwidth overhead. In our evaluation, we use real-world datasets from two popular microblogging platforms, Twitter and Reddit, to simulate user publishing behavior. The results demonstrate that the protocol can protect users against intersection attacks at low bandwidth overhead when the users adhere to communication schedules. In addition, the protocol can sustain a slow degradation in the size of the anonymity set over time under various churn rates. ",
    "url": "https://arxiv.org/abs/2307.09069",
    "authors": [
      "Sarah Abdelwahab Gaballah",
      "Thanh Hoang Long Nguyen",
      "Lamya Abdullah",
      "Ephraim Zimmer",
      "Max Mühlhäuser"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.09070",
    "title": "PixelHuman: Animatable Neural Radiance Fields from Few Images",
    "abstract": "In this paper, we propose PixelHuman, a novel human rendering model that generates animatable human scenes from a few images of a person with unseen identity, views, and poses. Previous work have demonstrated reasonable performance in novel view and pose synthesis, but they rely on a large number of images to train and are trained per scene from videos, which requires significant amount of time to produce animatable scenes from unseen human images. Our method differs from existing methods in that it can generalize to any input image for animatable human synthesis. Given a random pose sequence, our method synthesizes each target scene using a neural radiance field that is conditioned on a canonical representation and pose-aware pixel-aligned features, both of which can be obtained through deformation fields learned in a data-driven manner. Our experiments show that our method achieves state-of-the-art performance in multiview and novel pose synthesis from few-shot images. ",
    "url": "https://arxiv.org/abs/2307.09070",
    "authors": [
      "Gyumin Shim",
      "Jaeseong Lee",
      "Junha Hyung",
      "Jaegul Choo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09099",
    "title": "A Survey on Multi-Objective Neural Architecture Search",
    "abstract": "Recently, the expert-crafted neural architectures is increasing overtaken by the utilization of neural architecture search (NAS) and automatic generation (and tuning) of network structures which has a close relation to the Hyperparameter Optimization and Auto Machine Learning (AutoML). After the earlier NAS attempts to optimize only the prediction accuracy, Multi-Objective Neural architecture Search (MONAS) has been attracting attentions which considers more goals such as computational complexity, power consumption, and size of the network for optimization, reaching a trade-off between the accuracy and other features like the computational cost. In this paper, we present an overview of principal and state-of-the-art works in the field of MONAS. Starting from a well-categorized taxonomy and formulation for the NAS, we address and correct some miscategorizations in previous surveys of the NAS field. We also provide a list of all known objectives used and add a number of new ones and elaborate their specifications. We have provides analyses about the most important objectives and shown that the stochastic properties of some the them should be differed from deterministic ones in the multi-objective optimization procedure of NAS. We finalize this paper with a number of future directions and topics in the field of MONAS. ",
    "url": "https://arxiv.org/abs/2307.09099",
    "authors": [
      "Seyed Mahdi Shariatzadeh",
      "Mahmood Fathy",
      "Reza Berangi",
      "Mohammad Shahverdy"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.09109",
    "title": "Mining of Single-Class by Active Learning for Semantic Segmentation",
    "abstract": "Several Active Learning (AL) policies require retraining a target model several times in order to identify the most informative samples and rarely offer the option to focus on the acquisition of samples from underrepresented classes. Here the Mining of Single-Class by Active Learning (MiSiCAL) paradigm is introduced where an AL policy is constructed through deep reinforcement learning and exploits quantity-accuracy correlations to build datasets on which high-performance models can be trained with regards to specific classes. MiSiCAL is especially helpful in the case of very large batch sizes since it does not require repeated model training sessions as is common in other AL methods. This is thanks to its ability to exploit fixed representations of the candidate data points. We find that MiSiCAL is able to outperform a random policy on 150 out of 171 COCO10k classes, while the strongest baseline only outperforms random on 101 classes. ",
    "url": "https://arxiv.org/abs/2307.09109",
    "authors": [
      "Hugues Lambert",
      "Emma Slade"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09110",
    "title": "Cut Sparsification and Succinct Representation of Submodular Hypergraphs",
    "abstract": "In cut sparsification, all cuts of a hypergraph $H=(V,E,w)$ are approximated within $1\\pm\\epsilon$ factor by a small hypergraph $H'$. This widely applied method was generalized recently to a setting where the cost of cutting each $e\\in E$ is provided by a splitting function, $g_e: 2^e\\to\\mathbb{R}_+$. This generalization is called a submodular hypergraph when the functions $\\{g_e\\}_{e\\in E}$ are submodular, and it arises in machine learning, combinatorial optimization, and algorithmic game theory. Previous work focused on the setting where $H'$ is a reweighted sub-hypergraph of $H$, and measured size by the number of hyperedges in $H'$. We study such sparsification, and also a more general notion of representing $H$ succinctly, where size is measured in bits. In the sparsification setting, where size is the number of hyperedges, we present three results: (i) all submodular hypergraphs admit sparsifiers of size polynomial in $n=|V|$; (ii) monotone-submodular hypergraphs admit sparsifiers of size $O(\\epsilon^{-2} n^3)$; and (iii) we propose a new parameter, called spread, to obtain even smaller sparsifiers in some cases. In the succinct-representation setting, we show that a natural family of splitting functions admits a succinct representation of much smaller size than via reweighted subgraphs (almost by factor $n$). This large gap is surprising because for graphs, the most succinct representation is attained by reweighted subgraphs. Along the way, we introduce the notion of deformation, where $g_e$ is decomposed into a sum of functions of small description, and we provide upper and lower bounds for deformation of common splitting functions. ",
    "url": "https://arxiv.org/abs/2307.09110",
    "authors": [
      "Yotam Kenneth",
      "Robert Krauthgamer"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2307.09136",
    "title": "DropMix: Reducing Class Dependency in Mixed Sample Data Augmentation",
    "abstract": "Mixed sample data augmentation (MSDA) is a widely used technique that has been found to improve performance in a variety of tasks. However, in this paper, we show that the effects of MSDA are class-dependent, with some classes seeing an improvement in performance while others experience a decline. To reduce class dependency, we propose the DropMix method, which excludes a specific percentage of data from the MSDA computation. By training on a combination of MSDA and non-MSDA data, the proposed method not only improves the performance of classes that were previously degraded by MSDA, but also increases overall average accuracy, as shown in experiments on two datasets (CIFAR-100 and ImageNet) using three MSDA methods (Mixup, CutMix and PuzzleMix). ",
    "url": "https://arxiv.org/abs/2307.09136",
    "authors": [
      "Haeil Lee",
      "Hansang Lee",
      "Junmo Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.09141",
    "title": "Machine Learning for SAT: Restricted Heuristics and New Graph  Representations",
    "abstract": "Boolean satisfiability (SAT) is a fundamental NP-complete problem with many applications, including automated planning and scheduling. To solve large instances, SAT solvers have to rely on heuristics, e.g., choosing a branching variable in DPLL and CDCL solvers. Such heuristics can be improved with machine learning (ML) models; they can reduce the number of steps but usually hinder the running time because useful models are relatively large and slow. We suggest the strategy of making a few initial steps with a trained ML model and then releasing control to classical heuristics; this simplifies cold start for SAT solving and can decrease both the number of steps and overall runtime, but requires a separate decision of when to release control to the solver. Moreover, we introduce a modification of Graph-Q-SAT tailored to SAT problems converted from other domains, e.g., open shop scheduling problems. We validate the feasibility of our approach with random and industrial SAT problems. ",
    "url": "https://arxiv.org/abs/2307.09141",
    "authors": [
      "Mikhail Shirokikh",
      "Ilya Shenbin",
      "Anton Alekseev",
      "Sergey Nikolenko"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.09143",
    "title": "MVA2023 Small Object Detection Challenge for Spotting Birds: Dataset,  Methods, and Results",
    "abstract": "Small Object Detection (SOD) is an important machine vision topic because (i) a variety of real-world applications require object detection for distant objects and (ii) SOD is a challenging task due to the noisy, blurred, and less-informative image appearances of small objects. This paper proposes a new SOD dataset consisting of 39,070 images including 137,121 bird instances, which is called the Small Object Detection for Spotting Birds (SOD4SB) dataset. The detail of the challenge with the SOD4SB dataset is introduced in this paper. In total, 223 participants joined this challenge. This paper briefly introduces the award-winning methods. The dataset, the baseline code, and the website for evaluation on the public testset are publicly available. ",
    "url": "https://arxiv.org/abs/2307.09143",
    "authors": [
      "Yuki Kondo",
      "Norimichi Ukita",
      "Takayuki Yamaguchi",
      "Hao-Yu Hou",
      "Mu-Yi Shen",
      "Chia-Chi Hsu",
      "En-Ming Huang",
      "Yu-Chen Huang",
      "Yu-Cheng Xia",
      "Chien-Yao Wang",
      "Chun-Yi Lee",
      "Da Huo",
      "Marc A. Kastner",
      "Tingwei Liu",
      "Yasutomo Kawanishi",
      "Takatsugu Hirayama",
      "Takahiro Komamizu",
      "Ichiro Ide",
      "Yosuke Shinya",
      "Xinyao Liu",
      "Guang Liang",
      "Syusuke Yasui"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.09150",
    "title": "Rule-based Graph Repair using Minimally Restricted Consistency-Improving  Transformations",
    "abstract": "Model-driven software engineering is a suitable method for dealing with the ever-increasing complexity of software development processes. Graphs and graph transformations have proven useful for representing such models and changes to them. These models must satisfy certain sets of constraints. An example are the multiplicities of a class structure. During the development process, a change to a model may result in an inconsistent model that must at some point be repaired. This problem is called model repair. In particular, we will consider rule-based graph repair which is defined as follows: Given a graph $G$, a constraint $c$ such that $G$ does not satisfy $c$, and a set of rules $R$, use the rules of $\\mathcal{R}$ to transform $G$ into a graph that satisfies $c$. Known notions of consistency have either viewed consistency as a binary property, either a graph is consistent w.r.t. a constraint $c$ or not, or only viewed the number of violations of the first graph of a constraint. In this thesis, we introduce new notions of consistency, which we call consistency-maintaining and consistency-increasing transformations and rules, respectively. This is based on the possibility that a constraint can be satisfied up to a certain nesting level. We present constructions for direct consistency-maintaining or direct consistency-increasing application conditions, respectively. Finally, we present an rule-based graph repair approach that is able to repair so-called \\emph{circular conflict-free constraints}, and so-called circular conflict-free sets of constraints. Intuitively, a set of constraint $C$ is circular conflict free, if there is an ordering $c_1, \\ldots, c_n$ of all constraints of $C$ such that there is no $j <i$ such that a repair of $c_i$ at all graphs satisfying $c_j$ leads to a graph not satisfying $c_j$. ",
    "url": "https://arxiv.org/abs/2307.09150",
    "authors": [
      "Alexander Lauer"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2307.09151",
    "title": "Enhancing Network Slicing Architectures with Machine Learning, Security,  Sustainability and Experimental Networks Integration",
    "abstract": "Network Slicing (NS) is an essential technique extensively used in 5G networks computing strategies, mobile edge computing, mobile cloud computing, and verticals like the Internet of Vehicles and industrial IoT, among others. NS is foreseen as one of the leading enablers for 6G futuristic and highly demanding applications since it allows the optimization and customization of scarce and disputed resources among dynamic, demanding clients with highly distinct application requirements. Various standardization organizations, like 3GPP's proposal for new generation networks and state-of-the-art 5G/6G research projects, are proposing new NS architectures. However, new NS architectures have to deal with an extensive range of requirements that inherently result in having NS architecture proposals typically fulfilling the needs of specific sets of domains with commonalities. The Slicing Future Internet Infrastructures (SFI2) architecture proposal explores the gap resulting from the diversity of NS architectures target domains by proposing a new NS reference architecture with a defined focus on integrating experimental networks and enhancing the NS architecture with Machine Learning (ML) native optimizations, energy-efficient slicing, and slicing-tailored security functionalities. The SFI2 architectural main contribution includes the utilization of the slice-as-a-service paradigm for end-to-end orchestration of resources across multi-domains and multi-technology experimental networks. In addition, the SFI2 reference architecture instantiations will enhance the multi-domain and multi-technology integrated experimental network deployment with native ML optimization, energy-efficient aware slicing, and slicing-tailored security functionalities for the practical domain. ",
    "url": "https://arxiv.org/abs/2307.09151",
    "authors": [
      "Joberto S. B. Martins",
      "Tereza C. Carvalho",
      "Rodrigo Moreira",
      "Cristiano Both",
      "Adnei Donatti",
      "João H. Corrêa",
      "José A. Suruagy",
      "Sand L. Corrêa",
      "Antonio J. G. Abelem",
      "Moisés R. N. Ribeiro",
      "Jose-Marcos Nogueira",
      "Luiz C. S. Magalhães",
      "Juliano Wickboldt",
      "Tiago Ferreto",
      "Ricardo Mello",
      "Rafael Pasquini",
      "Marcos Schwarz",
      "Leobino N. Sampaio",
      "Daniel F. Macedo",
      "José F. de Rezende",
      "Kleber V. Cardoso",
      "Flávio O. Silva"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.09155",
    "title": "MLF-DET: Multi-Level Fusion for Cross-Modal 3D Object Detection",
    "abstract": "In this paper, we propose a novel and effective Multi-Level Fusion network, named as MLF-DET, for high-performance cross-modal 3D object DETection, which integrates both the feature-level fusion and decision-level fusion to fully utilize the information in the image. For the feature-level fusion, we present the Multi-scale Voxel Image fusion (MVI) module, which densely aligns multi-scale voxel features with image features. For the decision-level fusion, we propose the lightweight Feature-cued Confidence Rectification (FCR) module which further exploits image semantics to rectify the confidence of detection candidates. Besides, we design an effective data augmentation strategy termed Occlusion-aware GT Sampling (OGS) to reserve more sampled objects in the training scenes, so as to reduce overfitting. Extensive experiments on the KITTI dataset demonstrate the effectiveness of our method. Notably, on the extremely competitive KITTI car 3D object detection benchmark, our method reaches 82.89% moderate AP and achieves state-of-the-art performance without bells and whistles. ",
    "url": "https://arxiv.org/abs/2307.09155",
    "authors": [
      "Zewei Lin",
      "Yanqing Shen",
      "Sanping Zhou",
      "Shitao Chen",
      "Nanning Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09172",
    "title": "Jean-Luc Picard at Touché 2023: Comparing Image Generation, Stance  Detection and Feature Matching for Image Retrieval for Arguments",
    "abstract": "Participating in the shared task \"Image Retrieval for arguments\", we used different pipelines for image retrieval containing Image Generation, Stance Detection, Preselection and Feature Matching. We submitted four different runs with different pipeline layout and compare them to given baseline. Our pipelines perform similarly to the baseline. ",
    "url": "https://arxiv.org/abs/2307.09172",
    "authors": [
      "Max Moebius",
      "Maximilian Enderling",
      "Sarah T. Bachinger"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09182",
    "title": "Federated Learning for Computationally-Constrained Heterogeneous  Devices: A Survey",
    "abstract": "With an increasing number of smart devices like internet of things (IoT) devices deployed in the field, offloadingtraining of neural networks (NNs) to a central server becomes more and more infeasible. Recent efforts toimprove users' privacy have led to on-device learning emerging as an alternative. However, a model trainedonly on a single device, using only local data, is unlikely to reach a high accuracy. Federated learning (FL)has been introduced as a solution, offering a privacy-preserving trade-off between communication overheadand model accuracy by sharing knowledge between devices but disclosing the devices' private data. Theapplicability and the benefit of applying baseline FL are, however, limited in many relevant use cases dueto the heterogeneity present in such environments. In this survey, we outline the heterogeneity challengesFL has to overcome to be widely applicable in real-world applications. We especially focus on the aspect ofcomputation heterogeneity among the participating devices and provide a comprehensive overview of recentworks on heterogeneity-aware FL. We discuss two groups: works that adapt the NN architecture and worksthat approach heterogeneity on a system level, covering Federated Averaging (FedAvg), distillation, and splitlearning-based approaches, as well as synchronous and asynchronous aggregation schemes. ",
    "url": "https://arxiv.org/abs/2307.09182",
    "authors": [
      "Kilian Pfeiffer",
      "Martin Rapp",
      "Ramin Khalili",
      "Jörg Henkel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.09183",
    "title": "Pixel-wise Graph Attention Networks for Person Re-identification",
    "abstract": "Graph convolutional networks (GCN) is widely used to handle irregular data since it updates node features by using the structure information of graph. With the help of iterated GCN, high-order information can be obtained to further enhance the representation of nodes. However, how to apply GCN to structured data (such as pictures) has not been deeply studied. In this paper, we explore the application of graph attention networks (GAT) in image feature extraction. First of all, we propose a novel graph generation algorithm to convert images into graphs through matrix transformation. It is one magnitude faster than the algorithm based on K Nearest Neighbors (KNN). Then, GAT is used on the generated graph to update the node features. Thus, a more robust representation is obtained. These two steps are combined into a module called pixel-wise graph attention module (PGA). Since the graph obtained by our graph generation algorithm can still be transformed into a picture after processing, PGA can be well combined with CNN. Based on these two modules, we consulted the ResNet and design a pixel-wise graph attention network (PGANet). The PGANet is applied to the task of person re-identification in the datasets Market1501, DukeMTMC-reID and Occluded-DukeMTMC (outperforms state-of-the-art by 0.8\\%, 1.1\\% and 11\\% respectively, in mAP scores). Experiment results show that it achieves the state-of-the-art performance. \\href{https://github.com/wenyu1009/PGANet}{The code is available here}. ",
    "url": "https://arxiv.org/abs/2307.09183",
    "authors": [
      "Wenyu Zhang",
      "Qing Ding",
      "Jian Hu",
      "Yi Ma",
      "Mingzhe Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09184",
    "title": "You've Got Two Teachers: Co-evolutionary Image and Report Distillation  for Semi-supervised Anatomical Abnormality Detection in Chest X-ray",
    "abstract": "Chest X-ray (CXR) anatomical abnormality detection aims at localizing and characterising cardiopulmonary radiological findings in the radiographs, which can expedite clinical workflow and reduce observational oversights. Most existing methods attempted this task in either fully supervised settings which demanded costly mass per-abnormality annotations, or weakly supervised settings which still lagged badly behind fully supervised methods in performance. In this work, we propose a co-evolutionary image and report distillation (CEIRD) framework, which approaches semi-supervised abnormality detection in CXR by grounding the visual detection results with text-classified abnormalities from paired radiology reports, and vice versa. Concretely, based on the classical teacher-student pseudo label distillation (TSD) paradigm, we additionally introduce an auxiliary report classification model, whose prediction is used for report-guided pseudo detection label refinement (RPDLR) in the primary vision detection task. Inversely, we also use the prediction of the vision detection model for abnormality-guided pseudo classification label refinement (APCLR) in the auxiliary report classification task, and propose a co-evolution strategy where the vision and report models mutually promote each other with RPDLR and APCLR performed alternatively. To this end, we effectively incorporate the weak supervision by reports into the semi-supervised TSD pipeline. Besides the cross-modal pseudo label refinement, we further propose an intra-image-modal self-adaptive non-maximum suppression, where the pseudo detection labels generated by the teacher vision model are dynamically rectified by high-confidence predictions by the student. Experimental results on the public MIMIC-CXR benchmark demonstrate CEIRD's superior performance to several up-to-date weakly and semi-supervised methods. ",
    "url": "https://arxiv.org/abs/2307.09184",
    "authors": [
      "Jinghan Sun",
      "Dong Wei",
      "Zhe Xu",
      "Donghuan Lu",
      "Hong Liu",
      "Liansheng Wang",
      "Yefeng Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09220",
    "title": "A Survey on Open-Vocabulary Detection and Segmentation: Past, Present,  and Future",
    "abstract": "As the most fundamental tasks of computer vision, object detection and segmentation have made tremendous progress in the deep learning era. Due to the expensive manual labeling, the annotated categories in existing datasets are often small-scale and pre-defined, i.e., state-of-the-art detectors and segmentors fail to generalize beyond the closed-vocabulary. To resolve this limitation, the last few years have witnessed increasing attention toward Open-Vocabulary Detection (OVD) and Segmentation (OVS). In this survey, we provide a comprehensive review on the past and recent development of OVD and OVS. To this end, we develop a taxonomy according to the type of task and methodology. We find that the permission and usage of weak supervision signals can well discriminate different methodologies, including: visual-semantic space mapping, novel visual feature synthesis, region-aware training, pseudo-labeling, knowledge distillation-based, and transfer learning-based. The proposed taxonomy is universal across different tasks, covering object detection, semantic/instance/panoptic segmentation, 3D scene and video understanding. In each category, its main principles, key challenges, development routes, strengths, and weaknesses are thoroughly discussed. In addition, we benchmark each task along with the vital components of each method. Finally, several promising directions are provided to stimulate future research. ",
    "url": "https://arxiv.org/abs/2307.09220",
    "authors": [
      "Chaoyang Zhu",
      "Long Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09243",
    "title": "From Dragondoom to Dragonstar: Side-channel Attacks and Formally  Verified Implementation of WPA3 Dragonfly Handshake",
    "abstract": "It is universally acknowledged that Wi-Fi communications are important to secure. Thus, the Wi-Fi Alliance published WPA3 in 2018 with a distinctive security feature: it leverages a Password-Authenticated Key Exchange (PAKE) protocol to protect users' passwords from offline dictionary attacks. Unfortunately, soon after its release, several attacks were reported against its implementations, in response to which the protocol was updated in a best-effort manner. In this paper, we show that the proposed mitigations are not enough, especially for a complex protocol to implement even for savvy developers. Indeed, we present **Dragondoom**, a collection of side-channel vulnerabilities of varying strength allowing attackers to recover users' passwords in widely deployed Wi-Fi daemons, such as hostap in its default settings. Our findings target both password conversion methods, namely the default probabilistic hunting-and-pecking and its newly standardized deterministic alternative based on SSWU. We successfully exploit our leakage in practice through microarchitectural mechanisms, and overcome the limited spatial resolution of Flush+Reload. Our attacks outperform previous works in terms of required measurements. Then, driven by the need to end the spiral of patch-and-hack in Dragonfly implementations, we propose **Dragonstar**, an implementation of Dragonfly leveraging a formally verified implementation of the underlying mathematical operations, thereby removing all the related leakage vector. Our implementation relies on HACL*, a formally verified crypto library guaranteeing secret-independence. We design Dragonstar, so that its integration within hostap requires minimal modifications to the existing project. Our experiments show that the performance of HACL*-based hostap is comparable to OpenSSL-based, implying that Dragonstar is both efficient and proved to be leakage-free. ",
    "url": "https://arxiv.org/abs/2307.09243",
    "authors": [
      "Daniel De Almeida Braga",
      "Natalia Kulatova",
      "Mohamed Sabt",
      "Pierre-Alain Fouque",
      "Karthikeyan Bhargavan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.09249",
    "title": "UniTabE: Pretraining a Unified Tabular Encoder for Heterogeneous Tabular  Data",
    "abstract": "Recent advancements in Natural Language Processing (NLP) have witnessed the groundbreaking impact of pretrained models, yielding impressive outcomes across various tasks. This study seeks to extend the power of pretraining methodologies to tabular data, a domain traditionally overlooked, yet inherently challenging due to the plethora of table schemas intrinsic to different tasks. The primary research questions underpinning this work revolve around the adaptation to heterogeneous table structures, the establishment of a universal pretraining protocol for tabular data, the generalizability and transferability of learned knowledge across tasks, the adaptation to diverse downstream applications, and the incorporation of incremental columns over time. In response to these challenges, we introduce UniTabE, a pioneering method designed to process tables in a uniform manner, devoid of constraints imposed by specific table structures. UniTabE's core concept relies on representing each basic table element with a module, termed TabUnit. This is subsequently followed by a Transformer encoder to refine the representation. Moreover, our model is designed to facilitate pretraining and finetuning through the utilization of free-form prompts. In order to implement the pretraining phase, we curated an expansive tabular dataset comprising approximately 13 billion samples, meticulously gathered from the Kaggle platform. Rigorous experimental testing and analyses were performed under a myriad of scenarios to validate the effectiveness of our methodology. The experimental results demonstrate UniTabE's superior performance against several baseline models across a multitude of benchmark datasets. This, therefore, underscores UniTabE's potential to significantly enhance the semantic representation of tabular data, thereby marking a significant stride in the field of tabular data analysis. ",
    "url": "https://arxiv.org/abs/2307.09249",
    "authors": [
      "Yazheng Yang",
      "Yuqi Wang",
      "Guang Liu",
      "Ledell Wu",
      "Qi Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.09254",
    "title": "PAC Neural Prediction Set Learning to Quantify the Uncertainty of  Generative Language Models",
    "abstract": "Uncertainty learning and quantification of models are crucial tasks to enhance the trustworthiness of the models. Importantly, the recent surge of generative language models (GLMs) emphasizes the need for reliable uncertainty quantification due to the concerns on generating hallucinated facts. In this paper, we propose to learn neural prediction set models that comes with the probably approximately correct (PAC) guarantee for quantifying the uncertainty of GLMs. Unlike existing prediction set models, which are parameterized by a scalar value, we propose to parameterize prediction sets via neural networks, which achieves more precise uncertainty quantification but still satisfies the PAC guarantee. We demonstrate the efficacy of our method on four types of language datasets and six types of models by showing that our method improves the quantified uncertainty by $63\\%$ on average, compared to a standard baseline method. ",
    "url": "https://arxiv.org/abs/2307.09254",
    "authors": [
      "Sangdon Park",
      "Taesoo Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.09269",
    "title": "End-to-End Neural Network Training for Hyperbox-Based Classification",
    "abstract": "Hyperbox-based classification has been seen as a promising technique in which decisions on the data are represented as a series of orthogonal, multidimensional boxes (i.e., hyperboxes) that are often interpretable and human-readable. However, existing methods are no longer capable of efficiently handling the increasing volume of data many application domains face nowadays. We address this gap by proposing a novel, fully differentiable framework for hyperbox-based classification via neural networks. In contrast to previous work, our hyperbox models can be efficiently trained in an end-to-end fashion, which leads to significantly reduced training times and superior classification results. ",
    "url": "https://arxiv.org/abs/2307.09269",
    "authors": [
      "Denis Mayr Lima Martins",
      "Christian Lülf",
      "Fabian Gieseke"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.09274",
    "title": "Improving Text Semantic Similarity Modeling through a 3D Siamese Network",
    "abstract": "Siamese networks have gained popularity as a method for modeling text semantic similarity. Traditional methods rely on pooling operation to compress the semantic representations from Transformer blocks in encoding, resulting in two-dimensional semantic vectors and the loss of hierarchical semantic information from Transformer blocks. Moreover, this limited structure of semantic vectors is akin to a flattened landscape, which restricts the methods that can be applied in downstream modeling, as they can only navigate this flat terrain. To address this issue, we propose a novel 3D Siamese network for text semantic similarity modeling, which maps semantic information to a higher-dimensional space. The three-dimensional semantic tensors not only retains more precise spatial and feature domain information but also provides the necessary structural condition for comprehensive downstream modeling strategies to capture them. Leveraging this structural advantage, we introduce several modules to reinforce this 3D framework, focusing on three aspects: feature extraction, attention, and feature fusion. Our extensive experiments on four text semantic similarity benchmarks demonstrate the effectiveness and efficiency of our 3D Siamese Network. ",
    "url": "https://arxiv.org/abs/2307.09274",
    "authors": [
      "Jianxiang Zang",
      "Hui Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.09296",
    "title": "Rumor Detection with Diverse Counterfactual Evidence",
    "abstract": "The growth in social media has exacerbated the threat of fake news to individuals and communities. This draws increasing attention to developing efficient and timely rumor detection methods. The prevailing approaches resort to graph neural networks (GNNs) to exploit the post-propagation patterns of the rumor-spreading process. However, these methods lack inherent interpretation of rumor detection due to the black-box nature of GNNs. Moreover, these methods suffer from less robust results as they employ all the propagation patterns for rumor detection. In this paper, we address the above issues with the proposed Diverse Counterfactual Evidence framework for Rumor Detection (DCE-RD). Our intuition is to exploit the diverse counterfactual evidence of an event graph to serve as multi-view interpretations, which are further aggregated for robust rumor detection results. Specifically, our method first designs a subgraph generation strategy to efficiently generate different subgraphs of the event graph. We constrain the removal of these subgraphs to cause the change in rumor detection results. Thus, these subgraphs naturally serve as counterfactual evidence for rumor detection. To achieve multi-view interpretation, we design a diversity loss inspired by Determinantal Point Processes (DPP) to encourage diversity among the counterfactual evidence. A GNN-based rumor detection model further aggregates the diverse counterfactual evidence discovered by the proposed DCE-RD to achieve interpretable and robust rumor detection results. Extensive experiments on two real-world datasets show the superior performance of our method. Our code is available at https://github.com/Vicinity111/DCE-RD. ",
    "url": "https://arxiv.org/abs/2307.09296",
    "authors": [
      "Kaiwei Zhang",
      "Junchi Yu",
      "Haichao Shi",
      "Jian Liang",
      "Xiao-Yu Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.09302",
    "title": "Conformal prediction under ambiguous ground truth",
    "abstract": "In safety-critical classification tasks, conformal prediction allows to perform rigorous uncertainty quantification by providing confidence sets including the true class with a user-specified probability. This generally assumes the availability of a held-out calibration set with access to ground truth labels. Unfortunately, in many domains, such labels are difficult to obtain and usually approximated by aggregating expert opinions. In fact, this holds true for almost all datasets, including well-known ones such as CIFAR and ImageNet. Applying conformal prediction using such labels underestimates uncertainty. Indeed, when expert opinions are not resolvable, there is inherent ambiguity present in the labels. That is, we do not have ``crisp'', definitive ground truth labels and this uncertainty should be taken into account during calibration. In this paper, we develop a conformal prediction framework for such ambiguous ground truth settings which relies on an approximation of the underlying posterior distribution of labels given inputs. We demonstrate our methodology on synthetic and real datasets, including a case study of skin condition classification in dermatology. ",
    "url": "https://arxiv.org/abs/2307.09302",
    "authors": [
      "David Stutz",
      "Abhijit Guha Roy",
      "Tatiana Matejovicova",
      "Patricia Strachan",
      "Ali Taylan Cemgil",
      "Arnaud Doucet"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.09312",
    "title": "Multi-Modal Discussion Transformer: Integrating Text, Images and Graph  Transformers to Detect Hate Speech on Social Media",
    "abstract": "We present the Multi-Modal Discussion Transformer (mDT), a novel multi-modal graph-based transformer model for detecting hate speech in online social networks. In contrast to traditional text-only methods, our approach to labelling a comment as hate speech centers around the holistic analysis of text and images. This is done by leveraging graph transformers to capture the contextual relationships in the entire discussion that surrounds a comment, with interwoven fusion layers to combine text and image embeddings instead of processing different modalities separately. We compare the performance of our model to baselines that only process text; we also conduct extensive ablation studies. We conclude with future work for multimodal solutions to deliver social value in online contexts, arguing that capturing a holistic view of a conversation greatly advances the effort to detect anti-social behavior. ",
    "url": "https://arxiv.org/abs/2307.09312",
    "authors": [
      "Liam Hebert",
      "Gaurav Sahu",
      "Nanda Kishore Sreenivas",
      "Lukasz Golab",
      "Robin Cohen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2307.09323",
    "title": "Efficient Region-Aware Neural Radiance Fields for High-Fidelity Talking  Portrait Synthesis",
    "abstract": "This paper presents ER-NeRF, a novel conditional Neural Radiance Fields (NeRF) based architecture for talking portrait synthesis that can concurrently achieve fast convergence, real-time rendering, and state-of-the-art performance with small model size. Our idea is to explicitly exploit the unequal contribution of spatial regions to guide talking portrait modeling. Specifically, to improve the accuracy of dynamic head reconstruction, a compact and expressive NeRF-based Tri-Plane Hash Representation is introduced by pruning empty spatial regions with three planar hash encoders. For speech audio, we propose a Region Attention Module to generate region-aware condition feature via an attention mechanism. Different from existing methods that utilize an MLP-based encoder to learn the cross-modal relation implicitly, the attention mechanism builds an explicit connection between audio features and spatial regions to capture the priors of local motions. Moreover, a direct and fast Adaptive Pose Encoding is introduced to optimize the head-torso separation problem by mapping the complex transformation of the head pose into spatial coordinates. Extensive experiments demonstrate that our method renders better high-fidelity and audio-lips synchronized talking portrait videos, with realistic details and high efficiency compared to previous methods. ",
    "url": "https://arxiv.org/abs/2307.09323",
    "authors": [
      "Jiahe Li",
      "Jiawei Zhang",
      "Xiao Bai",
      "Jun Zhou",
      "Lin Gu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09339",
    "title": "Trajectory Data Collection with Local Differential Privacy",
    "abstract": "Trajectory data collection is a common task with many applications in our daily lives. Analyzing trajectory data enables service providers to enhance their services, which ultimately benefits users. However, directly collecting trajectory data may give rise to privacy-related issues that cannot be ignored. Local differential privacy (LDP), as the de facto privacy protection standard in a decentralized setting, enables users to perturb their trajectories locally and provides a provable privacy guarantee. Existing approaches to private trajectory data collection in a local setting typically use relaxed versions of LDP, which cannot provide a strict privacy guarantee, or require some external knowledge that is impractical to obtain and update in a timely manner. To tackle these problems, we propose a novel trajectory perturbation mechanism that relies solely on an underlying location set and satisfies pure $\\epsilon$-LDP to provide a stringent privacy guarantee. In the proposed mechanism, each point's adjacent direction information in the trajectory is used in its perturbation process. Such information serves as an effective clue to connect neighboring points and can be used to restrict the possible region of a perturbed point in order to enhance utility. To the best of our knowledge, our study is the first to use direction information for trajectory perturbation under LDP. Furthermore, based on this mechanism, we present an anchor-based method that adaptively restricts the region of each perturbed trajectory, thereby significantly boosting performance without violating the privacy constraint. Extensive experiments on both real-world and synthetic datasets demonstrate the effectiveness of the proposed mechanisms. ",
    "url": "https://arxiv.org/abs/2307.09339",
    "authors": [
      "Yuemin Zhang",
      "Qingqing Ye",
      "Rui Chen",
      "Haibo Hu",
      "Qilong Han"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.09357",
    "title": "Using the IBM Analog In-Memory Hardware Acceleration Kit for Neural  Network Training and Inference",
    "abstract": "Analog In-Memory Computing (AIMC) is a promising approach to reduce the latency and energy consumption of Deep Neural Network (DNN) inference and training. However, the noisy and non-linear device characteristics, and the non-ideal peripheral circuitry in AIMC chips, require adapting DNNs to be deployed on such hardware to achieve equivalent accuracy to digital computing. In this tutorial, we provide a deep dive into how such adaptations can be achieved and evaluated using the recently released IBM Analog Hardware Acceleration Kit (AIHWKit), freely available at https://github.com/IBM/aihwkit. The AIHWKit is a Python library that simulates inference and training of DNNs using AIMC. We present an in-depth description of the AIHWKit design, functionality, and best practices to properly perform inference and training. We also present an overview of the Analog AI Cloud Composer, that provides the benefits of using the AIHWKit simulation platform in a fully managed cloud setting. Finally, we show examples on how users can expand and customize AIHWKit for their own needs. This tutorial is accompanied by comprehensive Jupyter Notebook code examples that can be run using AIHWKit, which can be downloaded from https://github.com/IBM/aihwkit/tree/master/notebooks/tutorial. ",
    "url": "https://arxiv.org/abs/2307.09357",
    "authors": [
      "Manuel Le Gallo",
      "Corey Lammie",
      "Julian Buechel",
      "Fabio Carta",
      "Omobayode Fagbohungbe",
      "Charles Mackin",
      "Hsinyu Tsai",
      "Vijay Narayanan",
      "Abu Sebastian",
      "Kaoutar El Maghraoui",
      "Malte J. Rasch"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.09361",
    "title": "MOCA: Self-supervised Representation Learning by Predicting Masked  Online Codebook Assignments",
    "abstract": "Self-supervised learning can be used for mitigating the greedy needs of Vision Transformer networks for very large fully-annotated datasets. Different classes of self-supervised learning offer representations with either good contextual reasoning properties, e.g., using masked image modeling strategies, or invariance to image perturbations, e.g., with contrastive methods. In this work, we propose a single-stage and standalone method, MOCA, which unifies both desired properties using novel mask-and-predict objectives defined with high-level features (instead of pixel-level details). Moreover, we show how to effectively employ both learning paradigms in a synergistic and computation-efficient way. Doing so, we achieve new state-of-the-art results on low-shot settings and strong experimental results in various evaluation protocols with a training that is at least 3 times faster than prior methods. ",
    "url": "https://arxiv.org/abs/2307.09361",
    "authors": [
      "Spyros Gidaris",
      "Andrei Bursuc",
      "Oriane Simeoni",
      "Antonin Vobecky",
      "Nikos Komodakis",
      "Matthieu Cord",
      "Patrick Pérez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.09365",
    "title": "An Evaluation of Zero-Cost Proxies -- from Neural Architecture  Performance to Model Robustness",
    "abstract": "Zero-cost proxies are nowadays frequently studied and used to search for neural architectures. They show an impressive ability to predict the performance of architectures by making use of their untrained weights. These techniques allow for immense search speed-ups. So far the joint search for well-performing and robust architectures has received much less attention in the field of NAS. Therefore, the main focus of zero-cost proxies is the clean accuracy of architectures, whereas the model robustness should play an evenly important part. In this paper, we analyze the ability of common zero-cost proxies to serve as performance predictors for robustness in the popular NAS-Bench-201 search space. We are interested in the single prediction task for robustness and the joint multi-objective of clean and robust accuracy. We further analyze the feature importance of the proxies and show that predicting the robustness makes the prediction task from existing zero-cost proxies more challenging. As a result, the joint consideration of several proxies becomes necessary to predict a model's robustness while the clean accuracy can be regressed from a single such feature. ",
    "url": "https://arxiv.org/abs/2307.09365",
    "authors": [
      "Jovita Lukasik",
      "Michael Moeller",
      "Margret Keuper"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09375",
    "title": "CertPri: Certifiable Prioritization for Deep Neural Networks via  Movement Cost in Feature Space",
    "abstract": "Deep neural networks (DNNs) have demonstrated their outperformance in various software systems, but also exhibit misbehavior and even result in irreversible disasters. Therefore, it is crucial to identify the misbehavior of DNN-based software and improve DNNs' quality. Test input prioritization is one of the most appealing ways to guarantee DNNs' quality, which prioritizes test inputs so that more bug-revealing inputs can be identified earlier with limited time and manual labeling efforts. However, the existing prioritization methods are still limited from three aspects: certifiability, effectiveness, and generalizability. To overcome the challenges, we propose CertPri, a test input prioritization technique designed based on a movement cost perspective of test inputs in DNNs' feature space. CertPri differs from previous works in three key aspects: (1) certifiable: it provides a formal robustness guarantee for the movement cost; (2) effective: it leverages formally guaranteed movement costs to identify malicious bug-revealing inputs; and (3) generic: it can be applied to various tasks, data, models, and scenarios. Extensive evaluations across 2 tasks (i.e., classification and regression), 6 data forms, 4 model structures, and 2 scenarios (i.e., white-box and black-box) demonstrate CertPri's superior performance. For instance, it significantly improves 53.97% prioritization effectiveness on average compared with baselines. Its robustness and generalizability are 1.41~2.00 times and 1.33~3.39 times that of baselines on average, respectively. ",
    "url": "https://arxiv.org/abs/2307.09375",
    "authors": [
      "Haibin Zheng",
      "Jinyin Chen",
      "Haibo Jin"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.09408",
    "title": "Resilience of the reported global human-nature interaction network to  pandemic conditions",
    "abstract": "Understanding human-nature interactions and the architecture of coupled human-nature systems is crucial for sustainable development. Cultural ecosystem services (CES), defined as intangible benefits derived from nature exposure, contribute to maintaining and improving human well-being. However, we have limited understanding of how well-being benefits emerge from CES co-production. In this study, for the first time, we estimated the global CES network from self-reported interactions between nature features and human activities underpinning CES co-production using social media. First, we used a bottom-up, approach to define the global repertoire of nature features and human activities used during CES co-production using 682,000 posts on Reddit. We then sampled Twitter to estimate the co-occurrence of these features and activities over the past five years, retrieving 41.7 millions tweets. These tweets were used to estimate the CES bipartite network, where each link was weighted by the number of times nature features and human activities co-occurred in tweets. We expected to observe large changes in the CES network topology in relation to the global mobility restrictions during the COVID-19 pandemic. This was not the case and the global CES network was generally resilient. However, a higher order singular value decomposition of the CES tensor revealed an impulse on the link between self care activities and urban greenspace. This could be due to an increased need for self care during the pandemic and urban greenspace enabling CES to be produced locally. Thus, providing resilience for maintaining well-being during the pandemic. Our user based analysis also indicated a shift towards local CES production during the beginning of the pandemic. Thus, supporting that CES was produced locally. These findings suggest an overall need for CES and access to features providing CES in local communities. ",
    "url": "https://arxiv.org/abs/2307.09408",
    "authors": [
      "Anne Cathrine Linder",
      "David Lusseau"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2307.09417",
    "title": "RIS-Aided Index Modulation with Greedy Detection over Rician Fading  Channels",
    "abstract": "Index modulation schemes for reconfigurable intelligent surfaces (RIS)-assisted systems are envisioned as promising technologies for fifth-generation-advanced and sixth-generation (6G) wireless communication systems to enhance various system capabilities such as coverage area and network capacity. In this paper, we consider a receive diversity RIS-assisted wireless communication system employing IM schemes, namely, space-shift keying (SSK) for binary modulation and spatial modulation (SM) for M-ary modulation for data transmission. The RIS lies in close proximity to the transmitter, and the transmitted data is subjected to a fading environment with a prominent line-of-sight component modeled by a Rician distribution. A receiver structure based on a greedy detection rule is employed to select the receive diversity branch with the highest received signal energy for demodulation. The performance of the considered system is evaluated by obtaining a series-form expression for the probability of erroneous index detection (PED) of the considered target antenna using a characteristic function approach. In addition, closed-form and asymptotic expressions at high and low signal-to-noise ratios (SNRs) for the bit error rate (BER) for the SSK-based system, and the SM-based system employing M-ary phase-shift keying and M-ary quadrature amplitude modulation schemes, are derived. The dependencies of the system performance on the various parameters are corroborated via numerical results. The asymptotic expressions and results of PED and BER at high and low SNR values lead to the observation of a performance saturation and the presence of an SNR value as a point of inflection, which is attributed to the greedy detector's structure. ",
    "url": "https://arxiv.org/abs/2307.09417",
    "authors": [
      "Aritra Basu",
      "Soumya P. Dash",
      "Aryan Kaushik",
      "Debasish Ghose",
      "Marco Di Renzo",
      "Yonina C. Eldar"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2307.09426",
    "title": "Balancing Privacy and Progress in Artificial Intelligence: Anonymization  in Histopathology for Biomedical Research and Education",
    "abstract": "The advancement of biomedical research heavily relies on access to large amounts of medical data. In the case of histopathology, Whole Slide Images (WSI) and clinicopathological information are valuable for developing Artificial Intelligence (AI) algorithms for Digital Pathology (DP). Transferring medical data \"as open as possible\" enhances the usability of the data for secondary purposes but poses a risk to patient privacy. At the same time, existing regulations push towards keeping medical data \"as closed as necessary\" to avoid re-identification risks. Generally, these legal regulations require the removal of sensitive data but do not consider the possibility of data linkage attacks due to modern image-matching algorithms. In addition, the lack of standardization in DP makes it harder to establish a single solution for all formats of WSIs. These challenges raise problems for bio-informatics researchers in balancing privacy and progress while developing AI algorithms. This paper explores the legal regulations and terminologies for medical data-sharing. We review existing approaches and highlight challenges from the histopathological perspective. We also present a data-sharing guideline for histological data to foster multidisciplinary research and education. ",
    "url": "https://arxiv.org/abs/2307.09426",
    "authors": [
      "Neel Kanwal",
      "Emiel A.M. Janssen",
      "Kjersti Engan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.09444",
    "title": "No distributed quantum advantage for approximate graph coloring",
    "abstract": "We give an almost complete characterization of the hardness of $c$-coloring $\\chi$-chromatic graphs with distributed algorithms, for a wide range of models of distributed computing. In particular, we show that these problems do not admit any distributed quantum advantage. To do that: 1. We give a new distributed algorithm that finds a $c$-coloring in $\\chi$-chromatic graphs in $\\tilde{\\mathcal{O}}(n^{\\frac{1}{\\alpha}})$ rounds, with $\\alpha = \\bigl\\lceil\\frac{c-1}{\\chi - 1}\\bigr\\rceil$. 2. We prove that any distributed algorithm for this problem requires $\\Omega(n^{\\frac{1}{\\alpha}})$ rounds. Our upper bound holds in the classical, deterministic LOCAL model, while the near-matching lower bound holds in the \\emph{non-signaling} model. This model, introduced by Arfaoui and Fraigniaud in 2014, captures all models of distributed graph algorithms that obey physical causality; this includes not only classical deterministic LOCAL and randomized LOCAL but also quantum-LOCAL, even with a pre-shared quantum state. We also show that similar arguments can be used to prove that, e.g., 3-coloring 2-dimensional grids or $c$-coloring trees remain hard problems even for the non-signaling model, and in particular do not admit any quantum advantage. Our lower-bound arguments are purely graph-theoretic at heart; no background on quantum information theory is needed to establish the proofs. ",
    "url": "https://arxiv.org/abs/2307.09444",
    "authors": [
      "Xavier Coiteux-Roy",
      "Francesco d'Amore",
      "Rishikesh Gajjala",
      "Fabian Kuhn",
      "François Le Gall",
      "Henrik Lievonen",
      "Augusto Modanese",
      "Marc-Olivier Renou",
      "Gustav Schmid",
      "Jukka Suomela"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2307.09447",
    "title": "Deep Neural Aggregation for Recommending Items to Group of Users",
    "abstract": "Modern society devotes a significant amount of time to digital interaction. Many of our daily actions are carried out through digital means. This has led to the emergence of numerous Artificial Intelligence tools that assist us in various aspects of our lives. One key tool for the digital society is Recommender Systems, intelligent systems that learn from our past actions to propose new ones that align with our interests. Some of these systems have specialized in learning from the behavior of user groups to make recommendations to a group of individuals who want to perform a joint task. In this article, we analyze the current state of Group Recommender Systems and propose two new models that use emerging Deep Learning architectures. Experimental results demonstrate the improvement achieved by employing the proposed models compared to the state-of-the-art models using four different datasets. The source code of the models, as well as that of all the experiments conducted, is available in a public repository. ",
    "url": "https://arxiv.org/abs/2307.09447",
    "authors": [
      "Jorge Dueñas-Lerín",
      "Raúl Lara-Cabrera",
      "Fernando Ortega",
      "Jesús Bobadilla"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2307.09455",
    "title": "Pseudo Outlier Exposure for Out-of-Distribution Detection using  Pretrained Transformers",
    "abstract": "For real-world language applications, detecting an out-of-distribution (OOD) sample is helpful to alert users or reject such unreliable samples. However, modern over-parameterized language models often produce overconfident predictions for both in-distribution (ID) and OOD samples. In particular, language models suffer from OOD samples with a similar semantic representation to ID samples since these OOD samples lie near the ID manifold. A rejection network can be trained with ID and diverse outlier samples to detect test OOD samples, but explicitly collecting auxiliary OOD datasets brings an additional burden for data collection. In this paper, we propose a simple but effective method called Pseudo Outlier Exposure (POE) that constructs a surrogate OOD dataset by sequentially masking tokens related to ID classes. The surrogate OOD sample introduced by POE shows a similar representation to ID data, which is most effective in training a rejection network. Our method does not require any external OOD data and can be easily implemented within off-the-shelf Transformers. A comprehensive comparison with state-of-the-art algorithms demonstrates POE's competitiveness on several text classification benchmarks. ",
    "url": "https://arxiv.org/abs/2307.09455",
    "authors": [
      "Jaeyoung Kim",
      "Kyuheon Jung",
      "Dongbin Na",
      "Sion Jang",
      "Eunbin Park",
      "Sungchul Choi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.09465",
    "title": "Occlusion Aware Student Emotion Recognition based on Facial Action Unit  Detection",
    "abstract": "Given that approximately half of science, technology, engineering, and mathematics (STEM) undergraduate students in U.S. colleges and universities leave by the end of the first year [15], it is crucial to improve the quality of classroom environments. This study focuses on monitoring students' emotions in the classroom as an indicator of their engagement and proposes an approach to address this issue. The impact of different facial parts on the performance of an emotional recognition model is evaluated through experimentation. To test the proposed model under partial occlusion, an artificially occluded dataset is introduced. The novelty of this work lies in the proposal of an occlusion-aware architecture for facial action units (AUs) extraction, which employs attention mechanism and adaptive feature learning. The AUs can be used later to classify facial expressions in classroom settings. This research paper's findings provide valuable insights into handling occlusion in analyzing facial images for emotional engagement analysis. The proposed experiments demonstrate the significance of considering occlusion and enhancing the reliability of facial analysis models in classroom environments. These findings can also be extended to other settings where occlusions are prevalent. ",
    "url": "https://arxiv.org/abs/2307.09465",
    "authors": [
      "Shrouk Wally",
      "Ahmed Elsayed",
      "Islam Alkabbany",
      "Asem Ali",
      "Aly Farag"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09472",
    "title": "GroupLane: End-to-End 3D Lane Detection with Channel-wise Grouping",
    "abstract": "Efficiency is quite important for 3D lane detection due to practical deployment demand. In this work, we propose a simple, fast, and end-to-end detector that still maintains high detection precision. Specifically, we devise a set of fully convolutional heads based on row-wise classification. In contrast to previous counterparts, ours supports recognizing both vertical and horizontal lanes. Besides, our method is the first one to perform row-wise classification in bird-eye-view. In the heads, we split feature into multiple groups and every group of feature corresponds to a lane instance. During training, the predictions are associated with lane labels using the proposed single-win one-to-one matching to compute loss, and no post-processing operation is demanded for inference. In this way, our proposed fully convolutional detector, GroupLane, realizes end-to-end detection like DETR. Evaluated on 3 real world 3D lane benchmarks, OpenLane, Once-3DLanes, and OpenLane-Huawei, GroupLane adopting ConvNext-Base as the backbone outperforms the published state-of-the-art PersFormer by 13.6% F1 score in the OpenLane validation set. Besides, GroupLane with ResNet18 still surpasses PersFormer by 4.9% F1 score, while the inference speed is nearly 7x faster and the FLOPs is only 13.3% of it. ",
    "url": "https://arxiv.org/abs/2307.09472",
    "authors": [
      "Zhuoling Li",
      "Chunrui Han",
      "Zheng Ge",
      "Jinrong Yang",
      "En Yu",
      "Haoqian Wang",
      "Hengshuang Zhao",
      "Xiangyu Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09473",
    "title": "Dynamic Planar Embedding is in DynFO",
    "abstract": "Planar Embedding is a drawing of a graph on the plane such that the edges do not intersect each other except at the vertices. We know that testing the planarity of a graph and computing its embedding (if it exists), can efficiently be computed, both sequentially [HT] and in parallel [RR94], when the entire graph is presented as input. In the dynamic setting, the input graph changes one edge at a time through insertion and deletions and planarity testing/embedding has to be updated after every change. By storing auxilliary information we can improve the complexity of dynamic planarity testing/embedding over the obvious recomputation from scratch. In the sequential dynamic setting, there has been a series of works [EGIS, IPR, HIKLR, HR1], culminating in the breakthrough result of polylog(n) sequential time (amortized) planarity testing algorithm of Holm and Rotenberg [HR2]. In this paper, we study planar embedding through the lens of DynFO, a parallel dynamic complexity class introduced by Patnaik et al. [PI] (also [DST95]). We show that it is possible to dynamically maintain whether an edge can be inserted to a planar graph without causing non-planarity in DynFO. We extend this to show how to maintain an embedding of a planar graph under both edge insertions and deletions, while rejecting edge insertions that violate planarity. Our main idea is to maintain embeddings of only the triconnected components and a special two-colouring of separating pairs that enables us to side-step cascading flips when embedding of a biconnected planar graph changes, a major issue for sequential dynamic algorithms [HR1, HR2]. ",
    "url": "https://arxiv.org/abs/2307.09473",
    "authors": [
      "Samir Datta",
      "Asif Khan",
      "Anish Mukherjee"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2307.09483",
    "title": "Forecasting the steam mass flow in a powerplant using the parallel  hybrid network",
    "abstract": "Efficient and sustainable power generation is a crucial concern in the energy sector. In particular, thermal power plants grapple with accurately predicting steam mass flow, which is crucial for operational efficiency and cost reduction. In this study, we use a parallel hybrid neural network architecture that combines a parametrized quantum circuit and a conventional feed-forward neural network specifically designed for time-series prediction in industrial settings to enhance predictions of steam mass flow 15 minutes into the future. Our results show that the parallel hybrid model outperforms standalone classical and quantum models, achieving more than 5.7 and 4.9 times lower mean squared error (MSE) loss on the test set after training compared to pure classical and pure quantum networks, respectively. Furthermore, the hybrid model demonstrates smaller relative errors between the ground truth and the model predictions on the test set, up to 2 times better than the pure classical model. These findings contribute to the broader scientific understanding of how integrating quantum and classical machine learning techniques can be applied to real-world challenges faced by the energy sector, ultimately leading to optimized power plant operations. ",
    "url": "https://arxiv.org/abs/2307.09483",
    "authors": [
      "Andrii Kurkin",
      "Jonas Hegemann",
      "Mo Kordzanganeh",
      "Alexey Melnikov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2307.08717",
    "title": "Untrained neural network embedded Fourier phase retrieval from few  measurements",
    "abstract": "Fourier phase retrieval (FPR) is a challenging task widely used in various applications. It involves recovering an unknown signal from its Fourier phaseless measurements. FPR with few measurements is important for reducing time and hardware costs, but it suffers from serious ill-posedness. Recently, untrained neural networks have offered new approaches by introducing learned priors to alleviate the ill-posedness without requiring any external data. However, they may not be ideal for reconstructing fine details in images and can be computationally expensive. This paper proposes an untrained neural network (NN) embedded algorithm based on the alternating direction method of multipliers (ADMM) framework to solve FPR with few measurements. Specifically, we use a generative network to represent the image to be recovered, which confines the image to the space defined by the network structure. To improve the ability to represent high-frequency information, total variation (TV) regularization is imposed to facilitate the recovery of local structures in the image. Furthermore, to reduce the computational cost mainly caused by the parameter updates of the untrained NN, we develop an accelerated algorithm that adaptively trades off between explicit and implicit regularization. Experimental results indicate that the proposed algorithm outperforms existing untrained NN-based algorithms with fewer computational resources and even performs competitively against trained NN-based algorithms. ",
    "url": "https://arxiv.org/abs/2307.08717",
    "authors": [
      "Liyuan Ma",
      "Hongxia Wang",
      "Ningyi Leng",
      "Ziyang Yuan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.08969",
    "title": "Quantivine: A Visualization Approach for Large-scale Quantum Circuit  Representation and Analysis",
    "abstract": "Quantum computing is a rapidly evolving field that enables exponential speed-up over classical algorithms. At the heart of this revolutionary technology are quantum circuits, which serve as vital tools for implementing, analyzing, and optimizing quantum algorithms. Recent advancements in quantum computing and the increasing capability of quantum devices have led to the development of more complex quantum circuits. However, traditional quantum circuit diagrams suffer from scalability and readability issues, which limit the efficiency of analysis and optimization processes. In this research, we propose a novel visualization approach for large-scale quantum circuits by adopting semantic analysis to facilitate the comprehension of quantum circuits. We first exploit meta-data and semantic information extracted from the underlying code of quantum circuits to create component segmentations and pattern abstractions, allowing for easier wrangling of massive circuit diagrams. We then develop Quantivine, an interactive system for exploring and understanding quantum circuits. A series of novel circuit visualizations are designed to uncover contextual details such as qubit provenance, parallelism, and entanglement. The effectiveness of Quantivine is demonstrated through two usage scenarios of quantum circuits with up to 100 qubits and a formal user evaluation with quantum experts. A free copy of this paper and all supplemental materials are available at https://osf.io/2m9yh/?view_only=0aa1618c97244f5093cd7ce15f1431f9. ",
    "url": "https://arxiv.org/abs/2307.08969",
    "authors": [
      "Zhen Wen",
      "Yihan Liu",
      "Siwei Tan",
      "Jieyi Chen",
      "Minfeng Zhu",
      "Dongming Han",
      "Jianwei Yin",
      "Mingliang Xu",
      "Wei Chen"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2307.09055",
    "title": "Outlier-Robust Tensor Low-Rank Representation for Data Clustering",
    "abstract": "Low-rank tensor analysis has received widespread attention with many practical applications. However, the tensor data are often contaminated by outliers or sample-specific corruptions. How to recover the tensor data that are corrupted by outliers and perform data clustering remains a challenging problem. This paper develops an outlier-robust tensor low-rank representation (OR-TLRR) method for simultaneous outlier detection and tensor data clustering based on the tensor singular value decomposition (t-SVD) algebraic framework. It is motivated by the recently proposed tensor-tensor product induced by invertible linear transforms that satisfy certain conditions. For tensor observations with arbitrary outlier corruptions, OR-TLRR has provable performance guarantee for exactly recovering the row space of clean data and detecting outliers under mild conditions. Moreover, an extension of OR-TLRR is also proposed to handle the case when parts of the data are missing. Finally, extensive experimental results on both synthetic and real data demonstrate the effectiveness of the proposed algorithms. ",
    "url": "https://arxiv.org/abs/2307.09055",
    "authors": [
      "Tong Wu"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.09060",
    "title": "Extreme heatwave sampling and prediction with analog Markov chain and  comparisons with deep learning",
    "abstract": "We present a data-driven emulator, stochastic weather generator (SWG), suitable for estimating probabilities of prolonged heatwaves in France and Scandinavia. This emulator is based on the method of analogs of circulation to which we add temperature and soil moisture as predictor fields. We train the emulator on an intermediate complexity climate model run and show that it is capable of predicting conditional probabilities (forecasting) of heatwaves out of sample. Special attention is payed that this prediction is evaluated using proper score appropriate for rare events. To accelerate the computation of analogs dimensionality reduction techniques are applied and the performance is evaluated. The probabilistic prediction achieved with SWG is compared with the one achieved with Convolutional Neural Network (CNN). With the availability of hundreds of years of training data CNNs perform better at the task of probabilistic prediction. In addition, we show that the SWG emulator trained on 80 years of data is capable of estimating extreme return times of order of thousands of years for heatwaves longer than several days more precisely than the fit based on generalised extreme value distribution. Finally, the quality of its synthetic extreme teleconnection patterns obtained with stochastic weather generator is studied. We showcase two examples of such synthetic teleconnection patterns for heatwaves in France and Scandinavia that compare favorably to the very long climate model control run. ",
    "url": "https://arxiv.org/abs/2307.09060",
    "authors": [
      "George Miloshevich",
      "Dario Lucente",
      "Pascal Yiou",
      "Freddy Bouchet"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2307.09081",
    "title": "Maximal diameter of integral circulant graphs",
    "abstract": "Integral circulant graphs are proposed as models for quantum spin networks that permit a quantum phenomenon called perfect state transfer. Specifically, it is important to know how far information can potentially be transferred between nodes of the quantum networks modelled by integral circulant graphs and this task is related to calculating the maximal diameter of a graph. The integral circulant graph $ICG_n (D)$ has the vertex set $Z_n = \\{0, 1, 2, \\ldots, n - 1\\}$ and vertices $a$ and $b$ are adjacent if $\\gcd(a-b,n)\\in D$, where $D \\subseteq \\{d : d \\mid n,\\ 1\\leq d<n\\}$. Motivated by the result on the upper bound of the diameter of $ICG_n(D)$ given in [N. Saxena, S. Severini, I. Shparlinski, \\textit{Parameters of integral circulant graphs and periodic quantum dynamics}, International Journal of Quantum Information 5 (2007), 417--430], according to which $2|D|+1$ represents one such bound, in this paper we prove that the maximal value of the diameter of the integral circulant graph $ICG_n(D)$ of a given order $n$ with its prime factorization $p_1^{\\alpha_1}\\cdots p_k^{\\alpha_k}$, is equal to $r(n)$ or $r(n)+1$, where $r(n)=k + |\\{ i \\ | \\alpha_i> 1,\\ 1\\leq i\\leq k \\}|$, depending on whether $n\\not\\in 4N+2$ or not, respectively. Furthermore, we show that, for a given order $n$, a divisor set $D$ with $|D|\\leq k$ can always be found such that this bound is attained. Finally, we calculate the maximal diameter in the class of integral circulant graphs of a given order $n$ and cardinality of the divisor set $t\\leq k$ and characterize all extremal graphs. We actually show that the maximal diameter can have the values $2t$, $2t+1$, $r(n)$ and $r(n)+1$ depending on the values of $t$ and $n$. This way we further improve the upper bound of Saxena, Severini and Shparlinski and we also characterize all graphs whose diameters are equal to $2|D|+1$, thus generalizing a result in that paper. ",
    "url": "https://arxiv.org/abs/2307.09081",
    "authors": [
      "Milan Bašić",
      "Aleksandar Ilić",
      "Aleksandar Stamenković"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2307.09169",
    "title": "Efficient Prediction of Peptide Self-assembly through Sequential and  Graphical Encoding",
    "abstract": "In recent years, there has been an explosion of research on the application of deep learning to the prediction of various peptide properties, due to the significant development and market potential of peptides. Molecular dynamics has enabled the efficient collection of large peptide datasets, providing reliable training data for deep learning. However, the lack of systematic analysis of the peptide encoding, which is essential for AI-assisted peptide-related tasks, makes it an urgent problem to be solved for the improvement of prediction accuracy. To address this issue, we first collect a high-quality, colossal simulation dataset of peptide self-assembly containing over 62,000 samples generated by coarse-grained molecular dynamics (CGMD). Then, we systematically investigate the effect of peptide encoding of amino acids into sequences and molecular graphs using state-of-the-art sequential (i.e., RNN, LSTM, and Transformer) and structural deep learning models (i.e., GCN, GAT, and GraphSAGE), on the accuracy of peptide self-assembly prediction, an essential physiochemical process prior to any peptide-related applications. Extensive benchmarking studies have proven Transformer to be the most powerful sequence-encoding-based deep learning model, pushing the limit of peptide self-assembly prediction to decapeptides. In summary, this work provides a comprehensive benchmark analysis of peptide encoding with advanced deep learning models, serving as a guide for a wide range of peptide-related predictions such as isoelectric points, hydration free energy, etc. ",
    "url": "https://arxiv.org/abs/2307.09169",
    "authors": [
      "Zihan Liu",
      "Jiaqi Wang",
      "Yun Luo",
      "Shuang Zhao",
      "Wenbin Li",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.09207",
    "title": "Joint Microseismic Event Detection and Location with a Detection  Transformer",
    "abstract": "Microseismic event detection and location are two primary components in microseismic monitoring, which offers us invaluable insights into the subsurface during reservoir stimulation and evolution. Conventional approaches for event detection and location often suffer from manual intervention and/or heavy computation, while current machine learning-assisted approaches typically address detection and location separately; such limitations hinder the potential for real-time microseismic monitoring. We propose an approach to unify event detection and source location into a single framework by adapting a Convolutional Neural Network backbone and an encoder-decoder Transformer with a set-based Hungarian loss, which is applied directly to recorded waveforms. The proposed network is trained on synthetic data simulating multiple microseismic events corresponding to random source locations in the area of suspected microseismic activities. A synthetic test on a 2D profile of the SEAM Time Lapse model illustrates the capability of the proposed method in detecting the events properly and locating them in the subsurface accurately; while, a field test using the Arkoma Basin data further proves its practicability, efficiency, and its potential in paving the way for real-time monitoring of microseismic events. ",
    "url": "https://arxiv.org/abs/2307.09207",
    "authors": [
      "Yuanyuan Yang",
      "Claire Birnie",
      "Tariq Alkhalifah"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2307.09210",
    "title": "Nested stochastic block model for simultaneously clustering networks and  nodes",
    "abstract": "We introduce the nested stochastic block model (NSBM) to cluster a collection of networks while simultaneously detecting communities within each network. NSBM has several appealing features including the ability to work on unlabeled networks with potentially different node sets, the flexibility to model heterogeneous communities, and the means to automatically select the number of classes for the networks and the number of communities within each network. This is accomplished via a Bayesian model, with a novel application of the nested Dirichlet process (NDP) as a prior to jointly model the between-network and within-network clusters. The dependency introduced by the network data creates nontrivial challenges for the NDP, especially in the development of efficient samplers. For posterior inference, we propose several Markov chain Monte Carlo algorithms including a standard Gibbs sampler, a collapsed Gibbs sampler, and two blocked Gibbs samplers that ultimately return two levels of clustering labels from both within and across the networks. Extensive simulation studies are carried out which demonstrate that the model provides very accurate estimates of both levels of the clustering structure. We also apply our model to two social network datasets that cannot be analyzed using any previous method in the literature due to the anonymity of the nodes and the varying number of nodes in each network. ",
    "url": "https://arxiv.org/abs/2307.09210",
    "authors": [
      "Nathaniel Josephs",
      "Arash A. Amini",
      "Marina Paez",
      "Lizhen Lin"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.09334",
    "title": "Approximating nonlinear functions with latent boundaries in low-rank  excitatory-inhibitory spiking networks",
    "abstract": "Deep feedforward and recurrent rate-based neural networks have become successful functional models of the brain, but they neglect obvious biological details such as spikes and Dale's law. Here we argue that these details are crucial in order to understand how real neural circuits operate. Towards this aim, we put forth a new framework for spike-based computation in low-rank excitatory-inhibitory spiking networks. By considering populations with rank-1 connectivity, we cast each neuron's spiking threshold as a boundary in a low-dimensional input-output space. We then show how the combined thresholds of a population of inhibitory neurons form a stable boundary in this space, and those of a population of excitatory neurons form an unstable boundary. Combining the two boundaries results in a rank-2 excitatory-inhibitory (EI) network with inhibition-stabilized dynamics at the intersection of the two boundaries. The computation of the resulting networks can be understood as the difference of two convex functions, and is thereby capable of approximating arbitrary non-linear input-output mappings. We demonstrate several properties of these networks, including noise suppression and amplification, irregular activity and synaptic balance, as well as how they relate to rate network dynamics in the limit that the boundary becomes soft. Finally, while our work focuses on small networks (5-50 neurons), we discuss potential avenues for scaling up to much larger networks. Overall, our work proposes a new perspective on spiking networks that may serve as a starting point for a mechanistic understanding of biological spike-based computation. ",
    "url": "https://arxiv.org/abs/2307.09334",
    "authors": [
      "William F. Podlaski",
      "Christian K. Machens"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2307.09337",
    "title": "Variational Monte Carlo on a Budget -- Fine-tuning pre-trained Neural  Wavefunctions",
    "abstract": "Obtaining accurate solutions to the Schr\\\"odinger equation is the key challenge in computational quantum chemistry. Deep-learning-based Variational Monte Carlo (DL-VMC) has recently outperformed conventional approaches in terms of accuracy, but only at large computational cost. Whereas in many domains models are trained once and subsequently applied for inference, accurate DL-VMC so far requires a full optimization for every new problem instance, consuming thousands of GPUhs even for small molecules. We instead propose a DL-VMC model which has been pre-trained using self-supervised wavefunction optimization on a large and chemically diverse set of molecules. Applying this model to new molecules without any optimization, yields wavefunctions and absolute energies that outperform established methods such as CCSD(T)-2Z. To obtain accurate relative energies, only few fine-tuning steps of this base model are required. We accomplish this with a fully end-to-end machine-learned model, consisting of an improved geometry embedding architecture and an existing SE(3)-equivariant model to represent molecular orbitals. Combining this architecture with continuous sampling of geometries, we improve zero-shot accuracy by two orders of magnitude compared to the state of the art. We extensively evaluate the accuracy, scalability and limitations of our base model on a wide variety of test systems. ",
    "url": "https://arxiv.org/abs/2307.09337",
    "authors": [
      "Michael Scherbela",
      "Leon Gerard",
      "Philipp Grohs"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2307.09352",
    "title": "Efficient representation of head-related transfer functions in  continuous space-frequency domains",
    "abstract": "Utilizing spherical harmonic (SH) domain has been established as the default method of obtaining continuity over space in head-related transfer functions (HRTFs). This paper concerns different variants of extending this solution by replacing SHs with four-dimensional (4D) continuous functional models in which frequency is imagined as another physical dimension. Recently developed hyperspherical harmonic (HSH) representation is compared with models defined in spherindrical coordinate system by merging SHs with one-dimensional basis functions. The efficiency of both approaches is evaluated based on the reproduction errors for individual HRTFs from HUTUBS database, including detailed analysis of its dependency on chosen orders of approximation in frequency and space. Employing continuous functional models defined in 4D coordinate systems allows HRTF magnitude spectra to be expressed as a small set of coefficients which can be decoded back into values at any direction and frequency. The best performance was noted for HSHs and SHs merged with reverse Fourier-Bessel series, with the former featuring better compression abilities, achieving slightly higher accuracy for low number of coefficients. The presented models can serve multiple purposes, such as interpolation, compression or parametrization for machine learning applications, and can be applied not only to HRTFs but also to other types of directivity functions, e.g. sound source directivity. ",
    "url": "https://arxiv.org/abs/2307.09352",
    "authors": [
      "Adam Szwajcowski"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2307.09402",
    "title": "Study of Vision Transformers for Covid-19 Detection from Chest X-rays",
    "abstract": "The COVID-19 pandemic has led to a global health crisis, highlighting the need for rapid and accurate virus detection. This research paper examines transfer learning with vision transformers for COVID-19 detection, known for its excellent performance in image recognition tasks. We leverage the capability of Vision Transformers to capture global context and learn complex patterns from chest X-ray images. In this work, we explored the recent state-of-art transformer models to detect Covid-19 using CXR images such as vision transformer (ViT), Swin-transformer, Max vision transformer (MViT), and Pyramid Vision transformer (PVT). Through the utilization of transfer learning with IMAGENET weights, the models achieved an impressive accuracy range of 98.75% to 99.5%. Our experiments demonstrate that Vision Transformers achieve state-of-the-art performance in COVID-19 detection, outperforming traditional methods and even Convolutional Neural Networks (CNNs). The results highlight the potential of Vision Transformers as a powerful tool for COVID-19 detection, with implications for improving the efficiency and accuracy of screening and diagnosis in clinical settings. ",
    "url": "https://arxiv.org/abs/2307.09402",
    "authors": [
      "Sandeep Angara",
      "Sharath Thirunagaru"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09457",
    "title": "Smooth Attention for Deep Multiple Instance Learning: Application to CT  Intracranial Hemorrhage Detection",
    "abstract": "Multiple Instance Learning (MIL) has been widely applied to medical imaging diagnosis, where bag labels are known and instance labels inside bags are unknown. Traditional MIL assumes that instances in each bag are independent samples from a given distribution. However, instances are often spatially or sequentially ordered, and one would expect similar diagnostic importance for neighboring instances. To address this, in this study, we propose a smooth attention deep MIL (SA-DMIL) model. Smoothness is achieved by the introduction of first and second order constraints on the latent function encoding the attention paid to each instance in a bag. The method is applied to the detection of intracranial hemorrhage (ICH) on head CT scans. The results show that this novel SA-DMIL: (a) achieves better performance than the non-smooth attention MIL at both scan (bag) and slice (instance) levels; (b) learns spatial dependencies between slices; and (c) outperforms current state-of-the-art MIL methods on the same ICH test set. ",
    "url": "https://arxiv.org/abs/2307.09457",
    "authors": [
      "Yunan Wu",
      "Francisco M. Castro-Macías",
      "Pablo Morales-Álvarez",
      "Rafael Molina",
      "Aggelos K. Katsaggelos"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.09463",
    "title": "A Cryogenic Memristive Neural Decoder for Fault-tolerant Quantum Error  Correction",
    "abstract": "Neural decoders for quantum error correction (QEC) rely on neural networks to classify syndromes extracted from error correction codes and find appropriate recovery operators to protect logical information against errors. Despite the good performance of neural decoders, important practical requirements remain to be achieved, such as minimizing the decoding time to meet typical rates of syndrome generation in repeated error correction schemes, and ensuring the scalability of the decoding approach as the code distance increases. Designing a dedicated integrated circuit to perform the decoding task in co-integration with a quantum processor appears necessary to reach these decoding time and scalability requirements, as routing signals in and out of a cryogenic environment to be processed externally leads to unnecessary delays and an eventual wiring bottleneck. In this work, we report the design and performance analysis of a neural decoder inference accelerator based on an in-memory computing (IMC) architecture, where crossbar arrays of resistive memory devices are employed to both store the synaptic weights of the decoder neural network and perform analog matrix-vector multiplications during inference. In proof-of-concept numerical experiments supported by experimental measurements, we investigate the impact of TiO$_\\textrm{x}$-based memristive devices' non-idealities on decoding accuracy. Hardware-aware training methods are developed to mitigate the loss in accuracy, allowing the memristive neural decoders to achieve a pseudo-threshold of $9.23\\times 10^{-4}$ for the distance-three surface code, whereas the equivalent digital neural decoder achieves a pseudo-threshold of $1.01\\times 10^{-3}$. This work provides a pathway to scalable, fast, and low-power cryogenic IMC hardware for integrated QEC. ",
    "url": "https://arxiv.org/abs/2307.09463",
    "authors": [
      "Frédéric Marcotte",
      "Pierre-Antoine Mouny",
      "Victor Yon",
      "Gebremedhin A. Dagnew",
      "Bohdan Kulchytskyy",
      "Sophie Rochette",
      "Yann Beilliard",
      "Dominique Drouin",
      "Pooya Ronagh"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.09469",
    "title": "Graph Representation of the Magnetic Field Topology in High-Fidelity  Plasma Simulations for Machine Learning Applications",
    "abstract": "Topological analysis of the magnetic field in simulated plasmas allows the study of various physical phenomena in a wide range of settings. One such application is magnetic reconnection, a phenomenon related to the dynamics of the magnetic field topology, which is difficult to detect and characterize in three dimensions. We propose a scalable pipeline for topological data analysis and spatiotemporal graph representation of three-dimensional magnetic vector fields. We demonstrate our methods on simulations of the Earth's magnetosphere produced by Vlasiator, a supercomputer-scale Vlasov theory-based simulation for near-Earth space. The purpose of this work is to challenge the machine learning community to explore graph-based machine learning approaches to address a largely open scientific problem with wide-ranging potential impact. ",
    "url": "https://arxiv.org/abs/2307.09469",
    "authors": [
      "Ioanna Bouri",
      "Fanni Franssila",
      "Markku Alho",
      "Giulia Cozzani",
      "Ivan Zaitsev",
      "Minna Palmroth",
      "Teemu Roos"
    ],
    "subjectives": [
      "Plasma Physics (physics.plasm-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.03639",
    "title": "Randomized Communication and Implicit Graph Representations",
    "abstract": " Comments: 72 pages, 10 figures. Abstract shortened for arXiv ",
    "url": "https://arxiv.org/abs/2111.03639",
    "authors": [
      "Nathaniel Harms",
      "Sebastian Wild",
      "Viktor Zamaraev"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2205.08790",
    "title": "On-device modeling of user's social context and familiar places from  smartphone-embedded sensor data",
    "abstract": " Comments: I request the withdrawal of the paper because it has been already submitted (and published) on arXiv with identifier 2306.15437 ",
    "url": "https://arxiv.org/abs/2205.08790",
    "authors": [
      "Mattia Giovanni Campana",
      "Franca Delmastro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2205.10278",
    "title": "A theoretical framework for self-supervised MR image reconstruction  using sub-sampling via variable density Noisier2Noise",
    "abstract": " Comments: Accepted to IEEE Computational Imaging ",
    "url": "https://arxiv.org/abs/2205.10278",
    "authors": [
      "Charles Millard",
      "Mark Chiew"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.10381",
    "title": "TabText: A Flexible and Contextual Approach to Tabular Data  Representation",
    "abstract": " Title: TabText: A Flexible and Contextual Approach to Tabular Data  Representation ",
    "url": "https://arxiv.org/abs/2206.10381",
    "authors": [
      "Kimberly Villalobos Carballo",
      "Liangyuan Na",
      "Yu Ma",
      "Léonard Boussioux",
      "Cynthia Zeng",
      "Luis R. Soenksen",
      "Dimitris Bertsimas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.02159",
    "title": "Robustness Analysis of Video-Language Models Against Visual and Language  Perturbations",
    "abstract": " Comments: NeurIPS 2022 Datasets and Benchmarks Track. This projects webpage is located at this https URL ",
    "url": "https://arxiv.org/abs/2207.02159",
    "authors": [
      "Madeline C. Schiappa",
      "Shruti Vyas",
      "Hamid Palangi",
      "Yogesh S. Rawat",
      "Vibhav Vineet"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2207.09920",
    "title": "DESCN: Deep Entire Space Cross Networks for Individual Treatment Effect  Estimation",
    "abstract": " Comments: Accepted by SIGKDD 2022 Applied Data Science Track ",
    "url": "https://arxiv.org/abs/2207.09920",
    "authors": [
      "Kailiang Zhong",
      "Fengtong Xiao",
      "Yan Ren",
      "Yaorong Liang",
      "Wenqing Yao",
      "Xiaofeng Yang",
      "Ling Cen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.12308",
    "title": "CFAD: A Chinese Dataset for Fake Audio Detection",
    "abstract": " Comments: FAD renamed as CFAD ",
    "url": "https://arxiv.org/abs/2207.12308",
    "authors": [
      "Haoxin Ma",
      "Jiangyan Yi",
      "Chenglong Wang",
      "Xinrui Yan",
      "Jianhua Tao",
      "Tao Wang",
      "Shiming Wang",
      "Ruibo Fu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2208.06868",
    "title": "Frouros: A Python library for drift detection in machine learning  systems",
    "abstract": " Comments: 11 pages, 1 table ",
    "url": "https://arxiv.org/abs/2208.06868",
    "authors": [
      "Jaime Céspedes-Sisniega",
      "Álvaro López-García"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06420",
    "title": "Robust ab initio solution of the cryo-EM reconstruction problem at low  resolution with small data sets",
    "abstract": " Comments: 43 pages, 15 figures ",
    "url": "https://arxiv.org/abs/2209.06420",
    "authors": [
      "Aaditya V. Rangan",
      "Leslie Greengard"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2209.15304",
    "title": "Hiding Visual Information via Obfuscating Adversarial Perturbations",
    "abstract": " Title: Hiding Visual Information via Obfuscating Adversarial Perturbations ",
    "url": "https://arxiv.org/abs/2209.15304",
    "authors": [
      "Zhigang Su",
      "Dawei Zhou",
      "Decheng Liu",
      "Nannan Wang",
      "Zhen Wang",
      "Xinbo Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.01426",
    "title": "Continuous Monte Carlo Graph Search",
    "abstract": " Comments: Under review ",
    "url": "https://arxiv.org/abs/2210.01426",
    "authors": [
      "Kalle Kujanpää",
      "Amin Babadi",
      "Yi Zhao",
      "Juho Kannala",
      "Alexander Ilin",
      "Joni Pajarinen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2210.03410",
    "title": "The Power of Small Coalitions under Two-Tier Majority on Regular Graphs",
    "abstract": " Comments: 28 pages, 8 figures, accepted for publication in Discrete Applied Mathematics ",
    "url": "https://arxiv.org/abs/2210.03410",
    "authors": [
      "Pavel Chebotarev",
      "David Peleg"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Multiagent Systems (cs.MA)",
      "Social and Information Networks (cs.SI)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2210.13108",
    "title": "Heat Demand Forecasting with Multi-Resolutional Representation of  Heterogeneous Temporal Ensemble",
    "abstract": " Comments: this https URL ",
    "url": "https://arxiv.org/abs/2210.13108",
    "authors": [
      "Adithya Ramachandran",
      "Satyaki Chatterjee",
      "Siming Bayer",
      "Andreas Maier",
      "Thorkil Flensmark"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.16596",
    "title": "Towards Dynamic Causal Discovery with Rare Events: A Nonparametric  Conditional Independence Test",
    "abstract": " Title: Towards Dynamic Causal Discovery with Rare Events: A Nonparametric  Conditional Independence Test ",
    "url": "https://arxiv.org/abs/2211.16596",
    "authors": [
      "Chih-Yuan Chiu",
      "Kshitij Kulkarni",
      "Shankar Sastry"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2212.10426",
    "title": "Deep Riemannian Networks for EEG Decoding",
    "abstract": " Comments: 27 pages, 13 Figures ",
    "url": "https://arxiv.org/abs/2212.10426",
    "authors": [
      "Daniel Wilson",
      "Robin Tibor Schirrmeister",
      "Lukas Alexander Wilhelm Gemein",
      "Tonio Ball"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.01478",
    "title": "Modeling communication asymmetry and content personalization in online  social networks",
    "abstract": " Title: Modeling communication asymmetry and content personalization in online  social networks ",
    "url": "https://arxiv.org/abs/2301.01478",
    "authors": [
      "Franco Galante",
      "Luca Vassio",
      "Michele Garetto",
      "Emilio Leonardi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2301.13066",
    "title": "A Human Word Association based model for topic detection in social  networks",
    "abstract": " Title: A Human Word Association based model for topic detection in social  networks ",
    "url": "https://arxiv.org/abs/2301.13066",
    "authors": [
      "Mehrdad Ranjbar Khadivi",
      "Shahin Akbarpour",
      "Mohammad-Reza Feizi-Derakhshi",
      "Babak Anari"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.13816",
    "title": "Execution-based Code Generation using Deep Reinforcement Learning",
    "abstract": " Comments: Published in Transactions on Machine Learning Research (TMLR), 2023 ",
    "url": "https://arxiv.org/abs/2301.13816",
    "authors": [
      "Parshin Shojaee",
      "Aneesh Jain",
      "Sindhu Tipirneni",
      "Chandan K. Reddy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2302.09775",
    "title": "Persian topic detection based on Human Word association and graph  embedding",
    "abstract": " Title: Persian topic detection based on Human Word association and graph  embedding ",
    "url": "https://arxiv.org/abs/2302.09775",
    "authors": [
      "Mehrdad Ranjbar-Khadivi",
      "Shahin Akbarpour",
      "Mohammad-Reza Feizi-Derakhshi",
      "Babak Anari"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2302.10632",
    "title": "Multi-Modal Self-Supervised Learning for Recommendation",
    "abstract": " Comments: This paper has been published as a full paper at WWW 2023 ",
    "url": "https://arxiv.org/abs/2302.10632",
    "authors": [
      "Wei Wei",
      "Chao Huang",
      "Lianghao Xia",
      "Chuxu Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2303.00046",
    "title": "Edit at your own risk: evaluating the robustness of edited models to  distribution shifts",
    "abstract": " Comments: DB and CG contributed equally ",
    "url": "https://arxiv.org/abs/2303.00046",
    "authors": [
      "Davis Brown",
      "Charles Godfrey",
      "Cody Nizinski",
      "Jonathan Tu",
      "Henry Kvinge"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.02401",
    "title": "Open-Vocabulary Affordance Detection in 3D Point Clouds",
    "abstract": " Comments: Accepted to The 2023 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS 2023) ",
    "url": "https://arxiv.org/abs/2303.02401",
    "authors": [
      "Toan Nguyen",
      "Minh Nhat Vu",
      "An Vuong",
      "Dzung Nguyen",
      "Thieu Vo",
      "Ngan Le",
      "Anh Nguyen"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01580",
    "title": "Untargeted Near-collision Attacks in Biometric Recognition",
    "abstract": " Comments: Addition of results and correction of typos ",
    "url": "https://arxiv.org/abs/2304.01580",
    "authors": [
      "Axel Durbet",
      "Paul-Marie Grollemund",
      "Kevin Thiry-Atighehchi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02011",
    "title": "FakET: Simulating Cryo-Electron Tomograms with Neural Style Transfer",
    "abstract": " Comments: 18 pages, 1 table, 16 figures. Included fine-tuning, ablation, and noiseless experiments ",
    "url": "https://arxiv.org/abs/2304.02011",
    "authors": [
      "Pavol Harar",
      "Lukas Herrmann",
      "Philipp Grohs",
      "David Haselbach"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2304.13695",
    "title": "Efficient Approximation for Subgraph-Hitting Problems in Sparse Graphs  and Geometric Intersection Graphs",
    "abstract": " Comments: 52 pages, subsuming the article arXiv:2304.12789 ",
    "url": "https://arxiv.org/abs/2304.13695",
    "authors": [
      "Zdeněk Dvořák",
      "Daniel Lokshtanov",
      "Fahad Panolan",
      "Saket Saurabh",
      "Jie Xue",
      "Meirav Zehavi"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2305.00856",
    "title": "Analyzing Transatlantic Network Traffic over Scientific Data Caches",
    "abstract": " Title: Analyzing Transatlantic Network Traffic over Scientific Data Caches ",
    "url": "https://arxiv.org/abs/2305.00856",
    "authors": [
      "Z. Deng",
      "A. Sim",
      "K. Wu",
      "C. Guok",
      "D. Hazen",
      "I. Monga",
      "F. Andrijauskas",
      "F. Wuerthwein",
      "D. Weitzel"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2305.01548",
    "title": "Explainable Conversational Question Answering over Heterogeneous Sources  via Iterative Graph Neural Networks",
    "abstract": " Comments: Accepted at SIGIR 2023 (extended version) ",
    "url": "https://arxiv.org/abs/2305.01548",
    "authors": [
      "Philipp Christmann",
      "Rishiraj Saha Roy",
      "Gerhard Weikum"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2305.02859",
    "title": "Social Robot Navigation through Constrained Optimization: a Comparative  Study of Uncertainty-based Objectives and Constraints",
    "abstract": " Title: Social Robot Navigation through Constrained Optimization: a Comparative  Study of Uncertainty-based Objectives and Constraints ",
    "url": "https://arxiv.org/abs/2305.02859",
    "authors": [
      "Timur Akhtyamov",
      "Aleksandr Kashirin",
      "Aleksey Postnikov",
      "Gonzalo Ferrer"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.03829",
    "title": "Improving Image-Based Precision Medicine with Uncertainty-Aware Causal  Models",
    "abstract": " Title: Improving Image-Based Precision Medicine with Uncertainty-Aware Causal  Models ",
    "url": "https://arxiv.org/abs/2305.03829",
    "authors": [
      "Joshua Durso-Finley",
      "Jean-Pierre Falet",
      "Raghav Mehta",
      "Douglas L. Arnold",
      "Nick Pawlowski",
      "Tal Arbel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.05097",
    "title": "Self-Repellent Random Walks on General Graphs -- Achieving Minimal  Sampling Variance via Nonlinear Markov Chains",
    "abstract": " Comments: Selected for oral presentation at ICML 2023 ",
    "url": "https://arxiv.org/abs/2305.05097",
    "authors": [
      "Vishwaraj Doshi",
      "Jie Hu",
      "Do Young Eun"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09211",
    "title": "CB-HVTNet: A channel-boosted hybrid vision transformer network for  lymphocyte assessment in histopathological images",
    "abstract": " Title: CB-HVTNet: A channel-boosted hybrid vision transformer network for  lymphocyte assessment in histopathological images ",
    "url": "https://arxiv.org/abs/2305.09211",
    "authors": [
      "Momina Liaqat Ali",
      "Zunaira Rauf",
      "Asifullah Khan",
      "Anabia Sohail",
      "Rafi Ullah",
      "Jeonghwan Gwak"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.10826",
    "title": "GraphMoco:a Graph Momentum Contrast Model that Using Multimodel  Structure Information for Large-scale Binary Function Representation Learning",
    "abstract": " Comments: 22 pages,7 figures ",
    "url": "https://arxiv.org/abs/2305.10826",
    "authors": [
      "Sun Runjin",
      "Guo ShiZe",
      "Li Wei",
      "Zhang XingYu",
      "Guo Xi",
      "Pan ZhiSong"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.11997",
    "title": "Robust Counterfactual Explanations for Neural Networks With  Probabilistic Guarantees",
    "abstract": " Comments: International Conference on Machine Learning (ICML), 2023 ",
    "url": "https://arxiv.org/abs/2305.11997",
    "authors": [
      "Faisal Hamman",
      "Erfaun Noorani",
      "Saumitra Mishra",
      "Daniele Magazzeni",
      "Sanghamitra Dutta"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.13115",
    "title": "Causal-Based Supervision of Attention in Graph Neural Network: A Better  and Simpler Choice towards Powerful Attention",
    "abstract": " Title: Causal-Based Supervision of Attention in Graph Neural Network: A Better  and Simpler Choice towards Powerful Attention ",
    "url": "https://arxiv.org/abs/2305.13115",
    "authors": [
      "Hongjun Wang",
      "Jiyuan Chen",
      "Lun Du",
      "Qiang Fu",
      "Shi Han",
      "Xuan Song"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2305.13399",
    "title": "Efficient Large-Scale Visual Representation Learning And Evaluation",
    "abstract": " Title: Efficient Large-Scale Visual Representation Learning And Evaluation ",
    "url": "https://arxiv.org/abs/2305.13399",
    "authors": [
      "Eden Dolev",
      "Alaa Awad",
      "Denisa Roberts",
      "Zahra Ebrahimzadeh",
      "Marcin Mejran",
      "Vaibhav Malpani",
      "Mahir Yavuz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.16044",
    "title": "Exploiting Noise as a Resource for Computation and Learning in Spiking  Neural Networks",
    "abstract": " Title: Exploiting Noise as a Resource for Computation and Learning in Spiking  Neural Networks ",
    "url": "https://arxiv.org/abs/2305.16044",
    "authors": [
      "Gehua Ma",
      "Rui Yan",
      "Huajin Tang"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.16562",
    "title": "Unsupervised Embedding Quality Evaluation",
    "abstract": " Comments: As appeared at the 2nd Annual Workshop on Topology, Algebra, and Geometry in Machine Learning (TAG-ML) at the 40th International Conference on Machine Learning (ICML), Honolulu, Hawaii, USA. 2023 ",
    "url": "https://arxiv.org/abs/2305.16562",
    "authors": [
      "Anton Tsitsulin",
      "Marina Munkhoeva",
      "Bryan Perozzi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.17757",
    "title": "Diversity-seeking Jump Games in Networks",
    "abstract": " Title: Diversity-seeking Jump Games in Networks ",
    "url": "https://arxiv.org/abs/2305.17757",
    "authors": [
      "Lata Narayanan",
      "Yasaman Sabbagh"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2306.05439",
    "title": "Contrastive Representation Disentanglement for Clustering",
    "abstract": " Comments: 10 pages, 7 tables, 4 figures ",
    "url": "https://arxiv.org/abs/2306.05439",
    "authors": [
      "Fei Ding",
      "Dan Zhang",
      "Yin Yang",
      "Venkat Krovi",
      "Feng Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2306.07615",
    "title": "UOD: Universal One-shot Detection of Anatomical Landmarks",
    "abstract": " Comments: Eealy accepted by MICCAI 2023. 11pages, 4 figures, 2 tables. arXiv admin note: text overlap with arXiv:2203.06433 ",
    "url": "https://arxiv.org/abs/2306.07615",
    "authors": [
      "Heqin Zhu",
      "Quan Quan",
      "Qingsong Yao",
      "Zaiyi Liu",
      "S. Kevin Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.13347",
    "title": "High-Speed Area-Efficient Hardware Architecture for the Efficient  Detection of Faults in a Bit-Parallel Multiplier Utilizing the Polynomial  Basis of GF(2m)",
    "abstract": " Comments: 9 pages, 4 figures. arXiv admin note: substantial text overlap with arXiv:2209.13388 ",
    "url": "https://arxiv.org/abs/2306.13347",
    "authors": [
      "Saeideh Nabipour",
      "Javad Javidan"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2306.15764",
    "title": "High Fidelity Image Counterfactuals with Probabilistic Causal Models",
    "abstract": " Comments: ICML2023 publication ",
    "url": "https://arxiv.org/abs/2306.15764",
    "authors": [
      "Fabio De Sousa Ribeiro",
      "Tian Xia",
      "Miguel Monteiro",
      "Nick Pawlowski",
      "Ben Glocker"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2307.02839",
    "title": "Enhancing LLM with Evolutionary Fine Tuning for News Summary Generation",
    "abstract": " Comments: 12 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2307.02839",
    "authors": [
      "Le Xiao",
      "Xiaolin Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.06887",
    "title": "Provable Multi-Task Representation Learning by Two-Layer ReLU Neural  Networks",
    "abstract": " Title: Provable Multi-Task Representation Learning by Two-Layer ReLU Neural  Networks ",
    "url": "https://arxiv.org/abs/2307.06887",
    "authors": [
      "Liam Collins",
      "Hamed Hassani",
      "Mahdi Soltanolkotabi",
      "Aryan Mokhtari",
      "Sanjay Shakkottai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.07250",
    "title": "Mitigating Adversarial Vulnerability through Causal Parameter Estimation  by Adversarial Double Machine Learning",
    "abstract": " Comments: Accepted in ICCV 2023 ",
    "url": "https://arxiv.org/abs/2307.07250",
    "authors": [
      "Byung-Kwan Lee",
      "Junho Kim",
      "Yong Man Ro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.07916",
    "title": "On the Robustness of Split Learning against Adversarial Attacks",
    "abstract": " Comments: accepted by ECAI 2023, camera-ready version ",
    "url": "https://arxiv.org/abs/2307.07916",
    "authors": [
      "Mingyuan Fan",
      "Cen Chen",
      "Chengyu Wang",
      "Wenmeng Zhou",
      "Jun Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.08433",
    "title": "From random-walks to graph-sprints: a low-latency node embedding  framework on continuous-time dynamic graphs",
    "abstract": " Comments: 9 pages, 5 figures, 7 tables ",
    "url": "https://arxiv.org/abs/2307.08433",
    "authors": [
      "Ahmad Naser Eddin",
      "Jacopo Bono",
      "David Aparício",
      "Hugo Ferreira",
      "João Ascensão",
      "Pedro Ribeiro",
      "Pedro Bizarro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.08466",
    "title": "Generalizable Classification of UHF Partial Discharge Signals in  Gas-Insulated HVDC Systems Using Neural Networks",
    "abstract": " Comments: 8 pages, submitted to IEEE Transactions on Power Delivery ",
    "url": "https://arxiv.org/abs/2307.08466",
    "authors": [
      "Steffen Seitz",
      "Thomas Götz",
      "Christopher Lindenberg",
      "Ronald Tetzlaff",
      "Stephan Schlegel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.08535",
    "title": "Multi-class point cloud completion networks for 3D cardiac anatomy  reconstruction from cine magnetic resonance images",
    "abstract": " Title: Multi-class point cloud completion networks for 3D cardiac anatomy  reconstruction from cine magnetic resonance images ",
    "url": "https://arxiv.org/abs/2307.08535",
    "authors": [
      "Marcel Beetz",
      "Abhirup Banerjee",
      "Julius Ossenberg-Engels",
      "Vicente Grau"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.08572",
    "title": "Revisiting the Robustness of the Minimum Error Entropy Criterion: A  Transfer Learning Case Study",
    "abstract": " Comments: Manuscript accepted at ECAI-23. Code available at this https URL ",
    "url": "https://arxiv.org/abs/2307.08572",
    "authors": [
      "Luis Pedro Silvestrin",
      "Shujian Yu",
      "Mark Hoogendoorn"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.08652",
    "title": "Search Me Knot, Render Me Knot: Embedding Search and Differentiable  Rendering of Knots in 3D",
    "abstract": " Comments: Work in progress ",
    "url": "https://arxiv.org/abs/2307.08652",
    "authors": [
      "Aalok Gangopadhyay",
      "Paras Gupta",
      "Tarun Sharma",
      "Prajwal Singh",
      "Shanmuganathan Raman"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2307.08671",
    "title": "Deep Cross-Modal Steganography Using Neural Representations",
    "abstract": " Comments: ICIP 2023 ",
    "url": "https://arxiv.org/abs/2307.08671",
    "authors": [
      "Gyojin Han",
      "Dong-Jae Lee",
      "Jiwan Hur",
      "Jaehyun Choi",
      "Junmo Kim"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.08686",
    "title": "An R package for parametric estimation of causal effects",
    "abstract": " Title: An R package for parametric estimation of causal effects ",
    "url": "https://arxiv.org/abs/2307.08686",
    "authors": [
      "Joshua Wolff Anderson",
      "Cyril Rakovski"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Mathematical Software (cs.MS)",
      "Applications (stat.AP)"
    ]
  }
]