[
  {
    "id": "arXiv:2111.13726",
    "title": "BCH-NLP at BioCreative VII Track 3: medications detection in tweets  using transformer networks and multi-task learning",
    "abstract": "In this paper, we present our work participating in the BioCreative VII Track 3 - automatic extraction of medication names in tweets, where we implemented a multi-task learning model that is jointly trained on text classification and sequence labelling. Our best system run achieved a strict F1 of 80.4, ranking first and more than 10 points higher than the average score of all participants. Our analyses show that the ensemble technique, multi-task learning, and data augmentation are all beneficial for medication detection in tweets. ",
    "url": "https://arxiv.org/abs/2111.13726",
    "authors": [
      "Dongfang Xu",
      "Shan Chen",
      "Timothy Miller"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.13742",
    "title": "Variable resolution Poisson-disk sampling for meshing discrete fracture  networks",
    "abstract": "We present the near-Maximal Algorithm for Poisson-disk Sampling (nMAPS) to generate point distributions for variable resolution Delaunay triangular and tetrahedral meshes in two and three-dimensions, respectively. nMAPS consists of two principal stages. In the first stage, an initial point distribution is produced using a cell-based rejection algorithm. In the second stage, holes in the sample are detected using an efficient background grid and filled in to obtain a near-maximal covering. Extensive testing shows that nMAPS generates a variable resolution mesh in linear run time with the number of accepted points. We demonstrate nMAPS capabilities by meshing three-dimensional discrete fracture networks (DFN) and the surrounding volume. The discretized boundaries of the fractures, which are represented as planar polygons, are used as the seed of 2D-nMAPS to produce a conforming Delaunay triangulation. The combined mesh of the DFN is used as the seed for 3D-nMAPS, which produces conforming Delaunay tetrahedra surrounding the network. Under a set of conditions that naturally arise in maximal Poisson-disk samples and are satisfied by nMAPS, the two-dimensional Delaunay triangulations are guaranteed to only have well-behaved triangular faces. While nMAPS does not provide triangulation quality bounds in more than two dimensions, we found that low-quality tetrahedra in 3D are infrequent, can be readily detected and removed, and a high quality balanced mesh is produced. ",
    "url": "https://arxiv.org/abs/2111.13742",
    "authors": [
      "Johannes Krotz",
      "Matthew R. Sweeney",
      "Jeffrey D. Hyman",
      "Juan M. Restrepo",
      "Carl W. Gable"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2111.13854",
    "title": "A novel knowledge graph development for industry design: A case study on  indirect coal liquefaction process",
    "abstract": "Hazard and operability analysis (HAZOP) is a remarkable representative in industrial safety engineering, the HAZOP report contains a great storehouse of industrial safety knowledge (ISK). In order to unlock the value of ISK and improve HAZOP efficiency, a novel knowledge graph development for industrial safety (ISKG) is proposed. Firstly, according to the international standard IEC61882, we use the top-down approach to disintegrate HAZOP into hazard events with multi-level information, which constructs the ontology library. Secondly, using the bottom-up approach and natural language processing technology, we present an ingenious information extraction model termed HAINEX based on hybrid deep learning. Briefly, the HAINEX consists of the following modules: an improved industrial bidirectional encoder for extracting semantic features, a bidirectional long short-term memory network for obtaining the context representation, and a decoder based on conditional random field with an improved industrial loss function. Finally, the constructed HAZOP triples are imported into the graph database. Experiments show that HAINEX is advanced and reliable. We take the indirect coal liquefaction process as a case study to develop ISKG. ISKG oriented applications, such as ISK visualization, ISK retrieval, auxiliary HAZOP and hazard propagation reasoning, can mine the potential of ISK and improve HAZOP efficiency, which is of great significance in strengthening industrial safety. What is more, the ISKG based question-answering system can be applied to teaching guidance to popularize the safety knowledge and enhance prevention awareness for non-professionals. ",
    "url": "https://arxiv.org/abs/2111.13854",
    "authors": [
      "Zhenhua Wang",
      "Beike Zhang",
      "Dong Gao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2111.13859",
    "title": "Asymptotic spectra of large (grid) graphs with a uniform local structure  (part II): numerical applications",
    "abstract": "In the current work we are concerned with sequences of graphs having a grid geometry, with a uniform local structure in a bounded domain $\\Omega\\subset {\\mathbb R}^d$, $d\\ge 1$. When $\\Omega=[0,1]$, such graphs include the standard Toeplitz graphs and, for $\\Omega=[0,1]^d$, the considered class includes $d$-level Toeplitz graphs. In the general case, the underlying sequence of adjacency matrices has a canonical eigenvalue distribution, in the Weyl sense, and it has been shown in the theoretical part of this work that we can associate to it a symbol $\\boldsymbol{\\mathfrak{f}}$. The knowledge of the symbol and of its basic analytical features provides key information on the eigenvalue structure in terms of localization, spectral gap, clustering, and global distribution. In the present paper, many different applications are discussed and various numerical examples are presented in order to underline the practical use of the developed theory. Tests and applications are mainly obtained from the approximation of differential operators via numerical schemes such as Finite Differences (FDs), Finite Elements (FEs), and Isogeometric Analysis (IgA). Moreover, we show that more applications can be taken into account, since the results presented here can be applied as well to study the spectral properties of adjacency matrices and Laplacian operators of general large graphs and networks, whenever the involved matrices enjoy a uniform local structure. ",
    "url": "https://arxiv.org/abs/2111.13859",
    "authors": [
      "Andrea Adriani",
      "Davide Bianchi",
      "Paola Ferrari",
      "Stefano Serra-Capizzano"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Analysis of PDEs (math.AP)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2111.13908",
    "title": "Artificial neural networks for online error detection",
    "abstract": "Hardware reliability is adversely affected by the downscaling of semiconductor devices and the scale-out of systems necessitated by modern applications. Apart from crashes, this unreliability often manifests as silent data corruptions (SDCs), affecting application output. Therefore, we need low-cost and low-human-effort solutions to reduce the incidence rate and the effects of SDCs on the quality of application outputs. We propose Artificial Neural Networks (ANNs) as an effective mechanism for online error detection. We train ANNs using software fault injection. We find that the average overhead of our approach, followed by a costly error correction by re-execution, is 6.45% in terms of CPU cycles. We also report that ANNs discover 94.85% of faults thereby resulting in minimal output quality degradation. To validate our approach we overclock ARM Cortex A53 CPUs, execute benchmarks on them and record the program outputs. ANNs prove to be an efficient error detection mechanism, better than a state of the art approximate error detection mechanism (Topaz), both in terms of performance (12.81% CPU overhead) and quality of application output (94.11% detection coverage). ",
    "url": "https://arxiv.org/abs/2111.13908",
    "authors": [
      "Vassilis Vassiliadis",
      "Konstantinos Parasyris",
      "Christos D. Antonopoulos",
      "Spyros Lalis",
      "Nikolaos Bellas"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2111.13987",
    "title": "Multi-modality fusion using canonical correlation analysis methods:  Application in breast cancer survival prediction from histology and genomics",
    "abstract": "The availability of multi-modality datasets provides a unique opportunity to characterize the same object of interest using multiple viewpoints more comprehensively. In this work, we investigate the use of canonical correlation analysis (CCA) and penalized variants of CCA (pCCA) for the fusion of two modalities. We study a simple graphical model for the generation of two-modality data. We analytically show that, with known model parameters, posterior mean estimators that jointly use both modalities outperform arbitrary linear mixing of single modality posterior estimators in latent variable prediction. Penalized extensions of CCA (pCCA) that incorporate domain knowledge can discover correlations with high-dimensional, low-sample data, whereas traditional CCA is inapplicable. To facilitate the generation of multi-dimensional embeddings with pCCA, we propose two matrix deflation schemes that enforce desirable properties exhibited by CCA. We propose a two-stage prediction pipeline using pCCA embeddings generated with deflation for latent variable prediction by combining all the above. On simulated data, our proposed model drastically reduces the mean-squared error in latent variable prediction. When applied to publicly available histopathology data and RNA-sequencing data from The Cancer Genome Atlas (TCGA) breast cancer patients, our model can outperform principal components analysis (PCA) embeddings of the same dimension in survival prediction. ",
    "url": "https://arxiv.org/abs/2111.13987",
    "authors": [
      "Vaishnavi Subramanian",
      "Tanveer Syeda-Mahmood",
      "Minh N. Do"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)",
      "Quantitative Methods (q-bio.QM)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2111.13993",
    "title": "An analysis of document graph construction methods for AMR summarization",
    "abstract": "Meaning Representation (AMR) is a graph-based semantic representation for sentences, composed of collections of concepts linked by semantic relations. AMR-based approaches have found success in a variety of applications, but a challenge to using it in tasks that require document-level context is that it only represents individual sentences. Prior work in AMR-based summarization has automatically merged the individual sentence graphs into a document graph, but the method of merging and its effects on summary content selection have not been independently evaluated. In this paper, we present a novel dataset consisting of human-annotated alignments between the nodes of paired documents and summaries which may be used to evaluate (1) merge strategies; and (2) the performance of content selection methods over nodes of a merged or unmerged AMR graph. We apply these two forms of evaluation to prior work as well as a new method for node merging and show that our new method has significantly better performance than prior work. ",
    "url": "https://arxiv.org/abs/2111.13993",
    "authors": [
      "Fei-Tzin Lee",
      "Chris Kedzie",
      "Nakul Verma",
      "Kathleen McKeown"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2111.14005",
    "title": "A polynomial kernel for vertex deletion into bipartite permutation  graphs",
    "abstract": "A permutation graph can be defined as an intersection graph of segments whose endpoints lie on two parallel lines $\\ell_1$ and $\\ell_2$, one on each. A bipartite permutation graph is a permutation graph which is bipartite. In the the bipartite permutation vertex deletion problem we ask for a given $n$-vertex graph, whether we can remove at most $k$ vertices to obtain a bipartite permutation graph. This problem is NP-complete but it does admit an FPT algorithm parameterized by $k$. In this paper we study the kernelization of this problem and show that it admits a polynomial kernel with $O(k^{99})$ vertices. ",
    "url": "https://arxiv.org/abs/2111.14005",
    "authors": [
      "Jan Derbisz"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2111.14246",
    "title": "Payoff landscapes and the robustness of selfish optimization in iterated  games",
    "abstract": "In iterated games, a player can unilaterally exert influence over the outcome through a careful choice of strategy. A powerful class of such \"payoff control\" strategies was discovered by Press and Dyson in 2012. Their so-called \"zero-determinant\" (ZD) strategies allow a player to unilaterally enforce a linear relationship between both players' payoffs. It was subsequently shown that when the slope of this linear relationship is positive, ZD strategies are robustly effective against a selfishly optimizing co-player, in that all adapting paths of the selfish player lead to the maximal payoffs for both players (at least when there are certain restrictions on the game parameters). In this paper, we investigate the efficacy of selfish learning against a fixed player in more general settings, for both ZD and non-ZD strategies. We first prove that in any symmetric 2x2 game, the selfish player's final strategy must be of a certain form and cannot be fully stochastic. We then show that there are prisoner's dilemma interactions for which the robustness result does not hold when one player uses a fixed ZD strategy with positive slope. We give examples of selfish adapting paths that lead to locally but not globally optimal payoffs, undermining the robustness of payoff control strategies. For non-ZD strategies, these pathologies arise regardless of the original restrictions on the game parameters. Our results illuminate the difficulty of implementing robust payoff control and selfish optimization, even in the simplest context of playing against a fixed strategy. ",
    "url": "https://arxiv.org/abs/2111.14246",
    "authors": [
      "Arjun Mirani",
      "Alex McAvoy"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Populations and Evolution (q-bio.PE)"
    ]
  },
  {
    "id": "arXiv:2111.14366",
    "title": "Exploring technologies to better link physical evidence and digital  information for disaster victim identification",
    "abstract": "Disaster victim identification (DVI) entails a protracted process of evidence collection and data matching to reconcile physical remains with victim identity. Technology is critical to DVI by enabling the linkage of physical evidence to information. However, labelling physical remains and collecting data at the scene are dominated by low-technology paper-based practices. We ask, how can technology help us tag and track the victims of disaster? Our response has two parts. First, we conducted a human-computer interaction led investigation into the systematic factors impacting DVI tagging and tracking processes. Through interviews with Australian DVI practitioners, we explored how technologies to improve linkage might fit with prevailing work practices and preferences; practical and social considerations; and existing systems and processes. Using insights from these interviews and relevant literature, we identified four critical themes: protocols and training; stress and stressors; the plurality of information capture and management systems; and practicalities and constraints. Second, we applied the themes identified in the first part of the investigation to critically review technologies that could support DVI practitioners by enhancing DVI processes that link physical evidence to information. This resulted in an overview of candidate technologies matched with consideration of their key attributes. This study recognises the importance of considering human factors that can affect technology adoption into existing practices. We provide a searchable table (Supplementary Information) that relates technologies to the key attributes relevant to DVI practice, for the reader to apply to their own context. While this research directly contributes to DVI, it also has applications to other domains in which a physical/digital linkage is required, particularly within high-stress environments. ",
    "url": "https://arxiv.org/abs/2111.14366",
    "authors": [
      "David Lovell",
      "Kellie Vella",
      "Diego Muñoz",
      "Matt McKague",
      "Margot Brereton",
      "Peter Ellis"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2111.14417",
    "title": "An axiomatic derivation of Condorcet-consistent social decision rules",
    "abstract": "A social decision rule (SDR) is any non-empty set-valued map that associates any profile of individual preferences with the set of (winning) alternatives. An SDR is Condorcet-consistent if it selects the set of Condorcet winners whenever this later is non-empty. We propose a characterization of Condorcet consistent SDRs with a set of minimal axioms. It appears that all these rules satisfy a weaker Condorcet principle - the top consistency - which is not explicitly based on majority comparisons while all scoring rules fail to meet it. We also propose an alternative characterization of this class of rules using Maskin monotonicity. ",
    "url": "https://arxiv.org/abs/2111.14417",
    "authors": [
      "Aurelien Mekuko Yonta",
      "Matias Núñez",
      "Issofa Moyouwou",
      "Nicolas Gabriel Andjiga"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2111.14434",
    "title": "Robust Federated Learning for execution time-based device model  identification under label-flipping attack",
    "abstract": "The computing device deployment explosion experienced in recent years, motivated by the advances of technologies such as Internet-of-Things (IoT) and 5G, has led to a global scenario with increasing cybersecurity risks and threats. Among them, device spoofing and impersonation cyberattacks stand out due to their impact and, usually, low complexity required to be launched. To solve this issue, several solutions have emerged to identify device models and types based on the combination of behavioral fingerprinting and Machine/Deep Learning (ML/DL) techniques. However, these solutions are not appropriated for scenarios where data privacy and protection is a must, as they require data centralization for processing. In this context, newer approaches such as Federated Learning (FL) have not been fully explored yet, especially when malicious clients are present in the scenario setup. The present work analyzes and compares the device model identification performance of a centralized DL model with an FL one while using execution time-based events. For experimental purposes, a dataset containing execution-time features of 55 Raspberry Pis belonging to four different models has been collected and published. Using this dataset, the proposed solution achieved 0.9999 accuracy in both setups, centralized and federated, showing no performance decrease while preserving data privacy. Later, the impact of a label-flipping attack during the federated model training is evaluated, using several aggregation mechanisms as countermeasure. Zeno and coordinate-wise median aggregation show the best performance, although their performance greatly degrades when the percentage of fully malicious clients (all training samples poisoned) grows over 50%. ",
    "url": "https://arxiv.org/abs/2111.14434",
    "authors": [
      "Pedro Miguel Sánchez Sánchez",
      "Alberto Huertas Celdrán",
      "José Rafael Buendía Rubio",
      "Gérôme Bovet",
      "Gregorio Martínez Pérez"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.14507",
    "title": "SPIN: Simplifying Polar Invariance for Neural networks Application to  vision-based irradiance forecasting",
    "abstract": "Translational invariance induced by pooling operations is an inherent property of convolutional neural networks, which facilitates numerous computer vision tasks such as classification. Yet to leverage rotational invariant tasks, convolutional architectures require specific rotational invariant layers or extensive data augmentation to learn from diverse rotated versions of a given spatial configuration. Unwrapping the image into its polar coordinates provides a more explicit representation to train a convolutional architecture as the rotational invariance becomes translational, hence the visually distinct but otherwise equivalent rotated versions of a given scene can be learnt from a single image. We show with two common vision-based solar irradiance forecasting challenges (i.e. using ground-taken sky images or satellite images), that this preprocessing step significantly improves prediction results by standardising the scene representation, while decreasing training time by a factor of 4 compared to augmenting data with rotations. In addition, this transformation magnifies the area surrounding the centre of the rotation, leading to more accurate short-term irradiance predictions. ",
    "url": "https://arxiv.org/abs/2111.14507",
    "authors": [
      "Quentin Paletta",
      "Anthony Hu",
      "Guillaume Arbod",
      "Philippe Blanc",
      "Joan Lasenby"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.13785",
    "title": "OmiTrans: generative adversarial networks based omics-to-omics  translation framework",
    "abstract": "With the rapid development of high-throughput experimental technologies, different types of omics (e.g., genomics, epigenomics, transcriptomics, proteomics, and metabolomics) data can be produced from clinical samples. The correlations between different omics types attracts a lot of research interest, whereas the stduy on genome-wide omcis data translation (i.e, generation and prediction of one type of omics data from another type of omics data) is almost blank. Generative adversarial networks and the variants are one of the most state-of-the-art deep learning technologies, which have shown great success in image-to-image translation, text-to-image translation, etc. Here we proposed OmiTrans, a deep learning framework adopted the idea of generative adversarial networks to achieve omics-to-omics translation with promising results. OmiTrans was able to faithfully reconstruct gene expression profiles from DNA methylation data with high accuracy and great model generalisation, as demonstrated in the experiments. ",
    "url": "https://arxiv.org/abs/2111.13785",
    "authors": [
      "Xiaoyu Zhang",
      "Yike Guo"
    ],
    "subjectives": [
      "Genomics (q-bio.GN)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2111.13919",
    "title": "More relations between $λ$-labeling and Hamiltonian paths with  emphasis on line graph of bipartite multigraphs",
    "abstract": "This paper deals with the $\\lambda$-labeling and $L(2,1)$-coloring of simple graphs. A $\\lambda$-labeling of a graph $G$ is any labeling of the vertices of $G$ with different labels such that any two adjacent vertices receive labels which differ at least two. Also an $L(2,1)$-coloring of $G$ is any labeling of the vertices of $G$ such that any two adjacent vertices receive labels which differ at least two and any two vertices with distance two receive distinct labels. Assume that a partial $\\lambda$-labeling $f$ is given in a graph $G$. A general question is whether $f$ can be extended to a $\\lambda$-labeling of $G$. We show that the extension is feasible if and only if a Hamiltonian path consistent with some distance constraints exists in the complement of $G$. Then we consider line graph of bipartite multigraphs and determine the minimum number of labels in $L(2,1)$-coloring and $\\lambda$-labeling of these graphs. In fact we obtain easily computable formulas for the path covering number and the maximum path of the complement of these graphs. We obtain a polynomial time algorithm which generates all Hamiltonian paths in the related graphs. A special case is the Cartesian product graph $K_n\\Box K_n$ and the generation of $\\lambda$-squares. ",
    "url": "https://arxiv.org/abs/2111.13919",
    "authors": [
      "Manouchehr Zaker"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2111.14071",
    "title": "Distributionally robust possibilistic optimization problems",
    "abstract": "In this paper a class of optimization problems with uncertain linear constraints is discussed. It is assumed that the constraint coefficients are random vectors whose probability distributions are only partially known. Possibility theory is used to model the imprecise probabilities. In one of the interpretations, a possibility distribution (a membership function of a fuzzy set) in the set of coefficient realizations induces a necessity measure, which in turn defines a family of probability distributions in this set. The distributionally robust approach is then used to transform the imprecise constraints into deterministic counterparts. Namely, the uncertain left-had side of each constraint is replaced with the expected value with respect to the worst probability distribution that can occur. It is shown how to represent the resulting problem by using linear or second order cone constraints. This leads to problems which are computationally tractable for a wide class of optimization models, in particular for linear programming. ",
    "url": "https://arxiv.org/abs/2111.14071",
    "authors": [
      "Romain Guillaume",
      "Adam Kasperski",
      "Pawel Zielinski"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2111.14522",
    "title": "Understanding over-squashing and bottlenecks on graphs via curvature",
    "abstract": "Most graph neural networks (GNNs) use the message passing paradigm, in which node features are propagated on the input graph. Recent works pointed to the distortion of information flowing from distant nodes as a factor limiting the efficiency of message passing for tasks relying on long-distance interactions. This phenomenon, referred to as 'over-squashing', has been heuristically attributed to graph bottlenecks where the number of $k$-hop neighbors grows rapidly with $k$. We provide a precise description of the over-squashing phenomenon in GNNs and analyze how it arises from bottlenecks in the graph. For this purpose, we introduce a new edge-based combinatorial curvature and prove that negatively curved edges are responsible for the over-squashing issue. We also propose and experimentally test a curvature-based graph rewiring method to alleviate the over-squashing. ",
    "url": "https://arxiv.org/abs/2111.14522",
    "authors": [
      "Jake Topping",
      "Francesco Di Giovanni",
      "Benjamin Paul Chamberlain",
      "Xiaowen Dong",
      "Michael M. Bronstein"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1711.07271",
    "title": "Positive semi-definite embedding for dimensionality reduction and  out-of-sample extensions",
    "abstract": " Comments: 26 pages, 8 figures. Additional results for the kernelized problem and more numerical simulations ",
    "url": "https://arxiv.org/abs/1711.07271",
    "authors": [
      "Michaël Fanuel",
      "Antoine Aspeel",
      "Jean-Charles Delvenne",
      "Johan A.K. Suykens"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:1908.06656",
    "title": "On the edge-biclique graph and the iterated edge-biclique operator",
    "abstract": " Title: On the edge-biclique graph and the iterated edge-biclique operator ",
    "url": "https://arxiv.org/abs/1908.06656",
    "authors": [
      "Leandro Montero",
      "Sylvain Legay"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2010.10421",
    "title": "Distributed ADMM over directed networks",
    "abstract": " Title: Distributed ADMM over directed networks ",
    "url": "https://arxiv.org/abs/2010.10421",
    "authors": [
      "Kiran Rokade",
      "Rachel Kalpana Kalaimani"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2101.00870",
    "title": "Lightweight representation learning for efficient and scalable  recommendation",
    "abstract": " Comments: 12 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2101.00870",
    "authors": [
      "Olivier Koch",
      "Amine Benhalloum",
      "Guillaume Genthial",
      "Denis Kuzin",
      "Dmitry Parfenchik"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2104.01575",
    "title": "Reliably fast adversarial training via latent adversarial perturbation",
    "abstract": " Comments: ICCV 2021 (Oral) ",
    "url": "https://arxiv.org/abs/2104.01575",
    "authors": [
      "Geon Yeong Park",
      "Sang Wan Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.03480",
    "title": "A semigroup method for high dimensional elliptic PDEs and eigenvalue  problems based on neural networks",
    "abstract": " Comments: 17 pages, 18 figures; v2: revised version submitted to Journal of Computational Physics ",
    "url": "https://arxiv.org/abs/2105.03480",
    "authors": [
      "Haoya Li",
      "Lexing Ying"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.12247",
    "title": "GraphVICRegHSIC: Towards improved self-supervised representation  learning for graphs with a hyrbid loss function",
    "abstract": " Comments: Paper Accepted in the Weakly Supervised Representation Learning Workshop, IJCAI 2021 (IJCAI2021-WSRL) ",
    "url": "https://arxiv.org/abs/2105.12247",
    "authors": [
      "Sayan Nag"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computational Geometry (cs.CG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.00090",
    "title": "Mesh-based graph convolutional neural networks for modeling materials  with microstructure",
    "abstract": " Comments: 45 pages, 19 figures ",
    "url": "https://arxiv.org/abs/2107.00090",
    "authors": [
      "Ari Frankel",
      "Cosmin Safta",
      "Coleman Alleman",
      "Reese Jones"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.05830",
    "title": "Spatio-temporal evolution of resistance state in simulated memristive  networks",
    "abstract": " Comments: Supplementary information comprises animated sequences of resistive maps corresponding to the internal state of each unit within the array both for the cycling experiment (Fig. 2 of the main text) and the sensitization one (Fig. 3 of the main) and is available upon request ",
    "url": "https://arxiv.org/abs/2108.05830",
    "authors": [
      "Fabrizio Di Francesco",
      "Gabriel A. Sanca",
      "Cynthia P. Quinteros"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2109.10582",
    "title": "Partial sensitivity analysis in differential privacy",
    "abstract": " Title: Partial sensitivity analysis in differential privacy ",
    "url": "https://arxiv.org/abs/2109.10582",
    "authors": [
      "Tamara T. Mueller",
      "Alexander Ziller",
      "Dmitrii Usynin",
      "Moritz Knolle",
      "Friederike Jungmann",
      "Daniel Rueckert",
      "Georgios Kaissis"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.02014",
    "title": "Neural network is heterogeneous: Phase matters more",
    "abstract": " Title: Neural network is heterogeneous: Phase matters more ",
    "url": "https://arxiv.org/abs/2111.02014",
    "authors": [
      "Yuqi Nie",
      "Hui Yuan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.02212",
    "title": "A swarm intelligence-based robust solution for Virtual Reference  Feedback Tuning",
    "abstract": " Comments: 33 pages, 8 figures, journal ",
    "url": "https://arxiv.org/abs/2111.02212",
    "authors": [
      "L. V. Fiorio",
      "C. L. Remes",
      "Y. R. de Novaes"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2111.02823",
    "title": "Convolutional generative adversarial imputation networks for  spatio-temporal missing data in storm surge simulations",
    "abstract": " Title: Convolutional generative adversarial imputation networks for  spatio-temporal missing data in storm surge simulations ",
    "url": "https://arxiv.org/abs/2111.02823",
    "authors": [
      "Ehsan Adeli",
      "Jize Zhang",
      "Alexandros A. Taflanidis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2111.04684",
    "title": "Physics-informed neural networks for understanding shear migration of  particles in viscous flow",
    "abstract": " Comments: 19 pages, 9 figures; v2: minor updates & provided data accessibility statement ",
    "url": "https://arxiv.org/abs/2111.04684",
    "authors": [
      "Daihui Lu",
      "Ivan C. Christov"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2111.07613",
    "title": "Generate plane quad mesh with neural networks and tree search",
    "abstract": " Comments: Supervisor: Yong Ni; Field: AI for Engineer Design, Deep Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2111.07613",
    "authors": [
      "Hua Tong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2111.10743",
    "title": "FMM-accelerated solvers for the Laplace-Beltrami problem on complex  surfaces in three dimensions",
    "abstract": " Comments: 18 pages, 5 tables, 3 figures ",
    "url": "https://arxiv.org/abs/2111.10743",
    "authors": [
      "Dhwanit Agarwal",
      "Michael O'Neil",
      "Manas Rachh"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2111.11949",
    "title": "Consensus formation on heterogeneous networks",
    "abstract": " Comments: 7 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2111.11949",
    "authors": [
      "Edoardo Fadda",
      "Junda He",
      "Claudio Tessone",
      "Paolo Barucca"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  }
]