[
  {
    "id": "arXiv:2306.14903",
    "title": "Detect Depression from Social Networks with Sentiment Knowledge Sharing",
    "abstract": "Social network plays an important role in propagating people's viewpoints, emotions, thoughts, and fears. Notably, following lockdown periods during the COVID-19 pandemic, the issue of depression has garnered increasing attention, with a significant portion of individuals resorting to social networks as an outlet for expressing emotions. Using deep learning techniques to discern potential signs of depression from social network messages facilitates the early identification of mental health conditions. Current efforts in detecting depression through social networks typically rely solely on analyzing the textual content, overlooking other potential information. In this work, we conduct a thorough investigation that unveils a strong correlation between depression and negative emotional states. The integration of such associations as external knowledge can provide valuable insights for detecting depression. Accordingly, we propose a multi-task training framework, DeSK, which utilizes shared sentiment knowledge to enhance the efficacy of depression detection. Experiments conducted on both Chinese and English datasets demonstrate the cross-lingual effectiveness of DeSK. ",
    "url": "https://arxiv.org/abs/2306.14903",
    "authors": [
      "Yan Shi",
      "Yao Tian",
      "Chengwei Tong",
      "Chunyan Zhu",
      "Qianqian Li",
      "Mengzhu Zhang",
      "Wei Zhao",
      "Yong Liao",
      "Pengyuan Zhou"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2306.14920",
    "title": "A Cosine Similarity-based Method for Out-of-Distribution Detection",
    "abstract": "The ability to detect OOD data is a crucial aspect of practical machine learning applications. In this work, we show that cosine similarity between the test feature and the typical ID feature is a good indicator of OOD data. We propose Class Typical Matching (CTM), a post hoc OOD detection algorithm that uses a cosine similarity scoring function. Extensive experiments on multiple benchmarks show that CTM outperforms existing post hoc OOD detection methods. ",
    "url": "https://arxiv.org/abs/2306.14920",
    "authors": [
      "Nguyen Ngoc-Hieu",
      "Nguyen Hung-Quang",
      "The-Anh Ta",
      "Thanh Nguyen-Tang",
      "Khoa D Doan",
      "Hoang Thanh-Tung"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.14933",
    "title": "Integrating Bidirectional Long Short-Term Memory with Subword Embedding  for Authorship Attribution",
    "abstract": "The problem of unveiling the author of a given text document from multiple candidate authors is called authorship attribution. Manifold word-based stylistic markers have been successfully used in deep learning methods to deal with the intrinsic problem of authorship attribution. Unfortunately, the performance of word-based authorship attribution systems is limited by the vocabulary of the training corpus. Literature has recommended character-based stylistic markers as an alternative to overcome the hidden word problem. However, character-based methods often fail to capture the sequential relationship of words in texts which is a chasm for further improvement. The question addressed in this paper is whether it is possible to address the ambiguity of hidden words in text documents while preserving the sequential context of words. Consequently, a method based on bidirectional long short-term memory (BLSTM) with a 2-dimensional convolutional neural network (CNN) is proposed to capture sequential writing styles for authorship attribution. The BLSTM was used to obtain the sequential relationship among characteristics using subword information. The 2-dimensional CNN was applied to understand the local syntactical position of the style from unlabeled input text. The proposed method was experimentally evaluated against numerous state-of-the-art methods across the public corporal of CCAT50, IMDb62, Blog50, and Twitter50. Experimental results indicate accuracy improvement of 1.07\\%, and 0.96\\% on CCAT50 and Twitter, respectively, and produce comparable results on the remaining datasets. ",
    "url": "https://arxiv.org/abs/2306.14933",
    "authors": [
      "Abiodun Modupe",
      "Turgay Celik",
      "Vukosi Marivate",
      "Oludayo O. Olugbara"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.14939",
    "title": "The Art of Embedding Fusion: Optimizing Hate Speech Detection",
    "abstract": "Hate speech detection is a challenging natural language processing task that requires capturing linguistic and contextual nuances. Pre-trained language models (PLMs) offer rich semantic representations of text that can improve this task. However there is still limited knowledge about ways to effectively combine representations across PLMs and leverage their complementary strengths. In this work, we shed light on various combination techniques for several PLMs and comprehensively analyze their effectiveness. Our findings show that combining embeddings leads to slight improvements but at a high computational cost and the choice of combination has marginal effect on the final outcome. We also make our codebase public at https://github.com/aflah02/The-Art-of-Embedding-Fusion-Optimizing-Hate-Speech-Detection . ",
    "url": "https://arxiv.org/abs/2306.14939",
    "authors": [
      "Mohammad Aflah Khan",
      "Neemesh Yadav",
      "Mohit Jain",
      "Sanyam Goyal"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.14975",
    "title": "The Underlying Scaling Laws and Universal Statistical Structure of  Complex Datasets",
    "abstract": "We study universal traits which emerge both in real-world complex datasets, as well as in artificially generated ones. Our approach is to analogize data to a physical system and employ tools from statistical physics and Random Matrix Theory (RMT) to reveal their underlying structure. We focus on the feature-feature covariance matrix, analyzing both its local and global eigenvalue statistics. Our main observations are: (i) The power-law scalings that the bulk of its eigenvalues exhibit are vastly different for uncorrelated random data compared to real-world data, (ii) this scaling behavior can be completely recovered by introducing long range correlations in a simple way to the synthetic data, (iii) both generated and real-world datasets lie in the same universality class from the RMT perspective, as chaotic rather than integrable systems, (iv) the expected RMT statistical behavior already manifests for empirical covariance matrices at dataset sizes significantly smaller than those conventionally used for real-world training, and can be related to the number of samples required to approximate the population power-law scaling behavior, (v) the Shannon entropy is correlated with local RMT structure and eigenvalues scaling, and substantially smaller in strongly correlated datasets compared to uncorrelated synthetic data, and requires fewer samples to reach the distribution entropy. These findings can have numerous implications to the characterization of the complexity of data sets, including differentiating synthetically generated from natural data, quantifying noise, developing better data pruning methods and classifying effective learning models utilizing these scaling laws. ",
    "url": "https://arxiv.org/abs/2306.14975",
    "authors": [
      "Noam Levi",
      "Yaron Oz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "High Energy Physics - Theory (hep-th)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2306.15015",
    "title": "Scaling and Resizing Symmetry in Feedforward Networks",
    "abstract": "Weights initialization in deep neural networks have a strong impact on the speed of converge of the learning map. Recent studies have shown that in the case of random initializations, a chaos/order phase transition occur in the space of variances of random weights and biases. Experiments then had shown that large improvements can be made, in terms of the training speed, if a neural network is initialized on values along the critical line of such phase transition. In this contribution, we show evidence that the scaling property exhibited by physical systems at criticality, is also present in untrained feedforward networks with random weights initialization at the critical line. Additionally, we suggest an additional data-resizing symmetry, which is directly inherited from the scaling symmetry at criticality. ",
    "url": "https://arxiv.org/abs/2306.15015",
    "authors": [
      "Carlos Cardona"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)"
    ]
  },
  {
    "id": "arXiv:2306.15022",
    "title": "Asymmetry of social interactions and its role in link predictability:  the case of coauthorship networks",
    "abstract": "The paper provides important insights into understanding the factors that influence tie strength in social networks. Using local network measures that take into account asymmetry of social interactions we show that the observed tie strength is a kind of compromise, which depends on the relative strength of the tie as seen from its both ends. This statement is supported by the Granovetter-like, strongly positive weight-topology correlations, in the form of a power-law relationship between the asymmetric tie strength and asymmetric neighbourhood overlap, observed in three different real coauthorship networks and in a synthetic model of scientific collaboration. This observation is juxtaposed against the current misconception that coauthorship networks, being the proxy of scientific collaboration networks, contradict the Granovetter's strength of weak ties hypothesis, and the reasons for this misconception are explained. Finally, by testing various link similarity scores, it is shown that taking into account the asymmetry of social ties can remarkably increase the efficiency of link prediction methods. The perspective outlined also allows us to comment on the surprisingly high performance of the resource allocation index -- one of the most recognizable and effective local similarity scores -- which can be rationalized by the strong triadic closure property, assuming that the property takes into account the asymmetry of social ties. ",
    "url": "https://arxiv.org/abs/2306.15022",
    "authors": [
      "Kamil P. Orzechowski",
      "Maciej J. Mrowinski",
      "Agata Fronczak",
      "Piotr Fronczak"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2306.15024",
    "title": "ethp2psim: Evaluating and deploying privacy-enhanced peer-to-peer  routing protocols for the Ethereum network",
    "abstract": "Network-level privacy is the Achilles heel of financial privacy in cryptocurrencies. Financial privacy amounts to achieving and maintaining blockchain- and network-level privacy. Blockchain-level privacy recently received substantial attention. Specifically, several privacy-enhancing technologies were proposed and deployed to enhance blockchain-level privacy. On the other hand, network-level privacy, i.e., privacy on the peer-to-peer layer, has seen far less attention and development. In this work, we aim to provide a peer-to-peer network simulator, ethp2psim, that allows researchers to evaluate the privacy guarantees of privacy-enhanced broadcast and message routing algorithms. Our goal is two-fold. First, we want to enable researchers to implement their proposed protocols in our modular simulator framework. Second, our simulator allows researchers to evaluate the privacy guarantees of privacy-enhanced routing algorithms. Finally, ethp2psim can help choose the right protocol parameters for efficient, robust, and private deployment. ",
    "url": "https://arxiv.org/abs/2306.15024",
    "authors": [
      "Ferenc Béres",
      "István András Seres",
      "Domokos M. Kelen",
      "András A. Benczúr"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2306.15035",
    "title": "Optimized Vectorizing of Building Structures with Swap: High-Efficiency  Convolutional Channel-Swap Hybridization Strategy",
    "abstract": "The building planar graph reconstruction, a.k.a. footprint reconstruction, which lies in the domain of computer vision and geoinformatics, has been long afflicted with the challenge of redundant parameters in conventional convolutional models. Therefore, in this paper, we proposed an advanced and adaptive shift architecture, namely the Swap operation, which incorporates non-exponential growth parameters while retaining analogous functionalities to integrate local feature spatial information, resembling a high-dimensional convolution operator. The Swap, cross-channel operation, architecture implements the XOR operation to alternately exchange adjacent or diagonal features, and then blends alternating channels through a 1x1 convolution operation to consolidate information from different channels. The SwapNN architecture, on the other hand, incorporates a group-based parameter-sharing mechanism inspired by the convolutional neural network process and thereby significantly reducing the number of parameters. We validated our proposed approach through experiments on the SpaceNet corpus, a publicly available dataset annotated with 2,001 buildings across the cities of Los Angeles, Las Vegas, and Paris. Our results demonstrate the effectiveness of this innovative architecture in building planar graph reconstruction from 2D building images. ",
    "url": "https://arxiv.org/abs/2306.15035",
    "authors": [
      "Moule Lin",
      "Weipeng Jing",
      "Chao Li",
      "András Jung"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.15058",
    "title": "BatchGFN: Generative Flow Networks for Batch Active Learning",
    "abstract": "We introduce BatchGFN -- a novel approach for pool-based active learning that uses generative flow networks to sample sets of data points proportional to a batch reward. With an appropriate reward function to quantify the utility of acquiring a batch, such as the joint mutual information between the batch and the model parameters, BatchGFN is able to construct highly informative batches for active learning in a principled way. We show our approach enables sampling near-optimal utility batches at inference time with a single forward pass per point in the batch in toy regression problems. This alleviates the computational complexity of batch-aware algorithms and removes the need for greedy approximations to find maximizers for the batch reward. We also present early results for amortizing training across acquisition steps, which will enable scaling to real-world tasks. ",
    "url": "https://arxiv.org/abs/2306.15058",
    "authors": [
      "Shreshth A. Malik",
      "Salem Lahlou",
      "Andrew Jesson",
      "Moksh Jain",
      "Nikolay Malkin",
      "Tristan Deleu",
      "Yoshua Bengio",
      "Yarin Gal"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2306.15072",
    "title": "A Firewall Optimization for Threat-Resilient Micro-Segmentation in Power  System Networks",
    "abstract": "Electric power delivery relies on a communications backbone that must be secure. SCADA systems are essential to critical grid functions and include industrial control systems (ICS) protocols such as the Distributed Network Protocol-3 (DNP3). These protocols are vulnerable to cyber threats that power systems, as cyber-physical critical infrastructure, must be protected against. For this reason, the NERC Critical Infrastructure Protection standard CIP-005-5 specifies that an electronic system perimeter is needed, accomplished with firewalls. This paper presents how these electronic system perimeters can be optimally found and generated using a proposed meta-heuristic approach for optimal security zone formation for large-scale power systems. Then, to implement the optimal firewall rules in a large scale power system model, this work presents a prototype software tool that takes the optimization results and auto-configures the firewall nodes for different utilities in a cyber-physical testbed. Using this tool, firewall policies are configured for all the utilities and their substations within a synthetic 2000-bus model, assuming two different network topologies. Results generate the optimal electronic security perimeters to protect a power system's data flows and compare the number of firewalls, monetary cost, and risk alerts from path analysis. ",
    "url": "https://arxiv.org/abs/2306.15072",
    "authors": [
      "Abhijeet Sahu",
      "Patrick Wlazlo",
      "Nastassja Gaudet",
      "Ana Goulart",
      "Edmond Rogers",
      "Katherine Davis"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2306.15092",
    "title": "Heterogeneous ALU Architecture -- Power Aware System",
    "abstract": "The advent of heterogeneous multi-core architectures brought with it huge benefits to energy efficiency by running programs on properly-sized cores. Modern heterogeneous multi-core systems as suggested by Artjom et al. schedule tasks to different cores based on governors that may optimize a task for energy use or performance. This provides benefits to the system as a whole in reducing energy costs where possible, but also not compromising on performance for timing-critical applications. In the era of dark silicon, energy optimization is increasingly important, and many architectures have arisen that seek to optimize processors to specific tasks, often at the cost of generality. We propose that we can still achieve energy-saving and potentially performance-improving benefits while not affecting a system's generality at all, by achieving heterogeneity at the level of Arithmetic logic unit (ALUs). Much like a heterogeneous multi-core system achieves benefits from its heterogeneity and efficient scheduling, a heterogeneous ALU system can achieve similar benefits by routing ALU operations to properly sized ALUs. Additionally much like there are scheduling modes for the governors of heterogeneous multi-core processors, we propose that energy-constrained modes can be effective in a heterogeneous ALU system with the routing of operations to smaller ALUs for immense energy savings. We examine the energy and performance characteristics of scaling ripple carry adders and evaluate the total energy and performance benefits of such a system when running applications. With our proposed controls, input operand size-based and energy constraint-based, we could potentially emulate the success of heterogeneous processor task scheduling at a finer-grained level. This paper presents our evaluation of the potential of heterogeneous ALU processors. ",
    "url": "https://arxiv.org/abs/2306.15092",
    "authors": [
      "Alok Anand",
      "Ivan Khokhlov",
      "Abhishek Anand"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2306.15106",
    "title": "Improvise, Adapt, Overcome: Dynamic Resiliency Against Unknown Attack  Vectors in Microgrid Cybersecurity Games",
    "abstract": "Cyber-physical microgrids are vulnerable to rootkit attacks that manipulate system dynamics to create instabilities in the network. Rootkits tend to hide their access level within microgrid system components to launch sudden attacks that prey on the slow response time of defenders to manipulate system trajectory. This problem can be formulated as a multi-stage, non-cooperative, zero-sum game with the attacker and the defender modeled as opposing players. To solve the game, this paper proposes a deep reinforcement learning-based strategy that dynamically identifies rootkit access levels and isolates incoming manipulations by incorporating changes in the defense plan. A major advantage of the proposed strategy is its ability to establish resiliency without altering the physical transmission/distribution network topology, thereby diminishing potential instability issues. The paper also presents several simulation results and case studies to demonstrate the operating mechanism and robustness of the proposed strategy. ",
    "url": "https://arxiv.org/abs/2306.15106",
    "authors": [
      "Suman Rath",
      "Tapadhir Das",
      "Shamik Sengupta"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2306.15114",
    "title": "Transfer: Cross Modality Knowledge Transfer using Adversarial Networks  -- A Study on Gesture Recognition",
    "abstract": "Knowledge transfer across sensing technology is a novel concept that has been recently explored in many application domains, including gesture-based human computer interaction. The main aim is to gather semantic or data driven information from a source technology to classify / recognize instances of unseen classes in the target technology. The primary challenge is the significant difference in dimensionality and distribution of feature sets between the source and the target technologies. In this paper, we propose TRANSFER, a generic framework for knowledge transfer between a source and a target technology. TRANSFER uses a language-based representation of a hand gesture, which captures a temporal combination of concepts such as handshape, location, and movement that are semantically related to the meaning of a word. By utilizing a pre-specified syntactic structure and tokenizer, TRANSFER segments a hand gesture into tokens and identifies individual components using a token recognizer. The tokenizer in this language-based recognition system abstracts the low-level technology-specific characteristics to the machine interface, enabling the design of a discriminator that learns technology-invariant features essential for recognition of gestures in both source and target technologies. We demonstrate the usage of TRANSFER for three different scenarios: a) transferring knowledge across technology by learning gesture models from video and recognizing gestures using WiFi, b) transferring knowledge from video to accelerometer, and d) transferring knowledge from accelerometer to WiFi signals. ",
    "url": "https://arxiv.org/abs/2306.15114",
    "authors": [
      "Payal Kamboj",
      "Ayan Banerjee",
      "Sandeep K.S. Gupta"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.15117",
    "title": "Continual Learning for Out-of-Distribution Pedestrian Detection",
    "abstract": "A continual learning solution is proposed to address the out-of-distribution generalization problem for pedestrian detection. While recent pedestrian detection models have achieved impressive performance on various datasets, they remain sensitive to shifts in the distribution of the inference data. Our method adopts and modifies Elastic Weight Consolidation to a backbone object detection network, in order to penalize the changes in the model weights based on their importance towards the initially learned task. We show that when trained with one dataset and fine-tuned on another, our solution learns the new distribution and maintains its performance on the previous one, avoiding catastrophic forgetting. We use two popular datasets, CrowdHuman and CityPersons for our cross-dataset experiments, and show considerable improvements over standard fine-tuning, with a 9% and 18% miss rate percent reduction improvement in the CrowdHuman and CityPersons datasets, respectively. ",
    "url": "https://arxiv.org/abs/2306.15117",
    "authors": [
      "Mahdiyar Molahasani",
      "Ali Etemad",
      "Michael Greenspan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15136",
    "title": "What Truly Matters in Trajectory Prediction for Autonomous Driving?",
    "abstract": "In the autonomous driving system, trajectory prediction plays a vital role in ensuring safety and facilitating smooth navigation. However, we observe a substantial discrepancy between the accuracy of predictors on fixed datasets and their driving performance when used in downstream tasks. This discrepancy arises from two overlooked factors in the current evaluation protocols of trajectory prediction: 1) the dynamics gap between the dataset and real driving scenario; and 2) the computational efficiency of predictors. In real-world scenarios, prediction algorithms influence the behavior of autonomous vehicles, which, in turn, alter the behaviors of other agents on the road. This interaction results in predictor-specific dynamics that directly impact prediction results. As other agents' responses are predetermined on datasets, a significant dynamics gap arises between evaluations conducted on fixed datasets and actual driving scenarios. Furthermore, focusing solely on accuracy fails to address the demand for computational efficiency, which is critical for the real-time response required by the autonomous driving system. Therefore, in this paper, we demonstrate that an interactive, task-driven evaluation approach for trajectory prediction is crucial to reflect its efficacy for autonomous driving. ",
    "url": "https://arxiv.org/abs/2306.15136",
    "authors": [
      "Haoran Wu",
      "Tran Phong",
      "Cunjun Yu",
      "Panpan Cai",
      "Sifa Zheng",
      "David Hsu"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15138",
    "title": "A Restarted Large-Scale Spectral Clustering with Self-Guiding and Block  Diagonal Representation",
    "abstract": "Spectral clustering is one of the most popular unsupervised machine learning methods. Constructing similarity matrix is crucial to this type of method. In most existing works, the similarity matrix is computed once for all or is updated alternatively. However, the former is difficult to reflect comprehensive relationships among data points, and the latter is time-consuming and is even infeasible for large-scale problems. In this work, we propose a restarted clustering framework with self-guiding and block diagonal representation. An advantage of the strategy is that some useful clustering information obtained from previous cycles could be preserved as much as possible. To the best of our knowledge, this is the first work that applies restarting strategy to spectral clustering. The key difference is that we reclassify the samples in each cycle of our method, while they are classified only once in existing methods. To further release the overhead, we introduce a block diagonal representation with Nystr\\\"{o}m approximation for constructing the similarity matrix. Theoretical results are established to show the rationality of inexact computations in spectral clustering. Comprehensive experiments are performed on some benchmark databases, which show the superiority of our proposed algorithms over many state-of-the-art algorithms for large-scale problems. Specifically, our framework has a potential boost for clustering algorithms and works well even using an initial guess chosen randomly. ",
    "url": "https://arxiv.org/abs/2306.15138",
    "authors": [
      "Yongyan Guo",
      "Gang Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2306.15142",
    "title": "Efficient and Accurate Scene Text Detection with Low-Rank Approximation  Network",
    "abstract": "Recently, regression-based methods, which predict parameter curves for localizing texts, are popular in scene text detection. However, these methods struggle to balance concise structure and fast post-processing, and the existing parameter curves are still not ideal for modeling arbitrary-shaped texts, leading to a challenge in balancing speed and accuracy. To tackle these challenges, we firstly propose a dual matching scheme for positive samples, which accelerates inference speed through sparse matching scheme and accelerates model convergence through dense matching scheme. Then, we propose a novel text contour representation method based on low-rank approximation by exploiting the shape correlation between different text contours, which is complete, compact, simplicity and robustness. Based on these designs, we implement an efficient and accurate arbitrary-shaped text detector, named LRANet. Extensive experiments are conducted on three challenging datasets, which demonstrate the accuracy and efficiency of our LRANet over state-of-the-art methods. The code will be released soon. ",
    "url": "https://arxiv.org/abs/2306.15142",
    "authors": [
      "Yuchen Su"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.15155",
    "title": "Input-sensitive dense-sparse primitive compositions for GNN acceleration",
    "abstract": "Graph neural networks (GNN) have become an important class of neural network models that have gained popularity in domains such as social and financial network analysis. Different phases of GNN computations can be modeled using both dense and sparse matrix operations. There have been many frameworks and optimization techniques proposed in the literature to accelerate GNNs. However, getting consistently high performance across many input graphs with different sparsity patterns and GNN embedding sizes has remained difficult. In this paper, we propose different algebraic reassociations of GNN computations that lead to novel dense and sparse matrix primitive selections and compositions. We show that the profitability of these compositions depends on the input graph, embedding size, and the target hardware. We developed SENSEi, a system that uses a data-driven adaptive strategy to select the best composition given the input graph and GNN embedding sizes. Our evaluations on a wide range of graphs and embedding sizes show that SENSEi achieves geomean speedups of $1.105\\times$ (up to $2.959\\times$) and $1.187\\times$ (up to $1.99\\times$) on graph convolutional networks and geomean speedups of $2.307\\times$ (up to $35.866\\times$) and $1.44\\times$ (up to $5.69\\times$) on graph attention networks on CPUs and GPUs respectively over the widely used Deep Graph Library. Further, we show that the compositions yield notable synergistic performance benefits on top of other established sparse optimizations such as sparse matrix tiling by evaluating against a well-tuned baseline. ",
    "url": "https://arxiv.org/abs/2306.15155",
    "authors": [
      "Damitha Lenadora",
      "Vimarsh Sathia",
      "Gerasimos Gerogiannis",
      "Serif Yesil",
      "Josep Torrellas",
      "Charith Mendis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2306.15157",
    "title": "Revisiting Tropical Polynomial Division: Theory, Algorithms and  Application to Neural Networks",
    "abstract": "Tropical geometry has recently found several applications in the analysis of neural networks with piecewise linear activation functions. This paper presents a new look at the problem of tropical polynomial division and its application to the simplification of neural networks. We analyze tropical polynomials with real coefficients, extending earlier ideas and methods developed for polynomials with integer coefficients. We first prove the existence of a unique quotient-remainder pair and characterize the quotient in terms of the convex bi-conjugate of a related function. Interestingly, the quotient of tropical polynomials with integer coefficients does not necessarily have integer coefficients. Furthermore, we develop a relationship of tropical polynomial division with the computation of the convex hull of unions of convex polyhedra and use it to derive an exact algorithm for tropical polynomial division. An approximate algorithm is also presented, based on an alternation between data partition and linear programming. We also develop special techniques to divide composite polynomials, described as sums or maxima of simpler ones. Finally, we present some numerical results to illustrate the efficiency of the algorithms proposed, using the MNIST handwritten digit and CIFAR-10 datasets. ",
    "url": "https://arxiv.org/abs/2306.15157",
    "authors": [
      "Ioannis Kordonis",
      "Petros Maragos"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2306.15164",
    "title": "DSRM: Boost Textual Adversarial Training with Distribution Shift Risk  Minimization",
    "abstract": "Adversarial training is one of the best-performing methods in improving the robustness of deep language models. However, robust models come at the cost of high time consumption, as they require multi-step gradient ascents or word substitutions to obtain adversarial samples. In addition, these generated samples are deficient in grammatical quality and semantic consistency, which impairs the effectiveness of adversarial training. To address these problems, we introduce a novel, effective procedure for instead adversarial training with only clean data. Our procedure, distribution shift risk minimization (DSRM), estimates the adversarial loss by perturbing the input data's probability distribution rather than their embeddings. This formulation results in a robust model that minimizes the expected global loss under adversarial attacks. Our approach requires zero adversarial samples for training and reduces time consumption by up to 70\\% compared to current best-performing adversarial training methods. Experiments demonstrate that DSRM considerably improves BERT's resistance to textual adversarial attacks and achieves state-of-the-art robust accuracy on various benchmarks. ",
    "url": "https://arxiv.org/abs/2306.15164",
    "authors": [
      "Songyang Gao",
      "Shihan Dou",
      "Yan Liu",
      "Xiao Wang",
      "Qi Zhang",
      "Zhongyu Wei",
      "Jin Ma",
      "Ying Shan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15167",
    "title": "An Efficient Global Algorithm for One-Bit Maximum-Likelihood MIMO  Detection",
    "abstract": "There has been growing interest in implementing massive MIMO systems by one-bit analog-to-digital converters (ADCs), which have the benefit of reducing the power consumption and hardware complexity. One-bit MIMO detection arises in such a scenario. It aims to detect the multiuser signals from the one-bit quantized received signals in an uplink channel. In this paper, we consider one-bit maximum-likelihood (ML) MIMO detection in massive MIMO systems, which amounts to solving a large-scale nonlinear integer programming problem. We propose an efficient global algorithm for solving the one-bit ML MIMO detection problem. We first reformulate the problem as a mixed integer linear programming (MILP) problem that has a massive number of linear constraints. The massive number of linear constraints raises computational challenges. To solve the MILP problem efficiently, we custom build a light-weight branch-and-bound tree search algorithm, where the linear constraints are incrementally added during the tree search procedure and only small-size linear programming subproblems need to be solved at each iteration. We provide simulation results to demonstrate the efficiency of the proposed method. ",
    "url": "https://arxiv.org/abs/2306.15167",
    "authors": [
      "Cheng-Yang Yu",
      "Mingjie Shao",
      "Wei-Kun Chen",
      "Ya-Feng Liu",
      "Wing-Kin Ma"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2306.15169",
    "title": "Exploiting Inferential Structure in Neural Processes",
    "abstract": "Neural Processes (NPs) are appealing due to their ability to perform fast adaptation based on a context set. This set is encoded by a latent variable, which is often assumed to follow a simple distribution. However, in real-word settings, the context set may be drawn from richer distributions having multiple modes, heavy tails, etc. In this work, we provide a framework that allows NPs' latent variable to be given a rich prior defined by a graphical model. These distributional assumptions directly translate into an appropriate aggregation strategy for the context set. Moreover, we describe a message-passing procedure that still allows for end-to-end optimization with stochastic gradients. We demonstrate the generality of our framework by using mixture and Student-t assumptions that yield improvements in function modelling and test-time robustness. ",
    "url": "https://arxiv.org/abs/2306.15169",
    "authors": [
      "Dharmesh Tailor",
      "Mohammad Emtiyaz Khan",
      "Eric Nalisnick"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2306.15172",
    "title": "Delving into Crispness: Guided Label Refinement for Crisp Edge Detection",
    "abstract": "Learning-based edge detection usually suffers from predicting thick edges. Through extensive quantitative study with a new edge crispness measure, we find that noisy human-labeled edges are the main cause of thick predictions. Based on this observation, we advocate that more attention should be paid on label quality than on model design to achieve crisp edge detection. To this end, we propose an effective Canny-guided refinement of human-labeled edges whose result can be used to train crisp edge detectors. Essentially, it seeks for a subset of over-detected Canny edges that best align human labels. We show that several existing edge detectors can be turned into a crisp edge detector through training on our refined edge maps. Experiments demonstrate that deep models trained with refined edges achieve significant performance boost of crispness from 17.4% to 30.6%. With the PiDiNet backbone, our method improves ODS and OIS by 12.2% and 12.6% on the Multicue dataset, respectively, without relying on non-maximal suppression. We further conduct experiments and show the superiority of our crisp edge detection for optical flow estimation and image segmentation. ",
    "url": "https://arxiv.org/abs/2306.15172",
    "authors": [
      "Yunfan Ye",
      "Renjiao Yi",
      "Zhirui Gao",
      "Zhiping Cai",
      "Kai Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.15174",
    "title": "Examining Lower Latency Routing with Overlay Networks",
    "abstract": "In today's rapidly expanding digital landscape, where access to timely online content is paramount to users, the underlying network infrastructure and latency performance significantly influence the user experience. We present an empirical study of the current Internet's connectivity and the achievable latencies to propose better routing paths if available. Understanding the severity of the non-optimal internet topology with RIPE Atlas stats, we conduct practical experiments to demonstrate that local traffic from the San Diego area to the University of California, San Diego reaches up to Los Angeles before serving responses. We examine the traceroutes and build an experimental overlay network to constrain the San Diego traffic within the city to get better round-trip time latencies. ",
    "url": "https://arxiv.org/abs/2306.15174",
    "authors": [
      "Aakriti Kedia",
      "Akhilan Ganesh",
      "Aman Aggarwal"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2306.15194",
    "title": "Chronic pain detection from resting-state raw EEG signals using improved  feature selection",
    "abstract": "We present an automatic approach that works on resting-state raw EEG data for chronic pain detection. A new feature selection algorithm - modified Sequential Floating Forward Selection (mSFFS) - is proposed. The improved feature selection scheme is rather compact but displays better class separability as indicated by the Bhattacharyya distance measures and better visualization results. It also outperforms selections generated by other benchmark methods, boosting the test accuracy to 97.5% and yielding a test accuracy of 81.4% on an external dataset that contains different types of chronic pain ",
    "url": "https://arxiv.org/abs/2306.15194",
    "authors": [
      "Jean Li",
      "Dirk De Ridder",
      "Divya Adhia",
      "Matthew Hall",
      "Jeremiah D. Deng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15212",
    "title": "TranssionADD: A multi-frame reinforcement based sequence tagging model  for audio deepfake detection",
    "abstract": "Thanks to recent advancements in end-to-end speech modeling technology, it has become increasingly feasible to imitate and clone a user`s voice. This leads to a significant challenge in differentiating between authentic and fabricated audio segments. To address the issue of user voice abuse and misuse, the second Audio Deepfake Detection Challenge (ADD 2023) aims to detect and analyze deepfake speech utterances. Specifically, Track 2, named the Manipulation Region Location (RL), aims to pinpoint the location of manipulated regions in audio, which can be present in both real and generated audio segments. We propose our novel TranssionADD system as a solution to the challenging problem of model robustness and audio segment outliers in the trace competition. Our system provides three unique contributions: 1) we adapt sequence tagging task for audio deepfake detection; 2) we improve model generalization by various data augmentation techniques; 3) we incorporate multi-frame detection (MFD) module to overcome limited representation provided by a single frame and use isolated-frame penalty (IFP) loss to handle outliers in segments. Our best submission achieved 2nd place in Track 2, demonstrating the effectiveness and robustness of our proposed system. ",
    "url": "https://arxiv.org/abs/2306.15212",
    "authors": [
      "Jie Liu",
      "Zhiba Su",
      "Hui Huang",
      "Caiyan Wan",
      "Quanxiu Wang",
      "Jiangli Hong",
      "Benlai Tang",
      "Fengjie Zhu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2306.15217",
    "title": "Unsupervised Episode Generation for Graph Meta-learning",
    "abstract": "In this paper, we investigate Unsupervised Episode Generation methods to solve Few-Shot Node-Classification (FSNC) problem via Meta-learning without labels. Dominant meta-learning methodologies for FSNC were developed under the existence of abundant labeled nodes for training, which however may not be possible to obtain in the real-world. Although few studies have been proposed to tackle the label-scarcity problem, they still rely on a limited amount of labeled data, which hinders the full utilization of the information of all nodes in a graph. Despite the effectiveness of Self-Supervised Learning (SSL) approaches on FSNC without labels, they mainly learn generic node embeddings without consideration on the downstream task to be solved, which may limit its performance. In this work, we propose unsupervised episode generation methods to benefit from their generalization ability for FSNC tasks while resolving label-scarcity problem. We first propose a method that utilizes graph augmentation to generate training episodes called g-UMTRA, which however has several drawbacks, i.e., 1) increased training time due to the computation of augmented features and 2) low applicability to existing baselines. Hence, we propose Neighbors as Queries (NaQ), which generates episodes from structural neighbors found by graph diffusion. Our proposed methods are model-agnostic, that is, they can be plugged into any existing graph meta-learning models, while not sacrificing much of their performance or sometimes even improving them. We provide theoretical insights to support why our unsupervised episode generation methodologies work, and extensive experimental results demonstrate the potential of our unsupervised episode generation methods for graph meta-learning towards FSNC problems. ",
    "url": "https://arxiv.org/abs/2306.15217",
    "authors": [
      "Jihyeong Jung",
      "Sangwoo Seo",
      "Sungwon Kim",
      "Chanyoung Park"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15220",
    "title": "S-TLLR: STDP-inspired Temporal Local Learning Rule for Spiking Neural  Networks",
    "abstract": "Spiking Neural Networks (SNNs) are biologically plausible models that have been identified as potentially apt for the deployment for energy-efficient intelligence at the edge, particularly for sequential learning tasks. However, training of SNNs poses a significant challenge due to the necessity for precise temporal and spatial credit assignment. Back-propagation through time (BPTT) algorithm, whilst being the most widely used method for addressing these issues, incurs a high computational cost due to its temporal dependency. Moreover, BPTT and its approximations solely utilize causal information derived from the spiking activity to compute the synaptic updates, thus neglecting non-causal relationships. In this work, we propose S-TLLR, a novel three-factor temporal local learning rule inspired by the Spike-Timing Dependent Plasticity (STDP) mechanism, aimed at training SNNs on event-based learning tasks. S-TLLR considers both causal and non-causal relationships between pre and post-synaptic activities, achieving performance comparable to BPTT and enhancing performance relative to methods using only causal information. Furthermore, S-TLLR has low memory and time complexity, which is independent of the number of time steps, rendering it suitable for online learning on low-power devices. To demonstrate the scalability of our proposed method, we have conducted extensive evaluations on event-based datasets spanning a wide range of applications, such as image and gesture recognition, audio classification, and optical flow estimation. In all the experiments, S-TLLR achieved high accuracy with a reduction in the number of computations between $1.1-10\\times$. ",
    "url": "https://arxiv.org/abs/2306.15220",
    "authors": [
      "Marco Paul E. Apolinario",
      "Kaushik Roy"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15226",
    "title": "Learning-on-the-Drive: Self-supervised Adaptation of Visual Offroad  Traversability Models",
    "abstract": "Autonomous off-road driving requires understanding traversability, which refers to the suitability of a given terrain to drive over. When offroad vehicles travel at high speed ($>10m/s$), they need to reason at long-range ($50m$-$100m$) for safe and deliberate navigation. Moreover, vehicles often operate in new environments and under different weather conditions. LiDAR provides accurate estimates robust to visual appearances, however, it is often too noisy beyond 30m for fine-grained estimates due to sparse measurements. Conversely, visual-based models give dense predictions at further distances but perform poorly at all ranges when out of training distribution. To address these challenges, we present ALTER, an offroad perception module that adapts-on-the-drive to combine the best of both sensors. Our visual model continuously learns from new near-range LiDAR measurements. This self-supervised approach enables accurate long-range traversability prediction in novel environments without hand-labeling. Results on two distinct real-world offroad environments show up to 52.5% improvement in traversability estimation over LiDAR-only estimates and 38.1% improvement over non-adaptive visual baseline. ",
    "url": "https://arxiv.org/abs/2306.15226",
    "authors": [
      "Eric Chen",
      "Cherie Ho",
      "Mukhtar Maulimov",
      "Chen Wang",
      "Sebastian Scherer"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2306.15228",
    "title": "IIFL: Implicit Interactive Fleet Learning from Heterogeneous Human  Supervisors",
    "abstract": "Imitation learning has been applied to a range of robotic tasks, but can struggle when (1) robots encounter edge cases that are not represented in the training data (distribution shift) or (2) the human demonstrations are heterogeneous: taking different paths around an obstacle, for instance (multimodality). Interactive fleet learning (IFL) mitigates distribution shift by allowing robots to access remote human teleoperators during task execution and learn from them over time, but is not equipped to handle multimodality. Recent work proposes Implicit Behavior Cloning (IBC), which is able to represent multimodal demonstrations using energy-based models (EBMs). In this work, we propose addressing both multimodality and distribution shift with Implicit Interactive Fleet Learning (IIFL), the first extension of implicit policies to interactive imitation learning (including the single-robot, single-human setting). IIFL quantifies uncertainty using a novel application of Jeffreys divergence to EBMs. While IIFL is more computationally expensive than explicit methods, results suggest that IIFL achieves 4.5x higher return on human effort in simulation experiments and an 80% higher success rate in a physical block pushing task over (Explicit) IFL, IBC, and other baselines when human supervision is heterogeneous. ",
    "url": "https://arxiv.org/abs/2306.15228",
    "authors": [
      "Gaurav Datta",
      "Ryan Hoque",
      "Anrui Gu",
      "Eugen Solowjow",
      "Ken Goldberg"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15231",
    "title": "Emulating Reader Behaviors for Fake News Detection",
    "abstract": "The wide dissemination of fake news has affected our lives in many aspects, making fake news detection important and attracting increasing attention. Existing approaches make substantial contributions in this field by modeling news from a single-modal or multi-modal perspective. However, these modal-based methods can result in sub-optimal outcomes as they ignore reader behaviors in news consumption and authenticity verification. For instance, they haven't taken into consideration the component-by-component reading process: from the headline, images, comments, to the body, which is essential for modeling news with more granularity. To this end, we propose an approach of Emulating the behaviors of readers (Ember) for fake news detection on social media, incorporating readers' reading and verificating process to model news from the component perspective thoroughly. Specifically, we first construct intra-component feature extractors to emulate the behaviors of semantic analyzing on each component. Then, we design a module that comprises inter-component feature extractors and a sequence-based aggregator. This module mimics the process of verifying the correlation between components and the overall reading and verification sequence. Thus, Ember can handle the news with various components by emulating corresponding sequences. We conduct extensive experiments on nine real-world datasets, and the results demonstrate the superiority of Ember. ",
    "url": "https://arxiv.org/abs/2306.15231",
    "authors": [
      "Junwei Yin",
      "Min Gao",
      "Kai Shu",
      "Zehua Zhao",
      "Yinqiu Huang",
      "Jia Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2306.15242",
    "title": "SPDER: Semiperiodic Damping-Enabled Object Representation",
    "abstract": "We present a neural network architecture designed to naturally learn a positional embedding and overcome the spectral bias towards lower frequencies faced by conventional implicit neural representation networks. Our proposed architecture, SPDER, is a simple MLP that uses an activation function composed of a sinusoidal multiplied by a sublinear function, called the damping function. The sinusoidal enables the network to automatically learn the positional embedding of an input coordinate while the damping passes on the actual coordinate value by preventing it from being projected down to within a finite range of values. Our results indicate that SPDERs speed up training by 10x and converge to losses 1,500-50,000x lower than that of the state-of-the-art for image representation. SPDER is also state-of-the-art in audio representation. The superior representation capability allows SPDER to also excel on multiple downstream tasks such as image super-resolution and video frame interpolation. We provide intuition as to why SPDER significantly improves fitting compared to that of other INR methods while requiring no hyperparameter tuning or preprocessing. ",
    "url": "https://arxiv.org/abs/2306.15242",
    "authors": [
      "Kathan Shah",
      "Chawin Sitawarin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.15246",
    "title": "Errorless Robust JPEG Steganography Using Steganographic Polar Codes",
    "abstract": "Recently, a robust steganographic algorithm that achieves errorless robustness against JPEG recompression is proposed. The method evaluates the behavior of DCT coefficients after recompression using the local JPEG encoder to select robust coefficients and sets the other coefficients as wet cost. Combining the lattice embedding scheme, the method is errorless by construction. However, the authors only concern with the success rate under theoretical embedding, while the success rate of the implementation with practical steganographic codes is not verified. In this letter, we implement the method with two steganographic codes, i.e., steganographic polar code and syndrome-trellis code. By analyzing the possibility of success embedding of two steganographic codes under wet paper embedding, we discover that steganographic polar code achieves success embedding with a larger number of wet coefficients compared with syndrome-trellis code, which makes steganographic polar code more suitable under the errorless robust embedding paradigm. The experimental results show that the combination of steganographic polar code and errorless robust embedding achieves a higher success rate compared with the implementation with syndrome-trellis code under close security performance. ",
    "url": "https://arxiv.org/abs/2306.15246",
    "authors": [
      "Jimin Zhang",
      "Xianfeng Zhao",
      "Xiaolei He"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2306.15247",
    "title": "An Efficient Decomposition Algorithm for Large-Scale Network Slicing",
    "abstract": "In this paper, we consider the network slicing (NS) problem which attempts to map multiple customized virtual network requests to a common shared network infrastructure and allocate network resources to meet diverse service requirements. We propose an efficient decomposition algorithm for solving this NP-hard problem. The proposed algorithm decomposes the large-scale hard NS problem into two relatively easy function placement (FP) and traffic routing (TR) subproblems and iteratively solves them enabling information feedback between each other, which makes it particularly suitable to solve large-scale problems. Specifically, the FP subproblem is to place service functions into cloud nodes in the network, and solving it can return a function placement strategy based on which the TR subproblem is defined; and the TR subproblem is to find paths connecting two nodes hosting two adjacent functions in the network, and solving it can either verify that the solution of the FP subproblem is an optimal solution of the original problem, or return a valid inequality to the FP subproblem that cuts off the current infeasible solution. The proposed algorithm is guaranteed to find the global solution of the NS problem. We demonstrate the effectiveness and efficiency of the proposed algorithm via numerical experiments. ",
    "url": "https://arxiv.org/abs/2306.15247",
    "authors": [
      "Wei-Kun Chen",
      "Ya-Feng Liu",
      "Rui-Jin Zhang",
      "Yu-Hong Dai",
      "Zhi-Quan Luo"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2306.15248",
    "title": "Catch Me If You Can: A New Low-Rate DDoS Attack Strategy Disguised by  Feint",
    "abstract": "While collaborative systems provide convenience to our lives, they also face many security threats. One of them is the Low-rate Distributed Denial-of-Service (LDDoS) attack, which is a worthy concern. Unlike volumetric DDoS attacks that continuously send large volumes of traffic, LDDoS attacks are more stealthy and difficult to be detected owing to their low-volume feature. Due to its stealthiness and harmfulness, LDDoS has become one of the most destructive attacks in cloud computing. Although a few LDDoS attack detection and defense methods have been proposed, we observe that sophisticated LDDoS attacks (being more stealthy) can bypass some of the existing LDDoS defense methods. To verify our security observation, we proposed a new Feint-based LDDoS (F-LDDoS) attack strategy. In this strategy, we divide a Pulse Interval into a Feinting Interval and an Attack Interval. Unlike the previous LDDoS attacks, the bots also send traffic randomly in the Feinting Interval, thus disguise themselves as benign users during the F-LDDoS attack. In this way, although the victim detects that it is under an LDDoS attack, it is difficult to locate the attack sources and apply mitigation solutions. Experimental results show that F-LDDoS attack can degrade TCP bandwidth 6.7%-14% more than the baseline LDDoS attack. Besides, F-LDDoS also reduces the similarities between bot traffic and aggregated attack traffic, and increases the uncertainty of packet arrival. These results mean that the proposed F-LDDoS is more effective and more stealthy than normal LDDoS attacks. Finally, we discuss the countermeasures of F-LDDoS to draw the attention of defenders and improve the defense methods. ",
    "url": "https://arxiv.org/abs/2306.15248",
    "authors": [
      "Tianyang Cai",
      "Yuqi Li",
      "Tao Jia",
      "Leo Yu Zhang",
      "Zheng Yang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2306.15253",
    "title": "MindDial: Belief Dynamics Tracking with Theory-of-Mind Modeling for  Situated Neural Dialogue Generation",
    "abstract": "Humans talk in free-form while negotiating the expressed meanings or common ground. Despite the impressive conversational abilities of the large generative language models, they do not consider the individual differences in contextual understanding in a shared situated environment. In this work, we propose MindDial, a novel conversational framework that can generate situated free-form responses to negotiate common ground. We design an explicit mind module that can track three-level beliefs -- the speaker's belief, the speaker's prediction of the listener's belief, and the common belief based on the gap between the first two. Then the speaking act classification head will decide to continue to talk, end this turn, or take task-related action. We augment a common ground alignment dataset MutualFriend with belief dynamics annotation, of which the goal is to find a single mutual friend based on the free chat between two agents. Experiments show that our model with mental state modeling can resemble human responses when aligning common ground meanwhile mimic the natural human conversation flow. The ablation study further validates the third-level common belief can aggregate information of the first and second-order beliefs and align common ground more efficiently. ",
    "url": "https://arxiv.org/abs/2306.15253",
    "authors": [
      "Shuwen Qiu",
      "Song-Chun Zhu",
      "Zilong Zheng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2306.15261",
    "title": "A Survey on Out-of-Distribution Evaluation of Neural NLP Models",
    "abstract": "Adversarial robustness, domain generalization and dataset biases are three active lines of research contributing to out-of-distribution (OOD) evaluation on neural NLP models. However, a comprehensive, integrated discussion of the three research lines is still lacking in the literature. In this survey, we 1) compare the three lines of research under a unifying definition; 2) summarize the data-generating processes and evaluation protocols for each line of research; and 3) emphasize the challenges and opportunities for future work. ",
    "url": "https://arxiv.org/abs/2306.15261",
    "authors": [
      "Xinzhe Li",
      "Ming Liu",
      "Shang Gao",
      "Wray Buntine"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2306.15302",
    "title": "A Highly Accurate Query-Recovery Attack against Searchable Encryption  using Non-Indexed Documents",
    "abstract": "Cloud data storage solutions offer customers cost-effective and reduced data management. While attractive, data security issues remain to be a core concern. Traditional encryption protects stored documents, but hinders simple functionalities such as keyword search. Therefore, searchable encryption schemes have been proposed to allow for the search on encrypted data. Efficient schemes leak at least the access pattern (the accessed documents per keyword search), which is known to be exploitable in query recovery attacks assuming the attacker has a significant amount of background knowledge on the stored documents. Existing attacks can only achieve decent results with strong adversary models (e.g. at least 20% of previously known documents or require additional knowledge such as on query frequencies) and they give no metric to evaluate the certainty of recovered queries. This hampers their practical utility and questions their relevance in the real-world. We propose a refined score attack which achieves query recovery rates of around 85% without requiring exact background knowledge on stored documents; a distributionally similar, but otherwise different (i.e., non-indexed), dataset suffices. The attack starts with very few known queries (around 10 known queries in our experiments over different datasets of varying size) and then iteratively recovers further queries with confidence scores by adding previously recovered queries that had high confidence scores to the set of known queries. Additional to high recovery rates, our approach yields interpretable results in terms of confidence scores. ",
    "url": "https://arxiv.org/abs/2306.15302",
    "authors": [
      "Marc Damie",
      "Florian Hahn",
      "Andreas Peter"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2306.15306",
    "title": "Transferability Metrics for Object Detection",
    "abstract": "Transfer learning aims to make the most of existing pre-trained models to achieve better performance on a new task in limited data scenarios. However, it is unclear which models will perform best on which task, and it is prohibitively expensive to try all possible combinations. If transferability estimation offers a computation-efficient approach to evaluate the generalisation ability of models, prior works focused exclusively on classification settings. To overcome this limitation, we extend transferability metrics to object detection. We design a simple method to extract local features corresponding to each object within an image using ROI-Align. We also introduce TLogME, a transferability metric taking into account the coordinates regression task. In our experiments, we compare TLogME to state-of-the-art metrics in the estimation of transfer performance of the Faster-RCNN object detector. We evaluate all metrics on source and target selection tasks, for real and synthetic datasets, and with different backbone architectures. We show that, over different tasks, TLogME using the local extraction method provides a robust correlation with transfer performance and outperforms other transferability metrics on local and global level features. ",
    "url": "https://arxiv.org/abs/2306.15306",
    "authors": [
      "Louis Fouquet",
      "Simona Maggio",
      "Léo Dreyfus-Schmidt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.15321",
    "title": "Multi-Dimensional Refinement Graph Convolutional Network with Robust  Decouple Loss for Fine-Grained Skeleton-Based Action Recognition",
    "abstract": "Graph convolutional networks have been widely used in skeleton-based action recognition. However, existing approaches are limited in fine-grained action recognition due to the similarity of inter-class data. Moreover, the noisy data from pose extraction increases the challenge of fine-grained recognition. In this work, we propose a flexible attention block called Channel-Variable Spatial-Temporal Attention (CVSTA) to enhance the discriminative power of spatial-temporal joints and obtain a more compact intra-class feature distribution. Based on CVSTA, we construct a Multi-Dimensional Refinement Graph Convolutional Network (MDR-GCN), which can improve the discrimination among channel-, joint- and frame-level features for fine-grained actions. Furthermore, we propose a Robust Decouple Loss (RDL), which significantly boosts the effect of the CVSTA and reduces the impact of noise. The proposed method combining MDR-GCN with RDL outperforms the known state-of-the-art skeleton-based approaches on fine-grained datasets, FineGym99 and FSD-10, and also on the coarse dataset NTU-RGB+D X-view version. ",
    "url": "https://arxiv.org/abs/2306.15321",
    "authors": [
      "Sheng-Lan Liu",
      "Yu-Ning Ding",
      "Jin-Rong Zhang",
      "Kai-Yuan Liu",
      "Si-Fan Zhang",
      "Fei-Long Wang",
      "Gao Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.15324",
    "title": "Anomaly Detection in Networks via Score-Based Generative Models",
    "abstract": "Node outlier detection in attributed graphs is a challenging problem for which there is no method that would work well across different datasets. Motivated by the state-of-the-art results of score-based models in graph generative modeling, we propose to incorporate them into the aforementioned problem. Our method achieves competitive results on small-scale graphs. We provide an empirical analysis of the Dirichlet energy, and show that generative models might struggle to accurately reconstruct it. ",
    "url": "https://arxiv.org/abs/2306.15324",
    "authors": [
      "Dmitrii Gavrilev",
      "Evgeny Burnaev"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15337",
    "title": "Homological Neural Networks: A Sparse Architecture for Multivariate  Complexity",
    "abstract": "The rapid progress of Artificial Intelligence research came with the development of increasingly complex deep learning models, leading to growing challenges in terms of computational complexity, energy efficiency and interpretability. In this study, we apply advanced network-based information filtering techniques to design a novel deep neural network unit characterized by a sparse higher-order graphical architecture built over the homological structure of underlying data. We demonstrate its effectiveness in two application domains which are traditionally challenging for deep learning: tabular data and time series regression problems. Results demonstrate the advantages of this novel design which can tie or overcome the results of state-of-the-art machine learning and deep learning models using only a fraction of parameters. ",
    "url": "https://arxiv.org/abs/2306.15337",
    "authors": [
      "Yuanrong Wang",
      "Antonio Briola",
      "Tomaso Aste"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15338",
    "title": "Insertion-Only Dynamic Connectivity in General Disk Graphs",
    "abstract": "Let $S \\subseteq \\mathbb{R}^2$ be a set of $n$ \\emph{sites} in the plane, so that every site $s \\in S$ has an \\emph{associated radius} $r_s > 0$. Let $D(S)$ be the \\emph{disk intersection graph} defined by $S$, i.e., the graph with vertex set $S$ and an edge between two distinct sites $s, t \\in S$ if and only if the disks with centers $s$, $t$ and radii $r_s$, $r_t$ intersect. Our goal is to design data structures that maintain the connectivity structure of $D(S)$ as $S$ changes dynamically over time. We consider the incremental case, where new sites can be inserted into $S$. While previous work focuses on data structures whose running time depends on the ratio between the smallest and the largest site in $S$, we present a data structure with $O(\\alpha(n))$ amortized query time and $O(\\log^6 n)$ expected amortized insertion time. ",
    "url": "https://arxiv.org/abs/2306.15338",
    "authors": [
      "Haim Kaplan",
      "Katharina Klost",
      "Kristin Knorr",
      "Wolfgang Mulzer",
      "Liam Roditty"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2306.15340",
    "title": "A Toolbox for Fast Interval Arithmetic in numpy with an Application to  Formal Verification of Neural Network Controlled Systems",
    "abstract": "In this paper, we present a toolbox for interval analysis in numpy, with an application to formal verification of neural network controlled systems. Using the notion of natural inclusion functions, we systematically construct interval bounds for a general class of mappings. The toolbox offers efficient computation of natural inclusion functions using compiled C code, as well as a familiar interface in numpy with its canonical features, such as n-dimensional arrays, matrix/vector operations, and vectorization. We then use this toolbox in formal verification of dynamical systems with neural network controllers, through the composition of their inclusion functions. ",
    "url": "https://arxiv.org/abs/2306.15340",
    "authors": [
      "Akash Harapanahalli",
      "Saber Jafarpour",
      "Samuel Coogan"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2306.15349",
    "title": "SSC-RS: Elevate LiDAR Semantic Scene Completion with Representation  Separation and BEV Fusion",
    "abstract": "Semantic scene completion (SSC) jointly predicts the semantics and geometry of the entire 3D scene, which plays an essential role in 3D scene understanding for autonomous driving systems. SSC has achieved rapid progress with the help of semantic context in segmentation. However, how to effectively exploit the relationships between the semantic context in semantic segmentation and geometric structure in scene completion remains under exploration. In this paper, we propose to solve outdoor SSC from the perspective of representation separation and BEV fusion. Specifically, we present the network, named SSC-RS, which uses separate branches with deep supervision to explicitly disentangle the learning procedure of the semantic and geometric representations. And a BEV fusion network equipped with the proposed Adaptive Representation Fusion (ARF) module is presented to aggregate the multi-scale features effectively and efficiently. Due to the low computational burden and powerful representation ability, our model has good generality while running in real-time. Extensive experiments on SemanticKITTI demonstrate our SSC-RS achieves state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2306.15349",
    "authors": [
      "Jianbiao Mei",
      "Yu Yang",
      "Mengmeng Wang",
      "Tianxin Huang",
      "Xuemeng Yang",
      "Yong Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15354",
    "title": "3D-Speaker: A Large-Scale Multi-Device, Multi-Distance, and  Multi-Dialect Corpus for Speech Representation Disentanglement",
    "abstract": "Disentangling uncorrelated information in speech utterances is a crucial research topic within speech community. Different speech-related tasks focus on extracting distinct speech representations while minimizing the affects of other uncorrelated information. We present a large-scale speech corpus to facilitate the research of speech representation disentanglement. 3D-Speaker contains over 10,000 speakers, each of whom are simultaneously recorded by multiple Devices, locating at different Distances, and some speakers are speaking multiple Dialects. The controlled combinations of multi-dimensional audio data yield a matrix of a diverse blend of speech representation entanglement, thereby motivating intriguing methods to untangle them. The multi-domain nature of 3D-Speaker also makes it a suitable resource to evaluate large universal speech models and experiment methods of out-of-domain learning and self-supervised learning. https://3dspeaker.github.io/ ",
    "url": "https://arxiv.org/abs/2306.15354",
    "authors": [
      "Siqi Zheng",
      "Luyao Cheng",
      "Yafeng Chen",
      "Hui Wang",
      "Qian Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2306.15359",
    "title": "Matrix equation representation of convolution equation and its unique  solvability",
    "abstract": "We consider the convolution equation $F*X=B$, where $F\\in\\mathbb{R}^{3\\times 3}$ and $B\\in\\mathbb{R}^{m\\times n}$ are given, and $X\\in\\mathbb{R}^{m\\times n}$ is to be determined. The convolution equation can be regarded as a linear system with a coefficient matrix of special matrix structure. This fact has led to many studies including efficient numerical algorithms for solving the convolution equation. In this study, irrelevant to the fact, we show that the convolution equation can be represented as the generalized Sylvester equation~(that is one of matrix equations). Furthermore, for some realistic examples arising from image processing, we show that the generalized Sylvester equation can be reduced to a simpler form, and provide the unique solvability of the convolution equation. ",
    "url": "https://arxiv.org/abs/2306.15359",
    "authors": [
      "Yuki Satake",
      "Tomohiro Sogabe",
      "Tomoya Kemmochi",
      "Shao-Liang Zhang"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2306.15363",
    "title": "Your Attack Is Too DUMB: Formalizing Attacker Scenarios for Adversarial  Transferability",
    "abstract": "Evasion attacks are a threat to machine learning models, where adversaries attempt to affect classifiers by injecting malicious samples. An alarming side-effect of evasion attacks is their ability to transfer among different models: this property is called transferability. Therefore, an attacker can produce adversarial samples on a custom model (surrogate) to conduct the attack on a victim's organization later. Although literature widely discusses how adversaries can transfer their attacks, their experimental settings are limited and far from reality. For instance, many experiments consider both attacker and defender sharing the same dataset, balance level (i.e., how the ground truth is distributed), and model architecture. In this work, we propose the DUMB attacker model. This framework allows analyzing if evasion attacks fail to transfer when the training conditions of surrogate and victim models differ. DUMB considers the following conditions: Dataset soUrces, Model architecture, and the Balance of the ground truth. We then propose a novel testbed to evaluate many state-of-the-art evasion attacks with DUMB; the testbed consists of three computer vision tasks with two distinct datasets each, four types of balance levels, and three model architectures. Our analysis, which generated 13K tests over 14 distinct attacks, led to numerous novel findings in the scope of transferable attacks with surrogate models. In particular, mismatches between attackers and victims in terms of dataset source, balance levels, and model architecture lead to non-negligible loss of attack performance. ",
    "url": "https://arxiv.org/abs/2306.15363",
    "authors": [
      "Marco Alecci",
      "Mauro Conti",
      "Francesco Marchiori",
      "Luca Martinelli",
      "Luca Pajola"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15369",
    "title": "A Meta-analytical Comparison of Naive Bayes and Random Forest for  Software Defect Prediction",
    "abstract": "Is there a statistical difference between Naive Bayes and Random Forest in terms of recall, f-measure, and precision for predicting software defects? By utilizing systematic literature review and meta-analysis, we are answering this question. We conducted a systematic literature review by establishing criteria to search and choose papers, resulting in five studies. After that, using the meta-data and forest-plots of five chosen papers, we conducted a meta-analysis to compare the two models. The results have shown that there is no significant statistical evidence that Naive Bayes perform differently from Random Forest in terms of recall, f-measure, and precision. ",
    "url": "https://arxiv.org/abs/2306.15369",
    "authors": [
      "Ch Muhammad Awais",
      "Wei Gu",
      "Gcinizwe Dlamini",
      "Zamira Kholmatova",
      "Giancarlo Succi"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15381",
    "title": "Asymptotic-Preserving Neural Networks for Multiscale Kinetic Equations",
    "abstract": "In this paper, we present two novel Asymptotic-Preserving Neural Networks (APNNs) for tackling multiscale time-dependent kinetic problems, encompassing the linear transport equation and Bhatnagar-Gross-Krook (BGK) equation with diffusive scaling. Our primary objective is to devise efficient and accurate APNN approaches for resolving multiscale kinetic equations. We have established a neural network based on even-odd decomposition and concluded that enforcing the initial condition for the linear transport equation with inflow boundary conditions is crucial. This APNN method based on even-odd parity relaxes the stringent conservation prerequisites while concurrently introducing an auxiliary deep neural network. Additionally, we have incorporated the conservation laws of mass, momentum, and energy for the Boltzmann-BGK equation into the APNN framework by enforcing exact boundary conditions. This is our second contribution. The most notable finding of this study is that approximating the zeroth, first and second moments of the particle density distribution is simpler than the distribution itself. Furthermore, a compelling phenomenon in the training process is that the convergence of density is swifter than that of momentum and energy. Finally, we investigate several benchmark problems to demonstrate the efficacy of our proposed APNN methods. ",
    "url": "https://arxiv.org/abs/2306.15381",
    "authors": [
      "Shi Jin",
      "Zheng Ma",
      "Keke Wu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2306.15389",
    "title": "Multi-perspective Information Fusion Res2Net with RandomSpecmix for Fake  Speech Detection",
    "abstract": "In this paper, we propose the multi-perspective information fusion (MPIF) Res2Net with random Specmix for fake speech detection (FSD). The main purpose of this system is to improve the model's ability to learn precise forgery information for FSD task in low-quality scenarios. The task of random Specmix, a data augmentation, is to improve the generalization ability of the model and enhance the model's ability to locate discriminative information. Specmix cuts and pastes the frequency dimension information of the spectrogram in the same batch of samples without introducing other data, which helps the model to locate the really useful information. At the same time, we randomly select samples for augmentation to reduce the impact of data augmentation directly changing all the data. Once the purpose of helping the model to locate information is achieved, it is also important to reduce unnecessary information. The role of MPIF-Res2Net is to reduce redundant interference information. Deceptive information from a single perspective is always similar, so the model learning this similar information will produce redundant spoofing clues and interfere with truly discriminative information. The proposed MPIF-Res2Net fuses information from different perspectives, making the information learned by the model more diverse, thereby reducing the redundancy caused by similar information and avoiding interference with the learning of discriminative information. The results on the ASVspoof 2021 LA dataset demonstrate the effectiveness of our proposed method, achieving EER and min-tDCF of 3.29% and 0.2557, respectively. ",
    "url": "https://arxiv.org/abs/2306.15389",
    "authors": [
      "Shunbo Dong",
      "Jun Xue",
      "Cunhang Fan",
      "Kang Zhu",
      "Yujie Chen",
      "Zhao Lv"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2306.15390",
    "title": "DCP-NAS: Discrepant Child-Parent Neural Architecture Search for 1-bit  CNNs",
    "abstract": "Neural architecture search (NAS) proves to be among the effective approaches for many tasks by generating an application-adaptive neural architecture, which is still challenged by high computational cost and memory consumption. At the same time, 1-bit convolutional neural networks (CNNs) with binary weights and activations show their potential for resource-limited embedded devices. One natural approach is to use 1-bit CNNs to reduce the computation and memory cost of NAS by taking advantage of the strengths of each in a unified framework, while searching the 1-bit CNNs is more challenging due to the more complicated processes involved. In this paper, we introduce Discrepant Child-Parent Neural Architecture Search (DCP-NAS) to efficiently search 1-bit CNNs, based on a new framework of searching the 1-bit model (Child) under the supervision of a real-valued model (Parent). Particularly, we first utilize a Parent model to calculate a tangent direction, based on which the tangent propagation method is introduced to search the optimized 1-bit Child. We further observe a coupling relationship between the weights and architecture parameters existing in such differentiable frameworks. To address the issue, we propose a decoupled optimization method to search an optimized architecture. Extensive experiments demonstrate that our DCP-NAS achieves much better results than prior arts on both CIFAR-10 and ImageNet datasets. In particular, the backbones achieved by our DCP-NAS achieve strong generalization performance on person re-identification and object detection. ",
    "url": "https://arxiv.org/abs/2306.15390",
    "authors": [
      "Yanjing Li",
      "Sheng Xu",
      "Xianbin Cao",
      "Li'an Zhuo",
      "Baochang Zhang",
      "Tian Wang",
      "Guodong Guo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15395",
    "title": "On the Deque and Rique Numbers of Complete and Complete Bipartite Graphs",
    "abstract": "Several types of linear layouts of graphs are obtained by leveraging known data structures; the most notable representatives are the stack and the queue layouts. In this content, given a data structure, one seeks to specify an order of the vertices of the graph and a partition of its edges into pages, such that the endpoints of the edges assigned to each page can be processed by the given data structure in the underlying order. In this paper, we study deque and rique layouts of graphs obtained by leveraging the double-ended queue and the restricted-input double-ended queue (or deque and rique, for short), respectively. Hence, they generalize both the stack and the queue layouts. We focus on complete and complete bipartite graphs and present bounds on their deque- and rique-numbers, that is, on the minimum number of pages needed by any of these two types of linear layouts. ",
    "url": "https://arxiv.org/abs/2306.15395",
    "authors": [
      "Michael A. Bekos",
      "Michael Kaufmann",
      "Maria Eleni Pavlidi",
      "Xenia Rieger"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2306.15403",
    "title": "Verifying Safety of Neural Networks from Topological Perspectives",
    "abstract": "Neural networks (NNs) are increasingly applied in safety-critical systems such as autonomous vehicles. However, they are fragile and are often ill-behaved. Consequently, their behaviors should undergo rigorous guarantees before deployment in practice. In this paper, we propose a set-boundary reachability method to investigate the safety verification problem of NNs from a topological perspective. Given an NN with an input set and a safe set, the safety verification problem is to determine whether all outputs of the NN resulting from the input set fall within the safe set. In our method, the homeomorphism property and the open map property of NNs are mainly exploited, which establish rigorous guarantees between the boundaries of the input set and the boundaries of the output set. The exploitation of these two properties facilitates reachability computations via extracting subsets of the input set rather than the entire input set, thus controlling the wrapping effect in reachability analysis and facilitating the reduction of computation burdens for safety verification. The homeomorphism property exists in some widely used NNs such as invertible residual networks (i-ResNets) and Neural ordinary differential equations (Neural ODEs), and the open map is a less strict property and easier to satisfy compared with the homeomorphism property. For NNs establishing either of these properties, our set-boundary reachability method only needs to perform reachability analysis on the boundary of the input set. Moreover, for NNs that do not feature these properties with respect to the input set, we explore subsets of the input set for establishing the local homeomorphism property and then abandon these subsets for reachability computations. Finally, some examples demonstrate the performance of the proposed method. ",
    "url": "https://arxiv.org/abs/2306.15403",
    "authors": [
      "Zhen Liang",
      "Dejin Ren",
      "Bai Xue",
      "Ji Wang",
      "Wenjing Yang",
      "Wanwei Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15410",
    "title": "AutoGraph: Predicting Lane Graphs from Traffic Observations",
    "abstract": "Lane graph estimation is a long-standing problem in the context of autonomous driving. Previous works aimed at solving this problem by relying on large-scale, hand-annotated lane graphs, introducing a data bottleneck for training models to solve this task. To overcome this limitation, we propose to use the motion patterns of traffic participants as lane graph annotations. In our AutoGraph approach, we employ a pre-trained object tracker to collect the tracklets of traffic participants such as vehicles and trucks. Based on the location of these tracklets, we predict the successor lane graph from an initial position using overhead RGB images only, not requiring any human supervision. In a subsequent stage, we show how the individual successor predictions can be aggregated into a consistent lane graph. We demonstrate the efficacy of our approach on the UrbanLaneGraph dataset and perform extensive quantitative and qualitative evaluations, indicating that AutoGraph is on par with models trained on hand-annotated graph data. Model and dataset will be made available at redacted-for-review. ",
    "url": "https://arxiv.org/abs/2306.15410",
    "authors": [
      "Jannik Zürn",
      "Ingmar Posner",
      "Wolfram Burgard"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.15412",
    "title": "RMVPE: A Robust Model for Vocal Pitch Estimation in Polyphonic Music",
    "abstract": "Vocal pitch is an important high-level feature in music audio processing. However, extracting vocal pitch in polyphonic music is more challenging due to the presence of accompaniment. To eliminate the influence of the accompaniment, most previous methods adopt music source separation models to obtain clean vocals from polyphonic music before predicting vocal pitches. As a result, the performance of vocal pitch estimation is affected by the music source separation models. To address this issue and directly extract vocal pitches from polyphonic music, we propose a robust model named RMVPE. This model can extract effective hidden features and accurately predict vocal pitches from polyphonic music. The experimental results demonstrate the superiority of RMVPE in terms of raw pitch accuracy (RPA) and raw chroma accuracy (RCA). Additionally, experiments conducted with different types of noise show that RMVPE is robust across all signal-to-noise ratio (SNR) levels. The code of RMVPE is available at this URL. https://github.com/Dream-High/RMVPE. ",
    "url": "https://arxiv.org/abs/2306.15412",
    "authors": [
      "Haojie Wei",
      "Xueke Cao",
      "Tangpeng Dan",
      "Yueguo Chen"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2306.15416",
    "title": "Irregular Change Detection in Sparse Bi-Temporal Point Clouds using  Learned Place Recognition Descriptors and Point-to-Voxel Comparison",
    "abstract": "Change detection and irregular object extraction in 3D point clouds is a challenging task that is of high importance not only for autonomous navigation but also for updating existing digital twin models of various industrial environments. This article proposes an innovative approach for change detection in 3D point clouds using deep learned place recognition descriptors and irregular object extraction based on voxel-to-point comparison. The proposed method first aligns the bi-temporal point clouds using a map-merging algorithm in order to establish a common coordinate frame. Then, it utilizes deep learning techniques to extract robust and discriminative features from the 3D point cloud scans, which are used to detect changes between consecutive point cloud frames and therefore find the changed areas. Finally, the altered areas are sampled and compared between the two time instances to extract any obstructions that caused the area to change. The proposed method was successfully evaluated in real-world field experiments, where it was able to detect different types of changes in 3D point clouds, such as object or muck-pile addition and displacement, showcasing the effectiveness of the approach. The results of this study demonstrate important implications for various applications, including safety and security monitoring in construction sites, mapping and exploration and suggests potential future research directions in this field. ",
    "url": "https://arxiv.org/abs/2306.15416",
    "authors": [
      "Nikolaos Stathoulopoulos",
      "Anton Koval",
      "George Nikolakopoulos"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2306.15424",
    "title": "Robust domain decomposition methods for high-contrast multiscale  problems on irregular domains with virtual element discretizations",
    "abstract": "Our research focuses on the development of domain decomposition preconditioners tailored for second-order elliptic partial differential equations. Our approach addresses two major challenges simultaneously: i) effectively handling coefficients with high-contrast and multiscale properties, and ii) accommodating irregular domains in the original problem, the coarse mesh, and the subdomain partition. The robustness of our preconditioners is crucial for real-world applications, such as the efficient and accurate modeling of subsurface flow in porous media and other important domains. The core of our method lies in the construction of a suitable partition of unity functions and coarse spaces utilizing local spectral information. Leveraging these components, we implement a two-level additive Schwarz preconditioner. We demonstrate that the condition number of the preconditioned systems is bounded with a bound that is independent of the contrast. Our claims are further substantiated through selected numerical experiments, which confirm the robustness of our preconditioners. ",
    "url": "https://arxiv.org/abs/2306.15424",
    "authors": [
      "Juan G. Calvo",
      "Juan Galvis"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2306.15427",
    "title": "Adversarial Training for Graph Neural Networks",
    "abstract": "Despite its success in the image domain, adversarial training does not (yet) stand out as an effective defense for Graph Neural Networks (GNNs) against graph structure perturbations. In the pursuit of fixing adversarial training (1) we show and overcome fundamental theoretical as well as practical limitations of the adopted graph learning setting in prior work; (2) we reveal that more flexible GNNs based on learnable graph diffusion are able to adjust to adversarial perturbations, while the learned message passing scheme is naturally interpretable; (3) we introduce the first attack for structure perturbations that, while targeting multiple nodes at once, is capable of handling global (graph-level) as well as local (node-level) constraints. Including these contributions, we demonstrate that adversarial training is a state-of-the-art defense against adversarial structure perturbations. ",
    "url": "https://arxiv.org/abs/2306.15427",
    "authors": [
      "Lukas Gosch",
      "Simon Geisler",
      "Daniel Sturm",
      "Bertrand Charpentier",
      "Daniel Zügner",
      "Stephan Günnemann"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15437",
    "title": "On-device modeling of user's social context and familiar places from  smartphone-embedded sensor data",
    "abstract": "Context modeling and recognition are crucial for adaptive mobile and ubiquitous computing. Context-awareness in mobile environments relies on prompt reactions to context changes. However, current solutions focus on limited context information processed on centralized architectures, risking privacy leakage and lacking personalization. On-device context modeling and recognition are emerging research trends, addressing these concerns. Social interactions and visited locations play significant roles in characterizing daily life scenarios. This paper proposes an unsupervised and lightweight approach to model the user's social context and locations directly on the mobile device. Leveraging the ego-network model, the system extracts high-level, semantic-rich context features from smartphone-embedded sensor data. For the social context, the approach utilizes data on physical and cyber social interactions among users and their devices. Regarding location, it prioritizes modeling the familiarity degree of specific locations over raw location data, such as GPS coordinates and proximity devices. The effectiveness of the proposed approach is demonstrated through three sets of experiments, employing five real-world datasets. These experiments evaluate the structure of social and location ego networks, provide a semantic evaluation of the proposed models, and assess mobile computing performance. Finally, the relevance of the extracted features is showcased by the improved performance of three machine learning models in recognizing daily-life situations. Compared to using only features related to physical context, the proposed approach achieves a 3% improvement in AUROC, 9% in Precision, and 5% in Recall. ",
    "url": "https://arxiv.org/abs/2306.15437",
    "authors": [
      "Mattia Giovanni Campana",
      "Franca Delmastro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15447",
    "title": "Are aligned neural networks adversarially aligned?",
    "abstract": "Large language models are now tuned to align with the goals of their creators, namely to be \"helpful and harmless.\" These models should respond helpfully to user questions, but refuse to answer requests that could cause harm. However, adversarial users can construct inputs which circumvent attempts at alignment. In this work, we study to what extent these models remain aligned, even when interacting with an adversarial user who constructs worst-case inputs (adversarial examples). These inputs are designed to cause the model to emit harmful content that would otherwise be prohibited. We show that existing NLP-based optimization attacks are insufficiently powerful to reliably attack aligned text models: even when current NLP-based attacks fail, we can find adversarial inputs with brute force. As a result, the failure of current attacks should not be seen as proof that aligned text models remain aligned under adversarial inputs. However the recent trend in large-scale ML models is multimodal models that allow users to provide images that influence the text that is generated. We show these models can be easily attacked, i.e., induced to perform arbitrary un-aligned behavior through adversarial perturbation of the input image. We conjecture that improved NLP attacks may demonstrate this same level of adversarial control over text-only models. ",
    "url": "https://arxiv.org/abs/2306.15447",
    "authors": [
      "Nicholas Carlini",
      "Milad Nasr",
      "Christopher A. Choquette-Choo",
      "Matthew Jagielski",
      "Irena Gao",
      "Anas Awadalla",
      "Pang Wei Koh",
      "Daphne Ippolito",
      "Katherine Lee",
      "Florian Tramer",
      "Ludwig Schmidt"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15448",
    "title": "Understanding Social Reasoning in Language Models with Language Models",
    "abstract": "As Large Language Models (LLMs) become increasingly integrated into our everyday lives, understanding their ability to comprehend human mental states becomes critical for ensuring effective interactions. However, despite the recent attempts to assess the Theory-of-Mind (ToM) reasoning capabilities of LLMs, the degree to which these models can align with human ToM remains a nuanced topic of exploration. This is primarily due to two distinct challenges: (1) the presence of inconsistent results from previous evaluations, and (2) concerns surrounding the validity of existing evaluation methodologies. To address these challenges, we present a novel framework for procedurally generating evaluations with LLMs by populating causal templates. Using our framework, we create a new social reasoning benchmark (BigToM) for LLMs which consists of 25 controls and 5,000 model-written evaluations. We find that human participants rate the quality of our benchmark higher than previous crowd-sourced evaluations and comparable to expert-written evaluations. Using BigToM, we evaluate the social reasoning capabilities of a variety of LLMs and compare model performances with human performance. Our results suggest that GPT4 has ToM capabilities that mirror human inference patterns, though less reliable, while other LLMs struggle. ",
    "url": "https://arxiv.org/abs/2306.15448",
    "authors": [
      "Kanishk Gandhi",
      "Jan-Philipp Fränken",
      "Tobias Gerstenberg",
      "Noah D. Goodman"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2306.15451",
    "title": "Advancing Adversarial Training by Injecting Booster Signal",
    "abstract": "Recent works have demonstrated that deep neural networks (DNNs) are highly vulnerable to adversarial attacks. To defend against adversarial attacks, many defense strategies have been proposed, among which adversarial training has been demonstrated to be the most effective strategy. However, it has been known that adversarial training sometimes hurts natural accuracy. Then, many works focus on optimizing model parameters to handle the problem. Different from the previous approaches, in this paper, we propose a new approach to improve the adversarial robustness by using an external signal rather than model parameters. In the proposed method, a well-optimized universal external signal called a booster signal is injected into the outside of the image which does not overlap with the original content. Then, it boosts both adversarial robustness and natural accuracy. The booster signal is optimized in parallel to model parameters step by step collaboratively. Experimental results show that the booster signal can improve both the natural and robust accuracies over the recent state-of-the-art adversarial training methods. Also, optimizing the booster signal is general and flexible enough to be adopted on any existing adversarial training methods. ",
    "url": "https://arxiv.org/abs/2306.15451",
    "authors": [
      "Hong Joo Lee",
      "Youngjoon Yu",
      "Yong Man Ro"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15457",
    "title": "Robust Proxy: Improving Adversarial Robustness by Robust Proxy Learning",
    "abstract": "Recently, it has been widely known that deep neural networks are highly vulnerable and easily broken by adversarial attacks. To mitigate the adversarial vulnerability, many defense algorithms have been proposed. Recently, to improve adversarial robustness, many works try to enhance feature representation by imposing more direct supervision on the discriminative feature. However, existing approaches lack an understanding of learning adversarially robust feature representation. In this paper, we propose a novel training framework called Robust Proxy Learning. In the proposed method, the model explicitly learns robust feature representations with robust proxies. To this end, firstly, we demonstrate that we can generate class-representative robust features by adding class-wise robust perturbations. Then, we use the class representative features as robust proxies. With the class-wise robust features, the model explicitly learns adversarially robust features through the proposed robust proxy learning framework. Through extensive experiments, we verify that we can manually generate robust features, and our proposed learning framework could increase the robustness of the DNNs. ",
    "url": "https://arxiv.org/abs/2306.15457",
    "authors": [
      "Hong Joo Lee",
      "Yong Man Ro"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15472",
    "title": "Taming Detection Transformers for Medical Object Detection",
    "abstract": "The accurate detection of suspicious regions in medical images is an error-prone and time-consuming process required by many routinely performed diagnostic procedures. To support clinicians during this difficult task, several automated solutions were proposed relying on complex methods with many hyperparameters. In this study, we investigate the feasibility of DEtection TRansformer (DETR) models for volumetric medical object detection. In contrast to previous works, these models directly predict a set of objects without relying on the design of anchors or manual heuristics such as non-maximum-suppression to detect objects. We show by conducting extensive experiments with three models, namely DETR, Conditional DETR, and DINO DETR on four data sets (CADA, RibFrac, KiTS19, and LIDC) that these set prediction models can perform on par with or even better than currently existing methods. DINO DETR, the best-performing model in our experiments demonstrates this by outperforming a strong anchor-based one-stage detector, Retina U-Net, on three out of four data sets. ",
    "url": "https://arxiv.org/abs/2306.15472",
    "authors": [
      "Marc K. Ickler",
      "Michael Baumgartner",
      "Saikat Roy",
      "Tassilo Wald",
      "Klaus H. Maier-Hein"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.15478",
    "title": "Robust Finite Elements for linearized Magnetohydrodynamics",
    "abstract": "We introduce a pressure robust Finite Element Method for the linearized Magnetohydrodynamics equations in three space dimensions, which is provably quasi-robust also in the presence of high fluid and magnetic Reynolds numbers. The proposed scheme uses a non-conforming BDM approach with suitable DG terms for the fluid part, combined with an $H^1$-conforming choice for the magnetic fluxes. The method introduces also a specific CIP-type stabilization associated to the coupling terms. Finally, the theoretical result are further validated by numerical experiments. ",
    "url": "https://arxiv.org/abs/2306.15478",
    "authors": [
      "L. Beirão da Veiga",
      "F. Dassi",
      "G. Vacca"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2306.15479",
    "title": "Causal Inference via Predictive Coding",
    "abstract": "Bayesian and causal inference are fundamental processes for intelligence. Bayesian inference models observations: what can be inferred about y if we observe a related variable x? Causal inference models interventions: if we directly change x, how will y change? Predictive coding is a neuroscience-inspired method for performing Bayesian inference on continuous state variables using local information only. In this work, we go beyond Bayesian inference, and show how a simple change in the inference process of predictive coding enables interventional and counterfactual inference in scenarios where the causal graph is known. We then extend our results, and show how predictive coding can be generalized to cases where this graph is unknown, and has to be inferred from data, hence performing causal discovery. What results is a novel and straightforward technique that allows us to perform end-to-end causal inference on predictive-coding-based structural causal models, and demonstrate its utility for potential applications in machine learning. ",
    "url": "https://arxiv.org/abs/2306.15479",
    "authors": [
      "Tommaso Salvatori",
      "Luca Pinchetti",
      "Amine M'Charrak",
      "Beren Millidge",
      "Thomas Lukasiewicz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15482",
    "title": "Cooperation or Competition: Avoiding Player Domination for Multi-Target  Robustness via Adaptive Budgets",
    "abstract": "Despite incredible advances, deep learning has been shown to be susceptible to adversarial attacks. Numerous approaches have been proposed to train robust networks both empirically and certifiably. However, most of them defend against only a single type of attack, while recent work takes steps forward in defending against multiple attacks. In this paper, to understand multi-target robustness, we view this problem as a bargaining game in which different players (adversaries) negotiate to reach an agreement on a joint direction of parameter updating. We identify a phenomenon named player domination in the bargaining game, namely that the existing max-based approaches, such as MAX and MSD, do not converge. Based on our theoretical analysis, we design a novel framework that adjusts the budgets of different adversaries to avoid any player dominance. Experiments on standard benchmarks show that employing the proposed framework to the existing approaches significantly advances multi-target robustness. ",
    "url": "https://arxiv.org/abs/2306.15482",
    "authors": [
      "Yimu Wang",
      "Dinghuai Zhang",
      "Yihan Wu",
      "Heng Huang",
      "Hongyang Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15489",
    "title": "Precursor-of-Anomaly Detection for Irregular Time Series",
    "abstract": "Anomaly detection is an important field that aims to identify unexpected patterns or data points, and it is closely related to many real-world problems, particularly to applications in finance, manufacturing, cyber security, and so on. While anomaly detection has been studied extensively in various fields, detecting future anomalies before they occur remains an unexplored territory. In this paper, we present a novel type of anomaly detection, called \\emph{\\textbf{P}recursor-of-\\textbf{A}nomaly} (PoA) detection. Unlike conventional anomaly detection, which focuses on determining whether a given time series observation is an anomaly or not, PoA detection aims to detect future anomalies before they happen. To solve both problems at the same time, we present a neural controlled differential equation-based neural network and its multi-task learning algorithm. We conduct experiments using 17 baselines and 3 datasets, including regular and irregular time series, and demonstrate that our presented method outperforms the baselines in almost all cases. Our ablation studies also indicate that the multitasking training method significantly enhances the overall performance for both anomaly and PoA detection. ",
    "url": "https://arxiv.org/abs/2306.15489",
    "authors": [
      "Sheo Yon Jhin",
      "Jaehoon Lee",
      "Noseong Park"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15497",
    "title": "Identifying Practical Challenges in the Implementation of Technical  Measures for Data Privacy Compliance",
    "abstract": "Modern privacy regulations provide a strict mandate for data processing entities to implement appropriate technical measures to demonstrate compliance. In practice, determining what measures are indeed \"appropriate\" is not trivial, particularly in light of vague guidelines provided by privacy regulations. To exacerbate the issue, challenges arise not only in the implementation of the technical measures themselves, but also in a variety of factors involving the roles, processes, decisions, and culture surrounding the pursuit of privacy compliance. In this paper, we present 33 challenges faced in the implementation of technical measures for privacy compliance, derived from a qualitative analysis of 16 interviews with privacy professionals. In addition, we evaluate the interview findings in a survey study, which gives way to a discussion of the identified challenges and their implications. ",
    "url": "https://arxiv.org/abs/2306.15497",
    "authors": [
      "Oleksandra Klymenko",
      "Stephen Meisenbacher",
      "Florian Matthes"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2306.15507",
    "title": "Self-supervised Learning of Event-guided Video Frame Interpolation for  Rolling Shutter Frames",
    "abstract": "This paper makes the first attempt to tackle the challenging task of recovering arbitrary frame rate latent global shutter (GS) frames from two consecutive rolling shutter (RS) frames, guided by the novel event camera data. Although events possess high temporal resolution, beneficial for video frame interpolation (VFI), a hurdle in tackling this task is the lack of paired GS frames. Another challenge is that RS frames are susceptible to distortion when capturing moving objects. To this end, we propose a novel self-supervised framework that leverages events to guide RS frame correction and VFI in a unified framework. Our key idea is to estimate the displacement field (DF) non-linear dense 3D spatiotemporal information of all pixels during the exposure time, allowing for the reciprocal reconstruction between RS and GS frames as well as arbitrary frame rate VFI. Specifically, the displacement field estimation (DFE) module is proposed to estimate the spatiotemporal motion from events to correct the RS distortion and interpolate the GS frames in one step. We then combine the input RS frames and DF to learn a mapping for RS-to-GS frame interpolation. However, as the mapping is highly under-constrained, we couple it with an inverse mapping (i.e., GS-to-RS) and RS frame warping (i.e., RS-to-RS) for self-supervision. As there is a lack of labeled datasets for evaluation, we generate two synthetic datasets and collect a real-world dataset to train and test our method. Experimental results show that our method yields comparable or better performance with prior supervised methods. ",
    "url": "https://arxiv.org/abs/2306.15507",
    "authors": [
      "Yunfan Lu",
      "Guoqiang Liang",
      "Lin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2306.15513",
    "title": "PASNet: Polynomial Architecture Search Framework for Two-party  Computation-based Secure Neural Network Deployment",
    "abstract": "Two-party computation (2PC) is promising to enable privacy-preserving deep learning (DL). However, the 2PC-based privacy-preserving DL implementation comes with high comparison protocol overhead from the non-linear operators. This work presents PASNet, a novel systematic framework that enables low latency, high energy efficiency & accuracy, and security-guaranteed 2PC-DL by integrating the hardware latency of the cryptographic building block into the neural architecture search loss function. We develop a cryptographic hardware scheduler and the corresponding performance model for Field Programmable Gate Arrays (FPGA) as a case study. The experimental results demonstrate that our light-weighted model PASNet-A and heavily-weighted model PASNet-B achieve 63 ms and 228 ms latency on private inference on ImageNet, which are 147 and 40 times faster than the SOTA CryptGPU system, and achieve 70.54% & 78.79% accuracy and more than 1000 times higher energy efficiency. ",
    "url": "https://arxiv.org/abs/2306.15513",
    "authors": [
      "Hongwu Peng",
      "Shanglin Zhou",
      "Yukui Luo",
      "Nuo Xu",
      "Shijin Duan",
      "Ran Ran",
      "Jiahui Zhao",
      "Chenghong Wang",
      "Tong Geng",
      "Wujie Wen",
      "Xiaolin Xu",
      "Caiwen Ding"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2306.15530",
    "title": "Fast and Automatic 3D Modeling of Antenna Structure Using CNN-LSTM  Network for Efficient Data Generation",
    "abstract": "Deep learning-assisted antenna design methods such as surrogate models have gained significant popularity in recent years due to their potential to greatly increase design efficiencies by replacing the time-consuming full-wave electromagnetic (EM) simulations. However, a large number of training data with sufficiently diverse and representative samples (antenna structure parameters, scattering properties, etc.) is mandatory for these methods to ensure good performance. Traditional antenna modeling methods relying on manual model construction and modification are time-consuming and cannot meet the requirement of efficient training data acquisition. In this study, we proposed a deep learning-assisted and image-based intelligent modeling approach for accelerating the data acquisition of antenna samples with different physical structures. Specifically, our method only needs an image of the antenna structure, usually available in scientific publications, as the input while the corresponding modeling codes (VBA language) are generated automatically. The proposed model mainly consists of two parts: Convolutional Neural Network (CNN) and Long Short Term Memory (LSTM) networks. The former is used for capturing features of antenna structure images and the latter is employed to generate the modeling codes. Through training, the proposed model can achieve fast and automatic data acquisition of antenna physical structures based on antenna images. Experiment results show that the proposed method achieves a significant speed enhancement than the manual modeling approach. This approach lays the foundation for efficient data acquisition needed to build robust surrogate models in the future. ",
    "url": "https://arxiv.org/abs/2306.15530",
    "authors": [
      "Zhaohui Wei",
      "Zhao Zhou",
      "Peng Wang",
      "Jian Ren",
      "Yingzeng Yin",
      "Gert Frølund Pedersen",
      "Ming Shen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2306.15552",
    "title": "A Survey on Deep Learning Hardware Accelerators for Heterogeneous HPC  Platforms",
    "abstract": "Recent trends in deep learning (DL) imposed hardware accelerators as the most viable solution for several classes of high-performance computing (HPC) applications such as image classification, computer vision, and speech recognition. This survey summarizes and classifies the most recent advances in designing DL accelerators suitable to reach the performance requirements of HPC applications. In particular, it highlights the most advanced approaches to support deep learning accelerations including not only GPU and TPU-based accelerators but also design-specific hardware accelerators such as FPGA-based and ASIC-based accelerators, Neural Processing Units, open hardware RISC-V-based accelerators and co-processors. The survey also describes accelerators based on emerging memory technologies and computing paradigms, such as 3D-stacked Processor-In-Memory, non-volatile memories (mainly, Resistive RAM and Phase Change Memories) to implement in-memory computing, Neuromorphic Processing Units, and accelerators based on Multi-Chip Modules. The survey classifies the most influential architectures and technologies proposed in the last years, with the purpose of offering the reader a comprehensive perspective in the rapidly evolving field of deep learning. Finally, it provides some insights into future challenges in DL accelerators such as quantum accelerators and photonics. ",
    "url": "https://arxiv.org/abs/2306.15552",
    "authors": [
      "Cristina Silvano",
      "Daniele Ielmini",
      "Fabrizio Ferrandi",
      "Leandro Fiorin",
      "Serena Curzel",
      "Luca Benini",
      "Francesco Conti",
      "Angelo Garofalo",
      "Cristian Zambelli",
      "Enrico Calore",
      "Sebastiano Fabio Schifano",
      "Maurizio Palesi",
      "Giuseppe Ascia",
      "Davide Patti",
      "Stefania Perri",
      "Nicola Petra",
      "Davide De Caro",
      "Luciano Lavagno",
      "Teodoro Urso",
      "Valeria Cardellini",
      "Gian Carlo Cardarilli",
      "Robert Birke"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15568",
    "title": "Automated Static Warning Identification via Path-based Semantic  Representation",
    "abstract": "Despite their ability to aid developers in detecting potential defects early in the software development life cycle, static analysis tools often suffer from precision issues (i.e., high false positive rates of reported alarms). To improve the availability of these tools, many automated warning identification techniques have been proposed to assist developers in classifying false positive alarms. However, existing approaches mainly focus on using hand-engineered features or statement-level abstract syntax tree token sequences to represent the defective code, failing to capture semantics from the reported alarms. To overcome the limitations of traditional approaches, this paper employs deep neural networks' powerful feature extraction and representation abilities to generate code semantics from control flow graph paths for warning identification. The control flow graph abstractly represents the execution process of a given program. Thus, the generated path sequences of the control flow graph can guide the deep neural networks to learn semantic information about the potential defect more accurately. In this paper, we fine-tune the pre-trained language model to encode the path sequences and capture the semantic representations for model building. Finally, this paper conducts extensive experiments on eight open-source projects to verify the effectiveness of the proposed approach by comparing it with the state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2306.15568",
    "authors": [
      "Yuwei Zhang",
      "Ying Xing",
      "Ge Li",
      "Zhi Jin"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2306.15577",
    "title": "Retrospective: A Scalable Processing-in-Memory Accelerator for Parallel  Graph Processing",
    "abstract": "Our ISCA 2015 paper provides a new programmable processing-in-memory (PIM) architecture and system design that can accelerate key data-intensive applications, with a focus on graph processing workloads. Our major idea was to completely rethink the system, including the programming model, data partitioning mechanisms, system support, instruction set architecture, along with near-memory execution units and their communication architecture, such that an important workload can be accelerated at a maximum level using a distributed system of well-connected near-memory accelerators. We built our accelerator system, Tesseract, using 3D-stacked memories with logic layers, where each logic layer contains general-purpose processing cores and cores communicate with each other using a message-passing programming model. Cores could be specialized for graph processing (or any other application to be accelerated). To our knowledge, our paper was the first to completely design a near-memory accelerator system from scratch such that it is both generally programmable and specifically customizable to accelerate important applications, with a case study on major graph processing workloads. Ensuing work in academia and industry showed that similar approaches to system design can greatly benefit both graph processing workloads and other applications, such as machine learning, for which ideas from Tesseract seem to have been influential. This short retrospective provides a brief analysis of our ISCA 2015 paper and its impact. We briefly describe the major ideas and contributions of the work, discuss later works that built on it or were influenced by it, and make some educated guesses on what the future may bring on PIM and accelerator systems. ",
    "url": "https://arxiv.org/abs/2306.15577",
    "authors": [
      "Junwhan Ahn",
      "Sungpack Hong",
      "Sungjoo Yoo",
      "Onur Mutlu",
      "Kiyoung Choi"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2306.15588",
    "title": "Developing and Deploying Security Applications for In-Vehicle Networks",
    "abstract": "Radiological material transportation is primarily facilitated by heavy-duty on-road vehicles. Modern vehicles have dozens of electronic control units or ECUs, which are small, embedded computers that communicate with sensors and each other for vehicle functionality. ECUs use a standardized network architecture--Controller Area Network or CAN--which presents grave security concerns that have been exploited by researchers and hackers alike. For instance, ECUs can be impersonated by adversaries who have infiltrated an automotive CAN and disable or invoke unintended vehicle functions such as brakes, acceleration, or safety mechanisms. Further, the quality of security approaches varies wildly between manufacturers. Thus, research and development of after-market security solutions have grown remarkably in recent years. Many researchers are exploring deployable intrusion detection and prevention mechanisms using machine learning and data science techniques. However, there is a gap between developing security system algorithms and deploying prototype security appliances in-vehicle. In this paper, we, a research team at Oak Ridge National Laboratory working in this space, highlight challenges in the development pipeline, and provide techniques to standardize methodology and overcome technological hurdles. ",
    "url": "https://arxiv.org/abs/2306.15588",
    "authors": [
      "Samuel C Hollifield",
      "Pablo Moriano",
      "William L Lambert",
      "Joel Asiamah",
      "Isaac Sikkema",
      "Michael D Iannacone"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2306.15604",
    "title": "Constructing Multilingual Code Search Dataset Using Neural Machine  Translation",
    "abstract": "Code search is a task to find programming codes that semantically match the given natural language queries. Even though some of the existing datasets for this task are multilingual on the programming language side, their query data are only in English. In this research, we create a multilingual code search dataset in four natural and four programming languages using a neural machine translation model. Using our dataset, we pre-train and fine-tune the Transformer-based models and then evaluate them on multiple code search test sets. Our results show that the model pre-trained with all natural and programming language data has performed best in most cases. By applying back-translation data filtering to our dataset, we demonstrate that the translation quality affects the model's performance to a certain extent, but the data size matters more. ",
    "url": "https://arxiv.org/abs/2306.15604",
    "authors": [
      "Ryo Sekizawa",
      "Nan Duan",
      "Shuai Lu",
      "Hitomi Yanaka"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2306.15612",
    "title": "Rethinking Cross-Entropy Loss for Stereo Matching Networks",
    "abstract": "Despite the great success of deep learning in stereo matching, recovering accurate and clearly-contoured disparity map is still challenging. Currently, L1 loss and cross-entropy loss are the two most widely used loss functions for training the stereo matching networks. Comparing with the former, the latter can usually achieve better results thanks to its direct constraint to the the cost volume. However, how to generate reasonable ground-truth distribution for this loss function remains largely under exploited. Existing works assume uni-modal distributions around the ground-truth for all of the pixels, which ignores the fact that the edge pixels may have multi-modal distributions. In this paper, we first experimentally exhibit the importance of correct edge supervision to the overall disparity accuracy. Then a novel adaptive multi-modal cross-entropy loss which encourages the network to generate different distribution patterns for edge and non-edge pixels is proposed. We further optimize the disparity estimator in the inference stage to alleviate the bleeding and misalignment artifacts at the edge. Our method is generic and can help classic stereo matching models regain competitive performance. GANet trained by our loss ranks 1st on the KITTI 2015 and 2012 benchmarks and outperforms state-of-the-art methods by a large margin. Meanwhile, our method also exhibits superior cross-domain generalization ability and outperforms existing generalization-specialized methods on four popular real-world datasets. ",
    "url": "https://arxiv.org/abs/2306.15612",
    "authors": [
      "Peng Xu",
      "Zhiyu Xiang",
      "Chenyu Qiao",
      "Jingyun Fu",
      "Xijun Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.15630",
    "title": "Coupling parameter and particle dynamics for adaptive sampling in Neural  Galerkin schemes",
    "abstract": "Training nonlinear parametrizations such as deep neural networks to numerically approximate solutions of partial differential equations is often based on minimizing a loss that includes the residual, which is analytically available in limited settings only. At the same time, empirically estimating the training loss is challenging because residuals and related quantities can have high variance, especially for transport-dominated and high-dimensional problems that exhibit local features such as waves and coherent structures. Thus, estimators based on data samples from un-informed, uniform distributions are inefficient. This work introduces Neural Galerkin schemes that estimate the training loss with data from adaptive distributions, which are empirically represented via ensembles of particles. The ensembles are actively adapted by evolving the particles with dynamics coupled to the nonlinear parametrizations of the solution fields so that the ensembles remain informative for estimating the training loss. Numerical experiments indicate that few dynamic particles are sufficient for obtaining accurate empirical estimates of the training loss, even for problems with local features and with high-dimensional spatial domains. ",
    "url": "https://arxiv.org/abs/2306.15630",
    "authors": [
      "Yuxiao Wen",
      "Eric Vanden-Eijnden",
      "Benjamin Peherstorfer"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15661",
    "title": "Enhancing Representation Learning on High-Dimensional, Small-Size  Tabular Data: A Divide and Conquer Method with Ensembled VAEs",
    "abstract": "Variational Autoencoders and their many variants have displayed impressive ability to perform dimensionality reduction, often achieving state-of-the-art performance. Many current methods however, struggle to learn good representations in High Dimensional, Low Sample Size (HDLSS) tasks, which is an inherently challenging setting. We address this challenge by using an ensemble of lightweight VAEs to learn posteriors over subsets of the feature-space, which get aggregated into a joint posterior in a novel divide-and-conquer approach. Specifically, we present an alternative factorisation of the joint posterior that induces a form of implicit data augmentation that yields greater sample efficiency. Through a series of experiments on eight real-world datasets, we show that our method learns better latent representations in HDLSS settings, which leads to higher accuracy in a downstream classification task. Furthermore, we verify that our approach has a positive effect on disentanglement and achieves a lower estimated Total Correlation on learnt representations. Finally, we show that our approach is robust to partial features at inference, exhibiting little performance degradation even with most features missing. ",
    "url": "https://arxiv.org/abs/2306.15661",
    "authors": [
      "Navindu Leelarathna",
      "Andrei Margeloiu",
      "Mateja Jamnik",
      "Nikola Simidjievski"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15666",
    "title": "Testing of Detection Tools for AI-Generated Text",
    "abstract": "Recent advances in generative pre-trained transformer large language models have emphasised the potential risks of unfair use of artificial intelligence (AI) generated content in an academic environment and intensified efforts in searching for solutions to detect such content. The paper examines the general functionality of detection tools for artificial intelligence generated text and evaluates them based on accuracy and error type analysis. Specifically, the study seeks to answer research questions about whether existing detection tools can reliably differentiate between human-written text and ChatGPT-generated text, and whether machine translation and content obfuscation techniques affect the detection of AIgenerated text. The research covers 12 publicly available tools and two commercial systems (Turnitin and PlagiarismCheck) that are widely used in the academic setting. The researchers conclude that the available detection tools are neither accurate nor reliable and have a main bias towards classifying the output as human-written rather than detecting AIgenerated text. Furthermore, content obfuscation techniques significantly worsen the performance of tools. The study makes several significant contributions. First, it summarises up-to-date similar scientific and non-scientific efforts in the field. Second, it presents the result of one of the most comprehensive tests conducted so far, based on a rigorous research methodology, an original document set, and a broad coverage of tools. Third, it discusses the implications and drawbacks of using detection tools for AI-generated text in academic settings. ",
    "url": "https://arxiv.org/abs/2306.15666",
    "authors": [
      "Debora Weber-Wulff",
      "Alla Anohina-Naumeca",
      "Sonja Bjelobaba",
      "Tomáš Foltýnek",
      "Jean Guerrero-Dib",
      "Olumide Popoola",
      "Petr Šigut",
      "Lorna Waddington"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2306.14919",
    "title": "Beyond Chemical Language: A Multimodal Approach to Enhance Molecular  Property Prediction",
    "abstract": "We present a novel multimodal language model approach for predicting molecular properties by combining chemical language representation with physicochemical features. Our approach, MULTIMODAL-MOLFORMER, utilizes a causal multistage feature selection method that identifies physicochemical features based on their direct causal effect on a specific target property. These causal features are then integrated with the vector space generated by molecular embeddings from MOLFORMER. In particular, we employ Mordred descriptors as physicochemical features and identify the Markov blanket of the target property, which theoretically contains the most relevant features for accurate prediction. Our results demonstrate a superior performance of our proposed approach compared to existing state-of-the-art algorithms, including the chemical language-based MOLFORMER and graph neural networks, in predicting complex tasks such as biodegradability and PFAS toxicity estimation. Moreover, we demonstrate the effectiveness of our feature selection method in reducing the dimensionality of the Mordred feature space while maintaining or improving the model's performance. Our approach opens up promising avenues for future research in molecular property prediction by harnessing the synergistic potential of both chemical language and physicochemical features, leading to enhanced performance and advancements in the field. ",
    "url": "https://arxiv.org/abs/2306.14919",
    "authors": [
      "Eduardo Soares",
      "Emilio Vital Brazil",
      "Karen Fiorela Aquino Gutierrez",
      "Renato Cerqueira",
      "Dan Sanders",
      "Kristin Schmidt",
      "Dmitry Zubarev"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2306.15004",
    "title": "One-step replica symmetry breaking in the language of tensor networks",
    "abstract": "We develop an exact mapping between the one-step replica symmetry breaking cavity method and tensor networks. The two schemes come with complementary mathematical and numerical toolboxes that could be leveraged to improve the respective states of the art. As an example, we construct a tensor-network representation of Survey Propagation, one of the best deterministic k-SAT solvers. The resulting algorithm outperforms any existent tensor-network solver by several orders of magnitude. We comment on the generality of these ideas, and we show how to extend them to the context of quantum tensor networks. ",
    "url": "https://arxiv.org/abs/2306.15004",
    "authors": [
      "Nicola Pancotti",
      "Johnnie Gray"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Computational Complexity (cs.CC)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2306.15040",
    "title": "Robust and Space-Efficient Dual Adversary Quantum Query Algorithms",
    "abstract": "The general adversary dual is a powerful tool in quantum computing because it gives a query-optimal bounded-error quantum algorithm for deciding any Boolean function. Unfortunately, the algorithm uses linear qubits in the worst case, and only works if the constraints of the general adversary dual are exactly satisfied. The challenge of improving the algorithm is that it is brittle to arbitrarily small errors since it relies on a reflection over a span of vectors. We overcome this challenge and build a robust dual adversary algorithm that can handle approximately satisfied constraints. As one application of our robust algorithm, we prove that for any Boolean function with polynomially many 1-valued inputs (or in fact a slightly weaker condition) there is a query-optimal algorithm that uses logarithmic qubits. As another application, we prove that numerically derived, approximate solutions to the general adversary dual give a bounded-error quantum algorithm under certain conditions. Further, we show that these conditions empirically hold with reasonable iterations for Boolean functions with small domains. We also develop several tools that may be of independent interest, including a robust approximate spectral gap lemma, a method to compress a general adversary dual solution using the Johnson-Lindenstrauss lemma, and open-source code to find solutions to the general adversary dual. ",
    "url": "https://arxiv.org/abs/2306.15040",
    "authors": [
      "Michael Czekanski",
      "Shelby Kimmel",
      "R. Teal Witter"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2306.15159",
    "title": "Evaluation of machine learning architectures on the quantification of  epistemic and aleatoric uncertainties in complex dynamical systems",
    "abstract": "Machine learning methods for the construction of data-driven reduced order model models are used in an increasing variety of engineering domains, especially as a supplement to expensive computational fluid dynamics for design problems. An important check on the reliability of surrogate models is Uncertainty Quantification (UQ), a self assessed estimate of the model error. Accurate UQ allows for cost savings by reducing both the required size of training data sets and the required safety factors, while poor UQ prevents users from confidently relying on model predictions. We examine several machine learning techniques, including both Gaussian processes and a family UQ-augmented neural networks: Ensemble neural networks (ENN), Bayesian neural networks (BNN), Dropout neural networks (D-NN), and Gaussian neural networks (G-NN). We evaluate UQ accuracy (distinct from model accuracy) using two metrics: the distribution of normalized residuals on validation data, and the distribution of estimated uncertainties. We apply these metrics to two model data sets, representative of complex dynamical systems: an ocean engineering problem in which a ship traverses irregular wave episodes, and a dispersive wave turbulence system with extreme events, the Majda-McLaughlin-Tabak model. We present conclusions concerning model architecture and hyperparameter tuning. ",
    "url": "https://arxiv.org/abs/2306.15159",
    "authors": [
      "Stephen Guth",
      "Alireza Mojahed",
      "Themistoklis P. Sapsis"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2306.15203",
    "title": "Unsupervised Polychromatic Neural Representation for CT Metal Artifact  Reduction",
    "abstract": "Emerging neural reconstruction techniques based on tomography (e.g., NeRF, NeAT, and NeRP) have started showing unique capabilities in medical imaging. In this work, we present a novel Polychromatic neural representation (Polyner) to tackle the challenging problem of CT imaging when metallic implants exist within the human body. The artifacts arise from the drastic variation of metal's attenuation coefficients at various energy levels of the X-ray spectrum, leading to a nonlinear metal effect in CT measurements. Reconstructing CT images from metal-affected measurements hence poses a complicated nonlinear inverse problem where empirical models adopted in previous metal artifact reduction (MAR) approaches lead to signal loss and strongly aliased reconstructions. Polyner instead models the MAR problem from a nonlinear inverse problem perspective. Specifically, we first derive a polychromatic forward model to accurately simulate the nonlinear CT acquisition process. Then, we incorporate our forward model into the implicit neural representation to accomplish reconstruction. Lastly, we adopt a regularizer to preserve the physical properties of the CT images across different energy levels while effectively constraining the solution space. Our Polyner is an unsupervised method and does not require any external training data. Experimenting with multiple datasets shows that our Polyner achieves comparable or better performance than supervised methods on in-domain datasets while demonstrating significant performance improvements on out-of-domain datasets. To the best of our knowledge, our Polyner is the first unsupervised MAR method that outperforms its supervised counterparts. ",
    "url": "https://arxiv.org/abs/2306.15203",
    "authors": [
      "Qing Wu",
      "Lixuan Chen",
      "Ce Wang",
      "Hongjiang Wei",
      "S. Kevin Zhou",
      "Jingyi Yu",
      "Yuyao Zhang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.15267",
    "title": "Uniform density in matroids, matrices and graphs",
    "abstract": "We give new characterizations for the class of uniformly dense matroids, and we describe applications to graphic and real representable matroids. We show that a matroid is uniformly dense if and only if its base polytope contains a point with constant coordinates, and if and only if there exists a measure on the bases such that every element of the ground set has equal probability to be in a random basis with respect to this measure. As one application, we derive new spectral, structural and classification results for uniformly dense graphic matroids. In particular, we show that connected regular uniformly dense graphs are $1$-tough and thus contain a (near-)perfect matching. As a second application, we show that strictly uniformly dense real representable matroids can be represented by projection matrices with constant diagonal and that they are parametrized by a subvariety of the real Grassmannian. ",
    "url": "https://arxiv.org/abs/2306.15267",
    "authors": [
      "Karel Devriendt",
      "Raffaella Mulas"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Spectral Theory (math.SP)"
    ]
  },
  {
    "id": "arXiv:2306.15440",
    "title": "Post-Processing Independent Evaluation of Sound Event Detection Systems",
    "abstract": "Due to the high variation in the application requirements of sound event detection (SED) systems, it is not sufficient to evaluate systems only in a single operating mode. Therefore, the community recently adopted the polyphonic sound detection score (PSDS) as an evaluation metric, which is the normalized area under the PSD receiver operating characteristic (PSD-ROC). It summarizes the system performance over a range of operating modes resulting from varying the decision threshold that is used to translate the system output scores into a binary detection output. Hence, it provides a more complete picture of the overall system behavior and is less biased by specific threshold tuning. However, besides the decision threshold there is also the post-processing that can be changed to enter another operating mode. In this paper we propose the post-processing independent PSDS (piPSDS) as a generalization of the PSDS. Here, the post-processing independent PSD-ROC includes operating points from varying post-processings with varying decision thresholds. Thus, it summarizes even more operating modes of an SED system and allows for system comparison without the need of implementing a post-processing and without a bias due to different post-processings. While piPSDS can in principle combine different types of post-processing, we hear, as a first step, present median filter independent PSDS (miPSDS) results for this year's DCASE Challenge Task4a systems. Source code is publicly available in our sed_scores_eval package (https://github.com/fgnt/sed_scores_eval). ",
    "url": "https://arxiv.org/abs/2306.15440",
    "authors": [
      "Janek Ebbers",
      "Reinhold Haeb-Umbach",
      "Romain Serizel"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2306.15526",
    "title": "Higher-order Graph Attention Network for Stock Selection with Joint  Analysis",
    "abstract": "Stock selection is important for investors to construct profitable portfolios. Graph neural networks (GNNs) are increasingly attracting researchers for stock prediction due to their strong ability of relation modelling and generalisation. However, the existing GNN methods only focus on simple pairwise stock relation and do not capture complex higher-order structures modelling relations more than two nodes. In addition, they only consider factors of technical analysis and overlook factors of fundamental analysis that can affect the stock trend significantly. Motivated by them, we propose higher-order graph attention network with joint analysis (H-GAT). H-GAT is able to capture higher-order structures and jointly incorporate factors of fundamental analysis with factors of technical analysis. Specifically, the sequential layer of H-GAT take both types of factors as the input of a long-short term memory model. The relation embedding layer of H-GAT constructs a higher-order graph and learn node embedding with GAT. We then predict the ranks of stock return. Extensive experiments demonstrate the superiority of our H-GAT method on the profitability test and Sharp ratio over both NSDAQ and NYSE datasets ",
    "url": "https://arxiv.org/abs/2306.15526",
    "authors": [
      "Yang Qiao",
      "Yiping Xia",
      "Xiang Li",
      "Zheng Li",
      "Yan Ge"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15576",
    "title": "PyBADS: Fast and robust black-box optimization in Python",
    "abstract": "PyBADS is a Python implementation of the Bayesian Adaptive Direct Search (BADS) algorithm for fast and robust black-box optimization (Acerbi and Ma 2017). BADS is an optimization algorithm designed to efficiently solve difficult optimization problems where the objective function is rough (non-convex, non-smooth), mildly expensive (e.g., the function evaluation requires more than 0.1 seconds), possibly noisy, and gradient information is unavailable. With BADS, these issues are well addressed, making it an excellent choice for fitting computational models using methods such as maximum-likelihood estimation. The algorithm scales efficiently to black-box functions with up to $D \\approx 20$ continuous input parameters and supports bounds or no constraints. PyBADS comes along with an easy-to-use Pythonic interface for running the algorithm and inspecting its results. PyBADS only requires the user to provide a Python function for evaluating the target function, and optionally other constraints. Extensive benchmarks on both artificial test problems and large real model-fitting problems models drawn from cognitive, behavioral and computational neuroscience, show that BADS performs on par with or better than many other common and state-of-the-art optimizers (Acerbi and Ma 2017), making it a general model-fitting tool which provides fast and robust solutions. ",
    "url": "https://arxiv.org/abs/2306.15576",
    "authors": [
      "Gurjeet Sangra Singh",
      "Luigi Acerbi"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15585",
    "title": "Optimizing Credit Limit Adjustments Under Adversarial Goals Using  Reinforcement Learning",
    "abstract": "Reinforcement learning has been explored for many problems, from video games with deterministic environments to portfolio and operations management in which scenarios are stochastic; however, there have been few attempts to test these methods in banking problems. In this study, we sought to find and automatize an optimal credit card limit adjustment policy by employing reinforcement learning techniques. In particular, because of the historical data available, we considered two possible actions per customer, namely increasing or maintaining an individual's current credit limit. To find this policy, we first formulated this decision-making question as an optimization problem in which the expected profit was maximized; therefore, we balanced two adversarial goals: maximizing the portfolio's revenue and minimizing the portfolio's provisions. Second, given the particularities of our problem, we used an offline learning strategy to simulate the impact of the action based on historical data from a super-app (i.e., a mobile application that offers various services from goods deliveries to financial products) in Latin America to train our reinforcement learning agent. Our results show that a Double Q-learning agent with optimized hyperparameters can outperform other strategies and generate a non-trivial optimal policy reflecting the complex nature of this decision. Our research not only establishes a conceptual structure for applying reinforcement learning framework to credit limit adjustment, presenting an objective technique to make these decisions primarily based on data-driven methods rather than relying only on expert-driven systems but also provides insights into the effect of alternative data usage for determining these modifications. ",
    "url": "https://arxiv.org/abs/2306.15585",
    "authors": [
      "Sherly Alfonso-Sánchez",
      "Jesús Solano",
      "Alejandro Correa-Bahnsen",
      "Kristina P. Sendova",
      "Cristián Bravo"
    ],
    "subjectives": [
      "General Finance (q-fin.GN)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15599",
    "title": "Recurrent Neural Network-coupled SPAD TCSPC System for Real-time  Fluorescence Lifetime Imaging",
    "abstract": "Fluorescence lifetime imaging (FLI) has been receiving increased attention in recent years as a powerful imaging technique in biological and medical research. However, existing FLI systems often suffer from a tradeoff between processing speed, accuracy, and robustness. In this paper, we propose a SPAD TCSPC system coupled to a recurrent neural network (RNN) for FLI that accurately estimates on the fly fluorescence lifetime directly from raw timestamps instead of histograms, which drastically reduces the data transfer rate and hardware resource utilization. We train two variants of the RNN on a synthetic dataset and compare the results to those obtained using the center-of-mass method (CMM) and least squares fitting (LS fitting) methods. The results demonstrate that two RNN variants, gated recurrent unit (GRU) and long short-term memory (LSTM), are comparable to CMM and LS fitting in terms of accuracy and outperform CMM and LS fitting by a large margin in the presence of background noise. We also look at the Cramer-Rao lower bound and detailed analysis showed that the RNN models are close to the theoretical optima. The analysis of experimental data shows that our model, which is purely trained on synthetic datasets, works well on real-world data. We build a FLI microscope setup for evaluation based on Piccolo, a 32$\\times$32 SPAD sensor developed in our lab. Four quantized GRU cores, capable of processing up to 4 million photons per second, are deployed on a Xilinx Kintex-7 FPGA. Powered by the GRU, the FLI setup can retrieve real-time fluorescence lifetime images at up to 10 frames per second. The proposed FLI system is promising for many important biomedical applications, ranging from biological imaging of fast-moving cells to fluorescence-assisted diagnosis and surgery. ",
    "url": "https://arxiv.org/abs/2306.15599",
    "authors": [
      "Yang Lin",
      "Paul Mos",
      "Andrei Ardelean",
      "Claudio Bruschini",
      "Edoardo Charbon"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:1706.00178",
    "title": "Network Capacity Bound for Personalized PageRank in Multimodal Networks",
    "abstract": " Comments: 21 pages. 2 tables, 30 bibliography positions ",
    "url": "https://arxiv.org/abs/1706.00178",
    "authors": [
      "M.A. Kłopotek",
      "S.T. Wierzchoń",
      "R.A. Kłopotek"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Information Retrieval (cs.IR)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2006.10632",
    "title": "Explainable and Discourse Topic-aware Neural Language Understanding",
    "abstract": " Comments: Accepted at ICML2020 (13 pages, 2 figures) ",
    "url": "https://arxiv.org/abs/2006.10632",
    "authors": [
      "Yatin Chaudhary",
      "Hinrich Schütze",
      "Pankaj Gupta"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2006.10909",
    "title": "Neural Topic Modeling with Continual Lifelong Learning",
    "abstract": " Comments: Accepted at ICML2020 (13 pages, 11 figures, 9 tables) ",
    "url": "https://arxiv.org/abs/2006.10909",
    "authors": [
      "Pankaj Gupta",
      "Yatin Chaudhary",
      "Thomas Runkler",
      "Hinrich Schütze"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2101.07737",
    "title": "Outage Probability Analysis of Uplink Cell-Free Massive MIMO Network  with and without Pilot Contamination",
    "abstract": " Comments: In this version, we have extended our analysis to multiple antenna AP and the scenario with and without pilot contamination ",
    "url": "https://arxiv.org/abs/2101.07737",
    "authors": [
      "Shashank Shekhar",
      "Muralikrishnan Srinivasan",
      "Sheetal Kalyani",
      "Mohamed-Slim Alouini"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2110.12646",
    "title": "Zero-Shot Dialogue Disentanglement by Self-Supervised Entangled Response  Selection",
    "abstract": " Comments: 6 pages, accepted by EMNLP 2021. Update Acknowledgment ",
    "url": "https://arxiv.org/abs/2110.12646",
    "authors": [
      "Ta-Chung Chi",
      "Alexander I. Rudnicky"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.13695",
    "title": "Bilinear value networks",
    "abstract": " Title: Bilinear value networks ",
    "url": "https://arxiv.org/abs/2204.13695",
    "authors": [
      "Zhang-Wei Hong",
      "Ge Yang",
      "Pulkit Agrawal"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.11069",
    "title": "Asynchronous Execution of Heterogeneous Tasks in ML-driven HPC Workflows",
    "abstract": " Comments: Publised on 26th edition of the workshop on Job Scheduling Strategies for Parallel Processing. JSSPP23 ",
    "url": "https://arxiv.org/abs/2208.11069",
    "authors": [
      "Vincent R. Pascuzzi",
      "Ozgur O. Kilic",
      "Matteo Turilli",
      "Shantenu Jha"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.11361",
    "title": "Self-Supervised Exploration via Temporal Inconsistency in Reinforcement  Learning",
    "abstract": " Title: Self-Supervised Exploration via Temporal Inconsistency in Reinforcement  Learning ",
    "url": "https://arxiv.org/abs/2208.11361",
    "authors": [
      "Zijian Gao",
      "Kele Xu",
      "Yuanzhao Zhai",
      "Dawei Feng",
      "Bo Ding",
      "XinJun Mao",
      "Huaimin Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.06800",
    "title": "MGG: Accelerating Graph Neural Networks with Fine-grained intra-kernel  Communication-Computation Pipelining on Multi-GPU Platforms",
    "abstract": " Comments: Paper is accepted to OSDI'23 ",
    "url": "https://arxiv.org/abs/2209.06800",
    "authors": [
      "Yuke Wang",
      "Boyuan Feng",
      "Zheng Wang",
      "Tong Geng",
      "Kevin Barker",
      "Ang Li",
      "Yufei Ding"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.00041",
    "title": "Communication-Enabled Deep Reinforcement Learning to Optimise  Energy-Efficiency in UAV-Assisted Networks",
    "abstract": " Comments: 16 pages, 22 figures, Under-review. Extension of the work arXiv:2204.01597 ",
    "url": "https://arxiv.org/abs/2210.00041",
    "authors": [
      "Babatunji Omoniwa",
      "Boris Galkin",
      "Ivana Dusparic"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2210.01742",
    "title": "CADet: Fully Self-Supervised Out-Of-Distribution Detection With  Contrastive Learning",
    "abstract": " Title: CADet: Fully Self-Supervised Out-Of-Distribution Detection With  Contrastive Learning ",
    "url": "https://arxiv.org/abs/2210.01742",
    "authors": [
      "Charles Guille-Escuret",
      "Pau Rodriguez",
      "David Vazquez",
      "Ioannis Mitliagkas",
      "Joao Monteiro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.02892",
    "title": "SizeGAN: Improving Size Representation in Clothing Catalogs",
    "abstract": " Title: SizeGAN: Improving Size Representation in Clothing Catalogs ",
    "url": "https://arxiv.org/abs/2211.02892",
    "authors": [
      "Kathleen M. Lewis",
      "John Guttag"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.10095",
    "title": "Improving Robustness of TCM-based Robust Steganography with Variable  Robustness",
    "abstract": " Comments: 15 pages, 5 figures, submitted to IWDW 2020: 19th International Workshop on Digital-forensics and Watermarking ",
    "url": "https://arxiv.org/abs/2211.10095",
    "authors": [
      "Jimin Zhang",
      "Xianfeng Zhao",
      "Xiaolei He"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2211.16199",
    "title": "Latent Graph Inference using Product Manifolds",
    "abstract": " Title: Latent Graph Inference using Product Manifolds ",
    "url": "https://arxiv.org/abs/2211.16199",
    "authors": [
      "Haitz Sáez de Ocáriz Borde",
      "Anees Kazi",
      "Federico Barbero",
      "Pietro Liò"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.03853",
    "title": "Clustering with Neural Network and Index",
    "abstract": " Title: Clustering with Neural Network and Index ",
    "url": "https://arxiv.org/abs/2212.03853",
    "authors": [
      "Gangli Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.09921",
    "title": "Input Normalized Stochastic Gradient Descent Training of Deep Neural  Networks",
    "abstract": " Title: Input Normalized Stochastic Gradient Descent Training of Deep Neural  Networks ",
    "url": "https://arxiv.org/abs/2212.09921",
    "authors": [
      "Salih Atici",
      "Hongyi Pan",
      "Ahmet Enis Cetin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.08792",
    "title": "Inherent Limits on Topology-Based Link Prediction",
    "abstract": " Title: Inherent Limits on Topology-Based Link Prediction ",
    "url": "https://arxiv.org/abs/2301.08792",
    "authors": [
      "Justus I. Hibshman",
      "Tim Weninger"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2301.11556",
    "title": "Conformal inference is (almost) free for neural networks trained with  early stopping",
    "abstract": " Comments: Updates: extension to quantile regression, some further details about methodology, more numerical experiments ",
    "url": "https://arxiv.org/abs/2301.11556",
    "authors": [
      "Ziyi Liang",
      "Yanfei Zhou",
      "Matteo Sesia"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2301.12766",
    "title": "GPS-Spoofing Attack Detection Mechanism for UAV Swarms",
    "abstract": " Comments: 8 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2301.12766",
    "authors": [
      "Pavlo Mykytyn",
      "Marcin Brzozowski",
      "Zoya Dyka",
      "Peter Langendoerfer"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.13629",
    "title": "DiffSTG: Probabilistic Spatio-Temporal Graph Forecasting with Denoising  Diffusion Models",
    "abstract": " Title: DiffSTG: Probabilistic Spatio-Temporal Graph Forecasting with Denoising  Diffusion Models ",
    "url": "https://arxiv.org/abs/2301.13629",
    "authors": [
      "Haomin Wen",
      "Youfang Lin",
      "Yutong Xia",
      "Huaiyu Wan",
      "Qingsong Wen",
      "Roger Zimmermann",
      "Yuxuan Liang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.00773",
    "title": "Toward Physically Plausible Data-Driven Models: A Novel Neural Network  Approach to Symbolic Regression",
    "abstract": " Title: Toward Physically Plausible Data-Driven Models: A Novel Neural Network  Approach to Symbolic Regression ",
    "url": "https://arxiv.org/abs/2302.00773",
    "authors": [
      "Jiří Kubalík",
      "Erik Derner",
      "Robert Babuška"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.01115",
    "title": "PEPNet: Parameter and Embedding Personalized Network for Infusing with  Personalized Prior Information",
    "abstract": " Comments: Accepted by KDD 2023 ",
    "url": "https://arxiv.org/abs/2302.01115",
    "authors": [
      "Jianxin Chang",
      "Chenbin Zhang",
      "Yiqun Hui",
      "Dewei Leng",
      "Yanan Niu",
      "Yang Song",
      "Kun Gai"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2302.02352",
    "title": "TWIN: TWo-stage Interest Network for Lifelong User Behavior Modeling in  CTR Prediction at Kuaishou",
    "abstract": " Comments: Accepted by KDD 2023 ",
    "url": "https://arxiv.org/abs/2302.02352",
    "authors": [
      "Jianxin Chang",
      "Chenbin Zhang",
      "Zhiyi Fu",
      "Xiaoxue Zang",
      "Lin Guan",
      "Jing Lu",
      "Yiqun Hui",
      "Dewei Leng",
      "Yanan Niu",
      "Yang Song",
      "Kun Gai"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2302.11861",
    "title": "Out-of-Domain Robustness via Targeted Augmentations",
    "abstract": " Comments: ICML camera ready ",
    "url": "https://arxiv.org/abs/2302.11861",
    "authors": [
      "Irena Gao",
      "Shiori Sagawa",
      "Pang Wei Koh",
      "Tatsunori Hashimoto",
      "Percy Liang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.12814",
    "title": "GraphSR: A Data Augmentation Algorithm for Imbalanced Node  Classification",
    "abstract": " Comments: Accepted by AAAI2023 ",
    "url": "https://arxiv.org/abs/2302.12814",
    "authors": [
      "Mengting Zhou",
      "Zhiguo Gong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.13939",
    "title": "SpikeGPT: Generative Pre-trained Language Model with Spiking Neural  Networks",
    "abstract": " Title: SpikeGPT: Generative Pre-trained Language Model with Spiking Neural  Networks ",
    "url": "https://arxiv.org/abs/2302.13939",
    "authors": [
      "Rui-Jie Zhu",
      "Qihang Zhao",
      "Guoqi Li",
      "Jason K. Eshraghian"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2303.06222",
    "title": "Robust MADER: Decentralized Multiagent Trajectory Planner Robust to  Communication Delay in Dynamic Environments",
    "abstract": " Comments: 8 pagers, 13 figures,. arXiv admin note: substantial text overlap with arXiv:2209.13667 ",
    "url": "https://arxiv.org/abs/2303.06222",
    "authors": [
      "Kota Kondo",
      "Reinaldo Figueroa",
      "Juan Rached",
      "Jesus Tordesillas",
      "Parker C. Lusk",
      "Jonathan P. How"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2303.09901",
    "title": "mCPT at SemEval-2023 Task 3: Multilingual Label-Aware Contrastive  Pre-Training of Transformers for Few- and Zero-shot Framing Detection",
    "abstract": " Comments: Accepted for publication at SemEval'23 ",
    "url": "https://arxiv.org/abs/2303.09901",
    "authors": [
      "Markus Reiter-Haas",
      "Alexander Ertl",
      "Kevin Innerhofer",
      "Elisabeth Lex"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.14688",
    "title": "Uniqueness of BP fixed point for the Potts model and applications to  community detection",
    "abstract": " Title: Uniqueness of BP fixed point for the Potts model and applications to  community detection ",
    "url": "https://arxiv.org/abs/2303.14688",
    "authors": [
      "Yuzhou Gu",
      "Yury Polyanskiy"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2304.12112",
    "title": "Coordinated Dynamic Spectrum Sharing Between Terrestrial and  Non-Terrestrial Networks in 5G and Beyond",
    "abstract": " Comments: 2023 IEEE 24th International Symposium on a World of Wireless, Mobile and Multimedia Networks (WoWMoM) ",
    "url": "https://arxiv.org/abs/2304.12112",
    "authors": [
      "Henrik Martikainen",
      "Mikko Majamaa",
      "Jani Puttonen"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2305.05860",
    "title": "Topology and spectral interconnectivities of higher-order multilayer  networks",
    "abstract": " Title: Topology and spectral interconnectivities of higher-order multilayer  networks ",
    "url": "https://arxiv.org/abs/2305.05860",
    "authors": [
      "Elkaïoum M. Moutuou",
      "Obaï B. K. Ali",
      "Habib Benali"
    ],
    "subjectives": [
      "Algebraic Topology (math.AT)",
      "Social and Information Networks (cs.SI)",
      "Spectral Theory (math.SP)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2305.07011",
    "title": "Region-Aware Pretraining for Open-Vocabulary Object Detection with  Vision Transformers",
    "abstract": " Comments: CVPR 2023 (Highlight); adds LAION-2B result ",
    "url": "https://arxiv.org/abs/2305.07011",
    "authors": [
      "Dahun Kim",
      "Anelia Angelova",
      "Weicheng Kuo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.07499",
    "title": "Device-Robust Acoustic Scene Classification via Impulse Response  Augmentation",
    "abstract": " Comments: In Proceedings of the 31st European Signal Processing Conference, EUSIPCO 2023. Source Code available at: this https URL ",
    "url": "https://arxiv.org/abs/2305.07499",
    "authors": [
      "Tobias Morocutti",
      "Florian Schmid",
      "Khaled Koutini",
      "Gerhard Widmer"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2305.08229",
    "title": "A Hybrid 3D Eddy Detection Technique Based on Sea Surface Height and  Velocity Field",
    "abstract": " Comments: 8 pages, 14 figures. Accepted by EnvirVis 2023. Project Link: this https URL ",
    "url": "https://arxiv.org/abs/2305.08229",
    "authors": [
      "Weiping Hua",
      "Karen Bemis",
      "Dujuan Kang",
      "Sedat Ozer",
      "Deborah Silver"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.09790",
    "title": "Molecule-Morphology Contrastive Pretraining for Transferable Molecular  Representation",
    "abstract": " Comments: ICML 2023 Workshop on Computational Biology ",
    "url": "https://arxiv.org/abs/2305.09790",
    "authors": [
      "Cuong Q. Nguyen",
      "Dante Pertusi",
      "Kim M. Branson"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.12334",
    "title": "Towards Complex Dynamic Physics System Simulation with Graph Neural ODEs",
    "abstract": " Comments: 12 pages,5 figures, 6 tables, 49 references ",
    "url": "https://arxiv.org/abs/2305.12334",
    "authors": [
      "Guangsi Shi",
      "Daokun Zhang",
      "Ming Jin",
      "Shirui Pan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Atomic Physics (physics.atom-ph)"
    ]
  },
  {
    "id": "arXiv:2305.13250",
    "title": "Copy Recurrent Neural Network Structure Network",
    "abstract": " Comments: Need modification ",
    "url": "https://arxiv.org/abs/2305.13250",
    "authors": [
      "Xiaofan Zhou",
      "Xunzhu Tang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2305.13471",
    "title": "Fast Convergence in Learning Two-Layer Neural Networks with Separable  Data",
    "abstract": " Title: Fast Convergence in Learning Two-Layer Neural Networks with Separable  Data ",
    "url": "https://arxiv.org/abs/2305.13471",
    "authors": [
      "Hossein Taheri",
      "Christos Thrampoulidis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.17583",
    "title": "On Neural Networks as Infinite Tree-Structured Probabilistic Graphical  Models",
    "abstract": " Title: On Neural Networks as Infinite Tree-Structured Probabilistic Graphical  Models ",
    "url": "https://arxiv.org/abs/2305.17583",
    "authors": [
      "Boyao Li",
      "Alexandar J. Thomson",
      "Matthew M. Engelhard",
      "David Page"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.17879",
    "title": "Reversible Quantization Index Modulation for Static Deep Neural Network  Watermarking",
    "abstract": " Comments: 12 pages ",
    "url": "https://arxiv.org/abs/2305.17879",
    "authors": [
      "Junren Qin",
      "Shanxiang Lyu",
      "Fan Yang",
      "Jiarui Deng",
      "Zhihua Xia",
      "Xiaochun Cao"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.04265",
    "title": "Permutation Equivariant Graph Framelets for Heterophilous Graph Learning",
    "abstract": " Title: Permutation Equivariant Graph Framelets for Heterophilous Graph Learning ",
    "url": "https://arxiv.org/abs/2306.04265",
    "authors": [
      "Jianfei Li",
      "Ruigang Zheng",
      "Han Feng",
      "Ming Li",
      "Xiaosheng Zhuang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)",
      "Functional Analysis (math.FA)"
    ]
  },
  {
    "id": "arXiv:2306.05437",
    "title": "One-step Multi-view Clustering with Diverse Representation",
    "abstract": " Title: One-step Multi-view Clustering with Diverse Representation ",
    "url": "https://arxiv.org/abs/2306.05437",
    "authors": [
      "Xinhang Wan",
      "Jiyuan Liu",
      "Xinwang Liu",
      "Siwei Wang",
      "Yi Wen",
      "Tianjiao Wan",
      "Li Shen",
      "En Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.10045",
    "title": "Efficient Approximations of Complete Interatomic Potentials for Crystal  Property Prediction",
    "abstract": " Title: Efficient Approximations of Complete Interatomic Potentials for Crystal  Property Prediction ",
    "url": "https://arxiv.org/abs/2306.10045",
    "authors": [
      "Yuchao Lin",
      "Keqiang Yan",
      "Youzhi Luo",
      "Yi Liu",
      "Xiaoning Qian",
      "Shuiwang Ji"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.10701",
    "title": "Metasurface-based Spectral Convolutional Neural Network for Matter  Meta-imaging",
    "abstract": " Title: Metasurface-based Spectral Convolutional Neural Network for Matter  Meta-imaging ",
    "url": "https://arxiv.org/abs/2306.10701",
    "authors": [
      "Kaiyu Cui",
      "Shijie Rao",
      "Sheng Xu",
      "Yidong Huang",
      "Jiawei Yang",
      "Jian Xiong",
      "Chenxuan Wang",
      "Xue Feng",
      "Fang Liu",
      "Wei Zhang",
      "Yali Li",
      "Shengjin Wang"
    ],
    "subjectives": [
      "Optics (physics.optics)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2306.10946",
    "title": "Tourist Attractions Recommendation based on Attention Knowledge Graph  Convolution Network",
    "abstract": " Comments: I have incorrect information ",
    "url": "https://arxiv.org/abs/2306.10946",
    "authors": [
      "Ahmad A. Mubarak",
      "Afifa Kahled"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.11330",
    "title": "Low Latency Edge Classification GNN for Particle Trajectory Tracking on  FPGAs",
    "abstract": " Title: Low Latency Edge Classification GNN for Particle Trajectory Tracking on  FPGAs ",
    "url": "https://arxiv.org/abs/2306.11330",
    "authors": [
      "Shi-Yu Huang",
      "Yun-Chen Yang",
      "Yu-Ru Su",
      "Bo-Cheng Lai",
      "Javier Duarte",
      "Scott Hauck",
      "Shih-Chieh Hsu",
      "Jin-Xuan Hu",
      "Mark S. Neubauer"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Experiment (hep-ex)"
    ]
  },
  {
    "id": "arXiv:2306.11380",
    "title": "A Bayesian Take on Gaussian Process Networks",
    "abstract": " Title: A Bayesian Take on Gaussian Process Networks ",
    "url": "https://arxiv.org/abs/2306.11380",
    "authors": [
      "Enrico Giudice",
      "Jack Kuipers",
      "Giusi Moffa"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.12010",
    "title": "Spiking Neural Network for Ultra-low-latency and High-accurate Object  Detection",
    "abstract": " Comments: 14 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2306.12010",
    "authors": [
      "Jinye Qu",
      "Zeyu Gao",
      "Tielin Zhang",
      "Yanfeng Lu",
      "Huajin Tang",
      "Hong Qiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2306.13361",
    "title": "Neural 360$^\\circ$ Structured Light with Learned Metasurfaces",
    "abstract": " Title: Neural 360$^\\circ$ Structured Light with Learned Metasurfaces ",
    "url": "https://arxiv.org/abs/2306.13361",
    "authors": [
      "Eunsue Choi",
      "Gyeongtae Kim",
      "Jooyeong Yun",
      "Yujin Jeon",
      "Junsuk Rho",
      "Seung-Hwan Baek"
    ],
    "subjectives": [
      "Optics (physics.optics)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2306.13442",
    "title": "Minibatch training of neural network ensembles via trajectory sampling",
    "abstract": " Comments: 11 pages, 4 figures, 1 algorithm ",
    "url": "https://arxiv.org/abs/2306.13442",
    "authors": [
      "Jamie F. Mair",
      "Luke Causer",
      "Juan P. Garrahan"
    ],
    "subjectives": [
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.13793",
    "title": "QNNRepair: Quantized Neural Network Repair",
    "abstract": " Title: QNNRepair: Quantized Neural Network Repair ",
    "url": "https://arxiv.org/abs/2306.13793",
    "authors": [
      "Xidan Song",
      "Youcheng Sun",
      "Mustafa A. Mustafa",
      "Lucas C. Cordeiro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2306.14221",
    "title": "Feature Adversarial Distillation for Point Cloud Classification",
    "abstract": " Comments: Accepted to ICIP2023 ",
    "url": "https://arxiv.org/abs/2306.14221",
    "authors": [
      "YuXing Lee",
      "Wei Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.14857",
    "title": "Metapopulation Graph Neural Networks: Deep Metapopulation Epidemic  Modeling with Human Mobility",
    "abstract": " Comments: This is the extended version of an ECMLPKDD2022 paper ",
    "url": "https://arxiv.org/abs/2306.14857",
    "authors": [
      "Qi Cao",
      "Renhe Jiang",
      "Chuang Yang",
      "Zipei Fan",
      "Xuan Song",
      "Ryosuke Shibasaki"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  }
]