[
  {
    "id": "arXiv:2308.03766",
    "title": "AMaizeD: An End to End Pipeline for Automatic Maize Disease Detection",
    "abstract": "This research paper presents AMaizeD: An End to End Pipeline for Automatic Maize Disease Detection, an automated framework for early detection of diseases in maize crops using multispectral imagery obtained from drones. A custom hand-collected dataset focusing specifically on maize crops was meticulously gathered by expert researchers and agronomists. The dataset encompasses a diverse range of maize varieties, cultivation practices, and environmental conditions, capturing various stages of maize growth and disease progression. By leveraging multispectral imagery, the framework benefits from improved spectral resolution and increased sensitivity to subtle changes in plant health. The proposed framework employs a combination of convolutional neural networks (CNNs) as feature extractors and segmentation techniques to identify both the maize plants and their associated diseases. Experimental results demonstrate the effectiveness of the framework in detecting a range of maize diseases, including powdery mildew, anthracnose, and leaf blight. The framework achieves state-of-the-art performance on the custom hand-collected dataset and contributes to the field of automated disease detection in agriculture, offering a practical solution for early identification of diseases in maize crops advanced machine learning techniques and deep learning architectures. ",
    "url": "https://arxiv.org/abs/2308.03766",
    "authors": [
      "Anish Mall",
      "Sanchit Kabra",
      "Ankur Lhila",
      "Pawan Ajmera"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.03768",
    "title": "GeoTransformer: Fast and Robust Point Cloud Registration with Geometric  Transformer",
    "abstract": "We study the problem of extracting accurate correspondences for point cloud registration. Recent keypoint-free methods have shown great potential through bypassing the detection of repeatable keypoints which is difficult to do especially in low-overlap scenarios. They seek correspondences over downsampled superpoints, which are then propagated to dense points. Superpoints are matched based on whether their neighboring patches overlap. Such sparse and loose matching requires contextual features capturing the geometric structure of the point clouds. We propose Geometric Transformer, or GeoTransformer for short, to learn geometric feature for robust superpoint matching. It encodes pair-wise distances and triplet-wise angles, making it invariant to rigid transformation and robust in low-overlap cases. The simplistic design attains surprisingly high matching accuracy such that no RANSAC is required in the estimation of alignment transformation, leading to $100$ times acceleration. Extensive experiments on rich benchmarks encompassing indoor, outdoor, synthetic, multiway and non-rigid demonstrate the efficacy of GeoTransformer. Notably, our method improves the inlier ratio by $18{\\sim}31$ percentage points and the registration recall by over $7$ points on the challenging 3DLoMatch benchmark. Our code and models are available at \\url{https://github.com/qinzheng93/GeoTransformer}. ",
    "url": "https://arxiv.org/abs/2308.03768",
    "authors": [
      "Zheng Qin",
      "Hao Yu",
      "Changjian Wang",
      "Yulan Guo",
      "Yuxing Peng",
      "Slobodan Ilic",
      "Dewen Hu",
      "Kai Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.03770",
    "title": "Visual Saliency Detection in Advanced Driver Assistance Systems",
    "abstract": "Visual Saliency refers to the innate human mechanism of focusing on and extracting important features from the observed environment. Recently, there has been a notable surge of interest in the field of automotive research regarding the estimation of visual saliency. While operating a vehicle, drivers naturally direct their attention towards specific objects, employing brain-driven saliency mechanisms that prioritize certain elements over others. In this investigation, we present an intelligent system that combines a drowsiness detection system for drivers with a scene comprehension pipeline based on saliency. To achieve this, we have implemented a specialized 3D deep network for semantic segmentation, which has been pretrained and tailored for processing the frames captured by an automotive-grade external camera. The proposed pipeline was hosted on an embedded platform utilizing the STA1295 core, featuring ARM A7 dual-cores, and embeds an hardware accelerator. Additionally, we employ an innovative biosensor embedded on the car steering wheel to monitor the driver drowsiness, gathering the PhotoPlethysmoGraphy (PPG) signal of the driver. A dedicated 1D temporal deep convolutional network has been devised to classify the collected PPG time-series, enabling us to assess the driver level of attentiveness. Ultimately, we compare the determined attention level of the driver with the corresponding saliency-based scene classification to evaluate the overall safety level. The efficacy of the proposed pipeline has been validated through extensive experimental results. ",
    "url": "https://arxiv.org/abs/2308.03770",
    "authors": [
      "Francesco Rundo",
      "Michael Sebastian Rundo",
      "Concetto Spampinato"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.03772",
    "title": "Improved Neural Radiance Fields Using Pseudo-depth and Fusion",
    "abstract": "Since the advent of Neural Radiance Fields, novel view synthesis has received tremendous attention. The existing approach for the generalization of radiance field reconstruction primarily constructs an encoding volume from nearby source images as additional inputs. However, these approaches cannot efficiently encode the geometric information of real scenes with various scale objects/structures. In this work, we propose constructing multi-scale encoding volumes and providing multi-scale geometry information to NeRF models. To make the constructed volumes as close as possible to the surfaces of objects in the scene and the rendered depth more accurate, we propose to perform depth prediction and radiance field reconstruction simultaneously. The predicted depth map will be used to supervise the rendered depth, narrow the depth range, and guide points sampling. Finally, the geometric information contained in point volume features may be inaccurate due to occlusion, lighting, etc. To this end, we propose enhancing the point volume feature from depth-guided neighbor feature fusion. Experiments demonstrate the superior performance of our method in both novel view synthesis and dense geometry modeling without per-scene optimization. ",
    "url": "https://arxiv.org/abs/2308.03772",
    "authors": [
      "Jingliang Li",
      "Qiang Zhou",
      "Chaohui Yu",
      "Zhengda Lu",
      "Jun Xiao",
      "Zhibin Wang",
      "Fan Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.03773",
    "title": "Goodness-of-Fit of Attributed Probabilistic Graph Generative Models",
    "abstract": "Probabilistic generative models of graphs are important tools that enable representation and sampling. Many recent works have created probabilistic models of graphs that are capable of representing not only entity interactions but also their attributes. However, given a generative model of random attributed graph(s), the general conditions that establish goodness of fit are not clear a-priori. In this paper, we define goodness of fit in terms of the mean square contingency coefficient for random binary networks. For this statistic, we outline a procedure for assessing the quality of the structure of a learned attributed graph by ensuring that the discrepancy of the mean square contingency coefficient (constant, or random) is minimal with high probability. We apply these criteria to verify the representation capability of a probabilistic generative model for various popular types of graph models. ",
    "url": "https://arxiv.org/abs/2308.03773",
    "authors": [
      "Pablo Robles-Granda",
      "Katherine Tsai",
      "Oluwasanmi Koyejo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.03792",
    "title": "Multi-attacks: Many images $+$ the same adversarial attack $\\to$ many  target labels",
    "abstract": "We show that we can easily design a single adversarial perturbation $P$ that changes the class of $n$ images $X_1,X_2,\\dots,X_n$ from their original, unperturbed classes $c_1, c_2,\\dots,c_n$ to desired (not necessarily all the same) classes $c^*_1,c^*_2,\\dots,c^*_n$ for up to hundreds of images and target classes at once. We call these \\textit{multi-attacks}. Characterizing the maximum $n$ we can achieve under different conditions such as image resolution, we estimate the number of regions of high class confidence around a particular image in the space of pixels to be around $10^{\\mathcal{O}(100)}$, posing a significant problem for exhaustive defense strategies. We show several immediate consequences of this: adversarial attacks that change the resulting class based on their intensity, and scale-independent adversarial examples. To demonstrate the redundancy and richness of class decision boundaries in the pixel space, we look for its two-dimensional sections that trace images and spell words using particular classes. We also show that ensembling reduces susceptibility to multi-attacks, and that classifiers trained on random labels are more susceptible. Our code is available on GitHub. ",
    "url": "https://arxiv.org/abs/2308.03792",
    "authors": [
      "Stanislav Fort"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.03800",
    "title": "Textual Data Mining for Financial Fraud Detection: A Deep Learning  Approach",
    "abstract": "In this report, I present a deep learning approach to conduct a natural language processing (hereafter NLP) binary classification task for analyzing financial-fraud texts. First, I searched for regulatory announcements and enforcement bulletins from HKEX news to define fraudulent companies and to extract their MD&A reports before I organized the sentences from the reports with labels and reporting time. My methodology involved different kinds of neural network models, including Multilayer Perceptrons with Embedding layers, vanilla Recurrent Neural Network (RNN), Long-Short Term Memory (LSTM), and Gated Recurrent Unit (GRU) for the text classification task. By utilizing this diverse set of models, I aim to perform a comprehensive comparison of their accuracy in detecting financial fraud. My results bring significant implications for financial fraud detection as this work contributes to the growing body of research at the intersection of deep learning, NLP, and finance, providing valuable insights for industry practitioners, regulators, and researchers in the pursuit of more robust and effective fraud detection methodologies. ",
    "url": "https://arxiv.org/abs/2308.03800",
    "authors": [
      "Qiuru Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.03805",
    "title": "Weakly Supervised Multi-Task Representation Learning for Human Activity  Analysis Using Wearables",
    "abstract": "Sensor data streams from wearable devices and smart environments are widely studied in areas like human activity recognition (HAR), person identification, or health monitoring. However, most of the previous works in activity and sensor stream analysis have been focusing on one aspect of the data, e.g. only recognizing the type of the activity or only identifying the person who performed the activity. We instead propose an approach that uses a weakly supervised multi-output siamese network that learns to map the data into multiple representation spaces, where each representation space focuses on one aspect of the data. The representation vectors of the data samples are positioned in the space such that the data with the same semantic meaning in that aspect are closely located to each other. Therefore, as demonstrated with a set of experiments, the trained model can provide metrics for clustering data based on multiple aspects, allowing it to address multiple tasks simultaneously and even to outperform single task supervised methods in many situations. In addition, further experiments are presented that in more detail analyze the effect of the architecture and of using multiple tasks within this framework, that investigate the scalability of the model to include additional tasks, and that demonstrate the ability of the framework to combine data for which only partial relationship information with respect to the target tasks is available. ",
    "url": "https://arxiv.org/abs/2308.03805",
    "authors": [
      "Taoran Sheng",
      "Manfred Huber"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.03814",
    "title": "Sex differences in attitudes towards online privacy and anonymity among  Israeli students with different technical backgrounds",
    "abstract": "Introduction. In this exploratory study, we proposed an experimental framework to investigate and model male/female differences in attitudes towards online privacy and anonymity among Israeli students. Our aim was to comparatively model men and women's online privacy attitudes, and to assess the online privacy gender gap. Method. Various factors related to the user's online privacy and anonymity were considered, such as awareness of anonymous threats made online, concern for protecting personal information on the Internet, online privacy self-efficacy, online privacy literacy and users' tendency to engage in privacy paradox behaviour, i.e., personal data disclosure despite the awareness of anonymity and privacy threats. Analysis. A user study was carried out among 169 Israeli academic students through a quantitative method using closed-ended questionnaires. The subjects' responses were analysed using standard statistical measures. We then proposed a summarized comparative model for the two sexes' online privacy behaviour. Results. We found that a digital gap still exists between men and women regarding technological knowledge and skills used to protect their identity and personal information on the Web. Interestingly, users' tendency to engage in privacy paradox behaviour was not higher among men despite their higher level of technological online privacy literacy compared to women. Conclusions. Women's relatively high online privacy self-efficacy level and their low awareness of technological threat do not match their relatively low technological online privacy literacy level. This leads to a lower ability to protect their identity and personal information as compared to men. We conclude that further steps should be taken to eliminate the inter-gender technological gap in online privacy and anonymity awareness and literacy. ",
    "url": "https://arxiv.org/abs/2308.03814",
    "authors": [
      "Maor Weinberger",
      "Maayan Zhitomirsky-Geffet",
      "Dan Bouhnik"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.03819",
    "title": "XFlow: Benchmarking Flow Behaviors over Graphs",
    "abstract": "The occurrence of diffusion on a graph is a prevalent and significant phenomenon, as evidenced by the spread of rumors, influenza-like viruses, smart grid failures, and similar events. Comprehending the behaviors of flow is a formidable task, due to the intricate interplay between the distribution of seeds that initiate flow propagation, the propagation model, and the topology of the graph. The study of networks encompasses a diverse range of academic disciplines, including mathematics, physics, social science, and computer science. This interdisciplinary nature of network research is characterized by a high degree of specialization and compartmentalization, and the cooperation facilitated by them is inadequate. From a machine learning standpoint, there is a deficiency in a cohesive platform for assessing algorithms across various domains. One of the primary obstacles to current research in this field is the absence of a comprehensive curated benchmark suite to study the flow behaviors under network scenarios. To address this disparity, we propose the implementation of a novel benchmark suite that encompasses a variety of tasks, baseline models, graph datasets, and evaluation tools. In addition, we present a comprehensive analytical framework that offers a generalized approach to numerous flow-related tasks across diverse domains, serving as a blueprint and roadmap. Drawing upon the outcomes of our empirical investigation, we analyze the advantages and disadvantages of current foundational models, and we underscore potential avenues for further study. The datasets, code, and baseline models have been made available for the public at: https://github.com/XGraphing/XFlow ",
    "url": "https://arxiv.org/abs/2308.03819",
    "authors": [
      "Zijian Zhang",
      "Zonghan Zhang",
      "Zhiqian Chen"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.03821",
    "title": "Distributionally Robust Classification on a Data Budget",
    "abstract": "Real world uses of deep learning require predictable model behavior under distribution shifts. Models such as CLIP show emergent natural distributional robustness comparable to humans, but may require hundreds of millions of training samples. Can we train robust learners in a domain where data is limited? To rigorously address this question, we introduce JANuS (Joint Annotations and Names Set), a collection of four new training datasets with images, labels, and corresponding captions, and perform a series of carefully controlled investigations of factors contributing to robustness in image classification, then compare those results to findings derived from a large-scale meta-analysis. Using this approach, we show that standard ResNet-50 trained with the cross-entropy loss on 2.4 million image samples can attain comparable robustness to a CLIP ResNet-50 trained on 400 million samples. To our knowledge, this is the first result showing (near) state-of-the-art distributional robustness on limited data budgets. Our dataset is available at \\url{https://huggingface.co/datasets/penfever/JANuS_dataset}, and the code used to reproduce our experiments can be found at \\url{https://github.com/penfever/vlhub/}. ",
    "url": "https://arxiv.org/abs/2308.03821",
    "authors": [
      "Benjamin Feuer",
      "Ameya Joshi",
      "Minh Pham",
      "Chinmay Hegde"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.03826",
    "title": "Recurrent Multi-scale Transformer for High-Resolution Salient Object  Detection",
    "abstract": "Salient Object Detection (SOD) aims to identify and segment the most conspicuous objects in an image or video. As an important pre-processing step, it has many potential applications in multimedia and vision tasks. With the advance of imaging devices, SOD with high-resolution images is of great demand, recently. However, traditional SOD methods are largely limited to low-resolution images, making them difficult to adapt to the development of High-Resolution SOD (HRSOD). Although some HRSOD methods emerge, there are no large enough datasets for training and evaluating. Besides, current HRSOD methods generally produce incomplete object regions and irregular object boundaries. To address above issues, in this work, we first propose a new HRS10K dataset, which contains 10,500 high-quality annotated images at 2K-8K resolution. As far as we know, it is the largest dataset for the HRSOD task, which will significantly help future works in training and evaluating models. Furthermore, to improve the HRSOD performance, we propose a novel Recurrent Multi-scale Transformer (RMFormer), which recurrently utilizes shared Transformers and multi-scale refinement architectures. Thus, high-resolution saliency maps can be generated with the guidance of lower-resolution predictions. Extensive experiments on both high-resolution and low-resolution benchmarks show the effectiveness and superiority of the proposed framework. The source code and dataset are released at: https://github.com/DrowsyMon/RMFormer. ",
    "url": "https://arxiv.org/abs/2308.03826",
    "authors": [
      "Xinhao Deng",
      "Pingping Zhang",
      "Wei Liu",
      "Huchuan Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2308.03873",
    "title": "Evaluating and Explaining Large Language Models for Code Using Syntactic  Structures",
    "abstract": "Large Language Models (LLMs) for code are a family of high-parameter, transformer-based neural networks pre-trained on massive datasets of both natural and programming languages. These models are rapidly being employed in commercial AI-based developer tools, such as GitHub CoPilot. However, measuring and explaining their effectiveness on programming tasks is a challenging proposition, given their size and complexity. The methods for evaluating and explaining LLMs for code are inextricably linked. That is, in order to explain a model's predictions, they must be reliably mapped to fine-grained, understandable concepts. Once this mapping is achieved, new methods for detailed model evaluations are possible. However, most current explainability techniques and evaluation benchmarks focus on model robustness or individual task performance, as opposed to interpreting model predictions. To this end, this paper introduces ASTxplainer, an explainability method specific to LLMs for code that enables both new methods for LLM evaluation and visualizations of LLM predictions that aid end-users in understanding model predictions. At its core, ASTxplainer provides an automated method for aligning token predictions with AST nodes, by extracting and aggregating normalized model logits within AST structures. To demonstrate the practical benefit of ASTxplainer, we illustrate the insights that our framework can provide by performing an empirical evaluation on 12 popular LLMs for code using a curated dataset of the most popular GitHub projects. Additionally, we perform a user study examining the usefulness of an ASTxplainer-derived visualization of model predictions aimed at enabling model users to explain predictions. The results of these studies illustrate the potential for ASTxplainer to provide insights into LLM effectiveness, and aid end-users in understanding predictions. ",
    "url": "https://arxiv.org/abs/2308.03873",
    "authors": [
      "David N Palacio",
      "Alejandro Velasco",
      "Daniel Rodriguez-Cardenas",
      "Kevin Moran",
      "Denys Poshyvanyk"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.03888",
    "title": "Deep neural networks from the perspective of ergodic theory",
    "abstract": "The design of deep neural networks remains somewhat of an art rather than precise science. By tentatively adopting ergodic theory considerations on top of viewing the network as the time evolution of a dynamical system, with each layer corresponding to a temporal instance, we show that some rules of thumb, which might otherwise appear mysterious, can be attributed heuristics. ",
    "url": "https://arxiv.org/abs/2308.03888",
    "authors": [
      "Fan Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)"
    ]
  },
  {
    "id": "arXiv:2308.03891",
    "title": "A Cross-Domain Evaluation of Approaches for Causal Knowledge Extraction",
    "abstract": "Causal knowledge extraction is the task of extracting relevant causes and effects from text by detecting the causal relation. Although this task is important for language understanding and knowledge discovery, recent works in this domain have largely focused on binary classification of a text segment as causal or non-causal. In this regard, we perform a thorough analysis of three sequence tagging models for causal knowledge extraction and compare it with a span based approach to causality extraction. Our experiments show that embeddings from pre-trained language models (e.g. BERT) provide a significant performance boost on this task compared to previous state-of-the-art models with complex architectures. We observe that span based models perform better than simple sequence tagging models based on BERT across all 4 data sets from diverse domains with different types of cause-effect phrases. ",
    "url": "https://arxiv.org/abs/2308.03891",
    "authors": [
      "Anik Saha",
      "Oktie Hassanzadeh",
      "Alex Gittens",
      "Jian Ni",
      "Kavitha Srinivas",
      "Bulent Yener"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.03892",
    "title": "Scalable and Equitable Math Problem Solving Strategy Prediction in Big  Educational Data",
    "abstract": "Understanding a student's problem-solving strategy can have a significant impact on effective math learning using Intelligent Tutoring Systems (ITSs) and Adaptive Instructional Systems (AISs). For instance, the ITS/AIS can better personalize itself to correct specific misconceptions that are indicated by incorrect strategies, specific problems can be designed to improve strategies and frustration can be minimized by adapting to a student's natural way of thinking rather than trying to fit a standard strategy for all. While it may be possible for human experts to identify strategies manually in classroom settings with sufficient student interaction, it is not possible to scale this up to big data. Therefore, we leverage advances in Machine Learning and AI methods to perform scalable strategy prediction that is also fair to students at all skill levels. Specifically, we develop an embedding called MVec where we learn a representation based on the mastery of students. We then cluster these embeddings with a non-parametric clustering method where we progressively learn clusters such that we group together instances that have approximately symmetrical strategies. The strategy prediction model is trained on instances sampled from these clusters. This ensures that we train the model over diverse strategies and also that strategies from a particular group do not bias the DNN model, thus allowing it to optimize its parameters over all groups. Using real world large-scale student interaction datasets from MATHia, we implement our approach using transformers and Node2Vec for learning the mastery embeddings and LSTMs for predicting strategies. We show that our approach can scale up to achieve high accuracy by training on a small sample of a large dataset and also has predictive equality, i.e., it can predict strategies equally well for learners at diverse skill levels. ",
    "url": "https://arxiv.org/abs/2308.03892",
    "authors": [
      "Anup Shakya",
      "Vasile Rus",
      "Deepak Venugopal"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2308.03900",
    "title": "Developability Approximation for Neural Implicits through Rank  Minimization",
    "abstract": "Developability refers to the process of creating a surface without any tearing or shearing from a two-dimensional plane. It finds practical applications in the fabrication industry. An essential characteristic of a developable 3D surface is its zero Gaussian curvature, which means that either one or both of the principal curvatures are zero. This paper introduces a method for reconstructing an approximate developable surface from a neural implicit surface. The central idea of our method involves incorporating a regularization term that operates on the second-order derivatives of the neural implicits, effectively promoting zero Gaussian curvature. Implicit surfaces offer the advantage of smoother deformation with infinite resolution, overcoming the high polygonal constraints of state-of-the-art methods using discrete representations. We draw inspiration from the properties of surface curvature and employ rank minimization techniques derived from compressed sensing. Experimental results on both developable and non-developable surfaces, including those affected by noise, validate the generalizability of our method. ",
    "url": "https://arxiv.org/abs/2308.03900",
    "authors": [
      "Pratheba Selvaraju"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2308.03903",
    "title": "Average Estimates in Line Graphs Are Biased Toward Areas of Higher  Variability",
    "abstract": "We investigate variability overweighting, a previously undocumented bias in line graphs, where estimates of average value are biased toward areas of higher variability in that line. We found this effect across two preregistered experiments with 140 and 420 participants. These experiments also show that the bias is reduced when using a dot encoding of the same series. We can model the bias with the average of the data series and the average of the points drawn along the line. This bias might arise because higher variability leads to stronger weighting in the average calculation, either due to the longer line segments (even though those segments contain the same number of data values) or line segments with higher variability being otherwise more visually salient. Understanding and predicting this bias is important for visualization design guidelines, recommendation systems, and tool builders, as the bias can adversely affect estimates of averages and trends. ",
    "url": "https://arxiv.org/abs/2308.03903",
    "authors": [
      "Dominik Moritz",
      "Lace M. Padilla",
      "Francis Nguyen",
      "Steven L. Franconeri"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.03915",
    "title": "Predicting and explaining nonlinear material response using deep  Physically Guided Neural Networks with Internal Variables",
    "abstract": "Nonlinear materials are often difficult to model with classical state model theory because they have a complex and sometimes inaccurate physical and mathematical description or we simply do not know how to describe such materials in terms of relations between external and internal variables. In many disciplines, Neural Network methods have arisen as powerful tools to identify very complex and non-linear correlations. In this work, we use the very recently developed concept of Physically Guided Neural Networks with Internal Variables (PGNNIV) to discover constitutive laws using a model-free approach and training solely with measured force-displacement data. PGNNIVs make a particular use of the physics of the problem to enforce constraints on specific hidden layers and are able to make predictions without internal variable data. We demonstrate that PGNNIVs are capable of predicting both internal and external variables under unseen load scenarios, regardless of the nature of the material considered (linear, with hardening or softening behavior and hyperelastic), unravelling the constitutive law of the material hence explaining its nature altogether, placing the method in what is known as eXplainable Artificial Intelligence (XAI). ",
    "url": "https://arxiv.org/abs/2308.03915",
    "authors": [
      "Javier Orera-Echeverria",
      "Jacobo Ayensa-Jiménez",
      "Manuel Doblare"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2308.03929",
    "title": "Establishing Trust in ChatGPT BioMedical Generated Text: An  Ontology-Based Knowledge Graph to Validate Disease-Symptom Links",
    "abstract": "Methods: Through an innovative approach, we construct ontology-based knowledge graphs from authentic medical literature and AI-generated content. Our goal is to distinguish factual information from unverified data. We compiled two datasets: one from biomedical literature using a \"human disease and symptoms\" query, and another generated by ChatGPT, simulating articles. With these datasets (PubMed and ChatGPT), we curated 10 sets of 250 abstracts each, selected randomly with a specific seed. Our method focuses on utilizing disease ontology (DOID) and symptom ontology (SYMP) to build knowledge graphs, robust mathematical models that facilitate unbiased comparisons. By employing our fact-checking algorithms and network centrality metrics, we conducted GPT disease-symptoms link analysis to quantify the accuracy of factual knowledge amid noise, hypotheses, and significant findings. Results: The findings obtained from the comparison of diverse ChatGPT knowledge graphs with their PubMed counterparts revealed some interesting observations. While PubMed knowledge graphs exhibit a wealth of disease-symptom terms, it is surprising to observe that some ChatGPT graphs surpass them in the number of connections. Furthermore, some GPT graphs are demonstrating supremacy of the centrality scores, especially for the overlapping nodes. This striking contrast indicates the untapped potential of knowledge that can be derived from AI-generated content, awaiting verification. Out of all the graphs, the factual link ratio between any two graphs reached its peak at 60%. Conclusions: An intriguing insight from our findings was the striking number of links among terms in the knowledge graph generated from ChatGPT datasets, surpassing some of those in its PubMed counterpart. This early discovery has prompted further investigation using universal network metrics to unveil the new knowledge the links may hold. ",
    "url": "https://arxiv.org/abs/2308.03929",
    "authors": [
      "Ahmed Abdeen Hamed",
      "Alessandro Crimi",
      "Magdalena M. Misiak",
      "Byung Suk Lee"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.03939",
    "title": "Deterministic Neural Illumination Mapping for Efficient Auto-White  Balance Correction",
    "abstract": "Auto-white balance (AWB) correction is a critical operation in image signal processors for accurate and consistent color correction across various illumination scenarios. This paper presents a novel and efficient AWB correction method that achieves at least 35 times faster processing with equivalent or superior performance on high-resolution images for the current state-of-the-art methods. Inspired by deterministic color style transfer, our approach introduces deterministic illumination color mapping, leveraging learnable projection matrices for both canonical illumination form and AWB-corrected output. It involves feeding high-resolution images and corresponding latent representations into a mapping module to derive a canonical form, followed by another mapping module that maps the pixel values to those for the corrected version. This strategy is designed as resolution-agnostic and also enables seamless integration of any pre-trained AWB network as the backbone. Experimental results confirm the effectiveness of our approach, revealing significant performance improvements and reduced time complexity compared to state-of-the-art methods. Our method provides an efficient deep learning-based AWB correction solution, promising real-time, high-quality color correction for digital imaging applications. Source code is available at https://github.com/birdortyedi/DeNIM/ ",
    "url": "https://arxiv.org/abs/2308.03939",
    "authors": [
      "Furkan Kınlı",
      "Doğa Yılmaz",
      "Barış Özcan",
      "Furkan Kıraç"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.03944",
    "title": "GraPhSyM: Graph Physical Synthesis Model",
    "abstract": "In this work, we introduce GraPhSyM, a Graph Attention Network (GATv2) model for fast and accurate estimation of post-physical synthesis circuit delay and area metrics from pre-physical synthesis circuit netlists. Once trained, GraPhSyM provides accurate visibility of final design metrics to early EDA stages, such as logic synthesis, without running the slow physical synthesis flow, enabling global co-optimization across stages. Additionally, the swift and precise feedback provided by GraPhSym is instrumental for machine-learning-based EDA optimization frameworks. Given a gate-level netlist of a circuit represented as a graph, GraPhSyM utilizes graph structure, connectivity, and electrical property features to predict the impact of physical synthesis transformations such as buffer insertion and gate sizing. When trained on a dataset of 6000 prefix adder designs synthesized at an aggressive delay target, GraPhSyM can accurately predict the post-synthesis delay (98.3%) and area (96.1%) metrics of unseen adders with a fast 0.22s inference time. Furthermore, we illustrate the compositionality of GraPhSyM by employing the model trained on a fixed delay target to accurately anticipate post-synthesis metrics at a variety of unseen delay targets. Lastly, we report promising generalization capabilities of the GraPhSyM model when it is evaluated on circuits different from the adders it was exclusively trained on. The results show the potential for GraPhSyM to serve as a powerful tool for advanced optimization techniques and as an oracle for EDA machine learning frameworks. ",
    "url": "https://arxiv.org/abs/2308.03944",
    "authors": [
      "Ahmed Agiza",
      "Rajarshi Roy",
      "Teodor Dumitru Ene",
      "Saad Godil",
      "Sherief Reda",
      "Bryan Catanzaro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2308.03945",
    "title": "The Prospect of Enhancing Large-Scale Heterogeneous Federated Learning  with Transformers",
    "abstract": "Federated learning (FL) addresses data privacy concerns by enabling collaborative training of AI models across distributed data owners. Wide adoption of FL faces the fundamental challenges of data heterogeneity and the large scale of data owners involved. In this paper, we investigate the prospect of Transformer-based FL models for achieving generalization and personalization in this setting. We conduct extensive comparative experiments involving FL with Transformers, ResNet, and personalized ResNet-based FL approaches under various scenarios. These experiments consider varying numbers of data owners to demonstrate Transformers' advantages over deep neural networks in large-scale heterogeneous FL tasks. In addition, we analyze the superior performance of Transformers by comparing the Centered Kernel Alignment (CKA) representation similarity across different layers and FL models to gain insight into the reasons behind their promising capabilities. ",
    "url": "https://arxiv.org/abs/2308.03945",
    "authors": [
      "Yulan Gao",
      "Hao Sun",
      "Zengxiang Li",
      "Han Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.03956",
    "title": "Fixed Inter-Neuron Covariability Induces Adversarial Robustness",
    "abstract": "The vulnerability to adversarial perturbations is a major flaw of Deep Neural Networks (DNNs) that raises question about their reliability when in real-world scenarios. On the other hand, human perception, which DNNs are supposed to emulate, is highly robust to such perturbations, indicating that there may be certain features of the human perception that make it robust but are not represented in the current class of DNNs. One such feature is that the activity of biological neurons is correlated and the structure of this correlation tends to be rather rigid over long spans of times, even if it hampers performance and learning. We hypothesize that integrating such constraints on the activations of a DNN would improve its adversarial robustness, and, to test this hypothesis, we have developed the Self-Consistent Activation (SCA) layer, which comprises of neurons whose activations are consistent with each other, as they conform to a fixed, but learned, covariability pattern. When evaluated on image and sound recognition tasks, the models with a SCA layer achieved high accuracy, and exhibited significantly greater robustness than multi-layer perceptron models to state-of-the-art Auto-PGD adversarial attacks \\textit{without being trained on adversarially perturbed data ",
    "url": "https://arxiv.org/abs/2308.03956",
    "authors": [
      "Muhammad Ahmed Shah",
      "Bhiksha Raj"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2308.03961",
    "title": "A Benchmarking Study of Matching Algorithms for Knowledge Graph Entity  Alignment",
    "abstract": "How to identify those equivalent entities between knowledge graphs (KGs), which is called Entity Alignment (EA), is a long-standing challenge. So far, many methods have been proposed, with recent focus on leveraging Deep Learning to solve this problem. However, we observe that most of the efforts has been paid to having better representation of entities, rather than improving entity matching from the learned representations. In fact, how to efficiently infer the entity pairs from this similarity matrix, which is essentially a matching problem, has been largely ignored by the community. Motivated by this observation, we conduct an in-depth analysis on existing algorithms that are particularly designed for solving this matching problem, and propose a novel matching method, named Bidirectional Matching (BMat). Our extensive experimental results on public datasets indicate that there is currently no single silver bullet solution for EA. In other words, different classes of entity similarity estimation may require different matching algorithms to reach the best EA results for each class. We finally conclude that using PARIS, the state-of-the-art EA approach, with BMat gives the best combination in terms of EA performance and the algorithm's time and space complexity. ",
    "url": "https://arxiv.org/abs/2308.03961",
    "authors": [
      "Nhat-Minh Dao",
      "Thai V. Hoang",
      "Zonghua Zhang"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2308.03966",
    "title": "An Approximate Dynamic Programming Approach to Vehicle Platooning  Coordination in Networks",
    "abstract": "Platooning connected and autonomous vehicles (CAVs) provide significant benefits in terms of traffic efficiency and fuel economy. However, most existing platooning systems assume the availability of pre-determined plans, which is not feasible in real-time scenarios. In this paper, we address this issue in time-dependent networks by formulating a Markov decision process at each junction, aiming to minimize travel time and fuel consumption. Initially, we analyze coordinated platooning without routing to explore the cooperation among controllers on an identical path. We propose two novel approaches based on approximate dynamic programming, offering suboptimal control in the context of a stochastic finite horizon problem. The results demonstrate the superiority of the approximation in the policy space. Furthermore, we investigate platooning in a network setting, where speed profiles and routes are determined simultaneously. To simplify the problem, we decouple the action space by prioritizing routing decisions based on travel time estimation. We subsequently employ the aforementioned policy approximation to determine speed profiles, considering essential parameters such as travel times. Our simulation results in SUMO indicate that our method yields better performance than conventional approaches, leading to potential travel cost savings of up to 40%. Additionally, we evaluate the resilience of our approach in dynamically changing networks, affirming its ability to maintain efficient platooning operations. ",
    "url": "https://arxiv.org/abs/2308.03966",
    "authors": [
      "Xi Xiong",
      "Maonan Wang",
      "Dengfeng Sun",
      "Li Jin"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.03970",
    "title": "Optimal partitioning of directed acyclic graphs with dependent costs  between clusters",
    "abstract": "Many statistical inference contexts, including Bayesian Networks (BNs), Markov processes and Hidden Markov Models (HMMS) could be supported by partitioning (i.e.~mapping) the underlying Directed Acyclic Graph (DAG) into clusters. However, optimal partitioning is challenging, especially in statistical inference as the cost to be optimised is dependent on both nodes within a cluster, and the mapping of clusters connected via parent and/or child nodes, which we call dependent clusters. We propose a novel algorithm called DCMAP for optimal cluster mapping with dependent clusters. Given an arbitrarily defined, positive cost function based on the DAG and cluster mappings, we show that DCMAP converges to find all optimal clusters, and returns near-optimal solutions along the way. Empirically, we find that the algorithm is time-efficient for a DBN model of a seagrass complex system using a computation cost function. For a 25 and 50-node DBN, the search space size was $9.91\\times 10^9$ and $1.51\\times10^{21}$ possible cluster mappings, respectively, but near-optimal solutions with 88\\% and 72\\% similarity to the optimal solution were found at iterations 170 and 865, respectively. The first optimal solution was found at iteration 934 $(\\text{95\\% CI } 926,971)$, and 2256 $(2150,2271)$ with a cost that was 4\\% and 0.2\\% of the naive heuristic cost, respectively. ",
    "url": "https://arxiv.org/abs/2308.03970",
    "authors": [
      "Paul Pao-Yen Wu",
      "Fabrizio Rggeri",
      "Kerrie Mengersen"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.03975",
    "title": "Prompted Contrast with Masked Motion Modeling: Towards Versatile 3D  Action Representation Learning",
    "abstract": "Self-supervised learning has proved effective for skeleton-based human action understanding, which is an important yet challenging topic. Previous works mainly rely on contrastive learning or masked motion modeling paradigm to model the skeleton relations. However, the sequence-level and joint-level representation learning cannot be effectively and simultaneously handled by these methods. As a result, the learned representations fail to generalize to different downstream tasks. Moreover, combining these two paradigms in a naive manner leaves the synergy between them untapped and can lead to interference in training. To address these problems, we propose Prompted Contrast with Masked Motion Modeling, PCM$^{\\rm 3}$, for versatile 3D action representation learning. Our method integrates the contrastive learning and masked prediction tasks in a mutually beneficial manner, which substantially boosts the generalization capacity for various downstream tasks. Specifically, masked prediction provides novel training views for contrastive learning, which in turn guides the masked prediction training with high-level semantic information. Moreover, we propose a dual-prompted multi-task pretraining strategy, which further improves model representations by reducing the interference caused by learning the two different pretext tasks. Extensive experiments on five downstream tasks under three large-scale datasets are conducted, demonstrating the superior generalization capacity of PCM$^{\\rm 3}$ compared to the state-of-the-art works. Our project is publicly available at: https://jhang2020.github.io/Projects/PCM3/PCM3.html . ",
    "url": "https://arxiv.org/abs/2308.03975",
    "authors": [
      "Jiahang Zhang",
      "Lilang Lin",
      "Jiaying Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.03977",
    "title": "PUG: Photorealistic and Semantically Controllable Synthetic Data for  Representation Learning",
    "abstract": "Synthetic image datasets offer unmatched advantages for designing and evaluating deep neural networks: they make it possible to (i) render as many data samples as needed, (ii) precisely control each scene and yield granular ground truth labels (and captions), (iii) precisely control distribution shifts between training and testing to isolate variables of interest for sound experimentation. Despite such promise, the use of synthetic image data is still limited -- and often played down -- mainly due to their lack of realism. Most works therefore rely on datasets of real images, which have often been scraped from public images on the internet, and may have issues with regards to privacy, bias, and copyright, while offering little control over how objects precisely appear. In this work, we present a path to democratize the use of photorealistic synthetic data: we develop a new generation of interactive environments for representation learning research, that offer both controllability and realism. We use the Unreal Engine, a powerful game engine well known in the entertainment industry, to produce PUG (Photorealistic Unreal Graphics) environments and datasets for representation learning. In this paper, we demonstrate the potential of PUG to enable more rigorous evaluations of vision models. ",
    "url": "https://arxiv.org/abs/2308.03977",
    "authors": [
      "Florian Bordes",
      "Shashank Shekhar",
      "Mark Ibrahim",
      "Diane Bouchacourt",
      "Pascal Vincent",
      "Ari S. Morcos"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.03982",
    "title": "PARTNER: Level up the Polar Representation for LiDAR 3D Object Detection",
    "abstract": "Recently, polar-based representation has shown promising properties in perceptual tasks. In addition to Cartesian-based approaches, which separate point clouds unevenly, representing point clouds as polar grids has been recognized as an alternative due to (1) its advantage in robust performance under different resolutions and (2) its superiority in streaming-based approaches. However, state-of-the-art polar-based detection methods inevitably suffer from the feature distortion problem because of the non-uniform division of polar representation, resulting in a non-negligible performance gap compared to Cartesian-based approaches. To tackle this issue, we present PARTNER, a novel 3D object detector in the polar coordinate. PARTNER alleviates the dilemma of feature distortion with global representation re-alignment and facilitates the regression by introducing instance-level geometric information into the detection head. Extensive experiments show overwhelming advantages in streaming-based detection and different resolutions. Furthermore, our method outperforms the previous polar-based works with remarkable margins of 3.68% and 9.15% on Waymo and ONCE validation set, thus achieving competitive results over the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2308.03982",
    "authors": [
      "Ming Nie",
      "Yujing Xue",
      "Chunwei Wang",
      "Chaoqiang Ye",
      "Hang Xu",
      "Xinge Zhu",
      "Qingqiu Huang",
      "Michael Bi Mi",
      "Xinchao Wang",
      "Li Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.03985",
    "title": "Fourier neural operator for real-time simulation of 3D dynamic urban  microclimate",
    "abstract": "Global urbanization has underscored the significance of urban microclimates for human comfort, health, and building/urban energy efficiency. They profoundly influence building design and urban planning as major environmental impacts. Understanding local microclimates is essential for cities to prepare for climate change and effectively implement resilience measures. However, analyzing urban microclimates requires considering a complex array of outdoor parameters within computational domains at the city scale over a longer period than indoors. As a result, numerical methods like Computational Fluid Dynamics (CFD) become computationally expensive when evaluating the impact of urban microclimates. The rise of deep learning techniques has opened new opportunities for accelerating the modeling of complex non-linear interactions and system dynamics. Recently, the Fourier Neural Operator (FNO) has been shown to be very promising in accelerating solving the Partial Differential Equations (PDEs) and modeling fluid dynamic systems. In this work, we apply the FNO network for real-time three-dimensional (3D) urban wind field simulation. The training and testing data are generated from CFD simulation of the urban area, based on the semi-Lagrangian approach and fractional stepping method to simulate urban microclimate features for modeling large-scale urban problems. Numerical experiments show that the FNO model can accurately reconstruct the instantaneous spatial velocity field. We further evaluate the trained FNO model on unseen data with different wind directions, and the results show that the FNO model can generalize well on different wind directions. More importantly, the FNO approach can make predictions within milliseconds on the graphics processing unit, making real-time simulation of 3D dynamic urban microclimate possible. ",
    "url": "https://arxiv.org/abs/2308.03985",
    "authors": [
      "Wenhui Peng",
      "Shaoxiang Qin",
      "Senwen Yang",
      "Jianchun Wang",
      "Xue Liu",
      "Liangzhu",
      "Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2308.03995",
    "title": "Cooperative Multi-Type Multi-Agent Deep Reinforcement Learning for  Resource Management in Space-Air-Ground Integrated Networks",
    "abstract": "The Space-Air-Ground Integrated Network (SAGIN), integrating heterogeneous devices including low earth orbit (LEO) satellites, unmanned aerial vehicles (UAVs), and ground users (GUs), holds significant promise for advancing smart city applications. However, resource management of the SAGIN is a challenge requiring urgent study in that inappropriate resource management will cause poor data transmission, and hence affect the services in smart cities. In this paper, we develop a comprehensive SAGIN system that encompasses five distinct communication links and propose an efficient cooperative multi-type multi-agent deep reinforcement learning (CMT-MARL) method to address the resource management issue. The experimental results highlight the efficacy of the proposed CMT-MARL, as evidenced by key performance indicators such as the overall transmission rate and transmission success rate. These results underscore the potential value and feasibility of future implementation of the SAGIN. ",
    "url": "https://arxiv.org/abs/2308.03995",
    "authors": [
      "Hengxi Zhang",
      "Huaze Tang",
      "Wenbo Ding",
      "Xiao-Ping Zhang"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.03998",
    "title": "Real-time Strawberry Detection Based on Improved YOLOv5s Architecture  for Robotic Harvesting in open-field environment",
    "abstract": "This study proposed a YOLOv5-based custom object detection model to detect strawberries in an outdoor environment. The original architecture of the YOLOv5s was modified by replacing the C3 module with the C2f module in the backbone network, which provided a better feature gradient flow. Secondly, the Spatial Pyramid Pooling Fast in the final layer of the backbone network of YOLOv5s was combined with Cross Stage Partial Net to improve the generalization ability over the strawberry dataset in this study. The proposed architecture was named YOLOv5s-Straw. The RGB images dataset of the strawberry canopy with three maturity classes (immature, nearly mature, and mature) was collected in open-field environment and augmented through a series of operations including brightness reduction, brightness increase, and noise adding. To verify the superiority of the proposed method for strawberry detection in open-field environment, four competitive detection models (YOLOv3-tiny, YOLOv5s, YOLOv5s-C2f, and YOLOv8s) were trained, and tested under the same computational environment and compared with YOLOv5s-Straw. The results showed that the highest mean average precision of 80.3% was achieved using the proposed architecture whereas the same was achieved with YOLOv3-tiny, YOLOv5s, YOLOv5s-C2f, and YOLOv8s were 73.4%, 77.8%, 79.8%, 79.3%, respectively. Specifically, the average precision of YOLOv5s-Straw was 82.1% in the immature class, 73.5% in the nearly mature class, and 86.6% in the mature class, which were 2.3% and 3.7%, respectively, higher than that of the latest YOLOv8s. The model included 8.6*10^6 network parameters with an inference speed of 18ms per image while the inference speed of YOLOv8s had a slower inference speed of 21.0ms and heavy parameters of 11.1*10^6, which indicates that the proposed model is fast enough for real time strawberry detection and localization for the robotic picking. ",
    "url": "https://arxiv.org/abs/2308.03998",
    "authors": [
      "Zixuan He",
      "Salik Ram Khana",
      "Xin Zhang",
      "Manoj Karkee",
      "Qin Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04003",
    "title": "Low-complexity Resource Allocation for User Paired RSMA in Future 6G  Wireless Networks",
    "abstract": "Rate-splitting multiple access (RSMA) uplink requires optimization of decoding order and power allocation, while decoding order is a discrete variable, and it is very complex to find the optimal decoding order if the number of users is large enough. This letter proposes a low-complexity user pairing-based resource allocation algorithm with the objective of minimizing the maximum latency, which significantly reduces the computational complexity and also achieves similar performance to unpaired uplink RSMA. A closed-form expression for power and bandwidth allocation is first derived, and then a bisection method is used to determine the optimal resource allocation. Finally, the proposed algorithm is compared with unpaired RSMA, paired NOMA and unpaired NOMA. The results demonstrate the effectiveness of the proposed algorithm. ",
    "url": "https://arxiv.org/abs/2308.04003",
    "authors": [
      "Jiewen Hu",
      "Gang Liu",
      "Zheng Ma",
      "Ming Xiao",
      "Pingzhi Fan"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.04008",
    "title": "Coarse-to-Fine: Learning Compact Discriminative Representation for  Single-Stage Image Retrieval",
    "abstract": "Image retrieval targets to find images from a database that are visually similar to the query image. Two-stage methods following retrieve-and-rerank paradigm have achieved excellent performance, but their separate local and global modules are inefficient to real-world applications. To better trade-off retrieval efficiency and accuracy, some approaches fuse global and local feature into a joint representation to perform single-stage image retrieval. However, they are still challenging due to various situations to tackle, $e.g.$, background, occlusion and viewpoint. In this work, we design a Coarse-to-Fine framework to learn Compact Discriminative representation (CFCD) for end-to-end single-stage image retrieval-requiring only image-level labels. Specifically, we first design a novel adaptive softmax-based loss which dynamically tunes its scale and margin within each mini-batch and increases them progressively to strengthen supervision during training and intra-class compactness. Furthermore, we propose a mechanism which attentively selects prominent local descriptors and infuse fine-grained semantic relations into the global representation by a hard negative sampling strategy to optimize inter-class distinctiveness at a global scale. Extensive experimental results have demonstrated the effectiveness of our method, which achieves state-of-the-art single-stage image retrieval performance on benchmarks such as Revisited Oxford and Revisited Paris. Code is available at https://github.com/bassyess/CFCD. ",
    "url": "https://arxiv.org/abs/2308.04008",
    "authors": [
      "Yunquan Zhu",
      "Xinkai Gao",
      "Bo Ke",
      "Ruizhi Qiao",
      "Xing Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04011",
    "title": "Generalization bound for estimating causal effects from observational  network data",
    "abstract": "Estimating causal effects from observational network data is a significant but challenging problem. Existing works in causal inference for observational network data lack an analysis of the generalization bound, which can theoretically provide support for alleviating the complex confounding bias and practically guide the design of learning objectives in a principled manner. To fill this gap, we derive a generalization bound for causal effect estimation in network scenarios by exploiting 1) the reweighting schema based on joint propensity score and 2) the representation learning schema based on Integral Probability Metric (IPM). We provide two perspectives on the generalization bound in terms of reweighting and representation learning, respectively. Motivated by the analysis of the bound, we propose a weighting regression method based on the joint propensity score augmented with representation learning. Extensive experimental studies on two real-world networks with semi-synthetic data demonstrate the effectiveness of our algorithm. ",
    "url": "https://arxiv.org/abs/2308.04011",
    "authors": [
      "Ruichu Cai",
      "Zeqin Yang",
      "Weilin Chen",
      "Yuguang Yan",
      "Zhifeng Hao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2308.04013",
    "title": "Distributed Target Tracking with Fading Channels over Underwater  Wireless Sensor Networks",
    "abstract": "This paper investigates the problem of distributed target tracking via underwater wireless sensor networks (UWSNs) with fading channels. The degradation of signal quality due to wireless channel fading can significantly impact network reliability and subsequently reduce the tracking accuracy. To address this issue, we propose a modified distributed unscented Kalman filter (DUKF) named DUKF-Fc, which takes into account the effects of measurement fluctuation and transmission failure induced by channel fading. The channel estimation error is also considered when designing the estimator and a sufficient condition is established to ensure the stochastic boundedness of the estimation error. The proposed filtering scheme is versatile and possesses wide applicability to numerous real-world scenarios, e.g., tracking a maneuvering underwater target with acoustic sensors. Simulation results demonstrate the effectiveness of the proposed filtering algorithm. In addition, considering the constraints of network energy resources, the issue of investigating a trade-off between tracking performance and energy consumption is discussed accordingly. ",
    "url": "https://arxiv.org/abs/2308.04013",
    "authors": [
      "Miaoyi Tang",
      "Meiqin Liu",
      "Senlin Zhang",
      "Ronghao Zheng",
      "Shanling Dong"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2308.04018",
    "title": "Improving Performance of Semi-Supervised Learning by Adversarial Attacks",
    "abstract": "Semi-supervised learning (SSL) algorithm is a setup built upon a realistic assumption that access to a large amount of labeled data is tough. In this study, we present a generalized framework, named SCAR, standing for Selecting Clean samples with Adversarial Robustness, for improving the performance of recent SSL algorithms. By adversarially attacking pre-trained models with semi-supervision, our framework shows substantial advances in classifying images. We introduce how adversarial attacks successfully select high-confident unlabeled data to be labeled with current predictions. On CIFAR10, three recent SSL algorithms with SCAR result in significantly improved image classification. ",
    "url": "https://arxiv.org/abs/2308.04018",
    "authors": [
      "Dongyoon Yang",
      "Kunwoong Kim",
      "Yongdai Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04020",
    "title": "Synthetic Augmentation with Large-scale Unconditional Pre-training",
    "abstract": "Deep learning based medical image recognition systems often require a substantial amount of training data with expert annotations, which can be expensive and time-consuming to obtain. Recently, synthetic augmentation techniques have been proposed to mitigate the issue by generating realistic images conditioned on class labels. However, the effectiveness of these methods heavily depends on the representation capability of the trained generative model, which cannot be guaranteed without sufficient labeled training data. To further reduce the dependency on annotated data, we propose a synthetic augmentation method called HistoDiffusion, which can be pre-trained on large-scale unlabeled datasets and later applied to a small-scale labeled dataset for augmented training. In particular, we train a latent diffusion model (LDM) on diverse unlabeled datasets to learn common features and generate realistic images without conditional inputs. Then, we fine-tune the model with classifier guidance in latent space on an unseen labeled dataset so that the model can synthesize images of specific categories. Additionally, we adopt a selective mechanism to only add synthetic samples with high confidence of matching to target labels. We evaluate our proposed method by pre-training on three histopathology datasets and testing on a histopathology dataset of colorectal cancer (CRC) excluded from the pre-training datasets. With HistoDiffusion augmentation, the classification accuracy of a backbone classifier is remarkably improved by 6.4% using a small set of the original labels. Our code is available at https://github.com/karenyyy/HistoDiffAug. ",
    "url": "https://arxiv.org/abs/2308.04020",
    "authors": [
      "Jiarong Ye",
      "Haomiao Ni",
      "Peng Jin",
      "Sharon X. Huang",
      "Yuan Xue"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04039",
    "title": "Implicit neural representations for joint decomposition and registration  of gene expression images in the marmoset brain",
    "abstract": "We propose a novel image registration method based on implicit neural representations that addresses the challenging problem of registering a pair of brain images with similar anatomical structures, but where one image contains additional features or artifacts that are not present in the other image. To demonstrate its effectiveness, we use 2D microscopy $\\textit{in situ}$ hybridization gene expression images of the marmoset brain. Accurately quantifying gene expression requires image registration to a brain template, which is difficult due to the diversity of patterns causing variations in visible anatomical brain structures. Our approach uses implicit networks in combination with an image exclusion loss to jointly perform the registration and decompose the image into a support and residual image. The support image aligns well with the template, while the residual image captures individual image characteristics that diverge from the template. In experiments, our method provided excellent results and outperformed other registration techniques. ",
    "url": "https://arxiv.org/abs/2308.04039",
    "authors": [
      "Michal Byra",
      "Charissa Poon",
      "Tomomi Shimogori",
      "Henrik Skibbe"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04047",
    "title": "SODFormer: Streaming Object Detection with Transformer Using Events and  Frames",
    "abstract": "DAVIS camera, streaming two complementary sensing modalities of asynchronous events and frames, has gradually been used to address major object detection challenges (e.g., fast motion blur and low-light). However, how to effectively leverage rich temporal cues and fuse two heterogeneous visual streams remains a challenging endeavor. To address this challenge, we propose a novel streaming object detector with Transformer, namely SODFormer, which first integrates events and frames to continuously detect objects in an asynchronous manner. Technically, we first build a large-scale multimodal neuromorphic object detection dataset (i.e., PKU-DAVIS-SOD) over 1080.1k manual labels. Then, we design a spatiotemporal Transformer architecture to detect objects via an end-to-end sequence prediction problem, where the novel temporal Transformer module leverages rich temporal cues from two visual streams to improve the detection performance. Finally, an asynchronous attention-based fusion module is proposed to integrate two heterogeneous sensing modalities and take complementary advantages from each end, which can be queried at any time to locate objects and break through the limited output frequency from synchronized frame-based fusion strategies. The results show that the proposed SODFormer outperforms four state-of-the-art methods and our eight baselines by a significant margin. We also show that our unifying framework works well even in cases where the conventional frame-based camera fails, e.g., high-speed motion and low-light conditions. Our dataset and code can be available at https://github.com/dianzl/SODFormer. ",
    "url": "https://arxiv.org/abs/2308.04047",
    "authors": [
      "Dianze Li",
      "Jianing Li",
      "Yonghong Tian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.04054",
    "title": "An Empirical Analysis of Range for 3D Object Detection",
    "abstract": "LiDAR-based 3D detection plays a vital role in autonomous navigation. Surprisingly, although autonomous vehicles (AVs) must detect both near-field objects (for collision avoidance) and far-field objects (for longer-term planning), contemporary benchmarks focus only on near-field 3D detection. However, AVs must detect far-field objects for safe navigation. In this paper, we present an empirical analysis of far-field 3D detection using the long-range detection dataset Argoverse 2.0 to better understand the problem, and share the following insight: near-field LiDAR measurements are dense and optimally encoded by small voxels, while far-field measurements are sparse and are better encoded with large voxels. We exploit this observation to build a collection of range experts tuned for near-vs-far field detection, and propose simple techniques to efficiently ensemble models for long-range detection that improve efficiency by 33% and boost accuracy by 3.2% CDS. ",
    "url": "https://arxiv.org/abs/2308.04054",
    "authors": [
      "Neehar Peri",
      "Mengtian Li",
      "Benjamin Wilson",
      "Yu-Xiong Wang",
      "James Hays",
      "Deva Ramanan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.04061",
    "title": "Enhancing Adversarial Robustness in Low-Label Regime via Adaptively  Weighted Regularization and Knowledge Distillation",
    "abstract": "Adversarial robustness is a research area that has recently received a lot of attention in the quest for trustworthy artificial intelligence. However, recent works on adversarial robustness have focused on supervised learning where it is assumed that labeled data is plentiful. In this paper, we investigate semi-supervised adversarial training where labeled data is scarce. We derive two upper bounds for the robust risk and propose a regularization term for unlabeled data motivated by these two upper bounds. Then, we develop a semi-supervised adversarial training algorithm that combines the proposed regularization term with knowledge distillation using a semi-supervised teacher (i.e., a teacher model trained using a semi-supervised learning algorithm). Our experiments show that our proposed algorithm achieves state-of-the-art performance with significant margins compared to existing algorithms. In particular, compared to supervised learning algorithms, performance of our proposed algorithm is not much worse even when the amount of labeled data is very small. For example, our algorithm with only 8\\% labeled data is comparable to supervised adversarial training algorithms that use all labeled data, both in terms of standard and robust accuracies on CIFAR-10. ",
    "url": "https://arxiv.org/abs/2308.04061",
    "authors": [
      "Dongyoon Yang",
      "Insung Kong",
      "Yongdai Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04073",
    "title": "Learning Specialized Activation Functions for Physics-informed Neural  Networks",
    "abstract": "Physics-informed neural networks (PINNs) are known to suffer from optimization difficulty. In this work, we reveal the connection between the optimization difficulty of PINNs and activation functions. Specifically, we show that PINNs exhibit high sensitivity to activation functions when solving PDEs with distinct properties. Existing works usually choose activation functions by inefficient trial-and-error. To avoid the inefficient manual selection and to alleviate the optimization difficulty of PINNs, we introduce adaptive activation functions to search for the optimal function when solving different problems. We compare different adaptive activation functions and discuss their limitations in the context of PINNs. Furthermore, we propose to tailor the idea of learning combinations of candidate activation functions to the PINNs optimization, which has a higher requirement for the smoothness and diversity on learned functions. This is achieved by removing activation functions which cannot provide higher-order derivatives from the candidate set and incorporating elementary functions with different properties according to our prior knowledge about the PDE at hand. We further enhance the search space with adaptive slopes. The proposed adaptive activation function can be used to solve different PDE systems in an interpretable way. Its effectiveness is demonstrated on a series of benchmarks. Code is available at https://github.com/LeapLabTHU/AdaAFforPINNs. ",
    "url": "https://arxiv.org/abs/2308.04073",
    "authors": [
      "Honghui Wang",
      "Lu Lu",
      "Shiji Song",
      "Gao Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2308.04083",
    "title": "Heterogeneous 360 Degree Videos in Metaverse: Differentiated  Reinforcement Learning Approaches",
    "abstract": "Advanced video technologies are driving the development of the futuristic Metaverse, which aims to connect users from anywhere and anytime. As such, the use cases for users will be much more diverse, leading to a mix of 360-degree videos with two types: non-VR and VR 360-degree videos. This paper presents a novel Quality of Service model for heterogeneous 360-degree videos with different requirements for frame rates and cybersickness. We propose a frame-slotted structure and conduct frame-wise optimization using self-designed differentiated deep reinforcement learning algorithms. Specifically, we design two structures, Separate Input Differentiated Output (SIDO) and Merged Input Differentiated Output (MIDO), for this heterogeneous scenario. We also conduct comprehensive experiments to demonstrate their effectiveness. ",
    "url": "https://arxiv.org/abs/2308.04083",
    "authors": [
      "Wenhan Yu",
      "Jun Zhao"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04100",
    "title": "The Still Secret Ballot: The Limited Privacy Cost of Transparent  Election Results",
    "abstract": "After an election, should election officials release an electronic record of each ballot? The release of such cast vote records could bolster the legitimacy of the certified result. But it may also facilitate vote revelation, where an analyst unravels the secret ballot by uniquely linking vote choices on the anonymous ballot to the voter's name and address in the public voter file. We provide the first empirical study of the extent of vote revelation under several possible election-reporting regimes, ranging from precinct-level results to the individual ballot records known as cast vote records. Using Maricopa County, Arizona, as a case study, we find that cast vote records could reveal less than 0.2% of any voters' choices in the 2020 general election. Perhaps counterintuitively, releasing cast vote records coded by precinct and vote method are no more revelatory than releasing aggregate vote tallies for each precinct and vote method. We conclude that cast vote records are sufficiently privacy-protecting, and suggest how the privacy violations that do remain could be reduced. ",
    "url": "https://arxiv.org/abs/2308.04100",
    "authors": [
      "Shiro Kuriwaki",
      "Jeffrey B. Lewis",
      "Michael Morse"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2308.04102",
    "title": "Asynchronous Evolution of Deep Neural Network Architectures",
    "abstract": "Many evolutionary algorithms (EAs) take advantage of parallel evaluation of candidates. However, if evaluation times vary significantly, many worker nodes (i.e.,\\ compute clients) are idle much of the time, waiting for the next generation to be created. Evolutionary neural architecture search (ENAS), a class of EAs that optimizes the architecture and hyperparameters of deep neural networks, is particularly vulnerable to this issue. This paper proposes a generic asynchronous evaluation strategy (AES) that is then adapted to work with ENAS. AES increases throughput by maintaining a queue of upto $K$ individuals ready to be sent to the workers for evaluation and proceeding to the next generation as soon as $M<<K$ individuals have been evaluated by the workers. A suitable value for $M$ is determined experimentally, balancing diversity and efficiency. To showcase the generality and power of AES, it was first evaluated in 11-bit multiplexer design (a single-population verifiable discovery task) and then scaled up to ENAS for image captioning (a multi-population open-ended-optimization task). In both problems, a multifold performance improvement was observed, suggesting that AES is a promising method for parallelizing the evolution of complex systems with long and variable evaluation times, such as those in ENAS. ",
    "url": "https://arxiv.org/abs/2308.04102",
    "authors": [
      "Jason Liang",
      "Hormoz Shahrzad",
      "Risto Miikkulainen"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04109",
    "title": "I-WAS: a Data Augmentation Method with GPT-2 for Simile Detection",
    "abstract": "Simile detection is a valuable task for many natural language processing (NLP)-based applications, particularly in the field of literature. However, existing research on simile detection often relies on corpora that are limited in size and do not adequately represent the full range of simile forms. To address this issue, we propose a simile data augmentation method based on \\textbf{W}ord replacement And Sentence completion using the GPT-2 language model. Our iterative process called I-WAS, is designed to improve the quality of the augmented sentences. To better evaluate the performance of our method in real-world applications, we have compiled a corpus containing a more diverse set of simile forms for experimentation. Our experimental results demonstrate the effectiveness of our proposed data augmentation method for simile detection. ",
    "url": "https://arxiv.org/abs/2308.04109",
    "authors": [
      "Yongzhu Chang",
      "Rongsheng Zhang",
      "Jiashu Pu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.04123",
    "title": "Twinning Commercial Radio Waveforms in the Colosseum Wireless Network  Emulator",
    "abstract": "Because of the ever-growing amount of wireless consumers, spectrum-sharing techniques have been increasingly common in the wireless ecosystem, with the main goal of avoiding harmful interference to coexisting communication systems. This is even more important when considering systems-such as nautical and aerial fleet radars-in which incumbent radios operate mission-critical communication links. To study, develop, and validate these solutions, adequate platforms, such as the Colosseum wireless network emulator, are key as they enable experimentation with spectrum-sharing heterogeneous radio technologies in controlled environments. In this work, we demonstrate how Colosseum can be used to twin commercial radio waveforms to evaluate the coexistence of such technologies in complex wireless propagation environments. To this aim, we create a high-fidelity spectrum-sharing scenario on Colosseum to evaluate the impact of twinned commercial radar waveforms on a cellular network operating in the CBRS band. Then, we leverage IQ samples collected on the testbed to train a machine learning agent that runs at the base station to detect the presence of incumbent radar transmissions and vacate the bandwidth to avoid causing them harmful interference. Our results show an average detection accuracy of 88%, with accuracy above 90% in SNR regimes above 0 dB and SINR regimes above -20 dB, and with an average detection time of 137 ms. ",
    "url": "https://arxiv.org/abs/2308.04123",
    "authors": [
      "Davide Villa",
      "Daniel Uvaydov",
      "Leonardo Bonati",
      "Pedram Johari",
      "Josep Miquel Jornet",
      "Tommaso Melodia"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.04124",
    "title": "Social Media, Topic Modeling and Sentiment Analysis in Municipal  Decision Support",
    "abstract": "Many cities around the world are aspiring to become. However, smart initiatives often give little weight to the opinions of average citizens. Social media are one of the most important sources of citizen opinions. This paper presents a prototype of a framework for processing social media posts with municipal decision-making in mind. The framework consists of a sequence of three steps: (1) determining the sentiment polarity of each social media post (2) identifying prevalent topics and mapping these topics to individual posts, and (3) aggregating these two pieces of information into a fuzzy number representing the overall sentiment expressed towards each topic. Optionally, the fuzzy number can be reduced into a tuple of two real numbers indicating the \"amount\" of positive and negative opinion expressed towards each topic. The framework is demonstrated on tweets published from Ostrava, Czechia over a period of about two months. This application illustrates how fuzzy numbers represent sentiment in a richer way and capture the diversity of opinions expressed on social media. ",
    "url": "https://arxiv.org/abs/2308.04124",
    "authors": [
      "Miloš Švaňa"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2308.04137",
    "title": "Comprehensive Assessment of the Performance of Deep Learning Classifiers  Reveals a Surprising Lack of Robustness",
    "abstract": "Reliable and robust evaluation methods are a necessary first step towards developing machine learning models that are themselves robust and reliable. Unfortunately, current evaluation protocols typically used to assess classifiers fail to comprehensively evaluate performance as they tend to rely on limited types of test data, and ignore others. For example, using the standard test data fails to evaluate the predictions made by the classifier to samples from classes it was not trained on. On the other hand, testing with data containing samples from unknown classes fails to evaluate how well the classifier can predict the labels for known classes. This article advocates bench-marking performance using a wide range of different types of data and using a single metric that can be applied to all such data types to produce a consistent evaluation of performance. Using such a benchmark it is found that current deep neural networks, including those trained with methods that are believed to produce state-of-the-art robustness, are extremely vulnerable to making mistakes on certain types of data. This means that such models will be unreliable in real-world scenarios where they may encounter data from many different domains, and that they are insecure as they can easily be fooled into making the wrong decisions. It is hoped that these results will motivate the wider adoption of more comprehensive testing methods that will, in turn, lead to the development of more robust machine learning methods in the future. Code is available at: \\url{https://codeberg.org/mwspratling/RobustnessEvaluation} ",
    "url": "https://arxiv.org/abs/2308.04137",
    "authors": [
      "Michael W. Spratling"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04142",
    "title": "Class-level Structural Relation Modelling and Smoothing for Visual  Representation Learning",
    "abstract": "Representation learning for images has been advanced by recent progress in more complex neural models such as the Vision Transformers and new learning theories such as the structural causal models. However, these models mainly rely on the classification loss to implicitly regularize the class-level data distributions, and they may face difficulties when handling classes with diverse visual patterns. We argue that the incorporation of the structural information between data samples may improve this situation. To achieve this goal, this paper presents a framework termed \\textbf{C}lass-level Structural Relation Modeling and Smoothing for Visual Representation Learning (CSRMS), which includes the Class-level Relation Modelling, Class-aware Graph Sampling, and Relational Graph-Guided Representation Learning modules to model a relational graph of the entire dataset and perform class-aware smoothing and regularization operations to alleviate the issue of intra-class visual diversity and inter-class similarity. Specifically, the Class-level Relation Modelling module uses a clustering algorithm to learn the data distributions in the feature space and identify three types of class-level sample relations for the training set; Class-aware Graph Sampling module extends typical training batch construction process with three strategies to sample dataset-level sub-graphs; and Relational Graph-Guided Representation Learning module employs a graph convolution network with knowledge-guided smoothing operations to ease the projection from different visual patterns to the same class. Experiments demonstrate the effectiveness of structured knowledge modelling for enhanced representation learning and show that CSRMS can be incorporated with any state-of-the-art visual representation learning models for performance gains. The source codes and demos have been released at https://github.com/czt117/CSRMS. ",
    "url": "https://arxiv.org/abs/2308.04142",
    "authors": [
      "Zitan Chen",
      "Zhuang Qi",
      "Xiao Cao",
      "Xiangxian Li",
      "Xiangxu Meng",
      "Lei Meng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04161",
    "title": "Current and Future Challenges in Knowledge Representation and Reasoning",
    "abstract": "Knowledge Representation and Reasoning is a central, longstanding, and active area of Artificial Intelligence. Over the years it has evolved significantly; more recently it has been challenged and complemented by research in areas such as machine learning and reasoning under uncertainty. In July 2022 a Dagstuhl Perspectives workshop was held on Knowledge Representation and Reasoning. The goal of the workshop was to describe the state of the art in the field, including its relation with other areas, its shortcomings and strengths, together with recommendations for future progress. We developed this manifesto based on the presentations, panels, working groups, and discussions that took place at the Dagstuhl Workshop. It is a declaration of our views on Knowledge Representation: its origins, goals, milestones, and current foci; its relation to other disciplines, especially to Artificial Intelligence; and on its challenges, along with key priorities for the next decade. ",
    "url": "https://arxiv.org/abs/2308.04161",
    "authors": [
      "James P. Delgrande",
      "Birte Glimm",
      "Thomas Meyer",
      "Miroslaw Truszczynski",
      "Frank Wolter"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04169",
    "title": "Dual input neural networks for positional sound source localization",
    "abstract": "In many signal processing applications, metadata may be advantageously used in conjunction with a high dimensional signal to produce a desired output. In the case of classical Sound Source Localization (SSL) algorithms, information from a high dimensional, multichannel audio signals received by many distributed microphones is combined with information describing acoustic properties of the scene, such as the microphones' coordinates in space, to estimate the position of a sound source. We introduce Dual Input Neural Networks (DI-NNs) as a simple and effective way to model these two data types in a neural network. We train and evaluate our proposed DI-NN on scenarios of varying difficulty and realism and compare it against an alternative architecture, a classical Least-Squares (LS) method as well as a classical Convolutional Recurrent Neural Network (CRNN). Our results show that the DI-NN significantly outperforms the baselines, achieving a five times lower localization error than the LS method and two times lower than the CRNN in a test dataset of real recordings. ",
    "url": "https://arxiv.org/abs/2308.04169",
    "authors": [
      "Eric Grinstein",
      "Vincent W. Neo",
      "Patrick A. Naylor"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2308.04170",
    "title": "DroidDissector: A Static and Dynamic Analysis Tool for Android Malware  Detection",
    "abstract": "DroidDissector is an extraction tool for both static and dynamic features. The aim is to provide Android malware researchers and analysts with an integrated tool that can extract all of the most widely used features in Android malware detection from one location. The static analysis module extracts features from both the manifest file and the source code of the application to obtain a broad array of features that include permissions, API call graphs and opcodes. The dynamic analysis module runs on the latest version of Android and analyses the complete behaviour of an application by tracking the system calls used, network traffic generated, API calls used and log files produced by the application. ",
    "url": "https://arxiv.org/abs/2308.04170",
    "authors": [
      "Ali Muzaffar",
      "Hani Ragab Hassen",
      "Hind Zantout",
      "Michael A Lones"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.04172",
    "title": "Predicting Drug-Drug Interactions Using Knowledge Graphs",
    "abstract": "In the last decades, people have been consuming and combining more drugs than before, increasing the number of Drug-Drug Interactions (DDIs). To predict unknown DDIs, recently, studies started incorporating Knowledge Graphs (KGs) since they are able to capture the relationships among entities providing better drug representations than using a single drug property. In this paper, we propose the medicX end-to-end framework that integrates several drug features from public drug repositories into a KG and embeds the nodes in the graph using various translation, factorisation and Neural Network (NN) based KG Embedding (KGE) methods. Ultimately, we use a Machine Learning (ML) algorithm that predicts unknown DDIs. Among the different translation and factorisation-based KGE models, we found that the best performing combination was the ComplEx embedding method with a Long Short-Term Memory (LSTM) network, which obtained an F1-score of 95.19% on a dataset based on the DDIs found in DrugBank version 5.1.8. This score is 5.61% better than the state-of-the-art model DeepDDI. Additionally, we also developed a graph auto-encoder model that uses a Graph Neural Network (GNN), which achieved an F1-score of 91.94%. Consequently, GNNs have demonstrated a stronger ability to mine the underlying semantics of the KG than the ComplEx model, and thus using higher dimension embeddings within the GNN can lead to state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2308.04172",
    "authors": [
      "Lizzy Farrugia",
      "Lilian M. Azzopardi",
      "Jeremy Debattista",
      "Charlie Abela"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04188",
    "title": "Image Copy-Move Forgery Detection via Deep Cross-Scale PatchMatch",
    "abstract": "The recently developed deep algorithms achieve promising progress in the field of image copy-move forgery detection (CMFD). However, they have limited generalizability in some practical scenarios, where the copy-move objects may not appear in the training images or cloned regions are from the background. To address the above issues, in this work, we propose a novel end-to-end CMFD framework by integrating merits from both conventional and deep methods. Specifically, we design a deep cross-scale patchmatch method tailored for CMFD to localize copy-move regions. In contrast to existing deep models, our scheme aims to seek explicit and reliable point-to-point matching between source and target regions using features extracted from high-resolution scales. Further, we develop a manipulation region location branch for source/target separation. The proposed CMFD framework is completely differentiable and can be trained in an end-to-end manner. Extensive experimental results demonstrate the high generalizability of our method to different copy-move contents, and the proposed scheme achieves significantly better performance than existing approaches. ",
    "url": "https://arxiv.org/abs/2308.04188",
    "authors": [
      "Yingjie He",
      "Yuanman Li",
      "Changsheng Chen",
      "Xia Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04207",
    "title": "Robust retrieval of material chemical states in X-ray microspectroscopy",
    "abstract": "X-ray microspectroscopic techniques are essential for studying morphological and chemical changes in materials, providing high-resolution structural and spectroscopic information. However, its practical data analysis for reliably retrieving the chemical states remains a major obstacle to accelerating the fundamental understanding of materials in many research fields. In this work, we propose a novel data formulation model for X-ray microspectroscopy and develop a dedicated unmixing framework to solve this problem, which is robust to noise and spectral variability. Moreover, this framework is not limited to the analysis of two-state material chemistry, making it an effective alternative to conventional and widely-used methods. In addition, an alternative directional multiplier method with provable convergence is applied to obtain the solution efficiently. Our framework can accurately identify and characterize chemical states in complex and heterogeneous samples, even under challenging conditions such as low signal-to-noise ratios and overlapping spectral features. Extensive experimental results on simulated and real datasets demonstrate its effectiveness and reliability. ",
    "url": "https://arxiv.org/abs/2308.04207",
    "authors": [
      "Ting Wang",
      "Xiaotong Wu",
      "Jizhou Li",
      "Chao Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04220",
    "title": "Semantic Interpretation and Validation of Graph Attention-based  Explanations for GNN Models",
    "abstract": "In this work, we propose a methodology for investigating the application of semantic attention to enhance the explainability of Graph Neural Network (GNN)-based models, introducing semantically-informed perturbations and establishing a correlation between predicted feature-importance weights and model accuracy. Graph Deep Learning (GDL) has emerged as a promising field for tasks like scene interpretation, leveraging flexible graph structures to concisely describe complex features and relationships. As traditional explainability methods used in eXplainable AI (XAI) cannot be directly applied to such structures, graph-specific approaches are introduced. Attention mechanisms have demonstrated their efficacy in estimating the importance of input features in deep learning models and thus have been previously employed to provide feature-based explanations for GNN predictions. Building upon these insights, we extend existing attention-based graph-explainability methods investigating the use of attention weights as importance indicators of semantically sorted feature sets. Through analysing the behaviour of predicted attention-weights distribution in correlation with model accuracy, we gain valuable insights into feature importance with respect to the behaviour of the GNN model. We apply our methodology to a lidar pointcloud estimation model successfully identifying key semantic classes that contribute to enhanced performance effectively generating reliable post-hoc semantic explanations. ",
    "url": "https://arxiv.org/abs/2308.04220",
    "authors": [
      "Efimia Panagiotaki",
      "Daniele De Martini",
      "Lars Kunze"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.04237",
    "title": "Federated Inference with Reliable Uncertainty Quantification over  Wireless Channels via Conformal Prediction",
    "abstract": "Consider a setting in which devices and a server share a pre-trained model. The server wishes to make an inference on a new input given the model. Devices have access to data, previously not used for training, and can communicate to the server over a common wireless channel. If the devices have no access to the new input, can communication from devices to the server enhance the quality of the inference decision at the server? Recent work has introduced federated conformal prediction (CP), which leverages devices-to-server communication to improve the reliability of the server's decision. With federated CP, devices communicate to the server information about the loss accrued by the shared pre-trained model on the local data, and the server leverages this information to calibrate a decision interval, or set, so that it is guaranteed to contain the correct answer with a pre-defined target reliability level. Previous work assumed noise-free communication, whereby devices can communicate a single real number to the server. In this paper, we study for the first time federated CP in a wireless setting. We introduce a novel protocol, termed wireless federated conformal prediction (WFCP), which builds on type-based multiple access (TBMA) and on a novel quantile correction strategy. WFCP is proved to provide formal reliability guarantees in terms of coverage of the predicted set produced by the server. Using numerical results, we demonstrate the significant advantages of WFCP against digital implementations of existing federated CP schemes, especially in regimes with limited communication resources and/or large number of devices. ",
    "url": "https://arxiv.org/abs/2308.04237",
    "authors": [
      "Meiyi Zhu",
      "Matteo Zecchin",
      "Sangwoo Park",
      "Caili Guo",
      "Chunyan Feng",
      "Osvaldo Simeone"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04259",
    "title": "Generalized Forgetting Recursive Least Squares: Stability and Robustness  Guarantees",
    "abstract": "This work present generalized forgetting recursive least squares (GF-RLS), a generalization of recursive least squares (RLS) that encompasses many extensions of RLS as special cases. First, sufficient conditions are presented for the 1) Lyapunov stability, 2) uniform Lyapunov stability, 3) global asymptotic stability, and 4) global uniform exponential stability of parameter estimation error in GF-RLS when estimating fixed parameters without noise. Second, robustness guarantees are derived for the estimation of time-varying parameters in the presence of measurement noise and regressor noise. These robustness guarantees are presented in terms of global uniform ultimate boundedness of the parameter estimation error. A specialization of this result gives a bound to the asymptotic bias of least squares estimators in the errors-in-variables problem. Lastly, a survey is presented to show how GF-RLS can be used to analyze various extensions of RLS from the literature. ",
    "url": "https://arxiv.org/abs/2308.04259",
    "authors": [
      "Brian Lai",
      "Dennis S. Bernstein"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.04266",
    "title": "MCDAN: a Multi-scale Context-enhanced Dynamic Attention Network for  Diffusion Prediction",
    "abstract": "Information diffusion prediction aims at predicting the target users in the information diffusion path on social networks. Prior works mainly focus on the observed structure or sequence of cascades, trying to predict to whom this cascade will be infected passively. In this study, we argue that user intent understanding is also a key part of information diffusion prediction. We thereby propose a novel Multi-scale Context-enhanced Dynamic Attention Network (MCDAN) to predict which user will most likely join the observed current cascades. Specifically, to consider the global interactive relationship among users, we take full advantage of user friendships and global cascading relationships, which are extracted from the social network and historical cascades, respectively. To refine the model's ability to understand the user's preference for the current cascade, we propose a multi-scale sequential hypergraph attention module to capture the dynamic preference of users at different time scales. Moreover, we design a contextual attention enhancement module to strengthen the interaction of user representations within the current cascade. Finally, to engage the user's own susceptibility, we construct a susceptibility label for each user based on user susceptibility analysis and use the rank of this label for auxiliary prediction. We conduct experiments over four widely used datasets and show that MCDAN significantly overperforms the state-of-the-art models. The average improvements are up to 10.61% in terms of Hits@100 and 9.71% in terms of MAP@100, respectively. ",
    "url": "https://arxiv.org/abs/2308.04266",
    "authors": [
      "Xiaowen Wang",
      "Lanjun Wang",
      "Yuting Su",
      "Yongdong Zhang",
      "An-An Liu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2308.04304",
    "title": "The Model Inversion Eavesdropping Attack in Semantic Communication  Systems",
    "abstract": "In recent years, semantic communication has been a popular research topic for its superiority in communication efficiency. As semantic communication relies on deep learning to extract meaning from raw messages, it is vulnerable to attacks targeting deep learning models. In this paper, we introduce the model inversion eavesdropping attack (MIEA) to reveal the risk of privacy leaks in the semantic communication system. In MIEA, the attacker first eavesdrops the signal being transmitted by the semantic communication system and then performs model inversion attack to reconstruct the raw message, where both the white-box and black-box settings are considered. Evaluation results show that MIEA can successfully reconstruct the raw message with good quality under different channel conditions. We then propose a defense method based on random permutation and substitution to defend against MIEA in order to achieve secure semantic communication. Our experimental results demonstrate the effectiveness of the proposed defense method in preventing MIEA. ",
    "url": "https://arxiv.org/abs/2308.04304",
    "authors": [
      "Yuhao Chen",
      "Qianqian Yang",
      "Zhiguo Shi",
      "Jiming Chen"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.04312",
    "title": "Interpretable Goal-Based model for Vehicle Trajectory Prediction in  Interactive Scenarios",
    "abstract": "The abilities to understand the social interaction behaviors between a vehicle and its surroundings while predicting its trajectory in an urban environment are critical for road safety in autonomous driving. Social interactions are hard to explain because of their uncertainty. In recent years, neural network-based methods have been widely used for trajectory prediction and have been shown to outperform hand-crafted methods. However, these methods suffer from their lack of interpretability. In order to overcome this limitation, we combine the interpretability of a discrete choice model with the high accuracy of a neural network-based model for the task of vehicle trajectory prediction in an interactive environment. We implement and evaluate our model using the INTERACTION dataset and demonstrate the effectiveness of our proposed architecture to explain its predictions without compromising the accuracy. ",
    "url": "https://arxiv.org/abs/2308.04312",
    "authors": [
      "Amina Ghoul",
      "Itheri Yahiaoui",
      "Anne Verroust-Blondet",
      "Fawzi Nashashibi"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2308.04331",
    "title": "Preserving Sparsity and Privacy in Straggler-Resilient Distributed  Matrix Computations",
    "abstract": "Existing approaches to distributed matrix computations involve allocating coded combinations of submatrices to worker nodes, to build resilience to stragglers and/or enhance privacy. In this study, we consider the challenge of preserving input sparsity in such approaches to retain the associated computational efficiency enhancements. First, we find a lower bound on the weight of coding, i.e., the number of submatrices to be combined to obtain coded submatrices to provide the resilience to the maximum possible number of stragglers (for given number of nodes and their storage constraints). Next we propose a distributed matrix computation scheme which meets this exact lower bound on the weight of the coding. Further, we develop controllable trade-off between worker computation time and the privacy constraint for sparse input matrices in settings where the worker nodes are honest but curious. Numerical experiments conducted in Amazon Web Services (AWS) validate our assertions regarding straggler mitigation and computation speed for sparse matrices. ",
    "url": "https://arxiv.org/abs/2308.04331",
    "authors": [
      "Anindya Bijoy Das",
      "Aditya Ramamoorthy",
      "David J. Love",
      "Christopher G. Brinton"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.04340",
    "title": "A Lightweight and Accurate Face Detection Algorithm Based on Retinaface",
    "abstract": "In this paper, we propose a lightweight and accurate face detection algorithm LAFD (Light and accurate face detection) based on Retinaface. Backbone network in the algorithm is a modified MobileNetV3 network which adjusts the size of the convolution kernel, the channel expansion multiplier of the inverted residuals block and the use of the SE attention mechanism. Deformable convolution network(DCN) is introduced in the context module and the algorithm uses focal loss function instead of cross-entropy loss function as the classification loss function of the model. The test results on the WIDERFACE dataset indicate that the average accuracy of LAFD is 94.1%, 92.2% and 82.1% for the \"easy\", \"medium\" and \"hard\" validation subsets respectively with an improvement of 3.4%, 4.0% and 8.3% compared to Retinaface and 3.1%, 4.1% and 4.1% higher than the well-performing lightweight model, LFFD. If the input image is pre-processed and scaled to 1560px in length or 1200px in width, the model achieves an average accuracy of 86.2% on the 'hard' validation subset. The model is lightweight, with a size of only 10.2MB. ",
    "url": "https://arxiv.org/abs/2308.04340",
    "authors": [
      "Baozhu Liu",
      "Hewei Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04369",
    "title": "SSTFormer: Bridging Spiking Neural Network and Memory Support  Transformer for Frame-Event based Recognition",
    "abstract": "Event camera-based pattern recognition is a newly arising research topic in recent years. Current researchers usually transform the event streams into images, graphs, or voxels, and adopt deep neural networks for event-based classification. Although good performance can be achieved on simple event recognition datasets, however, their results may be still limited due to the following two issues. Firstly, they adopt spatial sparse event streams for recognition only, which may fail to capture the color and detailed texture information well. Secondly, they adopt either Spiking Neural Networks (SNN) for energy-efficient recognition with suboptimal results, or Artificial Neural Networks (ANN) for energy-intensive, high-performance recognition. However, seldom of them consider achieving a balance between these two aspects. In this paper, we formally propose to recognize patterns by fusing RGB frames and event streams simultaneously and propose a new RGB frame-event recognition framework to address the aforementioned issues. The proposed method contains four main modules, i.e., memory support Transformer network for RGB frame encoding, spiking neural network for raw event stream encoding, multi-modal bottleneck fusion module for RGB-Event feature aggregation, and prediction head. Due to the scarce of RGB-Event based classification dataset, we also propose a large-scale PokerEvent dataset which contains 114 classes, and 27102 frame-event pairs recorded using a DVS346 event camera. Extensive experiments on two RGB-Event based classification datasets fully validated the effectiveness of our proposed framework. We hope this work will boost the development of pattern recognition by fusing RGB frames and event streams. Both our dataset and source code of this work will be released at https://github.com/Event-AHU/SSTFormer. ",
    "url": "https://arxiv.org/abs/2308.04369",
    "authors": [
      "Xiao Wang",
      "Zongzhen Wu",
      "Yao Rong",
      "Lin Zhu",
      "Bo Jiang",
      "Jin Tang",
      "Yonghong Tian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2308.04372",
    "title": "Some Options for Instantiation of Bipolar Argument Graphs with Deductive  Arguments",
    "abstract": "Argument graphs provide an abstract representation of an argumentative situation. A bipolar argument graph is a directed graph where each node denotes an argument, and each arc denotes the influence of one argument on another. Here we assume that the influence is supporting, attacking, or ambiguous. In a bipolar argument graph, each argument is atomic and so it has no internal structure. Yet to better understand the nature of the individual arguments, and how they interact, it is important to consider their internal structure. To address this need, this paper presents a framework based on the use of logical arguments to instantiate bipolar argument graphs, and a set of possible constraints on instantiating arguments that take into account the internal structure of the arguments, and the types of relationship between arguments. ",
    "url": "https://arxiv.org/abs/2308.04372",
    "authors": [
      "Anthony Hunter"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04373",
    "title": "Pelta: Shielding Transformers to Mitigate Evasion Attacks in Federated  Learning",
    "abstract": "The main premise of federated learning is that machine learning model updates are computed locally, in particular to preserve user data privacy, as those never leave the perimeter of their device. This mechanism supposes the general model, once aggregated, to be broadcast to collaborating and non malicious nodes. However, without proper defenses, compromised clients can easily probe the model inside their local memory in search of adversarial examples. For instance, considering image-based applications, adversarial examples consist of imperceptibly perturbed images (to the human eye) misclassified by the local model, which can be later presented to a victim node's counterpart model to replicate the attack. To mitigate such malicious probing, we introduce Pelta, a novel shielding mechanism leveraging trusted hardware. By harnessing the capabilities of Trusted Execution Environments (TEEs), Pelta masks part of the back-propagation chain rule, otherwise typically exploited by attackers for the design of malicious samples. We evaluate Pelta on a state of the art ensemble model and demonstrate its effectiveness against the Self Attention Gradient adversarial Attack. ",
    "url": "https://arxiv.org/abs/2308.04373",
    "authors": [
      "Simon Queyrut",
      "Yérom-David Bromberg",
      "Valerio Schiavoni"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04396",
    "title": "Event Abstraction for Enterprise Collaboration Systems to Support Social  Process Mining",
    "abstract": "One aim of Process Mining (PM) is the discovery of process models from event logs of information systems. PM has been successfully applied to process-oriented enterprise systems but is less suited for communication- and document-oriented Enterprise Collaboration Systems (ECS). ECS event logs are very fine-granular and PM applied to their logs results in spaghetti models. A common solution for this is event abstraction, i.e., converting low-level logs into more abstract high-level logs before running discovery algorithms. ECS logs come with special characteristics that have so far not been fully addressed by existing event abstraction approaches. We aim to close this gap with a tailored ECS event abstraction (ECSEA) approach that trains a model by comparing recorded actual user activities (high-level traces) with the system-generated low-level traces (extracted from the ECS). The model allows us to automatically convert future low-level traces into an abstracted high-level log that can be used for PM. Our evaluation shows that the algorithm produces accurate results. ECSEA is a preprocessing method that is essential for the interpretation of collaborative work activity in ECS, which we call Social Process Mining. ",
    "url": "https://arxiv.org/abs/2308.04396",
    "authors": [
      "Jonas Blatt",
      "Patrick Delfmann",
      "Petra Schubert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04404",
    "title": "Revolutionizing Wireless Networks with Federated Learning: A  Comprehensive Review",
    "abstract": "These days with the rising computational capabilities of wireless user equipment such as smart phones, tablets, and vehicles, along with growing concerns about sharing private data, a novel machine learning model called federated learning (FL) has emerged. FL enables the separation of data acquisition and computation at the central unit, which is different from centralized learning that occurs in a data center. FL is typically used in a wireless edge network where communication resources are limited and unreliable. Bandwidth constraints necessitate scheduling only a subset of UEs for updates in each iteration, and because the wireless medium is shared, transmissions are susceptible to interference and are not assured. The article discusses the significance of Machine Learning in wireless communication and highlights Federated Learning (FL) as a novel approach that could play a vital role in future mobile networks, particularly 6G and beyond. ",
    "url": "https://arxiv.org/abs/2308.04404",
    "authors": [
      "Sajjad Emdadi Mahdimahalleh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2308.04406",
    "title": "XGBD: Explanation-Guided Graph Backdoor Detection",
    "abstract": "Backdoor attacks pose a significant security risk to graph learning models. Backdoors can be embedded into the target model by inserting backdoor triggers into the training dataset, causing the model to make incorrect predictions when the trigger is present. To counter backdoor attacks, backdoor detection has been proposed. An emerging detection strategy in the vision and NLP domains is based on an intriguing phenomenon: when training models on a mixture of backdoor and clean samples, the loss on backdoor samples drops significantly faster than on clean samples, allowing backdoor samples to be easily detected by selecting samples with the lowest loss values. However, the ignorance of topological feature information on graph data limits its detection effectiveness when applied directly to the graph domain. To this end, we propose an explanation-guided backdoor detection method to take advantage of the topological information. Specifically, we train a helper model on the graph dataset, feed graph samples into the model, and then adopt explanation methods to attribute model prediction to an important subgraph. We observe that backdoor samples have distinct attribution distribution than clean samples, so the explanatory subgraph could serve as more discriminative features for detecting backdoor samples. Comprehensive experiments on multiple popular datasets and attack methods demonstrate the effectiveness and explainability of our method. Our code is available: https://github.com/GuanZihan/GNN_backdoor_detection. ",
    "url": "https://arxiv.org/abs/2308.04406",
    "authors": [
      "Zihan Guan",
      "Mengnan Du",
      "Ninghao Liu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2308.04407",
    "title": "Chrisimos: A useful Proof-of-Work for finding Minimal Dominating Set of  a graph",
    "abstract": "Hash-based Proof-of-Work (PoW) used in the Bitcoin Blockchain leads to high energy consumption and resource wastage. In this paper, we aim to re-purpose the energy by replacing the hash function with real-life problems having commercial utility. We propose Chrisimos, a useful Proof-of-Work where miners are required to find a minimal dominating set for real-life graph instances. A miner who is able to output the smallest dominating set for the given graph within the block interval time wins the mining game. We also propose a new chain selection rule that ensures the security of the scheme. Thus our protocol also realizes a decentralized minimal dominating set solver for any graph instance. We provide formal proof of correctness and show via experimental results that the block interval time is within feasible bounds of hash-based PoW. ",
    "url": "https://arxiv.org/abs/2308.04407",
    "authors": [
      "Diptendu Chatterjee",
      "Prabal Banerjee",
      "Subhra Mazumdar"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2308.04409",
    "title": "V-DETR: DETR with Vertex Relative Position Encoding for 3D Object  Detection",
    "abstract": "We introduce a highly performant 3D object detector for point clouds using the DETR framework. The prior attempts all end up with suboptimal results because they fail to learn accurate inductive biases from the limited scale of training data. In particular, the queries often attend to points that are far away from the target objects, violating the locality principle in object detection. To address the limitation, we introduce a novel 3D Vertex Relative Position Encoding (3DV-RPE) method which computes position encoding for each point based on its relative position to the 3D boxes predicted by the queries in each decoder layer, thus providing clear information to guide the model to focus on points near the objects, in accordance with the principle of locality. In addition, we systematically improve the pipeline from various aspects such as data normalization based on our understanding of the task. We show exceptional results on the challenging ScanNetV2 benchmark, achieving significant improvements over the previous 3DETR in $\\rm{AP}_{25}$/$\\rm{AP}_{50}$ from 65.0\\%/47.0\\% to 77.8\\%/66.0\\%, respectively. In addition, our method sets a new record on ScanNetV2 and SUN RGB-D datasets.Code will be released at this http URL ",
    "url": "https://arxiv.org/abs/2308.04409",
    "authors": [
      "Yichao Shen",
      "Zigang Geng",
      "Yuhui Yuan",
      "Yutong Lin",
      "Ze Liu",
      "Chunyu Wang",
      "Han Hu",
      "Nanning Zheng",
      "Baining Guo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04413",
    "title": "Digging into Depth Priors for Outdoor Neural Radiance Fields",
    "abstract": "Neural Radiance Fields (NeRF) have demonstrated impressive performance in vision and graphics tasks, such as novel view synthesis and immersive reality. However, the shape-radiance ambiguity of radiance fields remains a challenge, especially in the sparse viewpoints setting. Recent work resorts to integrating depth priors into outdoor NeRF training to alleviate the issue. However, the criteria for selecting depth priors and the relative merits of different priors have not been thoroughly investigated. Moreover, the relative merits of selecting different approaches to use the depth priors is also an unexplored problem. In this paper, we provide a comprehensive study and evaluation of employing depth priors to outdoor neural radiance fields, covering common depth sensing technologies and most application ways. Specifically, we conduct extensive experiments with two representative NeRF methods equipped with four commonly-used depth priors and different depth usages on two widely used outdoor datasets. Our experimental results reveal several interesting findings that can potentially benefit practitioners and researchers in training their NeRF models with depth priors. Project Page: https://cwchenwang.github.io/outdoor-nerf-depth ",
    "url": "https://arxiv.org/abs/2308.04413",
    "authors": [
      "Chen Wang",
      "Jiadai Sun",
      "Lina Liu",
      "Chenming Wu",
      "Zhelun Shen",
      "Dayan Wu",
      "Yuchao Dai",
      "Liangjun Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04426",
    "title": "A Deep-Learning Method Using Auto-encoder and Generative Adversarial  Network for Anomaly Detection on Ancient Stone Stele Surfaces",
    "abstract": "Accurate detection of natural deterioration and man-made damage on the surfaces of ancient stele in the first instance is essential for their preventive conservation. Existing methods for cultural heritage preservation are not able to achieve this goal perfectly due to the difficulty of balancing accuracy, efficiency, timeliness, and cost. This paper presents a deep-learning method to automatically detect above mentioned emergencies on ancient stone stele in real time, employing autoencoder (AE) and generative adversarial network (GAN). The proposed method overcomes the limitations of existing methods by requiring no extensive anomaly samples while enabling comprehensive detection of unpredictable anomalies. the method includes stages of monitoring, data acquisition, pre-processing, model structuring, and post-processing. Taking the Longmen Grottoes' stone steles as a case study, an unsupervised learning model based on AE and GAN architectures is proposed and validated with a reconstruction accuracy of 99.74\\%. The method's evaluation revealed the proficient detection of seven artificially designed anomalies and demonstrated precision and reliability without false alarms. This research provides novel ideas and possibilities for the application of deep learning in the field of cultural heritage. ",
    "url": "https://arxiv.org/abs/2308.04426",
    "authors": [
      "Yikun Liu",
      "Yuning Wang",
      "Cheng Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.04051",
    "title": "Generative Models for Anomaly Detection and Design-Space Dimensionality  Reduction in Shape Optimization",
    "abstract": "Our work presents a novel approach to shape optimization, that has the twofold objective to improve the efficiency of global optimization algorithms while promoting the generation of high-quality designs during the optimization process free of geometrical anomalies. This is accomplished by reducing the number of the original design variables defining a new reduced subspace where the geometrical variance is maximized and modeling the underlying generative process of the data via probabilistic linear latent variable models such as Factor Analysis and Probabilistic Principal Component Analysis. We show that the data follows approximately a Gaussian distribution when the shape modification method is linear and the design variables are sampled uniformly at random, due to the direct application of the central limit theorem. The model uncertainty is measured in terms of Mahalanobis distance, and the paper demonstrates that anomalous designs tend to exhibit a high value of this metric. This enables the definition of a new optimization model where anomalous geometries are penalized and consequently avoided during the optimization loop. The procedure is demonstrated for hull shape optimization of the DTMB 5415 model, extensively used as an international benchmark for shape optimization problems. The global optimization routine is carried out using Bayesian Optimization and the DIRECT algorithm. From the numerical results, the new framework improves the convergence of global optimization algorithms, while only designs with high-quality geometrical features are generated through the optimization routine thereby avoiding the wastage of precious computationally expensive simulations. ",
    "url": "https://arxiv.org/abs/2308.04051",
    "authors": [
      "Danny D'Agostino"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2308.04287",
    "title": "Stable state and signal estimation in a network context",
    "abstract": "Power grid, communications, computer and product reticulation networks are frequently layered or subdivided by design. The layering divides responsibilities and can be driven by operational, commercial, regulatory and privacy concerns. From a control context, a layer, or part of a layer, in a network isolates the authority to manage, i.e. control, a dynamic system with connections into unknown parts of the network. The topology of these connections is fully prescribed but the interconnecting signals, currents in the case of power grids and bandwidths in communications, are largely unavailable, through lack of sensing and even prohibition. Accordingly, one is driven to simultaneous input and state estimation methods. We study a class of algorithms for this joint task, which has the unfortunate issue of inverting a subsystem, which if it has unstable transmission zeros leads to an unstable and unimplementable estimator. Two modifications to the algorithm to ameliorate this problem were recently proposed involving replacing the troublesome subsystem with its outer factor from its inner-outer factorization or using a high-variance white signal model for the unknown inputs. Here, we establish the connections between the original estimation problem for state and input signal and the estimates from the algorithm applied solely to the outer factor. It is demonstrated that the state of the outer factor and that of the original system asymptotically coincide and that the estimate of the input signal to the outer factor has asymptotically stationary second-order statistics which are in one-to-one correspondence with those of the input signal to the original system, when this signal is itself stationary. Thus, the simultaneous input and state estimation algorithm applied just to the outer factor yields an unbiased state estimate for control and the statistics of the interface signals. ",
    "url": "https://arxiv.org/abs/2308.04287",
    "authors": [
      "Robert R. Bitmead"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.04355",
    "title": "Vascular Ageing and Smoking Habit Prediction via a Low-Cost Single-Lead  ECG Module",
    "abstract": "This paper presents a novel low-cost method to predict: i) the vascular age of a healthy young person, ii) whether or not a person is a smoker, using only the lead-I of the electrocardiogram (ECG). We begin by collecting (lead-I) ECG data from 42 healthy subjects (male, female, smoker, non-smoker) aged 18 to 30 years, using our custom-built low-cost single-lead ECG module, and anthropometric data, e.g., body mass index, smoking status, blood pressure etc. Under our proposed method, we first pre-process our dataset by denoising the ECG traces, followed by baseline drift removal, followed by z-score normalization. Next, we divide ECG traces into overlapping segments of five-second duration, which leads to a 145-fold increase in the size of the dataset. We then feed our dataset to a number of machine learning models, a 1D convolutional neural network, a multi-layer perceptron (MLP), and ResNet18 transfer learning model. For vascular ageing prediction problem, Random Forest method outperforms all other methods with an R2 score of 0.99, and mean squared error of 0.07. For the binary classification problem that aims to differentiate between a smoker and a non-smoker, XGBoost method stands out with an accuracy of 96.5%. Finally, for the 4-class classification problem that aims to differentiate between male smoker, female smoker, male non-smoker, and female non-smoker, MLP method achieves the best accuracy of 97.5%. This work is aligned with the sustainable development goals of the United Nations which aim to provide low-cost but quality healthcare solutions to the unprivileged population. ",
    "url": "https://arxiv.org/abs/2308.04355",
    "authors": [
      "S. Anas Ali",
      "M. Saqib Niaz",
      "Mubashir Rehman",
      "Ahsan Mehmood",
      "M. Mahboob Ur Rahman",
      "Kashif Riaz"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2308.04365",
    "title": "SLEM: Machine Learning for Path Modeling and Causal Inference with Super  Learner Equation Modeling",
    "abstract": "Causal inference is a crucial goal of science, enabling researchers to arrive at meaningful conclusions regarding the predictions of hypothetical interventions using observational data. Path models, Structural Equation Models (SEMs), and, more generally, Directed Acyclic Graphs (DAGs), provide a means to unambiguously specify assumptions regarding the causal structure underlying a phenomenon. Unlike DAGs, which make very few assumptions about the functional and parametric form, SEM assumes linearity. This can result in functional misspecification which prevents researchers from undertaking reliable effect size estimation. In contrast, we propose Super Learner Equation Modeling, a path modeling technique integrating machine learning Super Learner ensembles. We empirically demonstrate its ability to provide consistent and unbiased estimates of causal effects, its competitive performance for linear models when compared with SEM, and highlight its superiority over SEM when dealing with non-linear relationships. We provide open-source code, and a tutorial notebook with example usage, accentuating the easy-to-use nature of the method. ",
    "url": "https://arxiv.org/abs/2308.04365",
    "authors": [
      "Matthew J. Vowels"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2002.03729",
    "title": "A lightweight target detection algorithm based on Mobilenet Convolution",
    "abstract": " Title: A lightweight target detection algorithm based on Mobilenet Convolution ",
    "url": "https://arxiv.org/abs/2002.03729",
    "authors": [
      "Shengquan Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2006.06926",
    "title": "Learning Bayesian Networks with Annealing Machine",
    "abstract": " Comments: 13 pages, 5 tables, 3 figures, NeurIPS 2023 (under review) ",
    "url": "https://arxiv.org/abs/2006.06926",
    "authors": [
      "Yuta Shikuri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2104.01847",
    "title": "Social contagion and asset prices: Reddit's self-organised bull runs",
    "abstract": " Comments: This paper was originally put online as a departmental pre-print on the departmental website at this http URL and on MPRA on February 2, 2021 ",
    "url": "https://arxiv.org/abs/2104.01847",
    "authors": [
      "Valentina Semenova",
      "Julian Winkler"
    ],
    "subjectives": [
      "General Economics (econ.GN)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2112.04629",
    "title": "Transferability Properties of Graph Neural Networks",
    "abstract": " Comments: IEEE TSP ",
    "url": "https://arxiv.org/abs/2112.04629",
    "authors": [
      "Luana Ruiz",
      "Luiz F. O. Chamon",
      "Alejandro Ribeiro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.11041",
    "title": "Learning by Erasing: Conditional Entropy based Transferable  Out-Of-Distribution Detection",
    "abstract": " Comments: update new experimental results ",
    "url": "https://arxiv.org/abs/2204.11041",
    "authors": [
      "Meng Xing",
      "Zhiyong Feng",
      "Yong Su",
      "Changjae Oh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.01186",
    "title": "ORC: Network Group-based Knowledge Distillation using Online Role Change",
    "abstract": " Comments: Accepted at ICCV 2023; Supplementary material would be found at CVF Open Access ",
    "url": "https://arxiv.org/abs/2206.01186",
    "authors": [
      "Junyong Choi",
      "Hyeon Cho",
      "Seokhwa Cheung",
      "Wonjun Hwang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.11004",
    "title": "Auto-Encoding Adversarial Imitation Learning",
    "abstract": " Comments: 15 pages ",
    "url": "https://arxiv.org/abs/2206.11004",
    "authors": [
      "Kaifeng Zhang",
      "Rui Zhao",
      "Ziming Zhang",
      "Yang Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.14508",
    "title": "Swin-transformer-yolov5 For Real-time Wine Grape Bunch Detection",
    "abstract": " Comments: 30 pages; 15 figures;Corresponding author: Xin Zhang Department of Agricultural and Biological Engineering Mississippi State University Mississippi State, MS 39762, USA (xzhang@abe.msstate.edu) ",
    "url": "https://arxiv.org/abs/2208.14508",
    "authors": [
      "Shenglian Lu",
      "Xiaoyu Liu",
      "Zixaun He",
      "Wenbo Liu",
      "Xin Zhang",
      "Manoj Karkee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.05785",
    "title": "Adversarial Coreset Selection for Efficient Robust Training",
    "abstract": " Comments: Accepted to the International Journal of Computer Vision (IJCV). Extended version of the ECCV2022 paper: arXiv:2112.00378. arXiv admin note: substantial text overlap with arXiv:2112.00378 ",
    "url": "https://arxiv.org/abs/2209.05785",
    "authors": [
      "Hadi M. Dolatabadi",
      "Sarah Erfani",
      "Christopher Leckie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.14915",
    "title": "Spiking Neural Networks for event-based action recognition: A new task  to understand their advantage",
    "abstract": " Comments: New article superseding the one in previous versions ",
    "url": "https://arxiv.org/abs/2209.14915",
    "authors": [
      "Alex Vicente-Sola",
      "Davide L. Manna",
      "Paul Kirkland",
      "Gaetano Di Caterina",
      "Trevor Bihl"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.07909",
    "title": "Selective Memory Recursive Least Squares: Recast Forgetting into Memory  in RBF Neural Network Based Real-Time Learning",
    "abstract": " Comments: 12 pages, 15 figures ",
    "url": "https://arxiv.org/abs/2211.07909",
    "authors": [
      "Yiming Fei",
      "Jiangang Li",
      "Yanan Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2212.05116",
    "title": "Leveraging Contextual Data Augmentation for Generalizable Melanoma  Detection",
    "abstract": " Comments: 6 pages, 3 figures, 4 tables ",
    "url": "https://arxiv.org/abs/2212.05116",
    "authors": [
      "Nick DiSanto",
      "Gavin Harding",
      "Ethan Martinez",
      "Benjamin Sanders"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.12007",
    "title": "Designing Equitable Transit Networks",
    "abstract": " Comments: Accepted in the non-archival track at the ACM Conference on Equity and Access in Algorithms, Mechanisms, and Optimization (EAAMO), 2023 ",
    "url": "https://arxiv.org/abs/2212.12007",
    "authors": [
      "Sophie Pavia",
      "J. Carlos Martinez Mori",
      "Aryaman Sharma",
      "Philip Pugliese",
      "Abhishek Dubey",
      "Samitha Samaranayake",
      "Ayan Mukhopadhyay"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2301.00790",
    "title": "Online learning techniques for prediction of temporal tabular datasets  with regime changes",
    "abstract": " Title: Online learning techniques for prediction of temporal tabular datasets  with regime changes ",
    "url": "https://arxiv.org/abs/2301.00790",
    "authors": [
      "Thomas Wong",
      "Mauricio Barahona"
    ],
    "subjectives": [
      "Computational Finance (q-fin.CP)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.00195",
    "title": "Weight Prediction Boosts the Convergence of AdamW",
    "abstract": " Title: Weight Prediction Boosts the Convergence of AdamW ",
    "url": "https://arxiv.org/abs/2302.00195",
    "authors": [
      "Lei Guan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2302.00290",
    "title": "MS-DETR: Multispectral Pedestrian Detection Transformer with Loosely  Coupled Fusion and Modality-Balanced Optimization",
    "abstract": " Title: MS-DETR: Multispectral Pedestrian Detection Transformer with Loosely  Coupled Fusion and Modality-Balanced Optimization ",
    "url": "https://arxiv.org/abs/2302.00290",
    "authors": [
      "Yinghui Xing",
      "Song Wang",
      "Shizhou Zhang",
      "Guoqiang Liang",
      "Xiuwei Zhang",
      "Yanning Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.10331",
    "title": "Causal Razors",
    "abstract": " Comments: 29 pages for the main paper. 14 pages for the supplementary materials ",
    "url": "https://arxiv.org/abs/2302.10331",
    "authors": [
      "Wai-yin Lam"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.14353",
    "title": "A semantic backdoor attack against Graph Convolutional Networks",
    "abstract": " Title: A semantic backdoor attack against Graph Convolutional Networks ",
    "url": "https://arxiv.org/abs/2302.14353",
    "authors": [
      "Jiazhu Dai",
      "Zhipeng Xiong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00286",
    "title": "Treat Different Negatives Differently: Enriching Loss Functions with  Domain and Range Constraints for Link Prediction",
    "abstract": " Title: Treat Different Negatives Differently: Enriching Loss Functions with  Domain and Range Constraints for Link Prediction ",
    "url": "https://arxiv.org/abs/2303.00286",
    "authors": [
      "Nicolas Hubert",
      "Pierre Monnin",
      "Armelle Brun",
      "Davy Monticolo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.02542",
    "title": "Physics-informed neural network for friction-involved nonsmooth dynamics  problems",
    "abstract": " Comments: 38 Pages, 24 figures ",
    "url": "https://arxiv.org/abs/2303.02542",
    "authors": [
      "Zilin Li",
      "Jinshuai Bai",
      "Huajing Ouyang",
      "Saulo Martelli",
      "Ming Tang",
      "Yang Yang",
      "Hongtao Wei",
      "Pan Liu",
      "Wei-Ron Han",
      "Yuantong Gu"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2303.16459",
    "title": "GNNBuilder: An Automated Framework for Generic Graph Neural Network  Accelerator Generation, Simulation, and Optimization",
    "abstract": " Comments: 10 pages, 7 figures, 4 tables, 3 listings ",
    "url": "https://arxiv.org/abs/2303.16459",
    "authors": [
      "Stefan Abi-Karam",
      "Cong Hao"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.07575",
    "title": "What Makes Good In-context Demonstrations for Code Intelligence Tasks  with LLMs?",
    "abstract": " Comments: This paper is accepted by ASE 2023 ",
    "url": "https://arxiv.org/abs/2304.07575",
    "authors": [
      "Shuzheng Gao",
      "Xin-Cheng Wen",
      "Cuiyun Gao",
      "Wenxuan Wang",
      "Hongyu Zhang",
      "Michael R. Lyu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2305.02640",
    "title": "Towards Causal Representation Learning and Deconfounding from Indefinite  Data",
    "abstract": " Title: Towards Causal Representation Learning and Deconfounding from Indefinite  Data ",
    "url": "https://arxiv.org/abs/2305.02640",
    "authors": [
      "Hang Chen",
      "Xinyu Yang",
      "Qing Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2305.04170",
    "title": "YOLOCS: Object Detection based on Dense Channel Compression for Feature  Spatial Solidification",
    "abstract": " Title: YOLOCS: Object Detection based on Dense Channel Compression for Feature  Spatial Solidification ",
    "url": "https://arxiv.org/abs/2305.04170",
    "authors": [
      "Lin Huang",
      "Weisheng Li",
      "Linlin Shen",
      "Haojie Fu",
      "Xue Xiao",
      "Suihan Xiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.04423",
    "title": "Robust Power Allocation for UAV-aided ISAC Systems with Uncertain  Location Sensing Errors",
    "abstract": " Title: Robust Power Allocation for UAV-aided ISAC Systems with Uncertain  Location Sensing Errors ",
    "url": "https://arxiv.org/abs/2305.04423",
    "authors": [
      "Junchang Sun",
      "Shuai Ma",
      "Ruixin Yang",
      "Shiyin Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.10044",
    "title": "Two-Stream Regression Network for Dental Implant Position Prediction",
    "abstract": " Title: Two-Stream Regression Network for Dental Implant Position Prediction ",
    "url": "https://arxiv.org/abs/2305.10044",
    "authors": [
      "Xinquan Yang",
      "Xuguang Li",
      "Xuechen Li",
      "Wenting Chen",
      "Linlin Shen",
      "Xin Li",
      "Yongqiang Deng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.12522",
    "title": "P-NOC: Adversarial CAM Generation for Weakly Supervised Semantic  Segmentation",
    "abstract": " Comments: 19 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2305.12522",
    "authors": [
      "Lucas David",
      "Helio Pedrini",
      "Zanoni Dias"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.18651",
    "title": "UMD: Unsupervised Model Detection for X2X Backdoor Attacks",
    "abstract": " Comments: Proceedings of the 40th International Conference on Machine Learning ",
    "url": "https://arxiv.org/abs/2305.18651",
    "authors": [
      "Zhen Xiang",
      "Zidi Xiong",
      "Bo Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.01645",
    "title": "Quantifying synergy and redundancy in multiplex networks",
    "abstract": " Title: Quantifying synergy and redundancy in multiplex networks ",
    "url": "https://arxiv.org/abs/2306.01645",
    "authors": [
      "Andrea I. Luppi",
      "Eckehard Olbrich",
      "Conor Finn",
      "Laura E. Suárez",
      "Fernando E. Rosas",
      "Pedro A.M. Mediano",
      "Jürgen Jost"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Information Theory (cs.IT)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2307.02227",
    "title": "MAE-DFER: Efficient Masked Autoencoder for Self-supervised Dynamic  Facial Expression Recognition",
    "abstract": " Comments: ACM MM 2023 (camera ready). Codes and models are publicly available at this https URL ",
    "url": "https://arxiv.org/abs/2307.02227",
    "authors": [
      "Licai Sun",
      "Zheng Lian",
      "Bin Liu",
      "Jianhua Tao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2307.07873",
    "title": "Why Does Little Robustness Help? Understanding Adversarial  Transferability From Surrogate Training",
    "abstract": " Comments: Accepted by IEEE Symposium on Security and Privacy (Oakland) 2024; 21 pages, 11 figures, 13 tables ",
    "url": "https://arxiv.org/abs/2307.07873",
    "authors": [
      "Yechao Zhang",
      "Shengshan Hu",
      "Leo Yu Zhang",
      "Junyu Shi",
      "Minghui Li",
      "Xiaogeng Liu",
      "Wei Wan",
      "Hai Jin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09426",
    "title": "Balancing Privacy and Progress in Artificial Intelligence: Anonymization  in Histopathology for Biomedical Research and Education",
    "abstract": " Comments: Accepted to FAIEMA 2023 ",
    "url": "https://arxiv.org/abs/2307.09426",
    "authors": [
      "Neel Kanwal",
      "Emiel A.M. Janssen",
      "Kjersti Engan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.09724",
    "title": "AesPA-Net: Aesthetic Pattern-Aware Style Transfer Networks",
    "abstract": " Comments: Accepted by ICCV 2023. Code is available at this this https URL ",
    "url": "https://arxiv.org/abs/2307.09724",
    "authors": [
      "Kibeom Hong",
      "Seogkyu Jeon",
      "Junsoo Lee",
      "Namhyuk Ahn",
      "Kunhee Kim",
      "Pilhyeon Lee",
      "Daesik Kim",
      "Youngjung Uh",
      "Hyeran Byun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.12676",
    "title": "Damage Vision Mining Opportunity for Imbalanced Anomaly Detection",
    "abstract": " Comments: 21 pages, 29 figures, 18 tables ",
    "url": "https://arxiv.org/abs/2307.12676",
    "authors": [
      "Takato Yasuno"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.16074",
    "title": "Iterative Graph Filtering Network for 3D Human Pose Estimation",
    "abstract": " Title: Iterative Graph Filtering Network for 3D Human Pose Estimation ",
    "url": "https://arxiv.org/abs/2307.16074",
    "authors": [
      "Zaedul Islam",
      "A. Ben Hamza"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.01006",
    "title": "FusionAD: Multi-modality Fusion for Prediction and Planning Tasks of  Autonomous Driving",
    "abstract": " Title: FusionAD: Multi-modality Fusion for Prediction and Planning Tasks of  Autonomous Driving ",
    "url": "https://arxiv.org/abs/2308.01006",
    "authors": [
      "Tengju Ye",
      "Wei Jing",
      "Chunyong Hu",
      "Shikun Huang",
      "Lingping Gao",
      "Fangzhen Li",
      "Jingke Wang",
      "Ke Guo",
      "Wencong Xiao",
      "Weibo Mao",
      "Hang Zheng",
      "Kun Li",
      "Junbo Chen",
      "Kaicheng Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.02013",
    "title": "Federated Representation Learning for Automatic Speech Recognition",
    "abstract": " Comments: Accepted at ISCA SPSC Symposium 3rd Symposium on Security and Privacy in Speech Communication, 2023 ",
    "url": "https://arxiv.org/abs/2308.02013",
    "authors": [
      "Guruprasad V Ramesh",
      "Gopinath Chennupati",
      "Milind Rao",
      "Anit Kumar Sahu",
      "Ariya Rastrow",
      "Jasha Droppo"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2308.02494",
    "title": "Adaptively Placed Multi-Grid Scene Representation Networks for  Large-Scale Data Visualization",
    "abstract": " Comments: Accepted to IEEE VIS 2023 ",
    "url": "https://arxiv.org/abs/2308.02494",
    "authors": [
      "Skylar Wolfgang Wurster",
      "Tianyu Xiong",
      "Han-Wei Shen",
      "Hanqi Guo",
      "Tom Peterka"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2308.02632",
    "title": "Generation of Realistic Synthetic Raw Radar Data for Automated Driving  Applications using Generative Adversarial Networks",
    "abstract": " Title: Generation of Realistic Synthetic Raw Radar Data for Automated Driving  Applications using Generative Adversarial Networks ",
    "url": "https://arxiv.org/abs/2308.02632",
    "authors": [
      "Eduardo C. Fidelis",
      "Fabio Reway",
      "Herick Y. S. Ribeiro",
      "Pietro L. Campos",
      "Werner Huber",
      "Christian Icking",
      "Lester A. Faria",
      "Torsten Schön"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.02781",
    "title": "A Voting-Stacking Ensemble of Inception Networks for Cervical Cytology  Classification",
    "abstract": " Title: A Voting-Stacking Ensemble of Inception Networks for Cervical Cytology  Classification ",
    "url": "https://arxiv.org/abs/2308.02781",
    "authors": [
      "Linyi Qian",
      "Qian Huang",
      "Yulin Chen",
      "Junzhou Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2308.03286",
    "title": "Multi-Label Self-Supervised Learning with Scene Images",
    "abstract": " Comments: ICCV2023 ",
    "url": "https://arxiv.org/abs/2308.03286",
    "authors": [
      "Ke Zhu",
      "Minghao Fu",
      "Jianxin Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.03529",
    "title": "Feature Decoupling-Recycling Network for Fast Interactive Segmentation",
    "abstract": " Comments: Accepted to ACM MM 2023 ",
    "url": "https://arxiv.org/abs/2308.03529",
    "authors": [
      "Huimin Zeng",
      "Weinong Wang",
      "Xin Tao",
      "Zhiwei Xiong",
      "Yu-Wing Tai",
      "Wenjie Pei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.03629",
    "title": "MedMine: Examining Pre-trained Language Models on Medication Mining",
    "abstract": " Comments: Open Research Project. 7 pages, 1 figure, 5 tables ",
    "url": "https://arxiv.org/abs/2308.03629",
    "authors": [
      "Haifa Alrdahi",
      "Lifeng Han",
      "Hendrik Šuvalov",
      "Goran Nenadic"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  }
]