[
  {
    "id": "arXiv:2106.04575",
    "title": "DNS attack mitigation Using OpenStack Isolation",
    "abstract": "The Domain Name System (DNS) is essential for the Internet, giving a mechanism to resolve hostnames into Internet Protocol (IP) addresses. DNS is known as the world's largest distributed database that manages hostnames and Internet Protocol. By having the DNS, only simple names that can be easily memorized will be used and then the domain name system will map it into the numeric Internet Protocol addresses that are used by computers to communicate. This research aims to propose a model for the development of a private cloud infrastructure to host DNS. The cloud infrastructure will be created using the OpenStack software platform where each server will be hosted separately in a different virtual machine. Virtual network architecture will be created using the Software Defined Networking (SDN) approach and it will be secured using Firewall as a Service (FWaaS). By hosting DNS in private cloud infrastructure, the DNS servers will be out of reach by attackers which will prevent DNS attacks. Besides, available research had proven that the cloud is the best choice for DNS. A prototype had been implemented and evaluated for its efficiencies. The findings from the evaluation carried out shown a positive result. ",
    "url": "https://arxiv.org/abs/2106.04575",
    "authors": [
      "Hassnain ul hassan",
      "Rizal Mohd Nor",
      "Md Amiruzzaman",
      "Sharyar Wani"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2106.04687",
    "title": "Does class size matter? An in-depth assessment of the effect of class  size in software defect prediction",
    "abstract": "In the past 20 years, defect prediction studies have generally acknowledged the effect of class size on software prediction performance. To quantify the relationship between object-oriented (OO) metrics and defects, modelling has to take into account the direct, and potentially indirect, effects of class size on defects. However, some studies have shown that size cannot be simply controlled or ignored, when building prediction models. As such, there remains a question whether, and when, to control for class size. This study provides a new in-depth examination of the impact of class size on the relationship between OO metrics and software defects or defect-proneness. We assess the impact of class size on the number of defects and defect-proneness in software systems by employing a regression-based mediation (with bootstrapping) and moderation analysis to investigate the direct and indirect effect of class size in count and binary defect prediction. Our results show that the size effect is not always significant for all metrics. Of the seven OO metrics we investigated, size consistently has significant mediation impact only on the relationship between Coupling Between Objects (CBO) and defects/defect-proneness, and a potential moderation impact on the relationship between Fan-out and defects/defect-proneness. Based on our results we make three recommendations. One, we encourage researchers and practitioners to examine the impact of class size for the specific data they have in hand and through the use of the proposed statistical mediation/moderation procedures. Two, we encourage empirical studies to investigate the indirect effect of possible additional variables in their models when relevant. Three, the statistical procedures adopted in this study could be used in other empirical software engineering research to investigate the influence of potential mediators/moderators. ",
    "url": "https://arxiv.org/abs/2106.04687",
    "authors": [
      "Amjed Tahir",
      "Kwabena E. Bennin",
      "Xun Xiao",
      "Stephen G. MacDonell"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2106.04739",
    "title": "Learning subtree pattern importance for Weisfeiler-Lehmanbased graph  kernels",
    "abstract": "Graph is an usual representation of relational data, which are ubiquitous in manydomains such as molecules, biological and social networks. A popular approach to learningwith graph structured data is to make use of graph kernels, which measure the similaritybetween graphs and are plugged into a kernel machine such as a support vector machine.Weisfeiler-Lehman (WL) based graph kernels, which employ WL labeling scheme to extract subtree patterns and perform node embedding, are demonstrated to achieve great performance while being efficiently computable. However, one of the main drawbacks of ageneral kernel is the decoupling of kernel construction and learning process. For moleculargraphs, usual kernels such as WL subtree, based on substructures of the molecules, consider all available substructures having the same importance, which might not be suitable inpractice. In this paper, we propose a method to learn the weights of subtree patterns in the framework of WWL kernels, the state of the art method for graph classification task [14]. To overcome the computational issue on large scale data sets, we present an efficient learning algorithm and also derive a generalization gap bound to show its convergence. Finally, through experiments on synthetic and real-world data sets, we demonstrate the effectiveness of our proposed method for learning the weights of subtree patterns. ",
    "url": "https://arxiv.org/abs/2106.04739",
    "authors": [
      "Dai Hai Nguyen",
      "Canh Hao Nguyen",
      "Hiroshi Mamitsuka"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.04951",
    "title": "Information flow based defensive chain for data leakage detection and  prevention: a survey",
    "abstract": "Mobile and IoT applications have greatly enriched our daily life by providing convenient and intelligent services. However, these smart applications have been a prime target of adversaries for stealing sensitive data. It poses a crucial threat to users' identity security, financial security, or even life security. Research communities and industries have proposed many Information Flow Control (IFC) techniques for data leakage detection and prevention, including secure modeling, type system, static analysis, dynamic analysis, \\textit{etc}. According to the application's development life cycle, although most attacks are conducted during the application's execution phase, data leakage vulnerabilities have been introduced since the design phase. With a focus on lifecycle protection, this survey reviews the recent representative works adopted in different phases. We propose an information flow based defensive chain, which provides a new framework to systematically understand various IFC techniques for data leakage detection and prevention in Mobile and IoT applications. In line with the phases of the application life cycle, each reviewed work is comprehensively studied in terms of technique, performance, and limitation. Research challenges and future directions are also pointed out by consideration of the integrity of the defensive chain. ",
    "url": "https://arxiv.org/abs/2106.04951",
    "authors": [
      "Ning Xi",
      "Chao Chen",
      "Jun Zhang",
      "Cong Sun",
      "Shigang Liu",
      "Pengbin Feng",
      "Jianfeng Ma"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2106.05009",
    "title": "Network insensitivity to parameter noise via adversarial regularization",
    "abstract": "Neuromorphic neural network processors, in the form of compute-in-memory crossbar arrays of memristors, or in the form of subthreshold analog and mixed-signal ASICs, promise enormous advantages in compute density and energy efficiency for NN-based ML tasks. However, these technologies are prone to computational non-idealities, due to process variation and intrinsic device physics. This degrades the task performance of networks deployed to the processor, by introducing parameter noise into the deployed model. While it is possible to calibrate each device, or train networks individually for each processor, these approaches are expensive and impractical for commercial deployment. Alternative methods are therefore needed to train networks that are inherently robust against parameter variation, as a consequence of network architecture and parameters. We present a new adversarial network optimisation algorithm that attacks network parameters during training, and promotes robust performance during inference in the face of parameter variation. Our approach introduces a regularization term penalising the susceptibility of a network to weight perturbation. We compare against previous approaches for producing parameter insensitivity such as dropout, weight smoothing and introducing parameter noise during training. We show that our approach produces models that are more robust to targeted parameter variation, and equally robust to random parameter variation. Our approach finds minima in flatter locations in the weight-loss landscape compared with other approaches, highlighting that the networks found by our technique are less sensitive to parameter perturbation. Our work provides an approach to deploy neural network architectures to inference devices that suffer from computational non-idealities, with minimal loss of performance. ... ",
    "url": "https://arxiv.org/abs/2106.05009",
    "authors": [
      "Julian Bücher",
      "Fynn Faber",
      "Dylan R. Muir"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.05018",
    "title": "RLupus: Cooperation through emergent communication in The Werewolf  social deduction game",
    "abstract": "This paper focuses on the emergence of communication to support cooperation in environments modeled as social deduction games (SDG), that are games where players communicate freely to deduce each others' hidden intentions. We first state the problem by giving a general formalization of SDG and a possible solution framework based on reinforcement learning. Next, we focus on a specific SDG, known as The Werewolf, and study if and how various forms of communication influence the outcome of the game. Experimental results show that introducing a communication signal greatly increases the winning chances of a class of players. We also study the effect of the signal's length and range on the overall performance showing a non-linear relationship. ",
    "url": "https://arxiv.org/abs/2106.05018",
    "authors": [
      "Nicolo' Brandizzi",
      "Davide Grossi",
      "Luca Iocchi"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2106.05061",
    "title": "Quickest change detection with unknown parameters: Constant complexity  and near optimality",
    "abstract": "We consider the quickest change detection problem where both the parameters of pre- and post- change distributions are unknown, which prevents the use of classical simple hypothesis testing. Without additional assumptions, optimal solutions are not tractable as they rely on some minimax and robust variant of the objective. As a consequence, change points might be detected too late for practical applications (in economics, health care or maintenance for instance). Available constant complexity techniques typically solve a relaxed version of the problem, deeply relying on very specific probability distributions and/or some very precise additional knowledge. We consider a totally different approach that leverages the theoretical asymptotic properties of optimal solutions to derive a new scalable approximate algorithm with near optimal performance that runs~in~$\\mathcal{O}(1)$, adapted to even more complex Markovian settings. ",
    "url": "https://arxiv.org/abs/2106.05061",
    "authors": [
      "Firas Jarboui",
      "Viannet Perchet"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.05094",
    "title": "Semi-supervised lane detection with Deep Hough Transform",
    "abstract": "Current work on lane detection relies on large manually annotated datasets. We reduce the dependency on annotations by leveraging massive cheaply available unlabelled data. We propose a novel loss function exploiting geometric knowledge of lanes in Hough space, where a lane can be identified as a local maximum. By splitting lanes into separate channels, we can localize each lane via simple global max-pooling. The location of the maximum encodes the layout of a lane, while the intensity indicates the the probability of a lane being present. Maximizing the log-probability of the maximal bins helps neural networks find lanes without labels. On the CULane and TuSimple datasets, we show that the proposed Hough Transform loss improves performance significantly by learning from large amounts of unlabelled images. ",
    "url": "https://arxiv.org/abs/2106.05094",
    "authors": [
      "Yancong Lin",
      "Silvia-Laura Pintea",
      "Jan van Gemert"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.05096",
    "title": "Multiple simultaneous solution representations in a population based  evolutionary algorithm",
    "abstract": "The representation used for solutions in optimization can have a significant impact on the performance of the optimization method. Traditional population based evolutionary methods have homogeneous populations where all solutions use the same representation. If different representations are to be considered, different runs are required to investigate the relative performance. In this paper, we illustrate the use of a population based evolutionary method, Fresa, inspired by the propagation of Strawberry plants, which allows for multiple representations to co-exist in the population. Fresa is implemented in the Julia language. Julia provides dynamic typing and multiple dispatch. In multiple dispatch, the function invoked is determined, dynamically at run time, by the types of the arguments passed to it. This enables a generic implementation of key steps in the plant propagation algorithm which allows for a heterogeneous population. The search procedure then leads to a competition between representations automatically. A simple case study from the design of operating conditions for a batch reactor system is used to illustrate heterogeneous population based search. ",
    "url": "https://arxiv.org/abs/2106.05096",
    "authors": [
      "Eric S. Fraga"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2106.05233",
    "title": "Analysis of convolutional neural network image classifiers in a  hierarchical max-pooling model with additional local pooling",
    "abstract": "Image classification is considered, and a hierarchical max-pooling model with additional local pooling is introduced. Here the additional local pooling enables the hierachical model to combine parts of the image which have a variable relative distance towards each other. Various convolutional neural network image classifiers are introduced and compared in view of their rate of convergence. The finite sample size performance of the estimates is analyzed by applying them to simulated and real data. ",
    "url": "https://arxiv.org/abs/2106.05233",
    "authors": [
      "Benjamin Walter"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.05244",
    "title": "Coopetition methodology for resource sharing in distributed OFDM-based  cognitive radio networks",
    "abstract": "In this paper, we present a distributed resource allocation mechanism in cognitive radio networks, based on a new coopeti-tion methodology, which combines advantages of nodes competition and cooperation. We postulate that this new method allows for fully distributed resource management between cognitive radio devices. The presented framework is generic, however, we consider it for the application in OFDMA networks. Coopetition takes the best from cooperative and competitive problem formulation and provides the opportunity to control the balance between fairness and spectral efficiency (SE) of resource allocation. Simulation results confirm that coopetition allows for efficient resource utilization, and may be used practically in wireless cognitive networks. ",
    "url": "https://arxiv.org/abs/2106.05244",
    "authors": [
      "Marcin Parzy",
      "Hanna Bogucka"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2106.05250",
    "title": "The zero-rate threshold for adversarial bit-deletions is less than 1/2",
    "abstract": "We prove that there exists an absolute constant $\\delta>0$ such any binary code $C\\subset\\{0,1\\}^N$ tolerating $(1/2-\\delta)N$ adversarial deletions must satisfy $|C|\\le 2^{\\text{poly}\\log N}$ and thus have rate asymptotically approaching 0. This is the first constant fraction improvement over the trivial bound that codes tolerating $N/2$ adversarial deletions must have rate going to 0 asymptotically. Equivalently, we show that there exists absolute constants $A$ and $\\delta>0$ such that any set $C\\subset\\{0,1\\}^N$ of $2^{\\log^A N}$ binary strings must contain two strings $c$ and $c'$ whose longest common subsequence has length at least $(1/2+\\delta)N$. As an immediate corollary, we show that $q$-ary codes tolerating a fraction $1-(1+2\\delta)/q$ of adversarial deletions must also have rate approaching 0. Our techniques include string regularity arguments and a structural lemma that classifies binary strings by their oscillation patterns. Leveraging these tools, we find in any large code two strings with similar oscillation patterns, which is exploited to find a long common subsequence. ",
    "url": "https://arxiv.org/abs/2106.05250",
    "authors": [
      "Venkatesan Guruswami",
      "Xiaoyu He",
      "Ray Li"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2106.04650",
    "title": "TED-net: Convolution-free T2T Vision Transformer-based Encoder-decoder  Dilation network for Low-dose CT Denoising",
    "abstract": "Low dose computed tomography is a mainstream for clinical applications. How-ever, compared to normal dose CT, in the low dose CT (LDCT) images, there are stronger noise and more artifacts which are obstacles for practical applications. In the last few years, convolution-based end-to-end deep learning methods have been widely used for LDCT image denoising. Recently, transformer has shown superior performance over convolution with more feature interactions. Yet its ap-plications in LDCT denoising have not been fully cultivated. Here, we propose a convolution-free T2T vision transformer-based Encoder-decoder Dilation net-work (TED-net) to enrich the family of LDCT denoising algorithms. The model is free of convolution blocks and consists of a symmetric encoder-decoder block with sole transformer. Our model is evaluated on the AAPM-Mayo clinic LDCT Grand Challenge dataset, and results show outperformance over the state-of-the-art denoising methods. ",
    "url": "https://arxiv.org/abs/2106.04650",
    "authors": [
      "Dayang Wang",
      "Zhan Wu",
      "Hengyong Yu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2106.04975",
    "title": "The dilemma of quantum neural networks",
    "abstract": "The core of quantum machine learning is to devise quantum models with good trainability and low generalization error bound than their classical counterparts to ensure better reliability and interpretability. Recent studies confirmed that quantum neural networks (QNNs) have the ability to achieve this goal on specific datasets. With this regard, it is of great importance to understand whether these advantages are still preserved on real-world tasks. Through systematic numerical experiments, we empirically observe that current QNNs fail to provide any benefit over classical learning models. Concretely, our results deliver two key messages. First, QNNs suffer from the severely limited effective model capacity, which incurs poor generalization on real-world datasets. Second, the trainability of QNNs is insensitive to regularization techniques, which sharply contrasts with the classical scenario. These empirical results force us to rethink the role of current QNNs and to design novel protocols for solving real-world problems with quantum advantages. ",
    "url": "https://arxiv.org/abs/2106.04975",
    "authors": [
      "Yang Qian",
      "Xinbiao Wang",
      "Yuxuan Du",
      "Xingyao Wu",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.05186",
    "title": "Information theoretic analysis of computational models as a tool to  understand the neural basis of behaviors",
    "abstract": "One of the greatest research challenges of this century is to understand the neural basis for how behavior emerges in brain-body-environment systems. To this end, research has flourished along several directions but have predominantly focused on the brain. While there is in an increasing acceptance and focus on including the body and environment in studying the neural basis of behavior, animal researchers are often limited by technology or tools. Computational models provide an alternative framework within which one can study model systems where ground-truth can be measured and interfered with. These models act as a hypothesis generation framework that would in turn guide experimentation. Furthermore, the ability to intervene as we please, allows us to conduct in-depth analysis of these models in a way that cannot be performed in natural systems. For this purpose, information theory is emerging as a powerful tool that can provide insights into the operation of these brain-body-environment models. In this work, I provide an introduction, a review and discussion to make a case for how information theoretic analysis of computational models is a potent research methodology to help us better understand the neural basis of behavior. ",
    "url": "https://arxiv.org/abs/2106.05186",
    "authors": [
      "Madhavun Candadai"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Information Theory (cs.IT)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2106.05214",
    "title": "Implicit field learning for unsupervised anomaly detection in medical  images",
    "abstract": "We propose a novel unsupervised out-of-distribution detection method for medical images based on implicit fields image representations. In our approach, an auto-decoder feed-forward neural network learns the distribution of healthy images in the form of a mapping between spatial coordinates and probabilities over a proxy for tissue types. At inference time, the learnt distribution is used to retrieve, from a given test image, a restoration, i.e. an image maximally consistent with the input one but belonging to the healthy distribution. Anomalies are localized using the voxel-wise probability predicted by our model for the restored image. We tested our approach in the task of unsupervised localization of gliomas on brain MR images and compared it to several other VAE-based anomaly detection methods. Results show that the proposed technique substantially outperforms them (average DICE 0.640 vs 0.518 for the best performing VAE-based alternative) while also requiring considerably less computing time. ",
    "url": "https://arxiv.org/abs/2106.05214",
    "authors": [
      "Sergio Naval Marimont",
      "Giacomo Tarroni"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.05265",
    "title": "Efficient input placement for the optimal control of network moments",
    "abstract": "In this paper, we study the optimal control of the mean and variance of the network state vector. We develop an algorithm to optimize the control input placement subject to constraints on the state, which must be achieved at a given time threshold; seeking an input placement which moves the moment at minimum cost. First, we solve the state-selection problem for a number of variants of the first and second moment, and find solutions related to the eigenvalues of the systems' Gramian matrices. Our algorithm then uses this information to find a locally optimal input placement. This is a Generalization of the Projected Gradient Method (GPGM). We solve the problem for some common versions of these moments, including the mean state and versions of the second moment which induce discord, repel from a certain state, or encourage convergence. We then perform simulations, and discuss a measure of centrality based on the system flux -- a measure which describes what nodes are most important to optimal control of the average state. ",
    "url": "https://arxiv.org/abs/2106.05265",
    "authors": [
      "Philip Solimine",
      "Anke Meyer-Baese"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Social and Information Networks (cs.SI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2007.06172",
    "title": "Bottom-up mechanism and improved contract net protocol for the dynamic  task planning of heterogeneous Earth observation resources",
    "abstract": " Comments: 14 pages, 11 figures.This work has been submitted to the IEEE for possible publication ",
    "url": "https://arxiv.org/abs/2007.06172",
    "authors": [
      "Baoju Liu",
      "Min Deng",
      "Guohua Wu",
      "Xinyu Pei",
      "Haifeng Li",
      "Witold Pedrycz"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2011.11844",
    "title": "Densely connected multidilated convolutional networks for dense  prediction tasks",
    "abstract": " Comments: Accepted to CVPR 2021. arXiv admin note: text overlap with arXiv:2010.01733 ",
    "url": "https://arxiv.org/abs/2011.11844",
    "authors": [
      "Naoya Takahashi",
      "Yuki Mitsufuji"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2101.08578",
    "title": "MLPF: Efficient machine-learned particle-flow reconstruction using graph  neural networks",
    "abstract": " Comments: 15 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2101.08578",
    "authors": [
      "Joosep Pata",
      "Javier Duarte",
      "Jean-Roch Vlimant",
      "Maurizio Pierini",
      "Maria Spiropulu"
    ],
    "subjectives": [
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Experiment (hep-ex)",
      "Instrumentation and Detectors (physics.ins-det)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2104.10611",
    "title": "Programmable 3D snapshot microscopy with Fourier convolutional networks",
    "abstract": " Comments: Rewritten and updated with DLMD results for conference submission ",
    "url": "https://arxiv.org/abs/2104.10611",
    "authors": [
      "Diptodip Deb",
      "Zhenfei Jiao",
      "Alex B. Chen",
      "Misha B. Ahrens",
      "Kaspar Podgorski",
      "Srinivas C. Turaga"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.08873",
    "title": "Mahalanobis distance-based robust approaches against false data  injection attacks on dynamic power state estimation",
    "abstract": " Title: Mahalanobis distance-based robust approaches against false data  injection attacks on dynamic power state estimation ",
    "url": "https://arxiv.org/abs/2105.08873",
    "authors": [
      "Jing Lin",
      "Kaiqi Xiong"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2105.14139",
    "title": "On a class of data-driven combinatorial optimization problems under  uncertainty: a distributionally robust approach",
    "abstract": " Title: On a class of data-driven combinatorial optimization problems under  uncertainty: a distributionally robust approach ",
    "url": "https://arxiv.org/abs/2105.14139",
    "authors": [
      "Sergey S. Ketkov",
      "Andrei S. Shilov",
      "Oleg A. Prokopyev"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  }
]