[
  {
    "id": "arXiv:2207.02845",
    "title": "Automating the Design and Development of Gradient Descent Trained Expert  System Networks",
    "abstract": "Prior work introduced a gradient descent trained expert system that conceptually combines the learning capabilities of neural networks with the understandability and defensible logic of an expert system. This system was shown to be able to learn patterns from data and to perform decision-making at levels rivaling those reported by neural network systems. The principal limitation of the approach, though, was the necessity for the manual development of a rule-fact network (which is then trained using backpropagation). This paper proposes a technique for overcoming this significant limitation, as compared to neural networks. Specifically, this paper proposes the use of larger and denser-than-application need rule-fact networks which are trained, pruned, manually reviewed and then re-trained for use. Multiple types of networks are evaluated under multiple operating conditions and these results are presented and assessed. Based on these individual experimental condition assessments, the proposed technique is evaluated. The data presented shows that error rates as low as 3.9% (mean, 1.2% median) can be obtained, demonstrating the efficacy of this technique for many applications. ",
    "url": "https://arxiv.org/abs/2207.02845",
    "authors": [
      "Jeremy Straub"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.02846",
    "title": "Local Sample-weighted Multiple Kernel Clustering with Consensus  Discriminative Graph",
    "abstract": "Multiple kernel clustering (MKC) is committed to achieving optimal information fusion from a set of base kernels. Constructing precise and local kernel matrices is proved to be of vital significance in applications since the unreliable distant-distance similarity estimation would degrade clustering per-formance. Although existing localized MKC algorithms exhibit improved performance compared to globally-designed competi-tors, most of them widely adopt KNN mechanism to localize kernel matrix by accounting for {\\tau} -nearest neighbors. However, such a coarse manner follows an unreasonable strategy that the ranking importance of different neighbors is equal, which is impractical in applications. To alleviate such problems, this paper proposes a novel local sample-weighted multiple kernel clustering (LSWMKC) model. We first construct a consensus discriminative affinity graph in kernel space, revealing the latent local structures. Further, an optimal neighborhood kernel for the learned affinity graph is output with naturally sparse property and clear block diagonal structure. Moreover, LSWMKC im-plicitly optimizes adaptive weights on different neighbors with corresponding samples. Experimental results demonstrate that our LSWMKC possesses better local manifold representation and outperforms existing kernel or graph-based clustering algo-rithms. The source code of LSWMKC can be publicly accessed from https://github.com/liliangnudt/LSWMKC. ",
    "url": "https://arxiv.org/abs/2207.02846",
    "authors": [
      "Liang Li",
      "Siwei Wang",
      "Xinwang Liu",
      "En Zhu",
      "Li Shen",
      "Kenli Li",
      "Keqin Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.02847",
    "title": "Scoring Rules for Performative Binary Prediction",
    "abstract": "We construct a model of expert prediction where predictions can influence the state of the world. Under this model, we show through theoretical and numerical results that proper scoring rules can incentivize experts to manipulate the world with their predictions. We also construct a simple class of scoring rules that avoids this problem. ",
    "url": "https://arxiv.org/abs/2207.02847",
    "authors": [
      "Alan Chan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.02890",
    "title": "Humans Social Relationship Classification during Accompaniment",
    "abstract": "This paper presents the design of deep learning architectures which allow to classify the social relationship existing between two people who are walking in a side-by-side formation into four possible categories --colleagues, couple, family or friendship. The models are developed using Neural Networks or Recurrent Neural Networks to achieve the classification and are trained and evaluated using a database of readings obtained from humans performing an accompaniment process in an urban environment. The best achieved model accomplishes a relatively good accuracy in the classification problem and its results enhance partially the outcomes from a previous study [1]. Furthermore, the model proposed shows its future potential to improve its efficiency and to be implemented in a real robot. ",
    "url": "https://arxiv.org/abs/2207.02890",
    "authors": [
      "Oscar Castro",
      "Ely Repiso",
      "Anais Garrell",
      "Alberto Sanfeliu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.02891",
    "title": "Don't overfit the history -- Recursive time series data augmentation",
    "abstract": "Time series observations can be seen as realizations of an underlying dynamical system governed by rules that we typically do not know. For time series learning tasks, we need to understand that we fit our model on available data, which is a unique realized history. Training on a single realization often induces severe overfitting lacking generalization. To address this issue, we introduce a general recursive framework for time series augmentation, which we call Recursive Interpolation Method, denoted as RIM. New samples are generated using a recursive interpolation function of all previous values in such a way that the enhanced samples preserve the original inherent time series dynamics. We perform theoretical analysis to characterize the proposed RIM and to guarantee its test performance. We apply RIM to diverse real world time series cases to achieve strong performance over non-augmented data on regression, classification, and reinforcement learning tasks. ",
    "url": "https://arxiv.org/abs/2207.02891",
    "authors": [
      "Amine Mohamed Aboussalah",
      "Min-Jae Kwon",
      "Raj G Patel",
      "Cheng Chi",
      "Chi-Guhn Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.02907",
    "title": "Exploring Generative Adversarial Networks for Text-to-Image Generation  with Evolution Strategies",
    "abstract": "In the context of generative models, text-to-image generation achieved impressive results in recent years. Models using different approaches were proposed and trained in huge datasets of pairs of texts and images. However, some methods rely on pre-trained models such as Generative Adversarial Networks, searching through the latent space of the generative model by using a gradient-based approach to update the latent vector, relying on loss functions such as the cosine similarity. In this work, we follow a different direction by proposing the use of Covariance Matrix Adaptation Evolution Strategy to explore the latent space of Generative Adversarial Networks. We compare this approach to the one using Adam and a hybrid strategy. We design an experimental study to compare the three approaches using different text inputs for image generation by adapting an evaluation method based on the projection of the resulting samples into a two-dimensional grid to inspect the diversity of the distributions. The results evidence that the evolutionary method achieves more diversity in the generation of samples, exploring different regions of the resulting grids. Besides, we show that the hybrid method combines the explored areas of the gradient-based and evolutionary approaches, leveraging the quality of the results. ",
    "url": "https://arxiv.org/abs/2207.02907",
    "authors": [
      "Victor Costa",
      "Nuno Lourenço",
      "João Correia",
      "Penousal Machado"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2207.02911",
    "title": "A Survey on Hyperlink Prediction",
    "abstract": "As a natural extension of link prediction on graphs, hyperlink prediction aims for the inference of missing hyperlinks in hypergraphs, where a hyperlink can connect more than two nodes. Hyperlink prediction has applications in a wide range of systems, from chemical reaction networks, social communication networks, to protein-protein interaction networks. In this paper, we provide a systematic and comprehensive survey on hyperlink prediction. We propose a new taxonomy to classify existing hyperlink prediction methods into four categories: similarity-based, probability-based, matrix optimization-based, and deep learning-based methods. To compare the performance of methods from different categories, we perform a benchmark study on various hypergraph applications using representative methods from each category. Notably, deep learning-based methods prevail over other methods in hyperlink prediction. ",
    "url": "https://arxiv.org/abs/2207.02911",
    "authors": [
      "Can Chen",
      "Yang-Yu Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2207.02917",
    "title": "On The Universality of Diagrams for Causal Inference and The Causal  Reproducing Property",
    "abstract": "We propose Universal Causality, an overarching framework based on category theory that defines the universal property that underlies causal inference independent of the underlying representational formalism used. More formally, universal causal models are defined as categories consisting of objects and morphisms between them representing causal influences, as well as structures for carrying out interventions (experiments) and evaluating their outcomes (observations). Functors map between categories, and natural transformations map between a pair of functors across the same two categories. Abstract causal diagrams in our framework are built using universal constructions from category theory, including the limit or co-limit of an abstract causal diagram, or more generally, the Kan extension. We present two foundational results in universal causal inference. The first result, called the Universal Causality Theorem (UCT), pertains to the universality of diagrams, which are viewed as functors mapping both objects and relationships from an indexing category of abstract causal diagrams to an actual causal model whose nodes are labeled by random variables, and edges represent functional or probabilistic relationships. UCT states that any causal inference can be represented in a canonical way as the co-limit of an abstract causal diagram of representable objects. UCT follows from a basic result in the theory of sheaves. The second result, the Causal Reproducing Property (CRP), states that any causal influence of a object X on another object Y is representable as a natural transformation between two abstract causal diagrams. CRP follows from the Yoneda Lemma, one of the deepest results in category theory. The CRP property is analogous to the reproducing property in Reproducing Kernel Hilbert Spaces that served as the foundation for kernel methods in machine learning. ",
    "url": "https://arxiv.org/abs/2207.02917",
    "authors": [
      "Sridhar Mahadevan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.02918",
    "title": "Heterogeneous Anomaly Detection for Software Systems via Attentive  Multi-modal Learning",
    "abstract": "Prompt and accurate detection of system anomalies is essential to ensure the reliability of software systems. Unlike manual efforts that exploit all available run-time information, existing approaches usually leverage only a single type of monitoring data (often logs or metrics) or fail to make effective use of the joint information among multi-source data. Consequently, many false predictions occur. To better understand the manifestations of system anomalies, we conduct a comprehensive empirical study based on a large amount of heterogeneous data, i.e., logs and metrics. Our study demonstrates that system anomalies could manifest distinctly in different data types. Thus, integrating heterogeneous data can help recover the complete picture of a system's health status. In this context, we propose HADES, the first work to effectively identify system anomalies based on heterogeneous data. Our approach employs a hierarchical architecture to learn a global representation of the system status by fusing log semantics and metric patterns. It captures discriminative features and meaningful interactions from multi-modal data via a novel cross-modal attention module, enabling accurate system anomaly detection. We evaluate HADES extensively on large-scale simulated and industrial datasets. The experimental results present the superiority of HADES in detecting system anomalies on heterogeneous data. We release the code and the annotated dataset for reproducibility and future research. ",
    "url": "https://arxiv.org/abs/2207.02918",
    "authors": [
      "Baitong Li",
      "Tianyi Yang",
      "Zhuangbin Chen",
      "Yuxin Su",
      "Yongqiang Yang",
      "Michael R. Lyu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2207.02963",
    "title": "The Weaknesses of Adversarial Camouflage in Overhead Imagery",
    "abstract": "Machine learning is increasingly critical for analysis of the ever-growing corpora of overhead imagery. Advanced computer vision object detection techniques have demonstrated great success in identifying objects of interest such as ships, automobiles, and aircraft from satellite and drone imagery. Yet relying on computer vision opens up significant vulnerabilities, namely, the susceptibility of object detection algorithms to adversarial attacks. In this paper we explore the efficacy and drawbacks of adversarial camouflage in an overhead imagery context. While a number of recent papers have demonstrated the ability to reliably fool deep learning classifiers and object detectors with adversarial patches, most of this work has been performed on relatively uniform datasets and only a single class of objects. In this work we utilize the VisDrone dataset, which has a large range of perspectives and object sizes. We explore four different object classes: bus, car, truck, van. We build a library of 24 adversarial patches to disguise these objects, and introduce a patch translucency variable to our patches. The translucency (or alpha value) of the patches is highly correlated to their efficacy. Further, we show that while adversarial patches may fool object detectors, the presence of such patches is often easily uncovered, with patches on average 24% more detectable than the objects the patches were meant to hide. This raises the question of whether such patches truly constitute camouflage. Source code is available at https://github.com/IQTLabs/camolo. ",
    "url": "https://arxiv.org/abs/2207.02963",
    "authors": [
      "Adam Van Etten"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.02970",
    "title": "Network Binarization via Contrastive Learning",
    "abstract": "Neural network binarization accelerates deep models by quantizing their weights and activations into 1-bit. However, there is still a huge performance gap between Binary Neural Networks (BNNs) and their full-precision (FP) counterparts. As the quantization error caused by weights binarization has been reduced in earlier works, the activations binarization becomes the major obstacle for further improvement of the accuracy. BNN characterises a unique and interesting structure, where the binary and latent FP activations exist in the same forward pass (\\textit{i.e.} $\\text{Binarize}(\\mathbf{a}_F) = \\mathbf{a}_B$). To mitigate the information degradation caused by the binarization operation from FP to binary activations, we establish a novel contrastive learning framework while training BNNs through the lens of Mutual Information (MI) maximization. MI is introduced as the metric to measure the information shared between binary and FP activations, which assists binarization with contrastive learning. Specifically, the representation ability of the BNNs is greatly strengthened via pulling the positive pairs with binary and FP activations from the same input samples, as well as pushing negative pairs from different samples (the number of negative pairs can be exponentially large). This benefits the downstream tasks, not only classification but also segmentation and depth estimation,~\\textit{etc}. The experimental results show that our method can be implemented as a pile-up module on existing state-of-the-art binarization methods and can remarkably improve the performance over them on CIFAR-10/100 and ImageNet, in addition to the great generalization ability on NYUD-v2. ",
    "url": "https://arxiv.org/abs/2207.02970",
    "authors": [
      "Yuzhang Shang",
      "Dan Xu",
      "Ziliang Zong",
      "Yan Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.02978",
    "title": "Extending Logical Neural Networks using First-Order Theories",
    "abstract": "Logical Neural Networks (LNNs) are a type of architecture which combine a neural network's abilities to learn and systems of formal logic's abilities to perform symbolic reasoning. LLNs provide programmers the ability to implicitly modify the underlying structure of the neural network via logical formulae. In this paper, we take advantage of this abstraction to extend LNNs to support equality and function symbols via first-order theories. This extension improves the power of LNNs by significantly increasing the types of problems they can tackle. As a proof of concept, we add support for the first-order theory of equality to IBM's LNN library and demonstrate how the introduction of this allows the LNN library to now reason about expressions without needing to make the unique-names assumption. ",
    "url": "https://arxiv.org/abs/2207.02978",
    "authors": [
      "Aidan Evans",
      "Jorge Blanco"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2207.03020",
    "title": "Mechanisms of True and False Rumor Sharing in Social Media:  Wisdom-of-Crowds or Herd Behavior?",
    "abstract": "Social media platforms disseminate extensive volumes of online content, including true and, in particular, false rumors. Previous literature has studied the diffusion of offline rumors, yet more research is needed to understand the diffusion of online rumors. In this paper, we examine the role of lifetime and crowd effects in social media sharing behavior for true vs. false rumors. Based on 126,301 Twitter cascades, we find that the sharing behavior is characterized by lifetime and crowd effects that explain differences in the spread of true as opposed to false rumors. All else equal, we find that a longer lifetime is associated with less sharing activities, yet the reduction in sharing is larger for false than for true rumors. Hence, lifetime is an important determinant explaining why false rumors die out. Furthermore, we find that the spread of false rumors is characterized by herding tendencies (rather than wisdom of crowds), whereby the spread of false rumors becomes proliferated at a larger retweet depth. These findings explain differences in the diffusion dynamics of true and false rumors and further offer practical implications for social media platforms. ",
    "url": "https://arxiv.org/abs/2207.03020",
    "authors": [
      "Nicolas Pröllochs",
      "Stefan Feuerriegel"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2207.03026",
    "title": "Constrained Heterogeneous Two-facility Location Games with Max-variant  Cost",
    "abstract": "In this paper, we propose a constrained heterogeneous facility location model where a set of alternative locations are feasible for building facilities and the number of facilities built at each location is limited. Supposing that a set of agents on the real line can strategically report their locations and each agent's cost is her distance to the further facility that she is interested in, we study deterministic mechanism design without money for constrained heterogeneous two-facility location games. Depending on whether agents have optional preference, the problem is considered in two settings: the compulsory setting and the optional setting. In the compulsory setting where each agent is served by the two heterogeneous facilities, we provide a 3-approximate deterministic group strategyproof mechanism for the sum/maximum cost objective respectively, which is also the best deterministic strategyproof mechanism under the corresponding social objective. In the optional setting where each agent can be interested in one of the two facilities or both, we propose a deterministic group strategyproof mechanism with approximation ratio of at most $2n+1$ for the sum cost objective and a deterministic group strategyproof mechanism with approximation ratio of at most 9 for the maximum cost objective. ",
    "url": "https://arxiv.org/abs/2207.03026",
    "authors": [
      "Qi Zhao",
      "Wenjing Liu",
      "Qizhi Fang",
      "Qingqin Nong"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2207.03031",
    "title": "FedHeN: Federated Learning in Heterogeneous Networks",
    "abstract": "We propose a novel training recipe for federated learning with heterogeneous networks where each device can have different architectures. We introduce training with a side objective to the devices of higher complexities to jointly train different architectures in a federated setting. We empirically show that our approach improves the performance of different architectures and leads to high communication savings compared to the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2207.03031",
    "authors": [
      "Durmus Alp Emre Acar",
      "Venkatesh Saligrama"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2207.03037",
    "title": "Sensitivity Analysis on Transferred Neural Architectures of BERT and  GPT-2 for Financial Sentiment Analysis",
    "abstract": "The explosion in novel NLP word embedding and deep learning techniques has induced significant endeavors into potential applications. One of these directions is in the financial sector. Although there is a lot of work done in state-of-the-art models like GPT and BERT, there are relatively few works on how well these methods perform through fine-tuning after being pre-trained, as well as info on how sensitive their parameters are. We investigate the performance and sensitivity of transferred neural architectures from pre-trained GPT-2 and BERT models. We test the fine-tuning performance based on freezing transformer layers, batch size, and learning rate. We find the parameters of BERT are hypersensitive to stochasticity in fine-tuning and that GPT-2 is more stable in such practice. It is also clear that the earlier layers of GPT-2 and BERT contain essential word pattern information that should be maintained. ",
    "url": "https://arxiv.org/abs/2207.03037",
    "authors": [
      "Tracy Qian",
      "Andy Xie",
      "Camille Bruckmann"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2207.03046",
    "title": "Self-Supervised RF Signal Representation Learning for NextG Signal  Classification with Deep Learning",
    "abstract": "Deep learning (DL) finds rich applications in the wireless domain to improve spectrum awareness. Typically, the DL models are either randomly initialized following a statistical distribution or pretrained on tasks from other data domains such as computer vision (in the form of transfer learning) without accounting for the unique characteristics of wireless signals. Self-supervised learning enables the learning of useful representations from Radio Frequency (RF) signals themselves even when only limited training data samples with labels are available. We present the first self-supervised RF signal representation learning model and apply it to the automatic modulation recognition (AMR) task by specifically formulating a set of transformations to capture the wireless signal characteristics. We show that the sample efficiency (the number of labeled samples required to achieve a certain accuracy performance) of AMR can be significantly increased (almost an order of magnitude) by learning signal representations with self-supervised learning. This translates to substantial time and cost savings. Furthermore, self-supervised learning increases the model accuracy compared to the state-of-the-art DL methods and maintains high accuracy even when a small set of training data samples is used. ",
    "url": "https://arxiv.org/abs/2207.03046",
    "authors": [
      "Kemal Davaslioglu",
      "Serdar Boztas",
      "Mehmet Can Ertem",
      "Yalin E. Sagduyu",
      "Ender Ayanoglu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2207.03047",
    "title": "Single-image Defocus Deblurring by Integration of Defocus Map Prediction  Tracing the Inverse Problem Computation",
    "abstract": "In this paper, we consider the problem in defocus image deblurring. Previous classical methods follow two-steps approaches, i.e., first defocus map estimation and then the non-blind deblurring. In the era of deep learning, some researchers have tried to address these two problems by CNN. However, the simple concatenation of defocus map, which represents the blur level, leads to suboptimal performance. Considering the spatial variant property of the defocus blur and the blur level indicated in the defocus map, we employ the defocus map as conditional guidance to adjust the features from the input blurring images instead of simple concatenation. Then we propose a simple but effective network with spatial modulation based on the defocus map. To achieve this, we design a network consisting of three sub-networks, including the defocus map estimation network, a condition network that encodes the defocus map into condition features, and the defocus deblurring network that performs spatially dynamic modulation based on the condition features. Moreover, the spatially dynamic modulation is based on an affine transform function to adjust the features from the input blurry images. Experimental results show that our method can achieve better quantitative and qualitative evaluation performance than the existing state-of-the-art methods on the commonly used public test datasets. ",
    "url": "https://arxiv.org/abs/2207.03047",
    "authors": [
      "Qian Ye",
      "Masanori Suganuma",
      "Takayuki Okatani"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2207.03061",
    "title": "Back to the Basics: Revisiting Out-of-Distribution Detection Baselines",
    "abstract": "We study simple methods for out-of-distribution (OOD) image detection that are compatible with any already trained classifier, relying on only its predictions or learned representations. Evaluating the OOD detection performance of various methods when utilized with ResNet-50 and Swin Transformer models, we find methods that solely consider the model's predictions can be easily outperformed by also considering the learned representations. Based on our analysis, we advocate for a dead-simple approach that has been neglected in other studies: simply flag as OOD images whose average distance to their K nearest neighbors is large (in the representation space of an image classifier trained on the in-distribution data). ",
    "url": "https://arxiv.org/abs/2207.03061",
    "authors": [
      "Johnson Kuan",
      "Jonas Mueller"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2207.03065",
    "title": "Contrastive Learning from Spatio-Temporal Mixed Skeleton Sequences for  Self-Supervised Skeleton-Based Action Recognition",
    "abstract": "Self-supervised skeleton-based action recognition with contrastive learning has attracted much attention. Recent literature shows that data augmentation and large sets of contrastive pairs are crucial in learning such representations. In this paper, we found that directly extending contrastive pairs based on normal augmentations brings limited returns in terms of performance, because the contribution of contrastive pairs from the normal data augmentation to the loss get smaller as training progresses. Therefore, we delve into hard contrastive pairs for contrastive learning. Motivated by the success of mixing augmentation strategy which improves the performance of many tasks by synthesizing novel samples, we propose SkeleMixCLR: a contrastive learning framework with a spatio-temporal skeleton mixing augmentation (SkeleMix) to complement current contrastive learning approaches by providing hard contrastive samples. First, SkeleMix utilizes the topological information of skeleton data to mix two skeleton sequences by randomly combing the cropped skeleton fragments (the trimmed view) with the remaining skeleton sequences (the truncated view). Second, a spatio-temporal mask pooling is applied to separate these two views at the feature level. Third, we extend contrastive pairs with these two views. SkeleMixCLR leverages the trimmed and truncated views to provide abundant hard contrastive pairs since they involve some context information from each other due to the graph convolution operations, which allows the model to learn better motion representations for action recognition. Extensive experiments on NTU-RGB+D, NTU120-RGB+D, and PKU-MMD datasets show that SkeleMixCLR achieves state-of-the-art performance. Codes are available at https://github.com/czhaneva/SkeleMixCLR. ",
    "url": "https://arxiv.org/abs/2207.03065",
    "authors": [
      "Zhan Chen",
      "Hong Liu",
      "Tianyu Guo",
      "Zhengyan Chen",
      "Pinhao Song",
      "Hao Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.03067",
    "title": "Cross-Scale Vector Quantization for Scalable Neural Speech Coding",
    "abstract": "Bitrate scalability is a desirable feature for audio coding in real-time communications. Existing neural audio codecs usually enforce a specific bitrate during training, so different models need to be trained for each target bitrate, which increases the memory footprint at the sender and the receiver side and transcoding is often needed to support multiple receivers. In this paper, we introduce a cross-scale scalable vector quantization scheme (CSVQ), in which multi-scale features are encoded progressively with stepwise feature fusion and refinement. In this way, a coarse-level signal is reconstructed if only a portion of the bitstream is received, and progressively improves the quality as more bits are available. The proposed CSVQ scheme can be flexibly applied to any neural audio coding network with a mirrored auto-encoder structure to achieve bitrate scalability. Subjective results show that the proposed scheme outperforms the classical residual VQ (RVQ) with scalability. Moreover, the proposed CSVQ at 3 kbps outperforms Opus at 9 kbps and Lyra at 3kbps and it could provide a graceful quality boost with bitrate increase. ",
    "url": "https://arxiv.org/abs/2207.03067",
    "authors": [
      "Xue Jiang",
      "Xiulian Peng",
      "Huaying Xue",
      "Yuan Zhang",
      "Yan Lu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2207.03086",
    "title": "Word Embedding for Social Sciences: An Interdisciplinary Survey",
    "abstract": "To extract essential information from complex data, computer scientists have been developing machine learning models that learn low-dimensional representation mode. From such advances in machine learning research, not only computer scientists but also social scientists have benefited and advanced their research because human behavior or social phenomena lies in complex data. To document this emerging trend, we survey the recent studies that apply word embedding techniques to human behavior mining, building a taxonomy to illustrate the methods and procedures used in the surveyed papers and highlight the recent emerging trends applying word embedding models to non-textual human behavior data. This survey conducts a simple experiment to warn that common similarity measurements used in the literature could yield different results even if they return consistent results at an aggregate level. ",
    "url": "https://arxiv.org/abs/2207.03086",
    "authors": [
      "Akira Matsui",
      "Emilio Ferrara"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.03111",
    "title": "Masked Surfel Prediction for Self-Supervised Point Cloud Learning",
    "abstract": "Masked auto-encoding is a popular and effective self-supervised learning approach to point cloud learning. However, most of the existing methods reconstruct only the masked points and overlook the local geometry information, which is also important to understand the point cloud data. In this work, we make the first attempt, to the best of our knowledge, to consider the local geometry information explicitly into the masked auto-encoding, and propose a novel Masked Surfel Prediction (MaskSurf) method. Specifically, given the input point cloud masked at a high ratio, we learn a transformer-based encoder-decoder network to estimate the underlying masked surfels by simultaneously predicting the surfel positions (i.e., points) and per-surfel orientations (i.e., normals). The predictions of points and normals are supervised by the Chamfer Distance and a newly introduced Position-Indexed Normal Distance in a set-to-set manner. Our MaskSurf is validated on six downstream tasks under three fine-tuning strategies. In particular, MaskSurf outperforms its closest competitor, Point-MAE, by 1.2\\% on the real-world dataset of ScanObjectNN under the OBJ-BG setting, justifying the advantages of masked surfel prediction over masked point cloud reconstruction. Codes will be available at https://github.com/YBZh/MaskSurf. ",
    "url": "https://arxiv.org/abs/2207.03111",
    "authors": [
      "Yabin Zhang",
      "Jiehong Lin",
      "Chenhang He",
      "Yongwei Chen",
      "Kui Jia",
      "Lei Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.03116",
    "title": "Equivariant Representation Learning via Class-Pose Decomposition",
    "abstract": "We introduce a general method for learning representations that are equivariant to symmetries of data. The central idea is to to decompose the latent space in an invariant factor and the symmetry group itself. The components semantically correspond to intrinsic data classes and poses respectively. The learner is self-supervised and infers these semantics based on relative symmetry information. The approach is motivated by theoretical results from group theory and guarantees representations that are lossless, interpretable and disentangled. We empirically investigate the approach via experiments involving datasets with a variety of symmetries. Results show that our representations capture the geometry of data and outperform other equivariant representation learning frameworks. ",
    "url": "https://arxiv.org/abs/2207.03116",
    "authors": [
      "Giovanni Luca Marchetti",
      "Gustaf Tegnér",
      "Anastasiia Varava",
      "Danica Kragic"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Group Theory (math.GR)"
    ]
  },
  {
    "id": "arXiv:2207.03145",
    "title": "Active Learning and Multi-label Classification for Ellipsis and  Coreference Detection in Conversational Question-Answering",
    "abstract": "In human conversations, ellipsis and coreference are commonly occurring linguistic phenomena. Although these phenomena are a mean of making human-machine conversations more fluent and natural, only few dialogue corpora contain explicit indications on which turns contain ellipses and/or coreferences. In this paper we address the task of automatically detecting ellipsis and coreferences in conversational question answering. We propose to use a multi-label classifier based on DistilBERT. Multi-label classification and active learning are employed to compensate the limited amount of labeled data. We show that these methods greatly enhance the performance of the classifier for detecting these phenomena on a manually labeled dataset. ",
    "url": "https://arxiv.org/abs/2207.03145",
    "authors": [
      "Quentin Brabant",
      "Lina Maria Rojas-Barahona",
      "Claire Gardent"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2207.03146",
    "title": "Self-Supervised Velocity Estimation for Automotive Radar Object  Detection Networks",
    "abstract": "This paper presents a method to learn the Cartesian velocity of objects using an object detection network on automotive radar data. The proposed method is self-supervised in terms of generating its own training signal for the velocities. Labels are only required for single-frame, oriented bounding boxes (OBBs). Labels for the Cartesian velocities or contiguous sequences, which are expensive to obtain, are not required. The general idea is to pre-train an object detection network without velocities using single-frame OBB labels, and then exploit the network's OBB predictions on unlabelled data for velocity training. In detail, the network's OBB predictions of the unlabelled frames are updated to the timestamp of a labelled frame using the predicted velocities and the distances between the updated OBBs of the unlabelled frame and the OBB predictions of the labelled frame are used to generate a self-supervised training signal for the velocities. The detection network architecture is extended by a module to account for the temporal relation of multiple scans and a module to represent the radars' radial velocity measurements explicitly. A two-step approach of first training only OBB detection, followed by training OBB detection and velocities is used. Further, a pre-training with pseudo-labels generated from radar radial velocity measurements bootstraps the self-supervised method of this paper. Experiments on the publicly available nuScenes dataset show that the proposed method almost reaches the velocity estimation performance of a fully supervised training, but does not require expensive velocity labels. Furthermore, we outperform a baseline method which uses only radial velocity measurements as labels. ",
    "url": "https://arxiv.org/abs/2207.03146",
    "authors": [
      "Daniel Niederlöhner",
      "Michael Ulrich",
      "Sascha Braun",
      "Daniel Köhler",
      "Florian Faion",
      "Claudius Gläser",
      "André Treptow",
      "Holger Blume"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2207.03149",
    "title": "Energy-Efficient Communication Networks via Multiple Aerial  Reconfigurable Intelligent Surfaces: DRL and Optimization Approach",
    "abstract": "In the realm of wireless communications in 5G, 6G and beyond, deploying unmanned aerial vehicle (UAV) has been an innovative approach to extend the coverage area due to its easy deployment. Moreover, reconfigurable intelligent surface (RIS) has also emerged as a new paradigm with the goals of enhancing the average sum-rate as well as energy efficiency. By combining these attractive features, an energy-efficient RIS-mounted multiple UAVs (aerial RISs: ARISs) assisted downlink communication system is studied. Due to the obstruction, user equipments (UEs) can have a poor line of sight to communicate with the base station (BS). To solve this, multiple ARISs are implemented to assist the communication between the BS and UEs. Then, the joint optimization problem of deployment of ARIS, ARIS reflective elements on/off states, phase shift, and power control of the multiple ARISs-assisted communication system is formulated. The problem is challenging to solve since it is mixed-integer, non-convex, and NP-hard. To overcome this, it is decomposed into three sub-problems. Afterwards, successive convex approximation (SCA), actor-critic proximal policy optimization (AC-PPO), and whale optimization algorithm (WOA) are employed to solve these sub-problems alternatively. Finally, extensive simulation results have been generated to illustrate the efficacy of our proposed algorithms. ",
    "url": "https://arxiv.org/abs/2207.03149",
    "authors": [
      "Pyae Sone Aung",
      "Yu Min Park",
      "Yan Kyaw Tun",
      "Zhu Han",
      "Choong Seon Hong"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2207.03160",
    "title": "DLME: Deep Local-flatness Manifold Embedding",
    "abstract": "Manifold learning~(ML) aims to find low-dimensional embedding from high-dimensional data. Previous works focus on handcraft or easy datasets with simple and ideal scenarios; however, we find they perform poorly on real-world datasets with under-sampling data. Generally, ML methods primarily model data structure and subsequently process a low-dimensional embedding, where the poor local connectivity of under-sampling data in the former step and inappropriate optimization objectives in the later step will lead to \\emph{structural distortion} and \\emph{underconstrained embedding}. To solve this problem, we propose Deep Local-flatness Manifold Embedding (DLME), a novel ML framework to obtain reliable manifold embedding by reducing distortion. Our proposed DLME constructs semantic manifolds by data augmentation and overcomes \\emph{structural distortion} problems with the help of its smooth framework. To overcome \\emph{underconstrained embedding}, we design a specific loss for DLME and mathematically demonstrate that it leads to a more suitable embedding based on our proposed Local Flatness Assumption. In the experiments, by showing the effectiveness of DLME on downstream classification, clustering, and visualization tasks with three types of datasets (toy, biological, and image), our experimental results show that DLME outperforms SOTA ML \\& contrastive learning (CL) methods. ",
    "url": "https://arxiv.org/abs/2207.03160",
    "authors": [
      "Zelin Zang",
      "Siyuan Li",
      "Di Wu",
      "Ge Wang",
      "Lei Shang",
      "Baigui Sun",
      "Hao Li",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.03172",
    "title": "FastHebb: Scaling Hebbian Training of Deep Neural Networks to ImageNet  Level",
    "abstract": "Learning algorithms for Deep Neural Networks are typically based on supervised end-to-end Stochastic Gradient Descent (SGD) training with error backpropagation (backprop). Backprop algorithms require a large number of labelled training samples to achieve high performance. However, in many realistic applications, even if there is plenty of image samples, very few of them are labelled, and semi-supervised sample-efficient training strategies have to be used. Hebbian learning represents a possible approach towards sample efficient training; however, in current solutions, it does not scale well to large datasets. In this paper, we present FastHebb, an efficient and scalable solution for Hebbian learning which achieves higher efficiency by 1) merging together update computation and aggregation over a batch of inputs, and 2) leveraging efficient matrix multiplication algorithms on GPU. We validate our approach on different computer vision benchmarks, in a semi-supervised learning scenario. FastHebb outperforms previous solutions by up to 50 times in terms of training speed, and notably, for the first time, we are able to bring Hebbian algorithms to ImageNet scale. ",
    "url": "https://arxiv.org/abs/2207.03172",
    "authors": [
      "Gabriele Lagani",
      "Claudio Gennaro",
      "Hannes Fassold",
      "Giuseppe Amato"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.03178",
    "title": "Evolutionary Stability of Other-Regarding Preferences Under Complexity  Costs",
    "abstract": "The evolution of preferences that account for other agents' fitness, or other-regarding preferences, has been modeled with the \"indirect approach\" to evolutionary game theory. Under the indirect evolutionary approach, agents make decisions by optimizing a subjective utility function. Evolution may select for subjective preferences that differ from the fitness function, and in particular, subjective preferences for increasing or reducing other agents' fitness. However, indirect evolutionary models typically artificially restrict the space of strategies that agents might use (assuming that agents always play a Nash equilibrium under their subjective preferences), and dropping this restriction can undermine the finding that other-regarding preferences are selected for. Can the indirect evolutionary approach still be used to explain the apparent existence of other-regarding preferences, like altruism, in humans? We argue that it can, by accounting for the costs associated with the complexity of strategies, giving (to our knowledge) the first account of the relationship between strategy complexity and the evolution of preferences. Our model formalizes the intuition that agents face tradeoffs between the low cognitive cost of simple strategies within a single context, and the ability of more complex (subjective utility-maximizing) strategies to interpolate across contexts. For a single game, these penalties lead to selection for a simple fixed-action strategy, but across games, when there is a sufficiently large penalty on a strategy's number of context-specific parameters, a strategy of maximizing subjective (other-regarding) utility is stable again. Overall, our analysis provides a more nuanced picture of when other-regarding preferences will evolve. ",
    "url": "https://arxiv.org/abs/2207.03178",
    "authors": [
      "Anthony DiGiovanni",
      "Nicolas Macé",
      "Jesse Clifton"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2207.03181",
    "title": "A Distributed Diffusion Kalman Filter In Multitask Networks",
    "abstract": "The Distributed Diffusion Kalman Filter (DDKF) algorithm in all its magnitude has earned great attention lately and has shown an elaborate way to address the issue of distributed optimization over networks. Estimation and tracking of a single state vector collectively by nodes have been the point of focus. In reality, however, there are several multi-task-oriented issues where the optimal state vector for each node may not be the same. Its objective is to know many related tasks simultaneously, rather than the typical single-task problems. This work considers sensor networks for distributed multi-task tracking in which individual nodes communicate with its immediate nodes. A diffusion-based distributed multi-task tracking algorithm is developed. This is done by implementing an unsupervised adaptive clustering process, which aids nodes in forming clusters and collaborating on tasks. For distributed target tracking, an adaptive clustering approach, which gives agents the ability to identify and select through adaptive adjustments of combination weights nodes who to collaborate with and who not to in order to estimate the common state vector. This gave rise to an effective level of cooperation for improving state vector estimation accuracy, especially in cases where a cluster's background experience is unknown. To demonstrate the efficiency of our algorithm, computer simulations were conducted. Comparison has been carried out for the Diffusion Kalman Filter multitask with respect to the Adapt then combine (ATC) diffusion schemes utilizing both static and adaptive combination weights. Results showed that the ATC diffusion schemes algorithm has great performance with the adaptive combiners as compared to static combiners. ",
    "url": "https://arxiv.org/abs/2207.03181",
    "authors": [
      "Ijeoma Amuche Chikwendu",
      "Kulevome Delanyo Kwame Bensah",
      "Chiagoziem Chima Ukwuoma",
      "Chukwuebuka Joseph Ejiyi"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2207.03190",
    "title": "Self-Supervised Learning of Music-Dance Representation through  Explicit-Implicit Rhythm Synchronization",
    "abstract": "Although audio-visual representation has been proved to be applicable in many downstream tasks, the representation of dancing videos, which is more specific and always accompanied by music with complex auditory contents, remains challenging and uninvestigated. Considering the intrinsic alignment between the cadent movement of dancer and music rhythm, we introduce MuDaR, a novel Music-Dance Representation learning framework to perform the synchronization of music and dance rhythms both in explicit and implicit ways. Specifically, we derive the dance rhythms based on visual appearance and motion cues inspired by the music rhythm analysis. Then the visual rhythms are temporally aligned with the music counterparts, which are extracted by the amplitude of sound intensity. Meanwhile, we exploit the implicit coherence of rhythms implied in audio and visual streams by contrastive learning. The model learns the joint embedding by predicting the temporal consistency between audio-visual pairs. The music-dance representation, together with the capability of detecting audio and visual rhythms, can further be applied to three downstream tasks: (a) dance classification, (b) music-dance retrieval, and (c) music-dance retargeting. Extensive experiments demonstrate that our proposed framework outperforms other self-supervised methods by a large margin. ",
    "url": "https://arxiv.org/abs/2207.03190",
    "authors": [
      "Jiashuo Yu",
      "Junfu Pu",
      "Ying Cheng",
      "Rui Feng",
      "Ying Shan"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2207.03205",
    "title": "Dual Stream Computer-Generated Image Detection Network Based On Channel  Joint And Softpool",
    "abstract": "With the development of computer graphics technology, the images synthesized by computer software become more and more closer to the photographs. While computer graphics technology brings us a grand visual feast in the field of games and movies, it may also be utilized by someone with bad intentions to guide public opinions and cause political crisis or social unrest. Therefore, how to distinguish the computer-generated graphics (CG) from the photographs (PG) has become an important topic in the field of digital image forensics. This paper proposes a dual stream convolutional neural network based on channel joint and softpool. The proposed network architecture includes a residual module for extracting image noise information and a joint channel information extraction module for capturing the shallow semantic information of image. In addition, we also design a residual structure to enhance feature extraction and reduce the loss of information in residual flow. The joint channel information extraction module can obtain the shallow semantic information of the input image which can be used as the information supplement block of the residual module. The whole network uses SoftPool to reduce the information loss of down-sampling for image. Finally, we fuse the two flows to get the classification results. Experiments on SPL2018 and DsTok show that the proposed method outperforms existing methods, especially on the DsTok dataset. For example, the performance of our model surpasses the state-of-the-art by a large margin of 3%. ",
    "url": "https://arxiv.org/abs/2207.03205",
    "authors": [
      "Ziyi Xi",
      "Hao Lin",
      "Weiqi Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.03206",
    "title": "Leveraging Log Instructions in Log-based Anomaly Detection",
    "abstract": "Artificial Intelligence for IT Operations (AIOps) describes the process of maintaining and operating large IT systems using diverse AI-enabled methods and tools for, e.g., anomaly detection and root cause analysis, to support the remediation, optimization, and automatic initiation of self-stabilizing IT activities. The core step of any AIOps workflow is anomaly detection, typically performed on high-volume heterogeneous data such as log messages (logs), metrics (e.g., CPU utilization), and distributed traces. In this paper, we propose a method for reliable and practical anomaly detection from system logs. It overcomes the common disadvantage of related works, i.e., the need for a large amount of manually labeled training data, by building an anomaly detection model with log instructions from the source code of 1000+ GitHub projects. The instructions from diverse systems contain rich and heterogenous information about many different normal and abnormal IT events and serve as a foundation for anomaly detection. The proposed method, named ADLILog, combines the log instructions and the data from the system of interest (target system) to learn a deep neural network model through a two-phase learning procedure. The experimental results show that ADLILog outperforms the related approaches by up to 60% on the F1 score while satisfying core non-functional requirements for industrial deployments such as unsupervised design, efficient model updates, and small model sizes. ",
    "url": "https://arxiv.org/abs/2207.03206",
    "authors": [
      "Jasmin Bogatinovski",
      "Gjorgji Madjarov",
      "Sasho Nedelkoski",
      "Jorge Cardoso",
      "Odej Kao"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.03225",
    "title": "Towards Immediate Feedback for Security Relevant Code in Development  Environments",
    "abstract": "Nowadays, the correct use of cryptography libraries is essential to ensure the necessary information security in different kinds of applications. A common practice in software development is the use of static application security testing (SAST) tools to analyze code regarding security vulnerabilities. Most of these tools are designed to run separately from development environments. Their results are extensive lists of security notifications, which software developers have to inspect manually in a time-consuming follow-up step. To support developers in their tasks of developing secure code, we present an approach for providing them with continuous immediate feedback of SAST tools in integrated development environments (IDEs). Our approach also considers the understandability of security notifications and aims for a user-centered approach that leverages developers' feedback to build an adaptive system tailored to each individual developer. ",
    "url": "https://arxiv.org/abs/2207.03225",
    "authors": [
      "Markus Haug Ana Cristina Franco Da Silva",
      "Stefan Wagner"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2207.03253",
    "title": "Robust optimal well control using an adaptive multi-grid reinforcement  learning framework",
    "abstract": "Reinforcement learning (RL) is a promising tool to solve robust optimal well control problems where the model parameters are highly uncertain, and the system is partially observable in practice. However, RL of robust control policies often relies on performing a large number of simulations. This could easily become computationally intractable for cases with computationally intensive simulations. To address this bottleneck, an adaptive multi-grid RL framework is introduced which is inspired by principles of geometric multi-grid methods used in iterative numerical algorithms. RL control policies are initially learned using computationally efficient low fidelity simulations using coarse grid discretization of the underlying partial differential equations (PDEs). Subsequently, the simulation fidelity is increased in an adaptive manner towards the highest fidelity simulation that correspond to finest discretization of the model domain. The proposed framework is demonstrated using a state-of-the-art, model-free policy-based RL algorithm, namely the Proximal Policy Optimisation (PPO) algorithm. Results are shown for two case studies of robust optimal well control problems which are inspired from SPE-10 model 2 benchmark case studies. Prominent gains in the computational efficiency is observed using the proposed framework saving around 60-70% of computational cost of its single fine-grid counterpart. ",
    "url": "https://arxiv.org/abs/2207.03253",
    "authors": [
      "Atish Dixit",
      "Ahmed H. ElSheikh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.03264",
    "title": "A Solver + Gradient Descent Training Algorithm for Deep Neural Networks",
    "abstract": "We present a novel hybrid algorithm for training Deep Neural Networks that combines the state-of-the-art Gradient Descent (GD) method with a Mixed Integer Linear Programming (MILP) solver, outperforming GD and variants in terms of accuracy, as well as resource and data efficiency for both regression and classification tasks. Our GD+Solver hybrid algorithm, called GDSolver, works as follows: given a DNN $D$ as input, GDSolver invokes GD to partially train $D$ until it gets stuck in a local minima, at which point GDSolver invokes an MILP solver to exhaustively search a region of the loss landscape around the weight assignments of $D$'s final layer parameters with the goal of tunnelling through and escaping the local minima. The process is repeated until desired accuracy is achieved. In our experiments, we find that GDSolver not only scales well to additional data and very large model sizes, but also outperforms all other competing methods in terms of rates of convergence and data efficiency. For regression tasks, GDSolver produced models that, on average, had 31.5% lower MSE in 48% less time, and for classification tasks on MNIST and CIFAR10, GDSolver was able to achieve the highest accuracy over all competing methods, using only 50% of the training data that GD baselines required. ",
    "url": "https://arxiv.org/abs/2207.03264",
    "authors": [
      "Dhananjay Ashok",
      "Vineel Nagisetty",
      "Christopher Srinivasa",
      "Vijay Ganesh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2207.03286",
    "title": "Tractable Data Enriched Distributionally Robust Chance-Constrained CVR",
    "abstract": "This paper proposes a tractable distributionally robust chance-constrained conservation voltage reduction (DRCC-CVR) method with enriched data-based ambiguity set in unbalanced three-phase distribution systems. The increasing penetration of distributed renewable energy not only brings clean power but also challenges the voltage regulation and energy-saving performance of CVR by introducing high uncertainties to distribution systems. In most cases, the conventional robust optimization methods for CVR only provide conservative solutions. To better consider the impacts of load and PV generation uncertainties on CVR implementation in distribution systems and provide less conservative solutions, this paper develops a data-based DRCC-CVR model with tractable reformulation and data enrichment method. Even though the uncertainties of load and photovoltaic (PV) can be captured by data, the availability of smart meters (SMs) and micro-phasor measurement units (PMUs) is restricted by cost budget. The limited data access may hinder the performance of the proposed DRCC-CVR. Thus, we further present a data enrichment method to statistically recover the high-resolution load and PV generation data from low-resolution data with Gaussian Process Regression (GPR) and Markov Chain (MC) models, which can be used to construct a data-based moment ambiguity set of uncertainty distributions for the proposed DRCC-CVR. Finally, the nonlinear power flow and voltage dependant load models and DRCC with moment-based ambiguity set are reformulated to be computationally tractable and tested on a real distribution feeder in Midwest U. S. to validate the effectiveness and robustness of the proposed method. ",
    "url": "https://arxiv.org/abs/2207.03286",
    "authors": [
      "Qianzhi Zhang",
      "Fankun Bu",
      "Yi Guo",
      "Zhaoyu Wang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2207.03294",
    "title": "D2HNet: Joint Denoising and Deblurring with Hierarchical Network for  Robust Night Image Restoration",
    "abstract": "Night imaging with modern smartphone cameras is troublesome due to low photon count and unavoidable noise in the imaging system. Directly adjusting exposure time and ISO ratings cannot obtain sharp and noise-free images at the same time in low-light conditions. Though many methods have been proposed to enhance noisy or blurry night images, their performances on real-world night photos are still unsatisfactory due to two main reasons: 1) Limited information in a single image and 2) Domain gap between synthetic training images and real-world photos (e.g., differences in blur area and resolution). To exploit the information from successive long- and short-exposure images, we propose a learning-based pipeline to fuse them. A D2HNet framework is developed to recover a high-quality image by deblurring and enhancing a long-exposure image under the guidance of a short-exposure image. To shrink the domain gap, we leverage a two-phase DeblurNet-EnhanceNet architecture, which performs accurate blur removal on a fixed low resolution so that it is able to handle large ranges of blur in different resolution inputs. In addition, we synthesize a D2-Dataset from HD videos and experiment on it. The results on the validation set and real photos demonstrate our methods achieve better visual quality and state-of-the-art quantitative scores. The D2HNet codes, models, and D2-Dataset can be found at https://github.com/zhaoyuzhi/D2HNet. ",
    "url": "https://arxiv.org/abs/2207.03294",
    "authors": [
      "Yuzhi Zhao",
      "Yongzhe Xu",
      "Qiong Yan",
      "Dingdong Yang",
      "Xuehui Wang",
      "Lai-Man Po"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2207.03295",
    "title": "Cooperative Backscatter NOMA with Imperfect SIC: Towards Energy  Efficient Sum Rate Maximization in Sustainable 6G Networks",
    "abstract": "The combination of backscatter communication with non-orthogonal multiple access (NOMA) has the potential to support low-powered massive connections in upcoming sixth-generation (6G) wireless networks. More specifically, backscatter communication can harvest and use the existing RF signals in the atmosphere for communication, while NOMA provides communication to multiple wireless devices over the same frequency and time resources. This paper has proposed a new resource management framework for backscatter-aided cooperative NOMA communication in upcoming 6G networks. In particular, the proposed work has simultaneously optimized the base station's transmit power, relaying node, the reflection coefficient of the backscatter tag, and time allocation under imperfect successive interference cancellation to maximize the sum rate of the system. To obtain an efficient solution for the resource management framework, we have proposed a combination of the bisection method and dual theory, where the sub-gradient method is adopted to optimize the Lagrangian multipliers. Numerical results have shown that the proposed solution provides excellent performance. When the performance of the proposed technique is compared to a brute-forcing search technique that guarantees optimal solution however, is very time-consuming, it was seen that the gap in performance is actually 0\\%. Hence, the proposed framework has provided performance equal to a cumbersome brute-force search technique while offering much less complexity. The works in the literature on cooperative NOMA considered equal time distribution for cooperation and direct communication. Our results showed that optimizing the time-division can increase the performance by more than 110\\% for high transmission powers. ",
    "url": "https://arxiv.org/abs/2207.03295",
    "authors": [
      "Manzoor Ahmed",
      "Zain Ali",
      "Wali Ullah Khan",
      "Omer Waqar",
      "Muhammad Asif",
      "Abd Ullah Khan",
      "Muhammad Awais Javed",
      "Fahd N. Al-Wesabi"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2207.03318",
    "title": "State Prediction of Human-in-the-Loop Multi-rotor System with Stochastic  Human Behavior Model",
    "abstract": "Reachability analysis is a widely used method to analyze the safety of a Human-in-the-Loop Cyber Physical System (HiLCPS). This strategy allows the HiLCPS to respond against an imminent threat in advance by predicting reachable states of the system. However, it could lead to an unnecessarily conservative reachable set if the prediction only relies on the system dynamics without explicitly considering human behavior, and thus the risk might be overestimated. To reduce the conservativeness of the reachability analysis, we present a state prediction method which takes into account a stochastic human behavior model represented as a Gaussian Mixture Model (GMM). In this paper, we focus on the multi-rotor in a near-collision situation. The stochastic human behavior model is trained using experimental data to represent human operators' evasive maneuver. Then, we can retrieve a human control input probability distribution from the trained stochastic human behavior model using the Gaussian Mixture Regression (GMR). The proposed algorithm predicts the probability distribution of the multi-rotor's future state based on the given dynamics and the retrieved human control input probability distribution. Besides, the proposed state prediction method considers the uncertainty of the initial state modeled as a GMM, which yields more robust performance. Human subject experiment results are provided to demonstrate the effectiveness of the proposed algorithm. ",
    "url": "https://arxiv.org/abs/2207.03318",
    "authors": [
      "Joonwon Choi",
      "Sooyung Byeon",
      "Inseok Hwang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2207.03332",
    "title": "Text to Image Synthesis using Stacked Conditional Variational  Autoencoders and Conditional Generative Adversarial Networks",
    "abstract": "Synthesizing a realistic image from textual description is a major challenge in computer vision. Current text to image synthesis approaches falls short of producing a highresolution image that represent a text descriptor. Most existing studies rely either on Generative Adversarial Networks (GANs) or Variational Auto Encoders (VAEs). GANs has the capability to produce sharper images but lacks the diversity of outputs, whereas VAEs are good at producing a diverse range of outputs, but the images generated are often blurred. Taking into account the relative advantages of both GANs and VAEs, we proposed a new stacked Conditional VAE (CVAE) and Conditional GAN (CGAN) network architecture for synthesizing images conditioned on a text description. This study uses Conditional VAEs as an initial generator to produce a high-level sketch of the text descriptor. This high-level sketch output from first stage and a text descriptor is used as an input to the conditional GAN network. The second stage GAN produces a 256x256 high resolution image. The proposed architecture benefits from a conditioning augmentation and a residual block on the Conditional GAN network to achieve the results. Multiple experiments were conducted using CUB and Oxford-102 dataset and the result of the proposed approach is compared against state-ofthe-art techniques such as StackGAN. The experiments illustrate that the proposed method generates a high-resolution image conditioned on text descriptions and yield competitive results based on Inception and Frechet Inception Score using both datasets ",
    "url": "https://arxiv.org/abs/2207.03332",
    "authors": [
      "Haileleol Tibebu",
      "Aadin Malik",
      "Varuna De Silva"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2207.03337",
    "title": "Factorizing Knowledge in Neural Networks",
    "abstract": "In this paper, we explore a novel and ambitious knowledge-transfer task, termed Knowledge Factorization~(KF). The core idea of KF lies in the modularization and assemblability of knowledge: given a pretrained network model as input, KF aims to decompose it into several factor networks, each of which handles only a dedicated task and maintains task-specific knowledge factorized from the source network. Such factor networks are task-wise disentangled and can be directly assembled, without any fine-tuning, to produce the more competent combined-task networks. In other words, the factor networks serve as Lego-brick-like building blocks, allowing us to construct customized networks in a plug-and-play manner. Specifically, each factor network comprises two modules, a common-knowledge module that is task-agnostic and shared by all factor networks, alongside with a task-specific module dedicated to the factor network itself. We introduce an information-theoretic objective, InfoMax-Bottleneck~(IMB), to carry out KF by optimizing the mutual information between the learned representations and input. Experiments across various benchmarks demonstrate that, the derived factor networks yield gratifying performances on not only the dedicated tasks but also disentanglement, while enjoying much better interpretability and modularity. Moreover, the learned common-knowledge representations give rise to impressive results on transfer learning. ",
    "url": "https://arxiv.org/abs/2207.03337",
    "authors": [
      "Xingyi Yang",
      "Jingwen Ye",
      "Xinchao Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.03342",
    "title": "Monkeypox Skin Lesion Detection Using Deep Learning Models: A  Feasibility Study",
    "abstract": "The recent monkeypox outbreak has become a public health concern due to its rapid spread in more than 40 countries outside Africa. Clinical diagnosis of monkeypox in an early stage is challenging due to its similarity with chickenpox and measles. In cases where the confirmatory Polymerase Chain Reaction (PCR) tests are not readily available, computer-assisted detection of monkeypox lesions could be beneficial for surveillance and rapid identification of suspected cases. Deep learning methods have been found effective in the automated detection of skin lesions, provided that sufficient training examples are available. However, as of now, such datasets are not available for the monkeypox disease. In the current study, we first develop the ``Monkeypox Skin Lesion Dataset (MSLD)\" consisting skin lesion images of monkeypox, chickenpox, and measles. The images are mainly collected from websites, news portals, and publicly accessible case reports. Data augmentation is used to increase the sample size, and a 3-fold cross-validation experiment is set up. In the next step, several pre-trained deep learning models, namely, VGG-16, ResNet50, and InceptionV3 are employed to classify monkeypox and other diseases. An ensemble of the three models is also developed. ResNet50 achieves the best overall accuracy of $82.96(\\pm4.57\\%)$, while VGG16 and the ensemble system achieved accuracies of $81.48(\\pm6.87\\%)$ and $79.26(\\pm1.05\\%)$, respectively. A prototype web-application is also developed as an online monkeypox screening tool. While the initial results on this limited dataset are promising, a larger demographically diverse dataset is required to further enhance the generalizability of these models. ",
    "url": "https://arxiv.org/abs/2207.03342",
    "authors": [
      "Shams Nafisa Ali",
      "Md. Tazuddin Ahmed",
      "Joydip Paul",
      "Tasnim Jahan",
      "S. M. Sakeef Sani",
      "Nawsabah Noor",
      "Taufiq Hasan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2207.03343",
    "title": "Refutation of Spectral Graph Theory Conjectures with Monte Carlo Search",
    "abstract": "We demonstrate how Monte Carlo Search (MCS) algorithms, namely Nested Monte Carlo Search (NMCS) and Nested Rollout Policy Adaptation (NRPA), can be used to build graphs and find counter-examples to spectral graph theory conjectures in minutes. We also refute a conjecture attributed to Peter Shor that was left open. ",
    "url": "https://arxiv.org/abs/2207.03343",
    "authors": [
      "Milo Roucairol",
      "Tristan Cazenave"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2207.03344",
    "title": "Automated Classification of General Movements in Infants Using a  Two-stream Spatiotemporal Fusion Network",
    "abstract": "The assessment of general movements (GMs) in infants is a useful tool in the early diagnosis of neurodevelopmental disorders. However, its evaluation in clinical practice relies on visual inspection by experts, and an automated solution is eagerly awaited. Recently, video-based GMs classification has attracted attention, but this approach would be strongly affected by irrelevant information, such as background clutter in the video. Furthermore, for reliability, it is necessary to properly extract the spatiotemporal features of infants during GMs. In this study, we propose an automated GMs classification method, which consists of preprocessing networks that remove unnecessary background information from GMs videos and adjust the infant's body position, and a subsequent motion classification network based on a two-stream structure. The proposed method can efficiently extract the essential spatiotemporal features for GMs classification while preventing overfitting to irrelevant information for different recording environments. We validated the proposed method using videos obtained from 100 infants. The experimental results demonstrate that the proposed method outperforms several baseline models and the existing methods. ",
    "url": "https://arxiv.org/abs/2207.03344",
    "authors": [
      "Yuki Hashimoto",
      "Akira Furui",
      "Koji Shimatani",
      "Maura Casadio",
      "Paolo Moretti",
      "Pietro Morasso",
      "Toshio Tsuji"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2207.03348",
    "title": "Human-Robot Commensality: Bite Timing Prediction for Robot-Assisted  Feeding in Groups",
    "abstract": "We develop data-driven models to predict when a robot should feed during social dining scenarios. Being able to eat independently with friends and family is considered one of the most memorable and important activities for people with mobility limitations. Robots can potentially help with this activity but robot-assisted feeding is a multi-faceted problem with challenges in bite acquisition, bite timing, and bite transfer. Bite timing in particular becomes uniquely challenging in social dining scenarios due to the possibility of interrupting a social human-robot group interaction during commensality. Our key insight is that bite timing strategies that take into account the delicate balance of social cues can lead to seamless interactions during robot-assisted feeding in a social dining scenario. We approach this problem by collecting a multimodal Human-Human Commensality Dataset (HHCD) containing 30 groups of three people eating together. We use this dataset to analyze human-human commensality behaviors and develop bite timing prediction models in social dining scenarios. We also transfer these models to human-robot commensality scenarios. Our user studies show that prediction improves when our algorithm uses multimodal social signaling cues between diners to model bite timing. The HHCD dataset, videos of user studies, and code will be publicly released after acceptance. ",
    "url": "https://arxiv.org/abs/2207.03348",
    "authors": [
      "Jan Ondras",
      "Abrar Anwar",
      "Tong Wu",
      "Fanjun Bu",
      "Malte Jung",
      "Jorge Jose Ortiz",
      "Tapomayukh Bhattacharjee"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.03367",
    "title": "Joint Super-Resolution and Inverse Tone-Mapping: A Feature Decomposition  Aggregation Network and A New Benchmark",
    "abstract": "Joint Super-Resolution and Inverse Tone-Mapping (joint SR-ITM) aims to increase the resolution and dynamic range of low-resolution and standard dynamic range images.Recent methods mainly resort to image decomposition techniques with the multi-branch network architecture.However, the rigid decomposition employed by these methods largely restricts their power on diverse images.To exploit its potential power, in this paper, we generalize the decomposition mechanism from the image domain to the broader feature domain. To this end, we propose a lightweight Feature Decomposition Aggregation Network (FDAN). In particular, we design a Feature Decomposition Block (FDB), which can achieve learnable separation of feature details and contrasts.By cascading FDBs, we can build up a Hierarchical Feature Decomposition Group for powerful multi-level feature decomposition.Moreover, we collect a new benchmark dataset for joint SR-ITM, \\ie, SRITM-4K, which is large-scale and provides versatile scenarios for sufficient model training and evaluation.Experimental results on two benchmark datasets demonstrate that our FDAN is efficient and outperforms previous methods on joint SR-ITM.Our code and dataset will be publicly released. ",
    "url": "https://arxiv.org/abs/2207.03367",
    "authors": [
      "Gang Xu",
      "Yuchen Yang",
      "Jun Xu",
      "Liang Wang",
      "Xian-Tong Zhen",
      "Ming-Ming Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.03380",
    "title": "Neural Language Models are not Born Equal to Fit Brain Data, but  Training Helps",
    "abstract": "Neural Language Models (NLMs) have made tremendous advances during the last years, achieving impressive performance on various linguistic tasks. Capitalizing on this, studies in neuroscience have started to use NLMs to study neural activity in the human brain during language processing. However, many questions remain unanswered regarding which factors determine the ability of a neural language model to capture brain activity (aka its 'brain score'). Here, we make first steps in this direction and examine the impact of test loss, training corpus and model architecture (comparing GloVe, LSTM, GPT-2 and BERT), on the prediction of functional Magnetic Resonance Imaging timecourses of participants listening to an audiobook. We find that (1) untrained versions of each model already explain significant amount of signal in the brain by capturing similarity in brain responses across identical words, with the untrained LSTM outperforming the transformerbased models, being less impacted by the effect of context; (2) that training NLP models improves brain scores in the same brain regions irrespective of the model's architecture; (3) that Perplexity (test loss) is not a good predictor of brain score; (4) that training data have a strong influence on the outcome and, notably, that off-the-shelf models may lack statistical power to detect brain activations. Overall, we outline the impact of modeltraining choices, and suggest good practices for future studies aiming at explaining the human language system using neural language models. ",
    "url": "https://arxiv.org/abs/2207.03380",
    "authors": [
      "Alexandre Pasquiou",
      "Yair Lakretz",
      "John Hale",
      "Bertrand Thirion",
      "Christophe Pallier"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2207.03381",
    "title": "Parameterized Colorings And Labellings Of Graphs In Topological Coding",
    "abstract": "The coming quantum computation is forcing us to reexamine the cryptosystems people use. We are applying graph colorings of topological coding to modern information security and future cryptography against supercomputer and quantum computer attacks in the near future. Many of techniques introduced here are associated with many mathematical conjecture and NP-problems. We will introduce a group of W-constraint (k,d)-total colorings and algorithms for realizing these colorings in some kinds of graphs, which are used to make quickly public-keys and private-keys with anti-quantum computing, these (k,d)-total colorings are: graceful (k,d)-total colorings, harmonious (k,d)-total colorings, (k,d)-edge-magic total colorings, (k,d)-graceful-difference total colorings and (k,d)-felicitous-difference total colorings. One of useful tools we used is called Topcode-matrix with elements can be all sorts of things, for example, sets, graphs, number-based strings. Most of parameterized graphic colorings/labelings are defined by Topcode-matrix algebra here. From the application point of view, many of our coloring techniques are given by algorithms and easily converted into programs. ",
    "url": "https://arxiv.org/abs/2207.03381",
    "authors": [
      "Bing Yao",
      "Xiaohui Zhang",
      "Hui Sun",
      "Jing Su",
      "Fei Ma",
      "Hongyu Wang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2207.03400",
    "title": "On the Relationship Between Adversarial Robustness and Decision Region  in Deep Neural Network",
    "abstract": "In general, Deep Neural Networks (DNNs) are evaluated by the generalization performance measured on unseen data excluded from the training phase. Along with the development of DNNs, the generalization performance converges to the state-of-the-art and it becomes difficult to evaluate DNNs solely based on this metric. The robustness against adversarial attack has been used as an additional metric to evaluate DNNs by measuring their vulnerability. However, few studies have been performed to analyze the adversarial robustness in terms of the geometry in DNNs. In this work, we perform an empirical study to analyze the internal properties of DNNs that affect model robustness under adversarial attacks. In particular, we propose the novel concept of the Populated Region Set (PRS), where training samples are populated more frequently, to represent the internal properties of DNNs in a practical setting. From systematic experiments with the proposed concept, we provide empirical evidence to validate that a low PRS ratio has a strong relationship with the adversarial robustness of DNNs. We also devise PRS regularizer leveraging the characteristics of PRS to improve the adversarial robustness without adversarial training. ",
    "url": "https://arxiv.org/abs/2207.03400",
    "authors": [
      "Seongjin Park",
      "Haedong Jeong",
      "Giyoung Jeon",
      "Jaesik Choi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.03408",
    "title": "Signed Link Representation in Continuous-Time Dynamic Signed Networks",
    "abstract": "Signed networks allow us to model bi-faceted relationships and interactions, such as friend/enemy, support/oppose, etc. These interactions are often temporal in real datasets, where nodes and edges appear over time. Learning the dynamics of signed networks is thus crucial to effectively predict the sign and strength of future links. Existing works model either signed networks or dynamic networks but not both together. In this work, we study dynamic signed networks where links are both signed and evolving with time. Our model learns a Signed link's Evolution using Memory modules and Balanced Aggregation (hence, the name SEMBA). Each node maintains two separate memory encodings for positive and negative interactions. On the arrival of a new edge, each interacting node aggregates this signed information with its memories while exploiting balance theory. Node embeddings are generated using updated memories, which are then used to train for multiple downstream tasks, including link sign prediction and link weight prediction. Our results show that SEMBA outperforms all the baselines on the task of sign prediction by achieving up to an 8% increase in the AUC and up to a 50% reduction in FPR. Results on the task of predicting signed weights show that SEMBA reduces the mean squared error by 9% while achieving up to 69% reduction in the KL-divergence on the distribution of predicted signed weights. ",
    "url": "https://arxiv.org/abs/2207.03408",
    "authors": [
      "Mohit Raghavendra",
      "Kartik Sharma",
      "Anand Kumar M",
      "Srijan Kumar"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.03409",
    "title": "Robust Watermarking for Video Forgery Detection with Improved  Imperceptibility and Robustness",
    "abstract": "Videos are prone to tampering attacks that alter the meaning and deceive the audience. Previous video forgery detection schemes find tiny clues to locate the tampered areas. However, attackers can successfully evade supervision by destroying such clues using video compression or blurring. This paper proposes a video watermarking network for tampering localization. We jointly train a 3D-UNet-based watermark embedding network and a decoder that predicts the tampering mask. The perturbation made by watermark embedding is close to imperceptible. Considering that there is no off-the-shelf differentiable video codec simulator, we propose to mimic video compression by ensembling simulation results of other typical attacks, e.g., JPEG compression and blurring, as an approximation. Experimental results demonstrate that our method generates watermarked videos with good imperceptibility and robustly and accurately locates tampered areas within the attacked version. ",
    "url": "https://arxiv.org/abs/2207.03409",
    "authors": [
      "Yangming Zhou",
      "Qichao Ying",
      "Xiangyu Zhang",
      "Zhenxing Qian",
      "Sheng Li",
      "Xinpeng Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.03414",
    "title": "Domain Knowledge Driven 3D Dose Prediction Using Moment-Based Loss  Function",
    "abstract": "Dose volume histogram (DVH) metrics are widely accepted evaluation criteria in the clinic. However, incorporating these metrics into deep learning dose prediction models is challenging due to their non-convexity and non-differentiability. We propose a novel moment-based loss function for predicting 3D dose distribution for the challenging conventional lung intensity modulated radiation therapy (IMRT) plans. The moment-based loss function is convex and differentiable and can easily incorporate DVH metrics in any deep learning framework without computational overhead. The moments can also be customized to reflect the clinical priorities in 3D dose prediction. For instance, using high-order moments allows better prediction in high-dose areas for serial structures. We used a large dataset of 360 (240 for training, 50 for validation and 70 for testing) conventional lung patients with 2Gy $\\times$ 30 fractions to train the deep learning (DL) model using clinically treated plans at our institution. We trained a UNet like CNN architecture using computed tomography (CT), planning target volume (PTV) and organ-at-risk contours (OAR) as input to infer corresponding voxel-wise 3D dose distribution. We evaluated three different loss functions: (1) The popular Mean Absolute Error (MAE) Loss, (2) the recently developed MAE + DVH Loss, and (3) the proposed MAE + Moments Loss. The quality of the predictions was compared using different DVH metrics as well as dose-score and DVH-score, recently introduced by the AAPM knowledge-based planning grand challenge. Model with (MAE + Moment) loss function outperformed the model with MAE loss by significantly improving the DVH-score (11%, p$<$0.01) while having similar computational cost. It also outperformed the model trained with (MAE+DVH) by significantly improving the computational cost (48%) and the DVH-score (8%, p$<$0.01). ",
    "url": "https://arxiv.org/abs/2207.03414",
    "authors": [
      "Gourav Jhanwar",
      "Navdeep Dahiya",
      "Parmida Ghahremani",
      "Masoud Zarepisheh",
      "Saad Nadeem"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.03433",
    "title": "Semi-supervised Object Detection via Virtual Category Learning",
    "abstract": "Due to the costliness of labelled data in real-world applications, semi-supervised object detectors, underpinned by pseudo labelling, are appealing. However, handling confusing samples is nontrivial: discarding valuable confusing samples would compromise the model generalisation while using them for training would exacerbate the confirmation bias issue caused by inevitable mislabelling. To solve this problem, this paper proposes to use confusing samples proactively without label correction. Specifically, a virtual category (VC) is assigned to each confusing sample such that they can safely contribute to the model optimisation even without a concrete label. It is attributed to specifying the embedding distance between the training sample and the virtual category as the lower bound of the inter-class distance. Moreover, we also modify the localisation loss to allow high-quality boundaries for location regression. Extensive experiments demonstrate that the proposed VC learning significantly surpasses the state-of-the-art, especially with small amounts of available labels. ",
    "url": "https://arxiv.org/abs/2207.03433",
    "authors": [
      "Changrui Chen",
      "Kurt Debattista",
      "Jungong Han"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.03439",
    "title": "On Aggregation Performance in Privacy Conscious Hierarchical Flexibility  Coordination Schemes",
    "abstract": "In this paper we introduce a method for performance quantification of flexibility aggregation in flexibility coordination schemes (FCS), with a focus on privacy preserving hierarchical FCS. The quantification is based on two performance metrics: The aggregation error and the aggregation efficiency. We present the simulation framework and the modelling of one complex type of flexibility providing units (FPUs), namely energy storage systems (ESS). ESS cause intertemporal constraints for flexibility coordination that lead to aggregation errors in case flexibility is aggregated from heterogeneous groups of FPUs. We identify one parameter responsible for the aggregation error to be the power-to-energy ratio of the ESS. A grouping of FPUs using similarity in their power-to-energy ratios is shown to improve the coordination performance. Additionally, we describe the influence of flexibility demand timeseries on the aggregation error, concluding that future assessments of aggregation errors should consider multiple representative demand timeseries, which is a non-trivial task. Finally, we discuss the applicability of the developed method to scenarios of larger system size. ",
    "url": "https://arxiv.org/abs/2207.03439",
    "authors": [
      "Thomas Offergeld",
      "Nils Mattus",
      "Florian Schmidtke",
      "Andreas Ulbig"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2207.03472",
    "title": "Data-driven State of Risk Prediction and Mitigation in Support of the  Net-zero Carbon Electric Grid",
    "abstract": "An approach for reaching the net-zero carbon electricity grid is to intensify the deployment of distributed renewable generation resources such as photovoltaic (PV) solar and wind generation, complemented with stationary and mobile (electric vehicle) battery energy storage systems (BESS). This paper assumes a scenario where the PV renewable generation and BESS are integrated into a nano-Grid (n-Grid), a prosumer-owned virtual power plant installed at the residential or commercial sites. To be profitable, this distributed energy resource (DER) needs to be managed effectively to support its own load and the wholesale and retail market services. Our paper introduces a risk-based, data-driven approach focused on predicting the State of Risk (SoR) of the utility grid outages. The SoR prediction enables the development of optimal mitigation strategies aiming at reducing the impact of the grid outages by harvesting the n-Grid flexibility. Several data analytics tools to assist the n-Grid operators and aggregators for n-Grid participation in the wholesale market ancillary service products are introduced, and some preliminary implementation results are demonstrated. ",
    "url": "https://arxiv.org/abs/2207.03472",
    "authors": [
      "Mladen Kezunovic",
      "Rashid Baembitov",
      "Mohammad Khoshjahan"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2207.03478",
    "title": "Red PANDA: Disambiguating Anomaly Detection by Removing Nuisance Factors",
    "abstract": "Anomaly detection methods strive to discover patterns that differ from the norm in a semantic way. This goal is ambiguous as a data point differing from the norm by an attribute e.g., age, race or gender, may be considered anomalous by some operators while others may consider this attribute irrelevant. Breaking from previous research, we present a new anomaly detection method that allows operators to exclude an attribute from being considered as relevant for anomaly detection. Our approach then learns representations which do not contain information over the nuisance attributes. Anomaly scoring is performed using a density-based approach. Importantly, our approach does not require specifying the attributes that are relevant for detecting anomalies, which is typically impossible in anomaly detection, but only attributes to ignore. An empirical investigation is presented verifying the effectiveness of our approach. ",
    "url": "https://arxiv.org/abs/2207.03478",
    "authors": [
      "Niv Cohen",
      "Jonathan Kahana",
      "Yedid Hoshen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.03482",
    "title": "Bridging the Gap between Object and Image-level Representations for  Open-Vocabulary Detection",
    "abstract": "Existing open-vocabulary object detectors typically enlarge their vocabulary sizes by leveraging different forms of weak supervision. This helps generalize to novel objects at inference. Two popular forms of weak-supervision used in open-vocabulary detection (OVD) include pretrained CLIP model and image-level supervision. We note that both these modes of supervision are not optimally aligned for the detection task: CLIP is trained with image-text pairs and lacks precise localization of objects while the image-level supervision has been used with heuristics that do not accurately specify local object regions. In this work, we propose to address this problem by performing object-centric alignment of the language embeddings from the CLIP model. Furthermore, we visually ground the objects with only image-level supervision using a pseudo-labeling process that provides high-quality object proposals and helps expand the vocabulary during training. We establish a bridge between the above two object-alignment strategies via a novel weight transfer function that aggregates their complimentary strengths. In essence, the proposed model seeks to minimize the gap between object and image-centric representations in the OVD setting. On the COCO benchmark, our proposed approach achieves 40.3 AP50 on novel classes, an absolute 11.9 gain over the previous best performance.For LVIS, we surpass the state-of-the-art ViLD model by 5.0 mask AP for rare categories and 3.4 overall. Code: https://bit.ly/3byZoQp. ",
    "url": "https://arxiv.org/abs/2207.03482",
    "authors": [
      "Hanoona Rasheed",
      "Muhammad Maaz",
      "Muhammad Uzair Khattak",
      "Salman Khan",
      "Fahad Shahbaz Khan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.02851",
    "title": "Tensor networks in machine learning",
    "abstract": "A tensor network is a type of decomposition used to express and approximate large arrays of data. A given data-set, quantum state or higher dimensional multi-linear map is factored and approximated by a composition of smaller multi-linear maps. This is reminiscent to how a Boolean function might be decomposed into a gate array: this represents a special case of tensor decomposition, in which the tensor entries are replaced by 0, 1 and the factorisation becomes exact. The collection of associated techniques are called, tensor network methods: the subject developed independently in several distinct fields of study, which have more recently become interrelated through the language of tensor networks. The tantamount questions in the field relate to expressability of tensor networks and the reduction of computational overheads. A merger of tensor networks with machine learning is natural. On the one hand, machine learning can aid in determining a factorization of a tensor network approximating a data set. On the other hand, a given tensor network structure can be viewed as a machine learning model. Herein the tensor network parameters are adjusted to learn or classify a data-set. In this survey we recover the basics of tensor networks and explain the ongoing effort to develop the theory of tensor networks in machine learning. ",
    "url": "https://arxiv.org/abs/2207.02851",
    "authors": [
      "Richik Sengupta",
      "Soumik Adhikary",
      "Ivan Oseledets",
      "Jacob Biamonte"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.02854",
    "title": "Perfusion imaging in deep prostate cancer detection from mp-MRI: can we  take advantage of it?",
    "abstract": "To our knowledge, all deep computer-aided detection and diagnosis (CAD) systems for prostate cancer (PCa) detection consider bi-parametric magnetic resonance imaging (bp-MRI) only, including T2w and ADC sequences while excluding the 4D perfusion sequence,which is however part of standard clinical protocols for this diagnostic task. In this paper, we question strategies to integrate information from perfusion imaging in deep neural architectures. To do so, we evaluate several ways to encode the perfusion information in a U-Net like architecture, also considering early versus mid fusion strategies. We compare performance of multiparametric MRI (mp-MRI) models with the baseline bp-MRI model based on a private dataset of 219 mp-MRI exams. Perfusion maps derived from dynamic contrast enhanced MR exams are shown to positively impact segmentation and grading performance of PCa lesions, especially the 3D MR volume corresponding to the maximum slope of the wash-in curve as well as Tmax perfusion maps. The latter mp-MRI models indeed outperform the bp-MRI one whatever the fusion strategy, with Cohen's kappa score of 0.318$\\pm$0.019 for the bp-MRI model and 0.378 $\\pm$ 0.033 for the model including the maximum slope with a mid fusion strategy, also achieving competitive Cohen's kappa score compared to state of the art. ",
    "url": "https://arxiv.org/abs/2207.02854",
    "authors": [
      "Audrey Duran",
      "Gaspard Dussert",
      "Carole Lartizien"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.02946",
    "title": "Virtual staining of defocused autofluorescence images of unlabeled  tissue using deep neural networks",
    "abstract": "Deep learning-based virtual staining was developed to introduce image contrast to label-free tissue sections, digitally matching the histological staining, which is time-consuming, labor-intensive, and destructive to tissue. Standard virtual staining requires high autofocusing precision during the whole slide imaging of label-free tissue, which consumes a significant portion of the total imaging time and can lead to tissue photodamage. Here, we introduce a fast virtual staining framework that can stain defocused autofluorescence images of unlabeled tissue, achieving equivalent performance to virtual staining of in-focus label-free images, also saving significant imaging time by lowering the microscope's autofocusing precision. This framework incorporates a virtual-autofocusing neural network to digitally refocus the defocused images and then transforms the refocused images into virtually stained images using a successive network. These cascaded networks form a collaborative inference scheme: the virtual staining model regularizes the virtual-autofocusing network through a style loss during the training. To demonstrate the efficacy of this framework, we trained and blindly tested these networks using human lung tissue. Using 4x fewer focus points with 2x lower focusing precision, we successfully transformed the coarsely-focused autofluorescence images into high-quality virtually stained H&E images, matching the standard virtual staining framework that used finely-focused autofluorescence input images. Without sacrificing the staining quality, this framework decreases the total image acquisition time needed for virtual staining of a label-free whole-slide image (WSI) by ~32%, together with a ~89% decrease in the autofocusing time, and has the potential to eliminate the laborious and costly histochemical staining process in pathology. ",
    "url": "https://arxiv.org/abs/2207.02946",
    "authors": [
      "Yijie Zhang",
      "Luzhe Huang",
      "Tairan Liu",
      "Keyi Cheng",
      "Kevin de Haan",
      "Yuzhu Li",
      "Bijie Bai",
      "Aydogan Ozcan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.02957",
    "title": "Context-aware Self-supervised Learning for Medical Images Using Graph  Neural Network",
    "abstract": "Although self-supervised learning enables us to bootstrap the training by exploiting unlabeled data, the generic self-supervised methods for natural images do not sufficiently incorporate the context. For medical images, a desirable method should be sensitive enough to detect deviation from normal-appearing tissue of each anatomical region; here, anatomy is the context. We introduce a novel approach with two levels of self-supervised representation learning objectives: one on the regional anatomical level and another on the patient-level. We use graph neural networks to incorporate the relationship between different anatomical regions. The structure of the graph is informed by anatomical correspondences between each patient and an anatomical atlas. In addition, the graph representation has the advantage of handling any arbitrarily sized image in full resolution. Experiments on large-scale Computer Tomography (CT) datasets of lung images show that our approach compares favorably to baseline methods that do not account for the context. We use the learned embedding for staging lung tissue abnormalities related to COVID-19. ",
    "url": "https://arxiv.org/abs/2207.02957",
    "authors": [
      "Li Sun",
      "Ke Yu",
      "Kayhan Batmanghelich"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.03050",
    "title": "Multi-Task Lung Nodule Detection in Chest Radiographs with a Dual Head  Network",
    "abstract": "Lung nodules can be an alarming precursor to potential lung cancer. Missed nodule detections during chest radiograph analysis remains a common challenge among thoracic radiologists. In this work, we present a multi-task lung nodule detection algorithm for chest radiograph analysis. Unlike past approaches, our algorithm predicts a global-level label indicating nodule presence along with local-level labels predicting nodule locations using a Dual Head Network (DHN). We demonstrate the favorable nodule detection performance that our multi-task formulation yields in comparison to conventional methods. In addition, we introduce a novel Dual Head Augmentation (DHA) strategy tailored for DHN, and we demonstrate its significance in further enhancing global and local nodule predictions. ",
    "url": "https://arxiv.org/abs/2207.03050",
    "authors": [
      "Chen-Han Tsai",
      "Yu-Shao Peng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.03070",
    "title": "Reservoir Computing with 3D Nanowire Networks",
    "abstract": "Networks of nanowires are currently being explored for a range of applications in brain-like (or neuromorphic) computing, and especially in reservoir computing (RC). Fabrication of real-world computing devices requires that the nanowires are deposited sequentially, leading to stacking of the wires on top of each other. However, most simulations of computational tasks using these systems treat the nanowires as 1D objects lying in a perfectly 2D plane - the effect of stacking on RC performance has not yet been established. Here we use detailed simulations to compare the performance of perfectly 2D and quasi-3D (stacked) networks of nanowires in two tasks: memory capacity and nonlinear transformation. We also show that our model of the junctions between nanowires is general enough to describe a wide range of memristive networks, and consider the impact of physically realistic electrode configurations on performance. We show that the various networks and configurations have a strikingly similar performance in RC tasks, which is surprising given their radically different topologies. Our results show that networks with an experimentally achievable number of electrodes perform close to the upper bounds achievable when using the information from every wire. However, we also show important differences, in particular that the quasi-3D networks are more resilient to changes in the input parameters, generalizing better to noisy training data. Since previous literature suggests that topology plays an important role in computing performance, these results may have important implications for future applications of nanowire networks in neuromorphic computing. ",
    "url": "https://arxiv.org/abs/2207.03070",
    "authors": [
      "R. K. Daniels",
      "J. B. Mallinson",
      "Z. E. Heywood",
      "P. J. Bones",
      "M. D. Arnold",
      "S. A. Brown"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2207.03093",
    "title": "Backpropagation on Dynamical Networks",
    "abstract": "Dynamical networks are versatile models that can describe a variety of behaviours such as synchronisation and feedback. However, applying these models in real world contexts is difficult as prior information pertaining to the connectivity structure or local dynamics is often unknown and must be inferred from time series observations of network states. Additionally, the influence of coupling interactions between nodes further complicates the isolation of local node dynamics. Given the architectural similarities between dynamical networks and recurrent neural networks (RNN), we propose a network inference method based on the backpropagation through time (BPTT) algorithm commonly used to train recurrent neural networks. This method aims to simultaneously infer both the connectivity structure and local node dynamics purely from observation of node states. An approximation of local node dynamics is first constructed using a neural network. This is alternated with an adapted BPTT algorithm to regress corresponding network weights by minimising prediction errors of the dynamical network based on the previously constructed local models until convergence is achieved. This method was found to be succesful in identifying the connectivity structure for coupled networks of Lorenz, Chua and FitzHugh-Nagumo oscillators. Freerun prediction performance with the resulting local models and weights was found to be comparable to the true system with noisy initial conditions. The method is also extended to non-conventional network couplings such as asymmetric negative coupling. ",
    "url": "https://arxiv.org/abs/2207.03093",
    "authors": [
      "Eugene Tan",
      "Débora Corrêa",
      "Thomas Stemler",
      "Michael Small"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Machine Learning (cs.LG)",
      "Chaotic Dynamics (nlin.CD)"
    ]
  },
  {
    "id": "arXiv:2207.03105",
    "title": "Uncertainty-Aware Self-supervised Neural Network for Liver $T_{1ρ}$  Mapping with Relaxation Constraint",
    "abstract": "$T_{1\\rho}$ mapping is a promising quantitative MRI technique for the non-invasive assessment of tissue properties. Learning-based approaches can map $T_{1\\rho}$ from a reduced number of $T_{1\\rho}$ weighted images, but requires significant amounts of high quality training data. Moreover, existing methods do not provide the confidence level of the $T_{1\\rho}$ estimation. To address these problems, we proposed a self-supervised learning neural network that learns a $T_{1\\rho}$ mapping using the relaxation constraint in the learning process. Epistemic uncertainty and aleatoric uncertainty are modelled for the $T_{1\\rho}$ quantification network to provide a Bayesian confidence estimation of the $T_{1\\rho}$ mapping. The uncertainty estimation can also regularize the model to prevent it from learning imperfect data. We conducted experiments on $T_{1\\rho}$ data collected from 52 patients with non-alcoholic fatty liver disease. The results showed that our method outperformed the existing methods for $T_{1\\rho}$ quantification of the liver using as few as two $T_{1\\rho}$-weighted images. Our uncertainty estimation provided a feasible way of modelling the confidence of the self-supervised learning based $T_{1\\rho}$ estimation, which is consistent with the reality in liver $T_{1\\rho}$ imaging. ",
    "url": "https://arxiv.org/abs/2207.03105",
    "authors": [
      "Chaoxing Huang",
      "Yurui Qian",
      "Simon Chun Ho Yu",
      "Jian Hou",
      "Baiyan Jiang",
      "Queenie Chan",
      "Vincent Wai-Sun Wong",
      "Winnie Chiu-Wing Chu",
      "Weitian Chen"
    ],
    "subjectives": [
      "Tissues and Organs (q-bio.TO)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2207.03282",
    "title": "NESC: Robust Neural End-2-End Speech Coding with GANs",
    "abstract": "Neural networks have proven to be a formidable tool to tackle the problem of speech coding at very low bit rates. However, the design of a neural coder that can be operated robustly under real-world conditions remains a major challenge. Therefore, we present Neural End-2-End Speech Codec (NESC) a robust, scalable end-to-end neural speech codec for high-quality wideband speech coding at 3 kbps. The encoder uses a new architecture configuration, which relies on our proposed Dual-PathConvRNN (DPCRNN) layer, while the decoder architecture is based on our previous work Streamwise-StyleMelGAN. Our subjective listening tests on clean and noisy speech show that NESC is particularly robust to unseen conditions and signal perturbations. ",
    "url": "https://arxiv.org/abs/2207.03282",
    "authors": [
      "Nicola Pia",
      "Kishan Gupta",
      "Srikanth Korse",
      "Markus Multrus",
      "Guillaume Fuchs"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2207.03331",
    "title": "Low-resource Low-footprint Wake-word Detection using Knowledge  Distillation",
    "abstract": "As virtual assistants have become more diverse and specialized, so has the demand for application or brand-specific wake words. However, the wake-word-specific datasets typically used to train wake-word detectors are costly to create. In this paper, we explore two techniques to leverage acoustic modeling data for large-vocabulary speech recognition to improve a purpose-built wake-word detector: transfer learning and knowledge distillation. We also explore how these techniques interact with time-synchronous training targets to improve detection latency. Experiments are presented on the open-source \"Hey Snips\" dataset and a more challenging in-house far-field dataset. Using phone-synchronous targets and knowledge distillation from a large acoustic model, we are able to improve accuracy across dataset sizes for both datasets while reducing latency. ",
    "url": "https://arxiv.org/abs/2207.03331",
    "authors": [
      "Arindam Ghosh",
      "Mark Fuhs",
      "Deblin Bagchi",
      "Bahman Farahani",
      "Monika Woszczyna"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.03368",
    "title": "Machine learning of percolation models using graph convolutional neural  networks",
    "abstract": "Percolation is an important topic in climate, physics, materials science, epidemiology, finance, and so on. Prediction of percolation thresholds with machine learning methods remains challenging. In this paper, we build a powerful graph convolutional neural network to study the percolation in both supervised and unsupervised ways. From a supervised learning perspective, the graph convolutional neural network simultaneously and correctly trains data of different lattice types, such as the square and triangular lattices. For the unsupervised perspective, combining the graph convolutional neural network and the confusion method, the percolation threshold can be obtained by the \"W\" shaped performance. The finding of this work opens up the possibility of building a more general framework that can probe the percolation-related phenomenon. ",
    "url": "https://arxiv.org/abs/2207.03368",
    "authors": [
      "Hua Tian",
      "Lirong Zhang",
      "Youjin Deng",
      "Wanzhou Zhang"
    ],
    "subjectives": [
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.03403",
    "title": "On the design and analysis of near-term quantum network protocols using  Markov decision processes",
    "abstract": "The quantum internet is one of the frontiers of quantum information science research. It will revolutionize the way we communicate and do other tasks, and it will allow for tasks that are not possible using the current, classical internet. The backbone of a quantum internet is entanglement distributed globally in order to allow for such novel applications to be performed over long distances. Experimental progress is currently being made to realize quantum networks on a small scale, but much theoretical work is still needed in order to understand how best to distribute entanglement, especially with the limitations of near-term quantum technologies taken into account. This work provides an initial step towards this goal. In this work, we lay out a theory of near-term quantum networks based on Markov decision processes (MDPs), and we show that MDPs provide a precise and systematic mathematical framework to model protocols for near-term quantum networks that is agnostic to the specific implementation platform. We start by simplifying the MDP for elementary links introduced in prior work, and by providing new results on policies for elementary links in the steady-state (infinite-time) limit. In particular, we show that the well-known memory-cutoff policy is optimal in the steady-state limit. Then we show how the elementary link MDP can be used to analyze a quantum network protocol in which we wait for all elementary links to be active before creating end-to-end links. We then provide an extension of the MDP formalism to two elementary links, which is useful for analyzing more sophisticated quantum network protocols. Here, as new results, we derive linear programming relaxations that allow us to obtain optimal steady-state policies with respect to the expected fidelity and waiting time of the end-to-end link. ",
    "url": "https://arxiv.org/abs/2207.03403",
    "authors": [
      "Sumeet Khatri"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2207.03406",
    "title": "Neural Stein critics with staged $L^2$-regularization",
    "abstract": "Learning to differentiate model distributions from observed data is a fundamental problem in statistics and machine learning, and high-dimensional data remains a challenging setting for such problems. Metrics that quantify the disparity in probability distributions, such as the Stein discrepancy, play an important role in statistical testing in high dimensions. In this paper, we consider the setting where one wishes to distinguish between data sampled from an unknown probability distribution and a nominal model distribution. While recent studies revealed that the optimal $L^2$-regularized Stein critic equals the difference of the score functions of two probability distributions up to a multiplicative constant, we investigate the role of $L^2$ regularization when training a neural network Stein discrepancy critic function. Motivated by the Neural Tangent Kernel theory of training neural networks, we develop a novel staging procedure for the weight of regularization over training time. This leverages the advantages of highly-regularized training at early times while also empirically delaying overfitting. Theoretically, we relate the training dynamic with large regularization weight to the kernel regression optimization of \"lazy training\" regime in early training times. The benefit of the staged $L^2$ regularization is demonstrated on simulated high dimensional distribution drift data and an application to evaluating generative models of image data. ",
    "url": "https://arxiv.org/abs/2207.03406",
    "authors": [
      "Matthew Repasky",
      "Xiuyuan Cheng",
      "Yao Xie"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2207.03450",
    "title": "TFCNs: A CNN-Transformer Hybrid Network for Medical Image Segmentation",
    "abstract": "Medical image segmentation is one of the most fundamental tasks concerning medical information analysis. Various solutions have been proposed so far, including many deep learning-based techniques, such as U-Net, FC-DenseNet, etc. However, high-precision medical image segmentation remains a highly challenging task due to the existence of inherent magnification and distortion in medical images as well as the presence of lesions with similar density to normal tissues. In this paper, we propose TFCNs (Transformers for Fully Convolutional denseNets) to tackle the problem by introducing ResLinear-Transformer (RL-Transformer) and Convolutional Linear Attention Block (CLAB) to FC-DenseNet. TFCNs is not only able to utilize more latent information from the CT images for feature extraction, but also can capture and disseminate semantic features and filter non-semantic features more effectively through the CLAB module. Our experimental results show that TFCNs can achieve state-of-the-art performance with dice scores of 83.72\\% on the Synapse dataset. In addition, we evaluate the robustness of TFCNs for lesion area effects on the COVID-19 public datasets. The Python code will be made publicly available on https://github.com/HUANGLIZI/TFCNs. ",
    "url": "https://arxiv.org/abs/2207.03450",
    "authors": [
      "Zihan Li",
      "Dihan Li",
      "Cangbai Xu",
      "Weice Wang",
      "Qingqi Hong",
      "Qingde Li",
      "Jie Tian"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.03471",
    "title": "Inferring Structural Parameters of Low-Surface-Brightness-Galaxies with  Uncertainty Quantification using Bayesian Neural Networks",
    "abstract": "Measuring the structural parameters (size, total brightness, light concentration, etc.) of galaxies is a significant first step towards a quantitative description of different galaxy populations. In this work, we demonstrate that a Bayesian Neural Network (BNN) can be used for the inference, with uncertainty quantification, of such morphological parameters from simulated low-surface-brightness galaxy images. Compared to traditional profile-fitting methods, we show that the uncertainties obtained using BNNs are comparable in magnitude, well-calibrated, and the point estimates of the parameters are closer to the true values. Our method is also significantly faster, which is very important with the advent of the era of large galaxy surveys and big data in astrophysics. ",
    "url": "https://arxiv.org/abs/2207.03471",
    "authors": [
      "Dimitrios Tanoglidis",
      "Aleksandra Ćiprijanović",
      "Alex Drlica-Wagner"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Astrophysics of Galaxies (astro-ph.GA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2011.10749",
    "title": "Revisiting Binary Code Similarity Analysis using Interpretable Feature  Engineering and Lessons Learned",
    "abstract": " Comments: 23 pages, accepted to IEEE Transactions on Software Engineering (June 2022) ",
    "url": "https://arxiv.org/abs/2011.10749",
    "authors": [
      "Dongkwan Kim",
      "Eunsoo Kim",
      "Sang Kil Cha",
      "Sooel Son",
      "Yongdae Kim"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2011.10896",
    "title": "HALO 1.0: A Hardware-agnostic Accelerator Orchestration Framework for  Enabling Hardware-agnostic Programming with True Performance Portability for  Heterogeneous HPC",
    "abstract": " Comments: 37 pages ",
    "url": "https://arxiv.org/abs/2011.10896",
    "authors": [
      "Michael Riera",
      "Erfan Bank Tavakoli",
      "Masudul Hassan Quraishi",
      "Fengbo Ren"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Computation and Language (cs.CL)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2012.11230",
    "title": "DAQ: Channel-Wise Distribution-Aware Quantization for Deep Image  Super-Resolution Networks",
    "abstract": " Comments: WACV 2022 ",
    "url": "https://arxiv.org/abs/2012.11230",
    "authors": [
      "Cheeun Hong",
      "Heewon Kim",
      "Sungyong Baik",
      "Junghun Oh",
      "Kyoung Mu Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2103.00760",
    "title": "Self-Supervised Depth and Ego-Motion Estimation for Monocular Thermal  Video Using Multi-Spectral Consistency Loss",
    "abstract": " Comments: 8 pages, Accepted by IEEE Robotics and Automation Letters (RA-L) with ICRA 2022 option ",
    "url": "https://arxiv.org/abs/2103.00760",
    "authors": [
      "Ukcheol Shin",
      "Kyunghyun Lee",
      "Seokju Lee",
      "In So Kweon"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2105.04080",
    "title": "Exponentially convergent multiscale methods for 2D high frequency  heterogeneous Helmholtz equations",
    "abstract": " Comments: 35 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2105.04080",
    "authors": [
      "Yifan Chen",
      "Thomas Y. Hou",
      "Yixuan Wang"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2106.09785",
    "title": "Efficient Self-supervised Vision Transformers for Representation  Learning",
    "abstract": " Comments: ICLR 2022; Code: this https URL ",
    "url": "https://arxiv.org/abs/2106.09785",
    "authors": [
      "Chunyuan Li",
      "Jianwei Yang",
      "Pengchuan Zhang",
      "Mei Gao",
      "Bin Xiao",
      "Xiyang Dai",
      "Lu Yuan",
      "Jianfeng Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.10196",
    "title": "Federated Robustness Propagation: Sharing Robustness in Heterogeneous  Federated Learning",
    "abstract": " Title: Federated Robustness Propagation: Sharing Robustness in Heterogeneous  Federated Learning ",
    "url": "https://arxiv.org/abs/2106.10196",
    "authors": [
      "Junyuan Hong",
      "Haotao Wang",
      "Zhangyang Wang",
      "Jiayu Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.01876",
    "title": "Learning towards Robustness in Causally-Invariant Predictors",
    "abstract": " Title: Learning towards Robustness in Causally-Invariant Predictors ",
    "url": "https://arxiv.org/abs/2107.01876",
    "authors": [
      "Xiangyu Zheng",
      "Mingzhou Liu",
      "Xinwei Sun",
      "Fang Fang",
      "Yizhou Wang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.04782",
    "title": "TA2N: Two-Stage Action Alignment Network for Few-shot Action Recognition",
    "abstract": " Comments: Published in AAAI 2022 ",
    "url": "https://arxiv.org/abs/2107.04782",
    "authors": [
      "Shuyuan Li",
      "Huabin Liu",
      "Rui Qian",
      "Yuxi Li",
      "John See",
      "Mengjuan Fei",
      "Xiaoyuan Yu",
      "Weiyao Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.13802",
    "title": "RigNet: Repetitive Image Guided Network for Depth Completion",
    "abstract": " Comments: Accepted by ECCV2022 ",
    "url": "https://arxiv.org/abs/2107.13802",
    "authors": [
      "Zhiqiang Yan",
      "Kun Wang",
      "Xiang Li",
      "Zhenyu Zhang",
      "Baobei Xu",
      "Jun Li",
      "Jian Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.04205",
    "title": "DAN: Decentralized Attention-based Neural Network for the MinMax  Multiple Traveling Salesman Problem",
    "abstract": " Comments: Submitted to the 16th International Symposium on Distributed Autonomous Robotic Systems (DARS 2022) ",
    "url": "https://arxiv.org/abs/2109.04205",
    "authors": [
      "Yuhong Cao",
      "Zhanhong Sun",
      "Guillaume Sartoretti"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2109.05200",
    "title": "How social networks influence human behavior: An integrated latent space  approach for social influence",
    "abstract": " Title: How social networks influence human behavior: An integrated latent space  approach for social influence ",
    "url": "https://arxiv.org/abs/2109.05200",
    "authors": [
      "Jina Park",
      "Ick Hoon Jin",
      "Minjeong Jeon"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2109.05539",
    "title": "BioLCNet: Reward-modulated Locally Connected Spiking Neural Networks",
    "abstract": " Comments: 15 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2109.05539",
    "authors": [
      "Hafez Ghaemi",
      "Erfan Mirzaei",
      "Mahbod Nouri",
      "Saeed Reza Kheradpisheh"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2109.06474",
    "title": "Space Time Recurrent Memory Network",
    "abstract": " Title: Space Time Recurrent Memory Network ",
    "url": "https://arxiv.org/abs/2109.06474",
    "authors": [
      "Hung Nguyen",
      "Chanho Kim",
      "Fuxin Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.11488",
    "title": "Characterization of Real-time Haptic Feedback from Multimodal Neural  Network-based Force Estimates during Teleoperation",
    "abstract": " Comments: 8 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2109.11488",
    "authors": [
      "Zonghe Chua",
      "Allison M. Okamura"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2110.04478",
    "title": "Themis: A Network Bandwidth-Aware Collective Scheduling Policy for  Distributed Training of DL Models",
    "abstract": " Title: Themis: A Network Bandwidth-Aware Collective Scheduling Policy for  Distributed Training of DL Models ",
    "url": "https://arxiv.org/abs/2110.04478",
    "authors": [
      "Saeed Rashidi",
      "William Won",
      "Sudarshan Srinivasan",
      "Srinivas Sridharan",
      "Tushar Krishna"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Hardware Architecture (cs.AR)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2110.05000",
    "title": "Exact Matching of Random Graphs with Constant Correlation",
    "abstract": " Comments: 55 pages, 1 figure ",
    "url": "https://arxiv.org/abs/2110.05000",
    "authors": [
      "Cheng Mao",
      "Mark Rudelson",
      "Konstantin Tikhomirov"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Data Structures and Algorithms (cs.DS)",
      "Probability (math.PR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.14206",
    "title": "The Quantum Approximate Optimization Algorithm at High Depth for MaxCut  on Large-Girth Regular Graphs and the Sherrington-Kirkpatrick Model",
    "abstract": " Comments: 39 pages, 7 figures, 5 tables. Full version of the paper in TQC 2022 ",
    "url": "https://arxiv.org/abs/2110.14206",
    "authors": [
      "Joao Basso",
      "Edward Farhi",
      "Kunal Marwaha",
      "Benjamin Villalonga",
      "Leo Zhou"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2111.06063",
    "title": "On the Equivalence between Neural Network and Support Vector Machine",
    "abstract": " Comments: 35th Conference on Neural Information Processing Systems (NeurIPS 2021) ",
    "url": "https://arxiv.org/abs/2111.06063",
    "authors": [
      "Yilan Chen",
      "Wei Huang",
      "Lam M. Nguyen",
      "Tsui-Wei Weng"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2112.06089",
    "title": "Anomaly Detection in Blockchain Networks: A Comprehensive Survey",
    "abstract": " Title: Anomaly Detection in Blockchain Networks: A Comprehensive Survey ",
    "url": "https://arxiv.org/abs/2112.06089",
    "authors": [
      "Muneeb Ul Hassan",
      "Mubashir Husain Rehmani",
      "Jinjun Chen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2112.06460",
    "title": "Sequential Recommendation with Bidirectional Chronological Augmentation  of Transformer",
    "abstract": " Comments: 13 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2112.06460",
    "authors": [
      "Juyong Jiang",
      "Yingtao Luo",
      "Jae Boum Kim",
      "Kai Zhang",
      "Sunghun Kim"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2112.08055",
    "title": "Building separable approximations for quantum states via neural networks",
    "abstract": " Comments: 13 pages, 7 figures We welcome any comments on references for Tables 1 and 2. Comments on update #1: added more results to the figures, more precise numerical results in table 1 and 2, added references and comparison with previous work. Comments on update #2: added more analytical and numerical results. Comments on update #3: Removed duplicated references ",
    "url": "https://arxiv.org/abs/2112.08055",
    "authors": [
      "Antoine Girardin",
      "Nicolas Brunner",
      "Tamás Kriváchy"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.10153",
    "title": "Detect what you want: Target Sound Detection",
    "abstract": " Comments: Submitted to DCASE workshop2022 ",
    "url": "https://arxiv.org/abs/2112.10153",
    "authors": [
      "Dongchao Yang",
      "Helin Wang",
      "Yuexian Zou",
      "Fan Cui",
      "Yujun Wang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2112.14299",
    "title": "DeepAdversaries: Examining the Robustness of Deep Learning Models for  Galaxy Morphology Classification",
    "abstract": " Comments: 20 pages, 6 figures, 5 tables; accepted in MLST ",
    "url": "https://arxiv.org/abs/2112.14299",
    "authors": [
      "Aleksandra Ćiprijanović",
      "Diana Kafkes",
      "Gregory Snyder",
      "F. Javier Sánchez",
      "Gabriel Nathan Perdue",
      "Kevin Pedro",
      "Brian Nord",
      "Sandeep Madireddy",
      "Stefan M. Wild"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Astrophysics of Galaxies (astro-ph.GA)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.07341",
    "title": "Learning grammar with a divide-and-concur neural network",
    "abstract": " Title: Learning grammar with a divide-and-concur neural network ",
    "url": "https://arxiv.org/abs/2201.07341",
    "authors": [
      "Sean Deyo",
      "Veit Elser"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Cellular Automata and Lattice Gases (nlin.CG)"
    ]
  },
  {
    "id": "arXiv:2201.11692",
    "title": "SSLGuard: A Watermarking Scheme for Self-supervised Learning Pre-trained  Encoders",
    "abstract": " Comments: Accepted by CCS 2022 ",
    "url": "https://arxiv.org/abs/2201.11692",
    "authors": [
      "Tianshuo Cong",
      "Xinlei He",
      "Yang Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.13299",
    "title": "Directed Weight Neural Networks for Protein Structure Representation  Learning",
    "abstract": " Title: Directed Weight Neural Networks for Protein Structure Representation  Learning ",
    "url": "https://arxiv.org/abs/2201.13299",
    "authors": [
      "Jiahan Li",
      "Shitong Luo",
      "Congyue Deng",
      "Chaoran Cheng",
      "Jiaqi Guan",
      "Leonidas Guibas",
      "Jian Peng",
      "Jianzhu Ma"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.01881",
    "title": "Towards Better Understanding of Self-Supervised Representations",
    "abstract": " Title: Towards Better Understanding of Self-Supervised Representations ",
    "url": "https://arxiv.org/abs/2203.01881",
    "authors": [
      "Neha Kalibhat",
      "Kanika Narang",
      "Liang Tan",
      "Hamed Firooz",
      "Maziar Sanjabi",
      "Soheil Feizi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02216",
    "title": "Look\\&Listen: Multi-Modal Correlation Learning for Active Speaker  Detection and Speech Enhancement",
    "abstract": " Comments: 13 pages, 8figures ",
    "url": "https://arxiv.org/abs/2203.02216",
    "authors": [
      "Junwen Xiong",
      "Yu Zhou",
      "Peng Zhang",
      "Lei Xie",
      "Wei Huang",
      "Yufei Zha"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.05266",
    "title": "EVExchange: A Relay Attack on Electric Vehicle Charging System",
    "abstract": " Comments: 20 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2203.05266",
    "authors": [
      "Mauro Conti",
      "Denis Donadel",
      "Radha Poovendran",
      "Federico Turrin"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.06553",
    "title": "Contrastive Learning for Automotive mmWave Radar Detection Points Based  Instance Segmentation",
    "abstract": " Comments: Accepted by IEEE ITSC 2022 ",
    "url": "https://arxiv.org/abs/2203.06553",
    "authors": [
      "Weiyi Xiong",
      "Jianan Liu",
      "Yuxuan Xia",
      "Tao Huang",
      "Bing Zhu",
      "Wei Xiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.10425",
    "title": "A Study on Robustness to Perturbations for Representations of  Environmental Sound",
    "abstract": " Comments: Accepted in EUSIPCO 2022 ",
    "url": "https://arxiv.org/abs/2203.10425",
    "authors": [
      "Sangeeta Srivastava",
      "Ho-Hsiang Wu",
      "Joao Rulff",
      "Magdalena Fuentes",
      "Mark Cartwright",
      "Claudio Silva",
      "Anish Arora",
      "Juan Pablo Bello"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.12602",
    "title": "VideoMAE: Masked Autoencoders are Data-Efficient Learners for  Self-Supervised Video Pre-Training",
    "abstract": " Comments: Technical report ",
    "url": "https://arxiv.org/abs/2203.12602",
    "authors": [
      "Zhan Tong",
      "Yibing Song",
      "Jue Wang",
      "Limin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16732",
    "title": "Graph Convolutional Neural Networks for Physics-Aware Grid Learning  Algorithms",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2203.16732",
    "authors": [
      "Tong Wu",
      "Ignacio Losada Carreno",
      "Anna Scaglione",
      "Daniel Arnold"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.17004",
    "title": "Speech Enhancement with Score-Based Generative Models in the Complex  STFT Domain",
    "abstract": " Comments: Accepted by Interspeech 2022 ",
    "url": "https://arxiv.org/abs/2203.17004",
    "authors": [
      "Simon Welker",
      "Julius Richter",
      "Timo Gerkmann"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.09274",
    "title": "Causality-based Neural Network Repair",
    "abstract": " Title: Causality-based Neural Network Repair ",
    "url": "https://arxiv.org/abs/2204.09274",
    "authors": [
      "Bing Sun",
      "Jun Sun",
      "Hong Long Pham",
      "Jie Shi"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10965",
    "title": "CLIP-Dissect: Automatic Description of Neuron Representations in Deep  Vision Networks",
    "abstract": " Comments: Published in ICLR 2022 PAIR2Struct Workshop ",
    "url": "https://arxiv.org/abs/2204.10965",
    "authors": [
      "Tuomas Oikarinen",
      "Tsui-Wei Weng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.00639",
    "title": "The Multivariate Community Hawkes Model for Dependent Relational Events  in Continuous-time Networks",
    "abstract": " Comments: To appear at ICML 2022. Code available at this https URL ",
    "url": "https://arxiv.org/abs/2205.00639",
    "authors": [
      "Hadeel Soliman",
      "Lingfei Zhao",
      "Zhipeng Huang",
      "Subhadeep Paul",
      "Kevin S. Xu"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.09263",
    "title": "A Mutually Exciting Latent Space Hawkes Process Model for  Continuous-time Networks",
    "abstract": " Comments: To appear in UAI 2022. Code available at this https URL ",
    "url": "https://arxiv.org/abs/2205.09263",
    "authors": [
      "Zhipeng Huang",
      "Hadeel Soliman",
      "Subhadeep Paul",
      "Kevin S. Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.11515",
    "title": "Cardiomegaly Detection using Deep Convolutional Neural Network with  U-Net",
    "abstract": " Comments: 8 pages, 7 figures, submitted in the IEEE Transactions on Neural Networks and Learning Systems(IEEE TNNLS) ",
    "url": "https://arxiv.org/abs/2205.11515",
    "authors": [
      "Soham S.Sarpotdar"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.13326",
    "title": "SHREC 2022: pothole and crack detection in the road pavement using  images and RGB-D data",
    "abstract": " Title: SHREC 2022: pothole and crack detection in the road pavement using  images and RGB-D data ",
    "url": "https://arxiv.org/abs/2205.13326",
    "authors": [
      "Elia Moscoso Thompson",
      "Andrea Ranieri",
      "Silvia Biasotti",
      "Miguel Chicchon",
      "Ivan Sipiran",
      "Minh-Khoi Pham",
      "Thang-Long Nguyen-Ho",
      "Hai-Dang Nguyen",
      "Minh-Triet Tran"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2206.07746",
    "title": "Condensing Graphs via One-Step Gradient Matching",
    "abstract": " Comments: 11 pages, KDD2022 ",
    "url": "https://arxiv.org/abs/2206.07746",
    "authors": [
      "Wei Jin",
      "Xianfeng Tang",
      "Haoming Jiang",
      "Zheng Li",
      "Danqing Zhang",
      "Jiliang Tang",
      "Bing Yin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.08358",
    "title": "MixGen: A New Multi-Modal Data Augmentation",
    "abstract": " Comments: Technical report. First three authors contributed equally. Code are available at this https URL ",
    "url": "https://arxiv.org/abs/2206.08358",
    "authors": [
      "Xiaoshuai Hao",
      "Yi Zhu",
      "Srikar Appalaraju",
      "Aston Zhang",
      "Wanqian Zhang",
      "Bo Li",
      "Mu Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10140",
    "title": "Comprehensive Analysis of Negative Sampling in Knowledge Graph  Representation Learning",
    "abstract": " Comments: Accepted at ICML2022 ",
    "url": "https://arxiv.org/abs/2206.10140",
    "authors": [
      "Hidetaka Kamigaito",
      "Katsuhiko Hayashi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2206.10261",
    "title": "Interpretable Deep Causal Learning for Moderation Effects",
    "abstract": " Title: Interpretable Deep Causal Learning for Moderation Effects ",
    "url": "https://arxiv.org/abs/2206.10261",
    "authors": [
      "Alberto Caron",
      "Gianluca Baio",
      "Ioanna Manolopoulou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2206.11501",
    "title": "A novel adversarial learning strategy for medical image classification",
    "abstract": " Title: A novel adversarial learning strategy for medical image classification ",
    "url": "https://arxiv.org/abs/2206.11501",
    "authors": [
      "Zong Fan",
      "Xiaohui Zhang",
      "Jacob A. Gasienica",
      "Jennifer Potts",
      "Su Ruan",
      "Wade Thorstad",
      "Hiram Gay",
      "Pengfei Song",
      "Xiaowei Wang",
      "Hua Li"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.14651",
    "title": "BoT-SORT: Robust Associations Multi-Pedestrian Tracking",
    "abstract": " Title: BoT-SORT: Robust Associations Multi-Pedestrian Tracking ",
    "url": "https://arxiv.org/abs/2206.14651",
    "authors": [
      "Nir Aharon",
      "Roy Orfaig",
      "Ben-Zion Bobrovsky"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.00445",
    "title": "Using Neural Networks for Novelty-based Test Selection to Accelerate  Functional Coverage Closure",
    "abstract": " Title: Using Neural Networks for Novelty-based Test Selection to Accelerate  Functional Coverage Closure ",
    "url": "https://arxiv.org/abs/2207.00445",
    "authors": [
      "Xuan Zheng",
      "Kerstin Eder",
      "Tim Blackmore"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.00574",
    "title": "Embedding phylogenetic trees in networks of low treewidth",
    "abstract": " Title: Embedding phylogenetic trees in networks of low treewidth ",
    "url": "https://arxiv.org/abs/2207.00574",
    "authors": [
      "Leo van Iersel",
      "Mark Jones",
      "Mathias Weller"
    ],
    "subjectives": [
      "Populations and Evolution (q-bio.PE)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2207.01127",
    "title": "DecisioNet -- A Binary-Tree Structured Neural Network",
    "abstract": " Comments: This paper is under review of a conference, hence the code may not be published yet. It will be publicly available on github after the paper is published ",
    "url": "https://arxiv.org/abs/2207.01127",
    "authors": [
      "Noam Gottlieb",
      "Michael Werman"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.01873",
    "title": "ICE-NODE: Integration of Clinical Embeddings with Neural Ordinary  Differential Equations",
    "abstract": " Comments: Accepted at Machine Learning for Healthcare 2022 ",
    "url": "https://arxiv.org/abs/2207.01873",
    "authors": [
      "Asem Alaa",
      "Erik Mayer",
      "Mauricio Barahona"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.02368",
    "title": "Text Enriched Sparse Hyperbolic Graph Convolutional Networks",
    "abstract": " Comments: Preprint under review. 13 pages, 10 figures, 6 tables ",
    "url": "https://arxiv.org/abs/2207.02368",
    "authors": [
      "Nurendra Choudhary",
      "Nikhil Rao",
      "Karthik Subbian",
      "Chandan K. Reddy"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2207.02775",
    "title": "Open Science and Authorship of Supplementary Material. Evidence from a  Research Community",
    "abstract": " Comments: 8 pages, 2 figures; accepted to the 26th International Conference on Science, Technology and Innovation Indicators (STI 2022) ",
    "url": "https://arxiv.org/abs/2207.02775",
    "authors": [
      "Andrea Mannocci",
      "Ornella Irrera",
      "Paolo Manghi"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)"
    ]
  }
]