[
  {
    "id": "arXiv:2108.00051",
    "title": "Coordinate descent on the orthogonal group for recurrent neural network  training",
    "abstract": "We propose to use stochastic Riemannian coordinate descent on the orthogonal group for recurrent neural network training. The algorithm rotates successively two columns of the recurrent matrix, an operation that can be efficiently implemented as a multiplication by a Givens matrix. In the case when the coordinate is selected uniformly at random at each iteration, we prove the convergence of the proposed algorithm under standard assumptions on the loss function, stepsize and minibatch noise. In addition, we numerically demonstrate that the Riemannian gradient in recurrent neural network training has an approximately sparse structure. Leveraging this observation, we propose a faster variant of the proposed algorithm that relies on the Gauss-Southwell rule. Experiments on a benchmark recurrent neural network training problem are presented to demonstrate the effectiveness of the proposed algorithm. ",
    "url": "https://arxiv.org/abs/2108.00051",
    "authors": [
      "Estelle Massart",
      "Vinayak Abrol"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2108.00058",
    "title": "Interruption flows for reliability evaluation of power distribution  networks",
    "abstract": "Energy networks should strive for reliability. How can it be assessed, measured, and improved? What are the best trade-offs between investments and their worth? The flow-based framework for the reliability assessment of energy networks proposed in this paper addresses these questions with a focus on power distribution networks. The framework introduces the concept of iflows, or interruption flows, which translate the analytical reliability evaluation into solving a series of node balance equations computable in linear time. The iflows permeate the network, providing relevant information to support linear formulations of reliability optimization problems. Numerical examples showcase the evaluation process obtained through iflows in illustrative distribution networks with distributed generation. A visual representation of the reliability state provides insights into the most critical regions of the network. A case study of the optimal allocation of switches in power distribution systems is described. Computational experiments were conducted using a benchmark of distribution networks, having up to 881 nodes. The results confirm the effectiveness of the approach in terms of providing high-quality information and optimal trade-offs to aid reliability decisions for energy networks. ",
    "url": "https://arxiv.org/abs/2108.00058",
    "authors": [
      "Fabio Luiz Usberti",
      "Celso Cavellucci",
      "Christiano Lyra"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2108.00059",
    "title": "Local certification of graph decompositions and applications to  minor-free classes",
    "abstract": "Local certification consists in assigning labels to the nodes of a network to certify that some given property is satisfied, in such a way that the labels can be checked locally. In the last few years, certification of graph classes received a considerable attention. The goal is to certify that a graph $G$ belongs to a given graph class~$\\mathcal{G}$. Such certifications with labels of size $O(\\log n)$ (where $n$ is the size of the network) exist for trees, planar graphs and graphs embedded on surfaces. Feuilloley et al. ask if this can be extended to any class of graphs defined by a finite set of forbidden minors. In this work, we develop new decomposition tools for graph certification, and apply them to show that for every small enough minor $H$, $H$-minor-free graphs can indeed be certified with labels of size $O(\\log n)$. We also show matching lower bounds with a simple new proof technique. ",
    "url": "https://arxiv.org/abs/2108.00059",
    "authors": [
      "Nicolas Bousquet",
      "Laurent Feuilloley",
      "Théo Pierron"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2108.00107",
    "title": "Comparing object recognition in humans and deep convolutional neural  networks -- An eye tracking study",
    "abstract": "Deep convolutional neural networks (DCNNs) and the ventral visual pathway share vast architectural and functional similarities in visual challenges such as object recognition. Recent insights have demonstrated that both hierarchical cascades can be compared in terms of both exerted behavior and underlying activation. However, these approaches ignore key differences in spatial priorities of information processing. In this proof-of-concept study, we demonstrate a comparison of human observers (N = 45) and three feedforward DCNNs through eye tracking and saliency maps. The results reveal fundamentally different resolutions in both visualization methods that need to be considered for an insightful comparison. Moreover, we provide evidence that a DCNN with biologically plausible receptive field sizes called vNet reveals higher agreement with human viewing behavior as contrasted with a standard ResNet architecture. We find that image-specific factors such as category, animacy, arousal, and valence have a direct link to the agreement of spatial object recognition priorities in humans and DCNNs, while other measures such as difficulty and general image properties do not. With this approach, we try to open up new perspectives at the intersection of biological and computer vision research. ",
    "url": "https://arxiv.org/abs/2108.00107",
    "authors": [
      "Leonard E. van Dyck",
      "Roland Kwitt",
      "Sebastian J. Denzler",
      "Walter R. Gruber"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.00394",
    "title": "Deep graph matching meets mixed-integer linear programming: Relax at  your own risk ?",
    "abstract": "Graph matching is an important problem that has received widespread attention, especially in the field of computer vision. Recently, state-of-the-art methods seek to incorporate graph matching with deep learning. However, there is no research to explain what role the graph matching algorithm plays in the model. Therefore, we propose an approach integrating a MILP formulation of the graph matching problem. This formulation is solved to optimal and it provides inherent baseline. Meanwhile, similar approaches are derived by releasing the optimal guarantee of the graph matching solver and by introducing a quality level. This quality level controls the quality of the solutions provided by the graph matching solver. In addition, several relaxations of the graph matching problem are put to the test. Our experimental evaluation gives several theoretical insights and guides the direction of deep graph matching methods. ",
    "url": "https://arxiv.org/abs/2108.00394",
    "authors": [
      "Zhoubo Xu",
      "Puqing Chen",
      "Romain Raveaux",
      "Xin Yang",
      "Huadong Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2108.00508",
    "title": "Correlation of biological and computer viruses through evolutionary game  theory",
    "abstract": "Computer viruses have many similarities to biological viruses, and their association may offer new perspectives and new opportunities in the effort to tackle and even eradicate them. Evolutionary game theory has been established as a useful tool for modeling viral behaviors. This work attempts to correlate a well-known virus, namely Virlock, with the bacteriophage $\\phi6$. Furthermore, the paper suggests certain efficient strategies and practical ways that may reduce infection by Virlock and similar such viruses. ",
    "url": "https://arxiv.org/abs/2108.00508",
    "authors": [
      "Dimitris Kostadimas",
      "Kalliopi Kastampolidou",
      "Theodore Andronikos"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2108.00637",
    "title": "From \"study with me\" to study with you: how activities of Study With Me  livestream on Bilibili facilitate SRL community",
    "abstract": "It has become a trend to use study with me (SWM) Livestream to create a personalized study ambiance. However, we still have little understanding of the activities of SWM livestream and the streamer's motivation to produce SWM livestream. This paper provides an overview of the activities and how streamers regulate these activities of SWM livestream on a Chinese popular User Generated Content(UGC) website, Bilibili. We observed the number and popularity of the SWM livestreams and analyzed 800 livestreams to understand the streamers' study goals. We analyzed 20 SWM livestreams in detail and interviewed 12 streamers and 10 viewers to understand the activities and the streamer's motivation. We found that streamers produced SWM livestream to seek supervision, find like-minded study partners and help and company others. Streamers don't interact or instruct with the viewers directly but use chat-bot and autonomous interaction to alleviated the interaction burden. Unique sessions like checking-in and study progress reporting promote the viewers' social presence, promoting SOC, and enhancing their engagement. Strict rules and punishment are widely used to concentrate the members on study and contribute to positive atmosphere. We also found that SWM livestream often disappears when the examination is done and the streamer faces doubts on motivation and appearance. These findings suggest that SRL community can provide cognitive and socioemotional support for lonely learners to stick to a long-term study. The activities and streamer's practice inspired how streamers can focus on contemplative efforts while controlling the interaction. ",
    "url": "https://arxiv.org/abs/2108.00637",
    "authors": [
      "Ge Wang",
      "Yanxaing Zhang"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2108.00664",
    "title": "Learning who is in the market from time series: market participant  discovery through adversarial calibration of multi-agent simulators",
    "abstract": "In electronic trading markets often only the price or volume time series, that result from interaction of multiple market participants, are directly observable. In order to test trading strategies before deploying them to real-time trading, multi-agent market environments calibrated so that the time series that result from interaction of simulated agents resemble historical are often used. To ensure adequate testing, one must test trading strategies in a variety of market scenarios -- which includes both scenarios that represent ordinary market days as well as stressed markets (most recently observed due to the beginning of COVID pandemic). In this paper, we address the problem of multi-agent simulator parameter calibration to allow simulator capture characteristics of different market regimes. We propose a novel two-step method to train a discriminator that is able to distinguish between \"real\" and \"fake\" price and volume time series as a part of GAN with self-attention, and then utilize it within an optimization framework to tune parameters of a simulator model with known agent archetypes to represent a market scenario. We conclude with experimental results that demonstrate effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2108.00664",
    "authors": [
      "Victor Storchan",
      "Svitlana Vyetrenko",
      "Tucker Balch"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)",
      "Trading and Market Microstructure (q-fin.TR)"
    ]
  },
  {
    "id": "arXiv:2108.00687",
    "title": "Efficient simulation of coupled gas and power networks under uncertain  demands",
    "abstract": "We introduce an approach and a software tool for solving coupled energy networks composed of gas and electric power networks. Those networks are coupled to stochastic fluctuations to address possibly fluctuating demand due to fluctuating demands and supplies. Through computational results the presented approach is tested on networks of realistic size. ",
    "url": "https://arxiv.org/abs/2108.00687",
    "authors": [
      "E. Fokken",
      "S. Göttlich",
      "M. Herty"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2108.00864",
    "title": "Densely connected neural networks for nonlinear regression",
    "abstract": "Densely connected convolutional networks (DenseNet) behave well in image processing. However, for regression tasks, convolutional DenseNet may lose essential information from independent input features. To tackle this issue, we propose a novel DenseNet regression model where convolution and pooling layers are replaced by fully connected layers and the original concatenation shortcuts are maintained to reuse the feature. To investigate the effects of depth and input dimension of proposed model, careful validations are performed by extensive numerical simulation. The results give an optimal depth (19) and recommend a limited input dimension (under 200). Furthermore, compared with the baseline models including support vector regression, decision tree regression, and residual regression, our proposed model with the optimal depth performs best. Ultimately, DenseNet regression is applied to predict relative humidity, and the outcome shows a high correlation (0.91) with observations, which indicates that our model could advance environmental data analysis. ",
    "url": "https://arxiv.org/abs/2108.00864",
    "authors": [
      "Chao Jiang",
      "Canchen Jiang",
      "Dongwei Chen",
      "Fei Hu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2108.00939",
    "title": "Node repair on connected graphs",
    "abstract": "We study the problem of erasure correction (node repair) for regenerating codes defined on graphs wherein the cost of transmitting the information to the failed node depends on the graphical distance from this node to the helper vertices of the graph. The information passed to the failed node from the helpers traverses several vertices of the graph, and savings in communication complexity can be attained if the intermediate vertices process the information rather than simply relaying it toward the failed node. We derive simple information-theoretic bounds on the amount of information communicated between the nodes in the course of the repair. Next we show that Minimum Storage Regenerating (MSR) codes can be modified to perform the intermediate processing, thereby attaining the lower bound on the information exchange on the graph. We also consider node repair when the underlying graph is random, deriving conditions on the parameters that support recovery of the failed node with communication complexity smaller than required by the simple relaying. ",
    "url": "https://arxiv.org/abs/2108.00939",
    "authors": [
      "Adway Patra",
      "Alexander Barg"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2107.04837",
    "title": "Connected $k$-partition of $k$-connected graphs and $c$-claw-free graphs",
    "abstract": "A connected partition is a partition of the vertices of a graph into sets that induce connected subgraphs. Such partitions naturally occur in many application areas such as road networks, and image processing. We consider Balanced Connected Partitions (BCP), where the two classical objectives for BCP are to maximize the weight of the smallest, or minimize the weight of the largest component. We study BCP on c-claw-free graphs, the class of graphs that do not have $K_{1,c}$ as an induced subgraph, and present efficient (c-1)-approximation algorithms for both objectives. In particular, due to the (3-)claw-freeness of line graphs, this also implies a 2-approximations for the edge-partition version of BCP in general graphs. In the 1970s Gy\\H{o}ri and Lov\\'{a}sz showed for natural numbers $w_1,\\dots,w_k$ where $\\sum_i w_i$ is the vertex size, that if $G$ is k-connected, then there exist a connected k-partition with part sizes $w_1,\\dots,w_k$. However, to this day no polynomial algorithm to compute such partitions exists for k>4. Towards finding such a partition $T_1,\\dots, T_k$, we show how to efficiently compute connected partitions that at least approximately meet the target weights, subject to the mild assumption that each $w_i$ is greater than the weight of the heaviest vertex. In particular, we give a 3-approximation for both the lower and the upper bounded version i.e. we guarantee that each $T_i$ has weight at least $\\frac{w_i}{3}$ or that each $T_i$ has weight most $3w_i$, respectively. Also, we present a both-side bounded version that produces a connected partition where each $T_i$ has size at least $\\frac{w_i}{3}$ and at most $\\max(\\{r,3\\}) w_i$, where $r \\geq 1$ is the ratio between the largest and smallest value in $w_1, \\dots, w_k$. In particular for the balanced version, i.e.~$w_1=w_2=, \\dots,=w_k$, this gives a partition with $\\frac{1}{3}w_i \\leq w(T_i) \\leq 3w_i$. ",
    "url": "https://arxiv.org/abs/2107.04837",
    "authors": [
      "Ralf Borndörfer",
      "Katrin Casel",
      "Davis Issac",
      "Aikaterini Niklanovits",
      "Stephan Schwartz",
      "Ziena Zeif"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2108.00001",
    "title": "Mixing colourings in $2K_2$-free graphs",
    "abstract": "The reconfiguration graph for the $k$-colourings of a graph $G$, denoted $R_{k}(G)$, is the graph whose vertices are the $k$-colourings of $G$ and two colourings are joined by an edge if they differ in colour on exactly one vertex. For any $k$-colourable $P_4$-free graph $G$, Bonamy and Bousquet proved that $R_{k+1}(G)$ is connected. In this short note, we complete the classification of the connectedness of $R_{k+1}(G)$ for a $k$-colourable graph $G$ excluding a fixed path, by constructing a $7$-chromatic $2K_2$-free (and hence $P_5$-free) graph admitting a frozen $8$-colouring. This settles a question of the second author. ",
    "url": "https://arxiv.org/abs/2108.00001",
    "authors": [
      "Carl Feghali",
      "Owen Merkel"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2108.00198",
    "title": "An improved planar graph product structure theorem",
    "abstract": "Dujmovi\\'c, Joret, Micek, Morin, Ueckerdt and Wood [J. ACM 2020] proved that for every planar graph $G$ there is a graph $H$ with treewidth at most 8 and a path $P$ such that $G\\subseteq H\\boxtimes P$. We improve this result by replacing \"treewidth at most 8\" by \"simple treewidth at most 6\". ",
    "url": "https://arxiv.org/abs/2108.00198",
    "authors": [
      "Torsten Ueckerdt",
      "David R. Wood",
      "Wendy Yi"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2108.00502",
    "title": "Choice number of Kneser graphs",
    "abstract": "In this short note, we show that for any $\\epsilon >0$ and $k<n^{0.5-\\epsilon}$ the choice number of the Kneser graph $KG_{n,k}$ is $\\Theta (n\\log n)$. ",
    "url": "https://arxiv.org/abs/2108.00502",
    "authors": [
      "Vera Bulankina",
      "Andrey Kupavskii"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2108.00886",
    "title": "Cooperation dynamics under pandemic risks and heterogeneous economic  interdependence",
    "abstract": "The spread of COVID-19 and ensuing containment measures have accentuated the profound interdependence among nations or regions. This has been particularly evident in tourism, one of the sectors most affected by uncoordinated mobility restrictions. The impact of this interdependence on the tendency to adopt less or more restrictive measures is hard to evaluate, more so if diversity in economic exposures to citizens' mobility are considered. Here, we address this problem by developing an analytical and computational game-theoretical model encompassing the conflicts arising from the need to control the economic effects of global risks, such as in the COVID-19 pandemic. The model includes the individual costs derived from severe restrictions imposed by governments, including the resulting economic interdependence among all the parties involved in the game. By using tourism-based data, the model is enriched with actual heterogeneous income losses, such that every player has a different economic cost when applying restrictions. We show that economic interdependence enhances cooperation because of the decline in the expected payoffs by free-riding parties (i.e., those neglecting the application of mobility restrictions). Furthermore, we show (analytically and through numerical simulations) that these cross-exposures can transform the nature of the cooperation dilemma each region or country faces, modifying the position of the fixed points and the size of the basins of attraction that characterize this class of games. Finally, our results suggest that heterogeneity among regions may be used to leverage the impact of intervention policies by ensuring an agreement among the most relevant initial set of cooperators. ",
    "url": "https://arxiv.org/abs/2108.00886",
    "authors": [
      "Manuel Chica",
      "Juan M. Hernandez",
      "Francisco C. Santos"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2108.00969",
    "title": "Convergence rates of deep ReLU networks for multiclass classification",
    "abstract": "For classification problems, trained deep neural networks return probabilities of class memberships. In this work we study convergence of the learned probabilities to the true conditional class probabilities. More specifically we consider sparse deep ReLU network reconstructions minimizing cross-entropy loss in the multiclass classification setup. Interesting phenomena occur when the class membership probabilities are close to zero. Convergence rates are derived that depend on the near-zero behaviour via a margin-type condition. ",
    "url": "https://arxiv.org/abs/2108.00969",
    "authors": [
      "Thijs Bos",
      "Johannes Schmidt-Hieber"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2009.03857",
    "title": "Nonlinear computations in spiking neural networks through multiplicative  synapses",
    "abstract": " Title: Nonlinear computations in spiking neural networks through multiplicative  synapses ",
    "url": "https://arxiv.org/abs/2009.03857",
    "authors": [
      "Michele Nardin",
      "James W Phillips",
      "William F Podlaski",
      "Sander W Keemink"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2102.05926",
    "title": "Diffusion of new products with heterogeneous consumers",
    "abstract": " Comments: 40 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2102.05926",
    "authors": [
      "Gadi Fibich",
      "Amit Golan"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2102.10304",
    "title": "End-to-end neural network approach to 3D reservoir simulation and  adaptation",
    "abstract": " Title: End-to-end neural network approach to 3D reservoir simulation and  adaptation ",
    "url": "https://arxiv.org/abs/2102.10304",
    "authors": [
      "E. Illarionov",
      "P. Temirchev",
      "D. Voloskov",
      "R. Kostoev",
      "M. Simonov",
      "D. Pissarenko",
      "D. Orlov",
      "D. Koroteev"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Geophysics (physics.geo-ph)"
    ]
  },
  {
    "id": "arXiv:2103.00501",
    "title": "Exploring the social influence of Kaggle virtual community on the M5  competition",
    "abstract": " Title: Exploring the social influence of Kaggle virtual community on the M5  competition ",
    "url": "https://arxiv.org/abs/2103.00501",
    "authors": [
      "Xixi Li",
      "Yun Bai",
      "Yanfei Kang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.13833",
    "title": "Deep Learning with robustness to missing data: A novel approach to the  detection of COVID-19",
    "abstract": " Title: Deep Learning with robustness to missing data: A novel approach to the  detection of COVID-19 ",
    "url": "https://arxiv.org/abs/2103.13833",
    "authors": [
      "Erdi Çallı",
      "Keelin Murphy",
      "Steef Kurstjens",
      "Tijs Samson",
      "Robert Herpers",
      "Henk Smits",
      "Matthieu Rutten",
      "Bram van Ginneken"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2104.09943",
    "title": "The principle of weight divergence facilitation for unsupervised pattern  recognition in spiking neural networks",
    "abstract": " Comments: 9 pages, 5 figures, submitted to the conference ICANN 2021 ",
    "url": "https://arxiv.org/abs/2104.09943",
    "authors": [
      "Oleg Nikitin",
      "Olga Lukyanova",
      "Alex Kunin"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2107.10970",
    "title": "The decomposition of the higher-order homology embedding constructed  from the $k$-Laplacian",
    "abstract": " Title: The decomposition of the higher-order homology embedding constructed  from the $k$-Laplacian ",
    "url": "https://arxiv.org/abs/2107.10970",
    "authors": [
      "Yu-Chia Chen",
      "Marina Meilă"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.13709",
    "title": "Controlling epidemics through optimal allocation of test kits and  vaccine doses across networks",
    "abstract": " Comments: 13 pages, 8 figures, Submitted to IEEE Transactions on Network Science and Engineering ",
    "url": "https://arxiv.org/abs/2107.13709",
    "authors": [
      "Mingtao Xia",
      "Lucas Böttcher",
      "Tom Chou"
    ],
    "subjectives": [
      "Populations and Evolution (q-bio.PE)",
      "Social and Information Networks (cs.SI)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2107.13820",
    "title": "The interpretation of endobronchial ultrasound image using 3D  convolutional neural network for differentiating malignant and benign  mediastinal lesions",
    "abstract": " Title: The interpretation of endobronchial ultrasound image using 3D  convolutional neural network for differentiating malignant and benign  mediastinal lesions ",
    "url": "https://arxiv.org/abs/2107.13820",
    "authors": [
      "Ching-Kai Lin",
      "Shao-Hua Wu",
      "Jerry Chang",
      "Yun-Chien Cheng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.14582",
    "title": "NeuralDP Differentially private neural networks by design",
    "abstract": " Comments: The current version of the paper lacks information concerning the privacy of labels. This will be addressed in a revised version ",
    "url": "https://arxiv.org/abs/2107.14582",
    "authors": [
      "Moritz Knolle",
      "Dmitrii Usynin",
      "Alexander Ziller",
      "Marcus R. Makowski",
      "Daniel Rueckert",
      "Georgios Kaissis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  }
]