[
  {
    "id": "arXiv:2208.14450",
    "title": "Dual Representation Learning for One-Step Clustering of Multi-View Data",
    "abstract": "Multi-view data are commonly encountered in data mining applications. Effective extraction of information from multi-view data requires specific design of clustering methods to cater for data with multiple views, which is non-trivial and challenging. In this paper, we propose a novel one-step multi-view clustering method by exploiting the dual representation of both the common and specific information of different views. The motivation originates from the rationale that multi-view data contain not only the consistent knowledge between views but also the unique knowledge of each view. Meanwhile, to make the representation learning more specific to the clustering task, a one-step learning framework is proposed to integrate representation learning and clustering partition as a whole. With this framework, the representation learning and clustering partition mutually benefit each other, which effectively improve the clustering performance. Results from extensive experiments conducted on benchmark multi-view datasets clearly demonstrate the superiority of the proposed method. ",
    "url": "https://arxiv.org/abs/2208.14450",
    "authors": [
      "Wei Zhang",
      "Zhaohong Deng",
      "Kup-Sze Choi",
      "Jun Wang",
      "Shitong Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.14508",
    "title": "Swin-transformer-yolov5 For Real-time Wine Grape Bunch Detection",
    "abstract": "In this research, an integrated detection model, Swin-transformer-YOLOv5 or Swin-T-YOLOv5, was proposed for real-time wine grape bunch detection to inherit the advantages from both YOLOv5 and Swin-transformer. The research was conducted on two different grape varieties of Chardonnay (always white berry skin) and Merlot (white or white-red mix berry skin when immature; red when matured) from July to September in 2019. To verify the superiority of Swin-T-YOLOv5, its performance was compared against several commonly used/competitive object detectors, including Faster R-CNN, YOLOv3, YOLOv4, and YOLOv5. All models were assessed under different test conditions, including two different weather conditions (sunny and cloudy), two different berry maturity stages (immature and mature), and three different sunlight directions/intensities (morning, noon, and afternoon) for a comprehensive comparison. Additionally, the predicted number of grape bunches by Swin-T-YOLOv5 was further compared with ground truth values, including both in-field manual counting and manual labeling during the annotation process. Results showed that the proposed Swin-T-YOLOv5 outperformed all other studied models for grape bunch detection, with up to 97% of mean Average Precision (mAP) and 0.89 of F1-score when the weather was cloudy. This mAP was approximately 44%, 18%, 14%, and 4% greater than Faster R-CNN, YOLOv3, YOLOv4, and YOLOv5, respectively. Swin-T-YOLOv5 achieved its lowest mAP (90%) and F1-score (0.82) when detecting immature berries, where the mAP was approximately 40%, 5%, 3%, and 1% greater than the same. Furthermore, Swin-T-YOLOv5 performed better on Chardonnay variety with achieved up to 0.91 of R2 and 2.36 root mean square error (RMSE) when comparing the predictions with ground truth. However, it underperformed on Merlot variety with achieved only up to 0.70 of R2 and 3.30 of RMSE. ",
    "url": "https://arxiv.org/abs/2208.14508",
    "authors": [
      "Shenglian Lu",
      "Xiaoyu Liu",
      "Zixaun He",
      "Manoj Karkee",
      "Xin Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.14510",
    "title": "Reversible Data hiding in Encrypted Domain with Public Key Embedding  Mechanism",
    "abstract": "Considering the prospects of public key embedding (PKE) mechanism in active forensics on the integrity or identity of ciphertext for distributed deep learning security, two reversible data hiding in encrypted domain (RDH-ED) algorithms with PKE mechanism are proposed, in which all the elements of the embedding function shall be open to the public, while the extraction function could be performed only by legitimate users. The first algorithm is difference expansion in single bit encrypted domain (DE-SBED), which is optimized from the homomorphic embedding framework based on the bit operations of DE in spatial domain. DE-SBED is suitable for the ciphertext of images encrypted from any single bit encryption and learning with errors (LWE) encryption is selected in this paper. Pixel value ordering is introduced to reduce the distortion of decryption and improve the embedding rates (ER). To apply to more flexible applications, public key recoding on encryption redundancy (PKR-ER) algorithm is proposed. Public embedding key is constructed by recoding on the redundancy from the probabilistic decryption of LWE. It is suitable for any plaintext regardless of the type of medium or the content. By setting different quantization rules for recoding, decryption and extraction functions are separable. No distortion exists in the directly decrypted results of the marked ciphertext and ER could reach over 1.0 bits per bit of plaintext. Correctness and security of the algorithms are proved theoretically by deducing the probability distributions of ciphertext and quantization variable. Experimental results demonstrate the performances in correctness, one-way attribute of security and efficiency of the algorithms. ",
    "url": "https://arxiv.org/abs/2208.14510",
    "authors": [
      "Yan Ke",
      "Minqing Zhang",
      "Xinpeng Zhang",
      "Yiliang Han",
      "Jia Liu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2208.14536",
    "title": "MultiCoNER: A Large-scale Multilingual dataset for Complex Named Entity  Recognition",
    "abstract": "We present MultiCoNER, a large multilingual dataset for Named Entity Recognition that covers 3 domains (Wiki sentences, questions, and search queries) across 11 languages, as well as multilingual and code-mixing subsets. This dataset is designed to represent contemporary challenges in NER, including low-context scenarios (short and uncased text), syntactically complex entities like movie titles, and long-tail entity distributions. The 26M token dataset is compiled from public resources using techniques such as heuristic-based sentence sampling, template extraction and slotting, and machine translation. We applied two NER models on our dataset: a baseline XLM-RoBERTa model, and a state-of-the-art GEMNET model that leverages gazetteers. The baseline achieves moderate performance (macro-F1=54%), highlighting the difficulty of our data. GEMNET, which uses gazetteers, improvement significantly (average improvement of macro-F1=+30%). MultiCoNER poses challenges even for large pre-trained language models, and we believe that it can help further research in building robust NER systems. MultiCoNER is publicly available at https://registry.opendata.aws/multiconer/ and we hope that this resource will help advance research in various aspects of NER. ",
    "url": "https://arxiv.org/abs/2208.14536",
    "authors": [
      "Shervin Malmasi",
      "Anjie Fang",
      "Besnik Fetahu",
      "Sudipta Kar",
      "Oleg Rokhlenko"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2208.14558",
    "title": "Augraphy: A Data Augmentation Library for Document Images",
    "abstract": "This paper introduces Augraphy, a Python package geared toward realistic data augmentation strategies for document images. Augraphy uses many different augmentation strategies to produce augmented versions of clean document images that appear as if they have been distorted from standard office operations, such as printing, scanning, and faxing through old or dirty machines, degradation of ink over time, and handwritten markings. Augraphy can be used both as a data augmentation tool for (1) producing diverse training data for tasks such as document de-noising, and (2) generating challenging test data for evaluating model robustness on document image modeling tasks. This paper provides an overview of Augraphy and presents three example robustness testing use-cases of Augraphy. ",
    "url": "https://arxiv.org/abs/2208.14558",
    "authors": [
      "Samay Maini",
      "Alexander Groleau",
      "Kok Wei Chee",
      "Stefan Larson",
      "Jonathan Boarman"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.14586",
    "title": "Few-shot Adaptive Object Detection with Cross-Domain CutMix",
    "abstract": "In object detection, data amount and cost are a trade-off, and collecting a large amount of data in a specific domain is labor intensive. Therefore, existing large-scale datasets are used for pre-training. However, conventional transfer learning and domain adaptation cannot bridge the domain gap when the target domain differs significantly from the source domain. We propose a data synthesis method that can solve the large domain gap problem. In this method, a part of the target image is pasted onto the source image, and the position of the pasted region is aligned by utilizing the information of the object bounding box. In addition, we introduce adversarial learning to discriminate whether the original or the pasted regions. The proposed method trains on a large number of source images and a few target domain images. The proposed method achieves higher accuracy than conventional methods in a very different domain problem setting, where RGB images are the source domain, and thermal infrared images are the target domain. Similarly, the proposed method achieves higher accuracy in the cases of simulation images to real images. ",
    "url": "https://arxiv.org/abs/2208.14586",
    "authors": [
      "Yuzuru Nakamura",
      "Yasunori Ishii",
      "Yuki Maruyama",
      "Takayoshi Yamashita"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.14590",
    "title": "A class of GADI methods for time-dependent linear systems with multitask  kernel-learning parameter prediction",
    "abstract": "This paper develops a class of general alternating-direction implicit (GADI) iteration methods for solving time-dependent linear systems (TDLS), including linear differential systems and linear matrix systems. We present a GADI Kronecker product splitting (GADI-KP) method and prove the convergence with weak restrictions. The generalized Kronecker product splitting method and Kronecker product splitting method can be unified in the GADI-KP framework. Then, we use the framework to design an effective preconditioner of Krylov subspace methods for solving TDLS. The GADI-KP method is sensitive to the splitting parameters. Different from traditional theoretical estimate methods, we propose multitask kernel learning Gaussian process regression (GPR) method to predict the relative optimal splitting parameters. This method has solved the multi-parameter optimization in GADI framework and kernel selection in GPR method. Finally, we apply our approach to solve a two-dimensional diffusion equation, a two-dimensional convection-diffusion equation, and a differential Sylvester matrix equation. Numerical experiments illustrate that the GADI-KP framework and its preconditioning form have advantage over efficiency and superiority compared with the existing results. ",
    "url": "https://arxiv.org/abs/2208.14590",
    "authors": [
      "Kai Jiang",
      "Juan Zhang",
      "Qi Zhou"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2208.14591",
    "title": "Combinatorial Procurement Auction in Social Networks",
    "abstract": "This paper studies one emerging procurement auction scenario where the market is constructed over the social networks. In a social network composed of many agents, smartphones or computers, one requester releases her requirement for goods or tasks to suppliers, then suppliers who have entered the market are also encouraged to invite some other suppliers to join and all the suppliers in the network could compete for the business. The key problem for this networked auction is about how to incentivize each node who have entered the sell not only to truthfully use her full ability, but also to forward the task to her neighbours. Auctions conducting over social networks have attracted considerable interests in recent years. However, most of the existing works focus on classic forward auctions. Moreover, there is no existing valid networked auction considering multiple goods/tasks. This work is the first to explore procurement auction for both homogeneous and heterogeneous goods or tasks in social networks. From both theoretical proof and experimental simulation, we proved that the proposed mechanisms are proved to be individual-rational and incentive-compatible, also both the cost of the system and the requester could get decreased. ",
    "url": "https://arxiv.org/abs/2208.14591",
    "authors": [
      "Yuhang Guo",
      "Dong Hao",
      "Bin Li"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Theoretical Economics (econ.TH)"
    ]
  },
  {
    "id": "arXiv:2208.14600",
    "title": "ELSR: Extreme Low-Power Super Resolution Network For Mobile Devices",
    "abstract": "With the popularity of mobile devices, e.g., smartphone and wearable devices, lighter and faster model is crucial for the application of video super resolution. However, most previous lightweight models tend to concentrate on reducing lantency of model inference on desktop GPU, which may be not energy efficient in current mobile devices. In this paper, we proposed Extreme Low-Power Super Resolution (ELSR) network which only consumes a small amount of energy in mobile devices. Pretraining and finetuning methods are applied to boost the performance of the extremely tiny model. Extensive experiments show that our method achieves a excellent balance between restoration quality and power consumption. Finally, we achieve a competitive score of 90.9 with PSNR 27.34 dB and power 0.09 W/30FPS on the target MediaTek Dimensity 9000 plantform, ranking 1st place in the Mobile AI & AIM 2022 Real-Time Video Super-Resolution Challenge. ",
    "url": "https://arxiv.org/abs/2208.14600",
    "authors": [
      "Tianyu Xu",
      "Zhuang Jia",
      "Yijian Zhang",
      "Long Bao",
      "Heng Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2208.14601",
    "title": "A topic-aware graph neural network model for knowledge base updating",
    "abstract": "The open domain knowledge base is very important. It is usually extracted from encyclopedia websites and is widely used in knowledge retrieval systems, question answering systems, or recommendation systems. In practice, the key challenge is to maintain an up-to-date knowledge base. Different from Unwieldy fetching all of the data from the encyclopedia dumps, to enlarge the freshness of the knowledge base as big as possible while avoiding invalid fetching, the current knowledge base updating methods usually determine whether entities need to be updated by building a prediction model. However, these methods can only be defined in some specific fields and the result turns out to be obvious bias, due to the problem of data source and data structure. The users' query intentions are often diverse as to the open domain knowledge, so we construct a topic-aware graph network for knowledge updating based on the user query log. Our methods can be summarized as follow: 1. Extract entities through the user's log and select them as seeds 2. Scrape the attributes of seed entities in the encyclopedia website, and self-supervised construct the entity attribute graph for each entity. 3. Use the entity attribute graph to train the GNN entity update model to determine whether the entity needs to be synchronized. 4.Use the encyclopedia knowledge to match and update the filtered entity with the entity in the knowledge base according to the minimum edit times algorithm. ",
    "url": "https://arxiv.org/abs/2208.14601",
    "authors": [
      "Jiajun Tong",
      "Zhixiao Wang",
      "Xiaobin Rui"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.14634",
    "title": "Graph Neural Networks with Motif-aware for Tenuous Subgraph Finding",
    "abstract": "Tenuous subgraph finding aims to detect a subgraph with few social interactions and weak relationships among nodes. Despite significant efforts have been made on this task, they are mostly carried out in view of graph-structured data. These methods depend on calculating the shortest path and need to enumerate all the paths between nodes, which suffer the combinatorial explosion. Moreover, they all lack the integration of neighborhood information. To this end, we propose a novel model named Graph Neural Network with Motif-aware for tenuous subgraph finding (GNNM), a neighborhood aggregation based GNNs framework which can capture the latent relationship between nodes. Specially, we design a GNN module to project nodes into a low dimensional vector combining the higher-order correlation within nodes based on a motif-aware module. And then design greedy algorithms in vector space to obtain a tenuous subgraph whose size is greater than a specified constraint. Particularly, considering existing evaluation indicators cannot capture the latent friendship between nodes, we introduce a novel Potential Friend(PF) concept to measure the tenuity of a graph from a new perspective. Experimental results on the real-world and synthetic datasets demonstrate that our proposed method GNNM outperforms existing algorithms in efficiency and subgraph quality. ",
    "url": "https://arxiv.org/abs/2208.14634",
    "authors": [
      "Heli sun",
      "Miaomiao Sun",
      "Liang He",
      "Xiaolin Jia"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2208.14661",
    "title": "Stochastic Resource Allocation for Semantic Communication-aided Virtual  Transportation Networks in the Metaverse",
    "abstract": "The physical-virtual world synchronization to develop the Metaverse will require a massive transmission and exchange of data. In this paper, we introduce semantic communication for the development of virtual transportation networks in the Metaverse. Leveraging the perception capabilities of edge devices, virtual service providers (VSPs) can subscribe to their preferred edge devices to receive the semantic data of interest. However, the demands of the VSPs are highly dependent on the users that they are serving. To address the resource allocation problem amid stochastic user demand, we propose a stochastic semantic transmission scheme (SSTS) based on two-stage stochastic integer programming. Using real data captured by edge devices we deploy in Singapore, the simulation results show that SSTS can minimize the transmission cost of the VSPs while accounting for the users' demand uncertainties. ",
    "url": "https://arxiv.org/abs/2208.14661",
    "authors": [
      "Wei Chong Ng",
      "Hongyang Du",
      "Wei Yang Bryan Lim",
      "Zehui Xiong",
      "Dusit Niyato",
      "Chunyan Miao"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2208.14662",
    "title": "AWADA: Attention-Weighted Adversarial Domain Adaptation for Object  Detection",
    "abstract": "Object detection networks have reached an impressive performance level, yet a lack of suitable data in specific applications often limits it in practice. Typically, additional data sources are utilized to support the training task. In these, however, domain gaps between different data sources pose a challenge in deep learning. GAN-based image-to-image style-transfer is commonly applied to shrink the domain gap, but is unstable and decoupled from the object detection task. We propose AWADA, an Attention-Weighted Adversarial Domain Adaptation framework for creating a feedback loop between style-transformation and detection task. By constructing foreground object attention maps from object detector proposals, we focus the transformation on foreground object regions and stabilize style-transfer training. In extensive experiments and ablation studies, we show that AWADA reaches state-of-the-art unsupervised domain adaptation object detection performance in the commonly used benchmarks for tasks such as synthetic-to-real, adverse weather and cross-camera adaptation. ",
    "url": "https://arxiv.org/abs/2208.14662",
    "authors": [
      "Maximilian Menke",
      "Thomas Wenzel",
      "Andreas Schwung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.14666",
    "title": "Optimality Analysis and Block Sparse Algorithm for Complex Compressed  Sensing",
    "abstract": "Recently, many new challenges in Compressed Sensing (CS), such as block sparsity, arose. In this paper, we present a new algorithm for solving CS with block sparse constraints (BSC) in complex fields. Firstly, based on block sparsity characteristics, we propose a new model to deal with CS with BSC and analyze the properties of the functions involved in this model. We then present a new $\\tau$-stationary point and analyze corresponding first-order sufficient and necessary conditions. That ensures we to further develop a block Newton hard-thresholding pursuit (BNHTP) algorithm for efficiently solving CS with BSC. Finally, preliminary numerical experiments demonstrate that the BNHTP algorithm has superior performance in terms of recovery accuracy and calculation time when compared with the classical AMP algorithm. ",
    "url": "https://arxiv.org/abs/2208.14666",
    "authors": [
      "Hui Zhang",
      "Xin Liu",
      "Naihua Xiu"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2208.14672",
    "title": "Vulnerability of Distributed Inverter VAR Control in PV Distributed  Energy System",
    "abstract": "This work studies the potential vulnerability of distributed control schemes in smart grids. To this end, we consider an optimal inverter VAR control problem within a PV-integrated distribution network. First, we formulate the centralized optimization problem considering the reactive power priority and further reformulate the problem into a distributed framework by an accelerated proximal projection method. The inverter controller can curtail the PV output of each user by clamping the reactive power. To illustrate the studied distributed control scheme that may be vulnerable due to the two-hop information communication pattern, we present a heuristic attack injecting false data during the information exchange. Then we analyze the attack impact on the update procedure of critical parameters. A case study with an eight-node test feeder demonstrates that adversaries can violate the constraints of distributed control scheme without being detected through simple attacks such as the proposed attack. ",
    "url": "https://arxiv.org/abs/2208.14672",
    "authors": [
      "Bo Tu",
      "Wen-Tai Li",
      "Chau Yuen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.14673",
    "title": "Incremental Learning in Diagonal Linear Networks",
    "abstract": "Diagonal linear networks (DLNs) are a toy simplification of artificial neural networks; they consist in a quadratic reparametrization of linear regression inducing a sparse implicit regularization. In this paper, we describe the trajectory of the gradient flow of DLNs in the limit of small initialization. We show that incremental learning is effectively performed in the limit: coordinates are successively activated, while the iterate is the minimizer of the loss constrained to have support on the active coordinates only. This shows that the sparse implicit regularization of DLNs decreases with time. This work is restricted to the underparametrized regime with anti-correlated features for technical reasons. ",
    "url": "https://arxiv.org/abs/2208.14673",
    "authors": [
      "Raphaël Berthier"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2208.14674",
    "title": "A Survey of Security and Privacy Issues in V2X Communication Systems",
    "abstract": "Vehicle-to-Everything (V2X) communication is receiving growing attention from industry and academia as multiple pilot projects explore its capabilities and feasibility. With about 50\\% of global road vehicle exports coming from the European Union (EU), and within the context of EU legislation around security and data protection, V2X initiatives must consider security and privacy aspects across the system stack, in addition to road safety. Contrary to this principle, our survey of relevant standards, research outputs, and EU pilot projects indicates otherwise; we identify multiple security and privacy related shortcomings and inconsistencies across the standards. We conduct a root cause analysis of the reasons and difficulties associated with these gaps, and categorize the identified security and privacy issues relative to these root causes. As a result, our comprehensive analysis sheds lights on a number of areas that require improvements in the standards, which are not explicitly identified in related work. Our analysis fills gaps left by other related surveys, which are focused on specific technical areas but not necessarily point out underlying root issues in standard specifications. We bring forward recommendations to address these gaps for the overall improvement of security and safety in vehicular communication. ",
    "url": "https://arxiv.org/abs/2208.14674",
    "authors": [
      "Takahito Yoshizawa",
      "Dave Singelée",
      "Jan Tobias Muehlberg",
      "Stéphane Delbruel",
      "Amir Taherkordi",
      "Danny Hughes",
      "Bart Preneel"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2208.14681",
    "title": "When Variable-Length Codes Meet the Field of Error Detection",
    "abstract": "Given a finite alphabet $A$ and a binary relation $\\tau\\subseteq A^*\\times A^*$, a set $X$ is $\\tau$-{\\it independent} if $ \\tau(X)\\cap X=\\emptyset$. Given a quasi-metric $d$ over $A^*$ (in the meaning of \\cite{W31}) and $k\\ge 1$, we associate the relation $\\tau_{d,k}$ defined by $(x,y)\\in\\tau_{d,k}$ if, and only if, $d(x,y)\\le k$ \\cite{CP02}.In the spirit of \\cite{JK97,N21}, the error detection-correction capability of variable-length codes can be expressed in term of conditions over $\\tau_{d,k}$. With respect to the prefix metric, the factor one, and every quasi-metric associated to (anti-)automorphisms of the free monoid, we examine whether those conditions are decidable for a given regular code. ",
    "url": "https://arxiv.org/abs/2208.14681",
    "authors": [
      "Jean Néraud"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2208.14692",
    "title": "The Lothbrok approach for SPARQL Query Optimization over Decentralized  Knowledge Graphs",
    "abstract": "While the Web of Data in principle offers access to a wide range of interlinked data, the architecture of the Semantic Web today relies mostly on the data providers to maintain access to their data through SPARQL endpoints. Several studies, however, have shown that such endpoints often experience downtime, meaning that the data they maintain becomes inaccessible. While decentralized systems based on Peer-to-Peer (P2P) technology have previously shown to increase the availability of knowledge graphs, even when a large proportion of the nodes fail, processing queries in such a setup can be an expensive task since data necessary to answer a single query might be distributed over multiple nodes. In this paper, we therefore propose an approach to optimizing SPARQL queries over decentralized knowledge graphs, called Lothbrok. While there are potentially many aspects to consider when optimizing such queries, we focus on three aspects: cardinality estimation, locality awareness, and data fragmentation. We empirically show that Lothbrok is able to achieve significantly faster query processing performance compared to the state of the art when processing challenging queries as well as when the network is under high load. ",
    "url": "https://arxiv.org/abs/2208.14692",
    "authors": [
      "Christian Aebeloe",
      "Gabriela Montoya",
      "Katja Hose"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2208.14694",
    "title": "Modelling and Detection of Driver's Fatigue using Ontology",
    "abstract": "Road accidents have become the eight leading cause of death all over the world. Lots of these accidents are due to a driver's inattention or lack of focus, due to fatigue. Various factors cause driver's fatigue. This paper considers all the measureable data that manifest driver's fatigue, namely those manifested in the vehicle measureable data while driving as well as the driver's physical and physiological data. Each of the three main factors are further subdivided into smaller details. For example, the vehicle's data is composed of the values obtained from the steering wheel's angle, yaw angle, the position on the lane, and the speed and acceleration of the vehicle while moving. Ontological knowledge and rules for driver fatigue detection are to be integrated into an intelligent system so that on the first sign of dangerous level of fatigue is detected, a warning notification is sent to the driver. This work is intended to contribute to safe road driving. ",
    "url": "https://arxiv.org/abs/2208.14694",
    "authors": [
      "Alexandre Lambert",
      "Manolo Dulva Hina",
      "Celine Barth",
      "Assia Soukane",
      "Amar Ramdane-Cherif"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2208.14723",
    "title": "P versus B: P Systems as a Formal Framework for Controllability of  Boolean Networks",
    "abstract": "Membrane computing and P systems are a paradigm of massively parallel natural computing introduced by Gheorghe P\\u{a}un in 1999, inspired by the structure of the living cell and by its biochemical reactions. In spite of this explicit biological motivation, P systems have not been extensively used in modelling real-world systems. To confirm this intuition, we establish a state of the art investigation comparing the use of P systems to that of Boolean networks in this line of research. We then propose to use P systems as a tool for setting up formal frameworks to reason about other formalisms, and we introduce Boolean P systems, specifically tailored for capturing sequential controllability of Boolean networks. We show how to tackle some technical challenges and prove that sequential controllability properly embeds in the framework of Boolean P systems. ",
    "url": "https://arxiv.org/abs/2208.14723",
    "authors": [
      "Artiom Alhazov",
      "Rudolf Freund",
      "Sergiu Ivanov"
    ],
    "subjectives": [
      "Formal Languages and Automata Theory (cs.FL)"
    ]
  },
  {
    "id": "arXiv:2208.14738",
    "title": "Scatter Points in Space: 3D Detection from Multi-view Monocular Images",
    "abstract": "3D object detection from monocular image(s) is a challenging and long-standing problem of computer vision. To combine information from different perspectives without troublesome 2D instance tracking, recent methods tend to aggregate multiview feature by sampling regular 3D grid densely in space, which is inefficient. In this paper, we attempt to improve multi-view feature aggregation by proposing a learnable keypoints sampling method, which scatters pseudo surface points in 3D space, in order to keep data sparsity. The scattered points augmented by multi-view geometric constraints and visual features are then employed to infer objects location and shape in the scene. To make up the limitations of single frame and model multi-view geometry explicitly, we further propose a surface filter module for noise suppression. Experimental results show that our method achieves significantly better performance than previous works in terms of 3D detection (more than 0.1 AP improvement on some categories of ScanNet). The code will be publicly available. ",
    "url": "https://arxiv.org/abs/2208.14738",
    "authors": [
      "Jianlin Liu",
      "Zhuofei Huang",
      "Dihe Huang",
      "Shang Xu",
      "Ying Chen",
      "Yong Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.14748",
    "title": "A Musical Serious Game for Social Interaction through Augmented Rhythmic  Improvisation",
    "abstract": "Making music with other people is a social activity as well as an artistic one. Music therapists take advantage of the social aspects of music to obtain benefits for the patients, interacting with them musically, but this activity requires an high level of expertise. We propose a serious game that helps people even without musical skills interact with each other by collaboratively creating a rhythm with MIDI drum pads. The gaming system analyzes the rhythm in real time to add a musical feedback that enhances the aesthetical experience that is a crucial part of the musical interaction. The system is evaluated through a questionnaire asking subjects who tried in couples the system if they perceived it as helping their interaction. Despite the early development stage of the game, the results of the questionnaire show positive reception. ",
    "url": "https://arxiv.org/abs/2208.14748",
    "authors": [
      "Filippo Carnovalini",
      "Antonio Rodà",
      "Paolo Caneva"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2208.14795",
    "title": "Ant Colony Optimization for Mining Gradual Patterns",
    "abstract": "Gradual pattern extraction is a field in (KDD) Knowledge Discovery in Databases that maps correlations between attributes of a data set as gradual dependencies. A gradual dependency may take a form of \"the more Attribute K , the less Attribute L\". In this paper, we propose an ant colony optimization technique that uses a probabilistic approach to learn and extract frequent gradual patterns. Through computational experiments on real-world data sets, we compared the performance of our ant-based algorithm to an existing gradual item set extraction algorithm and we found out that our algorithm outperforms the later especially when dealing with large data sets. ",
    "url": "https://arxiv.org/abs/2208.14795",
    "authors": [
      "Dickson Odhiambo Owuor",
      "Thomas Runkler",
      "Anne Laurent",
      "Joseph Orero",
      "Edmond Menya"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2208.14796",
    "title": "3DLG-Detector: 3D Object Detection via Simultaneous Local-Global Feature  Learning",
    "abstract": "Capturing both local and global features of irregular point clouds is essential to 3D object detection (3OD). However, mainstream 3D detectors, e.g., VoteNet and its variants, either abandon considerable local features during pooling operations or ignore many global features in the whole scene context. This paper explores new modules to simultaneously learn local-global features of scene point clouds that serve 3OD positively. To this end, we propose an effective 3OD network via simultaneous local-global feature learning (dubbed 3DLG-Detector). 3DLG-Detector has two key contributions. First, it develops a Dynamic Points Interaction (DPI) module that preserves effective local features during pooling. Besides, DPI is detachable and can be incorporated into existing 3OD networks to boost their performance. Second, it develops a Global Context Aggregation module to aggregate multi-scale features from different layers of the encoder to achieve scene context-awareness. Our method shows improvements over thirteen competitors in terms of detection accuracy and robustness on both the SUN RGB-D and ScanNet datasets. Source code will be available upon publication. ",
    "url": "https://arxiv.org/abs/2208.14796",
    "authors": [
      "Baian Chen",
      "Liangliang Nan",
      "Haoran Xie",
      "Dening Lu",
      "Fu Lee Wang",
      "Mingqiang Wei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.14801",
    "title": "Nonparametric and Online Change Detection in Multivariate Datastreams  using QuantTree",
    "abstract": "We address the problem of online change detection in multivariate datastreams, and we introduce QuantTree Exponentially Weighted Moving Average (QT-EWMA), a nonparametric change-detection algorithm that can control the expected time before a false alarm, yielding a desired Average Run Length (ARL$_0$). Controlling false alarms is crucial in many applications and is rarely guaranteed by online change-detection algorithms that can monitor multivariate datastreams without knowing the data distribution. Like many change-detection algorithms, QT-EWMA builds a model of the data distribution, in our case a QuantTree histogram, from a stationary training set. To monitor datastreams even when the training set is extremely small, we propose QT-EWMA-update, which incrementally updates the QuantTree histogram during monitoring, always keeping the ARL$_0$ under control. Our experiments, performed on synthetic and real-world datastreams, demonstrate that QT-EWMA and QT-EWMA-update control the ARL$_0$ and the false alarm rate better than state-of-the-art methods operating in similar conditions, achieving lower or comparable detection delays. ",
    "url": "https://arxiv.org/abs/2208.14801",
    "authors": [
      "Luca Frittoli",
      "Diego Carrera",
      "Giacomo Boracchi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.14807",
    "title": "Data Analysis in Social Networks for Agribusiness -- A Systematic  Mapping Study",
    "abstract": "The ability of companies to react to changes imposed by the market is related to information acquisition and knowledge generation. Big data technologies, crowdsourcing, and Online Social Network (OSN) are used for knowledge generation. These technologies assumed a significant position in agribusiness. This work investigates how social network analysis can promote agribusiness to provide a basis for future applications and evaluations. We adopted a hybrid systematic mapping to conduct the investigation. Two hundred twenty-three works that propose solutions for agribusiness were found and categorized. Results showed the most used techniques, OSNs, and revealed an increase in the number of studies in this area. The information obtained indicates how social media monitoring can complement traditional methods for decision-making on the management and regulation of agricultural systems. However, agribusiness still lacks more studies using data analysis tools on social networks. Based on our results, we discuss some challenges and research directions. ",
    "url": "https://arxiv.org/abs/2208.14807",
    "authors": [
      "Nedson Soares",
      "Regina Braga",
      "Jose Maria David",
      "Kennya Siqueira",
      "Victor Stroele"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2208.14810",
    "title": "Graph Distance Neural Networks for Predicting Multiple Drug Interactions",
    "abstract": "Since multidrug combination is widely applied, the accurate prediction of drug-drug interaction (DDI) is becoming more and more critical. In our method, we use graph to represent drug-drug interaction: nodes represent drug; edges represent drug-drug interactions. Based on our assumption, we convert the prediction of DDI to link prediction problem, utilizing known drug node characteristics and DDI types to predict unknown DDI types. This work proposes a Graph Distance Neural Network (GDNN) to predict drug-drug interactions. Firstly, GDNN generates initial features for nodes via target point method, fully including the distance information in the graph. Secondly, GDNN adopts an improved message passing framework to better generate each drug node embedded expression, comprehensively considering the nodes and edges characteristics synchronously. Thirdly, GDNN aggregates the embedded expressions, undergoing MLP processing to generate the final predicted drug interaction type. GDNN achieved Test Hits@20=0.9037 on the ogb-ddi dataset, proving GDNN can predict DDI efficiently. ",
    "url": "https://arxiv.org/abs/2208.14810",
    "authors": [
      "Haifan zhou",
      "Wenjing Zhou",
      "Junfeng Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2208.14812",
    "title": "Domain Shift-oriented Machine Anomalous Sound Detection Model Based on  Self-Supervised Learning",
    "abstract": "Thanks to the development of deep learning, research on machine anomalous sound detection based on self-supervised learning has made remarkable achievements. However, there are differences in the acoustic characteristics of the test set and the training set under different operating conditions of the same machine (domain shifts). It is challenging for the existing detection methods to learn the domain shifts features stably with low computation overhead. To address these problems, we propose a domain shift-oriented machine anomalous sound detection model based on self-supervised learning (TranSelf-DyGCN) in this paper. Firstly, we design a time-frequency domain feature modeling network to capture global and local spatial and time-domain features, thus improving the stability of machine anomalous sound detection stability under domain shifts. Then, we adopt a Dynamic Graph Convolutional Network (DyGCN) to model the inter-dependence relationship between domain shifts features, enabling the model to perceive domain shifts features efficiently. Finally, we use a Domain Adaptive Network (DAN) to compensate for the performance decrease caused by domain shifts, making the model adapt to anomalous sound better in the self-supervised environment. The performance of the suggested model is validated on DCASE 2020 task 2 and DCASE 2022 task 2. ",
    "url": "https://arxiv.org/abs/2208.14812",
    "authors": [
      "Jing-ke Yan",
      "Xin Wang",
      "Qin Wang",
      "Qin Qin",
      "Huang-he Li",
      "Peng-fei Ye",
      "Yue-ping He",
      "Jing Zeng"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2208.14819",
    "title": "Cadence Detection in Symbolic Classical Music using Graph Neural  Networks",
    "abstract": "Cadences are complex structures that have been driving music from the beginning of contrapuntal polyphony until today. Detecting such structures is vital for numerous MIR tasks such as musicological analysis, key detection, or music segmentation. However, automatic cadence detection remains challenging mainly because it involves a combination of high-level musical elements like harmony, voice leading, and rhythm. In this work, we present a graph representation of symbolic scores as an intermediate means to solve the cadence detection task. We approach cadence detection as an imbalanced node classification problem using a Graph Convolutional Network. We obtain results that are roughly on par with the state of the art, and we present a model capable of making predictions at multiple levels of granularity, from individual notes to beats, thanks to the fine-grained, note-by-note representation. Moreover, our experiments suggest that graph convolution can learn non-local features that assist in cadence detection, freeing us from the need of having to devise specialized features that encode non-local context. We argue that this general approach to modeling musical scores and classification tasks has a number of potential advantages, beyond the specific recognition task presented here. ",
    "url": "https://arxiv.org/abs/2208.14819",
    "authors": [
      "Emmanouil Karystinaios",
      "Gerhard Widmer"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2208.14820",
    "title": "Learning Automata-Based Complex Event Patterns in Answer Set Programming",
    "abstract": "Complex Event Recognition and Forecasting (CER/F) techniques attempt to detect, or even forecast ahead of time, event occurrences in streaming input using predefined event patterns. Such patterns are not always known in advance, or they frequently change over time, making machine learning techniques, capable of extracting such patterns from data, highly desirable in CER/F. Since many CER/F systems use symbolic automata to represent such patterns, we propose a family of such automata where the transition-enabling conditions are defined by Answer Set Programming (ASP) rules, and which, thanks to the strong connections of ASP to symbolic learning, are directly learnable from data. We present such a learning approach in ASP and an incremental version thereof that trades optimality for efficiency and is capable to scale to large datasets. We evaluate our approach on two CER datasets and compare it to state-of-the-art automata learning techniques, demonstrating empirically a superior performance, both in terms of predictive accuracy and scalability. ",
    "url": "https://arxiv.org/abs/2208.14820",
    "authors": [
      "Nikos Katzouris",
      "Georgios Paliouras"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.14822",
    "title": "A Fair Experimental Comparison of Neural Network Architectures for  Latent Representations of Multi-Omics for Drug Response Prediction",
    "abstract": "Recent years have seen a surge of novel neural network architectures for the integration of multi-omics data for prediction. Most of the architectures include either encoders alone or encoders and decoders, i.e., autoencoders of various sorts, to transform multi-omics data into latent representations. One important parameter is the depth of integration: the point at which the latent representations are computed or merged, which can be either early, intermediate, or late. The literature on integration methods is growing steadily, however, close to nothing is known about the relative performance of these methods under fair experimental conditions and under consideration of different use cases. We developed a comparison framework that trains and optimizes multi-omics integration methods under equal conditions. We incorporated early integration and four recently published deep learning methods: MOLI, Super.FELT, OmiEmbed, and MOMA. Further, we devised a novel method, Omics Stacking, that combines the advantages of intermediate and late integration. Experiments were conducted on a public drug response data set with multiple omics data (somatic point mutations, somatic copy number profiles and gene expression profiles) that was obtained from cell lines, patient-derived xenografts, and patient samples. Our experiments confirmed that early integration has the lowest predictive performance. Overall, architectures that integrate triplet loss achieved the best results. Statistical differences can, overall, rarely be observed, however, in terms of the average ranks of methods, Super.FELT is consistently performing best in a cross-validation setting and Omics Stacking best in an external test set setting. The source code of all experiments is available under \\url{https://github.com/kramerlab/Multi-Omics_analysis} ",
    "url": "https://arxiv.org/abs/2208.14822",
    "authors": [
      "Tony Hauptmann",
      "Stefan Kramer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2208.14834",
    "title": "Deep Anomaly Detection and Search via Reinforcement Learning",
    "abstract": "Semi-supervised Anomaly Detection (AD) is a kind of data mining task which aims at learning features from partially-labeled datasets to help detect outliers. In this paper, we classify existing semi-supervised AD methods into two categories: unsupervised-based and supervised-based, and point out that most of them suffer from insufficient exploitation of labeled data and under-exploration of unlabeled data. To tackle these problems, we propose Deep Anomaly Detection and Search (DADS), which applies Reinforcement Learning (RL) to balance exploitation and exploration. During the training process, the agent searches for possible anomalies with hierarchically-structured datasets and uses the searched anomalies to enhance performance, which in essence draws lessons from the idea of ensemble learning. Experimentally, we compare DADS with several state-of-the-art methods in the settings of leveraging labeled known anomalies to detect both other known anomalies and unknown anomalies. Results show that DADS can efficiently and precisely search anomalies from unlabeled data and learn from them, thus achieving good performance. ",
    "url": "https://arxiv.org/abs/2208.14834",
    "authors": [
      "Chao Chen",
      "Dawei Wang",
      "Feng Mao",
      "Zongzhang Zhang",
      "Yang Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.14841",
    "title": "On weighted graph separation problems and flow-augmentation",
    "abstract": "One of the first application of the recently introduced technique of \\emph{flow-augmentation} [Kim et al., STOC 2022] is a fixed-parameter algorithm for the weighted version of \\textsc{Directed Feedback Vertex Set}, a landmark problem in parameterized complexity. In this note we explore applicability of flow-augmentation to other weighted graph separation problems parameterized by the size of the cutset. We show the following. -- In weighted undirected graphs \\textsc{Multicut} is FPT, both in the edge- and vertex-deletion version. -- The weighted version of \\textsc{Group Feedback Vertex Set} is FPT, even with an oracle access to group operations. -- The weighted version of \\textsc{Directed Subset Feedback Vertex Set} is FPT. Our study reveals \\textsc{Directed Symmetric Multicut} as the next important graph separation problem whose parameterized complexity remains unknown, even in the unweighted setting. ",
    "url": "https://arxiv.org/abs/2208.14841",
    "authors": [
      "Eun Jung Kim",
      "Marcin Pilipczuk",
      "Roohani Sharma",
      "Magnus Wahlström"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2208.14845",
    "title": "Listen to your heart: A self-supervised approach for detecting murmur in  heart-beat sounds for the Physionet 2022 challenge",
    "abstract": "Heart murmurs are abnormal sounds present in heartbeats, caused by turbulent blood flow through the heart. The PhysioNet 2022 challenge targets automatic detection of murmur from audio recordings of the heart and automatic detection of normal vs. abnormal clinical outcome. The recordings are captured from multiple locations around the heart. Our participation investigates the effectiveness of self-supervised learning for murmur detection. We evaluate the use of a backbone CNN, whose layers are trained in a self-supervised way with data from both this year's and the 2016 challenge. We use two different augmentations on each training sample, and normalized temperature-scaled cross-entropy loss. We experiment with different augmentations to learn effective phonocardiogram representations. To build the final detectors we train two classification heads, one for each challenge task. We present evaluation results for all combinations of the available augmentations, and for our multiple-augmentation approach. ",
    "url": "https://arxiv.org/abs/2208.14845",
    "authors": [
      "Aristotelis Ballas",
      "Vasileios Papapanagiotou",
      "Anastasios Delopoulos",
      "Christos Diou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2208.14866",
    "title": "A case study of the profit-maximizing multi-vehicle pickup and delivery  selection problem for the road networks with the integratable nodes",
    "abstract": "This paper is a study of an application-based model in profit-maximizing multi-vehicle pickup and delivery selection problem (PPDSP). The graph-theoretic model proposed by existing studies of PPDSP is based on transport requests to define the corresponding nodes (i.e., each request corresponds to a pickup node and a delivery node). In practice, however, there are probably multiple requests coming from or going to an identical location. Considering the road networks with the integratable nodes as above, we define a new model based on the integrated nodes for the corresponding PPDSP and propose a novel mixed-integer formulation. In comparative experiments with the existing formulation, as the number of integratable nodes increases, our method has a clear advantage in terms of the number of variables as well as the number of constraints required in the generated instances, and the accuracy of the optimized solution obtained within a given time. ",
    "url": "https://arxiv.org/abs/2208.14866",
    "authors": [
      "Aolong Zha",
      "Qiong Chang",
      "Naoto Imura",
      "Katsuhiro Nishinari"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2208.14867",
    "title": "Sketching the Expression: Flexible Rendering of Expressive Piano  Performance with Self-Supervised Learning",
    "abstract": "We propose a system for rendering a symbolic piano performance with flexible musical expression. It is necessary to actively control musical expression for creating a new music performance that conveys various emotions or nuances. However, previous approaches were limited to following the composer's guidelines of musical expression or dealing with only a part of the musical attributes. We aim to disentangle the entire musical expression and structural attribute of piano performance using a conditional VAE framework. It stochastically generates expressive parameters from latent representations and given note structures. In addition, we employ self-supervised approaches that force the latent variables to represent target attributes. Finally, we leverage a two-step encoder and decoder that learn hierarchical dependency to enhance the naturalness of the output. Experimental results show that our system can stably generate performance parameters relevant to the given musical scores, learn disentangled representations, and control musical attributes independently of each other. ",
    "url": "https://arxiv.org/abs/2208.14867",
    "authors": [
      "Seungyeon Rhyu",
      "Sarah Kim",
      "Kyogu Lee"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2208.14878",
    "title": "Formalising the Robustness of Counterfactual Explanations for Neural  Networks",
    "abstract": "The use of counterfactual explanations (CFXs) is an increasingly popular explanation strategy for machine learning models. However, recent studies have shown that these explanations may not be robust to changes in the underlying model (e.g., following retraining), which raises questions about their reliability in real-world applications. Existing attempts towards solving this problem are heuristic, and the robustness to model changes of the resulting CFXs is evaluated with only a small number of retrained models, failing to provide exhaustive guarantees. To remedy this, we propose the first notion to formally and deterministically assess the robustness (to model changes) of CFXs for neural networks, that we call {\\Delta}-robustness. We introduce an abstraction framework based on interval neural networks to verify the {\\Delta}-robustness of CFXs against a possibly infinite set of changes to the model parameters, i.e., weights and biases. We then demonstrate the utility of this approach in two distinct ways. First, we analyse the {\\Delta}-robustness of a number of CFX generation methods from the literature and show that they unanimously host significant deficiencies in this regard. Second, we demonstrate how embedding {\\Delta}-robustness within existing methods can provide CFXs which are provably robust. ",
    "url": "https://arxiv.org/abs/2208.14878",
    "authors": [
      "Junqi Jiang",
      "Francesco Leofante",
      "Antonio Rago",
      "Francesca Toni"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.14883",
    "title": "Binary Representation via Jointly Personalized Sparse Hashing",
    "abstract": "Unsupervised hashing has attracted much attention for binary representation learning due to the requirement of economical storage and efficiency of binary codes. It aims to encode high-dimensional features in the Hamming space with similarity preservation between instances. However, most existing methods learn hash functions in manifold-based approaches. Those methods capture the local geometric structures (i.e., pairwise relationships) of data, and lack satisfactory performance in dealing with real-world scenarios that produce similar features (e.g. color and shape) with different semantic information. To address this challenge, in this work, we propose an effective unsupervised method, namely Jointly Personalized Sparse Hashing (JPSH), for binary representation learning. To be specific, firstly, we propose a novel personalized hashing module, i.e., Personalized Sparse Hashing (PSH). Different personalized subspaces are constructed to reflect category-specific attributes for different clusters, adaptively mapping instances within the same cluster to the same Hamming space. In addition, we deploy sparse constraints for different personalized subspaces to select important features. We also collect the strengths of the other clusters to build the PSH module with avoiding over-fitting. Then, to simultaneously preserve semantic and pairwise similarities in our JPSH, we incorporate the PSH and manifold-based hash learning into the seamless formulation. As such, JPSH not only distinguishes the instances from different clusters, but also preserves local neighborhood structures within the cluster. Finally, an alternating optimization algorithm is adopted to iteratively capture analytical solutions of the JPSH model. Extensive experiments on four benchmark datasets verify that the JPSH outperforms several hashing algorithms on the similarity search task. ",
    "url": "https://arxiv.org/abs/2208.14883",
    "authors": [
      "Xiaoqin Wang",
      "Chen Chen",
      "Rushi Lan",
      "Licheng Liu",
      "Zhenbing Liu",
      "Huiyu Zhou",
      "Xiaonan Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.14884",
    "title": "GRILLBot: An Assistant for Real-World Tasks with Neural Semantic Parsing  and Graph-Based Representations",
    "abstract": "GRILLBot is the winning system in the 2022 Alexa Prize TaskBot Challenge, moving towards the next generation of multimodal task assistants. It is a voice assistant to guide users through complex real-world tasks in the domains of cooking and home improvement. These are long-running and complex tasks that require flexible adjustment and adaptation. The demo highlights the core aspects, including a novel Neural Decision Parser for contextualized semantic parsing, a new \"TaskGraph\" state representation that supports conditional execution, knowledge-grounded chit-chat, and automatic enrichment of tasks with images and videos. ",
    "url": "https://arxiv.org/abs/2208.14884",
    "authors": [
      "Carlos Gemmell",
      "Iain Mackie",
      "Paul Owoicho",
      "Federico Rossetto",
      "Sophie Fischer",
      "Jeffrey Dalton"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.14885",
    "title": "OSC Community Lab: The Integration Test Bed for O-RAN Software Community",
    "abstract": "O-RAN Software Community (OSC) is an open-source project collaborated by O-RAN Alliance and Linux Foundation, aiming to develop reference software components based on 3GPP and O-RAN Alliance specifications. The OSC has twelve projects. Among them, the Integration and Testing (INT) project is responsible for testing the requirements documented in each release for end-to-end and use case testing. Three OSC Community Laboratories were built to speed up the integration and interoperability testing among different projects. This paper summarizes the software components developed by OSC projects and the status of the three OSC Community Laboratories. The activities of each laboratory, how the community collaborates, and the challenges we encountered along the way were elaborated. ",
    "url": "https://arxiv.org/abs/2208.14885",
    "authors": [
      "Fransiscus Asisi Bimo",
      "Ferlinda Feliana",
      "Shu-Hua Liao",
      "Chih-Wei Lin",
      "David F. Kinsey",
      "James Li",
      "Rittwik Jana",
      "Richard Wright",
      "Ray-Guang Cheng"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2208.14919",
    "title": "ARMA Cell: A Modular and Effective Approach for Neural Autoregressive  Modeling",
    "abstract": "The autoregressive moving average (ARMA) model is a classical, and arguably one of the most studied approaches to model time series data. It has compelling theoretical properties and is widely used among practitioners. More recent deep learning approaches popularize recurrent neural networks (RNNs) and, in particular, long short-term memory (LSTM) cells that have become one of the best performing and most common building blocks in neural time series modeling. While advantageous for time series data or sequences with long-term effects, complex RNN cells are not always a must and can sometimes even be inferior to simpler recurrent approaches. In this work, we introduce the ARMA cell, a simpler, modular, and effective approach for time series modeling in neural networks. This cell can be used in any neural network architecture where recurrent structures are present and naturally handles multivariate time series using vector autoregression. We also introduce the ConvARMA cell as a natural successor for spatially-correlated time series. Our experiments show that the proposed methodology is competitive with popular alternatives in terms of performance while being more robust and compelling due to its simplicity. ",
    "url": "https://arxiv.org/abs/2208.14919",
    "authors": [
      "Philipp Schiele",
      "Christoph Berninger",
      "David Rügamer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.14923",
    "title": "Few-Shot Learning for Clinical Natural Language Processing Using Siamese  Neural Networks",
    "abstract": "Clinical Natural Language Processing (NLP) has become an emerging technology in healthcare that leverages a large amount of free-text data in electronic health records (EHRs) to improve patient care, support clinical decisions, and facilitate clinical and translational science research. Deep learning has achieved state-of-the-art performance in many clinical NLP tasks. However, training deep learning models usually require large annotated datasets, which are normally not publicly available and can be time-consuming to build in clinical domains. Working with smaller annotated datasets is typical in clinical NLP and therefore, ensuring that deep learning models perform well is crucial for the models to be used in real-world applications. A widely adopted approach is fine-tuning existing Pre-trained Language Models (PLMs), but these attempts fall short when the training dataset contains only a few annotated samples. Few-Shot Learning (FSL) has recently been investigated to tackle this problem. Siamese Neural Network (SNN) has been widely utilized as an FSL approach in computer vision, but has not been studied well in NLP. Furthermore, the literature on its applications in clinical domains is scarce. In this paper, we propose two SNN-based FSL approaches for clinical NLP, including pre-trained SNN (PT-SNN) and SNN with second-order embeddings (SOE-SNN). We evaluated the proposed approaches on two clinical tasks, namely clinical text classification and clinical named entity recognition. We tested three few-shot settings including 4-shot, 8-shot, and 16-shot learning. Both clinical NLP tasks were benchmarked using three PLMs, including BERT, BioBERT, and BioClinicalBERT. The experimental results verified the effectiveness of the proposed SNN-based FSL approaches in both clinical NLP tasks. ",
    "url": "https://arxiv.org/abs/2208.14923",
    "authors": [
      "David Oniani",
      "Sonish Sivarajkumar",
      "Yanshan Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2208.14933",
    "title": "Membership Inference Attacks by Exploiting Loss Trajectory",
    "abstract": "Machine learning models are vulnerable to membership inference attacks in which an adversary aims to predict whether or not a particular sample was contained in the target model's training dataset. Existing attack methods have commonly exploited the output information (mostly, losses) solely from the given target model. As a result, in practical scenarios where both the member and non-member samples yield similarly small losses, these methods are naturally unable to differentiate between them. To address this limitation, in this paper, we propose a new attack method, called \\system, which can exploit the membership information from the whole training process of the target model for improving the attack performance. To mount the attack in the common black-box setting, we leverage knowledge distillation, and represent the membership information by the losses evaluated on a sequence of intermediate models at different distillation epochs, namely \\emph{distilled loss trajectory}, together with the loss from the given target model. Experimental results over different datasets and model architectures demonstrate the great advantage of our attack in terms of different metrics. For example, on CINIC-10, our attack achieves at least 6$\\times$ higher true-positive rate at a low false-positive rate of 0.1\\% than existing methods. Further analysis demonstrates the general effectiveness of our attack in more strict scenarios. ",
    "url": "https://arxiv.org/abs/2208.14933",
    "authors": [
      "Yiyong Liu",
      "Zhengyu Zhao",
      "Michael Backes",
      "Yang Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.14935",
    "title": "HyTGraph: GPU-Accelerated Graph Processing with Hybrid Transfer  Management",
    "abstract": "Processing large graphs with memory-limited GPU needs to resolve issues of host-GPU data transfer, which is a key performance bottleneck. Existing GPU-accelerated graph processing frameworks reduce the data transfers by managing the active subgraph transfer at runtime. Some frameworks adopt explicit transfer management approaches based on explicit memory copy with filter or compaction. In contrast, others adopt implicit transfer management approaches based on on-demand access with zero-copy or unified-memory. Having made intensive analysis, we find that as the active vertices evolve, the performance of the two approaches varies in different workloads. Due to heavy redundant data transfers, high CPU compaction overhead, or low bandwidth utilization, adopting a single approach often results in suboptimal performance. In this work, we propose a hybrid transfer management approach to take the merits of both the two approaches at runtime, with an objective to achieve the shortest execution time in each iteration. Based on the hybrid approach, we present HytGraph, a GPU-accelerated graph processing framework, which is empowered by a set of effective task scheduling optimizations to improve the performance. Our experimental results on real-world and synthesized graphs demonstrate that HyTGraph achieves up to 10.27X speedup over existing GPU-accelerated graph processing systems including Grus, Subway, and EMOGI. ",
    "url": "https://arxiv.org/abs/2208.14935",
    "authors": [
      "Qiange Wang",
      "Xin Ai",
      "Yanfeng Zhang",
      "Jing Chen",
      "Ge Yu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2208.14964",
    "title": "Deep-Learning-Based Device Fingerprinting for Increased LoRa-IoT  Security: Sensitivity to Network Deployment Changes",
    "abstract": "Deep-learning-based device fingerprinting has recently been recognized as a key enabler for automated network access authentication. Its robustness to impersonation attacks due to the inherent difficulty of replicating physical features is what distinguishes it from conventional cryptographic solutions. Although device fingerprinting has shown promising performances, its sensitivity to changes in the network operating environment still poses a major limitation. This paper presents an experimental framework that aims to study and overcome the sensitivity of LoRa-enabled device fingerprinting to such changes. We first begin by describing RF datasets we collected using our LoRa-enabled wireless device testbed. We then propose a new fingerprinting technique that exploits out-of-band distortion information caused by hardware impairments to increase the fingerprinting accuracy. Finally, we experimentally study and analyze the sensitivity of LoRa RF fingerprinting to various network setting changes. Our results show that fingerprinting does relatively well when the learning models are trained and tested under the same settings. However, when trained and tested under different settings, these models exhibit moderate sensitivity to channel condition changes and severe sensitivity to protocol configuration and receiver hardware changes when IQ data is used as input. However, with FFT data is used as input, they perform poorly under any change. ",
    "url": "https://arxiv.org/abs/2208.14964",
    "authors": [
      "Bechir Hamdaoui",
      "Abdurrahman Elmaghbub"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2208.14971",
    "title": "Zero-day DDoS Attack Detection",
    "abstract": "The ability to detect zero-day (novel) attacks has become essential in the network security industry. Due to ever evolving attack signatures, existing network intrusion detection systems often fail to detect these threats. This project aims to solve the task of detecting zero-day DDoS (distributed denial-of-service) attacks by utilizing network traffic that is captured before entering a private network. Modern feature extraction techniques are used in conjunction with neural networks to determine if a network packet is either benign or malicious. ",
    "url": "https://arxiv.org/abs/2208.14971",
    "authors": [
      "Cameron Boeder",
      "Troy Januchowski"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2208.14989",
    "title": "Multiscale Non-stationary Causal Structure Learning from Time Series  Data",
    "abstract": "This paper introduces a new type of causal structure, namely multiscale non-stationary directed acyclic graph (MN-DAG), that generalizes DAGs to the time-frequency domain. Our contribution is twofold. First, by leveraging results from spectral and causality theories, we expose a novel probabilistic generative model, which allows to sample an MN-DAG according to user-specified priors concerning the time-dependence and multiscale properties of the causal graph. Second, we devise a Bayesian method for the estimation of MN-DAGs, by means of stochastic variational inference (SVI), called Multiscale Non-Stationary Causal Structure Learner (MN-CASTLE). In addition to direct observations, MN-CASTLE exploits information from the decomposition of the total power spectrum of time series over different time resolutions. In our experiments, we first use the proposed model to generate synthetic data according to a latent MN-DAG, showing that the data generated reproduces well-known features of time series in different domains. Then we compare our learning method MN-CASTLE against baseline models on synthetic data generated with different multiscale and non-stationary settings, confirming the good performance of MN-CASTLE. Finally, we show some insights derived from the application of MN-CASTLE to study the causal structure of 7 global equity markets during the Covid-19 pandemic. ",
    "url": "https://arxiv.org/abs/2208.14989",
    "authors": [
      "Gabriele D'Acunto",
      "Gianmarco De Francisci Morales",
      "Paolo Bajardi",
      "Francesco Bonchi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.14533",
    "title": "Lesion-Specific Prediction with Discriminator-Based Supervised Guided  Attention Module Enabled GANs in Multiple Sclerosis",
    "abstract": "Multiple Sclerosis (MS) is a chronic neurological condition characterized by the development of lesions in the white matter of the brain. T2-fluid attenuated inversion recovery (FLAIR) brain magnetic resonance imaging (MRI) provides superior visualization and characterization of MS lesions, relative to other MRI modalities. Follow-up brain FLAIR MRI in MS provides helpful information for clinicians towards monitoring disease progression. In this study, we propose a novel modification to generative adversarial networks (GANs) to predict future lesion-specific FLAIR MRI for MS at fixed time intervals. We use supervised guided attention and dilated convolutions in the discriminator, which supports making an informed prediction of whether the generated images are real or not based on attention to the lesion area, which in turn has potential to help improve the generator to predict the lesion area of future examinations more accurately. We compared our method to several baselines and one state-of-art CF-SAGAN model [1]. In conclusion, our results indicate that the proposed method achieves higher accuracy and reduces the standard deviation of the prediction errors in the lesion area compared with other models with similar overall performance. ",
    "url": "https://arxiv.org/abs/2208.14533",
    "authors": [
      "Jueqi Wang",
      "Derek Berger",
      "Erin Mazerolle",
      "Jean-Alexis Delamer",
      "Jacob Levman"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.14540",
    "title": "Embedding Functional Data: Multidimensional Scaling and Manifold  Learning",
    "abstract": "We adapt concepts, methodology, and theory originally developed in the areas of multidimensional scaling and dimensionality reduction for multivariate data to the functional setting. We focus on classical scaling and Isomap -- prototypical methods that have played important roles in these area -- and showcase their use in the context of functional data analysis. In the process, we highlight the crucial role that the ambient metric plays. ",
    "url": "https://arxiv.org/abs/2208.14540",
    "authors": [
      "Ery Arias-Castro",
      "Wanli Qiao"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Machine Learning (cs.LG)",
      "Metric Geometry (math.MG)"
    ]
  },
  {
    "id": "arXiv:2208.14635",
    "title": "Segmentation-guided Domain Adaptation and Data Harmonization of  Multi-device Retinal Optical Coherence Tomography using Cycle-Consistent  Generative Adversarial Networks",
    "abstract": "Optical Coherence Tomography(OCT) is a non-invasive technique capturing cross-sectional area of the retina in micro-meter resolutions. It has been widely used as a auxiliary imaging reference to detect eye-related pathology and predict longitudinal progression of the disease characteristics. Retina layer segmentation is one of the crucial feature extraction techniques, where the variations of retinal layer thicknesses and the retinal layer deformation due to the presence of the fluid are highly correlated with multiple epidemic eye diseases like Diabetic Retinopathy(DR) and Age-related Macular Degeneration (AMD). However, these images are acquired from different devices, which have different intensity distribution, or in other words, belong to different imaging domains. This paper proposes a segmentation-guided domain-adaptation method to adapt images from multiple devices into single image domain, where the state-of-art pre-trained segmentation model is available. It avoids the time consumption of manual labelling for the upcoming new dataset and the re-training of the existing network. The semantic consistency and global feature consistency of the network will minimize the hallucination effect that many researchers reported regarding Cycle-Consistent Generative Adversarial Networks(CycleGAN) architecture. ",
    "url": "https://arxiv.org/abs/2208.14635",
    "authors": [
      "Shuo Chen",
      "Da Ma",
      "Sieun Lee",
      "Timothy T.L. Yu",
      "Gavin Xu",
      "Donghuan Lu",
      "Karteek Popuri",
      "Myeong Jin Ju",
      "Marinko V. Sarunic",
      "Mirza Faisal Beg"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.14655",
    "title": "XCAT -- Lightweight Quantized Single Image Super-Resolution using  Heterogeneous Group Convolutions and Cross Concatenation",
    "abstract": "We propose a lightweight, single image super-resolution network for mobile devices, named XCAT. XCAT introduces Heterogeneous Group Convolution Blocks with Cross Concatenations (HXBlock). The heterogeneous split of the input channels to the group convolution blocks reduces the number of operations, and cross concatenation allows for information flow between the intermediate input tensors of cascaded HXBlocks. Cross concatenations inside HXBlocks can also avoid using more expensive operations like 1x1 convolutions. To further prev ent expensive tensor copy operations, XCAT utilizes non-trainable convolution kernels to apply up sampling operations. Designed with integer quantization in mind, XCAT also utilizes several techniques on training, like intensity-based data augmentation. Integer quantized XCAT operates in real time on Mali-G71 MP2 GPU with 320ms, and on Synaptics Dolphin NPU with 30ms (NCHW) and 8.8ms (NHWC), suitable for real-time applications. ",
    "url": "https://arxiv.org/abs/2208.14655",
    "authors": [
      "Mustafa Ayazoglu",
      "Bahri Batuhan Bilecen"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.14708",
    "title": "Classical-to-quantum convolutional neural network transfer learning",
    "abstract": "Machine learning using quantum convolutional neural networks (QCNNs) has demonstrated success in both quantum and classical data classification. In previous studies, QCNNs attained a higher classification accuracy than their classical counterparts under the same training conditions in the few-parameter regime. However, the general performance of large-scale quantum models is difficult to examine because of the limited size of quantum circuits, which can be reliably implemented in the near future. We propose transfer learning as an effective strategy for utilizing small QCNNs in the noisy intermediate-scale quantum era to the full extent. In the classical-to-quantum transfer learning framework, a QCNN can solve complex classification problems without requiring a large-scale quantum circuit by utilizing a pre-trained classical convolutional neural network (CNN). We perform numerical simulations of QCNN models with various sets of quantum convolution and pooling operations for MNIST data classification under transfer learning, in which a classical CNN is trained with Fashion-MNIST data. The results show that transfer learning from classical to quantum CNN performs considerably better than purely classical transfer learning models under similar training conditions. ",
    "url": "https://arxiv.org/abs/2208.14708",
    "authors": [
      "Juhyeon Kim",
      "Joonsuk Huh",
      "Daniel K. Park"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.14742",
    "title": "Enhancing Early Lung Cancer Detection on Chest Radiographs with  AI-assistance: A Multi-Reader Study",
    "abstract": "Objectives: The present study evaluated the impact of a commercially available explainable AI algorithm in augmenting the ability of clinicians to identify lung cancer on chest X-rays (CXR). Design: This retrospective study evaluated the performance of 11 clinicians for detecting lung cancer from chest radiographs, with and without assistance from a commercially available AI algorithm (red dot, Behold.ai) that predicts suspected lung cancer from CXRs. Clinician performance was evaluated against clinically confirmed diagnoses. Setting: The study analysed anonymised patient data from an NHS hospital; the dataset consisted of 400 chest radiographs from adult patients (18 years and above) who had a CXR performed in 2020, with corresponding clinical text reports. Participants: A panel of readers consisting of 11 clinicians (consultant radiologists, radiologist trainees and reporting radiographers) participated in this study. Main outcome measures: Overall accuracy, sensitivity, specificity and precision for detecting lung cancer on CXRs by clinicians, with and without AI input. Agreement rates between clinicians and performance standard deviation were also evaluated, with and without AI input. Results: The use of the AI algorithm by clinicians led to an improved overall performance for lung tumour detection, achieving an overall increase of 17.4% of lung cancers being identified on CXRs which would have otherwise been missed, an overall increase in detection of smaller tumours, a 24% and 13% increased detection of stage 1 and stage 2 lung cancers respectively, and standardisation of clinician performance. Conclusions: This study showed great promise in the clinical utility of AI algorithms in improving early lung cancer diagnosis and promoting health equity through overall improvement in reader performances, without impacting downstream imaging resources. ",
    "url": "https://arxiv.org/abs/2208.14742",
    "authors": [
      "Gaetan Dissez",
      "Nicole Tay",
      "Tom Dyer",
      "Matthew Tam",
      "Richard Dittrich",
      "David Doyne",
      "James Hoare",
      "Jackson J. Pat",
      "Stephanie Patterson",
      "Amanda Stockham",
      "Qaiser Malik",
      "Tom Naunton Morgan",
      "Paul Williams",
      "Liliana Garcia-Mondragon",
      "Jordan Smith",
      "George Pearse",
      "Simon Rasalingham"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.14784",
    "title": "Accelerating Deep Unrolling Networks via Dimensionality Reduction",
    "abstract": "In this work we propose a new paradigm for designing efficient deep unrolling networks using dimensionality reduction schemes, including minibatch gradient approximation and operator sketching. The deep unrolling networks are currently the state-of-the-art solutions for imaging inverse problems. However, for high-dimensional imaging tasks, especially X-ray CT and MRI imaging, the deep unrolling schemes typically become inefficient both in terms of memory and computation, due to the need of computing multiple times the high-dimensional forward and adjoint operators. Recently researchers have found that such limitations can be partially addressed by unrolling the stochastic gradient descent (SGD), inspired by the success of stochastic first-order optimization. In this work, we explore further this direction and propose first a more expressive and practical stochastic primal-dual unrolling, based on the state-of-the-art Learned Primal-Dual (LPD) network, and also a further acceleration upon stochastic primal-dual unrolling, using sketching techniques to approximate products in the high-dimensional image space. The operator sketching can be jointly applied with stochastic unrolling for the best acceleration and compression performance. Our numerical experiments on X-ray CT image reconstruction demonstrate the remarkable effectiveness of our accelerated unrolling schemes. ",
    "url": "https://arxiv.org/abs/2208.14784",
    "authors": [
      "Junqi Tang",
      "Subhadip Mukherjee",
      "Carola-Bibiane Schönlieb"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2208.14899",
    "title": "Generalizing Körner's graph entropy to graphons",
    "abstract": "K\\\"orner introduced the notion of graph entropy in 1973 as the minimal code rate of a natural coding problem where not all pairs of letters can be distinguished in the alphabet. Later it turned out that it can be expressed as the solution of a minimization problem over the so-called vertex-packing polytope. In this paper we generalize this notion to graphons. We show that the analogous minimization problem provides an upper bound for graphon entropy. We also give a lower bound in the shape of a maximization problem. The main result of the paper is that for most graphons these two bounds actually coincide and hence precisely determine the entropy in question. Furthermore, graphon entropy has a nice connection to the fractional chromatic number and the fractional clique number (defined for graphons by Hladk\\'y and Rocha). ",
    "url": "https://arxiv.org/abs/2208.14899",
    "authors": [
      "Viktor Harangi",
      "Xueyan Niu",
      "Bo Bai"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2009.09672",
    "title": "Alleviating the Inequality of Attention Heads for Neural Machine  Translation",
    "abstract": " Comments: Accepted by COLING 2022 ",
    "url": "https://arxiv.org/abs/2009.09672",
    "authors": [
      "Zewei Sun",
      "Shujian Huang",
      "Xin-Yu Dai",
      "Jiajun Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2012.12215",
    "title": "Robust Kernel-based Feature Representation for 3D Point Cloud Analysis  via Circular Convolutional Network",
    "abstract": " Comments: 12 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2012.12215",
    "authors": [
      "Seunghwan Jung",
      "Yeong-Gil Shin",
      "Minyoung Chung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2102.02111",
    "title": "Introduction to Neural Transfer Learning with Transformers for Social  Science Text Analysis",
    "abstract": " Comments: 80 pages, 12 figures; changed the title; more focused presentation of contents; moved contents to the appendix; created a new Figure 9; discussion of additional aspects (zero-shot learning, cross-lingual learning, interpretability, foundation models); removed old Figures 4 and 5; made non-essential changes to Figures 1, 2, 4, 6, 7, 8 and 10; changed notation. The original results are unchanged ",
    "url": "https://arxiv.org/abs/2102.02111",
    "authors": [
      "Sandra Wankmüller"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2106.08748",
    "title": "Input Invex Neural Network",
    "abstract": " Comments: 40 pages, 22 figures ",
    "url": "https://arxiv.org/abs/2106.08748",
    "authors": [
      "Suman Sapkota",
      "Binod Bhattarai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2108.03818",
    "title": "Time-Frequency Localization Using Deep Convolutional Maxout Neural  Network in Persian Speech Recognition",
    "abstract": " Title: Time-Frequency Localization Using Deep Convolutional Maxout Neural  Network in Persian Speech Recognition ",
    "url": "https://arxiv.org/abs/2108.03818",
    "authors": [
      "Arash Dehghani",
      "Seyyed Ali Seyyedsalehi"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2109.05710",
    "title": "Robust Stability of Neural Network-controlled Nonlinear Systems with  Parametric Variability",
    "abstract": " Comments: 12 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2109.05710",
    "authors": [
      "Soumyabrata Talukder",
      "Ratnesh Kumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2109.12843",
    "title": "A Survey of Graph Neural Networks for Recommender Systems: Challenges,  Methods, and Directions",
    "abstract": " Comments: accepted by ACM Transactions on Recommender Systems ",
    "url": "https://arxiv.org/abs/2109.12843",
    "authors": [
      "Chen Gao",
      "Yu Zheng",
      "Nian Li",
      "Yinfeng Li",
      "Yingrong Qin",
      "Jinghua Piao",
      "Yuhan Quan",
      "Jianxin Chang",
      "Depeng Jin",
      "Xiangnan He",
      "Yong Li"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2112.13003",
    "title": "Continuous Spectral Reconstruction from RGB Images via Implicit Neural  Representation",
    "abstract": " Comments: Accepted to ECCV Workshop 2022 ",
    "url": "https://arxiv.org/abs/2112.13003",
    "authors": [
      "Ruikang Xu",
      "Mingde Yao",
      "Chang Chen",
      "Lizhi Wang",
      "Zhiwei Xiong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.12611",
    "title": "Learning Stochastic Graph Neural Networks with Constrained Variance",
    "abstract": " Title: Learning Stochastic Graph Neural Networks with Constrained Variance ",
    "url": "https://arxiv.org/abs/2201.12611",
    "authors": [
      "Zhan Gao",
      "Elvin Isufi"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.13170",
    "title": "Cooperative Online Learning in Stochastic and Adversarial MDPs",
    "abstract": " Title: Cooperative Online Learning in Stochastic and Adversarial MDPs ",
    "url": "https://arxiv.org/abs/2201.13170",
    "authors": [
      "Tal Lancewicki",
      "Aviv Rosenberg",
      "Yishay Mansour"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.00804",
    "title": "Automatic event detection in football using tracking data",
    "abstract": " Comments: 21 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2202.00804",
    "authors": [
      "Ferran Vidal-Codina",
      "Nicolas Evans",
      "Bahaeddine El Fakir",
      "Johsan Billingham"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04719",
    "title": "Multivariate Analysis for Multiple Network Data via Semi-Symmetric  Tensor PCA",
    "abstract": " Title: Multivariate Analysis for Multiple Network Data via Semi-Symmetric  Tensor PCA ",
    "url": "https://arxiv.org/abs/2202.04719",
    "authors": [
      "Michael Weylandt",
      "George Michailidis"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2203.04007",
    "title": "DuMLP-Pin: A Dual-MLP-dot-product Permutation-invariant Network for Set  Feature Extraction",
    "abstract": " Comments: 16 pages, accepted by AAAI 2022 (this https URL), with technical appendix ",
    "url": "https://arxiv.org/abs/2203.04007",
    "authors": [
      "Jiajun Fei",
      "Ziyu Zhu",
      "Wenlei Liu",
      "Zhidong Deng",
      "Mingyang Li",
      "Huanjun Deng",
      "Shuo Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.05947",
    "title": "Hybrid Artifact Detection System for Minute Resolution Blood Pressure  Signals from ICU",
    "abstract": " Title: Hybrid Artifact Detection System for Minute Resolution Blood Pressure  Signals from ICU ",
    "url": "https://arxiv.org/abs/2203.05947",
    "authors": [
      "Hollan Haule",
      "Evangelos Kafantaris",
      "Tsz-Yan Milly Lo",
      "Chen Qin",
      "Javier Escudero"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.08893",
    "title": "Multimodal Learning on Graphs for Disease Relation Extraction",
    "abstract": " Title: Multimodal Learning on Graphs for Disease Relation Extraction ",
    "url": "https://arxiv.org/abs/2203.08893",
    "authors": [
      "Yucong Lin",
      "Keming Lu",
      "Sheng Yu",
      "Tianxi Cai",
      "Marinka Zitnik"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2203.11091",
    "title": "GCNET: graph-based prediction of stock price movement using graph  convolutional network",
    "abstract": " Title: GCNET: graph-based prediction of stock price movement using graph  convolutional network ",
    "url": "https://arxiv.org/abs/2203.11091",
    "authors": [
      "Alireza Jafari",
      "Saman Haratizadeh"
    ],
    "subjectives": [
      "Trading and Market Microstructure (q-fin.TR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16460",
    "title": "Ordered community detection in directed networks",
    "abstract": " Comments: 20 pages, 8 figures, 1 table ",
    "url": "https://arxiv.org/abs/2203.16460",
    "authors": [
      "Tiago P. Peixoto"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Physics and Society (physics.soc-ph)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2204.03305",
    "title": "MBI-Net: A Non-Intrusive Multi-Branched Speech Intelligibility  Prediction Model for Hearing Aids",
    "abstract": " Comments: Accepted to Interspeech 2022 ",
    "url": "https://arxiv.org/abs/2204.03305",
    "authors": [
      "Ryandhimas E. Zezario",
      "Fei Chen",
      "Chiou-Shann Fuh",
      "Hsin-Min Wang",
      "Yu Tsao"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.03310",
    "title": "MTI-Net: A Multi-Target Speech Intelligibility Prediction Model",
    "abstract": " Comments: Accepted to Interspeech 2022 ",
    "url": "https://arxiv.org/abs/2204.03310",
    "authors": [
      "Ryandhimas E. Zezario",
      "Szu-wei Fu",
      "Fei Chen",
      "Chiou-Shann Fuh",
      "Hsin-Min Wang",
      "Yu Tsao"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.10243",
    "title": "Heterogeneous rarity patterns drive price dynamics in NFT collections",
    "abstract": " Title: Heterogeneous rarity patterns drive price dynamics in NFT collections ",
    "url": "https://arxiv.org/abs/2204.10243",
    "authors": [
      "Amin Mekacher",
      "Alberto Bracci",
      "Matthieu Nadini",
      "Mauro Martino",
      "Laura Alessandretti",
      "Luca Maria Aiello",
      "Andrea Baronchelli"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Computers and Society (cs.CY)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2204.10494",
    "title": "Lengths of Cycles in Generalized Pancake Graphs",
    "abstract": " Comments: Added Lemma 4.1, corrected the girth results of Section 4 reporting the girth of $\\mathbb{P}_m(n)$, with $m\\geq3,n\\geq2$ as $\\min\\{m,6\\}$ from what was originally reported in error as $\\min\\{m,8\\}$, and fixed typos ",
    "url": "https://arxiv.org/abs/2204.10494",
    "authors": [
      "Saúl A. Blanco",
      "Charles Buehrle"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2205.08689",
    "title": "Spatial-Temporal Interactive Dynamic Graph Convolution Network for  Traffic Forecasting",
    "abstract": " Title: Spatial-Temporal Interactive Dynamic Graph Convolution Network for  Traffic Forecasting ",
    "url": "https://arxiv.org/abs/2205.08689",
    "authors": [
      "Aoyu Liu",
      "Yaying Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.14684",
    "title": "Smoothed Analysis of Social Choice Revisited",
    "abstract": " Title: Smoothed Analysis of Social Choice Revisited ",
    "url": "https://arxiv.org/abs/2206.14684",
    "authors": [
      "Bailey Flanigan",
      "Daniel Halpern",
      "Alexandros Psomas"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2207.00997",
    "title": "Dynamic boxes fusion strategy in object detection",
    "abstract": " Comments: Inconsistent data ",
    "url": "https://arxiv.org/abs/2207.00997",
    "authors": [
      "Zhijiang Wan",
      "Shichang Liu",
      "Manyu Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.07774",
    "title": "BDPC: Controlling Application Delay in 6TiSCH networks for the  Industrial Internet of Things",
    "abstract": " Comments: This work has been submitted to Elsevier for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2207.07774",
    "authors": [
      "Lucas Aimaretto",
      "Diego Dujovne"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2207.12850",
    "title": "Towards Smart City Security: Violence and Weaponized Violence Detection  using DCNN",
    "abstract": " Comments: - 7 pages (3 figures, 3 tables, 6 equations) - Submitted to the IEEE International Conference on Tools with Artificial Intelligence (ICTAI) ",
    "url": "https://arxiv.org/abs/2207.12850",
    "authors": [
      "Toluwani Aremu",
      "Li Zhiyuan",
      "Reem Alameeri",
      "Moayad Aloqaily",
      "Mohsen Guizani"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.03526",
    "title": "Multiplex-detection Based Multiple Instance Learning Network for Whole  Slide Image Classification",
    "abstract": " Title: Multiplex-detection Based Multiple Instance Learning Network for Whole  Slide Image Classification ",
    "url": "https://arxiv.org/abs/2208.03526",
    "authors": [
      "Zhikang Wang",
      "Yue Bi",
      "Tong Pan",
      "Xiaoyu Wang",
      "Chris Bain",
      "Richard Bassed",
      "Seiya Imoto",
      "Jianhua Yao",
      "Jiangning Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.12539",
    "title": "Task-specific Pre-training and Prompt Decomposition for Knowledge Graph  Population with Language Models",
    "abstract": " Comments: To appear in ISWC 2022 ",
    "url": "https://arxiv.org/abs/2208.12539",
    "authors": [
      "Tianyi Li",
      "Wenyu Huang",
      "Nikos Papasarantopoulos",
      "Pavlos Vougiouklis",
      "Jeff Z. Pan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2208.13701",
    "title": "Empirical Gateaux Derivatives for Causal Inference",
    "abstract": " Comments: Comments welcome ",
    "url": "https://arxiv.org/abs/2208.13701",
    "authors": [
      "Michael I. Jordan",
      "Yixin Wang",
      "Angela Zhou"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.14114",
    "title": "Robust Sound-Guided Image Manipulation",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2112.00007 ",
    "url": "https://arxiv.org/abs/2208.14114",
    "authors": [
      "Seung Hyun Lee",
      "Chanyoung Kim",
      "Wonmin Byeon",
      "Gyeongrok Oh",
      "Jooyoung Lee",
      "Sang Ho Yoon",
      "Jinkyu Kim",
      "Sangpil Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.14142",
    "title": "Unit-length Rectangular Drawings of Graphs",
    "abstract": " Comments: Appears in the Proceedings of the 30th International Symposium on Graph Drawing and Network Visualization (GD 2022) ",
    "url": "https://arxiv.org/abs/2208.14142",
    "authors": [
      "Carlos Alegria",
      "Giordano Da Lozzo",
      "Giuseppe Di Battista",
      "Fabrizio Frati",
      "Fabrizio Grosso",
      "Maurizio Patrignani"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  }
]