[
  {
    "id": "arXiv:2108.01234",
    "title": "AGAR a microbial colony dataset for deep learning detection",
    "abstract": "The Annotated Germs for Automated Recognition (AGAR) dataset is an image database of microbial colonies cultured on agar plates. It contains 18000 photos of five different microorganisms as single or mixed cultures, taken under diverse lighting conditions with two different cameras. All the images are classified into \"countable\", \"uncountable\", and \"empty\", with the \"countable\" class labeled by microbiologists with colony location and species identification (336442 colonies in total). This study describes the dataset itself and the process of its development. In the second part, the performance of selected deep neural network architectures for object detection, namely Faster R-CNN and Cascade R-CNN, was evaluated on the AGAR dataset. The results confirmed the great potential of deep learning methods to automate the process of microbe localization and classification based on Petri dish photos. Moreover, AGAR is the first publicly available dataset of this kind and size and will facilitate the future development of machine learning models. The data used in these studies can be found at https://agar.neurosys.com/. ",
    "url": "https://arxiv.org/abs/2108.01234",
    "authors": [
      "Sylwia Majchrowska",
      "Jarosław Pawłowski",
      "Grzegorz Guła",
      "Tomasz Bonus",
      "Agata Hanas",
      "Adam Loch",
      "Agnieszka Pawlak",
      "Justyna Roszkowiak",
      "Tomasz Golan",
      "Zuzanna Drulis-Kawa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2108.01425",
    "title": "sarcasm detection and quantification in arabic tweets",
    "abstract": "The role of predicting sarcasm in the text is known as automatic sarcasm detection. Given the prevalence and challenges of sarcasm in sentiment-bearing text, this is a critical phase in most sentiment analysis tasks. With the increasing popularity and usage of different social media platforms among users around the world, people are using sarcasm more and more in their day-to-day conversations, social media posts and tweets, and it is considered as a way for people to express their sentiment about some certain topics or issues. As a result of the increasing popularity, researchers started to focus their research endeavors on detecting sarcasm from a text in different languages especially the English language. However, the task of sarcasm detection is a challenging task due to the nature of sarcastic texts; which can be relative and significantly differs from one person to another depending on the topic, region, the user's mentality and other factors. In addition to these challenges, sarcasm detection in the Arabic language has its own challenges due to the complexity of the Arabic language, such as being morphologically rich, with many dialects that significantly vary between each other, while also being lowly resourced. In recent years, only few research attempts started tackling the task of sarcasm detection in Arabic, including creating and collecting corpora, organizing workshops and establishing baseline models. This paper intends to create a new humanly annotated Arabic corpus for sarcasm detection collected from tweets, and implementing a new approach for sarcasm detection and quantification in Arabic tweets. The annotation technique followed in this paper is unique in sarcasm detection and the proposed approach tackles the problem as a regression problem instead of classification; i.e., the model attempts to predict the level of sarcasm instead of binary classification. ",
    "url": "https://arxiv.org/abs/2108.01425",
    "authors": [
      "Bashar Talafha",
      "Muhy Eddin Za'ter",
      "Samer Suleiman",
      "Mahmoud Al-Ayyoub",
      "Mohammed N. Al-Kabi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2108.01554",
    "title": "Sexing Caucasian 2D footprints using convolutional neural networks",
    "abstract": "Footprints are left, or obtained, in a variety of scenarios from crime scenes to anthropological investigations. Determining the sex of a footprint can be useful in screening such impressions and attempts have been made to do so using single or multi landmark distances, shape analyses and via the density of friction ridges. Here we explore the relative importance of different components in sexing two-dimensional foot impressions namely, size, shape and texture. We use a machine learning approach and compare this to more traditional methods of discrimination. Two datasets are used, a pilot data set collected from students at Bournemouth University (N=196) and a larger data set collected by podiatrists at Sheffield NHS Teaching Hospital (N=2677). Our convolutional neural network can sex a footprint with accuracy of around 90% on a test set of N=267 footprint images using all image components, which is better than an expert can achieve. However, the quality of the impressions impacts on this success rate, but the results are promising and in time it may be possible to create an automated screening algorithm in which practitioners of whatever sort (medical or forensic) can obtain a first order sexing of a two-dimensional footprint. ",
    "url": "https://arxiv.org/abs/2108.01554",
    "authors": [
      "Marcin Budka",
      "Matthew R. Bennet",
      "Sally Reynolds",
      "Shelby Barefoot",
      "Sarah Reel",
      "Selina Reidy",
      "Jeremy Walker"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2108.01634",
    "title": "Triggering Failures: Out-Of-Distribution detection by learning from  local adversarial attacks in Semantic Segmentation",
    "abstract": "In this paper, we tackle the detection of out-of-distribution (OOD) objects in semantic segmentation. By analyzing the literature, we found that current methods are either accurate or fast but not both which limits their usability in real world applications. To get the best of both aspects, we propose to mitigate the common shortcomings by following four design principles: decoupling the OOD detection from the segmentation task, observing the entire segmentation network instead of just its output, generating training data for the OOD detector by leveraging blind spots in the segmentation network and focusing the generated data on localized regions in the image to simulate OOD objects. Our main contribution is a new OOD detection architecture called ObsNet associated with a dedicated training scheme based on Local Adversarial Attacks (LAA). We validate the soundness of our approach across numerous ablation studies. We also show it obtains top performances both in speed and accuracy when compared to ten recent methods of the literature on three different datasets. ",
    "url": "https://arxiv.org/abs/2108.01634",
    "authors": [
      "Victor Besnier",
      "Andrei Bursuc",
      "David Picard",
      "Alexandre Briot"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.01210",
    "title": "Representation learning for neural population activity with Neural Data  Transformers",
    "abstract": "Neural population activity is theorized to reflect an underlying dynamical structure. This structure can be accurately captured using state space models with explicit dynamics, such as those based on recurrent neural networks (RNNs). However, using recurrence to explicitly model dynamics necessitates sequential processing of data, slowing real-time applications such as brain-computer interfaces. Here we introduce the Neural Data Transformer (NDT), a non-recurrent alternative. We test the NDT's ability to capture autonomous dynamical systems by applying it to synthetic datasets with known dynamics and data from monkey motor cortex during a reaching task well-modeled by RNNs. The NDT models these datasets as well as state-of-the-art recurrent models. Further, its non-recurrence enables 3.9ms inference, well within the loop time of real-time applications and more than 6 times faster than recurrent baselines on the monkey reaching dataset. These results suggest that an explicit dynamics model is not necessary to model autonomous neural population dynamics. Code: https://github.com/snel-repo/neural-data-transformers ",
    "url": "https://arxiv.org/abs/2108.01210",
    "authors": [
      "Joel Ye",
      "Chethan Pandarinath"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1707.02211",
    "title": "The Stellar decomposition: A compact representation for simplicial  complexes and beyond",
    "abstract": " Title: The Stellar decomposition: A compact representation for simplicial  complexes and beyond ",
    "url": "https://arxiv.org/abs/1707.02211",
    "authors": [
      "Riccardo Fellegara",
      "Kenneth Weiss",
      "Leila De Floriani"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:1909.08511",
    "title": "DP-4-coloring of planar graphs with some restrictions on cycles",
    "abstract": " Comments: 13 pages, 5 figures. arXiv admin note: text overlap with arXiv:1908.04902 ",
    "url": "https://arxiv.org/abs/1909.08511",
    "authors": [
      "Rui Li",
      "Tao Wang"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2101.08685",
    "title": "ItNet: iterative neural networks with small graphs for accurate,  efficient and anytime semantic segmentation",
    "abstract": " Comments: 11 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2101.08685",
    "authors": [
      "Thomas Pfeil"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2103.16328",
    "title": "Automatic airway segmentation from Computed Tomography using robust and  efficient 3-D convolutional neural networks",
    "abstract": " Comments: Changes have been made to reflect the minor revision and publication in Scientific Reports Nature ",
    "url": "https://arxiv.org/abs/2103.16328",
    "authors": [
      "A. Garcia-Uceda",
      "R. Selvan",
      "Z. Saghir",
      "H.A.W.M. Tiddens",
      "M. de Bruijne"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.12515",
    "title": "Committor functions via tensor networks",
    "abstract": " Title: Committor functions via tensor networks ",
    "url": "https://arxiv.org/abs/2106.12515",
    "authors": [
      "Yian Chen",
      "Jeremy Hoskins",
      "Yuehaw Khoo",
      "Michael Lindsey"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2108.00637",
    "title": "From \"study with me\" to study with you: how activities of Study With Me  livestream on Bilibili facilitate SRL community",
    "abstract": " Comments: 24 pages, two figures, submitted to ACM ",
    "url": "https://arxiv.org/abs/2108.00637",
    "authors": [
      "Ge Wang",
      "Yanxiang Zhang"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  }
]