[
  {
    "id": "arXiv:2108.02231",
    "title": "Growing an architecture for a neural network",
    "abstract": "We propose a new kind of automatic architecture search algorithm. The algorithm alternates pruning connections and adding neurons, and it is not restricted to layered architectures only. Here architecture is an arbitrary oriented graph with some weights (along with some biases and an activation function), so there may be no layered structure in such a network. The algorithm minimizes the complexity of staying within a given error. We demonstrate our algorithm on the brightness prediction problem of the next point through the previous points on an image. Our second test problem is the approximation of the bivariate function defining the brightness of a black and white image. Our optimized networks significantly outperform the standard solution for neural network architectures in both cases. ",
    "url": "https://arxiv.org/abs/2108.02231",
    "authors": [
      "Sergey Khashin",
      "Ekaterina Shemyakova"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2108.02316",
    "title": "Deep Stable neural networks: large-width asymptotics and convergence  rates",
    "abstract": "In modern deep learning, there is a recent and growing literature on the interplay between large-width asymptotics for deep Gaussian neural networks (NNs), i.e. deep NNs with Gaussian-distributed weights, and classes of Gaussian stochastic processes (SPs). Such an interplay has proved to be critical in several contexts of practical interest, e.g. Bayesian inference under Gaussian SP priors, kernel regression for infinite-wide deep NNs trained via gradient descent, and information propagation within infinite-wide NNs. Motivated by empirical analysis, showing the potential of replacing Gaussian distributions with Stable distributions for the NN's weights, in this paper we investigate large-width asymptotics for (fully connected) feed-forward deep Stable NNs, i.e. deep NNs with Stable-distributed weights. First, we show that as the width goes to infinity jointly over the NN's layers, a suitable rescaled deep Stable NN converges weakly to a Stable SP whose distribution is characterized recursively through the NN's layers. Because of the non-triangular NN's structure, this is a non-standard asymptotic problem, to which we propose a novel and self-contained inductive approach, which may be of independent interest. Then, we establish sup-norm convergence rates of a deep Stable NN to a Stable SP, quantifying the critical difference between the settings of ``joint growth\" and ``sequential growth\" of the width over the NN's layers. Our work extends recent results on infinite-wide limits for deep Gaussian NNs to the more general deep Stable NNs, providing the first result on convergence rates for infinite-wide deep NNs. ",
    "url": "https://arxiv.org/abs/2108.02316",
    "authors": [
      "Stefano Favaro",
      "Sandra Fortini",
      "Stefano Peluchetti"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Probability (math.PR)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2108.02327",
    "title": "PI3NN: Prediction intervals from three independently trained neural  networks",
    "abstract": "We propose a novel prediction interval method to learn prediction mean values, lower and upper bounds of prediction intervals from three independently trained neural networks only using the standard mean squared error (MSE) loss, for uncertainty quantification in regression tasks. Our method requires no distributional assumption on data, does not introduce unusual hyperparameters to either the neural network models or the loss function. Moreover, our method can effectively identify out-of-distribution samples and reasonably quantify their uncertainty. Numerical experiments on benchmark regression problems show that our method outperforms the state-of-the-art methods with respect to predictive uncertainty quality, robustness, and identification of out-of-distribution samples. ",
    "url": "https://arxiv.org/abs/2108.02327",
    "authors": [
      "Siyan Liu",
      "Pei Zhang",
      "Dan Lu",
      "Guannan Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.02482",
    "title": "MixMicrobleed: Multi-stage detection and segmentation of cerebral  microbleeds",
    "abstract": "Cerebral microbleeds are small, dark, round lesions that can be visualised on T2*-weighted MRI or other sequences sensitive to susceptibility effects. In this work, we propose a multi-stage approach to both microbleed detection and segmentation. First, possible microbleed locations are detected with a Mask R-CNN technique. Second, at each possible microbleed location, a simple U-Net performs the final segmentation. This work used the 72 subjects as training data provided by the \"Where is VALDO?\" challenge of MICCAI 2021. ",
    "url": "https://arxiv.org/abs/2108.02482",
    "authors": [
      "Marta Girones Sanguesa",
      "Denis Kutnar",
      "Bas H.M. van der Velden",
      "Hugo J. Kuijf"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.02513",
    "title": "User modeling for social and affective robots",
    "abstract": "This paper presents our first attempt to integrate user modeling features in social and affective robots. We propose a cloud-based architecture for modeling the user-robot interaction in order to re-use the approach with different kind of social robots. ",
    "url": "https://arxiv.org/abs/2108.02513",
    "authors": [
      "Cristina Gena",
      "Federica Cena",
      "Marco Botta",
      "Claudio Mattutino"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2108.02515",
    "title": "Multi-clue reconstruction of sharing chains for social media images",
    "abstract": "The amount of multimedia content shared everyday, combined with the level of realism reached by recent fake-generating technologies, threatens to impair the trustworthiness of online information sources. The process of uploading and sharing data tends to hinder standard media forensic analyses, since multiple re-sharing steps progressively hide the traces of past manipulations. At the same time though, new traces are introduced by the platforms themselves, enabling the reconstruction of the sharing history of digital objects, with possible applications in information flow monitoring and source identification. In this work, we propose a supervised framework for the reconstruction of image sharing chains on social media platforms. The system is structured as a cascade of backtracking blocks, each of them tracing back one step of the sharing chain at a time. Blocks are designed as ensembles of classifiers trained to analyse the input image independently from one another by leveraging different feature representations that describe both content and container of the media object. Individual decisions are then properly combined by a late fusion strategy. Results highlight the advantages of employing multiple clues, which allow accurately tracing back up to three steps along the sharing chain. ",
    "url": "https://arxiv.org/abs/2108.02515",
    "authors": [
      "Sebastiano Verde",
      "Cecilia Pasquini",
      "Federica Lago",
      "Alessandro Goller",
      "Francesco GB De Natale",
      "Alessandro Piva",
      "Giulia Boato"
    ],
    "subjectives": [
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2108.02563",
    "title": "GuavaNet: A deep neural network architecture for automatic sensory  evaluation to predict degree of acceptability for Guava by a consumer",
    "abstract": "This thesis is divided into two parts:Part I: Analysis of Fruits, Vegetables, Cheese and Fish based on Image Processing using Computer Vision and Deep Learning: A Review. It consists of a comprehensive review of image processing, computer vision and deep learning techniques applied to carry out analysis of fruits, vegetables, cheese and fish.This part also serves as a literature review for Part II.Part II: GuavaNet: A deep neural network architecture for automatic sensory evaluation to predict degree of acceptability for Guava by a consumer. This part introduces to an end-to-end deep neural network architecture that can predict the degree of acceptability by the consumer for a guava based on sensory evaluation. ",
    "url": "https://arxiv.org/abs/2108.02563",
    "authors": [
      "Vipul Mehra"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2108.02579",
    "title": "Selective privacy in IoT smart-farms for battery-powered device  longevity",
    "abstract": "This paper presents a payload security model to maintain the standards of TLS whilst removing obstacles associated with constrained devices and IoT network protocols. The domain of aquaponics as a smart-farming environment was used to test the novelty with ESP32 edge devices. The impact of privacy on message content illustrated the most appropriate security attribute configurations, followed by time and power analysis to calculate energy consumptions of each scenario. It was concluded that using this tailored payload security model rather than TLS was capable of extending the battery life of constrained devices by up to 81%, whilst maintaining TLS security standards, and applicable to various protocols. ",
    "url": "https://arxiv.org/abs/2108.02579",
    "authors": [
      "Steph Rudd",
      "Hamish Cunningham"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2108.02697",
    "title": "A tight local algorithm for the minimum dominating set problem in  outerplanar graphs",
    "abstract": "We show that there is a deterministic local algorithm (constant-time distributed graph algorithm) that finds a 5-approximation of a minimum dominating set on outerplanar graphs. We show there is no such algorithm that finds a $(5-\\varepsilon)$-approximation, for any $\\varepsilon>0$. Our algorithm only requires knowledge of the degree of a vertex and of its neighbors, so that large messages and unique identifiers are not needed. ",
    "url": "https://arxiv.org/abs/2108.02697",
    "authors": [
      "Marthe Bonamy",
      "Linda Cook",
      "Carla Groenland",
      "Alexandra Wesolek"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2108.02713",
    "title": "Role-based lateral movement detection with unsupervised learning",
    "abstract": "Adversarial lateral movement via compromised accounts remains difficult to discover via traditional rule-based defenses because it generally lacks explicit indicators of compromise. We propose a behavior-based, unsupervised framework comprising two methods of lateral movement detection on enterprise networks: one aimed at generic lateral movement via either exploit or authenticated connections, and one targeting the specific techniques of process injection and hijacking. The first method is based on the premise that the role of a system---the functions it performs on the network---determines the roles of the systems it should make connections with. The adversary meanwhile might move between any systems whatever, possibly seeking out systems with unusual roles that facilitate certain accesses. We use unsupervised learning to cluster systems according to role and identify connections to systems with novel roles as potentially malicious. The second method is based on the premise that the temporal patterns of inter-system processes that facilitate these connections depend on the roles of the systems involved. If a process is compromised by an attacker, these normal patterns might be disrupted in discernible ways. We apply frequent-itemset mining to process sequences to establish regular patterns of communication between systems based on role, and identify rare process sequences as signalling potentially malicious connections. ",
    "url": "https://arxiv.org/abs/2108.02713",
    "authors": [
      "Brian A. Powell"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2007.02156",
    "title": "On spectral algorithms for community detection in stochastic blockmodel  graphs with vertex covariates",
    "abstract": "In network inference applications, it is often desirable to detect community structure, namely to cluster vertices into groups, or blocks, according to some measure of similarity. Beyond mere adjacency matrices, many real networks also involve vertex covariates that carry key information about underlying block structure in graphs. To assess the effects of such covariates on block recovery, we present a comparative analysis of two model-based spectral algorithms for clustering vertices in stochastic blockmodel graphs with vertex covariates. The first algorithm uses only the adjacency matrix, and directly estimates the block assignments. The second algorithm incorporates both the adjacency matrix and the vertex covariates into the estimation of block assignments, and moreover quantifies the explicit impact of the vertex covariates on the resulting estimate of the block assignments. We employ Chernoff information to analytically compare the algorithms' performance and derive the information-theoretic Chernoff ratio for certain models of interest. Analytic results and simulations suggest that the second algorithm is often preferred: we can often better estimate the induced block assignments by first estimating the effect of vertex covariates. In addition, real data examples also indicate that the second algorithm has the advantages of revealing underlying block structure and taking observed vertex heterogeneity into account in real applications. Our findings emphasize the importance of distinguishing between observed and unobserved factors that can affect block structure in graphs. ",
    "url": "https://arxiv.org/abs/2007.02156",
    "authors": [
      "Cong Mu",
      "Angelo Mele",
      "Lingxin Hao",
      "Joshua Cape",
      "Avanti Athreya",
      "Carey E. Priebe"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Computation (stat.CO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2108.01403",
    "title": "Nonperturbative renormalization for the neural network-QFT  correspondence",
    "abstract": "In a recent work arXiv:2008.08601, Halverson, Maiti and Stoner proposed a description of neural networks in terms of a Wilsonian effective field theory. The infinite-width limit is mapped to a free field theory, while finite $N$ corrections are taken into account by interactions (non-Gaussian terms in the action). In this paper, we study two related aspects of this correspondence. First, we comment on the concepts of locality and power-counting in this context. Indeed, these usual space-time notions may not hold for neural networks (since inputs can be arbitrary), however, the renormalization group provides natural notions of locality and scaling. Moreover, we comment on several subtleties, for example, that data components may not have a permutation symmetry: in that case, we argue that random tensor field theories could provide a natural generalization. Second, we improve the perturbative Wilsonian renormalization from arXiv:2008.08601 by providing an analysis in terms of the nonperturbative renormalization group using the Wetterich-Morris equation. An important difference with usual nonperturbative RG analysis is that only the effective (IR) 2-point function is known, which requires setting the problem with care. Our aim is to provide a useful formalism to investigate neural networks behavior beyond the large-width limit (i.e.~far from Gaussian limit) in a nonperturbative fashion. A major result of our analysis is that changing the standard deviation of the neural network weight distribution can be interpreted as a renormalization flow in the space of networks. We focus on translations invariant kernels and provide preliminary numerical results. ",
    "url": "https://arxiv.org/abs/2108.01403",
    "authors": [
      "Harold Erbin",
      "Vincent Lahoche",
      "Dine Ousmane Samary"
    ],
    "subjectives": [
      "High Energy Physics - Theory (hep-th)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2108.02221",
    "title": "Deep multi-task mining Calabi-Yau four-folds",
    "abstract": "We continue earlier efforts in computing the dimensions of tangent space cohomologies of Calabi-Yau manifolds using deep learning. In this paper, we consider the dataset of all Calabi-Yau four-folds constructed as complete intersections in products of projective spaces. Employing neural networks inspired by state-of-the-art computer vision architectures, we improve earlier benchmarks and demonstrate that all four non-trivial Hodge numbers can be learned at the same time using a multi-task architecture. With 30% (80%) training ratio, we reach an accuracy of 100% for $h^{(1,1)}$ and 97% for $h^{(2,1)}$ (100% for both), 81% (96%) for $h^{(3,1)}$, and 49% (83%) for $h^{(2,2)}$. Assuming that the Euler number is known, as it is easy to compute, and taking into account the linear constraint arising from index computations, we get 100% total accuracy. ",
    "url": "https://arxiv.org/abs/2108.02221",
    "authors": [
      "Harold Erbin",
      "Riccardo Finotello",
      "Robin Schneider",
      "Mohamed Tamaazousti"
    ],
    "subjectives": [
      "High Energy Physics - Theory (hep-th)",
      "Machine Learning (cs.LG)",
      "Algebraic Geometry (math.AG)"
    ]
  },
  {
    "id": "arXiv:2108.02534",
    "title": "Existence and polynomial time construction of biregular, bipartite  Ramanujan graphs of all degrees",
    "abstract": "We prove that there exist bipartite, biregular Ramanujan graphs of every degree and every number of vertices provided that the cardinalities of the two sets of the bipartition divide each other. This generalizes a result of Marcus, Spielman, and Srivastava and, similar to theirs, the proof is based on the analysis of expected polynomials. The primary difference is the use of some new machinery involving rectangular convolutions, developed in a companion paper. We also prove the constructibility of such graphs in polynomial time in the number of vertices, extending a result of Cohen to this biregular case. ",
    "url": "https://arxiv.org/abs/2108.02534",
    "authors": [
      "Aurelien Gribinski",
      "Adam W. Marcus"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2108.02645",
    "title": "Application of hypercomplex number system in the dynamic network model",
    "abstract": "In recent years, the direction of the study of networks in which connections correspond to the mutual influences of nodes has been developed. Many works have been devoted to the study of such complex networks, but most often they relate to the spread of one type of activity (influence). In the process of development of the newest technologies various mathematical models are developed and investigated: models with thresholds, models of independent cascades, models of distribution of epidemics, models of Markov processes. The paper proposes to use hypercomplex number systems, which are a mathematical apparatus that allows you to model some network problems and solve them at a new level, ie to consider a complex network with several properties in each node. In this paper, we consider networks where the edges correspond to the mutual influences of the nodes. It is proposed to match the number of properties in each node and the measurability of a hypercomplex number system(HNS) with the same number of basic elements. Each HNS corresponds to the Kelly table, which corresponds to the law of multiplication of these CSF. The properties of the CSF allow you to build an isomorphic transition from a filled Kelly table to a less filled one, which simplifies the calculation. To model the problem using hypercomplex number systems, we offer a specialized software package of hypercomplex computations based on the system of computer algebra Maple. All this made it easy to model a complex system with several effects. ",
    "url": "https://arxiv.org/abs/2108.02645",
    "authors": [
      "Yuliia Boiiarinova",
      "Yakov Kalinovskiy",
      "Dmitriy Lande"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2108.02664",
    "title": "A method to compute the communicability of nodes through causal paths in  temporal networks",
    "abstract": "We present a method aimed to compute the communicability (broadcast and receive) of nodes through causal paths in temporal networks. The method considers all possible combinations of chronologically ordered products of adjacency matrices of the network snapshots and by means of a damping procedure favors the paths that have high communication efficiency. We apply the method to four real-world networks of face-to-face human contacts and identify the nodes with high communicability. The accuracy of the method is proved by studying the spread of an epidemic in the networks using the susceptible-infected-recovered model. We show that if a node with high broadcast is chosen as the origin of the outbreak of infection then the epidemic spreads early while it is delayed and inhibited if the origin of infection is a node with low broadcast. Receiving nodes can be treated as broadcasters if the arrow of time is reversed. ",
    "url": "https://arxiv.org/abs/2108.02664",
    "authors": [
      "Agostino Funel"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2108.02757",
    "title": "Generalized splines on graphs with two labels and polynomial splines on  cycles",
    "abstract": "A generalized spline on a graph $G$ with edges labeled by ideals in a ring $R$ consists of a vertex-labeling by elements of $R$ so that the labels on adjacent vertices $u, v$ differ by an element of the ideal associated to the edge $uv$. We study the $R$-module of generalized splines and produce minimum generating sets for several families of graphs and edge-labelings: $1)$ for all graphs when the edge-labelings consist of at most two finitely-generated ideals, and $2)$ for cycles when the edge-labelings consist of principal ideals generated by elements of the form $(ax+by)^2$ in the polynomial ring $\\mathbb{C}[x,y]$. We obtain the generators using a constructive algorithm that is suitable for computer implementation and give several applications, including contextualizing several results in classical (analytic) splines. ",
    "url": "https://arxiv.org/abs/2108.02757",
    "authors": [
      "Portia Anderson",
      "Jacob P. Matherne",
      "Julianna Tymoczko"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Commutative Algebra (math.AC)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2003.04696",
    "title": "TorchIO: A Python library for efficient loading, preprocessing,  augmentation and patch-based sampling of medical images in deep learning",
    "abstract": " Comments: Published in Computer Methods and Programs in Biomedicine ",
    "url": "https://arxiv.org/abs/2003.04696",
    "authors": [
      "Fernando Pérez-García",
      "Rachel Sparks",
      "Sébastien Ourselin"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2005.03948",
    "title": "Layer-wise training convolutional neural networks with smaller filters  for human activity recognition using wearable sensors",
    "abstract": " Comments: 11 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2005.03948",
    "authors": [
      "Yin Tang",
      "Qi Teng",
      "Lei Zhang",
      "Fuhong Min",
      "Jun He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2007.02156",
    "title": "On spectral algorithms for community detection in stochastic blockmodel  graphs with vertex covariates",
    "abstract": " Comments: 17 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2007.02156",
    "authors": [
      "Cong Mu",
      "Angelo Mele",
      "Lingxin Hao",
      "Joshua Cape",
      "Avanti Athreya",
      "Carey E. Priebe"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Computation (stat.CO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2010.06610",
    "title": "Training independent subnetworks for robust prediction",
    "abstract": " Comments: Updated to the ICLR camera ready version, added reference to Soflaei et al. 2020 ",
    "url": "https://arxiv.org/abs/2010.06610",
    "authors": [
      "Marton Havasi",
      "Rodolphe Jenatton",
      "Stanislav Fort",
      "Jeremiah Zhe Liu",
      "Jasper Snoek",
      "Balaji Lakshminarayanan",
      "Andrew M. Dai",
      "Dustin Tran"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  }
]