[
  {
    "id": "arXiv:2401.14411",
    "title": "Precision Mars Entry Navigation with Atmospheric Density Adaptation via  Neural Networks",
    "abstract": "Discrepancies between the true Martian atmospheric density and the onboard density model can significantly impair the performance of spacecraft entry navigation filters. This work introduces a new approach to online filtering for Martian entry by using a neural network to estimate atmospheric density and employing a consider analysis to account for the uncertainty in the estimate. The network is trained on an exponential atmospheric density model, and its parameters are dynamically adapted in real time to account for any mismatches between the true and estimated densities. The adaptation of the network is formulated as a maximum likelihood problem, leveraging the measurement innovations of the filter to identify optimal network parameters. The incorporation of a neural network enables the use of stochastic optimizers known for their efficiency in the machine learning domain within the context of the maximum likelihood approach. Performance comparisons against previous approaches are conducted in various realistic Mars entry navigation scenarios, resulting in superior estimation accuracy and precise alignment of the estimated density with a broad selection of realistic Martian atmospheres sampled from perturbed Mars-GRAM data. ",
    "url": "https://arxiv.org/abs/2401.14411",
    "authors": [
      "Felipe Giraldo-Grueso",
      "Andrey A. Popov",
      "Renato Zanetti"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2401.14426",
    "title": "M$^3$TN: Multi-gate Mixture-of-Experts based Multi-valued Treatment  Network for Uplift Modeling",
    "abstract": "Uplift modeling is a technique used to predict the effect of a treatment (e.g., discounts) on an individual's response. Although several methods have been proposed for multi-valued treatment, they are extended from binary treatment methods. There are still some limitations. Firstly, existing methods calculate uplift based on predicted responses, which may not guarantee a consistent uplift distribution between treatment and control groups. Moreover, this may cause cumulative errors for multi-valued treatment. Secondly, the model parameters become numerous with many prediction heads, leading to reduced efficiency. To address these issues, we propose a novel \\underline{M}ulti-gate \\underline{M}ixture-of-Experts based \\underline{M}ulti-valued \\underline{T}reatment \\underline{N}etwork (M$^3$TN). M$^3$TN consists of two components: 1) a feature representation module with Multi-gate Mixture-of-Experts to improve the efficiency; 2) a reparameterization module by modeling uplift explicitly to improve the effectiveness. We also conduct extensive experiments to demonstrate the effectiveness and efficiency of our M$^3$TN. ",
    "url": "https://arxiv.org/abs/2401.14426",
    "authors": [
      "Zexu Sun",
      "Xu Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2401.14438",
    "title": "From the Fair Distribution of Predictions to the Fair Distribution of  Social Goods: Evaluating the Impact of Fair Machine Learning on Long-Term  Unemployment",
    "abstract": "Algorithmic fairness focuses on the distribution of predictions at the time of training, rather than the distribution of social goods that arises after deploying the algorithm in a concrete social context. However, requiring a \"fair\" distribution of predictions may undermine efforts at establishing a fair distribution of social goods. Our first contribution is conceptual: we argue that addressing the fundamental question that motivates algorithmic fairness requires a notion of prospective fairness that anticipates the change in the distribution of social goods after deployment. Our second contribution is theoretical: we provide conditions under which this change is identified from pre-deployment data. That requires distinguishing between, and accounting for, different kinds of performative effects. In particular, we focus on the way predictions change policy decisions and, therefore, the distribution of social goods. Throughout, we are guided by an application from public administration: the use of algorithms to (1) predict who among the recently unemployed will remain unemployed in the long term and (2) target them with labor market programs. Our final contribution is empirical: using administrative data from the Swiss public employment service, we simulate how such policies would affect gender inequalities in long-term unemployment. When risk predictions are required to be \"fair\", targeting decisions are less effective, undermining efforts to lower overall levels of long-term unemployment and to close the gender gap in long-term unemployment. ",
    "url": "https://arxiv.org/abs/2401.14438",
    "authors": [
      "Sebastian Zezulka",
      "Konstantin Genin"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2401.14441",
    "title": "Connection of converters to a low and medium power DC network using an  inductor circuit",
    "abstract": "This letter describes an alternative for the connection of power converters to a direct current network without the installation of a capacitor in the DC-Link. The circuit allows the connection of converters through a coil and avoids short-circuit currents with different instantaneous values of voltage output. A description of the calculation and the choice of components together with a real implemented example in a DC network within Smart City project (Endes Utility) is presented. ",
    "url": "https://arxiv.org/abs/2401.14441",
    "authors": [
      "Francisco Perez-Hidalgo",
      "Juan-R Heredia-Larrubia",
      "Antonio Ruiz-Gonzalez",
      "Mario Meco-Gutierrez",
      "Francisco Vargas-Merino"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2401.14447",
    "title": "Wordflow: Social Prompt Engineering for Large Language Models",
    "abstract": "Large language models (LLMs) require well-crafted prompts for effective use. Prompt engineering, the process of designing prompts, is challenging, particularly for non-experts who are less familiar with AI technologies. While researchers have proposed techniques and tools to assist LLM users in prompt design, these works primarily target AI application developers rather than non-experts. To address this research gap, we propose social prompt engineering, a novel paradigm that leverages social computing techniques to facilitate collaborative prompt design. To investigate social prompt engineering, we introduce Wordflow, an open-source and social text editor that enables everyday users to easily create, run, share, and discover LLM prompts. Additionally, by leveraging modern web technologies, Wordflow allows users to run LLMs locally and privately in their browsers. Two usage scenarios highlight how social prompt engineering and our tool can enhance laypeople's interaction with LLMs. Wordflow is publicly accessible at https://poloclub.github.io/wordflow. ",
    "url": "https://arxiv.org/abs/2401.14447",
    "authors": [
      "Zijie J. Wang",
      "Aishwarya Chakravarthy",
      "David Munechika",
      "Duen Horng Chau"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.14461",
    "title": "Marabou 2.0: A Versatile Formal Analyzer of Neural Networks",
    "abstract": "This paper serves as a comprehensive system description of version 2.0 of the Marabou framework for formal analysis of neural networks. We discuss the tool's architectural design and highlight the major features and components introduced since its initial release. ",
    "url": "https://arxiv.org/abs/2401.14461",
    "authors": [
      "Haoze Wu",
      "Omri Isac",
      "Aleksandar Zeljić",
      "Teruhiro Tagomori",
      "Matthew Daggitt",
      "Wen Kokke",
      "Idan Refaeli",
      "Guy Amir",
      "Kyle Julian",
      "Shahaf Bassan",
      "Pei Huang",
      "Ori Lahav",
      "Min Wu",
      "Min Zhang",
      "Ekaterina Komendantskaya",
      "Guy Katz",
      "Clark Barrett"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2401.14469",
    "title": "Unveiling the Unseen: Identifiable Clusters in Trained Depthwise  Convolutional Kernels",
    "abstract": "Recent advances in depthwise-separable convolutional neural networks (DS-CNNs) have led to novel architectures, that surpass the performance of classical CNNs, by a considerable scalability and accuracy margin. This paper reveals another striking property of DS-CNN architectures: discernible and explainable patterns emerge in their trained depthwise convolutional kernels in all layers. Through an extensive analysis of millions of trained filters, with different sizes and from various models, we employed unsupervised clustering with autoencoders, to categorize these filters. Astonishingly, the patterns converged into a few main clusters, each resembling the difference of Gaussian (DoG) functions, and their first and second-order derivatives. Notably, we were able to classify over 95\\% and 90\\% of the filters from state-of-the-art ConvNextV2 and ConvNeXt models, respectively. This finding is not merely a technological curiosity; it echoes the foundational models neuroscientists have long proposed for the vision systems of mammals. Our results thus deepen our understanding of the emergent properties of trained DS-CNNs and provide a bridge between artificial and biological visual processing systems. More broadly, they pave the way for more interpretable and biologically-inspired neural network designs in the future. ",
    "url": "https://arxiv.org/abs/2401.14469",
    "authors": [
      "Zahra Babaiee",
      "Peyman M. Kiasari",
      "Daniela Rus",
      "Radu Grosu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2401.14487",
    "title": "Neighbor-Aware Calibration of Segmentation Networks with Penalty-Based  Constraints",
    "abstract": "Ensuring reliable confidence scores from deep neural networks is of paramount significance in critical decision-making systems, particularly in real-world domains such as healthcare. Recent literature on calibrating deep segmentation networks has resulted in substantial progress. Nevertheless, these approaches are strongly inspired by the advancements in classification tasks, and thus their uncertainty is usually modeled by leveraging the information of individual pixels, disregarding the local structure of the object of interest. Indeed, only the recent Spatially Varying Label Smoothing (SVLS) approach considers pixel spatial relationships across classes, by softening the pixel label assignments with a discrete spatial Gaussian kernel. In this work, we first present a constrained optimization perspective of SVLS and demonstrate that it enforces an implicit constraint on soft class proportions of surrounding pixels. Furthermore, our analysis shows that SVLS lacks a mechanism to balance the contribution of the constraint with the primary objective, potentially hindering the optimization process. Based on these observations, we propose NACL (Neighbor Aware CaLibration), a principled and simple solution based on equality constraints on the logit values, which enables to control explicitly both the enforced constraint and the weight of the penalty, offering more flexibility. Comprehensive experiments on a wide variety of well-known segmentation benchmarks demonstrate the superior calibration performance of the proposed approach, without affecting its discriminative power. Furthermore, ablation studies empirically show the model agnostic nature of our approach, which can be used to train a wide span of deep segmentation networks. ",
    "url": "https://arxiv.org/abs/2401.14487",
    "authors": [
      "Balamurali Murugesan",
      "Sukesh Adiga Vasudeva",
      "Bingyuan Liu",
      "Hervé Lombaert",
      "Ismail Ben Ayed",
      "Jose Dolz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.14510",
    "title": "RPNR: Robust-Perception Neural Reshading",
    "abstract": "Augmented Reality (AR) applications necessitates methods of inserting needed objects into scenes captured by cameras in a way that is coherent with the surroundings. Common AR applications require the insertion of predefined 3D objects with known properties and shape. This simplifies the problem since it is reduced to extracting an illumination model for the object in that scene by understanding the surrounding light sources. However, it is often not the case that we have information about the properties of an object, especially when we depart from a single source image. Our method renders such source fragments in a coherent way with the target surroundings using only these two images. Our pipeline uses a Deep Image Prior (DIP) network based on a U-Net architecture as the main renderer, alongside robust-feature extracting networks that are used to apply needed losses. Our method does not require any pair-labeled data, and no extensive training on a dataset. We compare our method using qualitative metrics to the baseline methods such as Cut and Paste, Cut And Paste Neural Rendering, and Image Harmonization ",
    "url": "https://arxiv.org/abs/2401.14510",
    "authors": [
      "Fouad Afiouni",
      "Mohamad Fakih",
      "Joey Sleiman"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.14535",
    "title": "CaRiNG: Learning Temporal Causal Representation under Non-Invertible  Generation Process",
    "abstract": "Identifying the underlying time-delayed latent causal processes in sequential data is vital for grasping temporal dynamics and making downstream reasoning. While some recent methods can robustly identify these latent causal variables, they rely on strict assumptions about the invertible generation process from latent variables to observed data. However, these assumptions are often hard to satisfy in real-world applications containing information loss. For instance, the visual perception process translates a 3D space into 2D images, or the phenomenon of persistence of vision incorporates historical data into current perceptions. To address this challenge, we establish an identifiability theory that allows for the recovery of independent latent components even when they come from a nonlinear and non-invertible mix. Using this theory as a foundation, we propose a principled approach, CaRiNG, to learn the CAusal RepresentatIon of Non-invertible Generative temporal data with identifiability guarantees. Specifically, we utilize temporal context to recover lost latent information and apply the conditions in our theory to guide the training process. Through experiments conducted on synthetic datasets, we validate that our CaRiNG method reliably identifies the causal process, even when the generation process is non-invertible. Moreover, we demonstrate that our approach considerably improves temporal understanding and reasoning in practical applications. ",
    "url": "https://arxiv.org/abs/2401.14535",
    "authors": [
      "Guangyi Chen",
      "Yifan Shen",
      "Zhenhao Chen",
      "Xiangchen Song",
      "Yuewen Sun",
      "Weiran Yao",
      "Xiao Liu",
      "Kun Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2401.14554",
    "title": "GCBF+: A Neural Graph Control Barrier Function Framework for Distributed  Safe Multi-Agent Control",
    "abstract": "Distributed, scalable, and safe control of large-scale multi-agent systems (MAS) is a challenging problem. In this paper, we design a distributed framework for safe multi-agent control in large-scale environments with obstacles, where a large number of agents are required to maintain safety using only local information and reach their goal locations. We introduce a new class of certificates, termed graph control barrier function (GCBF), which are based on the well-established control barrier function (CBF) theory for safety guarantees and utilize a graph structure for scalable and generalizable distributed control of MAS. We develop a novel theoretical framework to prove the safety of an arbitrary-sized MAS with a single GCBF. We propose a new training framework GCBF+ that uses graph neural networks (GNNs) to parameterize a candidate GCBF and a distributed control policy. The proposed framework is distributed and is capable of directly taking point clouds from LiDAR, instead of actual state information, for real-world robotic applications. We illustrate the efficacy of the proposed method through various hardware experiments on a swarm of drones with objectives ranging from exchanging positions to docking on a moving target without collision. Additionally, we perform extensive numerical experiments, where the number and density of agents, as well as the number of obstacles, increase. Empirical results show that in complex environments with nonlinear agents (e.g., Crazyflie drones) GCBF+ outperforms the handcrafted CBF-based method with the best performance by up to 20% for relatively small-scale MAS for up to 256 agents, and leading reinforcement learning (RL) methods by up to 40% for MAS with 1024 agents. Furthermore, the proposed method does not compromise on the performance, in terms of goal reaching, for achieving high safety rates, which is a common trade-off in RL-based methods. ",
    "url": "https://arxiv.org/abs/2401.14554",
    "authors": [
      "Songyuan Zhang",
      "Oswin So",
      "Kunal Garg",
      "Chuchu Fan"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2401.14578",
    "title": "GOAt: Explaining Graph Neural Networks via Graph Output Attribution",
    "abstract": "Understanding the decision-making process of Graph Neural Networks (GNNs) is crucial to their interpretability. Most existing methods for explaining GNNs typically rely on training auxiliary models, resulting in the explanations remain black-boxed. This paper introduces Graph Output Attribution (GOAt), a novel method to attribute graph outputs to input graph features, creating GNN explanations that are faithful, discriminative, as well as stable across similar samples. By expanding the GNN as a sum of scalar products involving node features, edge features and activation patterns, we propose an efficient analytical method to compute contribution of each node or edge feature to each scalar product and aggregate the contributions from all scalar products in the expansion form to derive the importance of each node and edge. Through extensive experiments on synthetic and real-world data, we show that our method not only outperforms various state-ofthe-art GNN explainers in terms of the commonly used fidelity metric, but also exhibits stronger discriminability, and stability by a remarkable margin. ",
    "url": "https://arxiv.org/abs/2401.14578",
    "authors": [
      "Shengyao Lu",
      "Keith G. Mills",
      "Jiao He",
      "Bang Liu",
      "Di Niu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.14580",
    "title": "Design Your Own Universe: A Physics-Informed Agnostic Method for  Enhancing Graph Neural Networks",
    "abstract": "Physics-informed Graph Neural Networks have achieved remarkable performance in learning through graph-structured data by mitigating common GNN challenges such as over-smoothing, over-squashing, and heterophily adaption. Despite these advancements, the development of a simple yet effective paradigm that appropriately integrates previous methods for handling all these challenges is still underway. In this paper, we draw an analogy between the propagation of GNNs and particle systems in physics, proposing a model-agnostic enhancement framework. This framework enriches the graph structure by introducing additional nodes and rewiring connections with both positive and negative weights, guided by node labeling information. We theoretically verify that GNNs enhanced through our approach can effectively circumvent the over-smoothing issue and exhibit robustness against over-squashing. Moreover, we conduct a spectral analysis on the rewired graph to demonstrate that the corresponding GNNs can fit both homophilic and heterophilic graphs. Empirical validations on benchmarks for homophilic, heterophilic graphs, and long-term graph datasets show that GNNs enhanced by our method significantly outperform their original counterparts. ",
    "url": "https://arxiv.org/abs/2401.14580",
    "authors": [
      "Dai Shi",
      "Andi Han",
      "Lequan Lin",
      "Yi Guo",
      "Zhiyong Wang",
      "Junbin Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.14583",
    "title": "Physical Trajectory Inference Attack and Defense in Decentralized POI  Recommendation",
    "abstract": "As an indispensable personalized service within Location-Based Social Networks (LBSNs), the Point-of-Interest (POI) recommendation aims to assist individuals in discovering attractive and engaging places. However, the accurate recommendation capability relies on the powerful server collecting a vast amount of users' historical check-in data, posing significant risks of privacy breaches. Although several collaborative learning (CL) frameworks for POI recommendation enhance recommendation resilience and allow users to keep personal data on-device, they still share personal knowledge to improve recommendation performance, thus leaving vulnerabilities for potential attackers. Given this, we design a new Physical Trajectory Inference Attack (PTIA) to expose users' historical trajectories. Specifically, for each user, we identify the set of interacted POIs by analyzing the aggregated information from the target POIs and their correlated POIs. We evaluate the effectiveness of PTIA on two real-world datasets across two types of decentralized CL frameworks for POI recommendation. Empirical results demonstrate that PTIA poses a significant threat to users' historical trajectories. Furthermore, Local Differential Privacy (LDP), the traditional privacy-preserving method for CL frameworks, has also been proven ineffective against PTIA. In light of this, we propose a novel defense mechanism (AGD) against PTIA based on an adversarial game to eliminate sensitive POIs and their information in correlated POIs. After conducting intensive experiments, AGD has been proven precise and practical, with minimal impact on recommendation performance. ",
    "url": "https://arxiv.org/abs/2401.14583",
    "authors": [
      "Jing Long",
      "Tong Chen",
      "Guanhua Ye",
      "Kai Zheng",
      "Nguyen Quoc Viet Hung",
      "Hongzhi Yin"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2401.14606",
    "title": "Challenging Low Homophily in Social Recommendation",
    "abstract": "Social relations are leveraged to tackle the sparsity issue of user-item interaction data in recommendation under the assumption of social homophily. However, social recommendation paradigms predominantly focus on homophily based on user preferences. While social information can enhance recommendations, its alignment with user preferences is not guaranteed, thereby posing the risk of introducing informational redundancy. We empirically discover that social graphs in real recommendation data exhibit low preference-aware homophily, which limits the effect of social recommendation models. To comprehensively extract preference-aware homophily information latent in the social graph, we propose Social Heterophily-alleviating Rewiring (SHaRe), a data-centric framework for enhancing existing graph-based social recommendation models. We adopt Graph Rewiring technique to capture and add highly homophilic social relations, and cut low homophilic (or heterophilic) relations. To better refine the user representations from reliable social relations, we integrate a contrastive learning method into the training of SHaRe, aiming to calibrate the user representations for enhancing the result of Graph Rewiring. Experiments on real-world datasets show that the proposed framework not only exhibits enhanced performances across varying homophily ratios but also improves the performance of existing state-of-the-art (SOTA) social recommendation models. ",
    "url": "https://arxiv.org/abs/2401.14606",
    "authors": [
      "Wei Jiang",
      "Xinyi Gao",
      "Guandong Xu",
      "Tong Chen",
      "Hongzhi Yin"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2401.14607",
    "title": "Assembling a Multi-Platform Ensemble Social Bot Detector with  Applications to US 2020 Elections",
    "abstract": "Bots have been in the spotlight for many social media studies, for they have been observed to be participating in the manipulation of information and opinions on social media. These studies analyzed the activity and influence of bots in a variety of contexts: elections, protests, health communication and so forth. Prior to this analyses is the identification of bot accounts to segregate the class of social media users. In this work, we propose an ensemble method for bot detection, designing a multi-platform bot detection architecture to handle several problems along the bot detection pipeline: incomplete data input, minimal feature engineering, optimized classifiers for each data field, and also eliminate the need for a threshold value for classification determination. With these design decisions, we generalize our bot detection framework across Twitter, Reddit and Instagram. We also perform feature importance analysis, observing that the entropy of names and number of interactions (retweets/shares) are important factors in bot determination. Finally, we apply our multi-platform bot detector to the US 2020 presidential elections to identify and analyze bot activity across multiple social media platforms, showcasing the difference in online discourse of bots from different platforms. ",
    "url": "https://arxiv.org/abs/2401.14607",
    "authors": [
      "Lynnette Hui Xian Ng",
      "Kathleen M. Carley"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.14609",
    "title": "Physically Informed Synchronic-adaptive Learning for Industrial Systems  Modeling in Heterogeneous Media with Unavailable Time-varying Interface",
    "abstract": "Partial differential equations (PDEs) are commonly employed to model complex industrial systems characterized by multivariable dependence. Existing physics-informed neural networks (PINNs) excel in solving PDEs in a homogeneous medium. However, their feasibility is diminished when PDE parameters are unknown due to a lack of physical attributions and time-varying interface is unavailable arising from heterogeneous media. To this end, we propose a data-physics-hybrid method, physically informed synchronic-adaptive learning (PISAL), to solve PDEs for industrial systems modeling in heterogeneous media. First, Net1, Net2, and NetI, are constructed to approximate the solutions satisfying PDEs and the interface. Net1 and Net2 are utilized to synchronously learn each solution satisfying PDEs with diverse parameters, while NetI is employed to adaptively learn the unavailable time-varying interface. Then, a criterion combined with NetI is introduced to adaptively distinguish the attributions of measurements and collocation points. Furthermore, NetI is integrated into a data-physics-hybrid loss function. Accordingly, a synchronic-adaptive learning (SAL) strategy is proposed to decompose and optimize each subdomain. Besides, we theoretically prove the approximation capability of PISAL. Extensive experimental results verify that the proposed PISAL can be used for industrial systems modeling in heterogeneous media, which faces the challenges of lack of physical attributions and unavailable time-varying interface. ",
    "url": "https://arxiv.org/abs/2401.14609",
    "authors": [
      "Aina Wang",
      "Pan Qin",
      "Xi-Ming Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2401.14626",
    "title": "Towards Lifelong Scene Graph Generation with Knowledge-ware In-context  Prompt Learning",
    "abstract": "Scene graph generation (SGG) endeavors to predict visual relationships between pairs of objects within an image. Prevailing SGG methods traditionally assume a one-off learning process for SGG. This conventional paradigm may necessitate repetitive training on all previously observed samples whenever new relationships emerge, mitigating the risk of forgetting previously acquired knowledge. This work seeks to address this pitfall inherent in a suite of prior relationship predictions. Motivated by the achievements of in-context learning in pretrained language models, our approach imbues the model with the capability to predict relationships and continuously acquire novel knowledge without succumbing to catastrophic forgetting. To achieve this goal, we introduce a novel and pragmatic framework for scene graph generation, namely Lifelong Scene Graph Generation (LSGG), where tasks, such as predicates, unfold in a streaming fashion. In this framework, the model is constrained to exclusive training on the present task, devoid of access to previously encountered training data, except for a limited number of exemplars, but the model is tasked with inferring all predicates it has encountered thus far. Rigorous experiments demonstrate the superiority of our proposed method over state-of-the-art SGG models in the context of LSGG across a diverse array of metrics. Besides, extensive experiments on the two mainstream benchmark datasets, VG and Open-Image(v6), show the superiority of our proposed model to a number of competitive SGG models in terms of continuous learning and conventional settings. Moreover, comprehensive ablation experiments demonstrate the effectiveness of each component in our model. ",
    "url": "https://arxiv.org/abs/2401.14626",
    "authors": [
      "Tao He",
      "Tongtong Wu",
      "Dongyang Zhang",
      "Guiduo Duan",
      "Ke Qin",
      "Yuan-Fang Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.14628",
    "title": "Inferring Data Preconditions from Deep Learning Models for Trustworthy  Prediction in Deployment",
    "abstract": "Deep learning models are trained with certain assumptions about the data during the development stage and then used for prediction in the deployment stage. It is important to reason about the trustworthiness of the model's predictions with unseen data during deployment. Existing methods for specifying and verifying traditional software are insufficient for this task, as they cannot handle the complexity of DNN model architecture and expected outcomes. In this work, we propose a novel technique that uses rules derived from neural network computations to infer data preconditions for a DNN model to determine the trustworthiness of its predictions. Our approach, DeepInfer involves introducing a novel abstraction for a trained DNN model that enables weakest precondition reasoning using Dijkstra's Predicate Transformer Semantics. By deriving rules over the inductive type of neural network abstract representation, we can overcome the matrix dimensionality issues that arise from the backward non-linear computation from the output layer to the input layer. We utilize the weakest precondition computation using rules of each kind of activation function to compute layer-wise precondition from the given postcondition on the final output of a deep neural network. We extensively evaluated DeepInfer on 29 real-world DNN models using four different datasets collected from five different sources and demonstrated the utility, effectiveness, and performance improvement over closely related work. DeepInfer efficiently detects correct and incorrect predictions of high-accuracy models with high recall (0.98) and high F-1 score (0.84) and has significantly improved over prior technique, SelfChecker. The average runtime overhead of DeepInfer is low, 0.22 sec for all unseen datasets. We also compared runtime overhead using the same hardware settings and found that DeepInfer is 3.27 times faster than SelfChecker. ",
    "url": "https://arxiv.org/abs/2401.14628",
    "authors": [
      "Shibbir Ahmed",
      "Hongyang Gao",
      "Hridesh Rajan"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.14637",
    "title": "T-Rex: Text-assisted Retrosynthesis Prediction",
    "abstract": "As a fundamental task in computational chemistry, retrosynthesis prediction aims to identify a set of reactants to synthesize a target molecule. Existing template-free approaches only consider the graph structures of the target molecule, which often cannot generalize well to rare reaction types and large molecules. Here, we propose T-Rex, a text-assisted retrosynthesis prediction approach that exploits pre-trained text language models, such as ChatGPT, to assist the generation of reactants. T-Rex first exploits ChatGPT to generate a description for the target molecule and rank candidate reaction centers based both the description and the molecular graph. It then re-ranks these candidates by querying the descriptions for each reactants and examines which group of reactants can best synthesize the target molecule. We observed that T-Rex substantially outperformed graph-based state-of-the-art approaches on two datasets, indicating the effectiveness of considering text information. We further found that T-Rex outperformed the variant that only use ChatGPT-based description without the re-ranking step, demonstrate how our framework outperformed a straightforward integration of ChatGPT and graph information. Collectively, we show that text generated by pre-trained language models can substantially improve retrosynthesis prediction, opening up new avenues for exploiting ChatGPT to advance computational chemistry. And the codes can be found at https://github.com/lauyikfung/T-Rex. ",
    "url": "https://arxiv.org/abs/2401.14637",
    "authors": [
      "Yifeng Liu",
      "Hanwen Xu",
      "Tangqi Fang",
      "Haocheng Xi",
      "Zixuan Liu",
      "Sheng Zhang",
      "Hoifung Poon",
      "Sheng Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.14640",
    "title": "Benchmarking Large Language Models in Complex Question Answering  Attribution using Knowledge Graphs",
    "abstract": "The attribution of question answering is to provide citations for supporting generated statements, and has attracted wide research attention. The current methods for automatically evaluating the attribution, which are often based on Large Language Models (LLMs), are still inadequate, particularly in recognizing subtle differences between attributions, and complex relationships between citations and statements. To compare these attribution evaluation methods and develop new ones, we introduce a set of fine-grained categories (i.e., supportive, insufficient, contradictory and irrelevant) for measuring the attribution, and develop a Complex Attributed Question Answering (CAQA) benchmark by leveraging knowledge graphs (KGs) for automatically generating attributions of different categories to question-answer pairs. Our analysis reveals that existing evaluators perform poorly under fine-grained attribution settings and exhibit weaknesses in complex citation-statement reasoning. Our CAQA benchmark, validated with human annotations, emerges as a promising tool for selecting and developing LLM attribution evaluators. ",
    "url": "https://arxiv.org/abs/2401.14640",
    "authors": [
      "Nan Hu",
      "Jiaoyan Chen",
      "Yike Wu",
      "Guilin Qi",
      "Sheng Bi",
      "Tongtong Wu",
      "Jeff Z. Pan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.14641",
    "title": "Super Efficient Neural Network for Compression Artifacts Reduction and  Super Resolution",
    "abstract": "Video quality can suffer from limited internet speed while being streamed by users. Compression artifacts start to appear when the bitrate decreases to match the available bandwidth. Existing algorithms either focus on removing the compression artifacts at the same video resolution, or on upscaling the video resolution but not removing the artifacts. Super resolution-only approaches will amplify the artifacts along with the details by default. We propose a lightweight convolutional neural network (CNN)-based algorithm which simultaneously performs artifacts reduction and super resolution (ARSR) by enhancing the feature extraction layers and designing a custom training dataset. The output of this neural network is evaluated for test streams compressed at low bitrates using variable bitrate (VBR) encoding. The output video quality shows a 4-6 increase in video multi-method assessment fusion (VMAF) score compared to traditional interpolation upscaling approaches such as Lanczos or Bicubic. ",
    "url": "https://arxiv.org/abs/2401.14641",
    "authors": [
      "Wen Ma",
      "Qiuwen Lou",
      "Arman Kazemi",
      "Julian Faraone",
      "Tariq Afzal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2401.14652",
    "title": "LitE-SNN: Designing Lightweight and Efficient Spiking Neural Network  through Spatial-Temporal Compressive Network Search and Joint Optimization",
    "abstract": "Spiking Neural Networks (SNNs) mimic the information-processing mechanisms of the human brain and are highly energy-efficient, making them well-suited for low-power edge devices. However, the pursuit of accuracy in current studies leads to large, long-timestep SNNs, conflicting with the resource constraints of these devices. In order to design lightweight and efficient SNNs, we propose a new approach named LitESNN that incorporates both spatial and temporal compression into the automated network design process. Spatially, we present a novel Compressive Convolution block (CompConv) to expand the search space to support pruning and mixed-precision quantization while utilizing the shared weights and pruning mask to reduce the computation. Temporally, we are the first to propose a compressive timestep search to identify the optimal number of timesteps under specific computation cost constraints. Finally, we formulate a joint optimization to simultaneously learn the architecture parameters and spatial-temporal compression strategies to achieve high performance while minimizing memory and computation costs. Experimental results on CIFAR10, CIFAR100, and Google Speech Command datasets demonstrate our proposed LitESNNs can achieve competitive or even higher accuracy with remarkably smaller model sizes and fewer computation costs. Furthermore, we validate the effectiveness of our LitESNN on the trade-off between accuracy and resource cost and show the superiority of our joint optimization. Additionally, we conduct energy analysis to further confirm the energy efficiency of LitESNN ",
    "url": "https://arxiv.org/abs/2401.14652",
    "authors": [
      "Qianhui Liu",
      "Jiaqi Yan",
      "Malu Zhang",
      "Gang Pan",
      "Haizhou Li"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2401.14654",
    "title": "A Korean Legal Judgment Prediction Dataset for Insurance Disputes",
    "abstract": "This paper introduces a Korean legal judgment prediction (LJP) dataset for insurance disputes. Successful LJP models on insurance disputes can benefit insurance companies and their customers. It can save both sides' time and money by allowing them to predict how the result would come out if they proceed to the dispute mediation process. As is often the case with low-resource languages, there is a limitation on the amount of data available for this specific task. To mitigate this issue, we investigate how one can achieve a good performance despite the limitation in data. In our experiment, we demonstrate that Sentence Transformer Fine-tuning (SetFit, Tunstall et al., 2022) is a good alternative to standard fine-tuning when training data are limited. The models fine-tuned with the SetFit approach on our data show similar performance to the Korean LJP benchmark models (Hwang et al., 2022) despite the much smaller data size. ",
    "url": "https://arxiv.org/abs/2401.14654",
    "authors": [
      "Alice Saebom Kwak",
      "Cheonkam Jeong",
      "Ji Weon Lim",
      "Byeongcheol Min"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.14661",
    "title": "From Blurry to Brilliant Detection: YOLOv5-Based Aerial Object Detection  with Super Resolution",
    "abstract": "The demand for accurate object detection in aerial imagery has surged with the widespread use of drones and satellite technology. Traditional object detection models, trained on datasets biased towards large objects, struggle to perform optimally in aerial scenarios where small, densely clustered objects are prevalent. To address this challenge, we present an innovative approach that combines super-resolution and an adapted lightweight YOLOv5 architecture. We employ a range of datasets, including VisDrone-2023, SeaDroneSee, VEDAI, and NWPU VHR-10, to evaluate our model's performance. Our Super Resolved YOLOv5 architecture features Transformer encoder blocks, allowing the model to capture global context and context information, leading to improved detection results, especially in high-density, occluded conditions. This lightweight model not only delivers improved accuracy but also ensures efficient resource utilization, making it well-suited for real-time applications. Our experimental results demonstrate the model's superior performance in detecting small and densely clustered objects, underlining the significance of dataset choice and architectural adaptation for this specific task. In particular, the method achieves 52.5% mAP on VisDrone, exceeding top prior works. This approach promises to significantly advance object detection in aerial imagery, contributing to more accurate and reliable results in a variety of real-world applications. ",
    "url": "https://arxiv.org/abs/2401.14661",
    "authors": [
      "Ragib Amin Nihal",
      "Benjamin Yen",
      "Katsutoshi Itoyama",
      "Kazuhiro Nakadai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.14666",
    "title": "Joint Transmitter Design for Robust Secure Radar-Communication  Coexistence Systems",
    "abstract": "This paper investigates the spectrum sharing between a multiple-input single-output (MISO) secure communication system and a multiple-input multiple-output (MIMO) radar system in the presence of one suspicious eavesdropper. We jointly design the radar waveform and communication beamforming vector at the two systems, such that the interference between the base station (BS) and radar is reduced, and the detrimental radar interference to the communication system is enhanced to jam the eavesdropper, thereby increasing secure information transmission performance. In particular, by considering the imperfect channel state information (CSI) for the user and eavesdropper, we maximize the worst-case secrecy rate at the user, while ensuring the detection performance of radar system. To tackle this challenging problem, we propose a two-layer robust cooperative algorithm based on the S-lemma and semidefinite relaxation techniques. Simulation results demonstrate that the proposed algorithm achieves significant secrecy rate gains over the non-robust scheme. Furthermore, we illustrate the trade-off between secrecy rate and detection probability. ",
    "url": "https://arxiv.org/abs/2401.14666",
    "authors": [
      "Peng Liu",
      "Zesong Fei",
      "Xinyi Wang",
      "Zhong Zheng",
      "Xiangnan Li",
      "Jie Xu"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2401.14678",
    "title": "Prompt-enhanced Federated Content Representation Learning for  Cross-domain Recommendation",
    "abstract": "Cross-domain Recommendation (CDR) as one of the effective techniques in alleviating the data sparsity issues has been widely studied in recent years. However, previous works may cause domain privacy leakage since they necessitate the aggregation of diverse domain data into a centralized server during the training process. Though several studies have conducted privacy preserving CDR via Federated Learning (FL), they still have the following limitations: 1) They need to upload users' personal information to the central server, posing the risk of leaking user privacy. 2) Existing federated methods mainly rely on atomic item IDs to represent items, which prevents them from modeling items in a unified feature space, increasing the challenge of knowledge transfer among domains. 3) They are all based on the premise of knowing overlapped users between domains, which proves impractical in real-world applications. To address the above limitations, we focus on Privacy-preserving Cross-domain Recommendation (PCDR) and propose PFCR as our solution. For Limitation 1, we develop a FL schema by exclusively utilizing users' interactions with local clients and devising an encryption method for gradient encryption. For Limitation 2, we model items in a universal feature space by their description texts. For Limitation 3, we initially learn federated content representations, harnessing the generality of natural language to establish bridges between domains. Subsequently, we craft two prompt fine-tuning strategies to tailor the pre-trained model to the target domain. Extensive experiments on two real-world datasets demonstrate the superiority of our PFCR method compared to the SOTA approaches. ",
    "url": "https://arxiv.org/abs/2401.14678",
    "authors": [
      "Lei Guo",
      "Ziang Lu",
      "Junliang Yu",
      "Nguyen Quoc Viet Hung",
      "Hongzhi Yin"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2401.14681",
    "title": "MasonTigers@LT-EDI-2024: An Ensemble Approach towards Detecting  Homophobia and Transphobia in Social Media Comments",
    "abstract": "In this paper, we describe our approaches and results for Task 2 of the LT-EDI 2024 Workshop, aimed at detecting homophobia and/or transphobia across ten languages. Our methodologies include monolingual transformers and ensemble methods, capitalizing on the strengths of each to enhance the performance of the models. The ensemble models worked well, placing our team, MasonTigers, in the top five for eight of the ten languages, as measured by the macro F1 score. Our work emphasizes the efficacy of ensemble methods in multilingual scenarios, addressing the complexities of language-specific tasks. ",
    "url": "https://arxiv.org/abs/2401.14681",
    "authors": [
      "Dhiman Goswami",
      "Sadiya Sayara Chowdhury Puspo",
      "Md Nishat Raihan",
      "Al Nahian Bin Emran"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.14694",
    "title": "TA-RNN: an Attention-based Time-aware Recurrent Neural Network  Architecture for Electronic Health Records",
    "abstract": "Motivation: Electronic Health Records (EHR) represent a comprehensive resource of a patient's medical history. EHR are essential for utilizing advanced technologies such as deep learning (DL), enabling healthcare providers to analyze extensive data, extract valuable insights, and make precise and data-driven clinical decisions. DL methods such as Recurrent Neural Networks (RNN) have been utilized to analyze EHR to model disease progression and predict diagnosis. However, these methods do not address some inherent irregularities in EHR data such as irregular time intervals between clinical visits. Furthermore, most DL models are not interpretable. In this study, we propose two interpretable DL architectures based on RNN, namely Time-Aware RNN (TA-RNN) and TA-RNN-Autoencoder (TA-RNN-AE) to predict patient's clinical outcome in EHR at next visit and multiple visits ahead, respectively. To mitigate the impact of irregular time intervals, we propose incorporating time embedding of the elapsed times between visits. For interpretability, we propose employing a dual-level attention mechanism that operates between visits and features within each visit. Results: The results of the experiments conducted on Alzheimer's Disease Neuroimaging Initiative (ADNI) and National Alzheimer's Coordinating Center (NACC) datasets indicated superior performance of proposed models for predicting Alzheimer's Disease (AD) compared to state-of-the-art and baseline approaches based on F2 and sensitivity. Additionally, TA-RNN showed superior performance on Medical Information Mart for Intensive Care (MIMIC-III) dataset for mortality prediction. In our ablation study, we observed enhanced predictive performance by incorporating time embedding and attention mechanisms. Finally, investigating attention weights helped identify influential visits and features in predictions. Availability: https://github.com/bozdaglab/TA-RNN ",
    "url": "https://arxiv.org/abs/2401.14694",
    "authors": [
      "Mohammad Al Olaimat",
      "Serdar Bozdag",
      "Alzheimer's Disease Neuroimaging Initiative"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.14695",
    "title": "Continuously Evolving Graph Neural Controlled Differential Equations for  Traffic Forecasting",
    "abstract": "As a crucial technique for developing a smart city, traffic forecasting has become a popular research focus in academic and industrial communities for decades. This task is highly challenging due to complex and dynamic spatial-temporal dependencies in traffic networks. Existing works ignore continuous temporal dependencies and spatial dependencies evolving over time. In this paper, we propose Continuously Evolving Graph Neural Controlled Differential Equations (CEGNCDE) to capture continuous temporal dependencies and spatial dependencies over time simultaneously. Specifically, a continuously evolving graph generator (CEGG) based on NCDE is introduced to generate the spatial dependencies graph that continuously evolves over time from discrete historical observations. Then, a graph neural controlled differential equations (GNCDE) framework is introduced to capture continuous temporal dependencies and spatial dependencies over time simultaneously. Extensive experiments demonstrate that CEGNCDE outperforms the SOTA methods by average 2.34% relative MAE reduction, 0.97% relative RMSE reduction, and 3.17% relative MAPE reduction. ",
    "url": "https://arxiv.org/abs/2401.14695",
    "authors": [
      "Jiajia Wu",
      "Ling Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.14702",
    "title": "FairSample: Training Fair and Accurate Graph Convolutional Neural  Networks Efficiently",
    "abstract": "Fairness in Graph Convolutional Neural Networks (GCNs) becomes a more and more important concern as GCNs are adopted in many crucial applications. Societal biases against sensitive groups may exist in many real world graphs. GCNs trained on those graphs may be vulnerable to being affected by such biases. In this paper, we adopt the well-known fairness notion of demographic parity and tackle the challenge of training fair and accurate GCNs efficiently. We present an in-depth analysis on how graph structure bias, node attribute bias, and model parameters may affect the demographic parity of GCNs. Our insights lead to FairSample, a framework that jointly mitigates the three types of biases. We employ two intuitive strategies to rectify graph structures. First, we inject edges across nodes that are in different sensitive groups but similar in node features. Second, to enhance model fairness and retain model quality, we develop a learnable neighbor sampling policy using reinforcement learning. To address the bias in node features and model parameters, FairSample is complemented by a regularization objective to optimize fairness. ",
    "url": "https://arxiv.org/abs/2401.14702",
    "authors": [
      "Zicun Cong",
      "Shi Baoxu",
      "Shan Li",
      "Jaewon Yang",
      "Qi He",
      "Jian Pei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2401.14707",
    "title": "Mitigating Feature Gap for Adversarial Robustness by Feature  Disentanglement",
    "abstract": "Deep neural networks are vulnerable to adversarial samples. Adversarial fine-tuning methods aim to enhance adversarial robustness through fine-tuning the naturally pre-trained model in an adversarial training manner. However, we identify that some latent features of adversarial samples are confused by adversarial perturbation and lead to an unexpectedly increasing gap between features in the last hidden layer of natural and adversarial samples. To address this issue, we propose a disentanglement-based approach to explicitly model and further remove the latent features that cause the feature gap. Specifically, we introduce a feature disentangler to separate out the latent features from the features of the adversarial samples, thereby boosting robustness by eliminating the latent features. Besides, we align features in the pre-trained model with features of adversarial samples in the fine-tuned model, to further benefit from the features from natural samples without confusion. Empirical evaluations on three benchmark datasets demonstrate that our approach surpasses existing adversarial fine-tuning methods and adversarial training baselines. ",
    "url": "https://arxiv.org/abs/2401.14707",
    "authors": [
      "Nuoyan Zhou",
      "Dawei Zhou",
      "Decheng Liu",
      "Xinbo Gao",
      "Nannan Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.14717",
    "title": "Turn-taking and Backchannel Prediction with Acoustic and Large Language  Model Fusion",
    "abstract": "We propose an approach for continuous prediction of turn-taking and backchanneling locations in spoken dialogue by fusing a neural acoustic model with a large language model (LLM). Experiments on the Switchboard human-human conversation dataset demonstrate that our approach consistently outperforms the baseline models with single modality. We also develop a novel multi-task instruction fine-tuning strategy to further benefit from LLM-encoded knowledge for understanding the tasks and conversational contexts, leading to additional improvements. Our approach demonstrates the potential of combined LLMs and acoustic models for a more natural and conversational interaction between humans and speech-enabled AI agents. ",
    "url": "https://arxiv.org/abs/2401.14717",
    "authors": [
      "Jinhan Wang",
      "Long Chen",
      "Aparna Khare",
      "Anirudh Raju",
      "Pranav Dheram",
      "Di He",
      "Minhua Wu",
      "Andreas Stolcke",
      "Venkatesh Ravichandran"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2401.14719",
    "title": "pLitterStreet: Street Level Plastic Litter Detection and Mapping",
    "abstract": "Plastic pollution is a critical environmental issue, and detecting and monitoring plastic litter is crucial to mitigate its impact. This paper presents the methodology of mapping street-level litter, focusing primarily on plastic waste and the location of trash bins. Our methodology involves employing a deep learning technique to identify litter and trash bins from street-level imagery taken by a camera mounted on a vehicle. Subsequently, we utilized heat maps to visually represent the distribution of litter and trash bins throughout cities. Additionally, we provide details about the creation of an open-source dataset (\"pLitterStreet\") which was developed and utilized in our approach. The dataset contains more than 13,000 fully annotated images collected from vehicle-mounted cameras and includes bounding box labels. To evaluate the effectiveness of our dataset, we tested four well known state-of-the-art object detection algorithms (Faster R-CNN, RetinaNet, YOLOv3, and YOLOv5), achieving an average precision (AP) above 40%. While the results show average metrics, our experiments demonstrated the reliability of using vehicle-mounted cameras for plastic litter mapping. The \"pLitterStreet\" can also be a valuable resource for researchers and practitioners to develop and further improve existing machine learning models for detecting and mapping plastic litter in an urban environment. The dataset is open-source and more details about the dataset and trained models can be found at https://github.com/gicait/pLitter. ",
    "url": "https://arxiv.org/abs/2401.14719",
    "authors": [
      "Sriram Reddy Mandhati",
      "N. Lakmal Deshapriya",
      "Chatura Lavanga Mendis",
      "Kavinda Gunasekara",
      "Frank Yrle",
      "Angsana Chaksan",
      "Sujit Sanjeev"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.14726",
    "title": "3D Reconstruction and New View Synthesis of Indoor Environments based on  a Dual Neural Radiance Field",
    "abstract": "Simultaneously achieving 3D reconstruction and new view synthesis for indoor environments has widespread applications but is technically very challenging. State-of-the-art methods based on implicit neural functions can achieve excellent 3D reconstruction results, but their performances on new view synthesis can be unsatisfactory. The exciting development of neural radiance field (NeRF) has revolutionized new view synthesis, however, NeRF-based models can fail to reconstruct clean geometric surfaces. We have developed a dual neural radiance field (Du-NeRF) to simultaneously achieve high-quality geometry reconstruction and view rendering. Du-NeRF contains two geometric fields, one derived from the SDF field to facilitate geometric reconstruction and the other derived from the density field to boost new view synthesis. One of the innovative features of Du-NeRF is that it decouples a view-independent component from the density field and uses it as a label to supervise the learning process of the SDF field. This reduces shape-radiance ambiguity and enables geometry and color to benefit from each other during the learning process. Extensive experiments demonstrate that Du-NeRF can significantly improve the performance of novel view synthesis and 3D reconstruction for indoor environments and it is particularly effective in constructing areas containing fine geometries that do not obey multi-view color consistency. ",
    "url": "https://arxiv.org/abs/2401.14726",
    "authors": [
      "Zhenyu Bao",
      "Guibiao Liao",
      "Zhongyuan Zhao",
      "Kanglin Liu",
      "Qing Li",
      "Guoping Qiu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2401.14727",
    "title": "SparseCoder: Identifier-Aware Sparse Transformer for File-Level Code  Summarization",
    "abstract": "Code summarization aims to generate natural language descriptions of source code, facilitating programmers to understand and maintain it rapidly. While previous code summarization efforts have predominantly focused on method-level, this paper studies file-level code summarization, which can assist programmers in understanding and maintaining large source code projects. Unlike method-level code summarization,file-level code summarization typically involves long source code within a single file, which makes it challenging for Transformer-based models to understand the code semantics for the maximum input length of these models is difficult to set to a large number that can handle long code input well, due to the quadratic scaling of computational complexity with the input sequence length. To address this challenge, we propose SparseCoder, an identifier-aware sparse transformer for effectively handling long code sequences. Specifically, the SparseCoder employs a sliding window mechanism for self-attention to model short-term dependencies and leverages the structure message of code to capture long-term dependencies among source code identifiers by introducing two types of sparse attention patterns named global and identifier attention. To evaluate the performance of SparseCoder, we construct a new dataset FILE-CS for file-level code summarization in Python. Experimental results show that our SparseCoder model achieves state-of-the-art performance compared with other pre-trained models, including full self-attention and sparse models. Additionally, our model has low memory overhead and achieves comparable performance with models using full self-attention mechanism. ",
    "url": "https://arxiv.org/abs/2401.14727",
    "authors": [
      "Yanlin Wang",
      "Yanxian Huang",
      "Daya Guo",
      "Hongyu Zhang",
      "Zibin Zheng"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2401.14729",
    "title": "Sketch and Refine: Towards Fast and Accurate Lane Detection",
    "abstract": "Lane detection is to determine the precise location and shape of lanes on the road. Despite efforts made by current methods, it remains a challenging task due to the complexity of real-world scenarios. Existing approaches, whether proposal-based or keypoint-based, suffer from depicting lanes effectively and efficiently. Proposal-based methods detect lanes by distinguishing and regressing a collection of proposals in a streamlined top-down way, yet lack sufficient flexibility in lane representation. Keypoint-based methods, on the other hand, construct lanes flexibly from local descriptors, which typically entail complicated post-processing. In this paper, we present a \"Sketch-and-Refine\" paradigm that utilizes the merits of both keypoint-based and proposal-based methods. The motivation is that local directions of lanes are semantically simple and clear. At the \"Sketch\" stage, local directions of keypoints can be easily estimated by fast convolutional layers. Then we can build a set of lane proposals accordingly with moderate accuracy. At the \"Refine\" stage, we further optimize these proposals via a novel Lane Segment Association Module (LSAM), which allows adaptive lane segment adjustment. Last but not least, we propose multi-level feature integration to enrich lane feature representations more efficiently. Based on the proposed \"Sketch and Refine\" paradigm, we propose a fast yet effective lane detector dubbed \"SRLane\". Experiments show that our SRLane can run at a fast speed (i.e., 278 FPS) while yielding an F1 score of 78.9\\%. The source code is available at: https://github.com/passerer/SRLane. ",
    "url": "https://arxiv.org/abs/2401.14729",
    "authors": [
      "Chao Chen",
      "Jie Liu",
      "Chang Zhou",
      "Jie Tang",
      "Gangshan Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.14732",
    "title": "Residual Quantization with Implicit Neural Codebooks",
    "abstract": "Vector quantization is a fundamental operation for data compression and vector search. To obtain high accuracy, multi-codebook methods increase the rate by representing each vector using codewords across multiple codebooks. Residual quantization (RQ) is one such method, which increases accuracy by iteratively quantizing the error of the previous step. The error distribution is dependent on previously selected codewords. This dependency is, however, not accounted for in conventional RQ as it uses a generic codebook per quantization step. In this paper, we propose QINCo, a neural RQ variant which predicts specialized codebooks per vector using a neural network that is conditioned on the approximation of the vector from previous steps. Experiments show that QINCo outperforms state-of-the-art methods by a large margin on several datasets and code sizes. For example, QINCo achieves better nearest-neighbor search accuracy using 12 bytes codes than other methods using 16 bytes on the BigANN and Deep1B dataset. ",
    "url": "https://arxiv.org/abs/2401.14732",
    "authors": [
      "Iris Huijben",
      "Matthijs Douze",
      "Matthew Muckley",
      "Ruud van Sloun",
      "Jakob Verbeek"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.14733",
    "title": "Personality Perception in Human Videos Altered by Motion Transfer  Networks",
    "abstract": "The successful portrayal of personality in digital characters improves communication and immersion. Current research focuses on expressing personality through modifying animations using heuristic rules or data-driven models. While studies suggest motion style highly influences the apparent personality, the role of appearance can be similarly essential. This work analyzes the influence of movement and appearance on the perceived personality of short videos altered by motion transfer networks. We label the personalities in conference video clips with a user study to determine the samples that best represent the Five-Factor model's high, neutral, and low traits. We alter these videos using the Thin-Plate Spline Motion Model, utilizing the selected samples as the source and driving inputs. We follow five different cases to study the influence of motion and appearance on personality perception. Our comparative study reveals that motion and appearance influence different factors: motion strongly affects perceived extraversion, and appearance helps convey agreeableness and neuroticism. ",
    "url": "https://arxiv.org/abs/2401.14733",
    "authors": [
      "Ayda Yurtoğlu",
      "Sinan Sonlu",
      "Yalım Doğan",
      "Uğur Güdükbay"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.14750",
    "title": "Decentralized Zeno-Free Event-Triggered Control For Multiple Networks  Subject to Stochastic Network Delays and Poisson Pulsing Attacks",
    "abstract": "By designing the decentralized time-regularized (Zeno-free) event-triggered strategies for the state-feedback control law, this paper considers the stochastic stabilization of a class of networked control systems, where two sources of randomness exist in multiple decentralized networks that operate asynchronously and independently: the communication channels are constrained by the stochastic network delays and also by Poisson pulsing denial-of-service (Pp-DoS) attacks. The time delay in the network denotes the length from a transmission instant to the corresponding update instant, and is supposed to be a continuous random variable subject to certain continuous probability distribution; while the attacks' cardinal number is a discrete random variable supposed to be subject to Poisson distribution, so the inter-attack time, i.e., the time between two consecutive attack instants, is subject to exponential distribution. The considered system is modeled as a stochastic hybrid formalism, where the randomness enters through the jump map into the reset value (the inter-attack time directly related) of each triggered strategy. By only sampling/transmitting state measurements when needed and simultaneously by taking the specific medium access protocols into account, the designed event-triggered strategies are synthesized in a state-based and decentralized form, which are robust (tolerable well) to stochastic network delays, under different tradeoff-conditions between the minimum inter-event times, maximum allowable delays (i.e., potentially tolerable delays) and the frequencies of attacks. Using stochastic hybrid tools to combine attack-active parts with attack-over parts, the designed triggered strategies, if designed well according to the actual system needs, can tolerate (be resilient to) the Pp-DoS attacks and stochastic network delays without jeopardizing the stability and Zeno-freeness. ",
    "url": "https://arxiv.org/abs/2401.14750",
    "authors": [
      "Dandan Zhang",
      "Sandra Hirche",
      "Stefan Sosnowski",
      "Xin Jin",
      "Hongye Su"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2401.14772",
    "title": "Spatial Transcriptomics Analysis of Zero-shot Gene Expression Prediction",
    "abstract": "Spatial transcriptomics (ST) captures gene expression within distinct regions (i.e., windows) of a tissue slide. Traditional supervised learning frameworks applied to model ST are constrained to predicting expression from slide image windows for gene types seen during training, failing to generalize to unseen gene types. To overcome this limitation, we propose a semantic guided network (SGN), a pioneering zero-shot framework for predicting gene expression from slide image windows. Considering a gene type can be described by functionality and phenotype, we dynamically embed a gene type to a vector per its functionality and phenotype, and employ this vector to project slide image windows to gene expression in feature space, unleashing zero-shot expression prediction for unseen gene types. The gene type functionality and phenotype are queried with a carefully designed prompt from a pre-trained large language model (LLM). On standard benchmark datasets, we demonstrate competitive zero-shot performance compared to past state-of-the-art supervised learning approaches. ",
    "url": "https://arxiv.org/abs/2401.14772",
    "authors": [
      "Yan Yang",
      "Md Zakir Hossain",
      "Xuesong Li",
      "Shafin Rahman",
      "Eric Stone"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.14780",
    "title": "Adversarial Attacks and Defenses in 6G Network-Assisted IoT Systems",
    "abstract": "The Internet of Things (IoT) and massive IoT systems are key to sixth-generation (6G) networks due to dense connectivity, ultra-reliability, low latency, and high throughput. Artificial intelligence, including deep learning and machine learning, offers solutions for optimizing and deploying cutting-edge technologies for future radio communications. However, these techniques are vulnerable to adversarial attacks, leading to degraded performance and erroneous predictions, outcomes unacceptable for ubiquitous networks. This survey extensively addresses adversarial attacks and defense methods in 6G network-assisted IoT systems. The theoretical background and up-to-date research on adversarial attacks and defenses are discussed. Furthermore, we provide Monte Carlo simulations to validate the effectiveness of adversarial attacks compared to jamming attacks. Additionally, we examine the vulnerability of 6G IoT systems by demonstrating attack strategies applicable to key technologies, including reconfigurable intelligent surfaces, massive multiple-input multiple-output (MIMO)/cell-free massive MIMO, satellites, the metaverse, and semantic communications. Finally, we outline the challenges and future developments associated with adversarial attacks and defenses in 6G IoT systems. ",
    "url": "https://arxiv.org/abs/2401.14780",
    "authors": [
      "Bui Duc Son",
      "Trinh Van Chien",
      "Waqas Khalid",
      "Mohamed Amine Ferrag",
      "Wan Choi",
      "Merouane Debbah"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2401.14792",
    "title": "Deep Variational Privacy Funnel: General Modeling with Applications in  Face Recognition",
    "abstract": "In this study, we harness the information-theoretic Privacy Funnel (PF) model to develop a method for privacy-preserving representation learning using an end-to-end training framework. We rigorously address the trade-off between obfuscation and utility. Both are quantified through the logarithmic loss, a measure also recognized as self-information loss. This exploration deepens the interplay between information-theoretic privacy and representation learning, offering substantive insights into data protection mechanisms for both discriminative and generative models. Importantly, we apply our model to state-of-the-art face recognition systems. The model demonstrates adaptability across diverse inputs, from raw facial images to both derived or refined embeddings, and is competent in tasks such as classification, reconstruction, and generation. ",
    "url": "https://arxiv.org/abs/2401.14792",
    "authors": [
      "Behrooz Razeghi",
      "Parsa Rahimi",
      "Sébastien Marcel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.14805",
    "title": "Pointwise Redundancy in One-Shot Lossy Compression via Poisson  Functional Representation",
    "abstract": "We study different notions of pointwise redundancy in variable-length lossy source coding. We present a construction of one-shot variable-length lossy source coding schemes using the Poisson functional representation, and give bounds on its pointwise redundancy for various definitions of pointwise redundancy. This allows us to describe the distribution of the encoding length in a precise manner. We also generalize the result to the one-shot lossy Gray-Wyner system. ",
    "url": "https://arxiv.org/abs/2401.14805",
    "authors": [
      "Cheuk Ting Li"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2401.14823",
    "title": "A Deep Reinforcement Learning-based Approach for Adaptive Handover  Protocols in Mobile Networks",
    "abstract": "Due to an ever-increasing number of participants and new areas of application, the demands on mobile communications systems are continually increasing. In order to deliver higher data rates, enable mobility and guarantee QoS requirements of subscribers, these systems and the protocols used are becoming more complex. By using higher frequency spectrums, cells become smaller and more base stations have to be deployed. This leads to an increased number of handovers of user equipments between base stations in order to enable mobility, resulting in potentially more frequent radio link failures and rate reduction. The persistent switching between the same base stations, commonly referred to as \"ping-pong\", leads to a consistent reduction of data rates. In this work, we propose a method for handover optimization by using proximal policy optimization in mobile communications to learn an adaptive handover protocol. The resulting agent is highly flexible regarding different travelling speeds of user equipments, while outperforming the standard 5G NR handover protocol by 3GPP in terms of average data rate and number of radio link failures. Furthermore, the design of the proposed environment demonstrates remarkable accuracy, ensuring a fair comparison with the standard 3GPP protocol. ",
    "url": "https://arxiv.org/abs/2401.14823",
    "authors": [
      "Peter J. Gu",
      "Johannes Voigt",
      "Peter M. Rost"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2401.14825",
    "title": "Keeping the Harmony Between Neighbors: Local Fairness in Graph Fair  Division",
    "abstract": "We study the problem of allocating indivisible resources under the connectivity constraints of a graph $G$. This model, initially introduced by Bouveret et al. (published in IJCAI, 2017), effectively encompasses a diverse array of scenarios characterized by spatial or temporal limitations, including the division of land plots and the allocation of time plots. In this paper, we introduce a novel fairness concept that integrates local comparisons within the social network formed by a connected allocation of the item graph. Our particular focus is to achieve pairwise-maximin fair share (PMMS) among the \"neighbors\" within this network. For any underlying graph structure, we show that a connected allocation that maximizes Nash welfare guarantees a $(1/2)$-PMMS fairness. Moreover, for two agents, we establish that a $(3/4)$-PMMS allocation can be efficiently computed. Additionally, we demonstrate that for three agents and the items aligned on a path, a PMMS allocation is always attainable and can be computed in polynomial time. Lastly, when agents have identical additive utilities, we present a pseudo-polynomial-time algorithm for a $(3/4)$-PMMS allocation, irrespective of the underlying graph $G$. Furthermore, we provide a polynomial-time algorithm for obtaining a PMMS allocation when $G$ is a tree. ",
    "url": "https://arxiv.org/abs/2401.14825",
    "authors": [
      "Halvard Hummel",
      "Ayumi Igarashi"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Data Structures and Algorithms (cs.DS)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2401.14846",
    "title": "Understanding Domain Generalization: A Noise Robustness Perspective",
    "abstract": "Despite the rapid development of machine learning algorithms for domain generalization (DG), there is no clear empirical evidence that the existing DG algorithms outperform the classic empirical risk minimization (ERM) across standard benchmarks. To better understand this phenomenon, we investigate whether there are benefits of DG algorithms over ERM through the lens of label noise. Specifically, our finite-sample analysis reveals that label noise exacerbates the effect of spurious correlations for ERM, undermining generalization. Conversely, we illustrate that DG algorithms exhibit implicit label-noise robustness during finite-sample training even when spurious correlation is present. Such desirable property helps mitigate spurious correlations and improve generalization in synthetic experiments. However, additional comprehensive experiments on real-world benchmark datasets indicate that label-noise robustness does not necessarily translate to better performance compared to ERM. We conjecture that the failure mode of ERM arising from spurious correlations may be less pronounced in practice. ",
    "url": "https://arxiv.org/abs/2401.14846",
    "authors": [
      "Rui Qiao",
      "Bryan Kian Hsiang Low"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.14861",
    "title": "Implicit Neural Representation for Physics-driven Actuated Soft Bodies",
    "abstract": "Active soft bodies can affect their shape through an internal actuation mechanism that induces a deformation. Similar to recent work, this paper utilizes a differentiable, quasi-static, and physics-based simulation layer to optimize for actuation signals parameterized by neural networks. Our key contribution is a general and implicit formulation to control active soft bodies by defining a function that enables a continuous mapping from a spatial point in the material space to the actuation value. This property allows us to capture the signal's dominant frequencies, making the method discretization agnostic and widely applicable. We extend our implicit model to mandible kinematics for the particular case of facial animation and show that we can reliably reproduce facial expressions captured with high-quality capture systems. We apply the method to volumetric soft bodies, human poses, and facial expressions, demonstrating artist-friendly properties, such as simple control over the latent space and resolution invariance at test time. ",
    "url": "https://arxiv.org/abs/2401.14861",
    "authors": [
      "Lingchen Yang",
      "Byungsoo Kim",
      "Gaspard Zoss",
      "Baran Gözcü",
      "Markus Gross",
      "Barbara Solenthaler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2401.14876",
    "title": "Cross-Space Adaptive Filter: Integrating Graph Topology and Node  Attributes for Alleviating the Over-smoothing Problem",
    "abstract": "The vanilla Graph Convolutional Network (GCN) uses a low-pass filter to extract low-frequency signals from graph topology, which may lead to the over-smoothing problem when GCN goes deep. To this end, various methods have been proposed to create an adaptive filter by incorporating an extra filter (e.g., a high-pass filter) extracted from the graph topology. However, these methods heavily rely on topological information and ignore the node attribute space, which severely sacrifices the expressive power of the deep GCNs, especially when dealing with disassortative graphs. In this paper, we propose a cross-space adaptive filter, called CSF, to produce the adaptive-frequency information extracted from both the topology and attribute spaces. Specifically, we first derive a tailored attribute-based high-pass filter that can be interpreted theoretically as a minimizer for semi-supervised kernel ridge regression. Then, we cast the topology-based low-pass filter as a Mercer's kernel within the context of GCNs. This serves as a foundation for combining it with the attribute-based filter to capture the adaptive-frequency information. Finally, we derive the cross-space filter via an effective multiple-kernel learning strategy, which unifies the attribute-based high-pass filter and the topology-based low-pass filter. This helps to address the over-smoothing problem while maintaining effectiveness. Extensive experiments demonstrate that CSF not only successfully alleviates the over-smoothing problem but also promotes the effectiveness of the node classification task. ",
    "url": "https://arxiv.org/abs/2401.14876",
    "authors": [
      "Chen Huang",
      "Haoyang Li",
      "Yifan Zhang",
      "Wenqiang Lei",
      "Jiancheng Lv"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.14879",
    "title": "Fast Long-Term Multi-Scenario Prediction for Maneuver Planning at  Unsignalized Intersections",
    "abstract": "Motion prediction for intelligent vehicles typically focuses on estimating the most probable future evolutions of a traffic scenario. Estimating the gap acceptance, i.e., whether a vehicle merges or crosses before another vehicle with the right of way, is often handled implicitly in the prediction. However, an infrastructure-based maneuver planning can assign artificial priorities between cooperative vehicles, so it needs to evaluate many more potential scenarios. Additionally, the prediction horizon has to be long enough to assess the impact of a maneuver. We, therefore, present a novel long-term prediction approach handling the gap acceptance estimation and the velocity prediction in two separate stages. Thereby, the behavior of regular vehicles as well as priority assignments of cooperative vehicles can be considered. We train both stages on real-world traffic observations to achieve realistic prediction results. Our method has a competitive accuracy and is fast enough to predict a multitude of scenarios in a short time, making it suitable to be used in a maneuver planning framework. ",
    "url": "https://arxiv.org/abs/2401.14879",
    "authors": [
      "Max Bastian Mertens",
      "Jona Ruof",
      "Jan Strohbeck",
      "Michael Buchholz"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2401.14886",
    "title": "Coca: Improving and Explaining Graph Neural Network-Based Vulnerability  Detection Systems",
    "abstract": "Recently, Graph Neural Network (GNN)-based vulnerability detection systems have achieved remarkable success. However, the lack of explainability poses a critical challenge to deploy black-box models in security-related domains. For this reason, several approaches have been proposed to explain the decision logic of the detection model by providing a set of crucial statements positively contributing to its predictions. Unfortunately, due to the weakly-robust detection models and suboptimal explanation strategy, they have the danger of revealing spurious correlations and redundancy issue. In this paper, we propose Coca, a general framework aiming to 1) enhance the robustness of existing GNN-based vulnerability detection models to avoid spurious explanations; and 2) provide both concise and effective explanations to reason about the detected vulnerabilities. \\sysname consists of two core parts referred to as Trainer and Explainer. The former aims to train a detection model which is robust to random perturbation based on combinatorial contrastive learning, while the latter builds an explainer to derive crucial code statements that are most decisive to the detected vulnerability via dual-view causal inference as explanations. We apply Coca over three typical GNN-based vulnerability detectors. Experimental results show that Coca can effectively mitigate the spurious correlation issue, and provide more useful high-quality explanations. ",
    "url": "https://arxiv.org/abs/2401.14886",
    "authors": [
      "Sicong Cao",
      "Xiaobing Sun",
      "Xiaoxue Wu",
      "David Lo",
      "Lili Bo",
      "Bin Li",
      "Wei Liu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2401.14901",
    "title": "Augmenting Bankruptcy Prediction using Reported Behavior of Corporate  Restructuring",
    "abstract": "Credit risk assessment of a company is commonly conducted by utilizing financial ratios that are derived from its financial statements. However, this approach may not fully encompass other significant aspects of a company. We propose the utilization of a hybrid dataset that combines financial statements with information about corporate restructuring behavior in order to construct diverse machine learning models to predict bankruptcy. Utilizing a hybrid data set provides a more comprehensive and holistic perspective on a company's financial position and the dynamics of its business operations. The experiments were carried out using publicly available records of all the files submitted by small and medium-sized enterprises to Luxembourg Business Registers. We conduct a comparative analysis of bankruptcy prediction using six machine learning models. Furthermore, we validate the effectiveness of the hybrid dataset. In addition to the conventional testing set, we deliberately chose the timeframe encompassing the years of the Covid-19 pandemic as an additional testing set in order to evaluate the robustness of the models. The experimental results demonstrate that the hybrid data set can improve the performance of the model by 4%-13% compared to a single source data set. We also identify suitable models for predicting bankruptcy. ",
    "url": "https://arxiv.org/abs/2401.14901",
    "authors": [
      "Xinlin Wang",
      "Mats Brorsson"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2401.14919",
    "title": "PARSAC: Accelerating Robust Multi-Model Fitting with Parallel Sample  Consensus",
    "abstract": "We present a real-time method for robust estimation of multiple instances of geometric models from noisy data. Geometric models such as vanishing points, planar homographies or fundamental matrices are essential for 3D scene analysis. Previous approaches discover distinct model instances in an iterative manner, thus limiting their potential for speedup via parallel computation. In contrast, our method detects all model instances independently and in parallel. A neural network segments the input data into clusters representing potential model instances by predicting multiple sets of sample and inlier weights. Using the predicted weights, we determine the model parameters for each potential instance separately in a RANSAC-like fashion. We train the neural network via task-specific loss functions, i.e. we do not require a ground-truth segmentation of the input data. As suitable training data for homography and fundamental matrix fitting is scarce, we additionally present two new synthetic datasets. We demonstrate state-of-the-art performance on these as well as multiple established datasets, with inference times as small as five milliseconds per image. ",
    "url": "https://arxiv.org/abs/2401.14919",
    "authors": [
      "Florian Kluger",
      "Bodo Rosenhahn"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.14936",
    "title": "Reassessing Java Code Readability Models with a Human-Centered Approach",
    "abstract": "To ensure that Large Language Models (LLMs) effectively support user productivity, they need to be adjusted. Existing Code Readability (CR) models can guide this alignment. However, there are concerns about their relevance in modern software engineering since they often miss the developers' notion of readability and rely on outdated code. This research assesses existing Java CR models for LLM adjustments, measuring the correlation between their and developers' evaluations of AI-generated Java code. Using the Repertory Grid Technique with 15 developers, we identified 12 key code aspects influencing CR that were consequently assessed by 390 programmers when labeling 120 AI-generated snippets. Our findings indicate that when AI generates concise and executable code, it is often considered readable by CR models and developers. However, a limited correlation between these evaluations underscores the importance of future research on learning objectives for adjusting LLMs and on the aspects influencing CR evaluations included in predictive models. ",
    "url": "https://arxiv.org/abs/2401.14936",
    "authors": [
      "Agnia Sergeyuk",
      "Olga Lvova",
      "Sergey Titov",
      "Anastasiia Serova",
      "Farid Bagirov",
      "Evgeniia Kirillova",
      "Timofey Bryksin"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2401.14939",
    "title": "Macro Graph Neural Networks for Online Billion-Scale Recommender Systems",
    "abstract": "Predicting Click-Through Rate (CTR) in billion-scale recommender systems poses a long-standing challenge for Graph Neural Networks (GNNs) due to the overwhelming computational complexity involved in aggregating billions of neighbors. To tackle this, GNN-based CTR models usually sample hundreds of neighbors out of the billions to facilitate efficient online recommendations. However, sampling only a small portion of neighbors results in a severe sampling bias and the failure to encompass the full spectrum of user or item behavioral patterns. To address this challenge, we name the conventional user-item recommendation graph as \"micro recommendation graph\" and introduce a more suitable MAcro Recommendation Graph (MAG) for billion-scale recommendations. MAG resolves the computational complexity problems in the infrastructure by reducing the node count from billions to hundreds. Specifically, MAG groups micro nodes (users and items) with similar behavior patterns to form macro nodes. Subsequently, we introduce tailored Macro Graph Neural Networks (MacGNN) to aggregate information on a macro level and revise the embeddings of macro nodes. MacGNN has already served Taobao's homepage feed for two months, providing recommendations for over one billion users. Extensive offline experiments on three public benchmark datasets and an industrial dataset present that MacGNN significantly outperforms twelve CTR baselines while remaining computationally efficient. Besides, online A/B tests confirm MacGNN's superiority in billion-scale recommender systems. ",
    "url": "https://arxiv.org/abs/2401.14939",
    "authors": [
      "Hao Chen",
      "Yuanchen Bei",
      "Qijie Shen",
      "Yue Xu",
      "Sheng Zhou",
      "Wenbing Huang",
      "Feiran Huang",
      "Senzhang Wang",
      "Xiao Huang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2401.14948",
    "title": "Conserve-Update-Revise to Cure Generalization and Robustness Trade-off  in Adversarial Training",
    "abstract": "Adversarial training improves the robustness of neural networks against adversarial attacks, albeit at the expense of the trade-off between standard and robust generalization. To unveil the underlying factors driving this phenomenon, we examine the layer-wise learning capabilities of neural networks during the transition from a standard to an adversarial setting. Our empirical findings demonstrate that selectively updating specific layers while preserving others can substantially enhance the network's learning capacity. We therefore propose CURE, a novel training framework that leverages a gradient prominence criterion to perform selective conservation, updating, and revision of weights. Importantly, CURE is designed to be dataset- and architecture-agnostic, ensuring its applicability across various scenarios. It effectively tackles both memorization and overfitting issues, thus enhancing the trade-off between robustness and generalization and additionally, this training approach also aids in mitigating \"robust overfitting\". Furthermore, our study provides valuable insights into the mechanisms of selective adversarial training and offers a promising avenue for future research. ",
    "url": "https://arxiv.org/abs/2401.14948",
    "authors": [
      "Shruthi Gowda",
      "Bahram Zonooz",
      "Elahe Arani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.14961",
    "title": "End-To-End Set-Based Training for Neural Network Verification",
    "abstract": "Neural networks are vulnerable to adversarial attacks, i.e., small input perturbations can result in substantially different outputs of a neural network. Safety-critical environments require neural networks that are robust against input perturbations. However, training and formally verifying robust neural networks is challenging. We address this challenge by employing, for the first time, a end-to-end set-based training procedure that trains robust neural networks for formal verification. Our training procedure drastically simplifies the subsequent formal robustness verification of the trained neural network. While previous research has predominantly focused on augmenting neural network training with adversarial attacks, our approach leverages set-based computing to train neural networks with entire sets of perturbed inputs. Moreover, we demonstrate that our set-based training procedure effectively trains robust neural networks, which are easier to verify. In many cases, set-based trained neural networks outperform neural networks trained with state-of-the-art adversarial attacks. ",
    "url": "https://arxiv.org/abs/2401.14961",
    "authors": [
      "Lukas Koller",
      "Tobias Ladner",
      "Matthias Althoff"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2401.14963",
    "title": "On the Hardness of Gray Code Problems for Combinatorial Objects",
    "abstract": "Can a list of binary strings be ordered so that consecutive strings differ in a single bit? Can a list of permutations be ordered so that consecutive permutations differ by a swap? Can a list of non-crossing set partitions be ordered so that consecutive partitions differ by refinement? These are examples of Gray coding problems: Can a list of combinatorial objects (of a particular type and size) be ordered so that consecutive objects differ by a flip (of a particular type)? For example, 000, 001, 010, 100 is a no instance of the first question, while 1234, 1324, 1243 is a yes instance of the second question due to the order 1243, 1234, 1324. We prove that a variety of Gray coding problems are NP-complete using a new tool we call a Gray code reduction. ",
    "url": "https://arxiv.org/abs/2401.14963",
    "authors": [
      "Arturo Merino",
      "Namrata",
      "Aaron Williams"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2401.14978",
    "title": "Robust Dual-Modal Speech Keyword Spotting for XR Headsets",
    "abstract": "While speech interaction finds widespread utility within the Extended Reality (XR) domain, conventional vocal speech keyword spotting systems continue to grapple with formidable challenges, including suboptimal performance in noisy environments, impracticality in situations requiring silence, and susceptibility to inadvertent activations when others speak nearby. These challenges, however, can potentially be surmounted through the cost-effective fusion of voice and lip movement information. Consequently, we propose a novel vocal-echoic dual-modal keyword spotting system designed for XR headsets. We devise two different modal fusion approches and conduct experiments to test the system's performance across diverse scenarios. The results show that our dual-modal system not only consistently outperforms its single-modal counterparts, demonstrating higher precision in both typical and noisy environments, but also excels in accurately identifying silent utterances. Furthermore, we have successfully applied the system in real-time demonstrations, achieving promising results. The code is available at https://github.com/caizhuojiang/VE-KWS. ",
    "url": "https://arxiv.org/abs/2401.14978",
    "authors": [
      "Zhuojiang Cai",
      "Yuhan Ma",
      "Feng Lu"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Multimedia (cs.MM)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2401.14979",
    "title": "Creating a vulnerable node based on the vulnerability MS17-010",
    "abstract": "The creation of a vulnerable node has been demonstrated through the analysis and implementation of the MS17-010 (CVE-2017-0144) vulnerability, affecting the SMBv1 protocol on various Windows operating systems. The principle and methodology of exploiting the vulnerability are described, with a formalized representation of the exploitation in the form of a Meta Attack Language (MAL) graph. Additionally, the attacker's implementation is outlined as the execution of an automated script in Python using the Metasploit Framework. Basic security measures for systems utilizing the SMBv1 protocol are provided. ",
    "url": "https://arxiv.org/abs/2401.14979",
    "authors": [
      "Aleksey Novokhrestov",
      "Anton Kalyakin",
      "Aleksandr Kovalenko",
      "Vladimir Repkin"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.15002",
    "title": "BackdoorBench: A Comprehensive Benchmark and Analysis of Backdoor  Learning",
    "abstract": "As an emerging and vital topic for studying deep neural networks' vulnerability (DNNs), backdoor learning has attracted increasing interest in recent years, and many seminal backdoor attack and defense algorithms are being developed successively or concurrently, in the status of a rapid arms race. However, mainly due to the diverse settings, and the difficulties of implementation and reproducibility of existing works, there is a lack of a unified and standardized benchmark of backdoor learning, causing unfair comparisons, and unreliable conclusions (e.g., misleading, biased or even false conclusions). Consequently, it is difficult to evaluate the current progress and design the future development roadmap of this literature. To alleviate this dilemma, we build a comprehensive benchmark of backdoor learning called BackdoorBench. Our benchmark makes three valuable contributions to the research community. 1) We provide an integrated implementation of state-of-the-art (SOTA) backdoor learning algorithms (currently including 16 attack and 27 defense algorithms), based on an extensible modular-based codebase. 2) We conduct comprehensive evaluations of 12 attacks against 16 defenses, with 5 poisoning ratios, based on 4 models and 4 datasets, thus 11,492 pairs of evaluations in total. 3) Based on above evaluations, we present abundant analysis from 8 perspectives via 18 useful analysis tools, and provide several inspiring insights about backdoor learning. We hope that our efforts could build a solid foundation of backdoor learning to facilitate researchers to investigate existing algorithms, develop more innovative algorithms, and explore the intrinsic mechanism of backdoor learning. Finally, we have created a user-friendly website at this http URL, which collects all important information of BackdoorBench, including codebase, docs, leaderboard, and model Zoo. ",
    "url": "https://arxiv.org/abs/2401.15002",
    "authors": [
      "Baoyuan Wu",
      "Hongrui Chen",
      "Mingda Zhang",
      "Zihao Zhu",
      "Shaokui Wei",
      "Danni Yuan",
      "Mingli Zhu",
      "Ruotong Wang",
      "Li Liu",
      "Chao Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.15029",
    "title": "Learning Neural Radiance Fields of Forest Structure for Scalable and  Fine Monitoring",
    "abstract": "This work leverages neural radiance fields and remote sensing for forestry applications. Here, we show neural radiance fields offer a wide range of possibilities to improve upon existing remote sensing methods in forest monitoring. We present experiments that demonstrate their potential to: (1) express fine features of forest 3D structure, (2) fuse available remote sensing modalities and (3), improve upon 3D structure derived forest metrics. Altogether, these properties make neural fields an attractive computational tool with great potential to further advance the scalability and accuracy of forest monitoring programs. ",
    "url": "https://arxiv.org/abs/2401.15029",
    "authors": [
      "Juan Castorena"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.15030",
    "title": "On the generalization capacity of neural networks during generic  multimodal reasoning",
    "abstract": "The advent of the Transformer has led to the development of large language models (LLM), which appear to demonstrate human-like capabilities. To assess the generality of this class of models and a variety of other base neural network architectures to multimodal domains, we evaluated and compared their capacity for multimodal generalization. We introduce a multimodal question-answer benchmark to evaluate three specific types of out-of-distribution (OOD) generalization performance: distractor generalization (generalization in the presence of distractors), systematic compositional generalization (generalization to new task permutations), and productive compositional generalization (generalization to more complex tasks structures). We found that across model architectures (e.g., RNNs, Transformers, Perceivers, etc.), models with multiple attention layers, or models that leveraged cross-attention mechanisms between input domains, fared better. Our positive results demonstrate that for multimodal distractor and systematic generalization, either cross-modal attention or models with deeper attention layers are key architectural features required to integrate multimodal inputs. On the other hand, neither of these architectural features led to productive generalization, suggesting fundamental limitations of existing architectures for specific types of multimodal generalization. These results demonstrate the strengths and limitations of specific architectural components underlying modern neural models for multimodal reasoning. Finally, we provide Generic COG (gCOG), a configurable benchmark with several multimodal generalization splits, for future studies to explore. ",
    "url": "https://arxiv.org/abs/2401.15030",
    "authors": [
      "Takuya Ito",
      "Soham Dan",
      "Mattia Rigotti",
      "James Kozloski",
      "Murray Campbell"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.15041",
    "title": "Computationally Bounded Robust Compilation and Universally Composable  Security",
    "abstract": "Universal Composability (UC) is the gold standard for cryptographic security, but mechanizing proofs of UC is notoriously difficult. A recently-discovered connection between UC and Robust Compilation (RC)$\\unicode{x2014}$a novel theory of secure compilation$\\unicode{x2014}$provides a means to verify UC proofs using tools that mechanize equality results. Unfortunately, the existing methods apply only to perfect UC security, and real-world protocols relying on cryptography are only computationally secure. This paper addresses this gap by lifting the connection between UC and RC to the computational setting, extending techniques from the RC setting to apply to computational UC security. Moreover, it further generalizes the UC$\\unicode{x2013}$RC connection beyond computational security to arbitrary equalities, providing a framework to subsume the existing perfect case, and to instantiate future theories with more complex notions of security. This connection allows the use of tools for proofs of computational indistinguishability to properly mechanize proofs of computational UC security. We demonstrate this power by using CryptoVerif to mechanize a proof that parts of the Wireguard protocol are computationally UC secure. Finally, all proofs of the framework itself are verified in Isabelle/HOL. ",
    "url": "https://arxiv.org/abs/2401.15041",
    "authors": [
      "Robert Künnemann",
      "Marco Patrignani",
      "Ethan Cecchetti"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2401.15045",
    "title": "Emulating Complex Synapses Using Interlinked Proton Conductors",
    "abstract": "In terms of energy efficiency and computational speed, neuromorphic electronics based on non-volatile memory devices is expected to be one of most promising hardware candidates for future artificial intelligence (AI). However, catastrophic forgetting, networks rapidly overwriting previously learned weights when learning new tasks, remains as a pivotal hurdle in either digital or analog AI chips for unleashing the true power of brain-like computing. To address catastrophic forgetting in the context of online memory storage, a complex synapse model (the Benna-Fusi model) has been proposed recently[1], whose synaptic weight and internal variables evolve following a diffusion dynamics. In this work, by designing a proton transistor with a series of charge-diffusion-controlled storage components, we have experimentally realized the Benna-Fusi artificial complex synapse. The memory consolidation from coupled storage components is revealed by both numerical simulations and experimental observations. Different memory timescales for the complex synapse are engineered by the diffusion length of charge carriers, the capacity and number of coupled storage components. The advantage of the demonstrated complex synapse in both memory capacity and memory consolidation is revealed by neural network simulations of face familiarity detection. Our experimental realization of the complex synapse suggests a promising approach to enhance memory capacity and to enable continual learning. ",
    "url": "https://arxiv.org/abs/2401.15045",
    "authors": [
      "Lifu Zhang",
      "Ji-An Li",
      "Yang Hu",
      "Jie Jiang",
      "Rongjie Lai",
      "Marcus K. Benna",
      "Jian Shi"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2401.15055",
    "title": "Deep learning-based approach for tomato classification in complex scenes",
    "abstract": "Tracking ripening tomatoes is time consuming and labor intensive. Artificial intelligence technologies combined with those of computer vision can help users optimize the process of monitoring the ripening status of plants. To this end, we have proposed a tomato ripening monitoring approach based on deep learning in complex scenes. The objective is to detect mature tomatoes and harvest them in a timely manner. The proposed approach is declined in two parts. Firstly, the images of the scene are transmitted to the pre-processing layer. This process allows the detection of areas of interest (area of the image containing tomatoes). Then, these images are used as input to the maturity detection layer. This layer, based on a deep neural network learning algorithm, classifies the tomato thumbnails provided to it in one of the following five categories: green, brittle, pink, pale red, mature red. The experiments are based on images collected from the internet gathered through searches using tomato state across diverse languages including English, German, French, and Spanish. The experimental results of the maturity detection layer on a dataset composed of images of tomatoes taken under the extreme conditions, gave a good classification rate. ",
    "url": "https://arxiv.org/abs/2401.15055",
    "authors": [
      "Mikael A. Mousse",
      "Bethel C. A. R. K. Atohoun",
      "Cina Motamed"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.15061",
    "title": "Digital-analog hybrid matrix multiplication processor for optical neural  networks",
    "abstract": "The computational demands of modern AI have spurred interest in optical neural networks (ONNs) which offer the potential benefits of increased speed and lower power consumption. However, current ONNs face various challenges,most significantly a limited calculation precision (typically around 4 bits) and the requirement for high-resolution signal format converters (digital-to-analogue conversions (DACs) and analogue-to-digital conversions (ADCs)). These challenges are inherent to their analog computing nature and pose significant obstacles in practical implementation. Here, we propose a digital-analog hybrid optical computing architecture for ONNs, which utilizes digital optical inputs in the form of binary words. By introducing the logic levels and decisions based on thresholding, the calculation precision can be significantly enhanced. The DACs for input data can be removed and the resolution of the ADCs can be greatly reduced. This can increase the operating speed at a high calculation precision and facilitate the compatibility with microelectronics. To validate our approach, we have fabricated a proof-of-concept photonic chip and built up a hybrid optical processor (HOP) system for neural network applications. We have demonstrated an unprecedented 16-bit calculation precision for high-definition image processing, with a pixel error rate (PER) as low as $1.8\\times10^{-3}$ at an signal-to-noise ratio (SNR) of 18.2 dB. We have also implemented a convolutional neural network for handwritten digit recognition that shows the same accuracy as the one achieved by a desktop computer. The concept of the digital-analog hybrid optical computing architecture offers a methodology that could potentially be applied to various ONN implementations and may intrigue new research into efficient and accurate domain-specific optical computing architectures for neural networks. ",
    "url": "https://arxiv.org/abs/2401.15061",
    "authors": [
      "Xiansong Meng",
      "Deming Kong",
      "Kwangwoong Kim",
      "Qiuchi Li",
      "Po Dong",
      "Ingemar J. Cox",
      "Christina Lioma",
      "Hao Hu"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Emerging Technologies (cs.ET)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2401.15068",
    "title": "Pairing Orthographically Variant Literary Words to Standard Equivalents  Using Neural Edit Distance Models",
    "abstract": "We present a novel corpus consisting of orthographically variant words found in works of 19th century U.S. literature annotated with their corresponding \"standard\" word pair. We train a set of neural edit distance models to pair these variants with their standard forms, and compare the performance of these models to the performance of a set of neural edit distance models trained on a corpus of orthographic errors made by L2 English learners. Finally, we analyze the relative performance of these models in the light of different negative training sample generation strategies, and offer concluding remarks on the unique challenge literary orthographic variation poses to string pairing methodologies. ",
    "url": "https://arxiv.org/abs/2401.15068",
    "authors": [
      "Craig Messner",
      "Tom Lippincott"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.15071",
    "title": "From GPT-4 to Gemini and Beyond: Assessing the Landscape of MLLMs on  Generalizability, Trustworthiness and Causality through Four Modalities",
    "abstract": "Multi-modal Large Language Models (MLLMs) have shown impressive abilities in generating reasonable responses with respect to multi-modal contents. However, there is still a wide gap between the performance of recent MLLM-based applications and the expectation of the broad public, even though the most powerful OpenAI's GPT-4 and Google's Gemini have been deployed. This paper strives to enhance understanding of the gap through the lens of a qualitative study on the generalizability, trustworthiness, and causal reasoning capabilities of recent proprietary and open-source MLLMs across four modalities: ie, text, code, image, and video, ultimately aiming to improve the transparency of MLLMs. We believe these properties are several representative factors that define the reliability of MLLMs, in supporting various downstream applications. To be specific, we evaluate the closed-source GPT-4 and Gemini and 6 open-source LLMs and MLLMs. Overall we evaluate 230 manually designed cases, where the qualitative results are then summarized into 12 scores (ie, 4 modalities times 3 properties). In total, we uncover 14 empirical findings that are useful to understand the capabilities and limitations of both proprietary and open-source MLLMs, towards more reliable downstream multi-modal applications. ",
    "url": "https://arxiv.org/abs/2401.15071",
    "authors": [
      "Chaochao Lu",
      "Chen Qian",
      "Guodong Zheng",
      "Hongxing Fan",
      "Hongzhi Gao",
      "Jie Zhang",
      "Jing Shao",
      "Jingyi Deng",
      "Jinlan Fu",
      "Kexin Huang",
      "Kunchang Li",
      "Lijun Li",
      "Limin Wang",
      "Lu Sheng",
      "Meiqi Chen",
      "Ming Zhang",
      "Qibing Ren",
      "Sirui Chen",
      "Tao Gui",
      "Wanli Ouyang",
      "Yali Wang",
      "Yan Teng",
      "Yaru Wang",
      "Yi Wang",
      "Yinan He",
      "Yingchun Wang",
      "Yixu Wang",
      "Yongting Zhang",
      "Yu Qiao",
      "Yujiong Shen",
      "Yurong Mou",
      "Yuxi Chen",
      "Zaibin Zhang",
      "Zhelun Shi",
      "Zhenfei Yin",
      "Zhipin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.14414",
    "title": "Fuzzy Logic-Based System for Brain Tumour Detection and Classification",
    "abstract": "Brain Tumours (BT) are extremely dangerous and difficult to treat. Currently, doctors must manually examine images and manually mark out tumour regions to diagnose BT; this process is time-consuming and error-prone. In recent times, experts have proposed automating approaches for detecting BT at an early stage. The poor accuracy and highly incorrect prediction results of these methods caused them to start the research. In this study, we suggest a fuzzy logic-based system for categorising BT. This study used a dataset of 253 Magnetic Resonance Imaging (MRI) brain images that included tumour and healthy images. The images were first pre-processed. After that, we pull out features like tumour size and the image's global threshold value. The watershed and region-growing approach is used to calculate the tumour size. After that, the fuzzy system receives the two features as input. Accuracy, F1-score, precision, and recall are used to assess the results of the fuzzy by employing both size determination approaches. With the size input variable discovered by the region growth method and global threshold values, the fuzzy system outperforms the watershed method. The significance of this research lies in its potential to revolutionize brain tumour diagnosis by offering a more accurate and efficient automated classification system. By reducing human intervention and providing reliable results, this approach could assist medical professionals in making timely and precise decisions, leading to improved patient outcomes and potentially saving lives. The advancement of such automated techniques has the potential to pave the way for enhanced medical imaging analysis and, ultimately, better management of brain tumour cases. ",
    "url": "https://arxiv.org/abs/2401.14414",
    "authors": [
      "NVSL Narasimham",
      "Keshav Kumar K"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2401.14416",
    "title": "Acoustic characterization of speech rhythm: going beyond metrics with  recurrent neural networks",
    "abstract": "Languages have long been described according to their perceived rhythmic attributes. The associated typologies are of interest in psycholinguistics as they partly predict newborns' abilities to discriminate between languages and provide insights into how adult listeners process non-native languages. Despite the relative success of rhythm metrics in supporting the existence of linguistic rhythmic classes, quantitative studies have yet to capture the full complexity of temporal regularities associated with speech rhythm. We argue that deep learning offers a powerful pattern-recognition approach to advance the characterization of the acoustic bases of speech rhythm. To explore this hypothesis, we trained a medium-sized recurrent neural network on a language identification task over a large database of speech recordings in 21 languages. The network had access to the amplitude envelopes and a variable identifying the voiced segments, assuming that this signal would poorly convey phonetic information but preserve prosodic features. The network was able to identify the language of 10-second recordings in 40% of the cases, and the language was in the top-3 guesses in two-thirds of the cases. Visualization methods show that representations built from the network activations are consistent with speech rhythm typologies, although the resulting maps are more complex than two separated clusters between stress and syllable-timed languages. We further analyzed the model by identifying correlations between network activations and known speech rhythm metrics. The findings illustrate the potential of deep learning tools to advance our understanding of speech rhythm through the identification and exploration of linguistically relevant acoustic feature spaces. ",
    "url": "https://arxiv.org/abs/2401.14416",
    "authors": [
      "François Deloche",
      "Laurent Bonnasse-Gahot",
      "Judit Gervain"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2401.14442",
    "title": "Improving Antibody Humanness Prediction using Patent Data",
    "abstract": "We investigate the potential of patent data for improving the antibody humanness prediction using a multi-stage, multi-loss training process. Humanness serves as a proxy for the immunogenic response to antibody therapeutics, one of the major causes of attrition in drug discovery and a challenging obstacle for their use in clinical settings. We pose the initial learning stage as a weakly-supervised contrastive-learning problem, where each antibody sequence is associated with possibly multiple identifiers of function and the objective is to learn an encoder that groups them according to their patented properties. We then freeze a part of the contrastive encoder and continue training it on the patent data using the cross-entropy loss to predict the humanness score of a given antibody sequence. We illustrate the utility of the patent data and our approach by performing inference on three different immunogenicity datasets, unseen during training. Our empirical results demonstrate that the learned model consistently outperforms the alternative baselines and establishes new state-of-the-art on five out of six inference tasks, irrespective of the used metric. ",
    "url": "https://arxiv.org/abs/2401.14442",
    "authors": [
      "Talip Ucar",
      "Aubin Ramon",
      "Dino Oglic",
      "Rebecca Croasdale-Wood",
      "Tom Diethe",
      "Pietro Sormanni"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.14657",
    "title": "Validating Climate Models with Spherical Convolutional Wasserstein  Distance",
    "abstract": "The validation of global climate models is crucial to ensure the accuracy and efficacy of model output. We introduce the spherical convolutional Wasserstein distance to more comprehensively measure differences between climate models and reanalysis data. This new similarity measure accounts for spatial variability using convolutional projections and quantifies local differences in the distribution of climate variables. We apply this method to evaluate the historical model outputs of the Coupled Model Intercomparison Project (CMIP) members by comparing them to observational and reanalysis data products. Additionally, we investigate the progression from CMIP phase 5 to phase 6 and find modest improvements in the phase 6 models regarding their ability to produce realistic climatologies. ",
    "url": "https://arxiv.org/abs/2401.14657",
    "authors": [
      "Robert C. Garrett",
      "Trevor Harris",
      "Bo Li",
      "Zhuo Wang"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.14665",
    "title": "PepGB: Facilitating peptide drug discovery via graph neural networks",
    "abstract": "Peptides offer great biomedical potential and serve as promising drug candidates. Currently, the majority of approved peptide drugs are directly derived from well-explored natural human peptides. It is quite necessary to utilize advanced deep learning techniques to identify novel peptide drugs in the vast, unexplored biochemical space. Despite various in silico methods having been developed to accelerate peptide early drug discovery, existing models face challenges of overfitting and lacking generalizability due to the limited size, imbalanced distribution and inconsistent quality of experimental data. In this study, we propose PepGB, a deep learning framework to facilitate peptide early drug discovery by predicting peptide-protein interactions (PepPIs). Employing graph neural networks, PepGB incorporates a fine-grained perturbation module and a dual-view objective with contrastive learning-based peptide pre-trained representation to predict PepPIs. Through rigorous evaluations, we demonstrated that PepGB greatly outperforms baselines and can accurately identify PepPIs for novel targets and peptide hits, thereby contributing to the target identification and hit discovery processes. Next, we derive an extended version, diPepGB, to tackle the bottleneck of modeling highly imbalanced data prevalent in lead generation and optimization processes. Utilizing directed edges to represent relative binding strength between two peptide nodes, diPepGB achieves superior performance in real-world assays. In summary, our proposed frameworks can serve as potent tools to facilitate peptide early drug discovery. ",
    "url": "https://arxiv.org/abs/2401.14665",
    "authors": [
      "Yipin Lei",
      "Xu Wang",
      "Meng Fang",
      "Han Li",
      "Xiang Li",
      "Jianyang Zeng"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.14705",
    "title": "Additional Look into GAN-based Augmentation for Deep Learning COVID-19  Image Classification",
    "abstract": "The availability of training data is one of the main limitations in deep learning applications for medical imaging. Data augmentation is a popular approach to overcome this problem. A new approach is a Machine Learning based augmentation, in particular usage of Generative Adversarial Networks (GAN). In this case, GANs generate images similar to the original dataset so that the overall training data amount is bigger, which leads to better performance of trained networks. A GAN model consists of two networks, a generator and a discriminator interconnected in a feedback loop which creates a competitive environment. This work is a continuation of the previous research where we trained StyleGAN2-ADA by Nvidia on the limited COVID-19 chest X-ray image dataset. In this paper, we study the dependence of the GAN-based augmentation performance on dataset size with a focus on small samples. Two datasets are considered, one with 1000 images per class (4000 images in total) and the second with 500 images per class (2000 images in total). We train StyleGAN2-ADA with both sets and then, after validating the quality of generated images, we use trained GANs as one of the augmentations approaches in multi-class classification problems. We compare the quality of the GAN-based augmentation approach to two different approaches (classical augmentation and no augmentation at all) by employing transfer learning-based classification of COVID-19 chest X-ray images. The results are quantified using different classification quality metrics and compared to the results from the literature. The GAN-based augmentation approach is found to be comparable with classical augmentation in the case of medium and large datasets but underperforms in the case of smaller datasets. The correlation between the size of the original dataset and the quality of classification is visible independently from the augmentation approach. ",
    "url": "https://arxiv.org/abs/2401.14705",
    "authors": [
      "Oleksandr Fedoruk",
      "Konrad Klimaszewski",
      "Aleksander Ogonowski",
      "Michał Kruk"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.14722",
    "title": "A Nonparametric Bayes Approach to Online Activity Prediction",
    "abstract": "Accurately predicting the onset of specific activities within defined timeframes holds significant importance in several applied contexts. In particular, accurate prediction of the number of future users that will be exposed to an intervention is an important piece of information for experimenters running online experiments (A/B tests). In this work, we propose a novel approach to predict the number of users that will be active in a given time period, as well as the temporal trajectory needed to attain a desired user participation threshold. We model user activity using a Bayesian nonparametric approach which allows us to capture the underlying heterogeneity in user engagement. We derive closed-form expressions for the number of new users expected in a given period, and a simple Monte Carlo algorithm targeting the posterior distribution of the number of days needed to attain a desired number of users; the latter is important for experimental planning. We illustrate the performance of our approach via several experiments on synthetic and real world data, in which we show that our novel method outperforms existing competitors. ",
    "url": "https://arxiv.org/abs/2401.14722",
    "authors": [
      "Mario Beraha",
      "Lorenzo Masoero",
      "Stefano Favaro",
      "Thomas S. Richardson"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.14884",
    "title": "P3LS: Partial Least Squares under Privacy Preservation",
    "abstract": "Modern manufacturing value chains require intelligent orchestration of processes across company borders in order to maximize profits while fostering social and environmental sustainability. However, the implementation of integrated, systems-level approaches for data-informed decision-making along value chains is currently hampered by privacy concerns associated with cross-organizational data exchange and integration. We here propose Privacy-Preserving Partial Least Squares (P3LS) regression, a novel federated learning technique that enables cross-organizational data integration and process modeling with privacy guarantees. P3LS involves a singular value decomposition (SVD) based PLS algorithm and employs removable, random masks generated by a trusted authority in order to protect the privacy of the data contributed by each data holder. We demonstrate the capability of P3LS to vertically integrate process data along a hypothetical value chain consisting of three parties and to improve the prediction performance on several process-related key performance indicators. Furthermore, we show the numerical equivalence of P3LS and PLS model components on simulated data and provide a thorough privacy analysis of the former. Moreover, we propose a mechanism for determining the relevance of the contributed data to the problem being addressed, thus creating a basis for quantifying the contribution of participants. ",
    "url": "https://arxiv.org/abs/2401.14884",
    "authors": [
      "Du Nguyen Duy",
      "Ramin Nikzad-Langerodi"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.14999",
    "title": "The causal role of the Reddit collective action on the GameStop short  squeeze",
    "abstract": "In early 2021, the stock prices of GameStop, AMC, Nokia, and BlackBerry experienced dramatic increases, triggered by short squeeze operations that have been largely attributed to Reddit's retail investors. These events showcased, for the first time, the potential of online social networks to catalyze financial collective action. How, when and to what extent Reddit users played a causal role in driving up these prices, however, remains unclear. To address these questions, we employ causal inference techniques, leveraging data capturing activity on Reddit and Twitter, and trading volume with a high temporal resolution. We find that Reddit discussions foreshadowed trading volume before the GameStop short squeeze, with their predictive power being particularly strong on hourly time scales. This effect emerged abruptly and became prominent a few weeks before the event, but waned once the community of investors gained widespread visibility through Twitter. As the causal link unfolded, the collective investment of the Reddit community, quantified through each user's financial position on GameStop, closely mirrored the market capitalization of the stock. The evidence from our study suggests that Reddit users fueled the GameStop short squeeze, and thereby Reddit served as a coordination hub for a shared financial strategy. Towards the end of January, users talking about GameStop contributed to raise the popularity of BlackBerry, AMC and Nokia, which emerged as the most popular stocks as the community gained global recognition. Overall, our results shed light on the dynamics behind the first large-scale financial collective action driven by social media users. ",
    "url": "https://arxiv.org/abs/2401.14999",
    "authors": [
      "Antonio Desiderio",
      "Luca Maria Aiello",
      "Giulio Cimini",
      "Laura Alessandretti"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.15007",
    "title": "Noise-Tolerant Optimization Methods for the Solution of a Robust Design  Problem",
    "abstract": "The development of nonlinear optimization algorithms capable of performing reliably in the presence of noise has garnered considerable attention lately. This paper advocates for strategies to create noise-tolerant nonlinear optimization algorithms by adapting classical deterministic methods. These adaptations follow certain design guidelines described here, which make use of estimates of the noise level in the problem. The application of our methodology is illustrated by the development of a line search gradient projection method, which is tested on an engineering design problem. It is shown that a new self-calibrated line search and noise-aware finite-difference techniques are effective even in the high noise regime. Numerical experiments investigate the resiliency of key algorithmic components. A convergence analysis of the line search gradient projection method establishes convergence to a neighborhood of the solution. ",
    "url": "https://arxiv.org/abs/2401.15007",
    "authors": [
      "Yuchen Lou",
      "Shigeng Sun",
      "Jorge Nocedal"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2401.15031",
    "title": "Tensor product algorithms for inference of contact network from  epidemiological data",
    "abstract": "We consider a problem of inferring contact network from nodal states observed during an epidemiological process. In a black-box Bayesian optimisation framework this problem reduces to a discrete likelihood optimisation over the set of possible networks. The high dimensionality of this set, which grows quadratically with the number of network nodes, makes this optimisation computationally challenging. Moreover, the computation of the likelihood of a network requires estimating probabilities of the observed data to realise during the evolution of the epidemiological process on this network. A stochastic simulation algorithm struggles to estimate rare events of observing the data (corresponding to the ground truth network) during the evolution with a significantly different network, and hence prevents optimisation of the likelihood. We replace the stochastic simulation with solving the chemical master equation for the probabilities of all network states. This equation also suffers from the curse of dimensionality due to the exponentially large number of network states. We overcome this by approximating the probability of states in the tensor-train decomposition. This enables fast and accurate computation of small probabilities and likelihoods. Numerical simulations demonstrate efficient black-box Bayesian inference of the network. ",
    "url": "https://arxiv.org/abs/2401.15031",
    "authors": [
      "Sergey Dolgov",
      "Dmitry Savostyanov"
    ],
    "subjectives": [
      "Computation (stat.CO)",
      "Numerical Analysis (math.NA)",
      "Probability (math.PR)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2211.16468",
    "title": "Linear-Time Algorithms for Front-Door Adjustment in Causal Graphs",
    "abstract": " Comments: Extended version of paper accepted to the Proceedings of the 38th AAAI Conference on Artificial Intelligence (AAAI-2024) ",
    "url": "https://arxiv.org/abs/2211.16468",
    "authors": [
      "Marcel Wienöbst",
      "Benito van der Zander",
      "Maciej Liśkiewicz"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2303.00128",
    "title": "Representation Disentaglement via Regularization by Causal  Identification",
    "abstract": " Title: Representation Disentaglement via Regularization by Causal  Identification ",
    "url": "https://arxiv.org/abs/2303.00128",
    "authors": [
      "Juan Castorena"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.05752",
    "title": "Function Space and Critical Points of Linear Convolutional Networks",
    "abstract": " Comments: 35 pages, 1 figure, 2 tables ",
    "url": "https://arxiv.org/abs/2304.05752",
    "authors": [
      "Kathlén Kohn",
      "Guido Montúfar",
      "Vahid Shahverdi",
      "Matthew Trager"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Algebraic Geometry (math.AG)"
    ]
  },
  {
    "id": "arXiv:2304.11043",
    "title": "Can Perturbations Help Reduce Investment Risks? Risk-Aware Stock  Recommendation via Split Variational Adversarial Training",
    "abstract": " Comments: Accepted by TOIS ",
    "url": "https://arxiv.org/abs/2304.11043",
    "authors": [
      "Jiezhu Cheng",
      "Kaizhu Huang",
      "Zibin Zheng"
    ],
    "subjectives": [
      "Risk Management (q-fin.RM)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.17191",
    "title": "MT-SLVR: Multi-Task Self-Supervised Learning for Transformation  In(Variant) Representations",
    "abstract": " Comments: Last author version accepted to InterSpeech23. 5 pages ",
    "url": "https://arxiv.org/abs/2305.17191",
    "authors": [
      "Calum Heggan",
      "Tim Hospedales",
      "Sam Budgett",
      "Mehrdad Yaghoobi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2306.07331",
    "title": "Splitting and Parallelizing of Quantum Convolutional Neural Networks for  Learning Translationally Symmetric Data",
    "abstract": " Comments: 17 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2306.07331",
    "authors": [
      "Koki Chinzei",
      "Quoc Hoan Tran",
      "Kazunori Maruyama",
      "Hirotaka Oshima",
      "Shintaro Sato"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.09818",
    "title": "HiNeRV: Video Compression with Hierarchical Encoding-based Neural  Representation",
    "abstract": " Title: HiNeRV: Video Compression with Hierarchical Encoding-based Neural  Representation ",
    "url": "https://arxiv.org/abs/2306.09818",
    "authors": [
      "Ho Man Kwan",
      "Ge Gao",
      "Fan Zhang",
      "Andrew Gower",
      "David Bull"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.11305",
    "title": "Progressive Fourier Neural Representation for Sequential Video  Compilation",
    "abstract": " Title: Progressive Fourier Neural Representation for Sequential Video  Compilation ",
    "url": "https://arxiv.org/abs/2306.11305",
    "authors": [
      "Haeyong Kang",
      "Jaehong Yoon",
      "DaHyun Kim",
      "Sung Ju Hwang",
      "Chang D Yoo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.09060",
    "title": "Extreme heatwave sampling and prediction with analog Markov chain and  comparisons with deep learning",
    "abstract": " Comments: 30 pages, 13 figures, presented at Climate Informatics 2023, UK Cambridge ",
    "url": "https://arxiv.org/abs/2307.09060",
    "authors": [
      "George Miloshevich",
      "Dario Lucente",
      "Pascal Yiou",
      "Freddy Bouchet"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2307.09357",
    "title": "Using the IBM Analog In-Memory Hardware Acceleration Kit for Neural  Network Training and Inference",
    "abstract": " Title: Using the IBM Analog In-Memory Hardware Acceleration Kit for Neural  Network Training and Inference ",
    "url": "https://arxiv.org/abs/2307.09357",
    "authors": [
      "Manuel Le Gallo",
      "Corey Lammie",
      "Julian Buechel",
      "Fabio Carta",
      "Omobayode Fagbohungbe",
      "Charles Mackin",
      "Hsinyu Tsai",
      "Vijay Narayanan",
      "Abu Sebastian",
      "Kaoutar El Maghraoui",
      "Malte J. Rasch"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.10219",
    "title": "Exploring Link Prediction over Hyper-Relational Temporal Knowledge  Graphs Enhanced with Time-Invariant Relational Knowledge",
    "abstract": " Title: Exploring Link Prediction over Hyper-Relational Temporal Knowledge  Graphs Enhanced with Time-Invariant Relational Knowledge ",
    "url": "https://arxiv.org/abs/2307.10219",
    "authors": [
      "Zifeng Ding",
      "Jingcheng Wu",
      "Jingpei Wu",
      "Yan Xia",
      "Volker Tresp"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.10148",
    "title": "Privacy Perceptions and Behaviors of Google Personal Account Holders in  Saudi Arabia",
    "abstract": " Comments: To appear in Proc. of HCII 2024 ",
    "url": "https://arxiv.org/abs/2308.10148",
    "authors": [
      "Eman Alashwali",
      "Lorrie Faith Cranor"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Cryptography and Security (cs.CR)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.12044",
    "title": "A multiobjective continuation method to compute the regularization path  of deep neural networks",
    "abstract": " Comments: 7 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2308.12044",
    "authors": [
      "Augustina C. Amakor",
      "Konstantin Sonntag",
      "Sebastian Peitz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.13301",
    "title": "To Rectify Routing Games for Social Information Sharing",
    "abstract": " Title: To Rectify Routing Games for Social Information Sharing ",
    "url": "https://arxiv.org/abs/2308.13301",
    "authors": [
      "Songhua Li",
      "Lingjie Duan"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2309.04655",
    "title": "Intelligent upper-limb exoskeleton integrated with soft wearable  bioelectronics and deep-learning for human intention-driven strength  augmentation based on sensory feedback",
    "abstract": " Comments: 15 pages, 6 figures, 1 table, published in npj flexible electronics journals ",
    "url": "https://arxiv.org/abs/2309.04655",
    "authors": [
      "Jinwoo Lee",
      "Kangkyu Kwon",
      "Ira Soltis",
      "Jared Matthews",
      "Yoonjae Lee",
      "Hojoong Kim",
      "Lissette Romero",
      "Nathan Zavanelli",
      "Youngjin Kwon",
      "Shinjae Kwon",
      "Jimin Lee",
      "Yewon Na",
      "Sung Hoon Lee",
      "Ki Jun Yu",
      "Minoru Shinohara",
      "Frank L. Hammond",
      "Woon-Hong Yeo"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2309.07200",
    "title": "Latent Representation and Simulation of Markov Processes via Time-Lagged  Information Bottleneck",
    "abstract": " Comments: 10 pages, 15 figures, Accepted ICLR 2024 ",
    "url": "https://arxiv.org/abs/2309.07200",
    "authors": [
      "Marco Federici",
      "Patrick Forré",
      "Ryota Tomioka",
      "Bastiaan S. Veeling"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2309.07703",
    "title": "Causal Entropy and Information Gain for Measuring Causal Control",
    "abstract": " Comments: In Proceedings of the European Conference on Artificial Intelligence (ECAI) 2023. Work presented at the third XI-ML workshop of ECAI 2023 ",
    "url": "https://arxiv.org/abs/2309.07703",
    "authors": [
      "Francisco Nunes Ferreira Quialheiro Simoes",
      "Mehdi Dastani",
      "Thijs van Ommen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2309.09440",
    "title": "Online Network Traffic Classification Based on External Attention and  Convolution by IP Packet Header",
    "abstract": " Comments: 13 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2309.09440",
    "authors": [
      "Yahui Hu",
      "Ziqian Zeng",
      "Junping Song",
      "Luyang Xu",
      "Xu Zhou"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2309.13223",
    "title": "Causal Reasoning: Charting a Revolutionary Course for Next-Generation  AI-Native Wireless Networks",
    "abstract": " Title: Causal Reasoning: Charting a Revolutionary Course for Next-Generation  AI-Native Wireless Networks ",
    "url": "https://arxiv.org/abs/2309.13223",
    "authors": [
      "Christo Kurisummoottil Thomas",
      "Christina Chaccour",
      "Walid Saad",
      "Merouane Debbah",
      "Choong Seon Hong"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.13736",
    "title": "Geometry of Linear Neural Networks: Equivariance and Invariance under  Permutation Groups",
    "abstract": " Comments: 40 pages, 8 figures, 1 table; comments welcome! ",
    "url": "https://arxiv.org/abs/2309.13736",
    "authors": [
      "Kathlén Kohn",
      "Anna-Laura Sattelberger",
      "Vahid Shahverdi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Algebraic Geometry (math.AG)"
    ]
  },
  {
    "id": "arXiv:2310.00517",
    "title": "Assessing the Generalizability of Deep Neural Networks-Based Models for  Black Skin Lesions",
    "abstract": " Comments: 18 pages, 3 figures, 7 tables. Accepted at CIARP 2023 ",
    "url": "https://arxiv.org/abs/2310.00517",
    "authors": [
      "Luana Barros",
      "Levy Chaves",
      "Sandra Avila"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.15950",
    "title": "Representation Learning with Large Language Models for Recommendation",
    "abstract": " Comments: Published as a WWW'24 full paper ",
    "url": "https://arxiv.org/abs/2310.15950",
    "authors": [
      "Xubin Ren",
      "Wei Wei",
      "Lianghao Xia",
      "Lixin Su",
      "Suqi Cheng",
      "Junfeng Wang",
      "Dawei Yin",
      "Chao Huang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.18564",
    "title": "A General Framework for Robust G-Invariance in G-Equivariant Networks",
    "abstract": " Title: A General Framework for Robust G-Invariance in G-Equivariant Networks ",
    "url": "https://arxiv.org/abs/2310.18564",
    "authors": [
      "Sophia Sanborn",
      "Nina Miolane"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.18628",
    "title": "Personalised Distillation: Empowering Open-Sourced LLMs with Adaptive  Learning for Code Generation",
    "abstract": " Comments: Accepted to EMNLP 2023; Codes at: this https URL ",
    "url": "https://arxiv.org/abs/2310.18628",
    "authors": [
      "Hailin Chen",
      "Amrita Saha",
      "Steven Hoi",
      "Shafiq Joty"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.12401",
    "title": "CASR: Refining Action Segmentation via Marginalizing Frame-levle Causal  Relationships",
    "abstract": " Comments: We found that the paper needs to be modified in the model and all experiments must be re-run, so we request to withdraw the current version ",
    "url": "https://arxiv.org/abs/2311.12401",
    "authors": [
      "Keqing Du",
      "Xinyu Yang",
      "Hang Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2311.14786",
    "title": "GPT-4V Takes the Wheel: Promises and Challenges for Pedestrian Behavior  Prediction",
    "abstract": " Title: GPT-4V Takes the Wheel: Promises and Challenges for Pedestrian Behavior  Prediction ",
    "url": "https://arxiv.org/abs/2311.14786",
    "authors": [
      "Jia Huang",
      "Peng Jiang",
      "Alvika Gautam",
      "Srikanth Saripalli"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.15153",
    "title": "Self-Supervised Learning for SAR ATR with a Knowledge-Guided Predictive  Architecture",
    "abstract": " Comments: We found that the LoMaR framework has the possibility that half-precision calculations will have NaN values, so we need to modified the framework and experiments significantly, and the current version is not suitable as a reference ",
    "url": "https://arxiv.org/abs/2311.15153",
    "authors": [
      "Weijie Li",
      "Yang Wei",
      "Tianpeng Liu",
      "Yuenan Hou",
      "Yongxiang Liu",
      "Li Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2312.03573",
    "title": "On data-driven Wasserstein distributionally robust Nash equilibrium  problems with heterogeneous uncertainty",
    "abstract": " Title: On data-driven Wasserstein distributionally robust Nash equilibrium  problems with heterogeneous uncertainty ",
    "url": "https://arxiv.org/abs/2312.03573",
    "authors": [
      "George Pantazis",
      "Barbara Franci",
      "Sergio Grammatico"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2312.05398",
    "title": "Generative Network Layer for Communication Systems with Artificial  Intelligence",
    "abstract": " Comments: Accepted for publication in IEEE Networking Letters ",
    "url": "https://arxiv.org/abs/2312.05398",
    "authors": [
      "Mathias Thorsager",
      "Israel Leyva-Mayorga",
      "Beatriz Soret",
      "Petar Popovski"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.10986",
    "title": "Long-Tailed 3D Detection via 2D Late Fusion",
    "abstract": " Title: Long-Tailed 3D Detection via 2D Late Fusion ",
    "url": "https://arxiv.org/abs/2312.10986",
    "authors": [
      "Yechi Ma",
      "Neehar Peri",
      "Shuoquan Wei",
      "Wei Hua",
      "Deva Ramanan",
      "Yanan Li",
      "Shu Kong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2312.13628",
    "title": "Where and How to Attack? A Causality-Inspired Recipe for Generating  Counterfactual Adversarial Examples",
    "abstract": " Comments: Accepted by AAAI-2024 ",
    "url": "https://arxiv.org/abs/2312.13628",
    "authors": [
      "Ruichu Cai",
      "Yuxuan Zhu",
      "Jie Qiao",
      "Zefeng Liang",
      "Furui Liu",
      "Zhifeng Hao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.03256",
    "title": "An Incrementally Expanding Approach for Updating PageRank on Dynamic  Graphs",
    "abstract": " Comments: 11 pages, 14 figures, 1 table ",
    "url": "https://arxiv.org/abs/2401.03256",
    "authors": [
      "Subhajit Sahu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2401.06401",
    "title": "DevEval: Evaluating Code Generation in Practical Software Projects",
    "abstract": " Comments: Preprint version. Work in Progress ",
    "url": "https://arxiv.org/abs/2401.06401",
    "authors": [
      "Jia Li",
      "Ge Li",
      "Yunfei Zhao",
      "Yongmin Li",
      "Zhi Jin",
      "Hao Zhu",
      "Huanyu Liu",
      "Kaibo Liu",
      "Lecheng Wang",
      "Zheng Fang",
      "Lanshen Wang",
      "Jiazheng Ding",
      "Xuanming Zhang",
      "Yihong Dong",
      "Yuqi Zhu",
      "Bin Gu",
      "Mengfei Yang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.08534",
    "title": "DiConStruct: Causal Concept-based Explanations through Black-Box  Distillation",
    "abstract": " Comments: Accepted at Conference on Causal Learning and Reasoning (CLeaR 2024, this https URL). To be published at Proceedings of Machine Learning Research (PMLR) ",
    "url": "https://arxiv.org/abs/2401.08534",
    "authors": [
      "Ricardo Moreira",
      "Jacopo Bono",
      "Mário Cardoso",
      "Pedro Saleiro",
      "Mário A. T. Figueiredo",
      "Pedro Bizarro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2401.11143",
    "title": "Gaussian Adaptive Attention is All You Need: Robust Contextual  Representations Across Multiple Modalities",
    "abstract": " Title: Gaussian Adaptive Attention is All You Need: Robust Contextual  Representations Across Multiple Modalities ",
    "url": "https://arxiv.org/abs/2401.11143",
    "authors": [
      "Georgios Ioannides",
      "Aman Chadha",
      "Aaron Elkins"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2401.11511",
    "title": "MobileARLoc: On-device Robust Absolute Localisation for Pervasive  Markerless Mobile AR",
    "abstract": " Comments: Accepted for publication at the 3rd edition of the Pervasive and Resource-Constrained AI (PerConAI) workshop (co-located with PerCom 2024). arXiv admin note: substantial text overlap with arXiv:2308.05394 ",
    "url": "https://arxiv.org/abs/2401.11511",
    "authors": [
      "Changkun Liu",
      "Yukun Zhao",
      "Tristan Braud"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.13823",
    "title": "Robustness in Fairness against Edge-level Perturbations in GNN-based  Recommendation",
    "abstract": " Title: Robustness in Fairness against Edge-level Perturbations in GNN-based  Recommendation ",
    "url": "https://arxiv.org/abs/2401.13823",
    "authors": [
      "Ludovico Boratto",
      "Francesco Fabbri",
      "Gianni Fenu",
      "Mirko Marras",
      "Giacomo Medda"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2401.14111",
    "title": "Image Synthesis with Graph Conditioning: CLIP-Guided Diffusion Models  for Scene Graphs",
    "abstract": " Title: Image Synthesis with Graph Conditioning: CLIP-Guided Diffusion Models  for Scene Graphs ",
    "url": "https://arxiv.org/abs/2401.14111",
    "authors": [
      "Rameshwar Mishra",
      "A V Subramanyam"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.14196",
    "title": "DeepSeek-Coder: When the Large Language Model Meets Programming -- The  Rise of Code Intelligence",
    "abstract": " Title: DeepSeek-Coder: When the Large Language Model Meets Programming -- The  Rise of Code Intelligence ",
    "url": "https://arxiv.org/abs/2401.14196",
    "authors": [
      "Daya Guo",
      "Qihao Zhu",
      "Dejian Yang",
      "Zhenda Xie",
      "Kai Dong",
      "Wentao Zhang",
      "Guanting Chen",
      "Xiao Bi",
      "Y. Wu",
      "Y.K. Li",
      "Fuli Luo",
      "Yingfei Xiong",
      "Wenfeng Liang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.14321",
    "title": "VALL-T: Decoder-Only Generative Transducer for Robust and  Decoding-Controllable Text-to-Speech",
    "abstract": " Title: VALL-T: Decoder-Only Generative Transducer for Robust and  Decoding-Controllable Text-to-Speech ",
    "url": "https://arxiv.org/abs/2401.14321",
    "authors": [
      "Chenpeng Du",
      "Yiwei Guo",
      "Hankun Wang",
      "Yifan Yang",
      "Zhikang Niu",
      "Shuai Wang",
      "Hui Zhang",
      "Xie Chen",
      "Kai Yu"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  }
]