[
  {
    "id": "arXiv:2210.02447",
    "title": "Practical Adversarial Attacks on Spatiotemporal Traffic Forecasting  Models",
    "abstract": "Machine learning based traffic forecasting models leverage sophisticated spatiotemporal auto-correlations to provide accurate predictions of city-wide traffic states. However, existing methods assume a reliable and unbiased forecasting environment, which is not always available in the wild. In this work, we investigate the vulnerability of spatiotemporal traffic forecasting models and propose a practical adversarial spatiotemporal attack framework. Specifically, instead of simultaneously attacking all geo-distributed data sources, an iterative gradient-guided node saliency method is proposed to identify the time-dependent set of victim nodes. Furthermore, we devise a spatiotemporal gradient descent based scheme to generate real-valued adversarial traffic states under a perturbation constraint. Meanwhile, we theoretically demonstrate the worst performance bound of adversarial traffic forecasting attacks. Extensive experiments on two real-world datasets show that the proposed two-step framework achieves up to $67.8\\%$ performance degradation on various advanced spatiotemporal forecasting models. Remarkably, we also show that adversarial training with our proposed attacks can significantly improve the robustness of spatiotemporal traffic forecasting models. Our code is available in \\url{https://github.com/luckyfan-cs/ASTFA}. ",
    "url": "https://arxiv.org/abs/2210.02447",
    "authors": [
      "Fan Liu",
      "Hao Liu",
      "Wenzhao Jiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2210.02449",
    "title": "DEGAN: Time Series Anomaly Detection using Generative Adversarial  Network Discriminators and Density Estimation",
    "abstract": "Developing efficient time series anomaly detection techniques is important to maintain service quality and provide early alarms. Generative neural network methods are one class of the unsupervised approaches that are achieving increasing attention in recent years. In this paper, we have proposed an unsupervised Generative Adversarial Network (GAN)-based anomaly detection framework, DEGAN. It relies solely on normal time series data as input to train a well-configured discriminator (D) into a standalone anomaly predictor. In this framework, time series data is processed by the sliding window method. Expected normal patterns in data are leveraged to develop a generator (G) capable of generating normal data patterns. Normal data is also utilized in hyperparameter tuning and D model selection steps. Validated D models are then extracted and applied to evaluate unseen (testing) time series and identify patterns that have anomalous characteristics. Kernel density estimation (KDE) is applied to data points that are likely to be anomalous to generate probability density functions on the testing time series. The segments with the highest relative probabilities are detected as anomalies. To evaluate the performance, we tested on univariate acceleration time series for five miles of a Class I railroad track. We implemented the framework to detect the real anomalous observations identified by operators. The results show that leveraging the framework with a CNN D architecture results in average best recall and precision of 80% and 86%, respectively, which demonstrates that a well-trained standalone D model has the potential to be a reliable anomaly detector. Moreover, the influence of GAN hyperparameters, GAN architectures, sliding window sizes, clustering of time series, and model validation with labeled/unlabeled data were also investigated. ",
    "url": "https://arxiv.org/abs/2210.02449",
    "authors": [
      "Yueyan Gu",
      "Farrokh Jazizadeh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2210.02490",
    "title": "Analyzing historical diagnosis code data from NIH N3C and RECOVER  Programs using deep learning to determine risk factors for Long Covid",
    "abstract": "Post-acute sequelae of SARS-CoV-2 infection (PASC) or Long COVID is an emerging medical condition that has been observed in several patients with a positive diagnosis for COVID-19. Historical Electronic Health Records (EHR) like diagnosis codes, lab results and clinical notes have been analyzed using deep learning and have been used to predict future clinical events. In this paper, we propose an interpretable deep learning approach to analyze historical diagnosis code data from the National COVID Cohort Collective (N3C) to find the risk factors contributing to developing Long COVID. Using our deep learning approach, we are able to predict if a patient is suffering from Long COVID from a temporally ordered list of diagnosis codes up to 45 days post the first COVID positive test or diagnosis for each patient, with an accuracy of 70.48\\%. We are then able to examine the trained model using Gradient-weighted Class Activation Mapping (GradCAM) to give each input diagnoses a score. The highest scored diagnosis were deemed to be the most important for making the correct prediction for a patient. We also propose a way to summarize these top diagnoses for each patient in our cohort and look at their temporal trends to determine which codes contribute towards a positive Long COVID diagnosis. ",
    "url": "https://arxiv.org/abs/2210.02490",
    "authors": [
      "Saurav Sengupta",
      "Johanna Loomba",
      "Suchetha Sharma",
      "Donald E. Brown",
      "Lorna Thorpe",
      "Melissa A Haendel",
      "Christopher G Chute",
      "Stephanie Hong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.02493",
    "title": "Depth Is All You Need for Monocular 3D Detection",
    "abstract": "A key contributor to recent progress in 3D detection from single images is monocular depth estimation. Existing methods focus on how to leverage depth explicitly, by generating pseudo-pointclouds or providing attention cues for image features. More recent works leverage depth prediction as a pretraining task and fine-tune the depth representation while training it for 3D detection. However, the adaptation is insufficient and is limited in scale by manual labels. In this work, we propose to further align depth representation with the target domain in unsupervised fashions. Our methods leverage commonly available LiDAR or RGB videos during training time to fine-tune the depth representation, which leads to improved 3D detectors. Especially when using RGB videos, we show that our two-stage training by first generating pseudo-depth labels is critical because of the inconsistency in loss distribution between the two tasks. With either type of reference data, our multi-task learning approach improves over the state of the art on both KITTI and NuScenes, while matching the test-time complexity of its single task sub-network. ",
    "url": "https://arxiv.org/abs/2210.02493",
    "authors": [
      "Dennis Park",
      "Jie Li",
      "Dian Chen",
      "Vitor Guizilini",
      "Adrien Gaidon"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.02502",
    "title": "On Adversarial Robustness of Deep Image Deblurring",
    "abstract": "Recent approaches employ deep learning-based solutions for the recovery of a sharp image from its blurry observation. This paper introduces adversarial attacks against deep learning-based image deblurring methods and evaluates the robustness of these neural networks to untargeted and targeted attacks. We demonstrate that imperceptible distortion can significantly degrade the performance of state-of-the-art deblurring networks, even producing drastically different content in the output, indicating the strong need to include adversarially robust training not only in classification but also for image recovery. ",
    "url": "https://arxiv.org/abs/2210.02502",
    "authors": [
      "Kanchana Vaishnavi Gandikota",
      "Paramanand Chandramouli",
      "Michael Moeller"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2210.02523",
    "title": "Dual-Domain Cross-Iteration Squeeze-Excitation Network for Sparse  Reconstruction of Brain MRI",
    "abstract": "Magnetic resonance imaging (MRI) is one of the most commonly applied tests in neurology and neurosurgery. However, the utility of MRI is largely limited by its long acquisition time, which might induce many problems including patient discomfort and motion artifacts. Acquiring fewer k-space sampling is a potential solution to reducing the total scanning time. However, it can lead to severe aliasing reconstruction artifacts and thus affect the clinical diagnosis. Nowadays, deep learning has provided new insights into the sparse reconstruction of MRI. In this paper, we present a new approach to this problem that iteratively fuses the information of k-space and MRI images using novel dual Squeeze-Excitation Networks and Cross-Iteration Residual Connections. This study included 720 clinical multi-coil brain MRI cases adopted from the open-source deidentified fastMRI Dataset. 8-folder downsampling rate was applied to generate the sparse k-space. Results showed that the average reconstruction error over 120 testing cases by our proposed method was 2.28%, which outperformed the existing image-domain prediction (6.03%, p<0.001), k-space synthesis (6.12%, p<0.001), and dual-domain feature fusion (4.05%, p<0.001). ",
    "url": "https://arxiv.org/abs/2210.02523",
    "authors": [
      "Xiongchao Chen",
      "Yoshihisa Shinagawa",
      "Zhigang Peng",
      "Gerardo Hermosillo Valadez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.02533",
    "title": "Towards Semi-automatic Detection and Localization of Indoor  Accessibility Issues using Mobile Depth Scanning and Computer Vision",
    "abstract": "To help improve the safety and accessibility of indoor spaces, researchers and health professionals have created assessment instruments that enable homeowners and trained experts to audit and improve homes. With advances in computer vision, augmented reality (AR), and mobile sensors, new approaches are now possible. We introduce RASSAR (Room Accessibility and Safety Scanning in Augmented Reality), a new proof-of-concept prototype for semi-automatically identifying, categorizing, and localizing indoor accessibility and safety issues using LiDAR + camera data, machine learning, and AR. We present an overview of the current RASSAR prototype and a preliminary evaluation in a single home. ",
    "url": "https://arxiv.org/abs/2210.02533",
    "authors": [
      "Xia Su",
      "Kaiming Cheng",
      "Han Zhang",
      "Jaewook Lee",
      "Jon E. Froehlich"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2210.02558",
    "title": "Improved Anomaly Detection by Using the Attention-Based Isolation Forest",
    "abstract": "A new modification of Isolation Forest called Attention-Based Isolation Forest (ABIForest) for solving the anomaly detection problem is proposed. It incorporates the attention mechanism in the form of the Nadaraya-Watson regression into the Isolation Forest for improving solution of the anomaly detection problem. The main idea underlying the modification is to assign attention weights to each path of trees with learnable parameters depending on instances and trees themselves. The Huber's contamination model is proposed to be used for defining the attention weights and their parameters. As a result, the attention weights are linearly depend on the learnable attention parameters which are trained by solving the standard linear or quadratic optimization problem. ABIForest can be viewed as the first modification of Isolation Forest, which incorporates the attention mechanism in a simple way without applying gradient-based algorithms. Numerical experiments with synthetic and real datasets illustrate outperforming results of ABIForest. The code of proposed algorithms is available. ",
    "url": "https://arxiv.org/abs/2210.02558",
    "authors": [
      "Lev V. Utkin",
      "Andrey Y. Ageev",
      "Andrei V. Konstantinov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2210.02573",
    "title": "Bi-Stride Multi-Scale Graph Neural Network for Mesh-Based Physical  Simulation",
    "abstract": "Learning physical systems on unstructured meshes by flat Graph neural networks (GNNs) faces the challenge of modeling the long-range interactions due to the scaling complexity w.r.t. the number of nodes, limiting the generalization under mesh refinement. On regular grids, the convolutional neural networks (CNNs) with a U-net structure can resolve this challenge by efficient stride, pooling, and upsampling operations. Nonetheless, these tools are much less developed for graph neural networks (GNNs), especially when GNNs are employed for learning large-scale mesh-based physics. The challenges arise from the highly irregular meshes and the lack of effective ways to construct the multi-level structure without losing connectivity. Inspired by the bipartite graph determination algorithm, we introduce Bi-Stride Multi-Scale Graph Neural Network (BSMS-GNN) by proposing \\textit{bi-stride} as a simple pooling strategy for building the multi-level GNN. \\textit{Bi-stride} pools nodes by striding every other BFS frontier; it 1) works robustly on any challenging mesh in the wild, 2) avoids using a mesh generator at coarser levels, 3) avoids the spatial proximity for building coarser levels, and 4) uses non-parametrized aggregating/returning instead of MLPs during pooling and unpooling. Experiments show that our framework significantly outperforms the state-of-the-art method's computational efficiency in representative physics-based simulation cases. ",
    "url": "https://arxiv.org/abs/2210.02573",
    "authors": [
      "Yadi Cao",
      "Menglei Chai",
      "Minchen Li",
      "Chenfanfu Jiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02577",
    "title": "A Closer Look at Robustness to L-infinity and Spatial Perturbations and  their Composition",
    "abstract": "In adversarial machine learning, the popular $\\ell_\\infty$ threat model has been the focus of much previous work. While this mathematical definition of imperceptibility successfully captures an infinite set of additive image transformations that a model should be robust to, this is only a subset of all transformations which leave the semantic label of an image unchanged. Indeed, previous work also considered robustness to spatial attacks as well as other semantic transformations; however, designing defense methods against the composition of spatial and $\\ell_{\\infty}$ perturbations remains relatively underexplored. In the following, we improve the understanding of this seldom investigated compositional setting. We prove theoretically that no linear classifier can achieve more than trivial accuracy against a composite adversary in a simple statistical setting, illustrating its difficulty. We then investigate how state-of-the-art $\\ell_{\\infty}$ defenses can be adapted to this novel threat model and study their performance against compositional attacks. We find that our newly proposed TRADES$_{\\text{All}}$ strategy performs the strongest of all. Analyzing its logit's Lipschitz constant for RT transformations of different sizes, we find that TRADES$_{\\text{All}}$ remains stable over a wide range of RT transformations with and without $\\ell_\\infty$ perturbations. ",
    "url": "https://arxiv.org/abs/2210.02577",
    "authors": [
      "Luke Rowe",
      "Benjamin Thérien",
      "Krzysztof Czarnecki",
      "Hongyang Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2210.02592",
    "title": "CCC-wav2vec 2.0: Clustering aided Cross Contrastive Self-supervised  learning of speech representations",
    "abstract": "While Self-Supervised Learning has helped reap the benefit of the scale from the available unlabeled data, the learning paradigms are continuously being bettered. We present a new pre-training strategy named ccc-wav2vec 2.0, which uses clustering and an augmentation-based cross-contrastive loss as its self-supervised objective. Through the clustering module, we scale down the influence of those negative examples that are highly similar to the positive. The Cross-Contrastive loss is computed between the encoder output of the original sample and the quantizer output of its augmentation and vice-versa, bringing robustness to the pre-training strategy. ccc-wav2vec 2.0 achieves up to 15.6% and 12.7% relative WER improvement over the baseline wav2vec 2.0 on the test-clean and test-other sets, respectively, of LibriSpeech, without the use of any language model. The proposed method also achieves up to 14.9% relative WER improvement over the baseline wav2vec 2.0 when fine-tuned on Switchboard data. We make all our codes publicly available on GitHub. ",
    "url": "https://arxiv.org/abs/2210.02592",
    "authors": [
      "Vasista Sai Lodagala",
      "Sreyan Ghosh",
      "S. Umesh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.02601",
    "title": "From Threat Reports to Continuous Threat Intelligence: A Comparison of  Attack Technique Extraction Methods from Textual Artifacts",
    "abstract": "The cyberthreat landscape is continuously evolving. Hence, continuous monitoring and sharing of threat intelligence have become a priority for organizations. Threat reports, published by cybersecurity vendors, contain detailed descriptions of attack Tactics, Techniques, and Procedures (TTP) written in an unstructured text format. Extracting TTP from these reports aids cybersecurity practitioners and researchers learn and adapt to evolving attacks and in planning threat mitigation. Researchers have proposed TTP extraction methods in the literature, however, not all of these proposed methods are compared to one another or to a baseline. \\textit{The goal of this study is to aid cybersecurity researchers and practitioners choose attack technique extraction methods for monitoring and sharing threat intelligence by comparing the underlying methods from the TTP extraction studies in the literature.} In this work, we identify ten existing TTP extraction studies from the literature and implement five methods from the ten studies. We find two methods, based on Term Frequency-Inverse Document Frequency(TFIDF) and Latent Semantic Indexing (LSI), outperform the other three methods with a F1 score of 84\\% and 83\\%, respectively. We observe the performance of all methods in F1 score drops in the case of increasing the class labels exponentially. We also implement and evaluate an oversampling strategy to mitigate class imbalance issues. Furthermore, oversampling improves the classification performance of TTP extraction. We provide recommendations from our findings for future cybersecurity researchers, such as the construction of a benchmark dataset from a large corpus; and the selection of textual features of TTP. Our work, along with the dataset and implementation source code, can work as a baseline for cybersecurity researchers to test and compare the performance of future TTP extraction methods. ",
    "url": "https://arxiv.org/abs/2210.02601",
    "authors": [
      "Md Rayhanur Rahman",
      "Laurie Williams"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02607",
    "title": "Transferring dense object detection models to event-based data",
    "abstract": "Event-based image representations are fundamentally different to traditional dense images. This poses a challenge to apply current state-of-the-art models for object detection as they are designed for dense images. In this work we evaluate the YOLO object detection model on event data. To this end we replace dense-convolution layers by either sparse convolutions or asynchronous sparse convolutions which enables direct processing of event-based images and compare the performance and runtime to feeding event-histograms into dense-convolutions. Here, hyper-parameters are shared across all variants to isolate the effect sparse-representation has on detection performance. At this, we show that current sparse-convolution implementations cannot translate their theoretical lower computation requirements into an improved runtime. ",
    "url": "https://arxiv.org/abs/2210.02607",
    "authors": [
      "Vincenz Mechler",
      "Pavel Rojtberg"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.02612",
    "title": "Lyapunov Function Consistent Adaptive Network Signal Control with Back  Pressure and Reinforcement Learning",
    "abstract": "This research studies the network traffic signal control problem. It uses the Lyapunov control function to derive the back pressure method, which is equal to differential queue lengths weighted by intersection lane flows. Lyapunov control theory is a platform that unifies several current theories for intersection signal control. We further use the theorem to derive the flow-based and other pressure-based signal control algorithms. For example, the Dynamic, Optimal, Real-time Algorithm for Signals (DORAS) algorithm may be derived by defining the Lyapunov function as the sum of queue length. The study then utilizes the back pressure as a reward in the reinforcement learning (RL) based network signal control, whose agent is trained with double Deep Q-Network (Double-DQN). The proposed algorithm is compared with several traditional and RL-based methods under passenger traffic flow and mixed flow with freight traffic, respectively. The numerical tests are conducted on a single corridor and on a local grid network under three traffic demand scenarios of low, medium, and heavy traffic, respectively. The numerical simulation demonstrates that the proposed algorithm outperforms the others in terms of the average vehicle waiting time on the network. ",
    "url": "https://arxiv.org/abs/2210.02612",
    "authors": [
      "Chaolun Ma",
      "Bruce Wang",
      "Zihao Li",
      "Ahmadreza Mahmoudzadeh",
      "Yunlong Zhang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2210.02616",
    "title": "Digital Twin-Empowered Network Planning for Multi-Tier Computing",
    "abstract": "In this paper, we design a resource management scheme to support stateful applications, which will be prevalent in 6G networks. Different from stateless applications, stateful applications require context data while executing computing tasks from user terminals (UTs). Using a multi-tier computing paradigm with servers deployed at the core network, gateways, and base stations to support stateful applications, we aim to optimize long-term resource reservation by jointly minimizing the usage of computing, storage, and communication resources and the cost from reconfiguring resource reservation. The coupling among different resources and the impact of UT mobility create challenges in resource management. To address the challenges, we develop digital twin (DT) empowered network planning with two elements, i.e., multi-resource reservation and resource reservation reconfiguration. First, DTs are designed for collecting UT status data, based on which UTs are grouped according to their mobility patterns. Second, an algorithm is proposed to customize resource reservation for different groups to satisfy their different resource demands. Last, a Meta-learning-based approach is developed to reconfigure resource reservation for balancing the network resource usage and the reconfiguration cost. Simulation results demonstrate that the proposed DT-empowered network planning outperforms benchmark frameworks by using less resources and incurring lower reconfiguration costs. ",
    "url": "https://arxiv.org/abs/2210.02616",
    "authors": [
      "Conghao Zhou",
      "Jie Gao",
      "Mushu Li",
      "Xuemin",
      "Shen",
      "Weihua Zhuang"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02618",
    "title": "Dynamic Stochastic Ensemble with Adversarial Robust Lottery Ticket  Subnetworks",
    "abstract": "Adversarial attacks are considered the intrinsic vulnerability of CNNs. Defense strategies designed for attacks have been stuck in the adversarial attack-defense arms race, reflecting the imbalance between attack and defense. Dynamic Defense Framework (DDF) recently changed the passive safety status quo based on the stochastic ensemble model. The diversity of subnetworks, an essential concern in the DDF, can be effectively evaluated by the adversarial transferability between different networks. Inspired by the poor adversarial transferability between subnetworks of scratch tickets with various remaining ratios, we propose a method to realize the dynamic stochastic ensemble defense strategy. We discover the adversarial transferable diversity between robust lottery ticket subnetworks drawn from different basic structures and sparsity. The experimental results suggest that our method achieves better robust and clean recognition accuracy by adversarial transferable diversity, which would decrease the reliability of attacks. ",
    "url": "https://arxiv.org/abs/2210.02618",
    "authors": [
      "Qi Peng",
      "Wenlin Liu",
      "Ruoxi Qin",
      "Libin Hou",
      "Bin Yan",
      "Linyuan Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.02620",
    "title": "Inference Latency Prediction at the Edge",
    "abstract": "With the growing workload of inference tasks on mobile devices, state-of-the-art neural architectures (NAs) are typically designed through Neural Architecture Search (NAS) to identify NAs with good tradeoffs between accuracy and efficiency (e.g., latency). Since measuring the latency of a huge set of candidate architectures during NAS is not scalable, approaches are needed for predicting end-to-end inference latency on mobile devices. Such predictions are challenging due to hardware heterogeneity, optimizations applied by ML frameworks, and the diversity of neural architectures. Motivated by these challenges, in this paper, we first quantitatively assess characteristics of neural architectures and mobile devices that have significant effects on inference latency. Based on this assessment, we propose a latency prediction framework which addresses these challenges by developing operation-wise latency predictors, under a variety of settings and a number of hardware devices, with multi-core CPUs and GPUs, achieving high accuracy in end-to-end latency prediction, as shown by our comprehensive evaluations. To illustrate that our approach does not require expensive data collection, we also show that accurate predictions can be achieved on real-world NAs using only small amounts of profiling data. ",
    "url": "https://arxiv.org/abs/2210.02620",
    "authors": [
      "Zhuojin Li",
      "Marco Paolieri",
      "Leana Golubchik"
    ],
    "subjectives": [
      "Performance (cs.PF)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02630",
    "title": "MechRetro is a chemical-mechanism-driven graph learning framework for  interpretable retrosynthesis prediction and pathway planning",
    "abstract": "Leveraging artificial intelligence for automatic retrosynthesis speeds up organic pathway planning in digital laboratories. However, existing deep learning approaches are unexplainable, like \"black box\" with few insights, notably limiting their applications in real retrosynthesis scenarios. Here, we propose MechRetro, a chemical-mechanism-driven graph learning framework for interpretable retrosynthetic prediction and pathway planning, which learns several retrosynthetic actions to simulate a reverse reaction via elaborate self-adaptive joint learning. By integrating chemical knowledge as prior information, we design a novel Graph Transformer architecture to adaptively learn discriminative and chemically meaningful molecule representations, highlighting the strong capacity in molecule feature representation learning. We demonstrate that MechRetro outperforms the state-of-the-art approaches for retrosynthetic prediction with a large margin on large-scale benchmark datasets. Extending MechRetro to the multi-step retrosynthesis analysis, we identify efficient synthetic routes via an interpretable reasoning mechanism, leading to a better understanding in the realm of knowledgeable synthetic chemists. We also showcase that MechRetro discovers a novel pathway for protokylol, along with energy scores for uncertainty assessment, broadening the applicability for practical scenarios. Overall, we expect MechRetro to provide meaningful insights for high-throughput automated organic synthesis in drug discovery. ",
    "url": "https://arxiv.org/abs/2210.02630",
    "authors": [
      "Yu Wang",
      "Chao Pang",
      "Yuzhe Wang",
      "Yi Jiang",
      "Junru Jin",
      "Sirui Liang",
      "Quan Zou",
      "Leyi Wei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Chemical Physics (physics.chem-ph)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2210.02636",
    "title": "Geodesic Graph Neural Network for Efficient Graph Representation  Learning",
    "abstract": "Recently, Graph Neural Networks (GNNs) have been applied to graph learning tasks and achieved state-of-the-art results. However, many competitive methods employ preprocessing on the target nodes, such as subgraph extraction and customized labeling, to capture some information that is hard to be learned by normal GNNs. Such operations are time-consuming and do not scale to large graphs. In this paper, we propose an efficient GNN framework called Geodesic GNN (GDGNN). It injects conditional relationships between nodes into the model without labeling. Specifically, we view the shortest paths between two nodes as the spatial graph context of the neighborhood around them. The GNN embeddings of nodes on the shortest paths are used to generate geodesic representations. Conditioned on the geodesic representations, GDGNN is able to generate node, link, and graph representations that carry much richer structural information than plain GNNs. We theoretically prove that GDGNN is more powerful than plain GNNs, and present experimental results to show that GDGNN achieves highly competitive performance with state-of-the-art GNN models on link prediction and graph classification tasks while taking significantly less time. ",
    "url": "https://arxiv.org/abs/2210.02636",
    "authors": [
      "Lecheng Kong",
      "Yixin Chen",
      "Muhan Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02637",
    "title": "IR2Net: Information Restriction and Information Recovery for Accurate  Binary Neural Networks",
    "abstract": "Weight and activation binarization can efficiently compress deep neural networks and accelerate model inference, but cause severe accuracy degradation. Existing optimization methods for binary neural networks (BNNs) focus on fitting full-precision networks to reduce quantization errors, and suffer from the trade-off between accuracy and computational complexity. In contrast, considering the limited learning ability and information loss caused by the limited representational capability of BNNs, we propose IR$^2$Net to stimulate the potential of BNNs and improve the network accuracy by restricting the input information and recovering the feature information, including: 1) information restriction: for a BNN, by evaluating the learning ability on the input information, discarding some of the information it cannot focus on, and limiting the amount of input information to match its learning ability; 2) information recovery: due to the information loss in forward propagation, the output feature information of the network is not enough to support accurate classification. By selecting some shallow feature maps with richer information, and fusing them with the final feature maps to recover the feature information. In addition, the computational cost is reduced by streamlining the information recovery method to strike a better trade-off between accuracy and efficiency. Experimental results demonstrate that our approach still achieves comparable accuracy even with $ \\sim $10x floating-point operations (FLOPs) reduction for ResNet-18. The models and code are available at https://github.com/pingxue-hfut/IR2Net. ",
    "url": "https://arxiv.org/abs/2210.02637",
    "authors": [
      "Ping Xue",
      "Yang Lu",
      "Jingfei Chang",
      "Xing Wei",
      "Zhen Wei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.02650",
    "title": "PrivacyCube: A Tangible Device for Improving Privacy Awareness in IoT",
    "abstract": "Consumers increasingly bring IoT devices into their living spaces without understanding how their data is collected, processed, and used. We present PrivacyCube, a novel tangible device designed to explore the extent to which privacy awareness in smart homes can be elevated. PrivacyCube visualises IoT devices' data consumption displaying privacy-related notices. PrivacyCube aims at assisting families to (i) understand key privacy aspects better and (ii) have conversations around data management practices of IoT devices. Thus, families can learn and make informed privacy decisions collectively. ",
    "url": "https://arxiv.org/abs/2210.02650",
    "authors": [
      "Bayan Al Muhander",
      "Omer Rana",
      "Nalin Arachchilage",
      "Charith Perera"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2210.02651",
    "title": "Tracking the Evolution of Static Code Warnings: the State-of-the-Art and  a Better Approach",
    "abstract": "Static bug detection tools help developers detect problems in the code, including bad programming practices and potential defects. However, it is known that static bug detectors remain underutilized due to various reasons. Recent advances to incorporate static bug detectors in modern software development workflows, such as in code review and continuous integration, are shown capable of better motivating developers to fix the reported warnings on the fly. Moreover, tracking the static code warnings will benefit many downstream software engineering tasks, such as learning the fix patterns for automated program repair and learning which warnings are of more interest, so they can be prioritized automatically. Hence, precisely tracking the warnings by static bug detectors is critical to improve the utilization of static bug detectors further. In this paper, we study the effectiveness of the state-of-the-art (SOA) solution in tracking the warnings by static bug detectors and propose a better solution based on our analysis of the insufficiencies of the SOA solution. In particular, we examined over 2000 commits in four large-scale open-source systems (i.e., JClouds, Kafka, Spring-boot, and Guava) and crafted a dataset of 3,452 static code warnings by two static bug detectors (i.e., Spotbugs and PMD). We manually uncover the ground-truth evolution status of the static warnings: persistent, resolved, or newly-introduced. Moreover, upon manual analysis, we identified the main reasons behind the insufficiencies of the SOA solution. Finally, we propose a better approach to improving the tracking of static warnings over software development history. Our evaluation shows that our proposed approach provides a significant improvement in terms of the precision of the tracking, i.e., from 66.9% to 90.0%. ",
    "url": "https://arxiv.org/abs/2210.02651",
    "authors": [
      "Junjie Li",
      "Jinqiu Yang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2210.02655",
    "title": "Domain Generalization via Contrastive Causal Learning",
    "abstract": "Domain Generalization (DG) aims to learn a model that can generalize well to unseen target domains from a set of source domains. With the idea of invariant causal mechanism, a lot of efforts have been put into learning robust causal effects which are determined by the object yet insensitive to the domain changes. Despite the invariance of causal effects, they are difficult to be quantified and optimized. Inspired by the ability that humans adapt to new environments by prior knowledge, We develop a novel Contrastive Causal Model (CCM) to transfer unseen images to taught knowledge which are the features of seen images, and quantify the causal effects based on taught knowledge. Considering the transfer is affected by domain shifts in DG, we propose a more inclusive causal graph to describe DG task. Based on this causal graph, CCM controls the domain factor to cut off excess causal paths and uses the remaining part to calculate the causal effects of images to labels via the front-door criterion. Specifically, CCM is composed of three components: (i) domain-conditioned supervised learning which teaches CCM the correlation between images and labels, (ii) causal effect learning which helps CCM measure the true causal effects of images to labels, (iii) contrastive similarity learning which clusters the features of images that belong to the same class and provides the quantification of similarity. Finally, we test the performance of CCM on multiple datasets including PACS, OfficeHome, and TerraIncognita. The extensive experiments demonstrate that CCM surpasses the previous DG methods with clear margins. ",
    "url": "https://arxiv.org/abs/2210.02655",
    "authors": [
      "Qiaowei Miao",
      "Junkun Yuan",
      "Kun Kuang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.02657",
    "title": "Predictive Edge Caching through Deep Mining of Sequential Patterns in  User Content Retrievals",
    "abstract": "Edge caching plays an increasingly important role in boosting user content retrieval performance while reducing redundant network traffic. The effectiveness of caching ultimately hinges on the accuracy of predicting content popularity in the near future. However, at the network edge, content popularity can be extremely dynamic due to diverse user content retrieval behaviors and the low-degree of user multiplexing. It's challenging for the traditional reactive caching systems to keep up with the dynamic content popularity patterns. In this paper, we propose a novel Predictive Edge Caching (PEC) system that predicts the future content popularity using fine-grained learning models that mine sequential patterns in user content retrieval behaviors, and opportunistically prefetches contents predicted to be popular in the near future using idle network bandwidth. Through extensive experiments driven by real content retrieval traces, we demonstrate that PEC can adapt to highly dynamic content popularity, and significantly improve cache hit ratio and reduce user content retrieval latency over the state-of-art caching policies. More broadly, our study demonstrates that edge caching performance can be boosted by deep mining of user content retrieval behaviors. ",
    "url": "https://arxiv.org/abs/2210.02657",
    "authors": [
      "Chen Li",
      "Xiaoyu Wang",
      "Tongyu Zong",
      "Houwei Cao",
      "Yong Liu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02659",
    "title": "Explainable Abuse Detection as Intent Classification and Slot Filling",
    "abstract": "To proactively offer social media users a safe online experience, there is a need for systems that can detect harmful posts and promptly alert platform moderators. In order to guarantee the enforcement of a consistent policy, moderators are provided with detailed guidelines. In contrast, most state-of-the-art models learn what abuse is from labelled examples and as a result base their predictions on spurious cues, such as the presence of group identifiers, which can be unreliable. In this work we introduce the concept of policy-aware abuse detection, abandoning the unrealistic expectation that systems can reliably learn which phenomena constitute abuse from inspecting the data alone. We propose a machine-friendly representation of the policy that moderators wish to enforce, by breaking it down into a collection of intents and slots. We collect and annotate a dataset of 3,535 English posts with such slots, and show how architectures for intent classification and slot filling can be used for abuse detection, while providing a rationale for model decisions. ",
    "url": "https://arxiv.org/abs/2210.02659",
    "authors": [
      "Agostina Calabrese",
      "Björn Ross",
      "Mirella Lapata"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.02673",
    "title": "On the Interplay Between Deadline-Constrained Traffic and the Number of  Allowed Retransmissions in Random Access Networks",
    "abstract": "In this paper, a network comprising wireless devices equipped with buffers transmitting deadline-constrained data packets over a slotted-ALOHA random-access channel is studied. Although communication protocols facilitating retransmissions increase reliability, packet transmission from the queue experiences delays and thus, packets with time constraints might be dropped before being successfully transmitted, while at the same time causing the queue size of the buffer to increase. Towards understanding the trade-off between reliability and delays that might lead to packet drops due to the deadline-constrained bursty traffic with retransmissions, a scenario of a wireless network utilizing a slotted-ALOHA random-access channel is investigated. The main focus is to reveal and investigate further the trade-off between the number of retransmissions and the packet deadline as a function of the arrival rate. Hence, we are able to determine numerically the optimal probability of transmissions and number of retransmissions, given the packet arrival rate and the packet deadline. The analysis of the system was done by means of discrete-time Markov chains. Two scenarios are studied: i) the collision channel model (in which a receiver can decode only when a single packet is transmitted), and ii) the case for which receivers have multi-packet reception capabilities. A performance evaluation for a user with different transmit probability and number of retransmissions is conducted, demonstrating their impact on the average drop rate and throughput, while at the same time showing that there exists a set of values, under which improved performance can be acquired. ",
    "url": "https://arxiv.org/abs/2210.02673",
    "authors": [
      "Nikolaos Nomikos",
      "Themistoklis Charalambous",
      "Yvonne-Anne Pignolet",
      "Nikolaos Pappas"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2210.02678",
    "title": "Effective Metaheuristic Based Classifiers for Multiclass Intrusion  Detection",
    "abstract": "Network security has become the biggest concern in the area of cyber security because of the exponential growth in computer networks and applications. Intrusion detection plays an important role in the security of information systems or networks devices. The purpose of an intrusion detection system (IDS) is to detect malicious activities and then generate an alarm against these activities. Having a large amount of data is one of the key problems in detecting attacks. Most of the intrusion detection systems use all features of datasets to evaluate the models and result in is, low detection rate, high computational time and uses of many computer resources. For fast attacks detection IDS needs a lightweight data. A feature selection method plays a key role to select best features to achieve maximum accuracy. This research work conduct experiments by considering on two updated attacks datasets, UNSW-NB15 and CICDDoS2019. This work suggests a wrapper based Genetic Algorithm (GA) features selection method with ensemble classifiers. GA select the best feature subsets and achieve high accuracy, detection rate (DR) and low false alarm rate (FAR) compared to existing approaches. This research focuses on multi-class classification. Implements two ensemble methods: stacking and bagging to detect different types of attacks. The results show that GA improve the accuracy significantly with stacking ensemble classifier. ",
    "url": "https://arxiv.org/abs/2210.02678",
    "authors": [
      "Zareen Fatima",
      "Arshad Ali"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02685",
    "title": "A Real2Sim2Real Method for Robust Object Grasping with Neural Surface  Reconstruction",
    "abstract": "Recent 3D-based manipulation methods either directly predict the grasp pose using 3D neural networks, or solve the grasp pose using similar objects retrieved from shape databases. However, the former faces generalizability challenges when testing with new robot arms or unseen objects; and the latter assumes that similar objects exist in the databases. We hypothesize that recent 3D modeling methods provides a path towards building digital replica of the evaluation scene that affords physical simulation and supports robust manipulation algorithm learning. We propose to reconstruct high-quality meshes from real-world point clouds using state-of-the-art neural surface reconstruction method (the Real2Sim step). Because most simulators take meshes for fast simulation, the reconstructed meshes enable grasp pose labels generation without human efforts. The generated labels can train grasp network that performs robustly in the real evaluation scene (the Sim2Real step). In synthetic and real experiments, we show that the Real2Sim2Real pipeline performs better than baseline grasp networks trained with a large dataset and a grasp sampling method with retrieval-based reconstruction. The benefit of the Real2Sim2Real pipeline comes from 1) decoupling scene modeling and grasp sampling into sub-problems, and 2) both sub-problems can be solved with sufficiently high quality using recent 3D learning algorithms and mesh-based physical simulation techniques. ",
    "url": "https://arxiv.org/abs/2210.02685",
    "authors": [
      "Luobin Wang",
      "Runlin Guo",
      "Quan Vuong",
      "Yuzhe Qin",
      "Hao Su",
      "Henrik Christensen"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2210.02689",
    "title": "Neural Matching Fields: Implicit Representation of Matching Fields for  Visual Correspondence",
    "abstract": "Existing pipelines of semantic correspondence commonly include extracting high-level semantic features for the invariance against intra-class variations and background clutters. This architecture, however, inevitably results in a low-resolution matching field that additionally requires an ad-hoc interpolation process as a post-processing for converting it into a high-resolution one, certainly limiting the overall performance of matching results. To overcome this, inspired by recent success of implicit neural representation, we present a novel method for semantic correspondence, called Neural Matching Field (NeMF). However, complicacy and high-dimensionality of a 4D matching field are the major hindrances, which we propose a cost embedding network to process a coarse cost volume to use as a guidance for establishing high-precision matching field through the following fully-connected network. Nevertheless, learning a high-dimensional matching field remains challenging mainly due to computational complexity, since a naive exhaustive inference would require querying from all pixels in the 4D space to infer pixel-wise correspondences. To overcome this, we propose adequate training and inference procedures, which in the training phase, we randomly sample matching candidates and in the inference phase, we iteratively performs PatchMatch-based inference and coordinate optimization at test time. With these combined, competitive results are attained on several standard benchmarks for semantic correspondence. Code and pre-trained weights are available at https://ku-cvlab.github.io/NeMF/. ",
    "url": "https://arxiv.org/abs/2210.02689",
    "authors": [
      "Sunghwan Hong",
      "Jisu Nam",
      "Seokju Cho",
      "Susung Hong",
      "Sangryul Jeon",
      "Dongbo Min",
      "Seungryong Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.02692",
    "title": "Safety-based Speed Control of a Wheelchair using Robust Adaptive Model  Predictive Control",
    "abstract": "Electric-powered wheelchair plays an important role in providing accessibility for people with mobility impairment. Ensuring the safety of wheelchair operation in different application scenarios and for diverse users is crucial when the designing controller for tracking tasks. In this work, we propose a safety-based speed tracking control algorithm for wheelchair systems with external disturbances and uncertain parameters at the dynamic level. The set-membership approach is applied to estimate the sets of uncertain parameters online and a designed model predictive control scheme with online model and control parameter adaptation is presented to guarantee safety-related constraints during the tracking process. The proposed controller can drive the wheelchair speed to a desired reference within safety constraints. For the inadmissible reference that violates the constraints, the proposed controller can steer the system to the neighbourhood of the closest admissible reference. The effectiveness of the proposed control scheme is validated based on the high-fidelity speed tracking results of two tasks that involve feasible and infeasible references. ",
    "url": "https://arxiv.org/abs/2210.02692",
    "authors": [
      "Meng Yuan",
      "Ye Wang",
      "Lei Li",
      "Tianyou Chai",
      "Wei Tech Ang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2210.02694",
    "title": "Probabilistic partition of unity networks for high-dimensional  regression problems",
    "abstract": "We explore the probabilistic partition of unity network (PPOU-Net) model in the context of high-dimensional regression problems. With the PPOU-Nets, the target function for any given input is approximated by a mixture of experts model, where each cluster is associated with a fixed-degree polynomial. The weights of the clusters are determined by a DNN that defines a partition of unity. The weighted average of the polynomials approximates the target function and produces uncertainty quantification naturally. Our training strategy leverages automatic differentiation and the expectation maximization (EM) algorithm. During the training, we (i) apply gradient descent to update the DNN coefficients; (ii) update the polynomial coefficients using weighted least-squares solves; and (iii) compute the variance of each cluster according to a closed-form formula derived from the EM algorithm. The PPOU-Nets consistently outperform the baseline fully-connected neural networks of comparable sizes in numerical experiments of various data dimensions. We also explore the proposed model in applications of quantum computing, where the PPOU-Nets act as surrogate models for cost landscapes associated with variational quantum circuits. ",
    "url": "https://arxiv.org/abs/2210.02694",
    "authors": [
      "Tiffany Fan",
      "Nathaniel Trask",
      "Marta D'Elia",
      "Eric Darve"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2210.02702",
    "title": "Block-Structured Optimization for Subgraph Detection in Interdependent  Networks",
    "abstract": "We propose a generalized framework for block-structured nonconvex optimization, which can be applied to structured subgraph detection in interdependent networks, such as multi-layer networks, temporal networks, networks of networks, and many others. Specifically, we design an effective, efficient, and parallelizable projection algorithm, namely Graph Block-structured Gradient Projection (GBGP), to optimize a general non-linear function subject to graph-structured constraints. We prove that our algorithm: 1) runs in nearly-linear time on the network size; 2) enjoys a theoretical approximation guarantee. Moreover, we demonstrate how our framework can be applied to two very practical applications and conduct comprehensive experiments to show the effectiveness and efficiency of our proposed algorithm. ",
    "url": "https://arxiv.org/abs/2210.02702",
    "authors": [
      "Fei Jie",
      "Chunpai Wang",
      "Feng Chen",
      "Lei Li",
      "Xindong Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.02703",
    "title": "Teaching Neural Module Networks to Do Arithmetic",
    "abstract": "Answering complex questions that require multi-step multi-type reasoning over raw text is challenging, especially when conducting numerical reasoning. Neural Module Networks(NMNs), follow the programmer-interpreter framework and design trainable modules to learn different reasoning skills. However, NMNs only have limited reasoning abilities, and lack numerical reasoning capability. We up-grade NMNs by: (a) bridging the gap between its interpreter and the complex questions; (b) introducing addition and subtraction modules that perform numerical reasoning over numbers. On a subset of DROP, experimental results show that our proposed methods enhance NMNs' numerical reasoning skills by 17.7% improvement of F1 score and significantly outperform previous state-of-the-art models. ",
    "url": "https://arxiv.org/abs/2210.02703",
    "authors": [
      "Jiayi Chen",
      "Xiao-Yu Guo",
      "Yuan-Fang Li",
      "Gholamreza Haffari"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.02713",
    "title": "On Optimal Learning Under Targeted Data Poisoning",
    "abstract": "Consider the task of learning a hypothesis class $\\mathcal{H}$ in the presence of an adversary that can replace up to an $\\eta$ fraction of the examples in the training set with arbitrary adversarial examples. The adversary aims to fail the learner on a particular target test point $x$ which is known to the adversary but not to the learner. In this work we aim to characterize the smallest achievable error $\\epsilon=\\epsilon(\\eta)$ by the learner in the presence of such an adversary in both realizable and agnostic settings. We fully achieve this in the realizable setting, proving that $\\epsilon=\\Theta(\\mathtt{VC}(\\mathcal{H})\\cdot \\eta)$, where $\\mathtt{VC}(\\mathcal{H})$ is the VC dimension of $\\mathcal{H}$. Remarkably, we show that the upper bound can be attained by a deterministic learner. In the agnostic setting we reveal a more elaborate landscape: we devise a deterministic learner with a multiplicative regret guarantee of $\\epsilon \\leq C\\cdot\\mathtt{OPT} + O(\\mathtt{VC}(\\mathcal{H})\\cdot \\eta)$, where $C > 1$ is a universal numerical constant. We complement this by showing that for any deterministic learner there is an attack which worsens its error to at least $2\\cdot \\mathtt{OPT}$. This implies that a multiplicative deterioration in the regret is unavoidable in this case. Finally, the algorithms we develop for achieving the optimal rates are inherently improper. Nevertheless, we show that for a variety of natural concept classes, such as linear classifiers, it is possible to retain the dependence $\\epsilon=\\Theta_{\\mathcal{H}}(\\eta)$ by a proper algorithm in the realizable setting. Here $\\Theta_{\\mathcal{H}}$ conceals a polynomial dependence on $\\mathtt{VC}(\\mathcal{H})$. ",
    "url": "https://arxiv.org/abs/2210.02713",
    "authors": [
      "Steve Hanneke",
      "Amin Karbasi",
      "Mohammad Mahmoody",
      "Idan Mehalel",
      "Shay Moran"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2210.02717",
    "title": "Analysis of IRS-Assisted Downlink Wireless Networks over Generalized  Fading",
    "abstract": "Future wireless networks are expected to provide high spectral efficiency, low hardware cost, and scalable connectivity. An appealing option to meet these requirements is the intelligent reflective surface (IRS), which guarantees a smart propagation environment by adjusting the phase shift and direction of received signals. However, the composite channel of IRS-assisted wireless networks, which is composed of a direct link and cascaded link aided by the IRS, has made it challenging to carry out system design and analysis. This motivates us to find tractable and accurate channel modeling methods to model multiple types of channels. To this end, we adopt mixture Gamma distributions to model the direct link, the cascaded link, and the mixture channel. Moreover, this channel modeling method can be applied to various transmission environments with an arbitrary type of fading as the underlying fading of each link. Additionally, a unified stochastic geometric framework is introduced based on this tractable channel model. First, we derived distributions of the cascaded link and the mixture channel by proving multipliability and quadratic form of mixture Gamma distributed channels. Then, we carried out a stochastic geometric analysis of the system performance of the IRS-assisted wireless network with the proposed channel modeling method. Our simulation shows that the mixture Gamma distributed approximation method guarantees high accuracy and promotes the feasibility of system performance analysis of IRS-assisted networks with complicated propagation environments, especially with a generalized fading model. Furthermore, the proposed analytical framework provides positive insights into the system design regarding reliability and efficiency. ",
    "url": "https://arxiv.org/abs/2210.02717",
    "authors": [
      "Yunli Li",
      "Young Jin Chun"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2210.02719",
    "title": "Continuous Diagnosis and Prognosis by Controlling the Update Process of  Deep Neural Networks",
    "abstract": "Continuous diagnosis and prognosis are essential for intensive care patients. It can provide more opportunities for timely treatment and rational resource allocation, especially for sepsis, a main cause of death in ICU, and COVID-19, a new worldwide epidemic. Although deep learning methods have shown their great superiority in many medical tasks, they tend to catastrophically forget, over fit, and get results too late when performing diagnosis and prognosis in the continuous mode. In this work, we summarized the three requirements of this task, proposed a new concept, continuous classification of time series (CCTS), and designed a novel model training method, restricted update strategy of neural networks (RU). In the context of continuous prognosis, our method outperformed all baselines and achieved the average accuracy of 90%, 97%, and 85% on sepsis prognosis, COVID-19 mortality prediction, and eight diseases classification. Superiorly, our method can also endow deep learning with interpretability, having the potential to explore disease mechanisms and provide a new horizon for medical research. We have achieved disease staging for sepsis and COVID-19, discovering four stages and three stages with their typical biomarkers respectively. Further, our method is a data-agnostic and model-agnostic plug-in, it can be used to continuously prognose other diseases with staging and even implement CCTS in other fields. ",
    "url": "https://arxiv.org/abs/2210.02719",
    "authors": [
      "Chenxi Sun",
      "Hongyan Li",
      "Moxian Song",
      "Derun Cai",
      "Baofeng Zhang",
      "Shenda Hong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02733",
    "title": "FedGraph: an Aggregation Method from Graph Perspective",
    "abstract": "With the increasingly strengthened data privacy act and the difficult data centralization, Federated Learning (FL) has become an effective solution to collaboratively train the model while preserving each client's privacy. FedAvg is a standard aggregation algorithm that makes the proportion of dataset size of each client as aggregation weight. However, it can't deal with non-independent and identically distributed (non-i.i.d) data well because of its fixed aggregation weights and the neglect of data distribution. In this paper, we propose an aggregation strategy that can effectively deal with non-i.i.d dataset, namely FedGraph, which can adjust the aggregation weights adaptively according to the training condition of local models in whole training process. The FedGraph takes three factors into account from coarse to fine: the proportion of each local dataset size, the topology factor of model graphs, and the model weights. We calculate the gravitational force between local models by transforming the local models into topology graphs. The FedGraph can explore the internal correlation between local models better through the weighted combination of the proportion each local dataset, topology structure, and model weights. The proposed FedGraph has been applied to the MICCAI Federated Tumor Segmentation Challenge 2021 (FeTS) datasets, and the validation results show that our method surpasses the previous state-of-the-art by 2.76 mean Dice Similarity Score. The source code will be available at Github. ",
    "url": "https://arxiv.org/abs/2210.02733",
    "authors": [
      "Zhifang Deng",
      "Xiaohong Huang",
      "Dandan Li",
      "Xueguang Yuan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.02737",
    "title": "Spatial-Temporal Graph Convolutional Gated Recurrent Network for Traffic  Forecasting",
    "abstract": "As an important part of intelligent transportation systems, traffic forecasting has attracted tremendous attention from academia and industry. Despite a lot of methods being proposed for traffic forecasting, it is still difficult to model complex spatial-temporal dependency. Temporal dependency includes short-term dependency and long-term dependency, and the latter is often overlooked. Spatial dependency can be divided into two parts: distance-based spatial dependency and hidden spatial dependency. To model complex spatial-temporal dependency, we propose a novel framework for traffic forecasting, named Spatial-Temporal Graph Convolutional Gated Recurrent Network (STGCGRN). We design an attention module to capture long-term dependency by mining periodic information in traffic data. We propose a Double Graph Convolution Gated Recurrent Unit (DGCGRU) to capture spatial dependency, which integrates graph convolutional network and GRU. The graph convolution part models distance-based spatial dependency with the distance-based predefined adjacency matrix and hidden spatial dependency with the self-adaptive adjacency matrix, respectively. Specially, we employ the multi-head mechanism to capture multiple hidden dependencies. In addition, the periodic pattern of each prediction node may be different, which is often ignored, resulting in mutual interference of periodic information among nodes when modeling spatial dependency. For this, we explore the architecture of model and improve the performance. Experiments on four datasets demonstrate the superior performance of our model. ",
    "url": "https://arxiv.org/abs/2210.02737",
    "authors": [
      "Le Zhao",
      "Mingcai Chen",
      "Yuntao Du",
      "Haiyang Yang",
      "Chongjun Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02746",
    "title": "The Sound of Silence: Efficiency of First Digit Features in Synthetic  Audio Detection",
    "abstract": "The recent integration of generative neural strategies and audio processing techniques have fostered the widespread of synthetic speech synthesis or transformation algorithms. This capability proves to be harmful in many legal and informative processes (news, biometric authentication, audio evidence in courts, etc.). Thus, the development of efficient detection algorithms is both crucial and challenging due to the heterogeneity of forgery techniques. This work investigates the discriminative role of silenced parts in synthetic speech detection and shows how first digit statistics extracted from MFCC coefficients can efficiently enable a robust detection. The proposed procedure is computationally-lightweight and effective on many different algorithms since it does not rely on large neural detection architecture and obtains an accuracy above 90\\% in most of the classes of the ASVSpoof dataset. ",
    "url": "https://arxiv.org/abs/2210.02746",
    "authors": [
      "Daniele Mari",
      "Federica Latora",
      "Simone Milani"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2210.02753",
    "title": "Communities as Vague Operators: Epistemological Questions for a Critical  Heuristics of Community Detection Algorithms",
    "abstract": "In this article, we aim to analyse the nature and epistemic consequences of what figures in network science as patterns of nodes and edges called 'communities'. Tracing these as multi-faceted and ambivalent, we propose to describe the concept of community as a 'vague operator' related to Susan Leigh Star's notion of the boundary object but more loose, like a collection of hints, and propose that the ability to construct different modes of faceting that are both vague and hyper-precise, in semiotic, technical and social terms is core both to digital politics and the analysis of 'communities'. Engaging with these formations in terms drawn from mathematics and software studies enables a wider mapping of their formation. Disentangling different lineages in network science then allows us to contextualise the founding account of 'community' popularised by Michelle Girvan and Mark Newman in 2002. After studying one particular community detection algorithm, the so called 'Louvain algorithm', we comment on controversies arising with some of their more ambiguous applications. We argue that 'community' can act as a real abstraction with the power to reshape social relations such as producing echo chambers in social networking sites. To rework the epistemological terms of community detection, we draw on debates and propositions in the literature of network science to imagine a 'critical heuristics' that embraces partiality, epistemic humbleness, reflexivity and artificiality. ",
    "url": "https://arxiv.org/abs/2210.02753",
    "authors": [
      "Dominik Schindler",
      "Matthew Fuller"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2210.02760",
    "title": "Cyber-Resilient Privacy Preservation and Secure Billing Approach for  Smart Energy Metering Devices",
    "abstract": "Most of the smart applications, such as smart energy metering devices, demand strong privacy preservation to strengthen data privacy. However, it is difficult to protect the privacy of the smart device data, especially on the client side. It is mainly because payment for billing is computed by the server deployed at the client's side, and it is highly challenging to prevent the leakage of client's information to unauthorised users. Various researchers have discussed this problem and have proposed different privacy preservation techniques. Conventional techniques suffer from the problem of high computational and communication overload on the client side. In addition, the performance of these techniques deteriorates due to computational complexity and their inability to handle the security of large-scale data. Due to these limitations, it becomes easy for the attackers to introduce malicious attacks on the server, posing a significant threat to data security. In this context, this proposal intends to design novel privacy preservation and secure billing framework using deep learning techniques to ensure data security in smart energy metering devices. This research aims to overcome the limitations of the existing techniques to achieve robust privacy preservation in smart devices and increase the cyber resilience of these devices. ",
    "url": "https://arxiv.org/abs/2210.02760",
    "authors": [
      "Venkatesh Kumar M"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Information Retrieval (cs.IR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2210.02766",
    "title": "AutoQC: Automated Synthesis of Quantum Circuits Using Neural Network",
    "abstract": "While the ability to build quantum computers is improving dramatically, developing quantum algorithms is limited and relies on human insight and ingenuity. Although a number of quantum programming languages have been developed, it is challenging for software developers who are not familiar with quantum computing to learn and use these languages. It is, therefore, necessary to develop tools to support developing new quantum algorithms and programs automatically. This paper proposes AutoQC, an approach to automatically synthesizing quantum circuits using the neural network from input and output pairs. We consider a quantum circuit a sequence of quantum gates and synthesize a quantum circuit probabilistically by prioritizing with a neural network at each step. The experimental results highlight the ability of AutoQC to synthesize some essential quantum circuits at a lower cost. ",
    "url": "https://arxiv.org/abs/2210.02766",
    "authors": [
      "Kentaro Murakami",
      "Jianjun Zhao"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2210.02808",
    "title": "Effective Self-supervised Pre-training on Low-compute networks without  Distillation",
    "abstract": "Despite the impressive progress of self-supervised learning (SSL), its applicability to low-compute networks has received limited attention. Reported performance has trailed behind standard supervised pre-training by a large margin, barring self-supervised learning from making an impact on models that are deployed on device. Most prior works attribute this poor performance to the capacity bottleneck of the low-compute networks and opt to bypass the problem through the use of knowledge distillation (KD). In this work, we revisit SSL for efficient neural networks, taking a closer at what are the detrimental factors causing the practical limitations, and whether they are intrinsic to the self-supervised low-compute setting. We find that, contrary to accepted knowledge, there is no intrinsic architectural bottleneck, we diagnose that the performance bottleneck is related to the model complexity vs regularization strength trade-off. In particular, we start by empirically observing that the use of local views can have a dramatic impact on the effectiveness of the SSL methods. This hints at view sampling being one of the performance bottlenecks for SSL on low-capacity networks. We hypothesize that the view sampling strategy for large neural networks, which requires matching views in very diverse spatial scales and contexts, is too demanding for low-capacity architectures. We systematize the design of the view sampling mechanism, leading to a new training methodology that consistently improves the performance across different SSL methods (e.g. MoCo-v2, SwAV, DINO), different low-size networks (e.g. MobileNetV2, ResNet18, ResNet34, ViT-Ti), and different tasks (linear probe, object detection, instance segmentation and semi-supervised learning). Our best models establish a new state-of-the-art for SSL methods on low-compute networks despite not using a KD loss term. ",
    "url": "https://arxiv.org/abs/2210.02808",
    "authors": [
      "Fuwen Tan",
      "Fatemeh Saleh",
      "Brais Martinez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.02834",
    "title": "Robust Double-Encoder Network for RGB-D Panoptic Segmentation",
    "abstract": "Perception is crucial for robots that act in real-world environments, as autonomous systems need to see and understand the world around them to act appropriately. Panoptic segmentation provides an interpretation of the scene by computing a pixel-wise semantic label together with instance IDs. In this paper, we address panoptic segmentation using RGB-D data of indoor scenes. We propose a novel encoder-decoder neural network that processes RGB and depth separately through two encoders. The features of the individual encoders are progressively merged at different resolutions, such that the RGB features are enhanced using complementary depth information. We propose a novel merging approach called ResidualExcite, which reweighs each entry of the feature map according to its importance. With our double-encoder architecture, we are robust to missing cues. In particular, the same model can train and infer on RGB-D, RGB-only, and depth-only input data, without the need to train specialized models. We evaluate our method on publicly available datasets and show that our approach achieves superior results compared to other common approaches for panoptic segmentation. ",
    "url": "https://arxiv.org/abs/2210.02834",
    "authors": [
      "Matteo Sodano",
      "Federico Magistri",
      "Tiziano Guadagnino",
      "Jens Behley",
      "Cyrill Stachniss"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.02835",
    "title": "Sequentially Swapping Tokens: Further on Graph Classes",
    "abstract": "We study the following variant of the 15 puzzle. Given a graph and two token placements on the vertices, we want to find a walk of the minimum length (if any exists) such that the sequence of token swappings along the walk obtains one of the given token placements from the other one. This problem was introduced as Sequential Token Swapping by Yamanaka et al. [JGAA 2019], who showed that the problem is intractable in general but polynomial-time solvable for trees, complete graphs, and cycles. In this paper, we present a polynomial-time algorithm for block-cactus graphs, which include all previously known cases. We also present general tools for showing the hardness of problem on restricted graph classes such as chordal graphs and chordal bipartite graphs. We also show that the problem is hard on grids and king's graphs, which are the graphs corresponding to the 15 puzzle and its variant with relaxed moves. ",
    "url": "https://arxiv.org/abs/2210.02835",
    "authors": [
      "Hironori Kiya",
      "Yuto Okada",
      "Hirotaka Ono",
      "Yota Otachi"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2210.02840",
    "title": "Deep Reinforcement Learning based Evasion Generative Adversarial Network  for Botnet Detection",
    "abstract": "Botnet detectors based on machine learning are potential targets for adversarial evasion attacks. Several research works employ adversarial training with samples generated from generative adversarial nets (GANs) to make the botnet detectors adept at recognising adversarial evasions. However, the synthetic evasions may not follow the original semantics of the input samples. This paper proposes a novel GAN model leveraged with deep reinforcement learning (DRL) to explore semantic aware samples and simultaneously harden its detection. A DRL agent is used to attack the discriminator of the GAN that acts as a botnet detector. The discriminator is trained on the crafted perturbations by the agent during the GAN training, which helps the GAN generator converge earlier than the case without DRL. We name this model RELEVAGAN, i.e. [\"relive a GAN\" or deep REinforcement Learning-based Evasion Generative Adversarial Network] because, with the help of DRL, it minimises the GAN's job by letting its generator explore the evasion samples within the semantic limits. During the GAN training, the attacks are conducted to adjust the discriminator weights for learning crafted perturbations by the agent. RELEVAGAN does not require adversarial training for the ML classifiers since it can act as an adversarial semantic-aware botnet detection model. Code will be available at https://github.com/rhr407/RELEVAGAN. ",
    "url": "https://arxiv.org/abs/2210.02840",
    "authors": [
      "Rizwan Hamid Randhawa",
      "Nauman Aslam",
      "Mohammad Alauthman",
      "Muhammad Khalid",
      "Husnain Rafiq"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.02841",
    "title": "Detecting Irregular Network Activity with Adversarial Learning and  Expert Feedback",
    "abstract": "Anomaly detection is a ubiquitous and challenging task relevant across many disciplines. With the vital role communication networks play in our daily lives, the security of these networks is imperative for smooth functioning of society. To this end, we propose a novel self-supervised deep learning framework CAAD for anomaly detection in wireless communication systems. Specifically, CAAD employs contrastive learning in an adversarial setup to learn effective representations of normal and anomalous behavior in wireless networks. We conduct rigorous performance comparisons of CAAD with several state-of-the-art anomaly detection techniques and verify that CAAD yields a mean performance improvement of 92.84%. Additionally, we also augment CAAD enabling it to systematically incorporate expert feedback through a novel contrastive learning feedback loop to improve the learned representations and thereby reduce prediction uncertainty (CAAD-EF). We view CAAD-EF as a novel, holistic and widely applicable solution to anomaly detection. ",
    "url": "https://arxiv.org/abs/2210.02841",
    "authors": [
      "Gopikrishna Rathinavel",
      "Nikhil Muralidhar",
      "Timothy O'Shea",
      "Naren Ramakrishnan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02843",
    "title": "CIR-Net: Cross-modality Interaction and Refinement for RGB-D Salient  Object Detection",
    "abstract": "Focusing on the issue of how to effectively capture and utilize cross-modality information in RGB-D salient object detection (SOD) task, we present a convolutional neural network (CNN) model, named CIR-Net, based on the novel cross-modality interaction and refinement. For the cross-modality interaction, 1) a progressive attention guided integration unit is proposed to sufficiently integrate RGB-D feature representations in the encoder stage, and 2) a convergence aggregation structure is proposed, which flows the RGB and depth decoding features into the corresponding RGB-D decoding streams via an importance gated fusion unit in the decoder stage. For the cross-modality refinement, we insert a refinement middleware structure between the encoder and the decoder, in which the RGB, depth, and RGB-D encoder features are further refined by successively using a self-modality attention refinement unit and a cross-modality weighting refinement unit. At last, with the gradually refined features, we predict the saliency map in the decoder stage. Extensive experiments on six popular RGB-D SOD benchmarks demonstrate that our network outperforms the state-of-the-art saliency detectors both qualitatively and quantitatively. ",
    "url": "https://arxiv.org/abs/2210.02843",
    "authors": [
      "Runmin Cong",
      "Qinwei Lin",
      "Chen Zhang",
      "Chongyi Li",
      "Xiaochun Cao",
      "Qingming Huang",
      "Yao Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.02853",
    "title": "NeuDep: Neural Binary Memory Dependence Analysis",
    "abstract": "Determining whether multiple instructions can access the same memory location is a critical task in binary analysis. It is challenging as statically computing precise alias information is undecidable in theory. The problem aggravates at the binary level due to the presence of compiler optimizations and the absence of symbols and types. Existing approaches either produce significant spurious dependencies due to conservative analysis or scale poorly to complex binaries. We present a new machine-learning-based approach to predict memory dependencies by exploiting the model's learned knowledge about how binary programs execute. Our approach features (i) a self-supervised procedure that pretrains a neural net to reason over binary code and its dynamic value flows through memory addresses, followed by (ii) supervised finetuning to infer the memory dependencies statically. To facilitate efficient learning, we develop dedicated neural architectures to encode the heterogeneous inputs (i.e., code, data values, and memory addresses from traces) with specific modules and fuse them with a composition learning strategy. We implement our approach in NeuDep and evaluate it on 41 popular software projects compiled by 2 compilers, 4 optimizations, and 4 obfuscation passes. We demonstrate that NeuDep is more precise (1.5x) and faster (3.5x) than the current state-of-the-art. Extensive probing studies on security-critical reverse engineering tasks suggest that NeuDep understands memory access patterns, learns function signatures, and is able to match indirect calls. All these tasks either assist or benefit from inferring memory dependencies. Notably, NeuDep also outperforms the current state-of-the-art on these tasks. ",
    "url": "https://arxiv.org/abs/2210.02853",
    "authors": [
      "Kexin Pei",
      "Dongdong She",
      "Michael Wang",
      "Scott Geng",
      "Zhou Xuan",
      "Yaniv David",
      "Junfeng Yang",
      "Suman Jana",
      "Baishakhi Ray"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2210.02857",
    "title": "Time Will Change Things: An Empirical Study on Dynamic Language  Understanding in Social Media Classification",
    "abstract": "Language features are ever-evolving in the real-world social media environment. Many trained models in natural language understanding (NLU), ineffective in semantic inference for unseen features, might consequently struggle with the deteriorating performance in dynamicity. To address this challenge, we empirically study social media NLU in a dynamic setup, where models are trained on the past data and test on the future. It better reflects the realistic practice compared to the commonly-adopted static setup of random data split. To further analyze model adaption to the dynamicity, we explore the usefulness of leveraging some unlabeled data created after a model is trained. The performance of unsupervised domain adaption baselines based on auto-encoding and pseudo-labeling and a joint framework coupling them both are examined in the experiments. Substantial results on four social media tasks imply the universally negative effects of evolving environments over classification accuracy, while auto-encoding and pseudo-labeling collaboratively show the best robustness in dynamicity. ",
    "url": "https://arxiv.org/abs/2210.02857",
    "authors": [
      "Yuji Zhang",
      "Jing Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.02862",
    "title": "Causal Inference for Chatting Handoff",
    "abstract": "Aiming to ensure chatbot quality by predicting chatbot failure and enabling human-agent collaboration, Machine-Human Chatting Handoff (MHCH) has attracted lots of attention from both industry and academia in recent years. However, most existing methods mainly focus on the dialogue context or assist with global satisfaction prediction based on multi-task learning, which ignore the grounded relationships among the causal variables, like the user state and labor cost. These variables are significantly associated with handoff decisions, resulting in prediction bias and cost increasement. Therefore, we propose Causal-Enhance Module (CEM) by establishing the causal graph of MHCH based on these two variables, which is a simple yet effective module and can be easy to plug into the existing MHCH methods. For the impact of users, we use the user state to correct the prediction bias according to the causal relationship of multi-task. For the labor cost, we train an auxiliary cost simulator to calculate unbiased labor cost through counterfactual learning so that a model becomes cost-aware. Extensive experiments conducted on four real-world benchmarks demonstrate the effectiveness of CEM in generally improving the performance of existing MHCH methods without any elaborated model crafting. ",
    "url": "https://arxiv.org/abs/2210.02862",
    "authors": [
      "Shanshan Zhong",
      "Jinghui Qin",
      "Zhongzhan Huang",
      "Daifeng Li"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02864",
    "title": "DBkWik++ -- Multi Source Matching of Knowledge Graphs",
    "abstract": "Large knowledge graphs like DBpedia and YAGO are always based on the same source, i.e., Wikipedia. But there are more wikis that contain information about long-tail entities such as wiki hosting platforms like Fandom. In this paper, we present the approach and analysis of DBkWik++, a fused Knowledge Graph from thousands of wikis. A modified version of the DBpedia framework is applied to each wiki which results in many isolated Knowledge Graphs. With an incremental merge based approach, we reuse one-to-one matching systems to solve the multi source KG matching task. Based on this alignment we create a consolidated knowledge graph with more than 15 million instances. ",
    "url": "https://arxiv.org/abs/2210.02864",
    "authors": [
      "Sven Hertling",
      "Heiko Paulheim"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2210.02866",
    "title": "Knowing Where to Look: A Planning-based Architecture to Automate the  Gaze Behavior of Social Robots",
    "abstract": "Gaze cues play an important role in human communication and are used to coordinate turn-taking and joint attention, as well as to regulate intimacy. In order to have fluent conversations with people, social robots need to exhibit human-like gaze behavior. Previous Gaze Control Systems (GCS) in HRI have automated robot gaze using data-driven or heuristic approaches. However, these systems tend to be mainly reactive in nature. Planning the robot gaze ahead of time could help in achieving more realistic gaze behavior and better eye-head coordination. In this paper, we propose and implement a novel planning-based GCS. We evaluate our system in a comparative within-subjects user study (N=26) between a reactive system and our proposed system. The results show that the users preferred the proposed system and that it was significantly more interpretable and better at regulating intimacy. ",
    "url": "https://arxiv.org/abs/2210.02866",
    "authors": [
      "Chinmaya Mishra",
      "Gabriel Skantze"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2210.02872",
    "title": "Text-driven Video Prediction",
    "abstract": "Current video generation models usually convert signals indicating appearance and motion received from inputs (e.g., image, text) or latent spaces (e.g., noise vectors) into consecutive frames, fulfilling a stochastic generation process for the uncertainty introduced by latent code sampling. However, this generation pattern lacks deterministic constraints for both appearance and motion, leading to uncontrollable and undesirable outcomes. To this end, we propose a new task called Text-driven Video Prediction (TVP). Taking the first frame and text caption as inputs, this task aims to synthesize the following frames. Specifically, appearance and motion components are provided by the image and caption separately. The key to addressing the TVP task depends on fully exploring the underlying motion information in text descriptions, thus facilitating plausible video generation. In fact, this task is intrinsically a cause-and-effect problem, as the text content directly influences the motion changes of frames. To investigate the capability of text in causal inference for progressive motion information, our TVP framework contains a Text Inference Module (TIM), producing step-wise embeddings to regulate motion inference for subsequent frames. In particular, a refinement mechanism incorporating global motion semantics guarantees coherent generation. Extensive experiments are conducted on Something-Something V2 and Single Moving MNIST datasets. Experimental results demonstrate that our model achieves better results over other baselines, verifying the effectiveness of the proposed framework. ",
    "url": "https://arxiv.org/abs/2210.02872",
    "authors": [
      "Xue Song",
      "Jingjing Chen",
      "Bin Zhu",
      "Yu-Gang Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.02873",
    "title": "Blockchain-based Monitoring for Poison Attack Detection in Decentralized  Federated Learning",
    "abstract": "Federated Learning (FL) is a machine learning technique that addresses the privacy challenges in terms of access rights of local datasets by enabling the training of a model across nodes holding their data samples locally. To achieve decentralized federated learning, blockchain-based FL was proposed as a distributed FL architecture. In decentralized FL, the chief is eliminated from the learning process as workers collaborate between each other to train the global model. Decentralized FL applications need to account for the additional delay incurred by blockchain-based FL deployments. Particularly in this setting, to detect targeted/untargeted poisoning attacks, we investigate the end-to-end learning completion latency of a realistic decentralized FL process protected against poisoning attacks. We propose a technique which consists in decoupling the monitoring phase from the detection phase in defenses against poisoning attacks in a decentralized federated learning deployment that aim at monitoring the behavior of the workers. We demonstrate that our proposed blockchain-based monitoring improved network scalability, robustness and time efficiency. The parallelization of operations results in minimized latency over the end-to-end communication, computation, and consensus delays incurred during the FL and blockchain operations. ",
    "url": "https://arxiv.org/abs/2210.02873",
    "authors": [
      "Ranwa Al Mallah",
      "David Lopez"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02883",
    "title": "A Novel Energy Efficiency Metric for Next Generation Wireless  Communication Networks",
    "abstract": "As a core performance metric for green communications, the conventional energy efficiency definition has successfully resolved many issues in the energy efficient wireless network design. In the past several generations of wireless communication networks, the traditional energy efficiency measure plays an important role to guide many energy saving techniques for slow varying traffic profiles. However, for the next generation wireless networks, the traditional energy efficiency fails to capture the traffic and capacity variations of wireless networks in temporal or spatial domains, which is shown to be quite popular, especially with ultra-scale multiple antennas and space-air-ground integrated network. In this paper, we present a novel energy efficiency metric named integrated relative energy efficiency (IREE), which is able to jointly measure the traffic profiles and the network capacities from the energy efficiency perspective. On top of that, the IREE based green trade-offs have been investigated and compared with the conventional energy efficient design. Moreover, we apply the IREE based green trade-offs to evaluate several candidate technologies for 6G networks, including reconfigurable intelligent surfaces and space-air-ground integrated network. Through some analytical and numerical results, we show that the proposed IREE metric is able to capture the wireless traffic and capacity mismatch property, which is significantly different from the conventional energy efficiency metric. Since the IREE oriented design or deployment strategy is able to consider the network capacity improvement and the wireless traffic matching simultaneously, it can be regarded as a useful guidance for future energy efficient network design. ",
    "url": "https://arxiv.org/abs/2210.02883",
    "authors": [
      "Tao Yu",
      "Shunqing Zhang",
      "Xiaojing Chen",
      "Xin Wang"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2210.02885",
    "title": "RankMe: Assessing the downstream performance of pretrained  self-supervised representations by their rank",
    "abstract": "Joint-Embedding Self Supervised Learning (JE-SSL) has seen a rapid development, with the emergence of many method variations and few principled guidelines that would help practitioners to successfully deploy those methods. The main reason for that pitfall actually comes from JE-SSL's core principle of not employing any input reconstruction. Without any visual clue, it becomes extremely cryptic to judge the quality of a learned representation without having access to a labelled dataset. We hope to correct those limitations by providing a single -- theoretically motivated -- criterion that reflects the quality of learned JE-SSL representations: their effective rank. Albeit simple and computationally friendly, this method -- coined RankMe -- allows one to assess the performance of JE-SSL representations, even on different downstream datasets, without requiring any labels, training or parameters to tune. Through thorough empirical experiments involving hundreds of repeated training episodes, we demonstrate how RankMe can be used for hyperparameter selection with nearly no loss in final performance compared to the current selection method that involve dataset labels. We hope that RankMe will facilitate the use of JE-SSL in domains with little or no labeled data. ",
    "url": "https://arxiv.org/abs/2210.02885",
    "authors": [
      "Quentin Garrido",
      "Randall Balestriero",
      "Laurent Najman",
      "Yann Lecun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.02887",
    "title": "DQC$^2$O: Distributed Quantum Computing for Collaborative Optimization  in Future Networks",
    "abstract": "With the advantages of high-speed parallel processing, quantum computers can efficiently solve large-scale complex optimization problems in future networks. However, due to the uncertain qubit fidelity and quantum channel noise, distributed quantum computing which relies on quantum networks connected through entanglement faces a lot of challenges for exchanging information across quantum computers. In this paper, we propose an adaptive distributed quantum computing approach to manage quantum computers and quantum channels for solving optimization tasks in future networks. Firstly, we describe the fundamentals of quantum computing and its distributed concept in quantum networks. Secondly, to address the uncertainty of future demands of collaborative optimization tasks and instability over quantum networks, we propose a quantum resource allocation scheme based on stochastic programming for minimizing quantum resource consumption. Finally, based on the proposed approach, we discuss the potential applications for collaborative optimization in future networks, such as smart grid management, IoT cooperation, and UAV trajectory planning. Promising research directions that can lead to the design and implementation of future distributed quantum computing frameworks are also highlighted. ",
    "url": "https://arxiv.org/abs/2210.02887",
    "authors": [
      "Napat Ngoenriang",
      "Minrui Xu",
      "Jiawen Kang",
      "Dusit Niyato",
      "Han Yu",
      "Xuemin",
      "Shen"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Computer Science and Game Theory (cs.GT)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2210.02899",
    "title": "Self-supervised Learning for Clustering of Wireless Spectrum Activity",
    "abstract": "In recent years, much work has been done on processing of wireless spectral data involving machine learning techniques in domain-related problems for cognitive radio networks, such as anomaly detection, modulation classification, technology classification and device fingerprinting. Most of the solutions are based on labeled data, created in a controlled manner and processed with supervised learning approaches. Labeling spectral data is a laborious and expensive process, being one of the main drawbacks of using supervised approaches. In this paper, we introduce self-supervised learning for exploring spectral activities using real-world, unlabeled data. We show that the proposed model achieves superior performance regarding the quality of extracted features and clustering performance. We achieve reduction of the feature vectors size by 2 orders of magnitude (from 3601 to 20), while improving performance by 2 to 2.5 times across the evaluation metrics, supported by visual assessment. Using 15 days of continuous narrowband spectrum sensing data, we found that 17% of the spectrogram slices contain no or very weak transmissions, 36% contain mostly IEEE 802.15.4, 26% contain coexisting IEEE 802.15.4 with LoRA and proprietary activity, 12% contain LoRA with variable background noise and 9% contain only dotted activity, representing LoRA and proprietary transmissions. ",
    "url": "https://arxiv.org/abs/2210.02899",
    "authors": [
      "Ljupcho Milosheski",
      "Gregor Cerar",
      "Blaž Bertalanič",
      "Carolina Fortuna",
      "Mihael Mohorčič"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2210.02910",
    "title": "Federated Boosted Decision Trees with Differential Privacy",
    "abstract": "There is great demand for scalable, secure, and efficient privacy-preserving machine learning models that can be trained over distributed data. While deep learning models typically achieve the best results in a centralized non-secure setting, different models can excel when privacy and communication constraints are imposed. Instead, tree-based approaches such as XGBoost have attracted much attention for their high performance and ease of use; in particular, they often achieve state-of-the-art results on tabular data. Consequently, several recent works have focused on translating Gradient Boosted Decision Tree (GBDT) models like XGBoost into federated settings, via cryptographic mechanisms such as Homomorphic Encryption (HE) and Secure Multi-Party Computation (MPC). However, these do not always provide formal privacy guarantees, or consider the full range of hyperparameters and implementation settings. In this work, we implement the GBDT model under Differential Privacy (DP). We propose a general framework that captures and extends existing approaches for differentially private decision trees. Our framework of methods is tailored to the federated setting, and we show that with a careful choice of techniques it is possible to achieve very high utility while maintaining strong levels of privacy. ",
    "url": "https://arxiv.org/abs/2210.02910",
    "authors": [
      "Samuel Maddock",
      "Graham Cormode",
      "Tianhao Wang",
      "Carsten Maple",
      "Somesh Jha"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02912",
    "title": "CANIFE: Crafting Canaries for Empirical Privacy Measurement in Federated  Learning",
    "abstract": "Federated Learning (FL) is a setting for training machine learning models in distributed environments where the clients do not share their raw data but instead send model updates to a server. However, model updates can be subject to attacks and leak private information. Differential Privacy (DP) is a leading mitigation strategy which involves adding noise to clipped model updates, trading off performance for strong theoretical privacy guarantees. Previous work has shown that the threat model of DP is conservative and that the obtained guarantees may be vacuous or may not directly translate to information leakage in practice. In this paper, we aim to achieve a tighter measurement of the model exposure by considering a realistic threat model. We propose a novel method, CANIFE, that uses canaries - carefully crafted samples by a strong adversary to evaluate the empirical privacy of a training round. We apply this attack to vision models trained on CIFAR-10 and CelebA and to language models trained on Sent140 and Shakespeare. In particular, in realistic FL scenarios, we demonstrate that the empirical epsilon obtained with CANIFE is 2-7x lower than the theoretical bound. ",
    "url": "https://arxiv.org/abs/2210.02912",
    "authors": [
      "Samuel Maddock",
      "Alexandre Sablayrolles",
      "Pierre Stock"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2210.02927",
    "title": "An Energy Balance Cluster Network Framework Based on SWIPT",
    "abstract": "Wireless NanoSensor Network (WNSN) is a brand-new type of sensor network with broad application prospects. In view of the limited energy of nano-nodes and unstable links in WNSNs, we propose an energy balance cluster network framework (EBCNF) based on Simultaneous Wireless Information and Power Transfer (SWIPT). The EBCNF framework extends the network lifetime of nanonodes and uses a clustering algorithm called EBACC (an energy balance algorithm for intra-cluster and inter-cluster nodes) to make the energy consumption of nodes more uniform. Simulation shows that the EBCNF framework can make the network energy consumption more uniform, reduce the error rate of data transmission and the average network throughput, and can be used as an effective routing framework for WNSNs. ",
    "url": "https://arxiv.org/abs/2210.02927",
    "authors": [
      "Juan Xu",
      "Ruofan Wang",
      "Yan Zhang",
      "Hongmin Huang"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2210.02933",
    "title": "Grape: Knowledge Graph Enhanced Passage Reader for Open-domain Question  Answering",
    "abstract": "A common thread of open-domain question answering (QA) models employs a retriever-reader pipeline that first retrieves a handful of relevant passages from Wikipedia and then peruses the passages to produce an answer. However, even state-of-the-art readers fail to capture the complex relationships between entities appearing in questions and retrieved passages, leading to answers that contradict the facts. In light of this, we propose a novel knowledge Graph enhanced passage reader, namely Grape, to improve the reader performance for open-domain QA. Specifically, for each pair of question and retrieved passage, we first construct a localized bipartite graph, attributed to entity embeddings extracted from the intermediate layer of the reader model. Then, a graph neural network learns relational knowledge while fusing graph and contextual representations into the hidden states of the reader model. Experiments on three open-domain QA benchmarks show Grape can improve the state-of-the-art performance by up to 2.2 exact match score with a negligible overhead increase, with the same retriever and retrieved passages. Our code is publicly available at https://github.com/jumxglhf/GRAPE. ",
    "url": "https://arxiv.org/abs/2210.02933",
    "authors": [
      "Mingxuan Ju",
      "Wenhao Yu",
      "Tong Zhao",
      "Chuxu Zhang",
      "Yanfang Ye"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.02938",
    "title": "Debiasing isn't enough! -- On the Effectiveness of Debiasing MLMs and  their Social Biases in Downstream Tasks",
    "abstract": "We study the relationship between task-agnostic intrinsic and task-specific extrinsic social bias evaluation measures for Masked Language Models (MLMs), and find that there exists only a weak correlation between these two types of evaluation measures. Moreover, we find that MLMs debiased using different methods still re-learn social biases during fine-tuning on downstream tasks. We identify the social biases in both training instances as well as their assigned labels as reasons for the discrepancy between intrinsic and extrinsic bias evaluation measurements. Overall, our findings highlight the limitations of existing MLM bias evaluation measures and raise concerns on the deployment of MLMs in downstream applications using those measures. ",
    "url": "https://arxiv.org/abs/2210.02938",
    "authors": [
      "Masahiro Kaneko",
      "Danushka Bollegala",
      "Naoaki Okazaki"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.02941",
    "title": "Augmentor or Filter? Reconsider the Role of Pre-trained Language Model  in Text Classification Augmentation",
    "abstract": "Text augmentation is one of the most effective techniques to solve the critical problem of insufficient data in text classification. Existing text augmentation methods achieve hopeful performance in few-shot text data augmentation. However, these methods usually lead to performance degeneration on public datasets due to poor quality augmentation instances. Our study shows that even employing pre-trained language models, existing text augmentation methods generate numerous low-quality instances and lead to the feature space shift problem in augmentation instances. However, we note that the pre-trained language model is good at finding low-quality instances provided that it has been fine-tuned on the target dataset. To alleviate the feature space shift and performance degeneration in existing text augmentation methods, we propose BOOSTAUG, which reconsiders the role of the language model in text augmentation and emphasizes the augmentation instance filtering rather than generation. We evaluate BOOSTAUG on both sentence-level text classification and aspect-based sentiment classification. The experimental results on seven commonly used text classification datasets show that our augmentation method obtains state-of-the-art performance. Moreover, BOOSTAUG is a flexible framework; we release the code which can help improve existing augmentation methods. ",
    "url": "https://arxiv.org/abs/2210.02941",
    "authors": [
      "Heng Yang",
      "Ke Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.02959",
    "title": "POPNASv2: An Efficient Multi-Objective Neural Architecture Search  Technique",
    "abstract": "Automating the research for the best neural network model is a task that has gained more and more relevance in the last few years. In this context, Neural Architecture Search (NAS) represents the most effective technique whose results rival the state of the art hand-crafted architectures. However, this approach requires a lot of computational capabilities as well as research time, which makes prohibitive its usage in many real-world scenarios. With its sequential model-based optimization strategy, Progressive Neural Architecture Search (PNAS) represents a possible step forward to face this resources issue. Despite the quality of the found network architectures, this technique is still limited in research time. A significant step in this direction has been done by Pareto-Optimal Progressive Neural Architecture Search (POPNAS), which expands PNAS with a time predictor to enable a trade-off between search time and accuracy, considering a multi-objective optimization problem. This paper proposes a new version of the Pareto-Optimal Progressive Neural Architecture Search, called POPNASv2. Our approach enhances its first version and improves its performance. We expanded the search space by adding new operators and improved the quality of both predictors to build more accurate Pareto fronts. Moreover, we introduced cell equivalence checks and enriched the search strategy with an adaptive greedy exploration step. Our efforts allow POPNASv2 to achieve PNAS-like performance with an average 4x factor search time speed-up. ",
    "url": "https://arxiv.org/abs/2210.02959",
    "authors": [
      "Andrea Falanti",
      "Eugenio Lomurno",
      "Stefano Samele",
      "Danilo Ardagna",
      "Matteo Matteucci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.02964",
    "title": "Designing a Robust Low-Level Agnostic Controller for a Quadrotor with  Actor-Critic Reinforcement Learning",
    "abstract": "Purpose: Real-life applications using quadrotors introduce a number of disturbances and time-varying properties that pose a challenge to flight controllers. We observed that, when a quadrotor is tasked with picking up and dropping a payload, traditional PID and RL-based controllers found in literature struggle to maintain flight after the vehicle changes its dynamics due to interaction with this external object. Methods: In this work, we introduce domain randomization during the training phase of a low-level waypoint guidance controller based on Soft Actor-Critic. The resulting controller is evaluated on the proposed payload pick up and drop task with added disturbances that emulate real-life operation of the vehicle. Results & Conclusion: We show that, by introducing a certain degree of uncertainty in quadrotor dynamics during training, we can obtain a controller that is capable to perform the proposed task using a larger variation of quadrotor parameters. Additionally, the RL-based controller outperforms a traditional positional PID controller with optimized gains in this task, while remaining agnostic to different simulation parameters. ",
    "url": "https://arxiv.org/abs/2210.02964",
    "authors": [
      "Guilherme Siqueira Eduardo",
      "Wouter Caarls"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02967",
    "title": "Few-shot Generation of Personalized Neural Surrogates for Cardiac  Simulation via Bayesian Meta-Learning",
    "abstract": "Clinical adoption of personalized virtual heart simulations faces challenges in model personalization and expensive computation. While an ideal solution is an efficient neural surrogate that at the same time is personalized to an individual subject, the state-of-the-art is either concerned with personalizing an expensive simulation model, or learning an efficient yet generic surrogate. This paper presents a completely new concept to achieve personalized neural surrogates in a single coherent framework of meta-learning (metaPNS). Instead of learning a single neural surrogate, we pursue the process of learning a personalized neural surrogate using a small amount of context data from a subject, in a novel formulation of few-shot generative modeling underpinned by: 1) a set-conditioned neural surrogate for cardiac simulation that, conditioned on subject-specific context data, learns to generate query simulations not included in the context set, and 2) a meta-model of amortized variational inference that learns to condition the neural surrogate via simple feed-forward embedding of context data. As test time, metaPNS delivers a personalized neural surrogate by fast feed-forward embedding of a small and flexible number of data available from an individual, achieving -- for the first time -- personalization and surrogate construction for expensive simulations in one end-to-end learning framework. Synthetic and real-data experiments demonstrated that metaPNS was able to improve personalization and predictive accuracy in comparison to conventionally-optimized cardiac simulation models, at a fraction of computation. ",
    "url": "https://arxiv.org/abs/2210.02967",
    "authors": [
      "Xiajun Jiang",
      "Zhiyuan Li",
      "Ryan Missel",
      "Md Shakil Zaman",
      "Brian Zenger",
      "Wilson W. Good",
      "Rob S. MacLeod",
      "John L. Sapp",
      "Linwei Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02971",
    "title": "Robust tube-based LPV-MPC for autonomous lane keeping",
    "abstract": "This paper proposes a control architecture for autonomous lane keeping by a vehicle. In this paper, the vehicle dynamics consist of two parts: lateral and longitudinal dynamics. Therefore, the control architecture comprises two subsequent controllers. A longitudinal model predictive control (MPC) makes the vehicle track the desired longitudinal speeds that are assumed to be generated by a speed planner. The longitudinal speeds are then passed to a lateral MPC for lane keeping. Due to the dependence of the lateral dynamics on the longitudinal speed, they are represented in a linear parameter-varying (LPV) form, where its scheduling parameter is the longitudinal speed of the vehicle. In order to deal with the imprecise information of the future longitudinal speed (the scheduling parameter), a bound of uncertainty is considered around the nominal trajectory of the future longitudinal velocities. Then, a tube-based LPV- MPC is adopted to control the lateral dynamics for attaining the lane keeping goal. In the end, the effectiveness of the proposed methods is illustrated by carrying out simulation tests. ",
    "url": "https://arxiv.org/abs/2210.02971",
    "authors": [
      "Maryam Nezami",
      "Hossam Seddik Abbas",
      "Ngoc Thinh Nguyen",
      "Georg Schildbach"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2210.02997",
    "title": "Expander Graph Propagation",
    "abstract": "Deploying graph neural networks (GNNs) on whole-graph classification or regression tasks is known to be challenging: it often requires computing node features that are mindful of both local interactions in their neighbourhood and the global context of the graph structure. GNN architectures that navigate this space need to avoid pathological behaviours, such as bottlenecks and oversquashing, while ideally having linear time and space complexity requirements. In this work, we propose an elegant approach based on propagating information over expander graphs. We provide an efficient method for constructing expander graphs of a given size, and use this insight to propose the EGP model. We show that EGP is able to address all of the above concerns, while requiring minimal effort to set up, and provide evidence of its empirical utility on relevant datasets and baselines in the Open Graph Benchmark. Importantly, using expander graphs as a template for message passing necessarily gives rise to negative curvature. While this appears to be counterintuitive in light of recent related work on oversquashing, we theoretically demonstrate that negatively curved edges are likely to be required to obtain scalable message passing without bottlenecks. To the best of our knowledge, this is a previously unstudied result in the context of graph representation learning, and we believe our analysis paves the way to a novel class of scalable methods to counter oversquashing in GNNs. ",
    "url": "https://arxiv.org/abs/2210.02997",
    "authors": [
      "Andreea Deac",
      "Marc Lackenby",
      "Petar Veličković"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Combinatorics (math.CO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2210.03003",
    "title": "Enhancing Code Classification by Mixup-Based Data Augmentation",
    "abstract": "Recently, deep neural networks (DNNs) have been widely applied in programming language understanding. Generally, training a DNN model with competitive performance requires massive and high-quality labeled training data. However, collecting and labeling such data is time-consuming and labor-intensive. To tackle this issue, data augmentation has been a popular solution, which delicately increases the training data size, e.g., adversarial example generation. However, few works focus on employing it for programming language-related tasks. In this paper, we propose a Mixup-based data augmentation approach, MixCode, to enhance the source code classification task. First, we utilize multiple code refactoring methods to generate label-consistent code data. Second, the Mixup technique is employed to mix the original code and transformed code to form the new training data to train the model. We evaluate MixCode on two programming languages (JAVA and Python), two code tasks (problem classification and bug detection), four datasets (JAVA250, Python800, CodRep1, and Refactory), and 5 model architectures. Experimental results demonstrate that MixCode outperforms the standard data augmentation baseline by up to 6.24\\% accuracy improvement and 26.06\\% robustness improvement. ",
    "url": "https://arxiv.org/abs/2210.03003",
    "authors": [
      "Zeming Dong",
      "Qiang Hu",
      "Yuejun Guo",
      "Maxime Cordy",
      "Mike Papadakis",
      "Yves Le Traon",
      "Jianjun Zhao"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.03008",
    "title": "Residual-based error correction for neural operator accelerated  infinite-dimensional Bayesian inverse problems",
    "abstract": "We explore using neural operators, or neural network representations of nonlinear maps between function spaces, to accelerate infinite-dimensional Bayesian inverse problems (BIPs) with models governed by nonlinear parametric partial differential equations (PDEs). Neural operators have gained significant attention in recent years for their ability to approximate the parameter-to-solution maps defined by PDEs using as training data solutions of PDEs at a limited number of parameter samples. The computational cost of BIPs can be drastically reduced if the large number of PDE solves required for posterior characterization are replaced with evaluations of trained neural operators. However, reducing error in the resulting BIP solutions via reducing the approximation error of the neural operators in training can be challenging and unreliable. We provide an a priori error bound result that implies certain BIPs can be ill-conditioned to the approximation error of neural operators, thus leading to inaccessible accuracy requirements in training. To reliably deploy neural operators in BIPs, we consider a strategy for enhancing the performance of neural operators, which is to correct the prediction of a trained neural operator by solving a linear variational problem based on the PDE residual. We show that a trained neural operator with error correction can achieve a quadratic reduction of its approximation error, all while retaining substantial computational speedups of posterior sampling when models are governed by highly nonlinear PDEs. The strategy is applied to two numerical examples of BIPs based on a nonlinear reaction--diffusion problem and deformation of hyperelastic materials. We demonstrate that posterior representations of the two BIPs produced using trained neural operators are greatly and consistently enhanced by error correction. ",
    "url": "https://arxiv.org/abs/2210.03008",
    "authors": [
      "Lianghao Cao",
      "Thomas O'Leary-Roseberry",
      "Prashant K. Jha",
      "J. Tinsley Oden",
      "Omar Ghattas"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)",
      "Computation (stat.CO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2210.03011",
    "title": "Uncovering the Structural Fairness in Graph Contrastive Learning",
    "abstract": "Recent studies show that graph convolutional network (GCN) often performs worse for low-degree nodes, exhibiting the so-called structural unfairness for graphs with long-tailed degree distributions prevalent in the real world. Graph contrastive learning (GCL), which marries the power of GCN and contrastive learning, has emerged as a promising self-supervised approach for learning node representations. How does GCL behave in terms of structural fairness? Surprisingly, we find that representations obtained by GCL methods are already fairer to degree bias than those learned by GCN. We theoretically show that this fairness stems from intra-community concentration and inter-community scatter properties of GCL, resulting in a much clear community structure to drive low-degree nodes away from the community boundary. Based on our theoretical analysis, we further devise a novel graph augmentation method, called GRAph contrastive learning for DEgree bias (GRADE), which applies different strategies to low- and high-degree nodes. Extensive experiments on various benchmarks and evaluation protocols validate the effectiveness of the proposed method. ",
    "url": "https://arxiv.org/abs/2210.03011",
    "authors": [
      "Ruijia Wang",
      "Xiao Wang",
      "Chuan Shi",
      "Le Song"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2210.03012",
    "title": "Fast and robust parameter estimation with uncertainty quantification for  the cardiac function",
    "abstract": "Parameter estimation and uncertainty quantification are crucial in computational cardiology, as they enable the construction of digital twins that faithfully replicate the behavior of physical patients. Robust and efficient mathematical methods must be designed to fit many model parameters starting from a few, possibly non-invasive, noisy observations. Moreover, the effective clinical translation requires short execution times and a small amount of computational resources. In the framework of Bayesian statistics, we combine Maximum a Posteriori estimation and Hamiltonian Monte Carlo to find an approximation of model parameters and their posterior distributions. To reduce the computational effort, we employ an accurate Artificial Neural Network surrogate of 3D cardiac electromechanics model coupled with a 0D cardiocirculatory model. Fast simulations and minimal memory requirements are achieved by using matrix-free methods, automatic differentiation and automatic vectorization. Furthermore, we account for the surrogate modeling error and measurement error. We perform three different in silico test cases, ranging from the ventricular function to the entire cardiovascular system, involving whole-heart mechanics, arterial and venous circulation. The proposed method is robust when high levels of signal-to-noise ratio are present in the quantities of interest in combination with a random initialization of the model parameters in suitable intervals. As a matter of fact, by employing a single central processing unit on a standard laptop and a few hours of computations, we attain small relative errors for all model parameters and we estimate posterior distributions that contain the true values inside the 90% credibility regions. With these benefits, our approach meets the requirements for clinical exploitation, while being compliant with Green Computing practices. ",
    "url": "https://arxiv.org/abs/2210.03012",
    "authors": [
      "Matteo Salvador",
      "Francesco Regazzoni",
      "Luca Dede'",
      "Alfio Quarteroni"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2210.03018",
    "title": "Measuring Fine-Grained Semantic Equivalence with Abstract Meaning  Representation",
    "abstract": "Identifying semantically equivalent sentences is important for many cross-lingual and mono-lingual NLP tasks. Current approaches to semantic equivalence take a loose, sentence-level approach to \"equivalence,\" despite previous evidence that fine-grained differences and implicit content have an effect on human understanding (Roth and Anthonio, 2021) and system performance (Briakou and Carpuat, 2021). In this work, we introduce a novel, more sensitive method of characterizing semantic equivalence that leverages Abstract Meaning Representation graph structures. We develop an approach, which can be used with either gold or automatic AMR annotations, and demonstrate that our solution is in fact finer-grained than existing corpus filtering methods and more accurate at predicting strictly equivalent sentences than existing semantic similarity metrics. We suggest that our finer-grained measure of semantic equivalence could limit the workload in the task of human post-edited machine translation and in human evaluation of sentence similarity. ",
    "url": "https://arxiv.org/abs/2210.03018",
    "authors": [
      "Shira Wein",
      "Zhuxin Wang",
      "Nathan Schneider"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.03037",
    "title": "Conversational Semantic Role Labeling with Predicate-Oriented Latent  Graph",
    "abstract": "Conversational semantic role labeling (CSRL) is a newly proposed task that uncovers the shallow semantic structures in a dialogue text. Unfortunately several important characteristics of the CSRL task have been overlooked by the existing works, such as the structural information integration, near-neighbor influence. In this work, we investigate the integration of a latent graph for CSRL. We propose to automatically induce a predicate-oriented latent graph (POLar) with a predicate-centered Gaussian mechanism, by which the nearer and informative words to the predicate will be allocated with more attention. The POLar structure is then dynamically pruned and refined so as to best fit the task need. We additionally introduce an effective dialogue-level pre-trained language model, CoDiaBERT, for better supporting multiple utterance sentences and handling the speaker coreference issue in CSRL. Our system outperforms best-performing baselines on three benchmark CSRL datasets with big margins, especially achieving over 4% F1 score improvements on the cross-utterance argument detection. Further analyses are presented to better understand the effectiveness of our proposed methods. ",
    "url": "https://arxiv.org/abs/2210.03037",
    "authors": [
      "Hao Fei",
      "Shengqiong Wu",
      "Meishan Zhang",
      "Yafeng Ren",
      "Donghong Ji"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.03043",
    "title": "Feature-Realistic Neural Fusion for Real-Time, Open Set Scene  Understanding",
    "abstract": "General scene understanding for robotics requires flexible semantic representation, so that novel objects and structures which may not have been known at training time can be identified, segmented and grouped. We present an algorithm which fuses general learned features from a standard pre-trained network into a highly efficient 3D geometric neural field representation during real-time SLAM. The fused 3D feature maps inherit the coherence of the neural field's geometry representation. This means that tiny amounts of human labelling interacting at runtime enable objects or even parts of objects to be robustly and accurately segmented in an open set manner. ",
    "url": "https://arxiv.org/abs/2210.03043",
    "authors": [
      "Kirill Mazur",
      "Edgar Sucar",
      "Andrew J. Davison"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2210.03053",
    "title": "Reinforcement Learning with Large Action Spaces for Neural Machine  Translation",
    "abstract": "Applying Reinforcement learning (RL) following maximum likelihood estimation (MLE) pre-training is a versatile method for enhancing neural machine translation (NMT) performance. However, recent work has argued that the gains produced by RL for NMT are mostly due to promoting tokens that have already received a fairly high probability in pre-training. We hypothesize that the large action space is a main obstacle to RL's effectiveness in MT, and conduct two sets of experiments that lend support to our hypothesis. First, we find that reducing the size of the vocabulary improves RL's effectiveness. Second, we find that effectively reducing the dimension of the action space without changing the vocabulary also yields notable improvement as evaluated by BLEU, semantic similarity, and human evaluation. Indeed, by initializing the network's final fully connected layer (that maps the network's internal dimension to the vocabulary dimension), with a layer that generalizes over similar actions, we obtain a substantial improvement in RL performance: 1.5 BLEU points on average. ",
    "url": "https://arxiv.org/abs/2210.03053",
    "authors": [
      "Asaf Yehudai",
      "Leshem Choshen",
      "Lior Fox",
      "Omri Abend"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.03061",
    "title": "Structure Representation Network and Uncertainty Feedback Learning for  Dense Non-Uniform Fog Removal",
    "abstract": "Few existing image defogging or dehazing methods consider dense and non-uniform particle distributions, which usually happen in smoke, dust and fog. Dealing with these dense and/or non-uniform distributions can be intractable, since fog's attenuation and airlight (or veiling effect) significantly weaken the background scene information in the input image. To address this problem, we introduce a structure-representation network with uncertainty feedback learning. Specifically, we extract the feature representations from a pre-trained Vision Transformer (DINO-ViT) module to recover the background information. To guide our network to focus on non-uniform fog areas, and then remove the fog accordingly, we introduce the uncertainty feedback learning, which produces the uncertainty maps, that have higher uncertainty in denser fog regions, and can be regarded as an attention map that represents fog's density and uneven distribution. Based on the uncertainty map, our feedback network refines our defogged output iteratively. Moreover, to handle the intractability of estimating the atmospheric light colors, we exploit the grayscale version of our input image, since it is less affected by varying light colors that are possibly present in the input image. The experimental results demonstrate the effectiveness of our method both quantitatively and qualitatively compared to the state-of-the-art methods in handling dense and non-uniform fog or smoke. ",
    "url": "https://arxiv.org/abs/2210.03061",
    "authors": [
      "Yeying Jin",
      "Wending Yan",
      "Wenhan Yang",
      "Robby T. Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.03068",
    "title": "InferES : A Natural Language Inference Corpus for Spanish Featuring  Negation-Based Contrastive and Adversarial Examples",
    "abstract": "In this paper, we present InferES - an original corpus for Natural Language Inference (NLI) in European Spanish. We propose, implement, and analyze a variety of corpus-creating strategies utilizing expert linguists and crowd workers. The objectives behind InferES are to provide high-quality data, and, at the same time to facilitate the systematic evaluation of automated systems. Specifically, we focus on measuring and improving the performance of machine learning systems on negation-based adversarial examples and their ability to generalize across out-of-distribution topics. We train two transformer models on InferES (8,055 gold examples) in a variety of scenarios. Our best model obtains 72.8% accuracy, leaving a lot of room for improvement. The \"hypothesis-only\" baseline performs only 2%-5% higher than majority, indicating much fewer annotation artifacts than prior work. We find that models trained on InferES generalize very well across topics (both in- and out-of-distribution) and perform moderately well on negation-based adversarial examples. ",
    "url": "https://arxiv.org/abs/2210.03068",
    "authors": [
      "Venelin Kovatchev",
      "Mariona Taulé"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.03069",
    "title": "A Better Way to Decay: Proximal Gradient Training Algorithms for Neural  Nets",
    "abstract": "Weight decay is one of the most widely used forms of regularization in deep learning, and has been shown to improve generalization and robustness. The optimization objective driving weight decay is a sum of losses plus a term proportional to the sum of squared weights. This paper argues that stochastic gradient descent (SGD) may be an inefficient algorithm for this objective. For neural networks with ReLU activations, solutions to the weight decay objective are equivalent to those of a different objective in which the regularization term is instead a sum of products of $\\ell_2$ (not squared) norms of the input and output weights associated each ReLU. This alternative (and effectively equivalent) regularization suggests a novel proximal gradient algorithm for network training. Theory and experiments support the new training approach, showing that it can converge much faster to the sparse solutions it shares with standard weight decay training. ",
    "url": "https://arxiv.org/abs/2210.03069",
    "authors": [
      "Liu Yang",
      "Jifan Zhang",
      "Joseph Shenouda",
      "Dimitris Papailiopoulos",
      "Kangwook Lee",
      "Robert D. Nowak"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.03080",
    "title": "Explainable Verbal Deception Detection using Transformers",
    "abstract": "People are regularly confronted with potentially deceptive statements (e.g., fake news, misleading product reviews, or lies about activities). Only few works on automated text-based deception detection have exploited the potential of deep learning approaches. A critique of deep-learning methods is their lack of interpretability, preventing us from understanding the underlying (linguistic) mechanisms involved in deception. However, recent advancements have made it possible to explain some aspects of such models. This paper proposes and evaluates six deep-learning models, including combinations of BERT (and RoBERTa), MultiHead Attention, co-attentions, and transformers. To understand how the models reach their decisions, we then examine the model's predictions with LIME. We then zoom in on vocabulary uniqueness and the correlation of LIWC categories with the outcome class (truthful vs deceptive). The findings suggest that our transformer-based models can enhance automated deception detection performances (+2.11% in accuracy) and show significant differences pertinent to the usage of LIWC features in truthful and deceptive statements. ",
    "url": "https://arxiv.org/abs/2210.03080",
    "authors": [
      "Loukas Ilias",
      "Felix Soldner",
      "Bennett Kleinberg"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.03093",
    "title": "Edge-Varying Fourier Graph Networks for Multivariate Time Series  Forecasting",
    "abstract": "The key problem in multivariate time series (MTS) analysis and forecasting aims to disclose the underlying couplings between variables that drive the co-movements. Considerable recent successful MTS methods are built with graph neural networks (GNNs) due to their essential capacity for relational modeling. However, previous work often used a static graph structure of time-series variables for modeling MTS failing to capture their ever-changing correlations over time. To this end, a fully-connected supra-graph connecting any two variables at any two timestamps is adaptively learned to capture the high-resolution variable dependencies via an efficient graph convolutional network. Specifically, we construct the Edge-Varying Fourier Graph Networks (EV-FGN) equipped with Fourier Graph Shift Operator (FGSO) which efficiently performs graph convolution in the frequency domain. As a result, a high-efficiency scale-free parameter learning scheme is derived for MTS analysis and forecasting according to the convolution theorem. Extensive experiments show that EV-FGN outperforms state-of-the-art methods on seven real-world MTS datasets. ",
    "url": "https://arxiv.org/abs/2210.03093",
    "authors": [
      "Kun Yi",
      "Qi Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.03102",
    "title": "Ambiguous Images With Human Judgments for Robust Visual Event  Classification",
    "abstract": "Contemporary vision benchmarks predominantly consider tasks on which humans can achieve near-perfect performance. However, humans are frequently presented with visual data that they cannot classify with 100% certainty, and models trained on standard vision benchmarks achieve low performance when evaluated on this data. To address this issue, we introduce a procedure for creating datasets of ambiguous images and use it to produce SQUID-E (\"Squidy\"), a collection of noisy images extracted from videos. All images are annotated with ground truth values and a test set is annotated with human uncertainty judgments. We use this dataset to characterize human uncertainty in vision tasks and evaluate existing visual event classification models. Experimental results suggest that existing vision models are not sufficiently equipped to provide meaningful outputs for ambiguous images and that datasets of this nature can be used to assess and improve such models through model training and direct evaluation of model calibration. These findings motivate large-scale ambiguous dataset creation and further research focusing on noisy visual data. ",
    "url": "https://arxiv.org/abs/2210.03102",
    "authors": [
      "Kate Sanders",
      "Reno Kriz",
      "Anqi Liu",
      "Benjamin Van Durme"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.03115",
    "title": "SimPer: Simple Self-Supervised Learning of Periodic Targets",
    "abstract": "From human physiology to environmental evolution, important processes in nature often exhibit meaningful and strong periodic or quasi-periodic changes. Due to their inherent label scarcity, learning useful representations for periodic tasks with limited or no supervision is of great benefit. Yet, existing self-supervised learning (SSL) methods overlook the intrinsic periodicity in data, and fail to learn representations that capture periodic or frequency attributes. In this paper, we present SimPer, a simple contrastive SSL regime for learning periodic information in data. To exploit the periodic inductive bias, SimPer introduces customized augmentations, feature similarity measures, and a generalized contrastive loss for learning efficient and robust periodic representations. Extensive experiments on common real-world tasks in human behavior analysis, environmental sensing, and healthcare domains verify the superior performance of SimPer compared to state-of-the-art SSL methods, highlighting its intriguing properties including better data efficiency, robustness to spurious correlations, and generalization to distribution shifts. Code and data are available at: https://github.com/YyzHarry/SimPer. ",
    "url": "https://arxiv.org/abs/2210.03115",
    "authors": [
      "Yuzhe Yang",
      "Xin Liu",
      "Jiang Wu",
      "Silviu Borac",
      "Dina Katabi",
      "Ming-Zher Poh",
      "Daniel McDuff"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.02445",
    "title": "Localizing Anatomical Landmarks in Ocular Images using Zoom-In Attentive  Networks",
    "abstract": "Localizing anatomical landmarks are important tasks in medical image analysis. However, the landmarks to be localized often lack prominent visual features. Their locations are elusive and easily confused with the background, and thus precise localization highly depends on the context formed by their surrounding areas. In addition, the required precision is usually higher than segmentation and object detection tasks. Therefore, localization has its unique challenges different from segmentation or detection. In this paper, we propose a zoom-in attentive network (ZIAN) for anatomical landmark localization in ocular images. First, a coarse-to-fine, or \"zoom-in\" strategy is utilized to learn the contextualized features in different scales. Then, an attentive fusion module is adopted to aggregate multi-scale features, which consists of 1) a co-attention network with a multiple regions-of-interest (ROIs) scheme that learns complementary features from the multiple ROIs, 2) an attention-based fusion module which integrates the multi-ROIs features and non-ROI features. We evaluated ZIAN on two open challenge tasks, i.e., the fovea localization in fundus images and scleral spur localization in AS-OCT images. Experiments show that ZIAN achieves promising performances and outperforms state-of-the-art localization methods. The source code and trained models of ZIAN are available at https://github.com/leixiaofeng-astar/OMIA9-ZIAN. ",
    "url": "https://arxiv.org/abs/2210.02445",
    "authors": [
      "Xiaofeng Lei",
      "Shaohua Li",
      "Xinxing Xu",
      "Huazhu Fu",
      "Yong Liu",
      "Yih-Chung Tham",
      "Yangqin Feng",
      "Mingrui Tan",
      "Yanyu Xu",
      "Jocelyn Hui Lin Goh",
      "Rick Siow Mong Goh",
      "Ching-Yu Cheng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02595",
    "title": "Exploration of A Self-Supervised Speech Model: A Study on Emotional  Corpora",
    "abstract": "Self-supervised speech models have grown fast during the past few years and have proven feasible for use in various downstream tasks. Some recent work has started to look at the characteristics of these models, yet many concerns have not been fully addressed. In this work, we conduct a study on emotional corpora to explore a popular self-supervised model -- wav2vec 2.0. Via a set of quantitative analysis, we mainly demonstrate that: 1) wav2vec 2.0 appears to discard paralinguistic information that is less useful for word recognition purposes; 2) for emotion recognition, representations from the middle layer alone perform as well as those derived from layer averaging, while the final layer results in the worst performance in some cases; 3) current self-supervised models may not be the optimal solution for downstream tasks that make use of non-lexical features. Our work provides novel findings that will aid future research in this area and theoretical basis for the use of existing models. ",
    "url": "https://arxiv.org/abs/2210.02595",
    "authors": [
      "Yuanchao Li",
      "Yumnah Mohamied",
      "Peter Bell",
      "Catherine Lai"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.02600",
    "title": "Learning convergence prediction of astrobots in multi-object  spectrographs",
    "abstract": "Astrobot swarms are used to capture astronomical signals to generate the map of the observable universe for the purpose of dark energy studies. The convergence of each swarm in the course of its coordination has to surpass a particular threshold to yield a satisfactory map. The current coordination methods do not always reach desired convergence rates. Moreover, these methods are so complicated that one cannot formally verify their results without resource-demanding simulations. Thus, we use support vector machines to train a model which can predict the convergence of a swarm based on the data of previous coordination of that swarm. Given a fixed parity, i.e., the rotation direction of the outer arm of an astrobot, corresponding to a swarm, our algorithm reaches a better predictive performance compared to the state of the art. Additionally, we revise our algorithm to solve a more generalized convergence prediction problem according to which the parities of astrobots may differ. We present the prediction results of a generalized scenario, associated with a 487-astrobot swarm, which are interestingly efficient and collision-free given the excessive complexity of this scenario compared to the constrained one. ",
    "url": "https://arxiv.org/abs/2210.02600",
    "authors": [
      "Matin Macktoobian",
      "Francesco Basciani",
      "Denis Gillet",
      "Jean-Paul Kneib"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2210.02684",
    "title": "Conformal Isometry of Lie Group Representation in Recurrent Network of  Grid Cells",
    "abstract": "The activity of the grid cell population in the medial entorhinal cortex (MEC) of the brain forms a vector representation of the self-position of the animal. Recurrent neural networks have been developed to explain the properties of the grid cells by transforming the vector based on the input velocity, so that the grid cells can perform path integration. In this paper, we investigate the algebraic, geometric, and topological properties of grid cells using recurrent network models. Algebraically, we study the Lie group and Lie algebra of the recurrent transformation as a representation of self-motion. Geometrically, we study the conformal isometry of the Lie group representation of the recurrent network where the local displacement of the vector in the neural space is proportional to the local displacement of the agent in the 2D physical space. We then focus on a simple non-linear recurrent model that underlies the continuous attractor neural networks of grid cells. Our numerical experiments show that conformal isometry leads to hexagon periodic patterns of the response maps of grid cells and our model is capable of accurate path integration. ",
    "url": "https://arxiv.org/abs/2210.02684",
    "authors": [
      "Dehong Xu",
      "Ruiqi Gao",
      "Wen-Hao Zhang",
      "Xue-Xin Wei",
      "Ying Nian Wu"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2210.02851",
    "title": "Anomaly detection using data depth: multivariate case",
    "abstract": "Anomaly detection is a branch of machine learning and data analysis which aims at identifying observations that exhibit abnormal behaviour. Be it measurement errors, disease development, severe weather, production quality default(s) (items) or failed equipment, financial frauds or crisis events, their on-time identification, isolation and explanation constitute an important task in almost any branch of industry and science. By providing a robust ordering, data depth -- statistical function that measures belongingness of any point of the space to a data set -- becomes a particularly useful tool for detection of anomalies. Already known for its theoretical properties, data depth has undergone substantial computational developments in the last decade and particularly recent years, which has made it applicable for contemporary-sized problems of data analysis and machine learning. In this article, data depth is studied as an efficient anomaly detection tool, assigning abnormality labels to observations with lower depth values, in a multivariate setting. Practical questions of necessity and reasonability of invariances and shape of the depth function, its robustness and computational complexity, choice of the threshold are discussed. Illustrations include use-cases that underline advantageous behaviour of data depth in various settings. ",
    "url": "https://arxiv.org/abs/2210.02851",
    "authors": [
      "Pavlo Mozharovskyi"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2210.02881",
    "title": "Antibody Representation Learning for Drug Discovery",
    "abstract": "Therapeutic antibody development has become an increasingly popular approach for drug development. To date, antibody therapeutics are largely developed using large scale experimental screens of antibody libraries containing hundreds of millions of antibody sequences. The high cost and difficulty of developing therapeutic antibodies create a pressing need for computational methods to predict antibody properties and create bespoke designs. However, the relationship between antibody sequence and activity is a complex physical process and traditional iterative design approaches rely on large scale assays and random mutagenesis. Deep learning methods have emerged as a promising way to learn antibody property predictors, but predicting antibody properties and target-specific activities depends critically on the choice of antibody representations and data linking sequences to properties is often limited. Existing works have not yet investigated the value, limitations and opportunities of these methods in application to antibody-based drug discovery. In this paper, we present results on a novel SARS-CoV-2 antibody binding dataset and an additional benchmark dataset. We compare three classes of models: conventional statistical sequence models, supervised learning on each dataset independently, and fine-tuning an antibody specific pre-trained language model. Experimental results suggest that self-supervised pretraining of feature representation consistently offers significant improvement in over previous approaches. We also investigate the impact of data size on the model performance, and discuss challenges and opportunities that the machine learning community can address to advance in silico engineering and design of therapeutic antibodies. ",
    "url": "https://arxiv.org/abs/2210.02881",
    "authors": [
      "Lin Li",
      "Esther Gupta",
      "John Spaeth",
      "Leslie Shing",
      "Tristan Bepler",
      "Rajmonda Sulo Caceres"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02992",
    "title": "COVID-19 Detection Using Segmentation, Region Extraction and  Classification Pipeline",
    "abstract": "Purpose The main purpose in this study is to propose a pipeline for COVID-19 detection from a big and challenging database of Computed Tomography (CT) images. The proposed pipeline includes a segmentation part, a region of interest extraction part, and a classifier part. Methods The methodology used in the segmentation part is traditional segmentation methods as well as UNet based segmentation. In the classification part a Convolutional Neural Network (CNN) was used to take the final diagnosis decisions. Results In the segmentation part, the proposed segmentation methods show high dice scores on a publicly vailable dataset. In the classification part, the results show high accuracy on the validation partition of COV19-CT-DB dataset as well as higher precision, recall, and macro F1 score. The classification results were compared to our previous works other studies as well as on the same dataset. Conclusions The improved work in this paper proposes efficient pipeline with a potential of having clinical usage for COVID-19 detection and diagnosis via CT images. The code is on github at https://github.com/IDU-CVLab/COV19D_3rd ",
    "url": "https://arxiv.org/abs/2210.02992",
    "authors": [
      "Kenan Morani"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02996",
    "title": "Synergistic information supports modality integration and flexible  learning in neural networks solving multiple tasks",
    "abstract": "Striking progress has recently been made in understanding human cognition by analyzing how its neuronal underpinnings are engaged in different modes of information processing. Specifically, neural information can be decomposed into synergistic, redundant, and unique features, with synergistic components being particularly aligned with complex cognition. However, two fundamental questions remain unanswered: (a) precisely how and why a cognitive system can become highly synergistic; and (b) how these informational states map onto artificial neural networks in various learning modes. To address these questions, here we employ an information-decomposition framework to investigate the information processing strategies adopted by simple artificial neural networks performing a variety of cognitive tasks in both supervised and reinforcement learning settings. Our results show that synergy increases as neural networks learn multiple diverse tasks. Furthermore, performance in tasks requiring integration of multiple information sources critically relies on synergistic neurons. Finally, randomly turning off neurons during training through dropout increases network redundancy, corresponding to an increase in robustness. Overall, our results suggest that while redundant information is required for robustness to perturbations in the learning process, synergistic information is used to combine information from multiple modalities -- and more generally for flexible and efficient learning. These findings open the door to new ways of investigating how and why learning systems employ specific information-processing strategies, and support the principle that the capacity for general-purpose learning critically relies in the system's information dynamics. ",
    "url": "https://arxiv.org/abs/2210.02996",
    "authors": [
      "Alexandra M. Proca",
      "Fernando E. Rosas",
      "Andrea I. Luppi",
      "Daniel Bor",
      "Matthew Crosby",
      "Pedro A.M. Mediano"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.03064",
    "title": "Robust thresholds: Counting triangle factors and A shorter proof of the  robust Corrádi-Hajnal Theorem",
    "abstract": "We show that the distribution of perfect matchings in an $r$-uniform hypergraph on $n$ vertices induced by the edges of an $r$-partite super-regular graph is $O(1/n^{r-1})$-spread. This yields a short proof of the robust Corr\\'adi-Hajnal Theorem recently obtained by Allen et al., that there is $C>0$ such that, for a graph $G$ with minimum degree $2n/3$, a random subgraph of $G$ where each edge is retained with probability $C(\\log n)^{1/3}n^{-2/3}$ contains a triangle factor with high probability. We also show that the number of triangle factors in a graph with minimum degree $2n/3$ is at least $(cn)^{2n/3}$ for a constant $c>0$, addressing a question of Allen et al. ",
    "url": "https://arxiv.org/abs/2210.03064",
    "authors": [
      "Huy Tuan Pham"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2210.03067",
    "title": "Few-Shot Calibration of Set Predictors via Meta-Learned  Cross-Validation-Based Conformal Prediction",
    "abstract": "Conventional frequentist learning is known to yield poorly calibrated models that fail to reliably quantify the uncertainty of their decisions. Bayesian learning can improve calibration, but formal guarantees apply only under restrictive assumptions about correct model specification. Conformal prediction (CP) offers a general framework for the design of set predictors with calibration guarantees that hold regardless of the underlying data generation mechanism. However, when training data are limited, CP tends to produce large, and hence uninformative, predicted sets. This paper introduces a novel meta-learning solution that aims at reducing the set prediction size. Unlike prior work, the proposed meta-learning scheme, referred to as meta-XB, (i) builds on cross-validation-based CP, rather than the less efficient validation-based CP; and (ii) preserves formal per-task calibration guarantees, rather than less stringent task-marginal guarantees. Finally, meta-XB is extended to adaptive non-conformal scores, which are shown empirically to further enhance marginal per-input calibration. ",
    "url": "https://arxiv.org/abs/2210.03067",
    "authors": [
      "Sangwoo Park",
      "Kfir M. Cohen",
      "Osvaldo Simeone"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:1812.10528",
    "title": "Adversarial Attack and Defense on Graph Data: A Survey",
    "abstract": " Comments: Published on IEEE TKDE. For more open-source and up-to-date information, please check our Github repository: this https URL ",
    "url": "https://arxiv.org/abs/1812.10528",
    "authors": [
      "Lichao Sun",
      "Yingtong Dou",
      "Carl Yang",
      "Ji Wang",
      "Yixin Liu",
      "Philip S. Yu",
      "Lifang He",
      "Bo Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2012.04646",
    "title": "Spectral clustering via adaptive layer aggregation for multi-layer  networks",
    "abstract": " Comments: 74 pages ",
    "url": "https://arxiv.org/abs/2012.04646",
    "authors": [
      "Sihan Huang",
      "Haolei Weng",
      "Yang Feng"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Statistics Theory (math.ST)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:2102.03539",
    "title": "Sill-Net: Feature Augmentation with Separated Illumination  Representation",
    "abstract": " Title: Sill-Net: Feature Augmentation with Separated Illumination  Representation ",
    "url": "https://arxiv.org/abs/2102.03539",
    "authors": [
      "Haipeng Zhang",
      "Zhong Cao",
      "Ziang Yan",
      "Changshui Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2103.07751",
    "title": "Unsupervised Image Transformation Learning via Generative Adversarial  Networks",
    "abstract": " Title: Unsupervised Image Transformation Learning via Generative Adversarial  Networks ",
    "url": "https://arxiv.org/abs/2103.07751",
    "authors": [
      "Kaiwen Zha",
      "Yujun Shen",
      "Bolei Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.00433",
    "title": "Who's Afraid of Adversarial Transferability?",
    "abstract": " Title: Who's Afraid of Adversarial Transferability? ",
    "url": "https://arxiv.org/abs/2105.00433",
    "authors": [
      "Ziv Katzir",
      "Yuval Elovici"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2105.01029",
    "title": "Initialization and Regularization of Factorized Neural Layers",
    "abstract": " Comments: ICLR 2021 camera-ready, amended due to error pointed out in arXiv:2209.13569v1 (amendment shown in blue) ",
    "url": "https://arxiv.org/abs/2105.01029",
    "authors": [
      "Mikhail Khodak",
      "Neil Tenenholtz",
      "Lester Mackey",
      "Nicolò Fusi"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.14922",
    "title": "Cosmic-CoNN: A Cosmic Ray Detection Deep-Learning Framework, Dataset,  and Toolkit",
    "abstract": " Comments: 17 pages, 10 figures, 4 tables. Submitted to AAS Journals. See this https URL for the open-source software and this https URL for the dataset ",
    "url": "https://arxiv.org/abs/2106.14922",
    "authors": [
      "Chengyuan Xu",
      "Curtis McCully",
      "Boning Dong",
      "D. Andrew Howell",
      "Pradeep Sen"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.08481",
    "title": "Neural Operator: Learning Maps Between Function Spaces",
    "abstract": " Title: Neural Operator: Learning Maps Between Function Spaces ",
    "url": "https://arxiv.org/abs/2108.08481",
    "authors": [
      "Nikola Kovachki",
      "Zongyi Li",
      "Burigede Liu",
      "Kamyar Azizzadenesheli",
      "Kaushik Bhattacharya",
      "Andrew Stuart",
      "Anima Anandkumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2110.15162",
    "title": "Exoplanet atmosphere evolution: emulation with neural networks",
    "abstract": " Comments: 16 pages, 10 figures. Submitted to MNRAS ",
    "url": "https://arxiv.org/abs/2110.15162",
    "authors": [
      "James G. Rogers",
      "Clàudia Janó Muñoz",
      "James E. Owen",
      "Lucas T. Makinen"
    ],
    "subjectives": [
      "Earth and Planetary Astrophysics (astro-ph.EP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.00036",
    "title": "Real-Time Detection of Anomalies in Large-Scale Transient Surveys",
    "abstract": " Comments: 27 pages, 23 figures, accepted for publication in MNRAS ",
    "url": "https://arxiv.org/abs/2111.00036",
    "authors": [
      "Daniel Muthukrishna",
      "Kaisey S. Mandel",
      "Michelle Lochner",
      "Sara Webb",
      "Gautham Narayan"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "High Energy Astrophysical Phenomena (astro-ph.HE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.01629",
    "title": "Accelerating Algebraic Multigrid Methods via Artificial Neural Networks",
    "abstract": " Title: Accelerating Algebraic Multigrid Methods via Artificial Neural Networks ",
    "url": "https://arxiv.org/abs/2111.01629",
    "authors": [
      "Paola F. Antonietti",
      "Matteo Caldana",
      "Luca Dede'"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2111.13091",
    "title": "Asynchronous Session-Based Concurrency: Deadlock-freedom in Cyclic  Process Networks",
    "abstract": " Comments: Extended version of arXiv:2110.00146, doi:10.4204/EPTCS.347.3 and arXiv:2209.06820, doi:10.4204/EPTCS.368.5 ",
    "url": "https://arxiv.org/abs/2111.13091",
    "authors": [
      "Bas van den Heuvel",
      "Jorge A. Pérez"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2111.14341",
    "title": "OOD-CV: A Benchmark for Robustness to Out-of-Distribution Shifts of  Individual Nuisances in Natural Images",
    "abstract": " Comments: Project webpage: this http URL, this work is accepted as Oral at ECCV 2022 ",
    "url": "https://arxiv.org/abs/2111.14341",
    "authors": [
      "Bingchen Zhao",
      "Shaozuo Yu",
      "Wufei Ma",
      "Mingxin Yu",
      "Shenxiao Mei",
      "Angtian Wang",
      "Ju He",
      "Alan Yuille",
      "Adam Kortylewski"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.02080",
    "title": "BERN2: an advanced neural biomedical named entity recognition and  normalization tool",
    "abstract": " Comments: Published in Bioinformatics 2022. Web service available at this http URL Code available at this https URL ",
    "url": "https://arxiv.org/abs/2201.02080",
    "authors": [
      "Mujeen Sung",
      "Minbyul Jeong",
      "Yonghwa Choi",
      "Donghyeon Kim",
      "Jinhyuk Lee",
      "Jaewoo Kang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2201.10305",
    "title": "Mutual information neural estimation for unsupervised multi-modal  registration of brain images",
    "abstract": " Comments: 4 pages, 4 figures, 2022 44th Annual International Conference of the IEEE Engineering in Medicine & Biology Society (EMBC), oral presentation ",
    "url": "https://arxiv.org/abs/2201.10305",
    "authors": [
      "Gerard Snaauw",
      "Michele Sasdelli",
      "Gabriel Maicas",
      "Stephan Lau",
      "Johan Verjans",
      "Mark Jenkinson",
      "Gustavo Carneiro"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.11932",
    "title": "Deep Generative Model for Periodic Graphs",
    "abstract": " Comments: This paper has been accepted by NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2201.11932",
    "authors": [
      "Shiyu Wang",
      "Xiaojie Guo",
      "Liang Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.12558",
    "title": "The KFIoU Loss for Rotated Object Detection",
    "abstract": " Comments: 17 pages, 6 figures, 7 tables, TensorFlow code: this https URL, PyTorch code: this https URL ",
    "url": "https://arxiv.org/abs/2201.12558",
    "authors": [
      "Xue Yang",
      "Yue Zhou",
      "Gefan Zhang",
      "Jirui Yang",
      "Wentao Wang",
      "Junchi Yan",
      "Xiaopeng Zhang",
      "Qi Tian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.00046",
    "title": "Finding Directions in GAN's Latent Space for Neural Face Reenactment",
    "abstract": " Comments: Accepted for publication in BMVC 2022. Project page: this https URL Code: this https URL ",
    "url": "https://arxiv.org/abs/2202.00046",
    "authors": [
      "Stella Bounareli",
      "Vasileios Argyriou",
      "Georgios Tzimiropoulos"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.00281",
    "title": "Fast-R2D2: A Pretrained Recursive Neural Network based on Pruned CKY for  Grammar Induction and Text Representation",
    "abstract": " Comments: To be published on EMNLP 2022 ",
    "url": "https://arxiv.org/abs/2203.00281",
    "authors": [
      "Xiang Hu",
      "Haitao Mi",
      "Liang Li",
      "Gerard de Melo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.04695",
    "title": "Structured Multi-task Learning for Molecular Property Prediction",
    "abstract": " Title: Structured Multi-task Learning for Molecular Property Prediction ",
    "url": "https://arxiv.org/abs/2203.04695",
    "authors": [
      "Shengchao Liu",
      "Meng Qu",
      "Zuobai Zhang",
      "Huiyu Cai",
      "Jian Tang"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.00032",
    "title": "Truth Serum: Poisoning Machine Learning Models to Reveal Their Secrets",
    "abstract": " Comments: ACM CCS 2022 ",
    "url": "https://arxiv.org/abs/2204.00032",
    "authors": [
      "Florian Tramèr",
      "Reza Shokri",
      "Ayrton San Joaquin",
      "Hoang Le",
      "Matthew Jagielski",
      "Sanghyun Hong",
      "Nicholas Carlini"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.05422",
    "title": "SATA: Sparsity-Aware Training Accelerator for Spiking Neural Networks",
    "abstract": " Comments: 13 pages. Accepted to IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (2022) ",
    "url": "https://arxiv.org/abs/2204.05422",
    "authors": [
      "Ruokai Yin",
      "Abhishek Moitra",
      "Abhiroop Bhattacharjee",
      "Youngeun Kim",
      "Priyadarshini Panda"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2204.07637",
    "title": "Towards a Stronger Theory for Permutation-based Evolutionary Algorithms",
    "abstract": " Comments: Conference version with an appendix containing the proofs omitted for reasons of space ",
    "url": "https://arxiv.org/abs/2204.07637",
    "authors": [
      "Benjamin Doerr",
      "Yassine Ghannane",
      "Marouane Ibn Brahim"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.11424",
    "title": "It Takes Two Flints to Make a Fire: Multitask Learning of Neural  Relation and Explanation Classifiers",
    "abstract": " Title: It Takes Two Flints to Make a Fire: Multitask Learning of Neural  Relation and Explanation Classifiers ",
    "url": "https://arxiv.org/abs/2204.11424",
    "authors": [
      "Zheng Tang",
      "Mihai Surdeanu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.00218",
    "title": "Distributed exponential state estimation of linear systems over jointly  connected switching networks",
    "abstract": " Title: Distributed exponential state estimation of linear systems over jointly  connected switching networks ",
    "url": "https://arxiv.org/abs/2205.00218",
    "authors": [
      "Tao Liu",
      "Jie Huang"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2205.05507",
    "title": "TextMatcher: Cross-Attentional Neural Network to Compare Image and Text",
    "abstract": " Comments: Accepted at the 25th International Conference on Discovery Science 2022, 15 pages ",
    "url": "https://arxiv.org/abs/2205.05507",
    "authors": [
      "Valentina Arrigoni",
      "Luisa Repele",
      "Dario Marino Saccavino"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.06926",
    "title": "Toward a Geometrical Understanding of Self-supervised Contrastive  Learning",
    "abstract": " Title: Toward a Geometrical Understanding of Self-supervised Contrastive  Learning ",
    "url": "https://arxiv.org/abs/2205.06926",
    "authors": [
      "Romain Cosentino",
      "Anirvan Sengupta",
      "Salman Avestimehr",
      "Mahdi Soltanolkotabi",
      "Antonio Ortega",
      "Ted Willke",
      "Mariano Tepper"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.08780",
    "title": "Visual Attention-based Self-supervised Absolute Depth Estimation using  Geometric Priors in Autonomous Driving",
    "abstract": " Comments: Published on IEEE Robotics and Automation Letters (RA-L) ",
    "url": "https://arxiv.org/abs/2205.08780",
    "authors": [
      "Jie Xiang",
      "Yun Wang",
      "Lifeng An",
      "Haiyang Liu",
      "Zijun Wang",
      "Jian Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.10625",
    "title": "Least-to-Most Prompting Enables Complex Reasoning in Large Language  Models",
    "abstract": " Title: Least-to-Most Prompting Enables Complex Reasoning in Large Language  Models ",
    "url": "https://arxiv.org/abs/2205.10625",
    "authors": [
      "Denny Zhou",
      "Nathanael Schärli",
      "Le Hou",
      "Jason Wei",
      "Nathan Scales",
      "Xuezhi Wang",
      "Dale Schuurmans",
      "Claire Cui",
      "Olivier Bousquet",
      "Quoc Le",
      "Ed Chi"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.13613",
    "title": "Circumventing Backdoor Defenses That Are Based on Latent Separability",
    "abstract": " Title: Circumventing Backdoor Defenses That Are Based on Latent Separability ",
    "url": "https://arxiv.org/abs/2205.13613",
    "authors": [
      "Xiangyu Qi",
      "Tinghao Xie",
      "Yiming Li",
      "Saeed Mahloujifar",
      "Prateek Mittal"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.14428",
    "title": "Go Beyond Multiple Instance Neural Networks: Deep-learning Models based  on Local Pattern Aggregation",
    "abstract": " Title: Go Beyond Multiple Instance Neural Networks: Deep-learning Models based  on Local Pattern Aggregation ",
    "url": "https://arxiv.org/abs/2205.14428",
    "authors": [
      "Linpeng Jin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.15701",
    "title": "Provable General Function Class Representation Learning in Multitask  Bandits and MDPs",
    "abstract": " Title: Provable General Function Class Representation Learning in Multitask  Bandits and MDPs ",
    "url": "https://arxiv.org/abs/2205.15701",
    "authors": [
      "Rui Lu",
      "Andrew Zhao",
      "Simon S. Du",
      "Gao Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.04572",
    "title": "Log-Concave and Multivariate Canonical Noise Distributions for  Differential Privacy",
    "abstract": " Comments: 10 pages before references, 1 Figure ",
    "url": "https://arxiv.org/abs/2206.04572",
    "authors": [
      "Jordan Awan",
      "Jinshuo Dong"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2206.09120",
    "title": "Pursuit of a Discriminative Representation for Multiple Subspaces via  Sequential Games",
    "abstract": " Comments: main body is 16 pages and has 5 figures; appendix is 17 pages and has 6 figures ",
    "url": "https://arxiv.org/abs/2206.09120",
    "authors": [
      "Druv Pai",
      "Michael Psenka",
      "Chih-Yuan Chiu",
      "Manxi Wu",
      "Edgar Dobriban",
      "Yi Ma"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.11233",
    "title": "Automatic autism spectrum disorder detection using artificial  intelligence methods with MRI neuroimaging: A review",
    "abstract": " Title: Automatic autism spectrum disorder detection using artificial  intelligence methods with MRI neuroimaging: A review ",
    "url": "https://arxiv.org/abs/2206.11233",
    "authors": [
      "Parisa Moridian",
      "Navid Ghassemi",
      "Mahboobeh Jafari",
      "Salam Salloum-Asfar",
      "Delaram Sadeghi",
      "Marjane Khodatars",
      "Afshin Shoeibi",
      "Abbas Khosravi",
      "Sai Ho Ling",
      "Abdulhamit Subasi",
      "Roohallah Alizadehsani",
      "Juan M. Gorriz",
      "Sara A Abdulla",
      "U. Rajendra Acharya"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2206.11834",
    "title": "Non-Determinism and the Lawlessness of Machine Learning Code",
    "abstract": " Comments: Proceedings of the 2022 Symposium on Computer Science and Law (CSLAW '22) ",
    "url": "https://arxiv.org/abs/2206.11834",
    "authors": [
      "A. Feder Cooper",
      "Jonathan Frankle",
      "Christopher De Sa"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.01567",
    "title": "Back to MLP: A Simple Baseline for Human Motion Prediction",
    "abstract": " Comments: Accepted to WACV 2023; Code available at this https URL ",
    "url": "https://arxiv.org/abs/2207.01567",
    "authors": [
      "Wen Guo",
      "Yuming Du",
      "Xi Shen",
      "Vincent Lepetit",
      "Xavier Alameda-Pineda",
      "Francesc Moreno-Noguer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.02098",
    "title": "Neural Networks and the Chomsky Hierarchy",
    "abstract": " Title: Neural Networks and the Chomsky Hierarchy ",
    "url": "https://arxiv.org/abs/2207.02098",
    "authors": [
      "Grégoire Delétang",
      "Anian Ruoss",
      "Jordi Grau-Moya",
      "Tim Genewein",
      "Li Kevin Wenliang",
      "Elliot Catt",
      "Chris Cundy",
      "Marcus Hutter",
      "Shane Legg",
      "Joel Veness",
      "Pedro A. Ortega"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Formal Languages and Automata Theory (cs.FL)"
    ]
  },
  {
    "id": "arXiv:2207.05987",
    "title": "DocPrompting: Generating Code by Retrieving the Docs",
    "abstract": " Title: DocPrompting: Generating Code by Retrieving the Docs ",
    "url": "https://arxiv.org/abs/2207.05987",
    "authors": [
      "Shuyan Zhou",
      "Uri Alon",
      "Frank F. Xu",
      "Zhiruo Wang",
      "Zhengbao Jiang",
      "Graham Neubig"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2207.06283",
    "title": "Implicit Neural Representations for Generative Modeling of Living Cell  Shapes",
    "abstract": " Comments: MICCAI 2022 ",
    "url": "https://arxiv.org/abs/2207.06283",
    "authors": [
      "David Wiesner",
      "Julian Suk",
      "Sven Dummer",
      "David Svoboda",
      "Jelmer M. Wolterink"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.10970",
    "title": "Opportunistic hip fracture risk prediction in Men from X-ray: Findings  from the Osteoporosis in Men (MrOS) Study",
    "abstract": " Comments: Oral Presentation at MICCAI 2022 Workshop (PRIME), Considered for best paper award Predictive Intelligence in Medicine. PRIME 2022. Lecture Notes in Computer Science, vol 13564 ",
    "url": "https://arxiv.org/abs/2207.10970",
    "authors": [
      "Lars Schmarje",
      "Stefan Reinhold",
      "Timo Damm",
      "Eric Orwoll",
      "Claus-C. Glüer",
      "Reinhard Koch"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.13283",
    "title": "INTERACT: Achieving Low Sample and Communication Complexities in  Decentralized Bilevel Learning over Networks",
    "abstract": " Title: INTERACT: Achieving Low Sample and Communication Complexities in  Decentralized Bilevel Learning over Networks ",
    "url": "https://arxiv.org/abs/2207.13283",
    "authors": [
      "Zhuqing Liu",
      "Xin Zhang",
      "Prashant Khanduri",
      "Songtao Lu",
      "Jia Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.07261",
    "title": "Bias amplification in experimental social networks is reduced by  resampling",
    "abstract": " Title: Bias amplification in experimental social networks is reduced by  resampling ",
    "url": "https://arxiv.org/abs/2208.07261",
    "authors": [
      "Mathew D. Hardy",
      "Bill D. Thompson",
      "P.M. Krafft",
      "Thomas L. Griffiths"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.08225",
    "title": "On the Role of Negative Precedent in Legal Outcome Prediction",
    "abstract": " Title: On the Role of Negative Precedent in Legal Outcome Prediction ",
    "url": "https://arxiv.org/abs/2208.08225",
    "authors": [
      "Josef Valvoda",
      "Ryan Cotterell",
      "Simone Teufel"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2208.14681",
    "title": "When Variable-Length Codes Meet the Field of Error Detection",
    "abstract": " Title: When Variable-Length Codes Meet the Field of Error Detection ",
    "url": "https://arxiv.org/abs/2208.14681",
    "authors": [
      "Jean Néraud"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Computation and Language (cs.CL)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2209.07603",
    "title": "Hub-aware Random Walk Graph Embedding Methods for Classification",
    "abstract": " Comments: Submitted to journal for possible publication ",
    "url": "https://arxiv.org/abs/2209.07603",
    "authors": [
      "Aleksandar Tomčić",
      "Miloš Savić",
      "Miloš Radovanović"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.10930",
    "title": "MGTR: End-to-End Mutual Gaze Detection with Transformer",
    "abstract": " Comments: ACCV2022 accepted paper ",
    "url": "https://arxiv.org/abs/2209.10930",
    "authors": [
      "Hang Guo",
      "Zhengxi Hu",
      "Jingtai Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.13232",
    "title": "A Survey on Graph Neural Networks and Graph Transformers in Computer  Vision: A Task-Oriented Perspective",
    "abstract": " Comments: Preprint ",
    "url": "https://arxiv.org/abs/2209.13232",
    "authors": [
      "Chaoqi Chen",
      "Yushuang Wu",
      "Qiyuan Dai",
      "Hong-Yu Zhou",
      "Mutian Xu",
      "Sibei Yang",
      "Xiaoguang Han",
      "Yizhou Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.13667",
    "title": "Robust MADER: Decentralized and Asynchronous Multiagent Trajectory  Planner Robust to Communication Delay",
    "abstract": " Comments: 7 pages ",
    "url": "https://arxiv.org/abs/2209.13667",
    "authors": [
      "Kota Kondo",
      "Jesus Tordesillas",
      "Reinaldo Figueroa",
      "Juan Rached",
      "Joseph Merkel",
      "Parker C. Lusk",
      "Jonathan P. How"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Multiagent Systems (cs.MA)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2209.14171",
    "title": "Programmable and Customized Intelligence for Traffic Steering in 5G  Networks Using Open RAN Architectures",
    "abstract": " Comments: 15 pages, 2 algorithms, 1 table, 11 figures, 42 references ",
    "url": "https://arxiv.org/abs/2209.14171",
    "authors": [
      "Andrea Lacava",
      "Michele Polese",
      "Rajarajan Sivaraj",
      "Rahul Soundrarajan",
      "Bhawani Shanker Bhati",
      "Tarunjeet Singh",
      "Tommaso Zugno",
      "Francesca Cuomo",
      "Tommaso Melodia"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.14406",
    "title": "Biological connectomes as a representation for the architecture of  artificial neural networks",
    "abstract": " Title: Biological connectomes as a representation for the architecture of  artificial neural networks ",
    "url": "https://arxiv.org/abs/2209.14406",
    "authors": [
      "Samuel Schmidgall",
      "Catherine Schuman",
      "Maryam Parsa"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.14914",
    "title": "Quantum invariants for the graph isomorphism problem",
    "abstract": " Title: Quantum invariants for the graph isomorphism problem ",
    "url": "https://arxiv.org/abs/2209.14914",
    "authors": [
      "Hernán I. de la Cruz",
      "Fernando L. Pelayo",
      "Vicente Pascual",
      "Jose J. Paulet",
      "Fernando Cuartero",
      "Luis Llana",
      "Mauro Mezzini"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2209.15439",
    "title": "Exploiting Instance-based Mixed Sampling via Auxiliary Source Domain  Supervision for Domain-adaptive Action Detection",
    "abstract": " Title: Exploiting Instance-based Mixed Sampling via Auxiliary Source Domain  Supervision for Domain-adaptive Action Detection ",
    "url": "https://arxiv.org/abs/2209.15439",
    "authors": [
      "Yifan Lu",
      "Gurkirt Singh",
      "Suman Saha",
      "Luc Van Gool"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.00482",
    "title": "Compositional Generalization in Unsupervised Compositional  Representation Learning: A Study on Disentanglement and Emergent Language",
    "abstract": " Comments: NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2210.00482",
    "authors": [
      "Zhenlin Xu",
      "Marc Niethammer",
      "Colin Raffel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.00486",
    "title": "pMPL: A Robust Multi-Party Learning Framework with a Privileged Party",
    "abstract": " Comments: This paper is the full version of a paper to appear in CCS 2022 ",
    "url": "https://arxiv.org/abs/2210.00486",
    "authors": [
      "Lushan Song",
      "Jiaxuan Wang",
      "Zhexuan Wang",
      "Xinyu Tu",
      "Guopeng Lin",
      "Wenqiang Ruan",
      "Haoqi Wu",
      "Weili Han"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2210.00805",
    "title": "Limitations of neural network training due to numerical instability of  backpropagation",
    "abstract": " Title: Limitations of neural network training due to numerical instability of  backpropagation ",
    "url": "https://arxiv.org/abs/2210.00805",
    "authors": [
      "Clemens Karner",
      "Vladimir Kazeev",
      "Philipp Christian Petersen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Functional Analysis (math.FA)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2210.01421",
    "title": "Learning of Dynamical Systems under Adversarial Attacks -- Null Space  Property Perspective",
    "abstract": " Comments: 8 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2210.01421",
    "authors": [
      "Han Feng",
      "Baturalp Yalcin",
      "Javad Lavaei"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2210.01944",
    "title": "A Framework for Large Scale Synthetic Graph Dataset Generation",
    "abstract": " Title: A Framework for Large Scale Synthetic Graph Dataset Generation ",
    "url": "https://arxiv.org/abs/2210.01944",
    "authors": [
      "Sajad Darabi",
      "Piotr Bigaj",
      "Dawid Majchrowski",
      "Pawel Morkisz",
      "Alex Fit-Florea"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2210.02071",
    "title": "Advanced Deep Learning Architectures for Accurate Detection of  Subsurface Tile Drainage Pipes from Remote Sensing Images",
    "abstract": " Comments: Accepted in SPIE Remote Sensing (ESI22R). For code visit: this https URL ",
    "url": "https://arxiv.org/abs/2210.02071",
    "authors": [
      "Tom-Lukas Breitkopf",
      "Leonard W. Hackel",
      "Mahdyar Ravanbakhsh",
      "Anne-Karin Cooke",
      "Sandra Willkommen",
      "Stefan Broda",
      "Begüm Demir"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2210.02166",
    "title": "Generalized Moving Horizon Estimation for Nonlinear Systems with  Robustness to Measurement Outliers",
    "abstract": " Title: Generalized Moving Horizon Estimation for Nonlinear Systems with  Robustness to Measurement Outliers ",
    "url": "https://arxiv.org/abs/2210.02166",
    "authors": [
      "Wenhan Cao",
      "Chang Liu",
      "Zhiqian Lan",
      "Yingxi Piao",
      "Shengbo Eben Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  }
]