[
  {
    "id": "arXiv:2312.07560",
    "title": "AI-driven Structure Detection and Information Extraction from Historical  Cadastral Maps (Early 19th Century Franciscean Cadastre in the Province of  Styria) and Current High-resolution Satellite and Aerial Imagery for Remote  Sensing",
    "abstract": "Cadastres from the 19th century are a complex as well as rich source for historians and archaeologists, whose use presents them with great challenges. For archaeological and historical remote sensing, we have trained several Deep Learning models, CNNs as well as Vision Transformers, to extract large-scale data from this knowledge representation. We present the principle results of our work here and we present a the demonstrator of our browser-based tool that allows researchers and public stakeholders to quickly identify spots that featured buildings in the 19th century Franciscean Cadastre. The tool not only supports scholars and fellow researchers in building a better understanding of the settlement history of the region of Styria, it also helps public administration and fellow citizens to swiftly identify areas of heightened sensibility with regard to the cultural heritage of the region. ",
    "url": "https://arxiv.org/abs/2312.07560",
    "authors": [
      "Wolfgang Göderle",
      "Christian Macher",
      "Katrin Mauthner",
      "Oliver Pimas",
      "Fabian Rampetsreiter"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07571",
    "title": "Investigating YOLO Models Towards Outdoor Obstacle Detection For  Visually Impaired People",
    "abstract": "The utilization of deep learning-based object detection is an effective approach to assist visually impaired individuals in avoiding obstacles. In this paper, we implemented seven different YOLO object detection models \\textit{viz}., YOLO-NAS (small, medium, large), YOLOv8, YOLOv7, YOLOv6, and YOLOv5 and performed comprehensive evaluation with carefully tuned hyperparameters, to analyze how these models performed on images containing common daily-life objects presented on roads and sidewalks. After a systematic investigation, YOLOv8 was found to be the best model, which reached a precision of $80\\%$ and a recall of $68.2\\%$ on a well-known Obstacle Dataset which includes images from VOC dataset, COCO dataset, and TT100K dataset along with images collected by the researchers in the field. Despite being the latest model and demonstrating better performance in many other applications, YOLO-NAS was found to be suboptimal for the obstacle detection task. ",
    "url": "https://arxiv.org/abs/2312.07571",
    "authors": [
      "Chenhao He",
      "Pramit Saha"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07575",
    "title": "TapTree: Process-Tree Based Host Behavior Modeling and Threat Detection  Framework via Sequential Pattern Mining",
    "abstract": "Audit logs containing system level events are frequently used for behavior modeling as they can provide detailed insight into cyber-threat occurrences. However, mapping low-level system events in audit logs to highlevel behaviors has been a major challenge in identifying host contextual behavior for the purpose of detecting potential cyber threats. Relying on domain expert knowledge may limit its practical implementation. This paper presents TapTree, an automated process-tree based technique to extract host behavior by compiling system events' semantic information. After extracting behaviors as system generated process trees, TapTree integrates event semantics as a representation of behaviors. To further reduce pattern matching workloads for the analyst, TapTree aggregates semantically equivalent patterns and optimizes representative behaviors. In our evaluation against a recent benchmark audit log dataset (DARPA OpTC), TapTree employs tree pattern queries and sequential pattern mining techniques to deduce the semantics of connected system events, achieving high accuracy for behavior abstraction and then Advanced Persistent Threat (APT) attack detection. Moreover, we illustrate how to update the baseline model gradually online, allowing it to adapt to new log patterns over time. ",
    "url": "https://arxiv.org/abs/2312.07575",
    "authors": [
      "Mohammad Mamun",
      "Scott Buffett"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.07584",
    "title": "DFGET: Displacement-Field Assisted Graph Energy Transmitter for Gland  Instance Segmentation",
    "abstract": "Gland instance segmentation is an essential but challenging task in the diagnosis and treatment of adenocarcinoma. The existing models usually achieve gland instance segmentation through multi-task learning and boundary loss constraint. However, how to deal with the problems of gland adhesion and inaccurate boundary in segmenting the complex samples remains a challenge. In this work, we propose a displacement-field assisted graph energy transmitter (DFGET) framework to solve these problems. Specifically, a novel message passing manner based on anisotropic diffusion is developed to update the node features, which can distinguish the isomorphic graphs and improve the expressivity of graph nodes for complex samples. Using such graph framework, the gland semantic segmentation map and the displacement field (DF) of the graph nodes are estimated with two graph network branches. With the constraint of DF, a graph cluster module based on diffusion theory is presented to improve the intra-class feature consistency and inter-class feature discrepancy, as well as to separate the adherent glands from the semantic segmentation maps. Extensive comparison and ablation experiments on the GlaS dataset demonstrate the superiority of DFGET and effectiveness of the proposed anisotropic message passing manner and clustering method. Compared to the best comparative model, DFGET increases the object-Dice and object-F1 score by 2.5% and 3.4% respectively, while decreases the object-HD by 32.4%, achieving state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2312.07584",
    "authors": [
      "Caiqing Jian",
      "Yongbin Qin",
      "Lihui Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.07589",
    "title": "ConvD: Attention Enhanced Dynamic Convolutional Embeddings for Knowledge  Graph Completion",
    "abstract": "Knowledge graphs generally suffer from incompleteness, which can be alleviated by completing the missing information. Deep knowledge convolutional embedding models based on neural networks are currently popular methods for knowledge graph completion. However, most existing methods use external convolution kernels and traditional plain convolution processes, which limits the feature interaction capability of the model. In this paper, we propose a novel dynamic convolutional embedding model ConvD for knowledge graph completion, which directly reshapes the relation embeddings into multiple internal convolution kernels to improve the external convolution kernels of the traditional convolutional embedding model. The internal convolution kernels can effectively augment the feature interaction between the relation embeddings and entity embeddings, thus enhancing the model embedding performance. Moreover, we design a priori knowledge-optimized attention mechanism, which can assign different contribution weight coefficients to multiple relation convolution kernels for dynamic convolution to improve the expressiveness of the model further. Extensive experiments on various datasets show that our proposed model consistently outperforms the state-of-the-art baseline methods, with average improvements ranging from 11.30\\% to 16.92\\% across all model evaluation metrics. Ablation experiments verify the effectiveness of each component module of the ConvD model. ",
    "url": "https://arxiv.org/abs/2312.07589",
    "authors": [
      "Wenbin Guo",
      "Zhao Li",
      "Xin Wang",
      "Zirui Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.07594",
    "title": "On the Prediction of Hardware Security Properties of HLS Designs Using  Graph Neural Networks",
    "abstract": "High-level synthesis (HLS) tools have provided significant productivity enhancements to the design flow of digital systems in recent years, resulting in highly-optimized circuits, in terms of area and latency. Given the evolution of hardware attacks, which can render them vulnerable, it is essential to consider security as a significant aspect of the HLS design flow. Yet the need to evaluate a huge number of functionally equivalent de-signs of the HLS design space challenges hardware security evaluation methods (e.g., fault injection - FI campaigns). In this work, we propose an evaluation methodology of hardware security properties of HLS-produced designs using state-of-the-art Graph Neural Network (GNN) approaches that achieves significant speedup and better scalability than typical evaluation methods (such as FI). We demonstrate the proposed methodology on a Double Modular Redundancy (DMR) coun-termeasure applied on an AES SBox implementation, en-hanced by diversifying the redundant modules through HLS directives. The experimental results show that GNNs can be efficiently trained to predict important hardware security met-rics concerning fault attacks (e.g., critical and detection error rates), by using regression. The proposed method predicts the fault vulnerability metrics of the HLS-based designs with high R-squared scores and achieves huge speedup compared to fault injection once the training of the GNN is completed. ",
    "url": "https://arxiv.org/abs/2312.07594",
    "authors": [
      "Amalia Artemis Koufopoulou",
      "Athanasios Papadimitriou",
      "Aggelos Pikrakis",
      "Mihalis Psarakis",
      "David Hely"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.07599",
    "title": "Contrastive News and Social Media Linking using BERT for Articles and  Tweets across Dual Platforms",
    "abstract": "X (formerly Twitter) has evolved into a contemporary agora, offering a platform for individuals to express opinions and viewpoints on current events. The majority of the topics discussed on Twitter are directly related to ongoing events, making it an important source for monitoring public discourse. However, linking tweets to specific news presents a significant challenge due to their concise and informal nature. Previous approaches, including topic models, graph-based models, and supervised classifiers, have fallen short in effectively capturing the unique characteristics of tweets and articles. Inspired by the success of the CLIP model in computer vision, which employs contrastive learning to model similarities between images and captions, this paper introduces a contrastive learning approach for training a representation space where linked articles and tweets exhibit proximity. We present our contrastive learning approach, CATBERT (Contrastive Articles Tweets BERT), leveraging pre-trained BERT models. The model is trained and tested on a dataset containing manually labeled English and Polish tweets and articles related to the Russian-Ukrainian war. We evaluate CATBERT's performance against traditional approaches like LDA, and the novel method based on OpenAI embeddings, which has not been previously applied to this task. Our findings indicate that CATBERT demonstrates superior performance in associating tweets with relevant news articles. Furthermore, we demonstrate the performance of the models when applied to finding the main topic -- represented by an article -- of the whole cascade of tweets. In this new task, we report the performance of the different models in dependence on the cascade size. ",
    "url": "https://arxiv.org/abs/2312.07599",
    "authors": [
      "Jan Piotrowski",
      "Marek Wachnicki",
      "Mateusz Perlik",
      "Jakub Podolak",
      "Grzegorz Rucki",
      "Michał Brzozowski",
      "Paweł Olejnik",
      "Julian Kozłowski",
      "Tomasz Nocoń",
      "Jakub Kozieł",
      "Stanisław Giziński",
      "Piotr Sankowski"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07615",
    "title": "Optimizing Likelihood-free Inference using Self-supervised Neural  Symmetry Embeddings",
    "abstract": "Likelihood-free inference is quickly emerging as a powerful tool to perform fast/effective parameter estimation. We demonstrate a technique of optimizing likelihood-free inference to make it even faster by marginalizing symmetries in a physical problem. In this approach, physical symmetries, for example, time-translation are learned using joint-embedding via self-supervised learning with symmetry data augmentations. Subsequently, parameter inference is performed using a normalizing flow where the embedding network is used to summarize the data before conditioning the parameters. We present this approach on two simple physical problems and we show faster convergence in a smaller number of parameters compared to a normalizing flow that does not use a pre-trained symmetry-informed representation. ",
    "url": "https://arxiv.org/abs/2312.07615",
    "authors": [
      "Deep Chatterjee",
      "Philip C. Harris",
      "Maanas Goel",
      "Malina Desai",
      "Michael W. Coughlin",
      "Erik Katsavounidis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)"
    ]
  },
  {
    "id": "arXiv:2312.07621",
    "title": "Spatiotemporal Event Graphs for Dynamic Scene Understanding",
    "abstract": "Dynamic scene understanding is the ability of a computer system to interpret and make sense of the visual information present in a video of a real-world scene. In this thesis, we present a series of frameworks for dynamic scene understanding starting from road event detection from an autonomous driving perspective to complex video activity detection, followed by continual learning approaches for the life-long learning of the models. Firstly, we introduce the ROad event Awareness Dataset (ROAD) for Autonomous Driving, to our knowledge the first of its kind. Due to the lack of datasets equipped with formally specified logical requirements, we also introduce the ROad event Awareness Dataset with logical Requirements (ROAD-R), the first publicly available dataset for autonomous driving with requirements expressed as logical constraints, as a tool for driving neurosymbolic research in the area. Next, we extend event detection to holistic scene understanding by proposing two complex activity detection methods. In the first method, we present a deformable, spatiotemporal scene graph approach, consisting of three main building blocks: action tube detection, a 3D deformable RoI pooling layer designed for learning the flexible, deformable geometry of the constituent action tubes, and a scene graph constructed by considering all parts as nodes and connecting them based on different semantics. In a second approach evolving from the first, we propose a hybrid graph neural network that combines attention applied to a graph encoding of the local (short-term) dynamic scene with a temporal graph modelling the overall long-duration activity. Finally, the last part of the thesis is about presenting a new continual semi-supervised learning (CSSL) paradigm. ",
    "url": "https://arxiv.org/abs/2312.07621",
    "authors": [
      "Salman Khan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.07625",
    "title": "Astrocyte-Enabled Advancements in Spiking Neural Networks for Large  Language Modeling",
    "abstract": "Within the complex neuroarchitecture of the brain, astrocytes play crucial roles in development, structure, and metabolism. These cells regulate neural activity through tripartite synapses, directly impacting cognitive processes such as learning and memory. Despite the growing recognition of astrocytes' significance, traditional Spiking Neural Network (SNN) models remain predominantly neuron-centric, overlooking the profound influence of astrocytes on neural dynamics. Inspired by these biological insights, we have developed an Astrocyte-Modulated Spiking Unit (AM-SU), an innovative framework that integrates neuron-astrocyte interactions into the computational paradigm, demonstrating wide applicability across various hardware platforms. Our Astrocyte-Modulated Spiking Neural Network (AM-SNet) exhibits exceptional performance in tasks involving memory retention and natural language generation, particularly in handling long-term dependencies and complex linguistic structures. The design of AM-SNet not only enhances its biological authenticity but also introduces novel computational dynamics, enabling more effective processing of complex temporal dependencies. Furthermore, AM-SNet shows low latency, high throughput, and reduced memory usage in practical applications, making it highly suitable for resource-constrained environments. By successfully integrating astrocytic dynamics into intelligent neural networks, our work narrows the gap between biological plausibility and neural modeling, laying the groundwork for future biologically-inspired neural computing research that includes both neurons and astrocytes. ",
    "url": "https://arxiv.org/abs/2312.07625",
    "authors": [
      "Guobin Shen",
      "Dongcheng Zhao",
      "Yiting Dong",
      "Yang Li",
      "Jindong Li",
      "Yi Zeng"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.07632",
    "title": "Maximizing Social Welfare in Score-Based Social Distance Games",
    "abstract": "Social distance games have been extensively studied as a coalition formation model where the utilities of agents in each coalition were captured using a utility function $u$ that took into account distances in a given social network. In this paper, we consider a non-normalized score-based definition of social distance games where the utility function $u^s$ depends on a generic scoring vector $s$, which may be customized to match the specifics of each individual application scenario. As our main technical contribution, we establish the tractability of computing a welfare-maximizing partitioning of the agents into coalitions on tree-like networks, for every score-based function $u^s$. We provide more efficient algorithms when dealing with specific choices of $u^s$ or simpler networks, and also extend all of these results to computing coalitions that are Nash stable or individually rational. We view these results as a further strong indication of the usefulness of the proposed score-based utility function: even on very simple networks, the problem of computing a welfare-maximizing partitioning into coalitions remains open for the originally considered canonical function $u$. ",
    "url": "https://arxiv.org/abs/2312.07632",
    "authors": [
      "Robert Ganian",
      "Thekla Hamm",
      "Dušan Knop",
      "Sanjukta Roy",
      "Šimon Schierreich",
      "Ondřej Suchý"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2312.07633",
    "title": "SE(3)-Invariant Multiparameter Persistent Homology for Chiral-Sensitive  Molecular Property Prediction",
    "abstract": "In this study, we present a novel computational method for generating molecular fingerprints using multiparameter persistent homology (MPPH). This technique holds considerable significance for drug discovery and materials science, where precise molecular property prediction is vital. By integrating SE(3)-invariance with Vietoris-Rips persistent homology, we effectively capture the three-dimensional representations of molecular chirality. This non-superimposable mirror image property directly influences the molecular interactions, serving as an essential factor in molecular property prediction. We explore the underlying topologies and patterns in molecular structures by applying Vietoris-Rips persistent homology across varying scales and parameters such as atomic weight, partial charge, bond type, and chirality. Our method's efficacy can be improved by incorporating additional parameters such as aromaticity, orbital hybridization, bond polarity, conjugated systems, as well as bond and torsion angles. Additionally, we leverage Stochastic Gradient Langevin Boosting in a Bayesian ensemble of GBDTs to obtain aleatoric and epistemic uncertainty estimates for gradient boosting models. With these uncertainty estimates, we prioritize high-uncertainty samples for active learning and model fine-tuning, benefiting scenarios where data labeling is costly or time consuming. Compared to conventional GNNs which usually suffer from oversmoothing and oversquashing, MPPH provides a more comprehensive and interpretable characterization of molecular data topology. We substantiate our approach with theoretical stability guarantees and demonstrate its superior performance over existing state-of-the-art methods in predicting molecular properties through extensive evaluations on the MoleculeNet benchmark datasets. ",
    "url": "https://arxiv.org/abs/2312.07633",
    "authors": [
      "Andac Demir",
      "Francis Prael III",
      "Bulent Kiziltan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Geometry (cs.CG)",
      "Algebraic Topology (math.AT)"
    ]
  },
  {
    "id": "arXiv:2312.07644",
    "title": "Approximation algorithms for k-median problems on complex networks:  theory and practice",
    "abstract": "Finding the k-medianin a network involves identifying a subset of k vertices that minimize the total distance to all other vertices in a graph. This problem has been extensively studied in computer science, graph theory, operations research, and numerous areas due to its significance in a wide range of applications. While known to be computationally challenging (NP-hard) several approximation algorithms have been proposed, most with high-order polynomial-time complexity. However, the graph topology of complex networks with heavy-tailed degree distributions present characteristics that can be exploited to yield custom-tailored algorithms. We compare eight algorithms specifically designed for complex networks and evaluate their performance based on accuracy and efficiency for problems of varying sizes and application areas. Rather than relying on a small number of problems, we conduct over 16,000 experiments covering a wide range of network sizes and k-median{} values. While individual results vary, a few methods provide consistently good results. We draw general conclusions about how algorithms perform in practice and provide general guidelines for solutions. ",
    "url": "https://arxiv.org/abs/2312.07644",
    "authors": [
      "Roldan Pozo"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2312.07679",
    "title": "Bayesian Online Learning for Consensus Prediction",
    "abstract": "Given a pre-trained classifier and multiple human experts, we investigate the task of online classification where model predictions are provided for free but querying humans incurs a cost. In this practical but under-explored setting, oracle ground truth is not available. Instead, the prediction target is defined as the consensus vote of all experts. Given that querying full consensus can be costly, we propose a general framework for online Bayesian consensus estimation, leveraging properties of the multivariate hypergeometric distribution. Based on this framework, we propose a family of methods that dynamically estimate expert consensus from partial feedback by producing a posterior over expert and model beliefs. Analyzing this posterior induces an interpretable trade-off between querying cost and classification performance. We demonstrate the efficacy of our framework against a variety of baselines on CIFAR-10H and ImageNet-16H, two large-scale crowdsourced datasets. ",
    "url": "https://arxiv.org/abs/2312.07679",
    "authors": [
      "Sam Showalter",
      "Alex Boyd",
      "Padhraic Smyth",
      "Mark Steyvers"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2312.07681",
    "title": "A Note on Local Convergence of Iterative Processes for Pipe Network  Analysis",
    "abstract": "Analysis of pipe networks involves computing flow rates and pressure differences on pipe segments in the network, given the external inflow/outflow values. This analysis can be conducted using iterative methods, among which the algorithms of Hardy Cross and Newton-Raphson have historically been applied in practice. In this note, we address the mathematical analysis of the local convergence of these algorithms. The loop-based Newton-Raphson algorithm converges quadratically fast, and we provide estimates for its convergence radius to correct some estimates in the previous literature. In contrast, we show that the convergence of the Hardy Cross algorithm is only linear. This provides theoretical confirmation of experimental observations reported earlier in the literature. ",
    "url": "https://arxiv.org/abs/2312.07681",
    "authors": [
      "Huong Luu",
      "Marek Chrobak"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2312.07682",
    "title": "An Online, Adaptive and Unsupervised Regression Framework with Drift  Detection for Label Scarcity Contexts",
    "abstract": "In scenarios where obtaining real-time labels proves challenging, conventional approaches may result in sub-optimal performance. This paper presents an optimal strategy for streaming contexts with limited labeled data, introducing an adaptive technique for unsupervised regression. The proposed method leverages a sparse set of initial labels and introduces an innovative drift detection mechanism to enable dynamic model adaptations in response to evolving patterns in the data. To enhance adaptability, we integrate the ADWIN (ADaptive WINdowing) algorithm with error generalization based on Root Mean Square Error (RMSE). ADWIN facilitates real-time drift detection, while RMSE provides a robust measure of model prediction accuracy. This combination enables our multivariate method to effectively navigate the challenges of streaming data, continuously adapting to changing patterns while maintaining a high level of predictive precision. Finally, we evaluate the performance of our multivariate method across various public datasets, comparing it to non-adapting baselines. Through comprehensive assessments, we demonstrate the superior efficacy of our adaptive regression technique for tasks where obtaining labels in real-time is a significant challenge. The results underscore the method's capacity to outperform traditional approaches and highlight its potential in scenarios characterized by label scarcity and evolving data patterns. ",
    "url": "https://arxiv.org/abs/2312.07682",
    "authors": [
      "Rene Richard",
      "Nabil Belacel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07696",
    "title": "Real-time Network Intrusion Detection via Decision Transformers",
    "abstract": "Many cybersecurity problems that require real-time decision-making based on temporal observations can be abstracted as a sequence modeling problem, e.g., network intrusion detection from a sequence of arriving packets. Existing approaches like reinforcement learning may not be suitable for such cybersecurity decision problems, since the Markovian property may not necessarily hold and the underlying network states are often not observable. In this paper, we cast the problem of real-time network intrusion detection as casual sequence modeling and draw upon the power of the transformer architecture for real-time decision-making. By conditioning a causal decision transformer on past trajectories, consisting of the rewards, network packets, and detection decisions, our proposed framework will generate future detection decisions to achieve the desired return. It enables decision transformers to be applied to real-time network intrusion detection, as well as a novel tradeoff between the accuracy and timeliness of detection. The proposed solution is evaluated on public network intrusion detection datasets and outperforms several baseline algorithms using reinforcement learning and sequence modeling, in terms of detection accuracy and timeliness. ",
    "url": "https://arxiv.org/abs/2312.07696",
    "authors": [
      "Jingdi Chen",
      "Hanhan Zhou",
      "Yongsheng Mei",
      "Gina Adam",
      "Nathaniel D. Bastian",
      "Tian Lan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.07709",
    "title": "Majority is Not Required: A Rational Analysis of the Private  Double-Spend Attack from a Sub-Majority Adversary",
    "abstract": "We study the incentives behind double-spend attacks on Nakamoto-style Proof-of-Work cryptocurrencies. In these systems, miners are allowed to choose which transactions to reference with their block, and a common strategy for selecting transactions is to simply choose those with the highest fees. This can be problematic if these transactions originate from an adversary with substantial (but less than 50\\%) computational power, as high-value transactions can present an incentive for a rational adversary to attempt a double-spend attack if they expect to profit. The most common mechanism for deterring double-spend attacks is for the recipients of large transactions to wait for additional block confirmations (i.e., to increase the attack cost). We argue that this defense mechanism is not satisfactory, as the security of the system is contingent on the actions of its users. Instead, we propose that defending against double-spend attacks should be the responsibility of the miners; specifically, miners should limit the amount of transaction value they include in a block (i.e., reduce the attack reward). To this end, we model cryptocurrency mining as a mean-field game in which we augment the standard mining reward function to simulate the presence of a rational, double-spending adversary. We design and implement an algorithm which characterizes the behavior of miners at equilibrium, and we show that miners who use the adversary-aware reward function accumulate more wealth than those who do not. We show that the optimal strategy for honest miners is to limit the amount of value transferred by each block such that the adversary's expected profit is 0. Additionally, we examine Bitcoin's resilience to double-spend attacks. Assuming a 6 block confirmation time, we find that an attacker with at least 25% of the network mining power can expect to profit from a double-spend attack. ",
    "url": "https://arxiv.org/abs/2312.07709",
    "authors": [
      "Yanni Georghiades",
      "Rajesh Mishra",
      "Karl Kreder",
      "Sriram Vishwanath"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2312.07740",
    "title": "HAtt-Flow: Hierarchical Attention-Flow Mechanism for Group Activity  Scene Graph Generation in Videos",
    "abstract": "Group Activity Scene Graph (GASG) generation is a challenging task in computer vision, aiming to anticipate and describe relationships between subjects and objects in video sequences. Traditional Video Scene Graph Generation (VidSGG) methods focus on retrospective analysis, limiting their predictive capabilities. To enrich the scene understanding capabilities, we introduced a GASG dataset extending the JRDB dataset with nuanced annotations involving \\textit{Appearance, Interaction, Position, Relationship, and Situation} attributes. This work also introduces an innovative approach, \\textbf{H}ierarchical \\textbf{Att}ention-\\textbf{Flow} (HAtt-Flow) Mechanism, rooted in flow network theory to enhance GASG performance. Flow-Attention incorporates flow conservation principles, fostering competition for sources and allocation for sinks, effectively preventing the generation of trivial attention. Our proposed approach offers a unique perspective on attention mechanisms, where conventional \"values\" and \"keys\" are transformed into sources and sinks, respectively, creating a novel framework for attention-based models. Through extensive experiments, we demonstrate the effectiveness of our Hatt-Flow model and the superiority of our proposed Flow-Attention mechanism. This work represents a significant advancement in predictive video scene understanding, providing valuable insights and techniques for applications that require real-time relationship prediction in video data. ",
    "url": "https://arxiv.org/abs/2312.07740",
    "authors": [
      "Naga VS Raviteja Chappa",
      "Pha Nguyen",
      "Thi Hoang Ngan Le",
      "Khoa Luu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.07748",
    "title": "Portability and Scalability Evaluation of Large-Scale Statistical  Modeling and Prediction Software through HPC-Ready Containers",
    "abstract": "HPC-based applications often have complex workflows with many software dependencies that hinder their portability on contemporary HPC architectures. In addition, these applications often require extraordinary efforts to deploy and execute at performance potential on new HPC systems, while the users expert in these applications generally have less expertise in HPC and related technologies. This paper provides a dynamic solution that facilitates containerization for transferring HPC software onto diverse parallel systems. The study relies on the HPC Workflow as a Service (HPCWaaS) paradigm proposed by the EuroHPC eFlows4HPC project. It offers to deploy workflows through containers tailored for any of a number of specific HPC systems. Traditional container image creation tools rely on OS system packages compiled for generic architecture families (x86\\_64, amd64, ppc64, ...) and specific MPI or GPU runtime library versions. The containerization solution proposed in this paper leverages HPC Builders such as Spack or Easybuild and multi-platform builders such as buildx to create a service for automating the creation of container images for the software specific to each hardware architecture, aiming to sustain the overall performance of the software. We assess the efficiency of our proposed solution for porting the geostatistics ExaGeoStat software on various parallel systems while preserving the computational performance. The results show that the performance of the generated images is comparable with the native execution of the software on the same architectures. On the distributed-memory system, the containerized version can scale up to 256 nodes without impacting performance. ",
    "url": "https://arxiv.org/abs/2312.07748",
    "authors": [
      "Sameh Abdulah",
      "Jorge Ejarque",
      "Omar Marzouk",
      "Hatem Ltaief",
      "Ying Sun",
      "Marc G. Genton",
      "Rosa M. Badia",
      "David E. Keyes"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2312.07753",
    "title": "Polynomial-based Self-Attention for Table Representation learning",
    "abstract": "Structured data, which constitutes a significant portion of existing data types, has been a long-standing research topic in the field of machine learning. Various representation learning methods for tabular data have been proposed, ranging from encoder-decoder structures to Transformers. Among these, Transformer-based methods have achieved state-of-the-art performance not only in tabular data but also in various other fields, including computer vision and natural language processing. However, recent studies have revealed that self-attention, a key component of Transformers, can lead to an oversmoothing issue. We show that Transformers for tabular data also face this problem, and to address the problem, we propose a novel matrix polynomial-based self-attention layer as a substitute for the original self-attention layer, which enhances model scalability. In our experiments with three representative table learning models equipped with our proposed layer, we illustrate that the layer effectively mitigates the oversmoothing problem and enhances the representation performance of the existing methods, outperforming the state-of-the-art table representation methods. ",
    "url": "https://arxiv.org/abs/2312.07753",
    "authors": [
      "Jayoung Kim",
      "Yehjin Shin",
      "Noseong Park"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.07759",
    "title": "IDKM: Memory Efficient Neural Network Quantization via Implicit,  Differentiable $k$-Means",
    "abstract": "Compressing large neural networks with minimal performance loss is crucial to enabling their deployment on edge devices. (Cho et al., 2022) proposed a weight quantization method that uses an attention-based clustering algorithm called differentiable $k$-means (DKM). Despite achieving state-of-the-art results, DKM's performance is constrained by its heavy memory dependency. We propose an implicit, differentiable $k$-means algorithm (IDKM), which eliminates the major memory restriction of DKM. Let $t$ be the number of $k$-means iterations, $m$ be the number of weight-vectors, and $b$ be the number of bits per cluster address. IDKM reduces the overall memory complexity of a single $k$-means layer from $\\mathcal{O}(t \\cdot m \\cdot 2^b)$ to $\\mathcal{O}( m \\cdot 2^b)$. We also introduce a variant, IDKM with Jacobian-Free-Backpropagation (IDKM-JFB), for which the time complexity of the gradient calculation is independent of $t$ as well. We provide a proof of concept of our methods by showing that, under the same settings, IDKM achieves comparable performance to DKM with less compute time and less memory. We also use IDKM and IDKM-JFB to quantize a large neural network, Resnet18, on hardware where DKM cannot train at all. ",
    "url": "https://arxiv.org/abs/2312.07759",
    "authors": [
      "Sean Jaffe",
      "Ambuj K. Singh",
      "Francesco Bullo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07760",
    "title": "XC-NAS: A New Cellular Encoding Approach for Neural Architecture Search  of Multi-path Convolutional Neural Networks",
    "abstract": "Convolutional Neural Networks (CNNs) continue to achieve great success in classification tasks as innovative techniques and complex multi-path architecture topologies are introduced. Neural Architecture Search (NAS) aims to automate the design of these complex architectures, reducing the need for costly manual design work by human experts. Cellular Encoding (CE) is an evolutionary computation technique which excels in constructing novel multi-path topologies of varying complexity and has recently been applied with NAS to evolve CNN architectures for various classification tasks. However, existing CE approaches have severe limitations. They are restricted to only one domain, only partially implement the theme of CE, or only focus on the micro-architecture search space. This paper introduces a new CE representation and algorithm capable of evolving novel multi-path CNN architectures of varying depth, width, and complexity for image and text classification tasks. The algorithm explicitly focuses on the macro-architecture search space. Furthermore, by using a surrogate model approach, we show that the algorithm can evolve a performant CNN architecture in less than one GPU day, thereby allowing a sufficient number of experiment runs to be conducted to achieve scientific robustness. Experiment results show that the approach is highly competitive, defeating several state-of-the-art methods, and is generalisable to both the image and text domains. ",
    "url": "https://arxiv.org/abs/2312.07760",
    "authors": [
      "Trevor Londt",
      "Xiaoying Gao",
      "Peter Andreae",
      "Yi Mei"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2312.07778",
    "title": "Safety-critical Control of Quadrupedal Robots with Rolling Arms for  Autonomous Inspection of Complex Environments",
    "abstract": "This paper presents a safety-critical control framework tailored for quadruped robots equipped with a roller arm, particularly when performing locomotive tasks such as autonomous robotic inspection in complex, multi-tiered environments. In this study, we consider the problem of operating a quadrupedal robot in distillation columns, locomoting on column trays and transitioning between these trays with a roller arm. To address this problem, our framework encompasses the following key elements: 1) Trajectory generation for seamless transitions between columns, 2) Foothold re-planning in regions deemed unsafe, 3) Safety-critical control incorporating control barrier functions, 4) Gait transitions based on safety levels, and 5) A low-level controller. Our comprehensive framework, comprising these components, enables autonomous and safe locomotion across multiple layers. We incorporate reduced-order and full-body models to ensure safety, integrating safety-critical control and footstep re-planning approaches. We validate the effectiveness of our proposed framework through practical experiments involving a quadruped robot equipped with a roller arm, successfully navigating and transitioning between different levels within the column tray structure. ",
    "url": "https://arxiv.org/abs/2312.07778",
    "authors": [
      "Jaemin Lee",
      "Jeeseop Kim",
      "Wyatt Ubellacker",
      "Tamas G. Molnar",
      "Aaron D. Ames"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2312.07783",
    "title": "BarraCUDA: Bringing Electromagnetic Side Channel Into Play to Steal the  Weights of Neural Networks from NVIDIA GPUs",
    "abstract": "Over the last decade, applications of neural networks have spread to cover all aspects of life. A large number of companies base their businesses on building products that use neural networks for tasks such as face recognition, machine translation, and autonomous cars. They are being used in safety and security-critical applications like high definition maps and medical wristbands, or in globally used products like Google Translate and ChatGPT. Much of the intellectual property underpinning these products is encoded in the exact configuration of the neural networks. Consequently, protecting these is of utmost priority to businesses. At the same time, many of these products need to operate under a strong threat model, in which the adversary has unfettered physical control of the product. Past work has demonstrated that with physical access, attackers can reverse engineer neural networks that run on scalar microcontrollers, like ARM Cortex M3. However, for performance reasons, neural networks are often implemented on highly-parallel general purpose graphics processing units (GPGPUs), and so far, attacks on these have only recovered course-grained information on the structure of the neural network, but failed to retrieve the weights and biases. In this work, we present BarraCUDA, a novel attack on GPGPUs that can completely extract the parameters of neural networks. BarraCUDA uses correlation electromagnetic analysis to recover the weights and biases in the convolutional layers of neural networks. We use BarraCUDA to attack the popular NVIDIA Jetson Nano device, demonstrating successful parameter extraction of neural networks in a highly parallel and noisy environment. ",
    "url": "https://arxiv.org/abs/2312.07783",
    "authors": [
      "Peter Horvath",
      "Lukasz Chmielewski",
      "Leo Weissbart",
      "Lejla Batina",
      "Yuval Yarom"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.07802",
    "title": "Estimation of embedding vectors in high dimensions",
    "abstract": "Embeddings are a basic initial feature extraction step in many machine learning models, particularly in natural language processing. An embedding attempts to map data tokens to a low-dimensional space where similar tokens are mapped to vectors that are close to one another by some metric in the embedding space. A basic question is how well can such embedding be learned? To study this problem, we consider a simple probability model for discrete data where there is some \"true\" but unknown embedding where the correlation of random variables is related to the similarity of the embeddings. Under this model, it is shown that the embeddings can be learned by a variant of low-rank approximate message passing (AMP) method. The AMP approach enables precise predictions of the accuracy of the estimation in certain high-dimensional limits. In particular, the methodology provides insight on the relations of key parameters such as the number of samples per value, the frequency of the terms, and the strength of the embedding correlation on the probability distribution. Our theoretical findings are validated by simulations on both synthetic data and real text data. ",
    "url": "https://arxiv.org/abs/2312.07802",
    "authors": [
      "Golara Ahmadi Azar",
      "Melika Emami",
      "Alyson Fletcher",
      "Sundeep Rangan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2312.07831",
    "title": "Abusive Span Detection for Vietnamese Narrative Texts",
    "abstract": "Abuse in its various forms, including physical, psychological, verbal, sexual, financial, and cultural, has a negative impact on mental health. However, there are limited studies on applying natural language processing (NLP) in this field in Vietnam. Therefore, we aim to contribute by building a human-annotated Vietnamese dataset for detecting abusive content in Vietnamese narrative texts. We sourced these texts from VnExpress, Vietnam's popular online newspaper, where readers often share stories containing abusive content. Identifying and categorizing abusive spans in these texts posed significant challenges during dataset creation, but it also motivated our research. We experimented with lightweight baseline models by freezing PhoBERT and XLM-RoBERTa and using their hidden states in a BiLSTM to assess the complexity of the dataset. According to our experimental results, PhoBERT outperforms other models in both labeled and unlabeled abusive span detection tasks. These results indicate that it has the potential for future improvements. ",
    "url": "https://arxiv.org/abs/2312.07831",
    "authors": [
      "Nhu-Thanh Nguyen",
      "Khoa Thi-Kim Phan",
      "Duc-Vu Nguyen",
      "Ngan Luu-Thuy Nguyen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07835",
    "title": "Video Dynamics Prior: An Internal Learning Approach for Robust Video  Enhancements",
    "abstract": "In this paper, we present a novel robust framework for low-level vision tasks, including denoising, object removal, frame interpolation, and super-resolution, that does not require any external training data corpus. Our proposed approach directly learns the weights of neural modules by optimizing over the corrupted test sequence, leveraging the spatio-temporal coherence and internal statistics of videos. Furthermore, we introduce a novel spatial pyramid loss that leverages the property of spatio-temporal patch recurrence in a video across the different scales of the video. This loss enhances robustness to unstructured noise in both the spatial and temporal domains. This further results in our framework being highly robust to degradation in input frames and yields state-of-the-art results on downstream tasks such as denoising, object removal, and frame interpolation. To validate the effectiveness of our approach, we conduct qualitative and quantitative evaluations on standard video datasets such as DAVIS, UCF-101, and VIMEO90K-T. ",
    "url": "https://arxiv.org/abs/2312.07835",
    "authors": [
      "Gaurav Shrivastava",
      "Ser-Nam Lim",
      "Abhinav Shrivastava"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07858",
    "title": "Non-myopic Beam Scheduling for Multiple Smart Target Tracking in Phased  Array Radar Network",
    "abstract": "A smart target, also referred to as a reactive target, can take maneuvering motions to hinder radar tracking. We address beam scheduling for tracking multiple smart targets in phased array radar networks. We aim to mitigate the performance degradation in previous myopic tracking methods and enhance the system performance, which is measured by a discounted cost objective related to the tracking error covariance (TEC) of the targets. The scheduling problem is formulated as a restless multi-armed bandit problem (RMABP) with state variables, following the Markov decision process. In particular, the problem consists of parallel bandit processes. Each bandit process is associated with a target and evolves with different transition rules for different actions, i.e., either the target is tracked or not. We propose a non-myopic, scalable policy based on Whittle indices for selecting the targets to be tracked at each time. The proposed policy has a linear computational complexity in the number of targets and the truncated time horizon in the index computation, and is hence applicable to large networks with a realistic number of targets. We present numerical evidence that the model satisfies sufficient conditions for indexability (existence of the Whittle index) based upon partial conservation laws, and, through extensive simulations, we validate the effectiveness of the proposed policy in different scenarios. ",
    "url": "https://arxiv.org/abs/2312.07858",
    "authors": [
      "Yuhang Hao",
      "Zengfu Wang",
      "José Niño-Mora",
      "Jing Fu",
      "Min Yang",
      "Quan Pan"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2312.07859",
    "title": "Invariant Graph Transformer",
    "abstract": "Rationale discovery is defined as finding a subset of the input data that maximally supports the prediction of downstream tasks. In graph machine learning context, graph rationale is defined to locate the critical subgraph in the given graph topology, which fundamentally determines the prediction results. In contrast to the rationale subgraph, the remaining subgraph is named the environment subgraph. Graph rationalization can enhance the model performance as the mapping between the graph rationale and prediction label is viewed as invariant, by assumption. To ensure the discriminative power of the extracted rationale subgraphs, a key technique named \"intervention\" is applied. The core idea of intervention is that given any changing environment subgraphs, the semantics from the rationale subgraph is invariant, which guarantees the correct prediction result. However, most, if not all, of the existing rationalization works on graph data develop their intervention strategies on the graph level, which is coarse-grained. In this paper, we propose well-tailored intervention strategies on graph data. Our idea is driven by the development of Transformer models, whose self-attention module provides rich interactions between input nodes. Based on the self-attention module, our proposed invariant graph Transformer (IGT) can achieve fine-grained, more specifically, node-level and virtual node-level intervention. Our comprehensive experiments involve 7 real-world datasets, and the proposed IGT shows significant performance advantages compared to 13 baseline methods. ",
    "url": "https://arxiv.org/abs/2312.07859",
    "authors": [
      "Zhe Xu",
      "Menghai Pan",
      "Yuzhong Chen",
      "Huiyuan Chen",
      "Yuchen Yan",
      "Mahashweta Das",
      "Hanghang Tong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2312.07861",
    "title": "GraphGuard: Detecting and Counteracting Training Data Misuse in Graph  Neural Networks",
    "abstract": "The emergence of Graph Neural Networks (GNNs) in graph data analysis and their deployment on Machine Learning as a Service platforms have raised critical concerns about data misuse during model training. This situation is further exacerbated due to the lack of transparency in local training processes, potentially leading to the unauthorized accumulation of large volumes of graph data, thereby infringing on the intellectual property rights of data owners. Existing methodologies often address either data misuse detection or mitigation, and are primarily designed for local GNN models rather than cloud-based MLaaS platforms. These limitations call for an effective and comprehensive solution that detects and mitigates data misuse without requiring exact training data while respecting the proprietary nature of such data. This paper introduces a pioneering approach called GraphGuard, to tackle these challenges. We propose a training-data-free method that not only detects graph data misuse but also mitigates its impact via targeted unlearning, all without relying on the original training data. Our innovative misuse detection technique employs membership inference with radioactive data, enhancing the distinguishability between member and non-member data distributions. For mitigation, we utilize synthetic graphs that emulate the characteristics previously learned by the target model, enabling effective unlearning even in the absence of exact graph data. We conduct comprehensive experiments utilizing four real-world graph datasets to demonstrate the efficacy of GraphGuard in both detection and unlearning. We show that GraphGuard attains a near-perfect detection rate of approximately 100% across these datasets with various GNN models. In addition, it performs unlearning by eliminating the impact of the unlearned graph with a marginal decrease in accuracy (less than 5%). ",
    "url": "https://arxiv.org/abs/2312.07861",
    "authors": [
      "Bang Wu",
      "He Zhang",
      "Xiangwen Yang",
      "Shuo Wang",
      "Minhui Xue",
      "Shirui Pan",
      "Xingliang Yuan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.07868",
    "title": "Graph vs. Sequence: An Empirical Study on Knowledge Forms for  Knowledge-Grounded Dialogue",
    "abstract": "Knowledge-grounded dialogue is a task of generating an informative response based on both the dialogue history and external knowledge source. In general, there are two forms of knowledge: manually annotated knowledge graphs and knowledge text from website. From various evaluation viewpoints, each type of knowledge has advantages and downsides. To further distinguish the principles and determinants from the intricate factors, we conduct a thorough experiment and study on the task to answer three essential questions. The questions involve the choice of appropriate knowledge form, the degree of mutual effects between knowledge and the model selection, and the few-shot performance of knowledge. Supported by statistical shreds of evidence, we offer conclusive solutions and sensible suggestions for directions and standards of future research. ",
    "url": "https://arxiv.org/abs/2312.07868",
    "authors": [
      "Yizhe Yang",
      "Heyan Huang",
      "Yihang Liu",
      "Yang Gao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2312.07870",
    "title": "Securing Graph Neural Networks in MLaaS: A Comprehensive Realization of  Query-based Integrity Verification",
    "abstract": "The deployment of Graph Neural Networks (GNNs) within Machine Learning as a Service (MLaaS) has opened up new attack surfaces and an escalation in security concerns regarding model-centric attacks. These attacks can directly manipulate the GNN model parameters during serving, causing incorrect predictions and posing substantial threats to essential GNN applications. Traditional integrity verification methods falter in this context due to the limitations imposed by MLaaS and the distinct characteristics of GNN models. In this research, we introduce a groundbreaking approach to protect GNN models in MLaaS from model-centric attacks. Our approach includes a comprehensive verification schema for GNN's integrity, taking into account both transductive and inductive GNNs, and accommodating varying pre-deployment knowledge of the models. We propose a query-based verification technique, fortified with innovative node fingerprint generation algorithms. To deal with advanced attackers who know our mechanisms in advance, we introduce randomized fingerprint nodes within our design. The experimental evaluation demonstrates that our method can detect five representative adversarial model-centric attacks, displaying 2 to 4 times greater efficiency compared to baselines. ",
    "url": "https://arxiv.org/abs/2312.07870",
    "authors": [
      "Bang Wu",
      "Xingliang Yuan",
      "Shuo Wang",
      "Qi Li",
      "Minhui Xue",
      "Shirui Pan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.07871",
    "title": "MLNet: Mutual Learning Network with Neighborhood Invariance for  Universal Domain Adaptation",
    "abstract": "Universal domain adaptation (UniDA) is a practical but challenging problem, in which information about the relation between the source and the target domains is not given for knowledge transfer. Existing UniDA methods may suffer from the problems of overlooking intra-domain variations in the target domain and difficulty in separating between the similar known and unknown class. To address these issues, we propose a novel \\textbf{Mutual Learning Network (MLNet)} with neighborhood invariance for UniDA. In our method, confidence-guided invariant feature learning with self-adaptive neighbor selection is designed to reduce the intra-domain variations for more generalizable feature representation. By using the cross-domain mixup scheme for better unknown-class identification, the proposed method compensates for the misidentified known-class errors by mutual learning between the closed-set and open-set classifiers. Extensive experiments on three publicly available benchmarks demonstrate that our method achieves the best results compared to the state-of-the-arts in most cases and significantly outperforms the baseline across all the four settings in UniDA. Code is available at https://github.com/YanzuoLu/MLNet. ",
    "url": "https://arxiv.org/abs/2312.07871",
    "authors": [
      "Yanzuo Lu",
      "Meng Shen",
      "Andy J Ma",
      "Xiaohua Xie",
      "Jian-Huang Lai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.07876",
    "title": "Causality Analysis for Evaluating the Security of Large Language Models",
    "abstract": "Large Language Models (LLMs) such as GPT and Llama2 are increasingly adopted in many safety-critical applications. Their security is thus essential. Even with considerable efforts spent on reinforcement learning from human feedback (RLHF), recent studies have shown that LLMs are still subject to attacks such as adversarial perturbation and Trojan attacks. Further research is thus needed to evaluate their security and/or understand the lack of it. In this work, we propose a framework for conducting light-weight causality-analysis of LLMs at the token, layer, and neuron level. We applied our framework to open-source LLMs such as Llama2 and Vicuna and had multiple interesting discoveries. Based on a layer-level causality analysis, we show that RLHF has the effect of overfitting a model to harmful prompts. It implies that such security can be easily overcome by `unusual' harmful prompts. As evidence, we propose an adversarial perturbation method that achieves 100\\% attack success rate on the red-teaming tasks of the Trojan Detection Competition 2023. Furthermore, we show the existence of one mysterious neuron in both Llama2 and Vicuna that has an unreasonably high causal effect on the output. While we are uncertain on why such a neuron exists, we show that it is possible to conduct a ``Trojan'' attack targeting that particular neuron to completely cripple the LLM, i.e., we can generate transferable suffixes to prompts that frequently make the LLM produce meaningless responses. ",
    "url": "https://arxiv.org/abs/2312.07876",
    "authors": [
      "Wei Zhao",
      "Zhe Li",
      "Jun Sun"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.07885",
    "title": "RAT: Reinforcement-Learning-Driven and Adaptive Testing for  Vulnerability Discovery in Web Application Firewalls",
    "abstract": "Due to the increasing sophistication of web attacks, Web Application Firewalls (WAFs) have to be tested and updated regularly to resist the relentless flow of web attacks. In practice, using a brute-force attack to discover vulnerabilities is infeasible due to the wide variety of attack patterns. Thus, various black-box testing techniques have been proposed in the literature. However, these techniques suffer from low efficiency. This paper presents Reinforcement-Learning-Driven and Adaptive Testing (RAT), an automated black-box testing strategy to discover injection vulnerabilities in WAFs. In particular, we focus on SQL injection and Cross-site Scripting, which have been among the top ten vulnerabilities over the past decade. More specifically, RAT clusters similar attack samples together. It then utilizes a reinforcement learning technique combined with a novel adaptive search algorithm to discover almost all bypassing attack patterns efficiently. We compare RAT with three state-of-the-art methods considering their objectives. The experiments show that RAT performs 33.53% and 63.16% on average better than its counterparts in discovering the most possible bypassing payloads and reducing the number of attempts before finding the first bypassing payload when testing well-configured WAFs, respectively. ",
    "url": "https://arxiv.org/abs/2312.07885",
    "authors": [
      "Mohammadhossein Amouei",
      "Mohsen Rezvani",
      "Mansoor Fateh"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2312.07921",
    "title": "BinGo: Identifying Security Patches in Binary Code with Graph  Representation Learning",
    "abstract": "A timely software update is vital to combat the increasing security vulnerabilities. However, some software vendors may secretly patch their vulnerabilities without creating CVE entries or even describing the security issue in their change log. Thus, it is critical to identify these hidden security patches and defeat potential N-day attacks. Researchers have employed various machine learning techniques to identify security patches in open-source software, leveraging the syntax and semantic features of the software changes and commit messages. However, all these solutions cannot be directly applied to the binary code, whose instructions and program flow may dramatically vary due to different compilation configurations. In this paper, we propose BinGo, a new security patch detection system for binary code. The main idea is to present the binary code as code property graphs to enable a comprehensive understanding of program flow and perform a language model over each basic block of binary code to catch the instruction semantics. BinGo consists of four phases, namely, patch data pre-processing, graph extraction, embedding generation, and graph representation learning. Due to the lack of an existing binary security patch dataset, we construct such a dataset by compiling the pre-patch and post-patch source code of the Linux kernel. Our experimental results show BinGo can achieve up to 80.77% accuracy in identifying security patches between two neighboring versions of binary code. Moreover, BinGo can effectively reduce the false positives and false negatives caused by the different compilers and optimization levels. ",
    "url": "https://arxiv.org/abs/2312.07921",
    "authors": [
      "Xu He",
      "Shu Wang",
      "Pengbin Feng",
      "Xinda Wang",
      "Shiyu Sun",
      "Qi Li",
      "Kun Sun"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2312.07922",
    "title": "Memory-Efficient Reversible Spiking Neural Networks",
    "abstract": "Spiking neural networks (SNNs) are potential competitors to artificial neural networks (ANNs) due to their high energy-efficiency on neuromorphic hardware. However, SNNs are unfolded over simulation time steps during the training process. Thus, SNNs require much more memory than ANNs, which impedes the training of deeper SNN models. In this paper, we propose the reversible spiking neural network to reduce the memory cost of intermediate activations and membrane potentials during training. Firstly, we extend the reversible architecture along temporal dimension and propose the reversible spiking block, which can reconstruct the computational graph and recompute all intermediate variables in forward pass with a reverse process. On this basis, we adopt the state-of-the-art SNN models to the reversible variants, namely reversible spiking ResNet (RevSResNet) and reversible spiking transformer (RevSFormer). Through experiments on static and neuromorphic datasets, we demonstrate that the memory cost per image of our reversible SNNs does not increase with the network depth. On CIFAR10 and CIFAR100 datasets, our RevSResNet37 and RevSFormer-4-384 achieve comparable accuracies and consume 3.79x and 3.00x lower GPU memory per image than their counterparts with roughly identical model complexity and parameters. We believe that this work can unleash the memory constraints in SNN training and pave the way for training extremely large and deep SNNs. The code is available at https://github.com/mi804/RevSNN.git. ",
    "url": "https://arxiv.org/abs/2312.07922",
    "authors": [
      "Hong Zhang",
      "Yu Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2312.07925",
    "title": "Polar-Doc: One-Stage Document Dewarping with Multi-Scope Constraints  under Polar Representation",
    "abstract": "Document dewarping, aiming to eliminate geometric deformation in photographed documents to benefit text recognition, has made great progress in recent years but is still far from being solved. While Cartesian coordinates are typically leveraged by state-of-the-art approaches to learn a group of deformation control points, such representation is not efficient for dewarping model to learn the deformation information. In this work, we explore Polar coordinates representation for each point in document dewarping, namely Polar-Doc. In contrast to most current works adopting a two-stage pipeline typically, Polar representation enables a unified point regression framework for both segmentation and dewarping network in one single stage. Such unification makes the whole model more efficient to learn under an end-to-end optimization pipeline, and also obtains a compact representation. Furthermore, we propose a novel multi-scope Polar-Doc-IOU loss to constrain the relationship among control points as a grid-based regularization under the Polar representation. Visual comparisons and quantitative experiments on two benchmarks show that, with much fewer parameters than the other mainstream counterparts, our one-stage model with multi-scope constraints achieves new state-of-the-art performance on both pixel alignment metrics and OCR metrics. Source codes will be available at \\url{*****}. ",
    "url": "https://arxiv.org/abs/2312.07925",
    "authors": [
      "Weiguang Zhang",
      "Qiufeng Wang",
      "Kaizhu Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.07929",
    "title": "Robust and Performance Incentivizing Algorithms for Multi-Armed Bandits  with Strategic Agents",
    "abstract": "We consider a variant of the stochastic multi-armed bandit problem. Specifically, the arms are strategic agents who can improve their rewards or absorb them. The utility of an agent increases if she is pulled more or absorbs more of her rewards but decreases if she spends more effort improving her rewards. Agents have heterogeneous properties, specifically having different means and able to improve their rewards up to different levels. Further, a non-empty subset of agents are ''honest'' and in the worst case always give their rewards without absorbing any part. The principal wishes to obtain a high revenue (cumulative reward) by designing a mechanism that incentives top level performance at equilibrium. At the same time, the principal wishes to be robust and obtain revenue at least at the level of the honest agent with the highest mean in case of non-equilibrium behaviour. We identify a class of MAB algorithms which we call performance incentivizing which satisfy a collection of properties and show that they lead to mechanisms that incentivize top level performance at equilibrium and are robust under any strategy profile. Interestingly, we show that UCB is an example of such a MAB algorithm. Further, in the case where the top performance level is unknown we show that combining second price auction ideas with performance incentivizing algorithms achieves performance at least at the second top level while also being robust. ",
    "url": "https://arxiv.org/abs/2312.07929",
    "authors": [
      "Seyed A. Esmaeili",
      "Suho Shin",
      "Aleksandrs Slivkins"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07931",
    "title": "Levenshtein Distance Embedding with Poisson Regression for DNA Storage",
    "abstract": "Efficient computation or approximation of Levenshtein distance, a widely-used metric for evaluating sequence similarity, has attracted significant attention with the emergence of DNA storage and other biological applications. Sequence embedding, which maps Levenshtein distance to a conventional distance between embedding vectors, has emerged as a promising solution. In this paper, a novel neural network-based sequence embedding technique using Poisson regression is proposed. We first provide a theoretical analysis of the impact of embedding dimension on model performance and present a criterion for selecting an appropriate embedding dimension. Under this embedding dimension, the Poisson regression is introduced by assuming the Levenshtein distance between sequences of fixed length following a Poisson distribution, which naturally aligns with the definition of Levenshtein distance. Moreover, from the perspective of the distribution of embedding distances, Poisson regression approximates the negative log likelihood of the chi-squared distribution and offers advancements in removing the skewness. Through comprehensive experiments on real DNA storage data, we demonstrate the superior performance of the proposed method compared to state-of-the-art approaches. ",
    "url": "https://arxiv.org/abs/2312.07931",
    "authors": [
      "Xiang Wei",
      "Alan J.X. Guo",
      "Sihan Sun",
      "Mengyi Wei",
      "Wei Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2312.07935",
    "title": "Comparing YOLOv8 and Mask RCNN for object segmentation in complex  orchard environments",
    "abstract": "Instance segmentation, an important image processing operation for automation in agriculture, is used to precisely delineate individual objects of interest within images, which provides foundational information for various automated or robotic tasks such as selective harvesting and precision pruning. This study compares the one-stage YOLOv8 and the two-stage Mask R-CNN machine learning models for instance segmentation under varying orchard conditions across two datasets. Dataset 1, collected in dormant season, includes images of dormant apple trees, which were used to train multi-object segmentation models delineating tree branches and trunks. Dataset 2, collected in the early growing season, includes images of apple tree canopies with green foliage and immature (green) apples (also called fruitlet), which were used to train single-object segmentation models delineating only immature green apples. The results showed that YOLOv8 performed better than Mask R-CNN, achieving good precision and near-perfect recall across both datasets at a confidence threshold of 0.5. Specifically, for Dataset 1, YOLOv8 achieved a precision of 0.90 and a recall of 0.95 for all classes. In comparison, Mask R-CNN demonstrated a precision of 0.81 and a recall of 0.81 for the same dataset. With Dataset 2, YOLOv8 achieved a precision of 0.93 and a recall of 0.97. Mask R-CNN, in this single-class scenario, achieved a precision of 0.85 and a recall of 0.88. Additionally, the inference times for YOLOv8 were 10.9 ms for multi-class segmentation (Dataset 1) and 7.8 ms for single-class segmentation (Dataset 2), compared to 15.6 ms and 12.8 ms achieved by Mask R-CNN's, respectively. ",
    "url": "https://arxiv.org/abs/2312.07935",
    "authors": [
      "Ranjan Sapkota",
      "Dawood Ahmed",
      "Manoj Karkee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.07936",
    "title": "Coordinated Intra- and Inter-system Interference Management in  Integrated Satellite Terrestrial Networks",
    "abstract": "Leveraging the advantage of satellite and terrestrial networks, the integrated satellite terrestrial networks (ISTNs) can help to achieve seamless global access and eliminate the digital divide. However, the dense deployment and frequent handover of satellites aggravate intra- and inter-system interference, resulting in a decrease in downlink sum rate. To address this issue, we propose a coordinated intra- and inter-system interference management algorithm for ISTN. This algorithm coordinates multidimensional interference through a joint design of inter-satellite handover and resource allocation method. On the one hand, we take inter-system interference between low earth orbit (LEO) and geostationary orbit (GEO) satellites as a constraint, and reduce interference to GEO satellite ground stations (GEO-GS) while ensuring system capacity through inter-satellite handover. On the other hand, satellite and terrestrial resource allocation schemes are designed based on the matching idea, and channel gain and interference to other channels are considered during the matching process to coordinate co-channel interference. In order to avoid too many unnecessary handovers, we consider handover scenarios related to service capabilities and service time to determine the optimal handover target satellite. Numerical results show that the gap between the results on the system sum rate obtained by the proposed method and the upper bound is reduced as the user density increases, and the handover frequency can be significantly reduced. ",
    "url": "https://arxiv.org/abs/2312.07936",
    "authors": [
      "Ziyue Zhang",
      "Min Sheng",
      "Junyu Liu",
      "Jiandong Li"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2312.07945",
    "title": "Linear Combination of Exponential Moving Averages for Wireless Channel  Prediction",
    "abstract": "The ability to predict the behavior of a wireless channel in terms of the frame delivery ratio is quite valuable, and permits, e.g., to optimize the operating parameters of a wireless network at runtime, or to proactively react to the degradation of the channel quality, in order to meet the stringent requirements about dependability and end-to-end latency that typically characterize industrial applications. In this work, prediction models based on the exponential moving average (EMA) are investigated in depth, which are proven to outperform other simple statistical methods and whose performance is nearly as good as artificial neural networks, but with dramatically lower computational requirements. Regarding the innovation and motivation of this work, a new model that we called EMA linear combination (ELC), is introduced, explained, and evaluated experimentally. Its prediction accuracy, tested on some databases acquired from a real setup based on Wi-Fi devices, showed that ELC brings tangible improvements over EMA in any experimental conditions, the only drawback being a slight increase in computational complexity. ",
    "url": "https://arxiv.org/abs/2312.07945",
    "authors": [
      "Gabriele Formis",
      "Stefano Scanzio",
      "Gianluca Cena",
      "Adriano Valenzano"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07951",
    "title": "Semantic-aware Data Augmentation for Text-to-image Synthesis",
    "abstract": "Data augmentation has been recently leveraged as an effective regularizer in various vision-language deep neural networks. However, in text-to-image synthesis (T2Isyn), current augmentation wisdom still suffers from the semantic mismatch between augmented paired data. Even worse, semantic collapse may occur when generated images are less semantically constrained. In this paper, we develop a novel Semantic-aware Data Augmentation (SADA) framework dedicated to T2Isyn. In particular, we propose to augment texts in the semantic space via an Implicit Textual Semantic Preserving Augmentation ($ITA$), in conjunction with a specifically designed Image Semantic Regularization Loss ($L_r$) as Generated Image Semantic Conservation, to cope well with semantic mismatch and collapse. As one major contribution, we theoretically show that $ITA$ can certify better text-image consistency while $L_r$ regularizing the semantics of generated images would avoid semantic collapse and enhance image quality. Extensive experiments validate that SADA enhances text-image consistency and improves image quality significantly in T2Isyn models across various backbones. Especially, incorporating SADA during the tuning process of Stable Diffusion models also yields performance improvements. ",
    "url": "https://arxiv.org/abs/2312.07951",
    "authors": [
      "Zhaorui Tan",
      "Xi Yang",
      "Kaizhu Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.07955",
    "title": "Erasing Self-Supervised Learning Backdoor by Cluster Activation Masking",
    "abstract": "Researchers have recently found that Self-Supervised Learning (SSL) is vulnerable to backdoor attacks. The attacker can embed hidden SSL backdoors via a few poisoned examples in the training dataset and maliciously manipulate the behavior of downstream models. To defend against SSL backdoor attacks, a feasible route is to detect and remove the poisonous samples in the training set. However, the existing SSL backdoor defense method fails to detect the poisonous samples precisely. In this paper, we propose to erase the SSL backdoor by cluster activation masking and propose a novel PoisonCAM method. After obtaining the threat model trained on the poisoned dataset, our method can precisely detect poisonous samples based on the assumption that masking the backdoor trigger can effectively change the activation of a downstream clustering model. In experiments, our PoisonCAM achieves 96% accuracy for backdoor trigger detection compared to 3% of the state-of-the-art method on poisoned ImageNet-100. Moreover, our proposed PoisonCAM significantly improves the performance of the trained SSL model under backdoor attacks compared to the state-of-the-art method. Our code will be available at https://github.com/LivXue/PoisonCAM. ",
    "url": "https://arxiv.org/abs/2312.07955",
    "authors": [
      "Shengsheng Qian",
      "Yifei Wang",
      "Dizhan Xue",
      "Shengjie Zhang",
      "Huaiwen Zhang",
      "Changsheng Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07956",
    "title": "Topology-Dependent Privacy Bound For Decentralized Federated Learning",
    "abstract": "Decentralized Federated Learning (FL) has attracted significant attention due to its enhanced robustness and scalability compared to its centralized counterpart. It pivots on peer-to-peer communication rather than depending on a central server for model aggregation. While prior research has delved into various factors of decentralized FL such as aggregation methods and privacy-preserving techniques, one crucial aspect affecting privacy is relatively unexplored: the underlying graph topology. In this paper, we fill the gap by deriving a stringent privacy bound for decentralized FL under the condition that the accuracy is not compromised, highlighting the pivotal role of graph topology. Specifically, we demonstrate that the minimum privacy loss at each model aggregation step is dependent on the size of what we term as 'honest components', the maximally connected subgraphs once all untrustworthy participants are excluded from the networks, which is closely tied to network robustness. Our analysis suggests that attack-resilient networks will provide a superior privacy guarantee. We further validate this by studying both Poisson and power law networks, showing that the latter, being less robust against attacks, indeed reveals more privacy. In addition to a theoretical analysis, we consolidate our findings by examining two distinct privacy attacks: membership inference and gradient inversion. ",
    "url": "https://arxiv.org/abs/2312.07956",
    "authors": [
      "Qiongxiu Li",
      "Wenrui Yu",
      "Changlong Ji",
      "Richard Heusdens"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2312.07961",
    "title": "Robust Few-Shot Named Entity Recognition with Boundary Discrimination  and Correlation Purification",
    "abstract": "Few-shot named entity recognition (NER) aims to recognize novel named entities in low-resource domains utilizing existing knowledge. However, the present few-shot NER models assume that the labeled data are all clean without noise or outliers, and there are few works focusing on the robustness of the cross-domain transfer learning ability to textual adversarial attacks in Few-shot NER. In this work, we comprehensively explore and assess the robustness of few-shot NER models under textual adversarial attack scenario, and found the vulnerability of existing few-shot NER models. Furthermore, we propose a robust two-stage few-shot NER method with Boundary Discrimination and Correlation Purification (BDCP). Specifically, in the span detection stage, the entity boundary discriminative module is introduced to provide a highly distinguishing boundary representation space to detect entity spans. In the entity typing stage, the correlations between entities and contexts are purified by minimizing the interference information and facilitating correlation generalization to alleviate the perturbations caused by textual adversarial attacks. In addition, we construct adversarial examples for few-shot NER based on public datasets Few-NERD and Cross-Dataset. Comprehensive evaluations on those two groups of few-shot NER datasets containing adversarial examples demonstrate the robustness and superiority of the proposed method. ",
    "url": "https://arxiv.org/abs/2312.07961",
    "authors": [
      "Xiaojun Xue",
      "Chunxia Zhang",
      "Tianxiang Xu",
      "Zhendong Niu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.07976",
    "title": "Challenges of YOLO Series for Object Detection in Extremely Heavy Rain:  CALRA Simulator based Synthetic Evaluation Dat a set",
    "abstract": "Recently, as many studies of autonomous vehicles have been achieved for levels 4 and 5, there has been also increasing interest in the advancement of perception, decision, and control technologies, which are the three major aspects of autonomous vehicles. As for the perception technologies achieving reliable maneuvering of autonomous vehicles, object detection by using diverse sensors (e.g., LiDAR, radar, and camera) should be prioritized. These sensors require to detect objects accurately and quickly in diverse weather conditions, but they tend to have challenges to consistently detect objects in bad weather conditions with rain, snow, or fog. Thus, in this study, based on the experimentally obtained raindrop data from precipitation conditions, we constructed a novel dataset that could test diverse network model in various precipitation conditions through the CARLA simulator. Consequently, based on our novel dataset, YOLO series, a one-stage-detector, was used to quantitatively verify how much object detection performance could be decreased under various precipitation conditions from normal to extreme heavy rain situations. ",
    "url": "https://arxiv.org/abs/2312.07976",
    "authors": [
      "T. Kim",
      "H. Jeon",
      "Y. Lim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.07979",
    "title": "SLJP: Semantic Extraction based Legal Judgment Prediction",
    "abstract": "Legal Judgment Prediction (LJP) is a judicial assistance system that recommends the legal components such as applicable statues, prison term and penalty term by analyzing the given input case document. Indian legal system is in the need of technical assistance such as artificial intelligence to solve the crores of pending cases in various courts for years and its being increased day to day. Most of the existing Indian models did not adequately concentrate on the semantics embedded in the fact description (FD) that impacts the decision. The proposed semantic extraction based LJP (SLJP) model provides the advantages of pretrained transformers for complex unstructured legal case document understanding and to generate embeddings. The model draws the in-depth semantics of the given FD at multiple levels i.e., chunk and case document level by following the divide and conquer approach. It creates the concise view of the given fact description using the extracted semantics as per the original court case document structure and predicts judgment using attention mechanism. We tested the model performance on two available Indian datasets Indian Legal Documents corpus (ILDC) and Indian Legal Statue Identification (ILSI) and got promising results. Also shown the highest performance and less performance degradation for increased epochs than base models on ILDC dataset. ",
    "url": "https://arxiv.org/abs/2312.07979",
    "authors": [
      "Prameela Madambakam",
      "Shathanaa Rajmohan",
      "Himangshu Sharma",
      "Tummepalli Anka Chandrahas Purushotham Gupta"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07983",
    "title": "Multi-perspective Feedback-attention Coupling Model for Continuous-time  Dynamic Graphs",
    "abstract": "Recently, representation learning over graph networks has gained popularity, with various models showing promising results. Despite this, several challenges persist: 1) most methods are designed for static or discrete-time dynamic graphs; 2) existing continuous-time dynamic graph algorithms focus on a single evolving perspective; and 3) many continuous-time dynamic graph approaches necessitate numerous temporal neighbors to capture long-term dependencies. In response, this paper introduces the Multi-Perspective Feedback-Attention Coupling (MPFA) model. MPFA incorporates information from both evolving and raw perspectives, efficiently learning the interleaved dynamics of observed processes. The evolving perspective employs temporal self-attention to distinguish continuously evolving temporal neighbors for information aggregation. Through dynamic updates, this perspective can capture long-term dependencies using a small number of temporal neighbors. Meanwhile, the raw perspective utilizes a feedback attention module with growth characteristic coefficients to aggregate raw neighborhood information. Experimental results on a self-organizing dataset and seven public datasets validate the efficacy and competitiveness of our proposed model. ",
    "url": "https://arxiv.org/abs/2312.07983",
    "authors": [
      "Xiaobo Zhu",
      "Yan Wu",
      "Zhipeng Li",
      "Hailong Su",
      "Jin Che",
      "Zhanheng Chen",
      "Liying Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2312.07992",
    "title": "On the privacy of federated Clustering: A Cryptographic View",
    "abstract": "The privacy concern in federated clustering has attracted considerable attention in past decades. Many privacy-preserving clustering algorithms leverage cryptographic techniques like homomorphic encryption or secure multiparty computation, to guarantee full privacy, i.e., no additional information is leaked other than the final output. However, given the iterative nature of clustering algorithms, consistently encrypting intermediate outputs, such as centroids, hampers efficiency. This paper delves into this intricate trade-off, questioning the necessity of continuous encryption in iterative algorithms. Using the federated K-means clustering as an example, we mathematically formulate the problem of reconstructing input private data from the intermediate centroids as a classical cryptographic problem called hidden subset sum problem (HSSP)-extended from an NP-complete problem called subset sum problem (SSP). Through an in-depth analysis, we show that existing lattice-based HSSP attacks fail in reconstructing the private data given the knowledge of intermediate centroids, thus it is secure to reveal them for the sake of efficiency. To the best of our knowledge, our work is the first to cast federated clustering's privacy concerns as a cryptographic problem HSSP such that a concrete and rigorous analysis can be conducted. ",
    "url": "https://arxiv.org/abs/2312.07992",
    "authors": [
      "Qiongxiu Li",
      "Lixia Luo"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.08004",
    "title": "Instance-aware Multi-Camera 3D Object Detection with Structural Priors  Mining and Self-Boosting Learning",
    "abstract": "Camera-based bird-eye-view (BEV) perception paradigm has made significant progress in the autonomous driving field. Under such a paradigm, accurate BEV representation construction relies on reliable depth estimation for multi-camera images. However, existing approaches exhaustively predict depths for every pixel without prioritizing objects, which are precisely the entities requiring detection in the 3D space. To this end, we propose IA-BEV, which integrates image-plane instance awareness into the depth estimation process within a BEV-based detector. First, a category-specific structural priors mining approach is proposed for enhancing the efficacy of monocular depth generation. Besides, a self-boosting learning strategy is further proposed to encourage the model to place more emphasis on challenging objects in computation-expensive temporal stereo matching. Together they provide advanced depth estimation results for high-quality BEV features construction, benefiting the ultimate 3D detection. The proposed method achieves state-of-the-art performances on the challenging nuScenes benchmark, and extensive experimental results demonstrate the effectiveness of our designs. ",
    "url": "https://arxiv.org/abs/2312.08004",
    "authors": [
      "Yang Jiao",
      "Zequn Jie",
      "Shaoxiang Chen",
      "Lechao Cheng",
      "Jingjing Chen",
      "Lin Ma",
      "Yu-Gang Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.08009",
    "title": "Semi-Supervised Class-Agnostic Motion Prediction with Pseudo Label  Regeneration and BEVMix",
    "abstract": "Class-agnostic motion prediction methods aim to comprehend motion within open-world scenarios, holding significance for autonomous driving systems. However, training a high-performance model in a fully-supervised manner always requires substantial amounts of manually annotated data, which can be both expensive and time-consuming to obtain. To address this challenge, our study explores the potential of semi-supervised learning (SSL) for class-agnostic motion prediction. Our SSL framework adopts a consistency-based self-training paradigm, enabling the model to learn from unlabeled data by generating pseudo labels through test-time inference. To improve the quality of pseudo labels, we propose a novel motion selection and re-generation module. This module effectively selects reliable pseudo labels and re-generates unreliable ones. Furthermore, we propose two data augmentation strategies: temporal sampling and BEVMix. These strategies facilitate consistency regularization in SSL. Experiments conducted on nuScenes demonstrate that our SSL method can surpass the self-supervised approach by a large margin by utilizing only a tiny fraction of labeled data. Furthermore, our method exhibits comparable performance to weakly and some fully supervised methods. These results highlight the ability of our method to strike a favorable balance between annotation costs and performance. Code will be available at https://github.com/kwwcv/SSMP. ",
    "url": "https://arxiv.org/abs/2312.08009",
    "authors": [
      "Kewei Wang",
      "Yizheng Wu",
      "Zhiyu Pan",
      "Xingyi Li",
      "Ke Xian",
      "Zhe Wang",
      "Zhiguo Cao",
      "Guosheng Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.08012",
    "title": "uSF: Learning Neural Semantic Field with Uncertainty",
    "abstract": "Recently, there has been an increased interest in NeRF methods which reconstruct differentiable representation of three-dimensional scenes. One of the main limitations of such methods is their inability to assess the confidence of the model in its predictions. In this paper, we propose a new neural network model for the formation of extended vector representations, called uSF, which allows the model to predict not only color and semantic label of each point, but also estimate the corresponding values of uncertainty. We show that with a small number of images available for training, a model quantifying uncertainty performs better than a model without such functionality. Code of the uSF approach is publicly available at https://github.com/sevashasla/usf/. ",
    "url": "https://arxiv.org/abs/2312.08012",
    "authors": [
      "Vsevolod Skorokhodov",
      "Darya Drozdova",
      "Dmitry Yudin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.08016",
    "title": "Secure Deep Reinforcement Learning for Dynamic Resource Allocation in  Wireless MEC Networks",
    "abstract": "This paper proposes a blockchain-secured deep reinforcement learning (BC-DRL) optimization framework for {data management and} resource allocation in decentralized {wireless mobile edge computing (MEC)} networks. In our framework, {we design a low-latency reputation-based proof-of-stake (RPoS) consensus protocol to select highly reliable blockchain-enabled BSs to securely store MEC user requests and prevent data tampering attacks.} {We formulate the MEC resource allocation optimization as a constrained Markov decision process that balances minimum processing latency and denial-of-service (DoS) probability}. {We use the MEC aggregated features as the DRL input to significantly reduce the high-dimensionality input of the remaining service processing time for individual MEC requests. Our designed constrained DRL effectively attains the optimal resource allocations that are adapted to the dynamic DoS requirements. We provide extensive simulation results and analysis to} validate that our BC-DRL framework achieves higher security, reliability, and resource utilization efficiency than benchmark blockchain consensus protocols and {MEC} resource allocation algorithms. ",
    "url": "https://arxiv.org/abs/2312.08016",
    "authors": [
      "Xin Hao",
      "Phee Lep Yeoh",
      "Changyang She",
      "Branka Vucetic",
      "Yonghui Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2312.08020",
    "title": "Generalized Deepfakes Detection with Reconstructed-Blended Images and  Multi-scale Feature Reconstruction Network",
    "abstract": "The growing diversity of digital face manipulation techniques has led to an urgent need for a universal and robust detection technology to mitigate the risks posed by malicious forgeries. We present a blended-based detection approach that has robust applicability to unseen datasets. It combines a method for generating synthetic training samples, i.e., reconstructed blended images, that incorporate potential deepfake generator artifacts and a detection model, a multi-scale feature reconstruction network, for capturing the generic boundary artifacts and noise distribution anomalies brought about by digital face manipulations. Experiments demonstrated that this approach results in better performance in both cross-manipulation detection and cross-dataset detection on unseen data. ",
    "url": "https://arxiv.org/abs/2312.08020",
    "authors": [
      "Yuyang Sun",
      "Huy H. Nguyen",
      "Chun-Shien Lu",
      "ZhiYong Zhang",
      "Lu Sun",
      "Isao Echizen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.08028",
    "title": "Provable Security for the Onion Routing and Mix Network Packet Format  Sphinx",
    "abstract": "Onion routing and mix networks are fundamental concepts to provide users with anonymous access to the Internet. Various corresponding solutions rely on the efficient Sphinx packet format. However, flaws in Sphinx's underlying proof strategy were found recently. It is thus currently unclear which guarantees Sphinx actually provides, and, even worse, there is no suitable proof strategy available. In this paper, we restore the security foundation for all these works by building a theoretical framework for Sphinx. We discover that the previously-used DDH assumption is insufficient for a security proof and show that the Gap Diffie-Hellman (GDH) assumption is required instead. We apply it to prove that a slightly adapted version of the Sphinx packet format is secure under the GDH assumption. Ours is the first work to provide a detailed, in-depth security proof for Sphinx in this manner. Our adaptations to Sphinx are necessary, as we demonstrate with an attack on sender privacy that would be possible otherwise. ",
    "url": "https://arxiv.org/abs/2312.08028",
    "authors": [
      "Philip Scherer",
      "Christiane Weis",
      "Thorsten Strufe"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.08036",
    "title": "CoRTEx: Contrastive Learning for Representing Terms via Explanations  with Applications on Constructing Biomedical Knowledge Graphs",
    "abstract": "Objective: Biomedical Knowledge Graphs play a pivotal role in various biomedical research domains. Concurrently, term clustering emerges as a crucial step in constructing these knowledge graphs, aiming to identify synonymous terms. Due to a lack of knowledge, previous contrastive learning models trained with Unified Medical Language System (UMLS) synonyms struggle at clustering difficult terms and do not generalize well beyond UMLS terms. In this work, we leverage the world knowledge from Large Language Models (LLMs) and propose Contrastive Learning for Representing Terms via Explanations (CoRTEx) to enhance term representation and significantly improves term clustering. Materials and Methods: The model training involves generating explanations for a cleaned subset of UMLS terms using ChatGPT. We employ contrastive learning, considering term and explanation embeddings simultaneously, and progressively introduce hard negative samples. Additionally, a ChatGPT-assisted BIRCH algorithm is designed for efficient clustering of a new ontology. Results: We established a clustering test set and a hard negative test set, where our model consistently achieves the highest F1 score. With CoRTEx embeddings and the modified BIRCH algorithm, we grouped 35,580,932 terms from the Biomedical Informatics Ontology System (BIOS) into 22,104,559 clusters with O(N) queries to ChatGPT. Case studies highlight the model's efficacy in handling challenging samples, aided by information from explanations. Conclusion: By aligning terms to their explanations, CoRTEx demonstrates superior accuracy over benchmark models and robustness beyond its training set, and it is suitable for clustering terms for large-scale biomedical ontologies. ",
    "url": "https://arxiv.org/abs/2312.08036",
    "authors": [
      "Huaiyuan Ying",
      "Zhengyun Zhao",
      "Yang Zhao",
      "Sihang Zeng",
      "Sheng Yu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2312.08042",
    "title": "Computing approximate symmetries of complex networks",
    "abstract": "The symmetry of complex networks is a global property that has recently gained attention since MacArthur et al. 2008 showed that many real-world networks contain a considerable number of symmetries. These authors work with a very strict symmetry definition based on the network's automorphism. The potential problem with this approach is that even a slight change in the graph's structure can remove or create some symmetry. Recently, Liu 2020 proposed to use an approximate automorphism instead of strict automorphism. This method can discover symmetries in the network while accepting some minor imperfections in their structure. The proposed numerical method, however, exhibits some performance problems and has some limitations while it assumes the absence of fixed points. In this work, we exploit alternative approaches recently developed for treating the Graph Matching Problem and propose a method, which we will refer to as Quadratic Symmetry Approximator (QSA), to address the aforementioned shortcomings. To test our method, we propose a set of random graph models suitable for assessing a wide family of approximate symmetry algorithms. The performance of our method is also demonstrated on brain networks. ",
    "url": "https://arxiv.org/abs/2312.08042",
    "authors": [
      "Anna Pidnebesna",
      "David Hartman",
      "Aneta Pokorná",
      "Matěj Straka",
      "Jaroslav Hlinka"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Discrete Mathematics (cs.DM)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2312.08052",
    "title": "Explainable Trajectory Representation through Dictionary Learning",
    "abstract": "Trajectory representation learning on a network enhances our understanding of vehicular traffic patterns and benefits numerous downstream applications. Existing approaches using classic machine learning or deep learning embed trajectories as dense vectors, which lack interpretability and are inefficient to store and analyze in downstream tasks. In this paper, an explainable trajectory representation learning framework through dictionary learning is proposed. Given a collection of trajectories on a network, it extracts a compact dictionary of commonly used subpaths called \"pathlets\", which optimally reconstruct each trajectory by simple concatenations. The resulting representation is naturally sparse and encodes strong spatial semantics. Theoretical analysis of our proposed algorithm is conducted to provide a probabilistic bound on the estimation error of the optimal dictionary. A hierarchical dictionary learning scheme is also proposed to ensure the algorithm's scalability on large networks, leading to a multi-scale trajectory representation. Our framework is evaluated on two large-scale real-world taxi datasets. Compared to previous work, the dictionary learned by our method is more compact and has better reconstruction rate for new trajectories. We also demonstrate the promising performance of this method in downstream tasks including trip time prediction task and data compression. ",
    "url": "https://arxiv.org/abs/2312.08052",
    "authors": [
      "Yuanbo Tang",
      "Zhiyuan Peng",
      "Yang Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2312.08069",
    "title": "Improving Spatial Resolution of First-order Ambisonics Using Sparse MDCT  Representation",
    "abstract": "The paper presents a method for improving spatial resolution of first-order ambisonic audio. The method is based on time/frequency decomposition of the audio with subsequent extraction of a directed plane wave from each frequency component. The method develops the basic ideas of high angular resolution planewave expansion (HARPEX) and directional audio coding (DirAC) taking advantage of real-valued sparse decomposition. Real-valued frequency components as opposed to complex-valued introduce simpler and more stable direction of arrival estimates, while sparse decomposition introduces an accurate and unified approach to describing sounds of different nature from transient to tonal sounds. ",
    "url": "https://arxiv.org/abs/2312.08069",
    "authors": [
      "Denis Likhachov",
      "Nick Petrovsky",
      "Elias Azarov"
    ],
    "subjectives": [
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2312.08098",
    "title": "Adversarial Socialbots Modeling Based on Structural Information  Principles",
    "abstract": "The importance of effective detection is underscored by the fact that socialbots imitate human behavior to propagate misinformation, leading to an ongoing competition between socialbots and detectors. Despite the rapid advancement of reactive detectors, the exploration of adversarial socialbot modeling remains incomplete, significantly hindering the development of proactive detectors. To address this issue, we propose a mathematical Structural Information principles-based Adversarial Socialbots Modeling framework, namely SIASM, to enable more accurate and effective modeling of adversarial behaviors. First, a heterogeneous graph is presented to integrate various users and rich activities in the original social network and measure its dynamic uncertainty as structural entropy. By minimizing the high-dimensional structural entropy, a hierarchical community structure of the social network is generated and referred to as the optimal encoding tree. Secondly, a novel method is designed to quantify influence by utilizing the assigned structural entropy, which helps reduce the computational cost of SIASM by filtering out uninfluential users. Besides, a new conditional structural entropy is defined between the socialbot and other users to guide the follower selection for network influence maximization. Extensive and comparative experiments on both homogeneous and heterogeneous social networks demonstrate that, compared with state-of-the-art baselines, the proposed SIASM framework yields substantial performance improvements in terms of network influence (up to 16.32%) and sustainable stealthiness (up to 16.29%) when evaluated against a robust detector with 90% accuracy. ",
    "url": "https://arxiv.org/abs/2312.08098",
    "authors": [
      "Xianghua Zeng",
      "Hao Peng",
      "Angsheng Li"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.08107",
    "title": "Causal Optimal Transport of Abstractions",
    "abstract": "Causal abstraction (CA) theory establishes formal criteria for relating multiple structural causal models (SCMs) at different levels of granularity by defining maps between them. These maps have significant relevance for real-world challenges such as synthesizing causal evidence from multiple experimental environments, learning causally consistent representations at different resolutions, and linking interventions across multiple SCMs. In this work, we propose COTA, the first method to learn abstraction maps from observational and interventional data without assuming complete knowledge of the underlying SCMs. In particular, we introduce a multi-marginal Optimal Transport (OT) formulation that enforces do-calculus causal constraints, together with a cost function that relies on interventional information. We extensively evaluate COTA on synthetic and real world problems, and showcase its advantages over non-causal, independent and aggregated COTA formulations. Finally, we demonstrate the efficiency of our method as a data augmentation tool by comparing it against the state-of-the-art CA learning framework, which assumes fully specified SCMs, on a real-world downstream task. ",
    "url": "https://arxiv.org/abs/2312.08107",
    "authors": [
      "Yorgos Felekis",
      "Fabio Massimo Zennaro",
      "Nicola Branchini",
      "Theodoros Damoulas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2312.08118",
    "title": "Neural Radiance Fields for Transparent Object Using Visual Hull",
    "abstract": "Unlike opaque object, novel view synthesis of transparent object is a challenging task, because transparent object refracts light of background causing visual distortions on the transparent object surface along the viewpoint change. Recently introduced Neural Radiance Fields (NeRF) is a view synthesis method. Thanks to its remarkable performance improvement, lots of following applications based on NeRF in various topics have been developed. However, if an object with a different refractive index is included in a scene such as transparent object, NeRF shows limited performance because refracted light ray at the surface of the transparent object is not appropriately considered. To resolve the problem, we propose a NeRF-based method consisting of the following three steps: First, we reconstruct a three-dimensional shape of a transparent object using visual hull. Second, we simulate the refraction of the rays inside of the transparent object according to Snell's law. Last, we sample points through refracted rays and put them into NeRF. Experimental evaluation results demonstrate that our method addresses the limitation of conventional NeRF with transparent objects. ",
    "url": "https://arxiv.org/abs/2312.08118",
    "authors": [
      "Heechan Yoon",
      "Seungkyu Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.08127",
    "title": "Random relay selection based heuristic optimization model for the  scheduling and effective resource allocation in the cognitive radio network",
    "abstract": "Cognitive Radio Network (CRN) provides effective capabilities for resource allocation with the valuable spectrum resources in the network. It provides the effective allocation of resources to the unlicensed users or Secondary Users (SUs) to access the spectrum those are unused by the licensed users or Primary Users (Pus). This paper develops an Optimal Relay Selection scheme with the spectrum-sharing scheme in CRN. The proposed Cross-Layer Spider Swarm Shifting is implemented in CRN for the optimal relay selection with Spider Swarm Optimization (SSO). The shortest path is estimated with the data shifting model for the data transmission path in the CRN. This study examines a cognitive relay network (CRN) with interference restrictions imposed by a mobile end user (MU). Half-duplex communication is used in the proposed system model between a single primary user (PU) and a single secondary user (SU). Between the SU source and SU destination, an amplify and forward (AF) relaying mechanism is also used. While other nodes (SU Source, SU relays, and PU) are supposed to be immobile in this scenario, the mobile end user (SU destination) is assumed to travel at high vehicle speeds. The suggested method achieves variety by placing a selection combiner at the SU destination and dynamically selecting the optimal relay for transmission based on the greatest signal-to-noise (SNR) ratio. The performance of the proposed Cross-Layer Spider Swarm Shifting model is compared with the Spectrum Sharing Optimization with QoS Guarantee (SSO-QG). The comparative analysis expressed that the proposed Cross-Layer Spider Swarm Shifting model delay is reduced by 15% compared with SSO-QG. Additionally, the proposed Cross-Layer Spider Swarm Shifting exhibits the improved network performance of ~25% higher throughput compared with SSO-QG. ",
    "url": "https://arxiv.org/abs/2312.08127",
    "authors": [
      "Aravindkumaran S",
      "D. Saraswady"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2312.08134",
    "title": "MToP: A MATLAB Optimization Platform for Evolutionary Multitasking",
    "abstract": "Evolutionary multitasking (EMT) has been attracting much attention over the past years. It aims to handle multiple optimization tasks simultaneously within limited computing resources assisted by inter-task knowledge transfer techniques. Numerous multitask evolutionary algorithms (MTEAs) for solving multitask optimization (MTO) problems have been proposed in the EMT field, but there lacks a comprehensive software platform to help researchers evaluate MTEA performance on benchmark MTO problems as well as explore real-world applications. To address this issue, we introduce the first open-source optimization platform, named MTO-Platform (MToP), for EMT. It incorporates more than 30 MTEAs, more than 150 MTO problem cases with real-world applications, and more than 10 performance metrics. Moreover, for comparing MTEAs with traditional evolutionary algorithms, we modified more than 30 popular single-task evolutionary algorithms to be able to solve MTO problems in MToP. MToP is a user-friendly tool with a graphical user interface that makes it easy to analyze results, export data, and plot schematics. More importantly, MToP is extensible, allowing users to develop new algorithms and define new problems. The source code of MToP is available at https://github.com/intLyc/MTO-Platform. ",
    "url": "https://arxiv.org/abs/2312.08134",
    "authors": [
      "Yanchi Li",
      "Wenyin Gong",
      "Fei Ming",
      "Tingyu Zhang",
      "Shuijia Li",
      "Qiong Gu"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2312.08136",
    "title": "ProNeRF: Learning Efficient Projection-Aware Ray Sampling for  Fine-Grained Implicit Neural Radiance Fields",
    "abstract": "Recent advances in neural rendering have shown that, albeit slow, implicit compact models can learn a scene's geometries and view-dependent appearances from multiple views. To maintain such a small memory footprint but achieve faster inference times, recent works have adopted `sampler' networks that adaptively sample a small subset of points along each ray in the implicit neural radiance fields. Although these methods achieve up to a 10$\\times$ reduction in rendering time, they still suffer from considerable quality degradation compared to the vanilla NeRF. In contrast, we propose ProNeRF, which provides an optimal trade-off between memory footprint (similar to NeRF), speed (faster than HyperReel), and quality (better than K-Planes). ProNeRF is equipped with a novel projection-aware sampling (PAS) network together with a new training strategy for ray exploration and exploitation, allowing for efficient fine-grained particle sampling. Our ProNeRF yields state-of-the-art metrics, being 15-23x faster with 0.65dB higher PSNR than NeRF and yielding 0.95dB higher PSNR than the best published sampler-based method, HyperReel. Our exploration and exploitation training strategy allows ProNeRF to learn the full scenes' color and density distributions while also learning efficient ray sampling focused on the highest-density regions. We provide extensive experimental results that support the effectiveness of our method on the widely adopted forward-facing and 360 datasets, LLFF and Blender, respectively. ",
    "url": "https://arxiv.org/abs/2312.08136",
    "authors": [
      "Juan Luis Gonzalez Bello",
      "Minh-Quan Viet Bui",
      "Munchurl Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2312.08140",
    "title": "GVE-LPA: Fast Label Propagation Algorithm (LPA) for Community Detection  in Shared Memory Setting",
    "abstract": "Community detection is the problem of identifying natural divisions in networks. Efficient parallel algorithms for this purpose are crucial in various applications, particularly as datasets grow to substantial scales. This technical report presents an optimized parallel implementation of the Label Propagation Algorithm (LPA), a high speed community detection method, for shared memory multicore systems. On a server equipped with dual 16-core Intel Xeon Gold 6226R processors, our LPA, which we term as GVE-LPA, outperforms FLPA, igraph LPA, and NetworKit LPA by 97,000x, 118, 000x, and 40x respectively - achieving a processing rate of 1.4B edges/s on a 3.8B edge graph. In addition, GVE-LPA scales at a rate of 1.7x every doubling of threads. ",
    "url": "https://arxiv.org/abs/2312.08140",
    "authors": [
      "Subhajit Sahu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2312.08143",
    "title": "Efficient Representation of the Activation Space in Deep Neural Networks",
    "abstract": "The representations of the activation space of deep neural networks (DNNs) are widely utilized for tasks like natural language processing, anomaly detection and speech recognition. Due to the diverse nature of these tasks and the large size of DNNs, an efficient and task-independent representation of activations becomes crucial. Empirical p-values have been used to quantify the relative strength of an observed node activation compared to activations created by already-known inputs. Nonetheless, keeping raw data for these calculations increases memory resource consumption and raises privacy concerns. To this end, we propose a model-agnostic framework for creating representations of activations in DNNs using node-specific histograms to compute p-values of observed activations without retaining already-known inputs. Our proposed approach demonstrates promising potential when validated with multiple network architectures across various downstream tasks and compared with the kernel density estimates and brute-force empirical baselines. In addition, the framework reduces memory usage by 30% with up to 4 times faster p-value computing time while maintaining state of-the-art detection power in downstream tasks such as the detection of adversarial attacks and synthesized content. Moreover, as we do not persist raw data at inference time, we could potentially reduce susceptibility to attacks and privacy issues. ",
    "url": "https://arxiv.org/abs/2312.08143",
    "authors": [
      "Tanya Akumu",
      "Celia Cintas",
      "Girmaw Abebe Tadesse",
      "Adebayo Oshingbesan",
      "Skyler Speakman",
      "Edward McFowland III"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.08162",
    "title": "Smart Energy Management with Optimized Prosumerism for Achieving Dynamic  Net-Zero Balance in Electrified Road Transport Networks",
    "abstract": "The increasing number of Electric Vehicles (EVs) have led to rising energy demands which aggregates the burden on grid supply. A few solutions have been proposed to reduce grid load, for example, using storage systems for storing surplus energy from EVs or time-scheduling supply. These solutions are costly and limited to specific regions and times. This paper proposes a smart energy management solution for a massively electrified road transport network. It comprises of energy supplies from grid, charging stations, renewable sources and EVs connected by 5G-enabled aggregators. We propose EVs as prosumers, which are energy consumers but also supply back their surplus energy via Vehicle-to-Grid (V2G) technology. We use machine learning to forecast hourly energy output from renewable sources, surplus supply from EVs and their demands. A grid cost minimization using Mixed Integer Linear Programming solution is proposed to dynamically alter supply according to demand and energy provision from EVs. The upper bounds of surplus supply and demand of EVs are theoretically derived. An incentive distribution mechanism is presented to reward EVs offering their surplus supply and to discourage them to become selfish which is analyzed using Prisoner's dilemma game. The paper also presents an optimum number of charging stations on a road. Simulation results show that the proposed solution can effectively meet the demand requirements even if the supply from grid is limited, and can averagely reduce 38.21% of grid load. It results in 5.3% of average cost reduction compared with optimization without prosumers. The proposed penalty charge for CO2 emissions results in over 50% cost reduction by using renewable resources in the proposed solution as compared to fossil fuels. The communication and computation complexity of the proposed solution is reduced by 5G-enabled aggregator. ",
    "url": "https://arxiv.org/abs/2312.08162",
    "authors": [
      "Ferheen Ayaz",
      "Maziar Nekovee"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2312.08176",
    "title": "ASC: Adaptive Scale Feature Map Compression for Deep Neural Network",
    "abstract": "Deep-learning accelerators are increasingly in demand; however, their performance is constrained by the size of the feature map, leading to high bandwidth requirements and large buffer sizes. We propose an adaptive scale feature map compression technique leveraging the unique properties of the feature map. This technique adopts independent channel indexing given the weak channel correlation and utilizes a cubical-like block shape to benefit from strong local correlations. The method further optimizes compression using a switchable endpoint mode and adaptive scale interpolation to handle unimodal data distributions, both with and without outliers. This results in 4$\\times$ and up to 7.69$\\times$ compression rates for 16-bit data in constant and variable bitrates, respectively. Our hardware design minimizes area cost by adjusting interpolation scales, which facilitates hardware sharing among interpolation points. Additionally, we introduce a threshold concept for straightforward interpolation, preventing the need for intricate hardware. The TSMC 28nm implementation showcases an equivalent gate count of 6135 for the 8-bit version. Furthermore, the hardware architecture scales effectively, with only a sublinear increase in area cost. Achieving a 32$\\times$ throughput increase meets the theoretical bandwidth of DDR5-6400 at just 7.65$\\times$ the hardware cost. ",
    "url": "https://arxiv.org/abs/2312.08176",
    "authors": [
      "Yuan Yao",
      "Tian-Sheuan Chang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Hardware Architecture (cs.AR)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2312.08177",
    "title": "Advanced Image Segmentation Techniques for Neural Activity Detection via  C-fos Immediate Early Gene Expression",
    "abstract": "This paper investigates the application of advanced image segmentation techniques to analyze C-fos immediate early gene expression, a crucial marker for neural activity. Due to the complexity and high variability of neural circuits, accurate segmentation of C-fos images is paramount for the development of new insights into neural function. Amidst this backdrop, this research aims to improve accuracy and minimize manual intervention in C-fos image segmentation by leveraging the capabilities of CNNs and the Unet model. We describe the development of a novel workflow for the segmentation process involving Convolutional Neural Networks (CNNs) and the Unet model, demonstrating their efficiency in various image segmentation tasks. Our workflow incorporates pre-processing steps such as cropping, image feature extraction, and clustering for the training dataset selection. We used an AutoEncoder model to extract features and implement constrained clustering to identify similarities and differences in image types. Additionally, we utilized manual and automatic labeling approaches to enhance the performance of our model. We demonstrated the effectiveness of our method in distinguishing areas with significant C-fos expression from normal tissue areas. Lastly, we implemented a modified Unet network for the detection of C-fos expressions. This research contributes to the development of more efficient and automated image segmentation methods, advancing the understanding of neural function in neuroscience research. ",
    "url": "https://arxiv.org/abs/2312.08177",
    "authors": [
      "Peilin Cai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.08187",
    "title": "Completing Priceable Committees: Utilitarian and Representation  Guarantees for Proportional Multiwinner Voting",
    "abstract": "When selecting committees based on preferences of voters, a variety of different criteria can be considered. Two natural objectives are maximizing the utilitarian welfare (the sum of voters' utilities) and coverage (the number of represented voters) of the selected committee. Previous work has studied the impact on utilitarian welfare and coverage when requiring the committee to satisfy minimal requirements such as justified representation or weak proportionality. In this paper, we consider the impact of imposing much more demanding proportionality axioms. We identify a class of voting rules that achieve strong guarantees on utilitarian welfare and coverage when combined with appropriate completions. This class is defined via a weakening of priceability and contains prominent rules such as the Method of Equal Shares. We show that committees selected by these rules (i) can be completed to achieve optimal coverage and (ii) can be completed to achieve an asymptotically optimal approximation to the utilitarian welfare if they additionally satisfy EJR+. Answering an open question of Elkind et al. (2022), we use the Greedy Justified Candidate Rule to obtain the best possible utilitarian guarantee subject to proportionality. We also consider completion methods suggested in the participatory budgeting literature and other objectives besides welfare and coverage. ",
    "url": "https://arxiv.org/abs/2312.08187",
    "authors": [
      "Markus Brill",
      "Jannik Peters"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2312.08192",
    "title": "PAD: Self-Supervised Pre-Training with Patchwise-Scale Adapter for  Infrared Images",
    "abstract": "Self-supervised learning (SSL) for RGB images has achieved significant success, yet there is still limited research on SSL for infrared images, primarily due to three prominent challenges: 1) the lack of a suitable large-scale infrared pre-training dataset, 2) the distinctiveness of non-iconic infrared images rendering common pre-training tasks like masked image modeling (MIM) less effective, and 3) the scarcity of fine-grained textures making it particularly challenging to learn general image features. To address these issues, we construct a Multi-Scene Infrared Pre-training (MSIP) dataset comprising 178,756 images, and introduce object-sensitive random RoI cropping, an image preprocessing method, to tackle the challenge posed by non-iconic images. To alleviate the impact of weak textures on feature learning, we propose a pre-training paradigm called Pre-training with ADapter (PAD), which uses adapters to learn domain-specific features while freezing parameters pre-trained on ImageNet to retain the general feature extraction capability. This new paradigm is applicable to any transformer-based SSL method. Furthermore, to achieve more flexible coordination between pre-trained and newly-learned features in different layers and patches, a patchwise-scale adapter with dynamically learnable scale factors is introduced. Extensive experiments on three downstream tasks show that PAD, with only 1.23M pre-trainable parameters, outperforms other baseline paradigms including continual full pre-training on MSIP. Our code and dataset are available at https://github.com/casiatao/PAD. ",
    "url": "https://arxiv.org/abs/2312.08192",
    "authors": [
      "Tao Zhang",
      "Kun Ding",
      "Jinyong Wen",
      "Yu Xiong",
      "Zeyu Zhang",
      "Shiming Xiang",
      "Chunhong Pan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.08207",
    "title": "Black-box Membership Inference Attacks against Fine-tuned Diffusion  Models",
    "abstract": "With the rapid advancement of diffusion-based image-generative models, the quality of generated images has become increasingly photorealistic. Moreover, with the release of high-quality pre-trained image-generative models, a growing number of users are downloading these pre-trained models to fine-tune them with downstream datasets for various image-generation tasks. However, employing such powerful pre-trained models in downstream tasks presents significant privacy leakage risks. In this paper, we propose the first reconstruction-based membership inference attack framework, tailored for recent diffusion models, and in the more stringent black-box access setting. Considering four distinct attack scenarios and three types of attacks, this framework is capable of targeting any popular conditional generator model, achieving high precision, evidenced by an impressive AUC of $0.95$. ",
    "url": "https://arxiv.org/abs/2312.08207",
    "authors": [
      "Yan Pang",
      "Tianhao Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.08213",
    "title": "Accelerated Event-Based Feature Detection and Compression for  Surveillance Video Systems",
    "abstract": "The strong temporal consistency of surveillance video enables compelling compression performance with traditional methods, but downstream vision applications operate on decoded image frames with a high data rate. Since it is not straightforward for applications to extract information on temporal redundancy from the compressed video representations, we propose a novel system which conveys temporal redundancy within a sparse decompressed representation. We leverage a video representation framework called ADDER to transcode framed videos to sparse, asynchronous intensity samples. We introduce mechanisms for content adaptation, lossy compression, and asynchronous forms of classical vision algorithms. We evaluate our system on the VIRAT surveillance video dataset, and we show a median 43.7% speed improvement in FAST feature detection compared to OpenCV. We run the same algorithm as OpenCV, but only process pixels that receive new asynchronous events, rather than process every pixel in an image frame. Our work paves the way for upcoming neuromorphic sensors and is amenable to future applications with spiking neural networks. ",
    "url": "https://arxiv.org/abs/2312.08213",
    "authors": [
      "Andrew C. Freeman",
      "Ketan Mayer-Patel",
      "Montek Singh"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.08223",
    "title": "Patch-wise Graph Contrastive Learning for Image Translation",
    "abstract": "Recently, patch-wise contrastive learning is drawing attention for the image translation by exploring the semantic correspondence between the input and output images. To further explore the patch-wise topology for high-level semantic understanding, here we exploit the graph neural network to capture the topology-aware features. Specifically, we construct the graph based on the patch-wise similarity from a pretrained encoder, whose adjacency matrix is shared to enhance the consistency of patch-wise relation between the input and the output. Then, we obtain the node feature from the graph neural network, and enhance the correspondence between the nodes by increasing mutual information using the contrastive loss. In order to capture the hierarchical semantic structure, we further propose the graph pooling. Experimental results demonstrate the state-of-art results for the image translation thanks to the semantic encoding by the constructed graphs. ",
    "url": "https://arxiv.org/abs/2312.08223",
    "authors": [
      "Chanyong Jung",
      "Gihyun Kwon",
      "Jong Chul Ye"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.08230",
    "title": "Partial Symmetry Detection for 3D Geometry using Contrastive Learning  with Geodesic Point Cloud Patches",
    "abstract": "Symmetry detection, especially partial and extrinsic symmetry, is essential for various downstream tasks, like 3D geometry completion, segmentation, compression and structure-aware shape encoding or generation. In order to detect partial extrinsic symmetries, we propose to learn rotation, reflection, translation and scale invariant local shape features for geodesic point cloud patches via contrastive learning, which are robust across multiple classes and generalize over different datasets. We show that our approach is able to extract multiple valid solutions for this ambiguous problem. Furthermore, we introduce a novel benchmark test for partial extrinsic symmetry detection to evaluate our method. Lastly, we incorporate the detected symmetries together with a region growing algorithm to demonstrate a downstream task with the goal of computing symmetry-aware partitions of 3D shapes. To our knowledge, we are the first to propose a self-supervised data-driven method for partial extrinsic symmetry detection. ",
    "url": "https://arxiv.org/abs/2312.08230",
    "authors": [
      "Gregor Kobsik",
      "Isaak Lim",
      "Leif Kobbelt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.08240",
    "title": "CenterGrasp: Object-Aware Implicit Representation Learning for  Simultaneous Shape Reconstruction and 6-DoF Grasp Estimation",
    "abstract": "Reliable object grasping is a crucial capability for autonomous robots. However, many existing grasping approaches focus on general clutter removal without explicitly modeling objects and thus only relying on the visible local geometry. We introduce CenterGrasp, a novel framework that combines object awareness and holistic grasping. CenterGrasp learns a general object prior by encoding shapes and valid grasps in a continuous latent space. It consists of an RGB-D image encoder that leverages recent advances to detect objects and infer their pose and latent code, and a decoder to predict shape and grasps for each object in the scene. We perform extensive experiments on simulated as well as real-world cluttered scenes and demonstrate strong scene reconstruction and 6-DoF grasp-pose estimation performance. Compared to the state of the art, CenterGrasp achieves an improvement of 38.5 mm in shape reconstruction and 33 percentage points on average in grasp success. We make the code and trained models publicly available at this http URL ",
    "url": "https://arxiv.org/abs/2312.08240",
    "authors": [
      "Eugenio Chisari",
      "Nick Heppert",
      "Tim Welschehold",
      "Wolfram Burgard",
      "Abhinav Valada"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.08299",
    "title": "Conceptualizing Suicidal Behavior: Utilizing Explanations of Predicted  Outcomes to Analyze Longitudinal Social Media Data",
    "abstract": "The COVID-19 pandemic has escalated mental health crises worldwide, with social isolation and economic instability contributing to a rise in suicidal behavior. Suicide can result from social factors such as shame, abuse, abandonment, and mental health conditions like depression, Post-Traumatic Stress Disorder (PTSD), Attention-Deficit/Hyperactivity Disorder (ADHD), anxiety disorders, and bipolar disorders. As these conditions develop, signs of suicidal ideation may manifest in social media interactions. Analyzing social media data using artificial intelligence (AI) techniques can help identify patterns of suicidal behavior, providing invaluable insights for suicide prevention agencies, professionals, and broader community awareness initiatives. Machine learning algorithms for this purpose require large volumes of accurately labeled data. Previous research has not fully explored the potential of incorporating explanations in analyzing and labeling longitudinal social media data. In this study, we employed a model explanation method, Layer Integrated Gradients, on top of a fine-tuned state-of-the-art language model, to assign each token from Reddit users' posts an attribution score for predicting suicidal ideation. By extracting and analyzing attributions of tokens from the data, we propose a methodology for preliminary screening of social media posts for suicidal ideation without using large language models during inference. ",
    "url": "https://arxiv.org/abs/2312.08299",
    "authors": [
      "Van Minh Nguyen",
      "Nasheen Nur",
      "William Stern",
      "Thomas Mercer",
      "Chiradeep Sen",
      "Siddhartha Bhattacharyya",
      "Victor Tumbiolo",
      "Seng Jhing Goh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2312.08303",
    "title": "Efficient Toxic Content Detection by Bootstrapping and Distilling Large  Language Models",
    "abstract": "Toxic content detection is crucial for online services to remove inappropriate content that violates community standards. To automate the detection process, prior works have proposed varieties of machine learning (ML) approaches to train Language Models (LMs) for toxic content detection. However, both their accuracy and transferability across datasets are limited. Recently, Large Language Models (LLMs) have shown promise in toxic content detection due to their superior zero-shot and few-shot in-context learning ability as well as broad transferability on ML tasks. However, efficiently designing prompts for LLMs remains challenging. Moreover, the high run-time cost of LLMs may hinder their deployments in production. To address these challenges, in this work, we propose BD-LLM, a novel and efficient approach to Bootstrapping and Distilling LLMs for toxic content detection. Specifically, we design a novel prompting method named Decision-Tree-of-Thought (DToT) to bootstrap LLMs' detection performance and extract high-quality rationales. DToT can automatically select more fine-grained context to re-prompt LLMs when their responses lack confidence. Additionally, we use the rationales extracted via DToT to fine-tune student LMs. Our experimental results on various datasets demonstrate that DToT can improve the accuracy of LLMs by up to 4.6%. Furthermore, student LMs fine-tuned with rationales extracted via DToT outperform baselines on all datasets with up to 16.9\\% accuracy improvement, while being more than 60x smaller than conventional LLMs. Finally, we observe that student LMs fine-tuned with rationales exhibit better cross-dataset transferability. ",
    "url": "https://arxiv.org/abs/2312.08303",
    "authors": [
      "Jiang Zhang",
      "Qiong Wu",
      "Yiming Xu",
      "Cheng Cao",
      "Zheng Du",
      "Konstantinos Psounis"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.08305",
    "title": "ConChain: A Scheme for Contention-free and Attack Resilient BlockChain",
    "abstract": "Although blockchains have become widely popular for their use in cryptocurrencies, they are now becoming pervasive as more traditional applications adopt blockchain to ensure data security. Despite being a secured network, blockchains have some tradeoffs such as high latency, low throughput, and transaction failures. One of the core problems behind these is improper management of \"conflicting transactions\", which is also known as \"contention\". When there is a large pool of pending transactions in a blockchain and some of them are conflicting, a situation of contention occurs, and as a result, the latency of the network increases, and a substantial amount of resources are wasted which results in low throughput and transaction failures. In this paper, we proposed ConChain, a novel blockchain scheme that combines transaction parallelism and an intelligent dependency manager to minimize conflicting transactions in blockchain networks as well as improve performance. ConChain is also capable of ensuring proper defense against major attacks due to contention. ",
    "url": "https://arxiv.org/abs/2312.08305",
    "authors": [
      "Faisal Haque Bappy",
      "Tariqul Islam",
      "Tarannum Shaila Zaman",
      "Md Sajidul Islam Sajid",
      "Mir Mehedi Ahsan Pritom"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2312.08323",
    "title": "PnPNet: Pull-and-Push Networks for Volumetric Segmentation with Boundary  Confusion",
    "abstract": "Precise boundary segmentation of volumetric images is a critical task for image-guided diagnosis and computer-assisted intervention, especially for boundary confusion in clinical practice. However, U-shape networks cannot effectively resolve this challenge due to the lack of boundary shape constraints. Besides, existing methods of refining boundaries overemphasize the slender structure, which results in the overfitting phenomenon due to networks' limited abilities to model tiny objects. In this paper, we reconceptualize the mechanism of boundary generation by encompassing the interaction dynamics with adjacent regions. Moreover, we propose a unified network termed PnPNet to model shape characteristics of the confused boundary region. Core ingredients of PnPNet contain the pushing and pulling branches. Specifically, based on diffusion theory, we devise the semantic difference module (SDM) from the pushing branch to squeeze the boundary region. Explicit and implicit differential information inside SDM significantly boost representation abilities for inter-class boundaries. Additionally, motivated by the K-means algorithm, the class clustering module (CCM) from the pulling branch is introduced to stretch the intersected boundary region. Thus, pushing and pulling branches will shrink and enlarge the boundary uncertainty respectively. They furnish two adversarial forces to promote models to output a more precise delineation of boundaries. We carry out experiments on three challenging public datasets and one in-house dataset, containing three types of boundary confusion in model predictions. Experimental results demonstrate the superiority of PnPNet over other segmentation networks, especially on evaluation metrics of HD and ASSD. Besides, pushing and pulling branches can serve as plug-and-play modules to enhance classic U-shape baseline models. Codes are available. ",
    "url": "https://arxiv.org/abs/2312.08323",
    "authors": [
      "Xin You",
      "Ming Ding",
      "Minghui Zhang",
      "Hanxiao Zhang",
      "Yi Yu",
      "Jie Yang",
      "Yun Gu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.08338",
    "title": "Global Latent Neural Rendering",
    "abstract": "A recent trend among generalizable novel view synthesis methods is to learn a rendering operator acting over single camera rays. This approach is promising because it removes the need for explicit volumetric rendering, but it effectively treats target images as collections of independent pixels. Here, we propose to learn a global rendering operator acting over all camera rays jointly. We show that the right representation to enable such rendering is the 5-dimensional plane sweep volume, consisting of the projection of the input images on a set of planes facing the target camera. Based on this understanding, we introduce our Convolutional Global Latent Renderer (ConvGLR), an efficient convolutional architecture that performs the rendering operation globally in a low-resolution latent space. Experiments on various datasets under sparse and generalizable setups show that our approach consistently outperforms existing methods by significant margins. ",
    "url": "https://arxiv.org/abs/2312.08338",
    "authors": [
      "Thomas Tanay",
      "Matteo Maggioni"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.08356",
    "title": "CUTTANA: Scalable Graph Partitioning for Faster Distributed Graph  Databases and Analytics",
    "abstract": "Graph partitioning plays a pivotal role in various distributed graph processing applications, including graph analytics, graph neural network training, and distributed graph databases. Graphs that require distributed settings are often too large to fit in the main memory of a single machine. This challenge renders traditional in-memory graph partitioners infeasible, leading to the emergence of streaming solutions. Streaming partitioners produce lower-quality partitions because they work from partial information and must make premature decisions before they have a complete view of a vertex's neighborhood. We introduce CUTTANA, a streaming graph partitioner that partitions massive graphs (Web/Twitter scale) with superior quality compared to existing streaming solutions. CUTTANA uses a novel buffering technique that prevents the premature assignment of vertices to partitions and a scalable coarsening and refinement technique that enables a complete graph view, improving the intermediate assignment made by a streaming partitioner. We implemented a parallel version for CUTTANA that offers nearly the same partitioning latency as existing streaming partitioners. Our experimental analysis shows that CUTTANA consistently yields better partitioning quality than existing state-of-the-art streaming vertex partitioners in terms of both edge-cut and communication volume metrics. We also evaluate the workload latencies that result from using CUTTANA and other partitioners in distributed graph analytics and databases. CUTTANA outperforms the other methods in most scenarios (algorithms, datasets). In analytics applications, CUTTANA improves runtime performance by up to 59% compared to various streaming partitioners (HDRF, Fennel, Ginger, HeiStream). In graph database tasks, CUTTANA results in higher query throughput by up to 23%, without hurting tail latency. ",
    "url": "https://arxiv.org/abs/2312.08356",
    "authors": [
      "Milad Rezaei Hajidehi",
      "Sraavan Sridhar",
      "Margo Seltzer"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2312.08371",
    "title": "PTT: Point-Trajectory Transformer for Efficient Temporal 3D Object  Detection",
    "abstract": "Recent temporal LiDAR-based 3D object detectors achieve promising performance based on the two-stage proposal-based approach. They generate 3D box candidates from the first-stage dense detector, followed by different temporal aggregation methods. However, these approaches require per-frame objects or whole point clouds, posing challenges related to memory bank utilization. Moreover, point clouds and trajectory features are combined solely based on concatenation, which may neglect effective interactions between them. In this paper, we propose a point-trajectory transformer with long short-term memory for efficient temporal 3D object detection. To this end, we only utilize point clouds of current-frame objects and their historical trajectories as input to minimize the memory bank storage requirement. Furthermore, we introduce modules to encode trajectory features, focusing on long short-term and future-aware perspectives, and then effectively aggregate them with point cloud features. We conduct extensive experiments on the large-scale Waymo dataset to demonstrate that our approach performs well against state-of-the-art methods. Code and models will be made publicly available at https://github.com/kuanchihhuang/PTT. ",
    "url": "https://arxiv.org/abs/2312.08371",
    "authors": [
      "Kuan-Chih Huang",
      "Weijie Lyu",
      "Ming-Hsuan Yang",
      "Yi-Hsuan Tsai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.08372",
    "title": "SAM-guided Graph Cut for 3D Instance Segmentation",
    "abstract": "This paper addresses the challenge of 3D instance segmentation by simultaneously leveraging 3D geometric and multi-view image information. Many previous works have applied deep learning techniques to 3D point clouds for instance segmentation. However, these methods often failed to generalize to various types of scenes due to the scarcity and low-diversity of labeled 3D point cloud data. Some recent works have attempted to lift 2D instance segmentations to 3D within a bottom-up framework. The inconsistency in 2D instance segmentations among views can substantially degrade the performance of 3D segmentation. In this work, we introduce a novel 3D-to-2D query framework to effectively exploit 2D segmentation models for 3D instance segmentation. Specifically, we pre-segment the scene into several superpoints in 3D, formulating the task into a graph cut problem. The superpoint graph is constructed based on 2D segmentation models, where node features are obtained from multi-view image features and edge weights are computed based on multi-view segmentation results, enabling the better generalization ability. To process the graph, we train a graph neural network using pseudo 3D labels from 2D segmentation models. Experimental results on the ScanNet, ScanNet++ and KITTI-360 datasets demonstrate that our method achieves robust segmentation performance and can generalize across different types of scenes. Our project page is available at https://zju3dv.github.io/sam_graph. ",
    "url": "https://arxiv.org/abs/2312.08372",
    "authors": [
      "Haoyu Guo",
      "He Zhu",
      "Sida Peng",
      "Yuang Wang",
      "Yujun Shen",
      "Ruizhen Hu",
      "Xiaowei Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.07580",
    "title": "COVID-19 Detection Using Slices Processing Techniques and a Modified  Xception Classifier from Computed Tomography Images",
    "abstract": "This paper extends our previous method for COVID-19 diagnosis, proposing an enhanced solution for detecting COVID-19 from computed tomography (CT) images. To decrease model misclassifications, two key steps of image processing were employed. Firstly, the uppermost and lowermost slices were removed, preserving sixty percent of each patient's slices. Secondly, all slices underwent manual cropping to emphasize the lung areas. Subsequently, resized CT scans (224 by 224) were input into an Xception transfer learning model. Leveraging Xception's architecture and pre-trained weights, the modified model achieved binary classification. Promising results on the COV19-CT database showcased higher validation accuracy and macro F1 score at both the slice and patient levels compared to our previous solution and alternatives on the same dataset. ",
    "url": "https://arxiv.org/abs/2312.07580",
    "authors": [
      "Kenan Morani"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07609",
    "title": "IndoorGNN: A Graph Neural Network based approach for Indoor Localization  using WiFi RSSI",
    "abstract": "Indoor localization is the process of determining the location of a person or object inside a building. Potential usage of indoor localization includes navigation, personalization, safety and security, and asset tracking. Commonly used technologies for indoor localization include WiFi, Bluetooth, RFID, and Ultra-wideband. Among these, WiFi's Received Signal Strength Indicator (RSSI)-based localization is preferred because of widely available WiFi Access Points (APs). We have two main contributions. First, we develop our method, 'IndoorGNN' which involves using a Graph Neural Network (GNN) based algorithm in a supervised manner to classify a specific location into a particular region based on the RSSI values collected at that location. Most of the ML algorithms that perform this classification require a large number of labeled data points (RSSI vectors with location information). Collecting such data points is a labor-intensive and time-consuming task. To overcome this challenge, as our second contribution, we demonstrate the performance of IndoorGNN on the restricted dataset. It shows a comparable prediction accuracy to that of the complete dataset. We performed experiments on the UJIIndoorLoc and MNAV datasets, which are real-world standard indoor localization datasets. Our experiments show that IndoorGNN gives better location prediction accuracies when compared with state-of-the-art existing conventional as well as GNN-based methods for this same task. It continues to outperform these algorithms even with restricted datasets. It is noteworthy that its performance does not decrease a lot with a decrease in the number of available data points. Our method can be utilized for navigation and wayfinding in complex indoor environments, asset tracking and building management, enhancing mobile applications with location-based services, and improving safety and security during emergencies. ",
    "url": "https://arxiv.org/abs/2312.07609",
    "authors": [
      "Rahul Vishwakarma",
      "Rucha Bhalchandra Joshi",
      "Subhankar Mishra"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07729",
    "title": "MedYOLO: A Medical Image Object Detection Framework",
    "abstract": "Artificial intelligence-enhanced identification of organs, lesions, and other structures in medical imaging is typically done using convolutional neural networks (CNNs) designed to make voxel-accurate segmentations of the region of interest. However, the labels required to train these CNNs are time-consuming to generate and require attention from subject matter experts to ensure quality. For tasks where voxel-level precision is not required, object detection models offer a viable alternative that can reduce annotation effort. Despite this potential application, there are few options for general purpose object detection frameworks available for 3-D medical imaging. We report on MedYOLO, a 3-D object detection framework using the one-shot detection method of the YOLO family of models and designed for use with medical imaging. We tested this model on four different datasets: BRaTS, LIDC, an abdominal organ Computed Tomography (CT) dataset, and an ECG-gated heart CT dataset. We found our models achieve high performance on commonly present medium and large-sized structures such as the heart, liver, and pancreas even without hyperparameter tuning. However, the models struggle with very small or rarely present structures. ",
    "url": "https://arxiv.org/abs/2312.07729",
    "authors": [
      "Joseph Sobek",
      "Jose R. Medina Inojosa",
      "Betsy J. Medina Inojosa",
      "S. M. Rassoulinejad-Mousavi",
      "Gian Marco Conte",
      "Francisco Lopez-Jimenez",
      "Bradley J. Erickson"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07784",
    "title": "Robust MRI Reconstruction by Smoothed Unrolling (SMUG)",
    "abstract": "As the popularity of deep learning (DL) in the field of magnetic resonance imaging (MRI) continues to rise, recent research has indicated that DL-based MRI reconstruction models might be excessively sensitive to minor input disturbances, including worst-case additive perturbations. This sensitivity often leads to unstable, aliased images. This raises the question of how to devise DL techniques for MRI reconstruction that can be robust to train-test variations. To address this problem, we propose a novel image reconstruction framework, termed Smoothed Unrolling (SMUG), which advances a deep unrolling-based MRI reconstruction model using a randomized smoothing (RS)-based robust learning approach. RS, which improves the tolerance of a model against input noises, has been widely used in the design of adversarial defense approaches for image classification tasks. Yet, we find that the conventional design that applies RS to the entire DL-based MRI model is ineffective. In this paper, we show that SMUG and its variants address the above issue by customizing the RS process based on the unrolling architecture of a DL-based MRI reconstruction model. Compared to the vanilla RS approach, we show that SMUG improves the robustness of MRI reconstruction with respect to a diverse set of instability sources, including worst-case and random noise perturbations to input measurements, varying measurement sampling rates, and different numbers of unrolling steps. Furthermore, we theoretically analyze the robustness of our method in the presence of perturbations. ",
    "url": "https://arxiv.org/abs/2312.07784",
    "authors": [
      "Shijun Liang",
      "Van Hoang Minh Nguyen",
      "Jinghan Jia",
      "Ismail Alkhouri",
      "Sijia Liu",
      "Saiprasad Ravishankar"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2312.07821",
    "title": "Radio Signal Classification by Adversarially Robust Quantum Machine  Learning",
    "abstract": "Radio signal classification plays a pivotal role in identifying the modulation scheme used in received radio signals, which is essential for demodulation and proper interpretation of the transmitted information. Researchers have underscored the high susceptibility of ML algorithms for radio signal classification to adversarial attacks. Such vulnerability could result in severe consequences, including misinterpretation of critical messages, interception of classified information, or disruption of communication channels. Recent advancements in quantum computing have revolutionized theories and implementations of computation, bringing the unprecedented development of Quantum Machine Learning (QML). It is shown that quantum variational classifiers (QVCs) provide notably enhanced robustness against classical adversarial attacks in image classification. However, no research has yet explored whether QML can similarly mitigate adversarial threats in the context of radio signal classification. This work applies QVCs to radio signal classification and studies their robustness to various adversarial attacks. We also propose the novel application of the approximate amplitude encoding (AAE) technique to encode radio signal data efficiently. Our extensive simulation results present that attacks generated on QVCs transfer well to CNN models, indicating that these adversarial examples can fool neural networks that they are not explicitly designed to attack. However, the converse is not true. QVCs primarily resist the attacks generated on CNNs. Overall, with comprehensive simulations, our results shed new light on the growing field of QML by bridging knowledge gaps in QAML in radio signal classification and uncovering the advantages of applying QML methods in practical applications. ",
    "url": "https://arxiv.org/abs/2312.07821",
    "authors": [
      "Yanqiu Wu",
      "Eromanga Adermann",
      "Chandra Thapa",
      "Seyit Camtepe",
      "Hajime Suzuki",
      "Muhammad Usman"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07962",
    "title": "Treewidth is Polynomial in Maximum Degree on Graphs Excluding a Planar  Induced Minor",
    "abstract": "A graph $G$ contains a graph $H$ as an induced minor if $H$ can be obtained from $G$ by vertex deletions and edge contractions. We show that for every $k$-vertex planar graph $H$, every graph $G$ excluding $H$ as an induced minor has treewidth at most $\\Delta(G)^{2^{O(k)}}$ where $\\Delta(G)$ denotes the maximum degree of $G$. Previously, Korhonen [JCTB '23] has shown the upper bound of $k^{O(1)} 2^{\\Delta(G)^5}$ whose dependence in $\\Delta(G)$ is exponential. More precisely, we show that every graph $G$ excluding as induced minors a $k$-vertex planar graph and a $q$-vertex graph has treewidth at most $k^{O(1)} \\cdot \\Delta(G)^{f(q)}$ with $f(q) = 2^{O(q)}$. A direct consequence of our result is that for every hereditary graph class $\\mathcal C$, if graphs of $\\mathcal C$ have treewidth bounded by a function of their maximum degree, then they in fact have treewidth polynomial in their maximum degree. ",
    "url": "https://arxiv.org/abs/2312.07962",
    "authors": [
      "Édouard Bonnet",
      "Jędrzej Hodor",
      "Tuukka Korhonen",
      "Tomáš Masařík"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2312.07965",
    "title": "Pneumonia Detection on chest X-ray images Using Ensemble of Deep  Convolutional Neural Networks",
    "abstract": "Pneumonia is a life-threatening lung infection resulting from several different viral infections. Identifying and treating pneumonia on chest X-ray images can be difficult due to its similarity to other pulmonary diseases. Thus, the existing methods for predicting pneumonia cannot attain substantial levels of accuracy. Therefore, this paper presents a computer-aided classification of pneumonia, coined as Ensemble Learning (EL), to simplify the diagnosis process on chest X-ray images. Our proposal is based on Convolutional Neural Network (CNN) models, which are pre-trained CNN models that have been recently employed to enhance the performance of many medical tasks instead of training CNN models from scratch. We propose to use three well-known CNN pre-trained (DenseNet169, MobileNetV2 and Vision Transformer) using the ImageNet database. Then, these models are trained on the chest X-ray data set using fine-tuning. Finally, the results are obtained by combining the extracted features from these three models during the experimental phase. The proposed EL approach outperforms other existing state-of-the-art methods, and it obtains an accuracy of 93.91% and a F1-Score of 93.88% on the testing phase. ",
    "url": "https://arxiv.org/abs/2312.07965",
    "authors": [
      "Alhassan Mabrouk",
      "Rebeca P. Díaz Redondo",
      "Abdelghani Dahou",
      "Mohamed Abd Elaziz",
      "Mohammed Kayed"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.08034",
    "title": "Individualized Deepfake Detection Exploiting Traces Due to Double  Neural-Network Operations",
    "abstract": "In today's digital landscape, journalists urgently require tools to verify the authenticity of facial images and videos depicting specific public figures before incorporating them into news stories. Existing deepfake detectors are not optimized for this detection task when an image is associated with a specific and identifiable individual. This study focuses on the deepfake detection of facial images of individual public figures. We propose to condition the proposed detector on the identity of the identified individual given the advantages revealed by our theory-driven simulations. While most detectors in the literature rely on perceptible or imperceptible artifacts present in deepfake facial images, we demonstrate that the detection performance can be improved by exploiting the idempotency property of neural networks. In our approach, the training process involves double neural-network operations where we pass an authentic image through a deepfake simulating network twice. Experimental results show that the proposed method improves the area under the curve (AUC) from 0.92 to 0.94 and reduces its standard deviation by 17\\%. For evaluating the detection performance of individual public figures, a facial image dataset with individuals' names is required, a criterion not met by the current deepfake datasets. To address this, we curated a dataset comprising 32k images featuring 45 public figures, which we intend to release to the public after the paper is published. ",
    "url": "https://arxiv.org/abs/2312.08034",
    "authors": [
      "Mushfiqur Rahman",
      "Runze Liu",
      "Chau-Wai Wong",
      "Huaiyu Dai"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.08074",
    "title": "PySCIPOpt-ML: Embedding Trained Machine Learning Models into  Mixed-Integer Programs",
    "abstract": "A standard tool for modelling real-world optimisation problems is mixed-integer programming (MIP). However, for many of these problems there is either incomplete information describing variable relations, or the relations between variables are highly complex. To overcome both these hurdles, machine learning (ML) models are often used and embedded in the MIP as surrogate models to represent these relations. Due to the large amount of available ML frameworks, formulating ML models into MIPs is highly non-trivial. In this paper we propose a tool for the automatic MIP formulation of trained ML models, allowing easy integration of ML constraints into MIPs. In addition, we introduce a library of MIP instances with embedded ML constraints. The project is available at https://github.com/Opt-Mucca/PySCIPOpt-ML. ",
    "url": "https://arxiv.org/abs/2312.08074",
    "authors": [
      "Mark Turner",
      "Antonia Chmiela",
      "Thorsten Koch",
      "Michael Winkler"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.08083",
    "title": "Training of Neural Networks with Uncertain Data, A Mixture of Experts  Approach",
    "abstract": "This paper presents the \"Uncertainty-aware Mixture of Experts\" (uMoE), a novel approach designed to address aleatoric uncertainty in the training of predictive models based on Neural Networks (NNs). While existing methods primarily focus on managing uncertainty during infer-ence, uMoE integrates uncertainty directly into the train-ing process. The uMoE approach adopts a \"Divide and Conquer\" paradigm to partition the uncertain input space into more manageable subspaces. It consists of Expert components, each trained solely on the portion of input uncertainty corresponding to their subspace. On top of the Experts, a Gating Unit, guided by additional infor-mation about the distribution of uncertain inputs across these subspaces, learns to weight the Experts to minimize deviations from the ground truth. Our results highlight that uMoE significantly outperforms baseline methods in handling data uncertainty. Furthermore, we conducted a robustness analysis, illustrating its capability to adapt to varying levels of uncertainty and suggesting optimal threshold parameters. This innovative approach holds wide applicability across diverse data-driven domains, in-cluding biomedical signal processing, autonomous driv-ing, and production quality control. ",
    "url": "https://arxiv.org/abs/2312.08083",
    "authors": [
      "Lucas Luttner"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.08149",
    "title": "Optimal convergence rates for the spectrum of the graph Laplacian on  Poisson point clouds",
    "abstract": "We prove optimal convergence rates for eigenvalues and eigenvectors of the graph Laplacian on Poisson point clouds. Our results are valid down to the critical percolation threshold, yielding error estimates for relatively sparse graphs. ",
    "url": "https://arxiv.org/abs/2312.08149",
    "authors": [
      "Scott Armstrong",
      "Raghavendra Venkatraman"
    ],
    "subjectives": [
      "Analysis of PDEs (math.AP)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2312.08193",
    "title": "Universal Adversarial Framework to Improve Adversarial Robustness for  Diabetic Retinopathy Detection",
    "abstract": "Diabetic Retinopathy (DR) is a prevalent illness associated with Diabetes which, if left untreated, can result in irreversible blindness. Deep Learning based systems are gradually being introduced as automated support for clinical diagnosis. Since healthcare has always been an extremely important domain demanding error-free performance, any adversaries could pose a big threat to the applicability of such systems. In this work, we use Universal Adversarial Perturbations (UAPs) to quantify the vulnerability of Medical Deep Neural Networks (DNNs) for detecting DR. To the best of our knowledge, this is the very first attempt that works on attacking complete fine-grained classification of DR images using various UAPs. Also, as a part of this work, we use UAPs to fine-tune the trained models to defend against adversarial samples. We experiment on several models and observe that the performance of such models towards unseen adversarial attacks gets boosted on average by $3.41$ Cohen-kappa value and maximum by $31.92$ Cohen-kappa value. The performance degradation on normal data upon ensembling the fine-tuned models was found to be statistically insignificant using t-test, highlighting the benefits of UAP-based adversarial fine-tuning. ",
    "url": "https://arxiv.org/abs/2312.08193",
    "authors": [
      "Samrat Mukherjee",
      "Dibyanayan Bandyopadhyay",
      "Baban Gain",
      "Asif Ekbal"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.08244",
    "title": "Capacity of the treelike sign perceptrons neural networks with one  hidden layer -- RDT based upper bounds",
    "abstract": "We study the capacity of \\emph{sign} perceptrons neural networks (SPNN) and particularly focus on 1-hidden layer \\emph{treelike committee machine} (TCM) architectures. Similarly to what happens in the case of a single perceptron neuron, it turns out that, in a statistical sense, the capacity of a corresponding multilayered network architecture consisting of multiple \\emph{sign} perceptrons also undergoes the so-called phase transition (PT) phenomenon. This means: (i) for certain range of system parameters (size of data, number of neurons), the network can be properly trained to accurately memorize \\emph{all} elements of the input dataset; and (ii) outside the region such a training does not exist. Clearly, determining the corresponding phase transition curve that separates these regions is an extraordinary task and among the most fundamental questions related to the performance of any network. Utilizing powerful mathematical engine called Random Duality Theory (RDT), we establish a generic framework for determining the upper bounds on the 1-hidden layer TCM SPNN capacity. Moreover, we do so for \\emph{any} given (odd) number of neurons. We further show that the obtained results \\emph{exactly} match the replica symmetry predictions of \\cite{EKTVZ92,BHS92}, thereby proving that the statistical physics based results are not only nice estimates but also mathematically rigorous bounds as well. Moreover, for $d\\leq 5$, we obtain the capacity values that improve on the best known rigorous ones of \\cite{MitchDurb89}, thereby establishing a first, mathematically rigorous, progress in well over 30 years. ",
    "url": "https://arxiv.org/abs/2312.08244",
    "authors": [
      "Mihailo Stojnic"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Information Theory (cs.IT)",
      "Mathematical Physics (math-ph)",
      "Probability (math.PR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2312.08257",
    "title": "\\emph{Lifted} RDT based capacity analysis of the 1-hidden layer treelike  \\emph{sign} perceptrons neural networks",
    "abstract": "We consider the memorization capabilities of multilayered \\emph{sign} perceptrons neural networks (SPNNs). A recent rigorous upper-bounding capacity characterization, obtained in \\cite{Stojnictcmspnncaprdt23} utilizing the Random Duality Theory (RDT), demonstrated that adding neurons in a network configuration may indeed be very beneficial. Moreover, for particular \\emph{treelike committee machines} (TCM) architectures with $d\\leq 5$ neurons in the hidden layer, \\cite{Stojnictcmspnncaprdt23} made a very first mathematically rigorous progress in over 30 years by lowering the previously best known capacity bounds of \\cite{MitchDurb89}. Here, we first establish that the RDT bounds from \\cite{Stojnictcmspnncaprdt23} scale as $\\sim \\sqrt{d}$ and can not on their own \\emph{universally} (over the entire range of $d$) beat the best known $\\sim \\log(d)$ scaling of the bounds from \\cite{MitchDurb89}. After recognizing that the progress from \\cite{Stojnictcmspnncaprdt23} is therefore promising, but yet without a complete concretization, we then proceed by considering the recently developed fully lifted RDT (fl RDT) as an alternative. While the fl RDT is indeed a powerful juggernaut, it typically relies on heavy numerical evaluations. To avoid such heavy numerics, we here focus on a simplified, \\emph{partially lifted}, variant and show that it allows for very neat, closed form, analytical capacity characterizations. Moreover, we obtain the concrete capacity bounds that \\emph{universally} improve for \\emph{any} $d$ over the best known ones of \\cite{MitchDurb89}. ",
    "url": "https://arxiv.org/abs/2312.08257",
    "authors": [
      "Mihailo Stojnic"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Mathematical Physics (math-ph)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2312.08262",
    "title": "The Leaf Function of Penrose P2 Graphs",
    "abstract": "We study a graph-theoretic problem in the Penrose P2-graphs which are the dual graphs of Penrose tilings by kites and darts. Using substitutions, local isomorphism and other properties of Penrose tilings, we construct a family of arbitrarily large induced subtrees of Penrose graphs with the largest possible number of leaves for a given number $n$ of vertices. These subtrees are called fully leafed induced subtrees. We denote their number of leaves $L_{P2}(n)$ for any non-negative integer $n$, and the sequence $\\left(L_{P2}(n)\\right)_{n\\in\\mathbb{N}}$ is called the leaf function of Penrose P2-graphs. We present exact and recursive formulae for $L_{P2}(n)$, as well as an infinite sequence of fully leafed induced subtrees, which are caterpillar graphs. In particular, our proof relies on the construction of a finite graded poset of 3-internal-regular subtrees. ",
    "url": "https://arxiv.org/abs/2312.08262",
    "authors": [
      "Carole Porrier",
      "Alexandre Blondin Massé",
      "Alain Goupil"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2312.08286",
    "title": "Evolutionary Games on Infinite Strategy Sets: Convergence to Nash  Equilibria via Dissipativity",
    "abstract": "We consider evolutionary dynamics for population games in which players have a continuum of strategies at their disposal. Models in this setting amount to infinite-dimensional differential equations evolving on the manifold of probability measures. We generalize dissipativity theory for evolutionary games from finite to infinite strategy sets that are compact metric spaces, and derive sufficient conditions for the stability of Nash equilibria under the infinite-dimensional dynamics. The resulting analysis is applicable to a broad class of evolutionary games, and is modular in the sense that the pertinent conditions on the dynamics and the game's payoff structure can be verified independently. By specializing our theory to the class of monotone games, we recover as special cases existing stability results for the Brown-von Neumann-Nash and impartial pairwise comparison dynamics. We also extend our theory to models with dynamic payoffs, further broadening the applicability of our framework. We illustrate our theory using a variety of case studies, including a novel, continuous variant of the war of attrition game. ",
    "url": "https://arxiv.org/abs/2312.08286",
    "authors": [
      "Brendon G. Anderson",
      "Somayeh Sojoudi",
      "Murat Arcak"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Computer Science and Game Theory (cs.GT)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2312.08295",
    "title": "Inferring Atmospheric Properties of Exoplanets with Flow Matching and  Neural Importance Sampling",
    "abstract": "Atmospheric retrievals (AR) characterize exoplanets by estimating atmospheric parameters from observed light spectra, typically by framing the task as a Bayesian inference problem. However, traditional approaches such as nested sampling are computationally expensive, thus sparking an interest in solutions based on machine learning (ML). In this ongoing work, we first explore flow matching posterior estimation (FMPE) as a new ML-based method for AR and find that, in our case, it is more accurate than neural posterior estimation (NPE), but less accurate than nested sampling. We then combine both FMPE and NPE with importance sampling, in which case both methods outperform nested sampling in terms of accuracy and simulation efficiency. Going forward, our analysis suggests that simulation-based inference with likelihood-based importance sampling provides a framework for accurate and efficient AR that may become a valuable tool not only for the analysis of observational data from existing telescopes, but also for the development of new missions and instruments. ",
    "url": "https://arxiv.org/abs/2312.08295",
    "authors": [
      "Timothy D. Gebhard",
      "Jonas Wildberger",
      "Maximilian Dax",
      "Daniel Angerhausen",
      "Sascha P. Quanz",
      "Bernhard Schölkopf"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Earth and Planetary Astrophysics (astro-ph.EP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.08307",
    "title": "EquiReact: An equivariant neural network for chemical reactions",
    "abstract": "Equivariant neural networks have considerably improved the accuracy and data-efficiency of predictions of molecular properties. Building on this success, we introduce EquiReact, an equivariant neural network to infer properties of chemical reactions, built from three-dimensional structures of reactants and products. We illustrate its competitive performance on the prediction of activation barriers on the GDB7-22-TS, Cyclo-23-TS and Proparg-21-TS datasets with different regimes according to the inclusion of atom-mapping information. We show that, compared to state-of-the-art models for reaction property prediction, EquiReact offers: (i) a flexible model with reduced sensitivity between atom-mapping regimes, (ii) better extrapolation capabilities to unseen chemistries, (iii) impressive prediction errors for datasets exhibiting subtle variations in three-dimensional geometries of reactants/products, (iv) reduced sensitivity to geometry quality and (iv) excellent data efficiency. ",
    "url": "https://arxiv.org/abs/2312.08307",
    "authors": [
      "Puck van Gerwen",
      "Ksenia R. Briling",
      "Charlotte Bunne",
      "Vignesh Ram Somnath",
      "Ruben Laplaza",
      "Andreas Krause",
      "Clemence Corminboeuf"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.08343",
    "title": "Ehancing CT Image synthesis from multi-modal MRI data based on a  multi-task neural network framework",
    "abstract": "Image segmentation, real-value prediction, and cross-modal translation are critical challenges in medical imaging. In this study, we propose a versatile multi-task neural network framework, based on an enhanced Transformer U-Net architecture, capable of simultaneously, selectively, and adaptively addressing these medical image tasks. Validation is performed on a public repository of human brain MR and CT images. We decompose the traditional problem of synthesizing CT images into distinct subtasks, which include skull segmentation, Hounsfield unit (HU) value prediction, and image sequential reconstruction. To enhance the framework's versatility in handling multi-modal data, we expand the model with multiple image channels. Comparisons between synthesized CT images derived from T1-weighted and T2-Flair images were conducted, evaluating the model's capability to integrate multi-modal information from both morphological and pixel value perspectives. ",
    "url": "https://arxiv.org/abs/2312.08343",
    "authors": [
      "Zhuoyao Xin",
      "Christopher Wu",
      "Dong Liu",
      "Chunming Gu",
      "Jia Guo",
      "Jun Hua"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2312.08355",
    "title": "Disconnected cuts in 4-connected planar graphs",
    "abstract": "Let $G=(V,E)$ be a connected graph. A subset $S\\subset V$ is a cut of $G$ if $G-S$ is disconnected. A near triangulation is a 2-connected plane graph that has at most one face that is not a triangle. In this paper, we explore minimal cuts of 4-connected planar graphs. Our main result is that every minimal cut of a 4-connected planar graph $G$ is connected if and only if $G$ is a near-triangulation. We use this result to sketch a linear-time algorithm for finding a disconnected cut of a 4-connected planar graph. ",
    "url": "https://arxiv.org/abs/2312.08355",
    "authors": [
      "Brandon Du Preez"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2312.08360",
    "title": "On the existence of some completely regular codes in Hamming graphs",
    "abstract": "We solve several first questions in the table of small parameters of completely regular (CR) codes in Hamming graphs $H(n,q)$. The most uplifting result is the existence of a $\\{13,6,1;1,6,9\\}$-CR code in $H(n,2)$, $n\\ge 13$. We also establish the non-existence of a $\\{11,4;3,6\\}$-code and a $\\{10,3;4,7\\}$-code in $H(12,2)$ and $H(13,2)$. A partition of the complement of the quaternary Hamming code of length~$5$ into $4$-cliques is found, which can be used to construct completely regular codes with covering radius $1$ by known constructions. Additionally we discuss the parameters $\\{24,21,10;1,4,12\\}$ of a putative completely regular code in $H(24,2)$ and show the nonexistence of such a code in $H(8,4)$. Keywords: Hamming graph, equitable partition, completely regular code ",
    "url": "https://arxiv.org/abs/2312.08360",
    "authors": [
      "Denis S. Krotov"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2010.02787",
    "title": "Efficiently Approximating Vertex Cover on Scale-Free Networks with  Underlying Hyperbolic Geometry",
    "abstract": " Title: Efficiently Approximating Vertex Cover on Scale-Free Networks with  Underlying Hyperbolic Geometry ",
    "url": "https://arxiv.org/abs/2010.02787",
    "authors": [
      "Thomas Bläsius",
      "Tobias Friedrich",
      "Maximilian Katzmann"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2107.01559",
    "title": "Smoothed Differential Privacy",
    "abstract": " Comments: 16 Page main text + Appendix ",
    "url": "https://arxiv.org/abs/2107.01559",
    "authors": [
      "Ao Liu",
      "Yu-Xiang Wang",
      "Lirong Xia"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.12674",
    "title": "Rewiring with Positional Encodings for Graph Neural Networks",
    "abstract": " Title: Rewiring with Positional Encodings for Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2201.12674",
    "authors": [
      "Rickard Brüel-Gabrielsson",
      "Mikhail Yurochkin",
      "Justin Solomon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.13306",
    "title": "Heroes in oriented complete multipartite graphs",
    "abstract": " Title: Heroes in oriented complete multipartite graphs ",
    "url": "https://arxiv.org/abs/2202.13306",
    "authors": [
      "Pierre Aboulker",
      "Guillaume Aubian",
      "Pierre Charbit"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2205.00867",
    "title": "Capturing High-order Structures on Motif-based Graph Nerual Networks",
    "abstract": " Comments: some metric have problem ",
    "url": "https://arxiv.org/abs/2205.00867",
    "authors": [
      "Kejia Zhang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2205.02528",
    "title": "On inherent limitations in robustness and performance for a class of  prescribed-time algorithms",
    "abstract": " Title: On inherent limitations in robustness and performance for a class of  prescribed-time algorithms ",
    "url": "https://arxiv.org/abs/2205.02528",
    "authors": [
      "Rodrigo Aldana-López",
      "Richard Seeber",
      "Hernan Haimovich",
      "David Gómez-Gutiérrez"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2207.13176",
    "title": "Exploring the Privacy Risks of Adversarial VR Game Design",
    "abstract": " Comments: Learn more at this https URL ",
    "url": "https://arxiv.org/abs/2207.13176",
    "authors": [
      "Vivek Nair",
      "Gonzalo Munilla Garrido",
      "Dawn Song",
      "James F. O'Brien"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.08716",
    "title": "GLARE: A Dataset for Traffic Sign Detection in Sun Glare",
    "abstract": " Title: GLARE: A Dataset for Traffic Sign Detection in Sun Glare ",
    "url": "https://arxiv.org/abs/2209.08716",
    "authors": [
      "Nicholas Gray",
      "Megan Moraes",
      "Jiang Bian",
      "Alex Wang",
      "Allen Tian",
      "Kurt Wilson",
      "Yan Huang",
      "Haoyi Xiong",
      "Zhishan Guo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.10187",
    "title": "On the convex formulations of robust Markov decision processes",
    "abstract": " Title: On the convex formulations of robust Markov decision processes ",
    "url": "https://arxiv.org/abs/2209.10187",
    "authors": [
      "Julien Grand-Clément",
      "Marek Petrik"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.04037",
    "title": "ROBUSfT: Robust Real-Time Shape-from-Template, a C++ Library",
    "abstract": " Comments: This is the arXiv version of an article published in Image and Vision Computing. Please cite the accepted version: M. Shetab-Bushehri, M. Aranda, E. Ozgur, Y. Mezouar and Adrien Bartoli \"ROBUSfT: Robust Real-Time Shape-from-Template, a C++ Library,\" in Image and Vision Computing, doi: 10.1016/j.imavis.2023.104867 ",
    "url": "https://arxiv.org/abs/2301.04037",
    "authors": [
      "Mohammadreza Shetab-Bushehri",
      "Miguel Aranda",
      "Youcef Mezouar",
      "Adrien Bartoli",
      "Erol Ozgur"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.10814",
    "title": "Unsupervised Protein-Ligand Binding Energy Prediction via Neural Euler's  Rotation Equation",
    "abstract": " Title: Unsupervised Protein-Ligand Binding Energy Prediction via Neural Euler's  Rotation Equation ",
    "url": "https://arxiv.org/abs/2301.10814",
    "authors": [
      "Wengong Jin",
      "Siranush Sarkizova",
      "Xun Chen",
      "Nir Hacohen",
      "Caroline Uhler"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.11573",
    "title": "On the optimality of Kalman Filter for Fault Detection",
    "abstract": " Title: On the optimality of Kalman Filter for Fault Detection ",
    "url": "https://arxiv.org/abs/2301.11573",
    "authors": [
      "Jinming Zhou",
      "Yucai Zhu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.12361",
    "title": "Graph Harmony: Denoising and Nuclear-Norm Wasserstein Adaptation for  Enhanced Domain Transfer in Graph-Structured Data",
    "abstract": " Title: Graph Harmony: Denoising and Nuclear-Norm Wasserstein Adaptation for  Enhanced Domain Transfer in Graph-Structured Data ",
    "url": "https://arxiv.org/abs/2301.12361",
    "authors": [
      "Mengxi Wu",
      "Mohammad Rostami"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.13428",
    "title": "Contrast and Clustering: Learning Neighborhood Pair Representation for  Source-free Domain Adaptation",
    "abstract": " Comments: Journal articles ",
    "url": "https://arxiv.org/abs/2301.13428",
    "authors": [
      "Yuqi Chen",
      "Xiangbin Zhu",
      "Yonggang Li",
      "Yingjian Li",
      "Haojie Fang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01403",
    "title": "Self-Supervised Relation Alignment for Scene Graph Generation",
    "abstract": " Title: Self-Supervised Relation Alignment for Scene Graph Generation ",
    "url": "https://arxiv.org/abs/2302.01403",
    "authors": [
      "Bicheng Xu",
      "Renjie Liao",
      "Leonid Sigal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.07350",
    "title": "Graph schemas as abstractions for transfer learning, inference, and  planning",
    "abstract": " Comments: 14 pages, 4 figures in main paper, 13 pages and 8 figures in appendix ",
    "url": "https://arxiv.org/abs/2302.07350",
    "authors": [
      "J. Swaroop Guntupalli",
      "Rajkumar Vasudeva Raju",
      "Shrinu Kushagra",
      "Carter Wendelken",
      "Danny Sawyer",
      "Ishan Deshpande",
      "Guangyao Zhou",
      "Miguel Lázaro-Gredilla",
      "Dileep George"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2303.02904",
    "title": "Social Cue Detection and Analysis Using Transfer Entropy",
    "abstract": " Comments: 9 pages, 5 figures. Preprint. To be published in Proceedings of the 2024 ACM/IEEE International Conference on Human-Robot Interaction (HRI '24), March 11--14, 2024, Boulder, CO, USA ",
    "url": "https://arxiv.org/abs/2303.02904",
    "authors": [
      "Haoyang Jiang",
      "Elizabeth A. Croft",
      "Michael G. Burke"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2303.06510",
    "title": "E2CoPre: Energy Efficient and Cooperative Collision Avoidance for UAV  Swarms with Trajectory Prediction",
    "abstract": " Title: E2CoPre: Energy Efficient and Cooperative Collision Avoidance for UAV  Swarms with Trajectory Prediction ",
    "url": "https://arxiv.org/abs/2303.06510",
    "authors": [
      "Shuangyao Huang",
      "Haibo Zhang",
      "Zhiyi Huang"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.00432",
    "title": "Multi-Agent Reachability Calibration with Conformal Prediction",
    "abstract": " Title: Multi-Agent Reachability Calibration with Conformal Prediction ",
    "url": "https://arxiv.org/abs/2304.00432",
    "authors": [
      "Anish Muthali",
      "Haotian Shen",
      "Sampada Deglurkar",
      "Michael H. Lim",
      "Rebecca Roelofs",
      "Aleksandra Faust",
      "Claire Tomlin"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.01075",
    "title": "Conformal Prediction Regions for Time Series using Linear  Complementarity Programming",
    "abstract": " Title: Conformal Prediction Regions for Time Series using Linear  Complementarity Programming ",
    "url": "https://arxiv.org/abs/2304.01075",
    "authors": [
      "Matthew Cleaveland",
      "Insup Lee",
      "George J. Pappas",
      "Lars Lindemann"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.07939",
    "title": "Leveraging sparse and shared feature activations for disentangled  representation learning",
    "abstract": " Title: Leveraging sparse and shared feature activations for disentangled  representation learning ",
    "url": "https://arxiv.org/abs/2304.07939",
    "authors": [
      "Marco Fumero",
      "Florian Wenzel",
      "Luca Zancato",
      "Alessandro Achille",
      "Emanuele Rodolà",
      "Stefano Soatto",
      "Bernhard Schölkopf",
      "Francesco Locatello"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.08083",
    "title": "VCD: Visual Causality Discovery for Cross-Modal Question Reasoning",
    "abstract": " Comments: 12 pages, 6 figures. arXiv admin note: substantial text overlap with arXiv:2207.12647 ",
    "url": "https://arxiv.org/abs/2304.08083",
    "authors": [
      "Yang Liu",
      "Ying Tan",
      "Jingzhou Luo",
      "Weixing Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.13850",
    "title": "Do SSL Models Have Déjà Vu? A Case of Unintended Memorization in  Self-supervised Learning",
    "abstract": " Title: Do SSL Models Have Déjà Vu? A Case of Unintended Memorization in  Self-supervised Learning ",
    "url": "https://arxiv.org/abs/2304.13850",
    "authors": [
      "Casey Meehan",
      "Florian Bordes",
      "Pascal Vincent",
      "Kamalika Chaudhuri",
      "Chuan Guo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.14365",
    "title": "Occ3D: A Large-Scale 3D Occupancy Prediction Benchmark for Autonomous  Driving",
    "abstract": " Comments: Accepted to NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2304.14365",
    "authors": [
      "Xiaoyu Tian",
      "Tao Jiang",
      "Longfei Yun",
      "Yucheng Mao",
      "Huitong Yang",
      "Yue Wang",
      "Yilun Wang",
      "Hang Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.05959",
    "title": "Survey of Code Search Based on Deep Learning",
    "abstract": " Comments: 44 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2305.05959",
    "authors": [
      "Yutao Xie",
      "Jiayi Lin",
      "Hande Dong",
      "Lei Zhang",
      "Zhonghai Wu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2305.06152",
    "title": "Structure-CLIP: Towards Scene Graph Knowledge to Enhance Multi-modal  Structured Representations",
    "abstract": " Comments: AAAI 2024, this https URL ",
    "url": "https://arxiv.org/abs/2305.06152",
    "authors": [
      "Yufeng Huang",
      "Jiji Tang",
      "Zhuo Chen",
      "Rongsheng Zhang",
      "Xinfeng Zhang",
      "Weijie Chen",
      "Zeng Zhao",
      "Zhou Zhao",
      "Tangjie Lv",
      "Zhipeng Hu",
      "Wen Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2305.10108",
    "title": "List 3-Coloring on Comb-Convex and Caterpillar-Convex Bipartite Graphs",
    "abstract": " Comments: An extended abstract of the paper appears in the proceedings of the 29th International Computing and Combinatorics Conference (COCOON 2023) ",
    "url": "https://arxiv.org/abs/2305.10108",
    "authors": [
      "Banu Baklan Şen",
      "Öznur Yaşar Diner",
      "Thomas Erlebach"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2306.01808",
    "title": "Morphology Edge Attention Network and Optimal Geometric Matching  Connection model for vascular segmentation",
    "abstract": " Comments: 6 pages ",
    "url": "https://arxiv.org/abs/2306.01808",
    "authors": [
      "Yuntao Zhu",
      "Yuxuan Qiao",
      "Xiaoping Yang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.04064",
    "title": "Transferable Adversarial Robustness for Categorical Data via Universal  Robust Embeddings",
    "abstract": " Title: Transferable Adversarial Robustness for Categorical Data via Universal  Robust Embeddings ",
    "url": "https://arxiv.org/abs/2306.04064",
    "authors": [
      "Klim Kireev",
      "Maksym Andriushchenko",
      "Carmela Troncoso",
      "Nicolas Flammarion"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.07050",
    "title": "Revisiting Token Pruning for Object Detection and Instance Segmentation",
    "abstract": " Title: Revisiting Token Pruning for Object Detection and Instance Segmentation ",
    "url": "https://arxiv.org/abs/2306.07050",
    "authors": [
      "Yifei Liu",
      "Mathias Gehrig",
      "Nico Messikommer",
      "Marco Cannici",
      "Davide Scaramuzza"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.09337",
    "title": "Generative Proxemics: A Prior for 3D Social Interaction from Images",
    "abstract": " Comments: Project website: muelea.github.io/buddi ",
    "url": "https://arxiv.org/abs/2306.09337",
    "authors": [
      "Lea Müller",
      "Vickie Ye",
      "Georgios Pavlakos",
      "Michael Black",
      "Angjoo Kanazawa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.13427",
    "title": "A Robustness Analysis to Structured Channel Tampering Over  Secure-by-Design Consensus Networks",
    "abstract": " Comments: 6 pages, 2 figures, this paper has been also accepted for a joint publication on the IEEE Conference on Decision and Control 2023 Marina Bay Sands, Singapore ",
    "url": "https://arxiv.org/abs/2306.13427",
    "authors": [
      "Marco Fabris",
      "Daniel Zelazo"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2306.17462",
    "title": "CausalVLR: A Toolbox and Benchmark for Visual-Linguistic Causal  Reasoning",
    "abstract": " Comments: CausalVLR: A Toolbox and Benchmark for Visual-Linguistic Causal Reasoning. this https URL ",
    "url": "https://arxiv.org/abs/2306.17462",
    "authors": [
      "Yang Liu",
      "Weixing Chen",
      "Guanbin Li",
      "Liang Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.03977",
    "title": "PUG: Photorealistic and Semantically Controllable Synthetic Data for  Representation Learning",
    "abstract": " Title: PUG: Photorealistic and Semantically Controllable Synthetic Data for  Representation Learning ",
    "url": "https://arxiv.org/abs/2308.03977",
    "authors": [
      "Florian Bordes",
      "Shashank Shekhar",
      "Mark Ibrahim",
      "Diane Bouchacourt",
      "Pascal Vincent",
      "Ari S. Morcos"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.05170",
    "title": "FPGA Resource-aware Structured Pruning for Real-Time Neural Networks",
    "abstract": " Title: FPGA Resource-aware Structured Pruning for Real-Time Neural Networks ",
    "url": "https://arxiv.org/abs/2308.05170",
    "authors": [
      "Benjamin Ramhorst",
      "Vladimir Loncar",
      "George A. Constantinides"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.09065",
    "title": "Discretization-Induced Dirichlet Posterior for Robust Uncertainty  Quantification on Regression",
    "abstract": " Comments: 23 pages with main paper and supplymentary material. Accepted at AAAI 2024 ",
    "url": "https://arxiv.org/abs/2308.09065",
    "authors": [
      "Xuanlong Yu",
      "Gianni Franchi",
      "Jindong Gu",
      "Emanuel Aldea"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2309.03999",
    "title": "Adapting Self-Supervised Representations to Multi-Domain Setups",
    "abstract": " Comments: Published at BMVC 2023 ",
    "url": "https://arxiv.org/abs/2309.03999",
    "authors": [
      "Neha Kalibhat",
      "Sam Sharpe",
      "Jeremy Goodsitt",
      "Bayan Bruss",
      "Soheil Feizi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.14585",
    "title": "DifAttack: Query-Efficient Black-Box Attack via Disentangled Feature  Space",
    "abstract": " Comments: Accepted in AAAI'24 ",
    "url": "https://arxiv.org/abs/2309.14585",
    "authors": [
      "Liu Jun",
      "Zhou Jiantao",
      "Zeng Jiandian",
      "Jinyu Tian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03149",
    "title": "Attributing Learned Concepts in Neural Networks to Training Data",
    "abstract": " Comments: ATTRIB Workshop at NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2310.03149",
    "authors": [
      "Nicholas Konz",
      "Charles Godfrey",
      "Madelyn Shapiro",
      "Jonathan Tu",
      "Henry Kvinge",
      "Davis Brown"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.06470",
    "title": "Focus on Local Regions for Query-based Object Detection",
    "abstract": " Title: Focus on Local Regions for Query-based Object Detection ",
    "url": "https://arxiv.org/abs/2310.06470",
    "authors": [
      "Hongbin Xu",
      "Yamei Xia",
      "Shuai Zhao",
      "Bo Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.08320",
    "title": "Defending Our Privacy With Backdoors",
    "abstract": " Comments: 14 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2310.08320",
    "authors": [
      "Dominik Hintersdorf",
      "Lukas Struppek",
      "Daniel Neider",
      "Kristian Kersting"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.10659",
    "title": "Exploiting Machine Unlearning for Backdoor Attacks in Deep Learning  System",
    "abstract": " Title: Exploiting Machine Unlearning for Backdoor Attacks in Deep Learning  System ",
    "url": "https://arxiv.org/abs/2310.10659",
    "authors": [
      "Peixin Zhang",
      "Jun Sun",
      "Mingtian Tan",
      "Xinyu Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.08059",
    "title": "FS-Net: Full Scale Network and Adaptive Threshold for Improving  Extraction of Micro-Retinal Vessel Structures",
    "abstract": " Comments: 7 pages, 2 figures, under consideration at Pattern Recognition Letters ",
    "url": "https://arxiv.org/abs/2311.08059",
    "authors": [
      "Melaku N. Getahun",
      "Oleg Y. Rogov",
      "Dmitry V. Dylov",
      "Andrey Somov",
      "Ahmed Bouridane",
      "Rifat Hamoudi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.15317",
    "title": "Generalized Graph Prompt: Toward a Unification of Pre-Training and  Downstream Tasks on Graphs",
    "abstract": " Comments: Extension of \"GraphPrompt: Unifying Pre-Training and Downstream Tasks for Graph Neural Networks\". arXiv admin note: substantial text overlap with arXiv:2302.08043 ",
    "url": "https://arxiv.org/abs/2311.15317",
    "authors": [
      "Xingtong Yu",
      "Zhenghao Liu",
      "Yuan Fang",
      "Zemin Liu",
      "Sihong Chen",
      "Xinming Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.17929",
    "title": "New Online Communities: Graph Deep Learning on Anonymous Voting Networks  to Identify Sybils in Polycentric Governance",
    "abstract": " Title: New Online Communities: Graph Deep Learning on Anonymous Voting Networks  to Identify Sybils in Polycentric Governance ",
    "url": "https://arxiv.org/abs/2311.17929",
    "authors": [
      "Quinn DuPont"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2312.00102",
    "title": "FedEmb: A Vertical and Hybrid Federated Learning Algorithm using Network  And Feature Embedding Aggregation",
    "abstract": " Comments: Accepted by Proceedings on Engineering Sciences ",
    "url": "https://arxiv.org/abs/2312.00102",
    "authors": [
      "Fanfei Meng",
      "Lele Zhang",
      "Yu Chen",
      "Yuxin Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.01241",
    "title": "Just-in-Time Security Patch Detection -- LLM At the Rescue for Data  Augmentation",
    "abstract": " Title: Just-in-Time Security Patch Detection -- LLM At the Rescue for Data  Augmentation ",
    "url": "https://arxiv.org/abs/2312.01241",
    "authors": [
      "Xunzhu Tang",
      "Zhenghan Chen",
      "Kisub Kim",
      "Haoye Tian",
      "Saad Ezzini",
      "Jacques Klein"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.02142",
    "title": "Object Recognition as Next Token Prediction",
    "abstract": " Comments: update the intro fig and refs; auto-regression for recognition ",
    "url": "https://arxiv.org/abs/2312.02142",
    "authors": [
      "Kaiyu Yue",
      "Bor-Chun Chen",
      "Jonas Geiping",
      "Hengduo Li",
      "Tom Goldstein",
      "Ser-Nam Lim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.02462",
    "title": "Dimensionality Reduction and Dynamical Mode Recognition of Circular  Arrays of Flame Oscillators Using Deep Neural Network",
    "abstract": " Comments: research paper (18 pages, 1 table 10 figures) with supplementary material (8 pages, 1 table, 5 figures) ",
    "url": "https://arxiv.org/abs/2312.02462",
    "authors": [
      "Weiming Xu",
      "Tao Yang",
      "Peng Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2312.04730",
    "title": "DeceptPrompt: Exploiting LLM-driven Code Generation via Adversarial  Natural Language Instructions",
    "abstract": " Title: DeceptPrompt: Exploiting LLM-driven Code Generation via Adversarial  Natural Language Instructions ",
    "url": "https://arxiv.org/abs/2312.04730",
    "authors": [
      "Fangzhou Wu",
      "Xiaogeng Liu",
      "Chaowei Xiao"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.05139",
    "title": "Clearing Financial Networks with Derivatives: From Intractability to  Algorithms",
    "abstract": " Title: Clearing Financial Networks with Derivatives: From Intractability to  Algorithms ",
    "url": "https://arxiv.org/abs/2312.05139",
    "authors": [
      "Stavros D. Ioannidis",
      "Bart de Keijzer",
      "Carmine Ventre"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2312.05799",
    "title": "SGNet: Structure Guided Network via Gradient-Frequency Awareness for  Depth Map Super-Resolution",
    "abstract": " Comments: Accepted to AAAI 2024 ",
    "url": "https://arxiv.org/abs/2312.05799",
    "authors": [
      "Zhengxue Wang",
      "Zhiqiang Yan",
      "Jian Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.06141",
    "title": "Survey on Memory-Augmented Neural Networks: Cognitive Insights to AI  Applications",
    "abstract": " Title: Survey on Memory-Augmented Neural Networks: Cognitive Insights to AI  Applications ",
    "url": "https://arxiv.org/abs/2312.06141",
    "authors": [
      "Savya Khosla",
      "Zhen Zhu",
      "Yifei He"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.07180",
    "title": "Context-Aware Iteration Policy Network for Efficient Optical Flow  Estimation",
    "abstract": " Comments: 2024, Association for the Advancement of Artificial Intelligence ",
    "url": "https://arxiv.org/abs/2312.07180",
    "authors": [
      "Ri Cheng",
      "Ruian He",
      "Xuhao Jiang",
      "Shili Zhou",
      "Weimin Tan",
      "Bo Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]