[
  {
    "id": "arXiv:2201.04180",
    "title": "Learning Robust Policies for Generalized Debris Capture with an  Automated Tether-Net System",
    "abstract": "Tether-net launched from a chaser spacecraft provides a promising method to capture and dispose of large space debris in orbit. This tether-net system is subject to several sources of uncertainty in sensing and actuation that affect the performance of its net launch and closing control. Earlier reliability-based optimization approaches to design control actions however remain challenging and computationally prohibitive to generalize over varying launch scenarios and target (debris) state relative to the chaser. To search for a general and reliable control policy, this paper presents a reinforcement learning framework that integrates a proximal policy optimization (PPO2) approach with net dynamics simulations. The latter allows evaluating the episodes of net-based target capture, and estimate the capture quality index that serves as the reward feedback to PPO2. Here, the learned policy is designed to model the timing of the net closing action based on the state of the moving net and the target, under any given launch scenario. A stochastic state transition model is considered in order to incorporate synthetic uncertainties in state estimation and launch actuation. Along with notable reward improvement during training, the trained policy demonstrates capture performance (over a wide range of launch/target scenarios) that is close to that obtained with reliability-based optimization run over an individual scenario. ",
    "url": "https://arxiv.org/abs/2201.04180",
    "authors": [
      "Chen Zeng",
      "Grant Hecht",
      "Prajit KrisshnaKumar",
      "Raj K. Shah",
      "Souma Chowdhury",
      "Eleonora M. Botta"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2201.04192",
    "title": "Model-less Robust Voltage Control in Active Distribution Networks using  Sensitivity Coefficients Estimated from Measurements",
    "abstract": "Measurement-rich power distribution networks may enable distribution system operators (DSOs) to adopt model-less and measurement-based monitoring and control of distributed energy resources (DERs) for mitigating grid issues such as over/under voltages and lines congestions. However, measurement-based monitoring and control applications may lead to inaccurate control decisions due to measurement errors. In particular, estimation models relying on regression-based schemes result in significant errors in the estimates (e.g., nodal voltages) especially for measurement devices with high Instrument Transformer (IT) classes. The consequences are detrimental to control performance since this may lead to infeasible decisions. This work proposes a model-less robust voltage control accounting for the uncertainties of measurement-based estimated voltage sensitivity coefficients. The coefficients and their uncertainties are obtained using a recursive least squares (RLS)-based online estimation, updated whenever new measurements are available. This formulation is applied to control distributed controllable photovoltaic (PV) generation in a distribution network to restrict the voltage within prescribed limits. The proposed scheme is validated by simulating a CIGRE low-voltage system interfacing multiple controllable PV plants. ",
    "url": "https://arxiv.org/abs/2201.04192",
    "authors": [
      "Rahul Gupta",
      "Fabrizio Sossan",
      "Mario Paolone"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2201.04194",
    "title": "Neural Capacitance: A New Perspective of Neural Network Selection via  Edge Dynamics",
    "abstract": "Efficient model selection for identifying a suitable pre-trained neural network to a downstream task is a fundamental yet challenging task in deep learning. Current practice requires expensive computational costs in model training for performance prediction. In this paper, we propose a novel framework for neural network selection by analyzing the governing dynamics over synaptic connections (edges) during training. Our framework is built on the fact that back-propagation during neural network training is equivalent to the dynamical evolution of synaptic connections. Therefore, a converged neural network is associated with an equilibrium state of a networked system composed of those edges. To this end, we construct a network mapping $\\phi$, converting a neural network $G_A$ to a directed line graph $G_B$ that is defined on those edges in $G_A$. Next, we derive a neural capacitance metric $\\beta_{\\rm eff}$ as a predictive measure universally capturing the generalization capability of $G_A$ on the downstream task using only a handful of early training results. We carried out extensive experiments using 17 popular pre-trained ImageNet models and five benchmark datasets, including CIFAR10, CIFAR100, SVHN, Fashion MNIST and Birds, to evaluate the fine-tuning performance of our framework. Our neural capacitance metric is shown to be a powerful indicator for model selection based only on early training results and is more efficient than state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2201.04194",
    "authors": [
      "Chunheng Jiang",
      "Tejaswini Pedapati",
      "Pin-Yu Chen",
      "Yizhou Sun",
      "Jianxi Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.04195",
    "title": "Matching-based Service Offloading for Compute-less Driven IoT Networks",
    "abstract": "With the advent of the Internet of Things (IoT) and 5G networks, edge computing is offering new opportunities for business model and use cases innovations. Service providers can now virtualize the cloud beyond the data center to meet the latency, data sovereignty, reliability, and interoperability requirements. Yet, many new applications (e.g., augmented reality, virtual reality, artificial intelligence) are computation-intensive and delay-sensitivity. These applications are invoked heavily with similar inputs that could lead to the same output. Compute-less networks aim to implement a network with a minimum amount of computation and communication. This can be realized by offloading prevalent services to the edge and thus minimizing communication in the core network and eliminating redundant computations using the computation reuse concept. In this paper, we present matching-based services offloading schemes for compute-less IoT networks. We adopt the matching theory to match service offloading to the appropriate edge server(s). Specifically, we design, WHISTLE, a vertical many-to-many offloading scheme that aims to offload the most invoked and highly reusable services to the appropriate edge servers. We further extend WHISTLE to provide horizontal one-to-many computation reuse sharing among edge servers which leads to bouncing less computation back to the cloud. We evaluate the efficiency and effectiveness of WHISTLE with a real-world dataset. The obtained findings show that WHISTLE is able to accelerate the tasks completion time by 20%, reduce the computation up to 77%, and decrease the communication up to 71%. Theoretical analyses also prove the stability of the designed schemes. ",
    "url": "https://arxiv.org/abs/2201.04195",
    "authors": [
      "Boubakr Nour",
      "Soumaya Cherkaoui"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.04211",
    "title": "Achieving Differential Privacy with Matrix Masking in Big Data",
    "abstract": "Differential privacy schemes have been widely adopted in recent years to address issues of data privacy protection. We propose a new Gaussian scheme combining with another data protection technique, called random orthogonal matrix masking, to achieve $(\\varepsilon, \\delta)$-differential privacy (DP) more efficiently. We prove that the additional matrix masking significantly reduces the rate of noise variance required in the Gaussian scheme to achieve $(\\varepsilon, \\delta)-$DP in big data setting. Specifically, when $\\varepsilon \\to 0$, $\\delta \\to 0$, and the sample size $n$ exceeds the number $p$ of attributes by $\\frac{n}{p}=O(ln(1/\\delta))$, the required additive noise variance to achieve $(\\varepsilon, \\delta)$-DP is reduced from $O(ln(1/\\delta)/\\varepsilon^2)$ to $O(1/\\varepsilon)$. With much less noise added, the resulting differential privacy protected pseudo data sets allow much more accurate inferences, thus can significantly improve the scope of application for differential privacy. ",
    "url": "https://arxiv.org/abs/2201.04211",
    "authors": [
      "A. Adam Ding",
      "Samuel S. Wu",
      "Guanhong Miao",
      "Shigang Chen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2201.04217",
    "title": "Online Voltage Control for Unbalanced Distribution Networks Using  Projected Newton Method",
    "abstract": "This paper proposes an online voltage control strategy of distributed energy resources (DERs), based on the projected Newton method (PNM), for unbalanced distribution networks. The optimal Volt/VAr control (VVC) problem is formulated as an optimization program, with the goal of maintaining the voltage profile across the network by coordinating the VAr outputs of DERs. To overcome the slow convergence rate of conventional gradient-based methods, a PNM-based solution algorithm is developed to solve this VVC problem. It utilizes a non-diagonal symmetric positive definite matrix, developed from the Hessian matrix of the objective, to scale the gradient, and thus a fast convergence performance can be expected in this Newton-like algorithm. Moreover, taking advantage of the instantaneous feedback of voltage measurements, the online implementation of the PNM-based VVC is further designed to deal with fast system variations. In this online PNM-based VVC scheme, each bus agent communicates the instantaneous voltage measurements to the central agent, and the central agent communicates the VAr output commands of DERs back to each bus agent. The fast convergence performance of PNM results in a stronger capability to track the system variations in real time. Finally, numerical case studies are performed to validate the effectiveness, superiority, and scalability of the proposed method. ",
    "url": "https://arxiv.org/abs/2201.04217",
    "authors": [
      "Rui Cheng",
      "Zhaoyu Wang",
      "Yifei Guo",
      "Qianzhi Zhang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2201.04235",
    "title": "SmartDet: Context-Aware Dynamic Control of Edge Task Offloading for  Mobile Object Detection",
    "abstract": "Mobile devices increasingly rely on object detection (OD) through deep neural networks (DNNs) to perform critical tasks. Due to their high complexity, the execution of these DNNs requires excessive time and energy. Low-complexity object tracking (OT) can be used with OD, where the latter is periodically applied to generate \"fresh\" references for tracking. However, the frames processed with OD incur large delays, which may make the reference outdated and degrade tracking quality. Herein, we propose to use edge computing in this context, and establish parallel OT (at the mobile device) and OD (at the edge server) processes that are resilient to large OD latency. We propose Katch-Up, a novel tracking mechanism that improves the system resilience to excessive OD delay. However, while Katch-Up significantly improves performance, it also increases the computing load of the mobile device. Hence, we design SmartDet, a low-complexity controller based on deep reinforcement learning (DRL) that learns controlling the trade-off between resource utilization and OD performance. SmartDet takes as input context-related information related to the current video content and the current network conditions to optimize frequency and type of OD offloading, as well as Katch-Up utilization. We extensively evaluate SmartDet on a real-world testbed composed of a JetSon Nano as mobile device and a GTX 980 Ti as edge server, connected through a Wi-Fi link. Experimental results show that SmartDet achieves an optimal balance between tracking performance - mean Average Recall (mAR) and resource usage. With respect to a baseline with full Katch-Upusage and maximum channel usage, we still increase mAR by 4% while using 50% less of the channel and 30% power resources associated with Katch-Up. With respect to a fixed strategy using minimal resources, we increase mAR by 20% while using Katch-Up on 1/3 of the frames. ",
    "url": "https://arxiv.org/abs/2201.04235",
    "authors": [
      "Davide Callegaro",
      "Francesco Restuccia",
      "Marco Levorato"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.04241",
    "title": "Automatic Detection and Analysis of Technical Debts in Peer-Review  Documentation of R Packages",
    "abstract": "Technical debt (TD) is a metaphor for code-related problems that arise as a result of prioritizing speedy delivery over perfect code. Given that the reduction of TDs can have long-term positive impact in the software engineering life-cycle (SDLC), TDs are studied extensively in the literature. However, very few of the existing research focused on the technical debts of R programming language despite its popularity and usage. Recent research by Codabux et al. [21] finds that R packages can have 10 diverse TD types analyzing peer-review documentation. However, the findings are based on the manual analysis of a small sample of R package review comments. In this paper, we develop a suite of Machine Learning (ML) classifiers to detect the 10 TDs automatically. The best performing classifier is based on the deep ML model BERT, which achieves F1-scores of 0.71 - 0.91. We then apply the trained BERT models on all available peer-review issue comments from two platforms, rOpenSci and BioConductor (13.5K review comments coming from a total of 1297 R packages). We conduct an empirical study on the prevalence and evolution of 10 TDs in the two R platforms. We discovered documentation debt is the most prevalent among all types of TD, and it is also expanding rapidly. We also find that R packages of generic platform (i.e. rOpenSci) are more prone to TD compared to domain-specific platform (i.e. BioConductor). Our empirical study findings can guide future improvements opportunities in R package documentation. Our ML models can be used to automatically monitor the prevalence and evolution of TDs in R package documentation. ",
    "url": "https://arxiv.org/abs/2201.04241",
    "authors": [
      "Junaed Younus Khan",
      "Gias Uddin"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2201.04252",
    "title": "Generating Connected, Simple, and Realistic Cyber Graphs for Smart Grids",
    "abstract": "Smart grids integrate communication systems with power networks to enable power grids operation and command through real-time data collection and control signals. Designing, analyzing, and simulating smart grid infrastructures as well as predicting the impact of power network failures strongly depend on the topologies of the underlying power network and communication system. Despite the substantial impact that the communication systems bring to smart grid operation, the topology of communication systems employed in smart grids was less studied. The power community lacks realistic generative communication system models that can be calibrated to match real-world data. To address this issue, this paper proposes a framework to generate the underlying topological graphs for the communication systems deployed in smart grids by mimicking the topology of real-world smart grids. In this regard, we have updated the Chung-Lu algorithm to guarantee the communication network connectivity and to match the degree distribution of a real-world smart grid rather than following an expected degree distribution. In addition, key characteristics of communication systems such as diameter, average shortest paths, clustering coefficients, assortativity, and spectral gap were taken into consideration to generate the most similar real-world communication network for smart grid studies. We believe that the proposed algorithm to generate realistic cyber graphs for smart grid studies will benefit the power community. ",
    "url": "https://arxiv.org/abs/2201.04252",
    "authors": [
      "Osman Boyaci",
      "M. Rasoul Narimani",
      "Katherine Davis",
      "Erchin Serpedin"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2201.04259",
    "title": "Toward Experience-Driven Traffic Management and Orchestration in  Digital-Twin-Enabled 6G Networks",
    "abstract": "The envisioned 6G networks are expected to support extremely high data rates, low-latency, and radically new applications empowered by machine learning. The futuristic 6G networks require a novel framework that can be used to operate, manage, and optimize its underlying services such as ultra-reliable and low-latency communication, and Internet of everything. In recent years, artificial intelligence (AI) has demonstrated significant success in optimizing and designing networks. The AI-enabled traffic orchestration can dynamically organize different network architectures and slices to provide quality of experience considering the dynamic nature of the wireless communication network. In this paper, we propose a digital twin enabled network framework, empowered by AI to cater the variability and complexity of envisioned 6G networks, to provide smart resource management and intelligent service provisioning. Digital twin paves a way for achieving optimizing 6G services by creating a virtual representation of the 6G network along with its associated communication technologies (e.g., intelligent reflecting surfaces, terahertz and millimeter communication), computing systems (e.g., cloud computing and fog computing) with its associated algorithms (e.g., optimization and machine learning). We then discuss and review the existing AI-enabled traffic management and orchestration techniques and highlight future research directions and potential solutions in 6G networks. ",
    "url": "https://arxiv.org/abs/2201.04259",
    "authors": [
      "Muhammad Tariq",
      "Faisal Naeem",
      "H. Vincent Poor"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.04271",
    "title": "No Community Can Do Everything: Why People Participate in Similar Online  Communities",
    "abstract": "Large-scale quantitative analyses have shown that individuals frequently talk to each other about similar things in different online spaces. Why do these overlapping communities exist? We provide an answer grounded in the analysis of 20 interviews with active participants in clusters of highly related subreddits. Within a broad topical area, there are a diversity of benefits an online community can confer. These include (a) specific information and discussion, (b) socialization with similar others, and (c) attention from the largest possible audience. A single community cannot meet all three needs. Our findings suggest that topical areas within an online community platform tend to become populated by groups of specialized communities with diverse sizes, topical boundaries, and rules. Compared with any single community, such systems of overlapping communities are able to provide a greater range of benefits. ",
    "url": "https://arxiv.org/abs/2201.04271",
    "authors": [
      "Nathan TeBlunthuis",
      "Charles Kiene",
      "Isabella Brown",
      "Laura Alia Levi",
      "Nicole McGinnis",
      "Benjamin Mako Hill"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2201.04286",
    "title": "Evolutionary Action Selection for Gradient-based Policy Learning",
    "abstract": "Evolutionary Algorithms (EAs) and Deep Reinforcement Learning (DRL) have recently been combined to integrate the advantages of the two solutions for better policy learning. However, in existing hybrid methods, EA is used to directly train the policy network, which will lead to sample inefficiency and unpredictable impact on the policy performance. To better integrate these two approaches and avoid the drawbacks caused by the introduction of EA, we devote ourselves to devising a more efficient and reasonable method of combining EA and DRL. In this paper, we propose Evolutionary Action Selection-Twin Delayed Deep Deterministic Policy Gradient (EAS-TD3), a novel combination of EA and DRL. In EAS, we focus on optimizing the action chosen by the policy network and attempt to obtain high-quality actions to guide policy learning through an evolutionary algorithm. We conduct several experiments on challenging continuous control tasks. The result shows that EAS-TD3 shows superior performance over other state-of-art methods. ",
    "url": "https://arxiv.org/abs/2201.04286",
    "authors": [
      "Yan Ma",
      "Tianxing Liu",
      "Bingsheng Wei",
      "Yi Liu",
      "Kang Xu",
      "Wei Li"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.04292",
    "title": "Predicting Terrorist Attacks in the United States using Localized News  Data",
    "abstract": "Dozens of terrorist attacks are perpetrated in the United States every year, often causing fatalities and other significant damage. Toward the end of better understanding and mitigating these attacks, we present a set of machine learning models that learn from localized news data in order to predict whether a terrorist attack will occur on a given calendar date and in a given state. The best model--a Random Forest that learns from a novel variable-length moving average representation of the feature space--achieves area under the receiver operating characteristic scores $> .667$ on four of the five states that were impacted most by terrorism between 2015 and 2018. Our key findings include that modeling terrorism as a set of independent events, rather than as a continuous process, is a fruitful approach--especially when the events are sparse and dissimilar. Additionally, our results highlight the need for localized models that account for differences between locations. From a machine learning perspective, we found that the Random Forest model outperformed several deep models on our multimodal, noisy, and imbalanced data set, thus demonstrating the efficacy of our novel feature representation method in such a context. We also show that its predictions are relatively robust to time gaps between attacks and observed characteristics of the attacks. Finally, we analyze factors that limit model performance, which include a noisy feature space and small amount of available data. These contributions provide an important foundation for the use of machine learning in efforts against terrorism in the United States and beyond. ",
    "url": "https://arxiv.org/abs/2201.04292",
    "authors": [
      "Steven J. Krieg",
      "Christian W. Smith",
      "Rusha Chatterjee",
      "Nitesh V. Chawla"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.04309",
    "title": "Robust Contrastive Learning against Noisy Views",
    "abstract": "Contrastive learning relies on an assumption that positive pairs contain related views, e.g., patches of an image or co-occurring multimodal signals of a video, that share certain underlying information about an instance. But what if this assumption is violated? The literature suggests that contrastive learning produces suboptimal representations in the presence of noisy views, e.g., false positive pairs with no apparent shared information. In this work, we propose a new contrastive loss function that is robust against noisy views. We provide rigorous theoretical justifications by showing connections to robust symmetric losses for noisy binary classification and by establishing a new contrastive bound for mutual information maximization based on the Wasserstein distance measure. The proposed loss is completely modality-agnostic and a simple drop-in replacement for the InfoNCE loss, which makes it easy to apply to existing contrastive frameworks. We show that our approach provides consistent improvements over the state-of-the-art on image, video, and graph contrastive learning benchmarks that exhibit a variety of real-world noise patterns. ",
    "url": "https://arxiv.org/abs/2201.04309",
    "authors": [
      "Ching-Yao Chuang",
      "R Devon Hjelm",
      "Xin Wang",
      "Vibhav Vineet",
      "Neel Joshi",
      "Antonio Torralba",
      "Stefanie Jegelka",
      "Yale Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.04322",
    "title": "Gridiron: A Technique for Augmenting Cloud Workloads with Network  Bandwidth Requirements",
    "abstract": "Cloud applications use more than just server resources, they also require networking resources. We propose a new technique to model network bandwidth demand of networked cloud applications. Our technique, Gridiron, augments VM workload traces from Azure cloud with network bandwidth requirements. The key to the Gridiron technique is to derive inter-VM network bandwidth requirements using Amdahl's second law. As a case study, we use Gridiron to generate realistic traces with network bandwidth demands for a distributed machine learning training application. Workloads generated with Gridiron allow datacenter operators to estimate the network bandwidth demands of cloud applications and enable more realistic cloud resource scheduler evaluation. ",
    "url": "https://arxiv.org/abs/2201.04322",
    "authors": [
      "Nodir Kodirov",
      "Shane Bergsma",
      "Syed M. Iqbal",
      "Alan J. Hu",
      "Ivan Beschastnikh",
      "Margo Seltzer"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.04329",
    "title": "Neural Residual Flow Fields for Efficient Video Representations",
    "abstract": "Implicit neural representation (INR) has emerged as a powerful paradigm for representing signals, such as images, videos, 3D shapes, etc. Although it has shown the ability to represent fine details, its efficiency as a data representation has not been extensively studied. In INR, the data is stored in the form of parameters of a neural network and general purpose optimization algorithms do not generally exploit the spatial and temporal redundancy in signals. In this paper, we suggest a novel INR approach to representing and compressing videos by explicitly removing data redundancy. Instead of storing raw RGB colors, we propose Neural Residual Flow Fields (NRFF), using motion information across video frames and residuals that are necessary to reconstruct a video. Maintaining the motion information, which is usually smoother and less complex than the raw signals, requires far fewer parameters. Furthermore, reusing redundant pixel values further improves the network parameter efficiency. Experimental results have shown that the proposed method outperforms the baseline methods by a significant margin. The code is available in https://github.com/daniel03c1/eff_video_representation. ",
    "url": "https://arxiv.org/abs/2201.04329",
    "authors": [
      "Daniel Rho",
      "Junwoo Cho",
      "Jong Hwan Ko",
      "Eunbyung Park"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.04341",
    "title": "MDS-Net: A Multi-scale Depth Stratification Based Monocular 3D Object  Detection Algorithm",
    "abstract": "Monocular 3D object detection is very challenging in autonomous driving due to the lack of depth information. This paper proposes a one-stage monocular 3D object detection algorithm based on multi-scale depth stratification, which uses the anchor-free method to detect 3D objects in a per-pixel prediction. In the proposed MDS-Net, a novel depth-based stratification structure is developed to improve the network's ability of depth prediction by establishing mathematical models between depth and image size of objects. A new angle loss function is then developed to further improve the accuracy of the angle prediction and increase the convergence speed of training. An optimized soft-NMS is finally applied in the post-processing stage to adjust the confidence of candidate boxes. Experiments on the KITTI benchmark show that the MDS-Net outperforms the existing monocular 3D detection methods in 3D detection and BEV detection tasks while fulfilling real-time requirements. ",
    "url": "https://arxiv.org/abs/2201.04341",
    "authors": [
      "Zhouzhen Xie",
      "Yuying Song",
      "Jingxuan Wu",
      "Zecheng Li",
      "Chunyi Song",
      "Zhiwei Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.04342",
    "title": "Theoretical Limits of Joint Detection and Estimation for Radar Target",
    "abstract": "This paper proposes a joint detection and estimation (JDE) scheme based on mutual information for the radar work, whose goal is to choose the true one between target existent and target absence, and to estimate the unknown distance parameter when the target is existent. Inspired by the thoughts of Shannon information theory, the JDE system model is established in the presence of complex white Gaussian noise. We make several main contributions: (1) the equivalent JDE channel and the posterior probability density function are derived based on the priori statistical characteristic of the noise, target scattering and joint target parameter; (2) the performance of the JDE system is measured by the joint entropy deviation and the joint information that is defined as the mutual information between received signal and the joint target parameter; (3) the sampling a posterior probability and cascaded JDEers are proposed, and their performance is measured by the empirical joint entropy deviation the empirical joint information; (4) the joint theorem is proved that the joint information is the available limit of the overall performance, that is, the joint information is available, and the empirical joint information of any JDEer is no greater than the joint information; (5) the cascaded theorem is proved that the sum of empirical detection information and empirical estimation information can approximate the joint information, i.e., the performance limit of cascaded JDEer is available. Simulation results verify the correctness of the joint and the cascaded theorems, and show that the performance of the sampling a posterior probability JDEer is asymptotically optimal. Moreover, the performance of cascaded JDEer can approximate the system performance of JDE system. ",
    "url": "https://arxiv.org/abs/2201.04342",
    "authors": [
      "Nan Wang",
      "Dazhuan Xu"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2201.04344",
    "title": "Constrained In-network Computing with Low Congestion in Datacenter  Networks",
    "abstract": "Distributed computing has become a common practice nowadays, where the recent focus has been given to the usage of smart networking devices with in-network computing capabilities. State-of-the-art switches with near-line rate computing and aggregation capabilities enable acceleration and improved performance for various modern applications like big data analytics and large-scale distributed and federated machine learning. In this paper, we formulate and study the theoretical algorithmic foundations of such approaches, and focus on how to deploy and use constrained in-network computing capabilities within the data center. We focus our attention on reducing the network congestion, i.e., the most congested link in the network, while supporting the given workload(s). We present an efficient optimal algorithm for tree-like network topologies and show that our solution provides as much as an x13 improvement over common alternative approaches. In particular, our results show that having merely a small fraction of network devices that support in-network aggregation can significantly reduce the network congestion, both for single and multiple workloads. ",
    "url": "https://arxiv.org/abs/2201.04344",
    "authors": [
      "Raz Segal",
      "Chen Avin",
      "Gabriel Scalosub"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2201.04360",
    "title": "Efficient Modular Graph Transformation Rule Application",
    "abstract": "Graph transformation formalisms have proven to be suitable tools for the modelling of chemical reactions. They are well established in theoretical studies and increasingly also in practical applications in chemistry. The latter is made feasible via the development of programming frameworks which makes the formalisms executable. The application of such frameworks to large networks of chemical reactions, however, poses unique computational challenges. One such characteristic is the inherent combinatorial nature of the graphs involved. The graphs consist of many connected components, representing individual molecules. While the existing methods for implementing graph transformations can be applied to such graphs, the combinatorics of constructing graph matches quickly becomes a computational bottleneck as the size of the chemical reaction network grows. In this contribution, we develop a new method of enumerating graph transformation rule applications, designed to improve performance in these scenarios. The method is based on constructing graph matches component-wise, in an iterative fashion, allowing redundant applications to be detected early and pruned. We further extend the algorithm with an efficient heuristic, based on local symmetries of the graphs, which allow us to detect and discard isomorphic applications early. Finally, we conduct chemical network generation experiments on real-life as well as synthetic data and compare against state-of-the-art in the field. ",
    "url": "https://arxiv.org/abs/2201.04360",
    "authors": [
      "Jakob L. Andersen",
      "Rolf Fagerberg",
      "Juraj Kolčák",
      "Christophe V.F.P. Laurent",
      "Daniel Merkle",
      "Nikolai Nøjgaard"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2201.04361",
    "title": "Evolutionary Optimization for Proactive and Dynamic Computing Resource  Allocation in Open Radio Access Network",
    "abstract": "Intelligent techniques are urged to achieve automatic allocation of the computing resource in Open Radio Access Network (O-RAN), to save computing resource, increase utilization rate of them and decrease the delay. However, the existing problem formulation to solve this resource allocation problem is unsuitable as it defines the capacity utility of resource in an inappropriate way and tends to cause much delay. Moreover, the existing problem has only been attempted to be solved based on greedy search, which is not ideal as it could get stuck into local optima. Considering those, a new formulation that better describes the problem is proposed. In addition, as a well-known global search meta heuristic approach, an evolutionary algorithm (EA) is designed tailored for solving the new problem formulation, to find a resource allocation scheme to proactively and dynamically deploy the computing resource for processing upcoming traffic data. Experimental studies carried out on several real-world datasets and newly generated artificial datasets with more properties beyond the real-world datasets have demonstrated the significant superiority over a baseline greedy algorithm under different parameter settings. Moreover, experimental studies are taken to compare the proposed EA and two variants, to indicate the impact of different algorithm choices. ",
    "url": "https://arxiv.org/abs/2201.04361",
    "authors": [
      "Gan Ruan",
      "Leandro L. Minku",
      "Zhao Xu",
      "Xin Yao"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.04387",
    "title": "Maximizing Self-supervision from Thermal Image for Effective  Self-supervised Learning of Depth and Ego-motion",
    "abstract": "Recently, self-supervised learning of depth and ego-motion from thermal images shows strong robustness and reliability under challenging scenarios. However, the inherent thermal image properties such as weak contrast, blurry edges, and noise hinder to generate effective self-supervision from thermal images. Therefore, most research relies on additional self-supervision sources such as well-lit RGB images, generative models, and Lidar information. In this paper, we conduct an in-depth analysis of thermal image characteristics that degenerates self-supervision from thermal images. Based on the analysis, we propose an effective thermal image mapping method that significantly increases image information, such as overall structure, contrast, and details, while preserving temporal consistency. The proposed method shows outperformed depth and pose results than previous state-of-the-art networks without leveraging additional RGB guidance. ",
    "url": "https://arxiv.org/abs/2201.04387",
    "authors": [
      "Ukcheol Shin",
      "Kyunghyun Lee",
      "Byeong-Uk Lee",
      "In So Kweon"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.04399",
    "title": "RGRecSys: A Toolkit for Robustness Evaluation of Recommender Systems",
    "abstract": "Robust machine learning is an increasingly important topic that focuses on developing models resilient to various forms of imperfect data. Due to the pervasiveness of recommender systems in online technologies, researchers have carried out several robustness studies focusing on data sparsity and profile injection attacks. Instead, we propose a more holistic view of robustness for recommender systems that encompasses multiple dimensions - robustness with respect to sub-populations, transformations, distributional disparity, attack, and data sparsity. While there are several libraries that allow users to compare different recommender system models, there is no software library for comprehensive robustness evaluation of recommender system models under different scenarios. As our main contribution, we present a robustness evaluation toolkit, Robustness Gym for RecSys (RGRecSys -- https://www.github.com/salesforce/RGRecSys), that allows us to quickly and uniformly evaluate the robustness of recommender system models. ",
    "url": "https://arxiv.org/abs/2201.04399",
    "authors": [
      "Zohreh Ovaisi",
      "Shelby Heinecke",
      "Jia Li",
      "Yongfeng Zhang",
      "Elena Zheleva",
      "Caiming Xiong"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.04402",
    "title": "MoViDNN: A Mobile Platform for Evaluating Video Quality Enhancement with  Deep Neural Networks",
    "abstract": "Deep neural network (DNN) based approaches have been intensively studied to improve video quality thanks to their fast advancement in recent years. These approaches are designed mainly for desktop devices due to their high computational cost. However, with the increasing performance of mobile devices in recent years, it became possible to execute DNN based approaches in mobile devices. Despite having the required computational power, utilizing DNNs to improve the video quality for mobile devices is still an active research area. In this paper, we propose an open-source mobile platform, namely MoViDNN, to evaluate DNN based video quality enhancement methods, such as super-resolution, denoising, and deblocking. Our proposed platform can be used to evaluate the DNN based approaches both objectively and subjectively. For objective evaluation, we report common metrics such as execution time, PSNR, and SSIM. For subjective evaluation, Mean Score Opinion (MOS) is reported. The proposed platform is available publicly at https://github.com/cd-athena/MoViDNN ",
    "url": "https://arxiv.org/abs/2201.04402",
    "authors": [
      "Ekrem Çetinkaya",
      "Minh Nguyen",
      "Christian Timmerer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2201.04425",
    "title": "Jamming Detection for IR-UWB Ranging Technology in Autonomous UAV Swarms",
    "abstract": "Jamming is a form of the Denial of Service (J-DoS) attack. It is a significant threat that causes malfunction in Unmanned Aerial Vehicle systems, especially when used in hostile environments. The attackers mainly operate in the wireless communication environment by following a few preexisting scenarios. In this paper, we propose an idea for a Jamming detection mechanism. The mechanism utilizes the network parameters available to the system and some additional measures to distinguish between bad transmission quality and Jamming to avoid false positive alarms. After detecting a Jamming attack, appropriate countermeasures or mitigation techniques can be applied to keep the system safe. ",
    "url": "https://arxiv.org/abs/2201.04425",
    "authors": [
      "Pavlo Mykytyn",
      "Marcin Brzozowski",
      "Zoya Dyka",
      "Peter Langendoerfer"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2201.04437",
    "title": "Multi-task Joint Strategies of Self-supervised Representation Learning  on Biomedical Networks for Drug Discovery",
    "abstract": "Self-supervised representation learning (SSL) on biomedical networks provides new opportunities for drug discovery which is lack of available biological or clinic phenotype. However, how to effectively combine multiple SSL models is challenging and rarely explored. Therefore, we propose multi-task joint strategies of self-supervised representation learning on biomedical networks for drug discovery, named MSSL2drug. We design six basic SSL tasks that are inspired by various modality features including structures, semantics, and attributes in biomedical heterogeneous networks. In addition, fifteen combinations of multiple tasks are evaluated by a graph attention-based adversarial multi-task learning framework in two drug discovery scenarios. The results suggest two important findings. (1) The combinations of multimodal tasks achieve the best performance compared to other multi-task joint strategies. (2) The joint training of local and global SSL tasks yields higher performance than random task combinations. Therefore, we conjecture that the multimodal and local-global combination strategies can be regarded as a guideline for multi-task SSL to drug discovery. ",
    "url": "https://arxiv.org/abs/2201.04437",
    "authors": [
      "Xiaoqi Wang",
      "Yingjie Cheng",
      "Yaning Yang",
      "Fei Li",
      "Shaoliang Peng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2201.04452",
    "title": "Machine-learning-aided Massive Hybrid Analog and Digital MIMO DOA  Estimation for Future Wireless Networks",
    "abstract": "Due to a high spatial angle resolution and low circuit cost of massive hybrid analog and digital (HAD) multiple-input multiple-output (MIMO), it is viewed as a key technology for future wireless networks. Combining a massive HAD-MIMO with direction of arrinal (DOA) will provide a high-precision even ultra-high-precision DOA measurement performance approaching the fully-digital (FD) MIMO. However, phase ambiguity is a challenge issue for a massive HAD-MIMO DOA estimation. In this paper, we review three aspects: detection, estimation, and Cramer-Rao lower bound (CRLB) with low-resolution ADCs at receiver. First, a multi-layer-neural-network (MLNN) detector is proposed to infer the existence of passive emitters. Then, a two-layer HAD (TLHAD) MIMO structure is proposed to eliminate phase ambiguity using only one-snapshot. Simulation results show that the proposed MLNN detector is much better than both the existing generalized likelihood ratio test (GRLT) and the ratio of maximum eigen-value (Max-EV) to minimum eigen-value (R-MaxEV-MinEV) in terms of detection probability. Additionally, the proposed TLHAD structure can achieve the corresponding CRLB using single snapshot. ",
    "url": "https://arxiv.org/abs/2201.04452",
    "authors": [
      "Feng Shu",
      "Xichao Zhan",
      "Wenlong Cai",
      "Mengxing Huang",
      "Qijuan Jie",
      "Yifang Li",
      "Baihua Shi",
      "Jiangzhou Wang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2201.04515",
    "title": "Characterizing Catalytic Mechanisms with Overlay Graphs",
    "abstract": "Understanding the underlying chemistry of a catalytic process is essential for advancing of its medical and industrial applications. A well defined and compact representation of a catalytic process is becoming exceedingly valuable in face of the growth in computer assisted development strategies. A step-wise partition of a catalytic process is traditional in organic chemistry. We argue, however, that such a description remains incomplete, especially in face of automation and formal methods. In this contribution-based on enzymatic reaction mechanisms-we fully formalize the step-wise notion of a catalytic process within the mathematical framework of graph transformation, and propose a concise representation as an overlay graph (OG). We formally define this concept in a dual form as an OG itself and an overlay rule. The former representing a static summary of the process, and the latter being an executable in the graph transformation formalism. We demonstrate that OGs readily expose the underlying chemistry and facilitate the interpretation of catalytic processes. The emergence of electron flow patterns, for instance, provides an excellent stage for classification efforts. We further show how the executable overlay rules can be employed to automatically assign a fully specified mechanism to a reaction with only an overall description, i.e. educt and product molecules. ",
    "url": "https://arxiv.org/abs/2201.04515",
    "authors": [
      "Jakob L. Andersen",
      "Rolf Fagerberg",
      "Christoph Flamm",
      "Walter Fontana",
      "Juraj Kolčák",
      "Christophe V.F.P. Laurent",
      "Daniel Merkle",
      "Nikolai Nøjgaard"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Chemical Physics (physics.chem-ph)",
      "Molecular Networks (q-bio.MN)"
    ]
  },
  {
    "id": "arXiv:2201.04517",
    "title": "Majorization-type cluster robust bounds for block filters and  eigensolvers",
    "abstract": "Convergence analysis of block iterative solvers for Hermitian eigenvalue problems and the closely related research on properties of matrix-based signal filters are challenging, and attract increasing attention due to their recent applications in spectral data clustering and graph-based signal processing. We combine majorization-based techniques pioneered for investigating the Rayleigh-Ritz method in [SIAM J. Matrix Anal. Appl., 31 (2010), pp. 1521-1537] with tools of classical analysis of the block power method by Rutishauser [Numer. Math., 13 (1969), pp. 4-13] to derive convergence rate bounds of an abstract block iteration, wherein tuples of tangents of principal angles or relative errors of Ritz values are bounded using majorization in terms of arranged partial sums and tuples of convergence factors. Our novel bounds are robust in presence of clusters of eigenvalues, improve some previous results, and are applicable to most known block iterative solvers and matrix-based filters, e.g., to block power, Chebyshev, and Lanczos methods combined with shift-and-invert approaches and polynomial filtering. ",
    "url": "https://arxiv.org/abs/2201.04517",
    "authors": [
      "M. Zhou",
      "M.E. Argentati",
      "A.V. Knyazev",
      "K. Neymeyr"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2201.04532",
    "title": "Structure and position-aware graph neural network for airway labeling",
    "abstract": "We present a novel graph-based approach for labeling the anatomical branches of a given airway tree segmentation. The proposed method formulates airway labeling as a branch classification problem in the airway tree graph, where branch features are extracted using convolutional neural networks (CNN) and enriched using graph neural networks. Our graph neural network is structure-aware by having each node aggregate information from its local neighbors and position-aware by encoding node positions in the graph. We evaluated the proposed method on 220 airway trees from subjects with various severity stages of Chronic Obstructive Pulmonary Disease (COPD). The results demonstrate that our approach is computationally efficient and significantly improves branch classification performance than the baseline method. The overall average accuracy of our method reaches 91.18\\% for labeling all 18 segmental airway branches, compared to 83.83\\% obtained by the standard CNN method. We published our source code at https://github.com/DIAGNijmegen/spgnn. The proposed algorithm is also publicly available at https://grand-challenge.org/algorithms/airway-anatomical-labeling/. ",
    "url": "https://arxiv.org/abs/2201.04532",
    "authors": [
      "Weiyi Xie",
      "Colin Jacobs",
      "Jean-Paul Charbonnier",
      "Bram van Ginneken"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.04557",
    "title": "Federated AirNet: Hybrid Digital-Analog Neural Network Transmission for  Federated Learning",
    "abstract": "A key issue in federated learning over wireless channels is how to exchange a large number of the model parameters via time-varying channels. Two types of solutions based on digital and analog schemes are used typically. The digital-based solution takes quantization and entropy coding for compression, whereas transmissions via wireless channels may cause catastrophic errors owing to the all-or-nothing behavior in entropy coding. The analog-based solutions such as AirNet and AirComp use analog modulation for the parameter transmissions. However, such an analog scheme often causes significant distortion due to the source signal's large power without compression gain. This paper proposes a novel hybrid digital-analog transmission-Federated AirNet--for the model parameter transmissions in federated learning. The Federated AirNet integrates low-rate digital coding and energy-compact analog modulation. The digital coding offers the baseline of the model parameters and compacts the source signal power. In addition, the residual parameters, which are obtained from the original and encoded model parameters, are analog-modulated to enhance the baseline according to the instantaneous wireless channel quality. We show that the proposed Federated AirNet yields better image classification accuracy compared with the digital-based and analog-based solutions over a wide range of wireless channel signal-to-noise ratios (SNRs). ",
    "url": "https://arxiv.org/abs/2201.04557",
    "authors": [
      "Takuya Fujihashi",
      "Toshiaki Koike-Akino",
      "Takashi Watanabe"
    ],
    "subjectives": [
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2201.04562",
    "title": "Reduced Softmax Unit for Deep Neural Network Accelerators",
    "abstract": "The Softmax activation layer is a very popular Deep Neural Network (DNN) component when dealing with multi-class prediction problems. However, in DNN accelerator implementations it creates additional complexities due to the need for computation of the exponential for each of its inputs. In this brief we propose a simplified version of the activation unit for accelerators, where only a comparator unit produces the classification result, by choosing the maximum among its inputs. Due to the nature of the activation function, we show that this result is always identical to the classification produced by the Softmax layer. ",
    "url": "https://arxiv.org/abs/2201.04562",
    "authors": [
      "Raghuram S"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2201.04563",
    "title": "Inexact Graph Matching Using Centrality Measures",
    "abstract": "Graph matching is the process of computing the similarity between two graphs. Depending on the requirement, it can be exact or inexact. Exact graph matching requires a strict correspondence between nodes of two graphs, whereas inexact matching allows some flexibility or tolerance during the graph matching. In this chapter, we describe an approximate inexact graph matching by reducing the size of the graphs using different centrality measures. Experimental evaluation shows that it can reduce running time for inexact graph matching. ",
    "url": "https://arxiv.org/abs/2201.04563",
    "authors": [
      "Shri Prakash Dwivedi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2201.04569",
    "title": "Get your Foes Fooled: Proximal Gradient Split Learning for Defense  against Model Inversion Attacks on IoMT data",
    "abstract": "The past decade has seen a rapid adoption of Artificial Intelligence (AI), specifically the deep learning networks, in Internet of Medical Things (IoMT) ecosystem. However, it has been shown recently that the deep learning networks can be exploited by adversarial attacks that not only make IoMT vulnerable to the data theft but also to the manipulation of medical diagnosis. The existing studies consider adding noise to the raw IoMT data or model parameters which not only reduces the overall performance concerning medical inferences but also is ineffective to the likes of deep leakage from gradients method. In this work, we propose proximal gradient split learning (PSGL) method for defense against the model inversion attacks. The proposed method intentionally attacks the IoMT data when undergoing the deep neural network training process at client side. We propose the use of proximal gradient method to recover gradient maps and a decision-level fusion strategy to improve the recognition performance. Extensive analysis show that the PGSL not only provides effective defense mechanism against the model inversion attacks but also helps in improving the recognition performance on publicly available datasets. We report 17.9$\\%$ and 36.9$\\%$ gains in accuracy over reconstructed and adversarial attacked images, respectively. ",
    "url": "https://arxiv.org/abs/2201.04569",
    "authors": [
      "Sunder Ali Khowaja",
      "Ik Hyun Lee",
      "Kapal Dev",
      "Muhammad Aslam Jarwar",
      "Nawab Muhammad Faseeh Qureshi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.04572",
    "title": "Transmission Scheme, Detection and Power Allocation for Uplink User  Cooperation with NOMA and RSMA",
    "abstract": "In this paper, we propose two novel cooperative-non-orthogonal-multiple-access (C-NOMA) and cooperative-rate-splitting-multiple-access (C-RSMA) schemes for uplink user cooperation. At the first mini-slot of these schemes, each user transmits its signal and receives the transmitted signal of the other user in full-duplex mode, and at the second mini-slot, each user relays the other user's message with amplify-and-forward (AF) protocol. At both schemes, to achieve better spectral efficiency, users transmit signals in the non-orthogonal mode in both mini-slots. In C-RSMA, we also apply the rate-splitting method in which the message of each user is divided into two streams. In the proposed detection schemes for C-NOMA and C-RSMA, we apply a combination of maximum-ratio-combining (MRC) and successive-interference-cancellation (SIC). Then, we derive the achievable rates for C-NOMA and C-RSMA, and formulate two optimization problems to maximize the minimum rate of two users by considering the proportional fairness coefficient. We propose two power allocation algorithms based on successive-convex-approximation (SCA) and geometric-programming (GP) to solve these non-convex problems. Next, we derive the asymptotic outage probability of the proposed C-NOMA and C-RSMA schemes, and prove that they achieve diversity order of two. Finally, the above-mentioned performance is confirmed by simulations. ",
    "url": "https://arxiv.org/abs/2201.04572",
    "authors": [
      "Omid Abbasi",
      "Halim Yanikomeroglu"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.04581",
    "title": "Sound Dr -- A database of Respiratory Sound and Baseline System for  COVID-19 Detection",
    "abstract": "As the COVID-19 pandemic significantly affect every aspects of human life, it is urgent to provide a data for further researches. We, therefore, introduce a dataset named Sound Dr Database which provides not only quality sounds of coughing and breathing but also metadata for relevant-respiratory illness or diseases. Creating proof-of-concept systems is effective for the detection of abnormalities in the respiratory sounds of patients. These solutions will serve as effective tools to assist physicians in diagnosing respiratory disorders. ",
    "url": "https://arxiv.org/abs/2201.04581",
    "authors": [
      "Hoang Van Truong",
      "Nguyen Thi Anh Sinh",
      "Nguyen Quoc Cuong",
      "Nguyen Xuan Phong"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2201.04604",
    "title": "Fine-grained Graph Learning for Multi-view Subspace Clustering",
    "abstract": "Multi-view subspace clustering has conventionally focused on integrating heterogeneous feature descriptions to capture higher-dimensional information. One popular strategy is to generate a common subspace from different views and then apply graph-based approaches to deal with clustering. However, the performance of these methods is still subject to two limitations, namely the multiple views fusion pattern and the connection between the fusion process and clustering tasks. To address these problems, we propose a novel multi-view subspace clustering framework via fine-grained graph learning, which can tell the consistency of local structures between different views and integrate all views more delicately than previous weight regularizations. Different from other models in the literature, the point-level graph regularization and the reformulation of spectral clustering are introduced to perform graphs fusion and learn the shared cluster structure together. Extensive experiments on five real-world datasets show that the proposed framework has comparable performance to the SOTA algorithms. ",
    "url": "https://arxiv.org/abs/2201.04604",
    "authors": [
      "Yidi Wang",
      "Xiaobing Pei",
      "Haoxi Zhan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.04610",
    "title": "Too Afraid to Drive: Systematic Discovery of Semantic DoS Vulnerability  in Autonomous Driving Planning under Physical-World Attacks",
    "abstract": "In high-level Autonomous Driving (AD) systems, behavioral planning is in charge of making high-level driving decisions such as cruising and stopping, and thus highly securitycritical. In this work, we perform the first systematic study of semantic security vulnerabilities specific to overly-conservative AD behavioral planning behaviors, i.e., those that can cause failed or significantly-degraded mission performance, which can be critical for AD services such as robo-taxi/delivery. We call them semantic Denial-of-Service (DoS) vulnerabilities, which we envision to be most generally exposed in practical AD systems due to the tendency for conservativeness to avoid safety incidents. To achieve high practicality and realism, we assume that the attacker can only introduce seemingly-benign external physical objects to the driving environment, e.g., off-road dumped cardboard boxes. To systematically discover such vulnerabilities, we design PlanFuzz, a novel dynamic testing approach that addresses various problem-specific design challenges. Specifically, we propose and identify planning invariants as novel testing oracles, and design new input generation to systematically enforce problemspecific constraints for attacker-introduced physical objects. We also design a novel behavioral planning vulnerability distance metric to effectively guide the discovery. We evaluate PlanFuzz on 3 planning implementations from practical open-source AD systems, and find that it can effectively discover 9 previouslyunknown semantic DoS vulnerabilities without false positives. We find all our new designs necessary, as without each design, statistically significant performance drops are generally observed. We further perform exploitation case studies using simulation and real-vehicle traces. We discuss root causes and potential fixes. ",
    "url": "https://arxiv.org/abs/2201.04610",
    "authors": [
      "Ziwen Wan",
      "Junjie Shen",
      "Jalen Chuang",
      "Xin Xia",
      "Joshua Garcia",
      "Jiaqi Ma",
      "Qi Alfred Chen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2201.04086",
    "title": "Application of Common Spatial Patterns in Gravitational Waves Detection",
    "abstract": "Common Spatial Patterns (CSP) is a feature extraction algorithm widely used in Brain-Computer Interface (BCI) Systems for detecting Event-Related Potentials (ERPs) in multi-channel magneto/electroencephalography (MEG/EEG) time series data. In this article, we develop and apply a CSP algorithm to the problem of identifying whether a given epoch of multi-detector Gravitational Wave (GW) strains contains coalescenses. Paired with Signal Processing techniques and a Logistic Regression classifier, we find that our pipeline is correctly able to detect 76 out of 82 confident events from Gravitational Wave Transient Catalog, using H1 and L1 strains, with a classification score of $93.72 \\pm 0.04\\%$ using $10 \\times 5$ cross validation. The false negative events were: GW170817-v3, GW191219 163120-v1, GW200115 042309-v2, GW200210 092254-v1, GW200220 061928-v1, and GW200322 091133-v1. ",
    "url": "https://arxiv.org/abs/2201.04086",
    "authors": [
      "Damodar Dahal"
    ],
    "subjectives": [
      "General Relativity and Quantum Cosmology (gr-qc)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2201.04138",
    "title": "Overview of the HECKTOR Challenge at MICCAI 2021: Automatic Head and  Neck Tumor Segmentation and Outcome Prediction in PET/CT Images",
    "abstract": "This paper presents an overview of the second edition of the HEad and neCK TumOR (HECKTOR) challenge, organized as a satellite event of the 24th International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI) 2021. The challenge is composed of three tasks related to the automatic analysis of PET/CT images for patients with Head and Neck cancer (H&N), focusing on the oropharynx region. Task 1 is the automatic segmentation of H&N primary Gross Tumor Volume (GTVt) in FDG-PET/CT images. Task 2 is the automatic prediction of Progression Free Survival (PFS) from the same FDG-PET/CT. Finally, Task 3 is the same as Task 2 with ground truth GTVt annotations provided to the participants. The data were collected from six centers for a total of 325 images, split into 224 training and 101 testing cases. The interest in the challenge was highlighted by the important participation with 103 registered teams and 448 result submissions. The best methods obtained a Dice Similarity Coefficient (DSC) of 0.7591 in the first task, and a Concordance index (C-index) of 0.7196 and 0.6978 in Tasks 2 and 3, respectively. In all tasks, simplicity of the approach was found to be key to ensure generalization performance. The comparison of the PFS prediction performance in Tasks 2 and 3 suggests that providing the GTVt contour was not crucial to achieve best results, which indicates that fully automatic methods can be used. This potentially obviates the need for GTVt contouring, opening avenues for reproducible and large scale radiomics studies including thousands potential subjects. ",
    "url": "https://arxiv.org/abs/2201.04138",
    "authors": [
      "Vincent Andrearczyk",
      "Valentin Oreiller",
      "Sarah Boughdad",
      "Catherine Chez Le Rest",
      "Hesham Elhalawani",
      "Mario Jreige",
      "John O. Prior",
      "Martin Vallières",
      "Dimitris Visvikis",
      "Mathieu Hatt",
      "Adrien Depeursinge"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.04318",
    "title": "Knee Cartilage Defect Assessment by Graph Representation and Surface  Convolution",
    "abstract": "Knee osteoarthritis (OA) is the most common osteoarthritis and a leading cause of disability. Cartilage defects are regarded as major manifestations of knee OA, which are visible by magnetic resonance imaging (MRI). Thus early detection and assessment for knee cartilage defects are important for protecting patients from knee OA. In this way, many attempts have been made on knee cartilage defect assessment by applying convolutional neural networks (CNNs) to knee MRI. However, the physiologic characteristics of the cartilage may hinder such efforts: the cartilage is a thin curved layer, implying that only a small portion of voxels in knee MRI can contribute to the cartilage defect assessment; heterogeneous scanning protocols further challenge the feasibility of the CNNs in clinical practice; the CNN-based knee cartilage evaluation results lack interpretability. To address these challenges, we model the cartilages structure and appearance from knee MRI into a graph representation, which is capable of handling highly diverse clinical data. Then, guided by the cartilage graph representation, we design a non-Euclidean deep learning network with the self-attention mechanism, to extract cartilage features in the local and global, and to derive the final assessment with a visualized result. Our comprehensive experiments show that the proposed method yields superior performance in knee cartilage defect assessment, plus its convenient 3D visualization for interpretability. ",
    "url": "https://arxiv.org/abs/2201.04318",
    "authors": [
      "Zixu Zhuang",
      "Liping Si",
      "Sheng Wang",
      "Kai Xuan",
      "Xi Ouyang",
      "Yiqiang Zhan",
      "Zhong Xue",
      "Lichi Zhang",
      "Dinggang Shen",
      "Weiwu Yao",
      "Qian Wang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.04397",
    "title": "Towards Adversarially Robust Deep Image Denoising",
    "abstract": "This work systematically investigates the adversarial robustness of deep image denoisers (DIDs), i.e, how well DIDs can recover the ground truth from noisy observations degraded by adversarial perturbations. Firstly, to evaluate DIDs' robustness, we propose a novel adversarial attack, namely Observation-based Zero-mean Attack ({\\sc ObsAtk}), to craft adversarial zero-mean perturbations on given noisy images. We find that existing DIDs are vulnerable to the adversarial noise generated by {\\sc ObsAtk}. Secondly, to robustify DIDs, we propose an adversarial training strategy, hybrid adversarial training ({\\sc HAT}), that jointly trains DIDs with adversarial and non-adversarial noisy data to ensure that the reconstruction quality is high and the denoisers around non-adversarial data are locally smooth. The resultant DIDs can effectively remove various types of synthetic and adversarial noise. We also uncover that the robustness of DIDs benefits their generalization capability on unseen real-world noise. Indeed, {\\sc HAT}-trained DIDs can recover high-quality clean images from real-world noise even without training on real noisy data. Extensive experiments on benchmark datasets, including Set68, PolyU, and SIDD, corroborate the effectiveness of {\\sc ObsAtk} and {\\sc HAT}. ",
    "url": "https://arxiv.org/abs/2201.04397",
    "authors": [
      "Hanshu Yan",
      "Jingfeng Zhang",
      "Jiashi Feng",
      "Masashi Sugiyama",
      "Vincent Y. F. Tan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.04416",
    "title": "Optimizing Prediction of MGMT Promoter Methylation from MRI Scans using  Adversarial Learning",
    "abstract": "Glioblastoma Multiforme (GBM) is a malignant brain cancer forming around 48% of al brain and Central Nervous System (CNS) cancers. It is estimated that annually over 13,000 deaths occur in the US due to GBM, making it crucial to have early diagnosis systems that can lead to predictable and effective treatment. The most common treatment after GBM diagnosis is chemotherapy, which works by sending rapidly dividing cells to apoptosis. However, this form of treatment is not effective when the MGMT promoter sequence is methylated, and instead leads to severe side effects decreasing patient survivability. Therefore, it is important to be able to identify the MGMT promoter methylation status through non-invasive magnetic resonance imaging (MRI) based machine learning (ML) models. This is accomplished using the Brain Tumor Segmentation (BraTS) 2021 dataset, which was recently used for an international Kaggle competition. We developed four primary models - two radiomic models and two CNN models - each solving the binary classification task with progressive improvements. We built a novel ML model termed as the Intermediate State Generator which was used to normalize the slice thicknesses of all MRI scans. With further improvements, our best model was able to achieve performance significantly ($p < 0.05$) better than the best performing Kaggle model with a 6% increase in average cross-validation accuracy. This improvement could potentially lead to a more informed choice of chemotherapy as a treatment option, prolonging lives of thousands of patients with GBM each year. ",
    "url": "https://arxiv.org/abs/2201.04416",
    "authors": [
      "Sauman Das"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.04543",
    "title": "Eigenvalue Distribution of Large Random Matrices Arising in Deep Neural  Networks: Orthogonal Case",
    "abstract": "The paper deals with the distribution of singular values of the input-output Jacobian of deep untrained neural networks in the limit of their infinite width. The Jacobian is the product of random matrices where the independent rectangular weight matrices alternate with diagonal matrices whose entries depend on the corresponding column of the nearest neighbor weight matrix. The problem was considered in \\cite{Pe-Co:18} for the Gaussian weights and biases and also for the weights that are Haar distributed orthogonal matrices and Gaussian biases. Basing on a free probability argument, it was claimed that in these cases the singular value distribution of the Jacobian in the limit of infinite width (matrix size) coincides with that of the analog of the Jacobian with special random but weight independent diagonal matrices, the case well known in random matrix theory. The claim was rigorously proved in \\cite{Pa-Sl:21} for a quite general class of weights and biases with i.i.d. (including Gaussian) entries by using a version of the techniques of random matrix theory. In this paper we use another version of the techniques to justify the claim for random Haar distributed weight matrices and Gaussian biases. ",
    "url": "https://arxiv.org/abs/2201.04543",
    "authors": [
      "Leonid Pastur"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2201.04545",
    "title": "On generalization bounds for deep networks based on loss surface  implicit regularization",
    "abstract": "The classical statistical learning theory says that fitting too many parameters leads to overfitting and poor performance. That modern deep neural networks generalize well despite a large number of parameters contradicts this finding and constitutes a major unsolved problem towards explaining the success of deep learning. The implicit regularization induced by stochastic gradient descent (SGD) has been regarded to be important, but its specific principle is still unknown. In this work, we study how the local geometry of the energy landscape around local minima affects the statistical properties of SGD with Gaussian gradient noise. We argue that under reasonable assumptions, the local geometry forces SGD to stay close to a low dimensional subspace and that this induces implicit regularization and results in tighter bounds on the generalization error for deep neural networks. To derive generalization error bounds for neural networks, we first introduce a notion of stagnation sets around the local minima and impose a local essential convexity property of the population risk. Under these conditions, lower bounds for SGD to remain in these stagnation sets are derived. If stagnation occurs, we derive a bound on the generalization error of deep neural networks involving the spectral norms of the weight matrices but not the number of network parameters. Technically, our proofs are based on controlling the change of parameter values in the SGD iterates and local uniform convergence of the empirical loss functions based on the entropy of suitable neighborhoods around local minima. Our work attempts to better connect non-convex optimization and generalization analysis with uniform convergence. ",
    "url": "https://arxiv.org/abs/2201.04545",
    "authors": [
      "Masaaki Imaizumi",
      "Johannes Schmidt-Hieber"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.04565",
    "title": "ImageMech: From image to particle spring network for mechanical  characterization",
    "abstract": "The emerging demand for advanced structural and biological materials calls for novel modeling tools that can rapidly yield high-fidelity estimation on materials properties in design cycles. Lattice spring model (LSM), a coarse-grained particle spring network, has gained attention in recent years for predicting the mechanical properties and giving insights into the fracture mechanism with high reproducibility and generalizability. However, to simulate the materials in sufficient detail for guaranteed numerical stability and convergence, most of the time a large number of particles are needed, greatly diminishing the potential for high-throughput computation and therewith data generation for machine learning frameworks. Here, we implement CuLSM, a GPU-accelerated CUDA C++ code realizing parallelism over the spring list instead of the commonly used spatial decomposition, which requires intermittent updates on the particle neighbor list. Along with the image-to-particle conversion tool Img2Particle, our toolkit offers a fast and flexible platform to characterize the elastic and fracture behaviors of materials, expediting the design process between additive manufacturing and computer-aided design. With the growing demand for new lightweight, adaptable, and multi-functional materials and structures, such tailored and optimized modeling platform has profound impacts, enabling faster exploration in design spaces, better quality control for 3D printing by digital twin techniques, and larger data generation pipelines for image-based generative machine learning models. ",
    "url": "https://arxiv.org/abs/2201.04565",
    "authors": [
      "Yuan Chiang",
      "Ting-Wai Chiu",
      "Shu-Wei Chang"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2201.04584",
    "title": "ECONet: Efficient Convolutional Online Likelihood Network for  Scribble-based Interactive Segmentation",
    "abstract": "Automatic segmentation of lung lesions associated with COVID-19 in CT images requires large amount of annotated volumes. Annotations mandate expert knowledge and are time-intensive to obtain through fully manual segmentation methods. Additionally, lung lesions have large inter-patient variations, with some pathologies having similar visual appearance as healthy lung tissues. This poses a challenge when applying existing semi-automatic interactive segmentation techniques for data labelling. To address these challenges, we propose an efficient convolutional neural networks (CNNs) that can be learned online while the annotator provides scribble-based interaction. To accelerate learning from only the samples labelled through user-interactions, a patch-based approach is used for training the network. Moreover, we use weighted cross-entropy loss to address the class imbalance that may result from user-interactions. During online inference, the learned network is applied to the whole input volume using a fully convolutional approach. We compare our proposed method with state-of-the-art and show that it outperforms existing methods on the task of annotating lung lesions associated with COVID-19, achieving 16% higher Dice score while reducing execution time by 3$\\times$ and requiring 9000 lesser scribbles-based labelled voxels. Due to the online learning aspect, our approach adapts quickly to user input, resulting in high quality segmentation labels. Source code will be made available upon acceptance. ",
    "url": "https://arxiv.org/abs/2201.04584",
    "authors": [
      "Muhammad Asad",
      "Lucas Fidon",
      "Tom Vercauteren"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.04609",
    "title": "GraphVAMPNet, using graph neural networks and variational approach to  markov processes for dynamical modeling of biomolecules",
    "abstract": "Finding low dimensional representation of data from long-timescale trajectories of biomolecular processes such as protein-folding or ligand-receptor binding is of fundamental importance and kinetic models such as Markov modeling have proven useful in describing the kinetics of these systems. Recently, an unsupervised machine learning technique called VAMPNet was introduced to learn the low dimensional representation and linear dynamical model in an end-to-end manner. VAMPNet is based on variational approach to Markov processes (VAMP) and relies on neural networks to learn the coarse-grained dynamics. In this contribution, we combine VAMPNet and graph neural networks to generate an end-to-end framework to efficiently learn high-level dynamics and metastable states from the long-timescale molecular dynamics trajectories. This method bears the advantages of graph representation learning and uses graph message passing operations to generate an embedding for each datapoint which is used in the VAMPNet to generate a coarse-grained representation. This type of molecular representation results in a higher resolution and more interpretable Markov model than the standard VAMPNet enabling a more detailed kinetic study of the biomolecular processes. Our GraphVAMPNet approach is also enhanced with an attention mechanism to find the important residues for classification into different metastable states. ",
    "url": "https://arxiv.org/abs/2201.04609",
    "authors": [
      "Mahdi Ghorbani",
      "Samarjeet Prasad",
      "Jeffery B. Klauda",
      "Bernard R. Brooks"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Machine Learning (cs.LG)",
      "Chemical Physics (physics.chem-ph)"
    ]
  },
  {
    "id": "arXiv:1902.02598",
    "title": "Real-time malware process detection and automated process killing",
    "abstract": " Title: Real-time malware process detection and automated process killing ",
    "url": "https://arxiv.org/abs/1902.02598",
    "authors": [
      "Matilda Rhode",
      "Pete Burnap",
      "Adam Wedgbury"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2006.00693",
    "title": "Improving Disentangled Text Representation Learning with  Information-Theoretic Guidance",
    "abstract": " Comments: Accepted by the 58th Annual Meeting of the Association for Computational Linguistics (ACL2020) ",
    "url": "https://arxiv.org/abs/2006.00693",
    "authors": [
      "Pengyu Cheng",
      "Martin Renqiang Min",
      "Dinghan Shen",
      "Christopher Malon",
      "Yizhe Zhang",
      "Yitong Li",
      "Lawrence Carin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2010.07255",
    "title": "Robust path-following control design of heavy vehicles based on  multiobjective evolutionary optimization",
    "abstract": " Comments: 30 pages, 16 figures, manuscript accepted to Expert Systems with Applications ",
    "url": "https://arxiv.org/abs/2010.07255",
    "authors": [
      "Gustavo Alves Prudencio de Morais",
      "Lucas Barbosa Marcos",
      "Filipe Marques Barbosa",
      "Bruno Henrique Groenner Barbosa",
      "Marco Henrique Terra",
      "Valdir Grassi Jr"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2012.02334",
    "title": "Benchmarking Energy-Conserving Neural Networks for Learning Dynamics  from Data",
    "abstract": " Title: Benchmarking Energy-Conserving Neural Networks for Learning Dynamics  from Data ",
    "url": "https://arxiv.org/abs/2012.02334",
    "authors": [
      "Yaofeng Desmond Zhong",
      "Biswadip Dey",
      "Amit Chakraborty"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2012.11369",
    "title": "Flexible, Non-parametric Modeling Using Regularized Neural Networks",
    "abstract": " Title: Flexible, Non-parametric Modeling Using Regularized Neural Networks ",
    "url": "https://arxiv.org/abs/2012.11369",
    "authors": [
      "Oskar Allerbo",
      "Rebecka Jörnsten"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation (stat.CO)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2012.13095",
    "title": "MobileSal: Extremely Efficient RGB-D Salient Object Detection",
    "abstract": " Comments: Accepted in IEEE TPAMI, 11 pages, 11 tables, 5 figures ",
    "url": "https://arxiv.org/abs/2012.13095",
    "authors": [
      "Yu-Huan Wu",
      "Yun Liu",
      "Jun Xu",
      "Jia-Wang Bian",
      "Yu-Chao Gu",
      "Ming-Ming Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2102.02706",
    "title": "ProxyFAUG: Proximity-based Fingerprint Augmentation",
    "abstract": " Title: ProxyFAUG: Proximity-based Fingerprint Augmentation ",
    "url": "https://arxiv.org/abs/2102.02706",
    "authors": [
      "Grigorios G. Anagnostopoulos",
      "Alexandros Kalousis"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2102.09701",
    "title": "Center Smoothing: Certified Robustness for Networks with Structured  Outputs",
    "abstract": " Comments: Accepted to Neural Information Processing Systems (NeurIPS 2021) ",
    "url": "https://arxiv.org/abs/2102.09701",
    "authors": [
      "Aounon Kumar",
      "Tom Goldstein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2102.13177",
    "title": "Efficient and Interpretable Robot Manipulation with Graph Neural  Networks",
    "abstract": " Title: Efficient and Interpretable Robot Manipulation with Graph Neural  Networks ",
    "url": "https://arxiv.org/abs/2102.13177",
    "authors": [
      "Yixin Lin",
      "Austin S. Wang",
      "Eric Undersander",
      "Akshara Rai"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.00374",
    "title": "Skin3D: Detection and Longitudinal Tracking of Pigmented Skin Lesions in  3D Total-Body Textured Meshes",
    "abstract": " Comments: 11 pages, 8 figures; Zhao and Kawahara: joint first authors; Published in Medical Image Analysis (2021) ",
    "url": "https://arxiv.org/abs/2105.00374",
    "authors": [
      "Mengliu Zhao",
      "Jeremy Kawahara",
      "Kumar Abhishek",
      "Sajjad Shamanian",
      "Ghassan Hamarneh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.14573",
    "title": "Embedding Principle of Loss Landscape of Deep Neural Networks",
    "abstract": " Title: Embedding Principle of Loss Landscape of Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2105.14573",
    "authors": [
      "Yaoyu Zhang",
      "Zhongwang Zhang",
      "Tao Luo",
      "Zhi-Qin John Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.02254",
    "title": "State Estimation in Unobservable Power Systems via Graph Signal  Processing Tools",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication ",
    "url": "https://arxiv.org/abs/2106.02254",
    "authors": [
      "Lital Dabush",
      "Ariel Kroizer",
      "Tirza Routtenberg"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2106.02927",
    "title": "A Generalized Framework for Joint Dynamic Optimal RF Interface Setting  and Next-Hop Selection in IoT networks with Similar Requests",
    "abstract": " Title: A Generalized Framework for Joint Dynamic Optimal RF Interface Setting  and Next-Hop Selection in IoT networks with Similar Requests ",
    "url": "https://arxiv.org/abs/2106.02927",
    "authors": [
      "Monireh Allah Gholi Ghasri",
      "Ali Mohammad Afshin Hemmatyar"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2106.05087",
    "title": "Who Is the Strongest Enemy? Towards Optimal and Efficient Evasion  Attacks in Deep RL",
    "abstract": " Title: Who Is the Strongest Enemy? Towards Optimal and Efficient Evasion  Attacks in Deep RL ",
    "url": "https://arxiv.org/abs/2106.05087",
    "authors": [
      "Yanchao Sun",
      "Ruijie Zheng",
      "Yongyuan Liang",
      "Furong Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2106.11171",
    "title": "UniTTS: Residual Learning of Unified Embedding Space for Speech Style  Control",
    "abstract": " Comments: 20 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2106.11171",
    "authors": [
      "Minsu Kang",
      "Sungjae Kim",
      "Injung Kim"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2108.07368",
    "title": "CaraNet: Context Axial Reverse Attention Network for Segmentation of  Small Medical Objects",
    "abstract": " Comments: Accepted by SPIE Medical Imaging: Image Processing (oral presentation) ",
    "url": "https://arxiv.org/abs/2108.07368",
    "authors": [
      "Ange Lou",
      "Shuyue Guan",
      "Murray Loew"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2108.09015",
    "title": "Complete Traceability Multimedia Fingerprinting Codes Resistant to  Averaging Attack and Adversarial Noise with Optimal Rate",
    "abstract": " Title: Complete Traceability Multimedia Fingerprinting Codes Resistant to  Averaging Attack and Adversarial Noise with Optimal Rate ",
    "url": "https://arxiv.org/abs/2108.09015",
    "authors": [
      "Ilya Vorobyev"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2108.10422",
    "title": "An Empirical Assessment of Endpoint Security Systems Against Advanced  Persistent Threats Attack Vectors",
    "abstract": " Comments: This is the revised (and final) version of this https URL with more EDRs and proper classification of products into EDRs and EPPs ",
    "url": "https://arxiv.org/abs/2108.10422",
    "authors": [
      "George Karantzas",
      "Constantinos Patsakis"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2109.01879",
    "title": "Moving Object Detection for Event-based Vision using k-means Clustering",
    "abstract": " Comments: Nine pages, five figures, Published in 2021 IEEE 8th Uttar Pradesh Section International Conference on Electrical, Electronics and Computer Engineering (UPCON) ",
    "url": "https://arxiv.org/abs/2109.01879",
    "authors": [
      "Anindya Mondal",
      "Mayukhmali Das"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2109.02244",
    "title": "Self-supervised Product Quantization for Deep Unsupervised Image  Retrieval",
    "abstract": " Comments: ICCV 2021 ",
    "url": "https://arxiv.org/abs/2109.02244",
    "authors": [
      "Young Kyun Jang",
      "Nam Ik Cho"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.04269",
    "title": "Asynchronous Federated Learning on Heterogeneous Devices: A Survey",
    "abstract": " Title: Asynchronous Federated Learning on Heterogeneous Devices: A Survey ",
    "url": "https://arxiv.org/abs/2109.04269",
    "authors": [
      "Chenhao Xu",
      "Youyang Qu",
      "Yong Xiang",
      "Longxiang Gao"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2109.04374",
    "title": "IFBiD: Inference-Free Bias Detection",
    "abstract": " Comments: AAAI Workshop on Artificial Intelligence Safety (SafeAI) ",
    "url": "https://arxiv.org/abs/2109.04374",
    "authors": [
      "Ignacio Serna",
      "Aythami Morales",
      "Julian Fierrez",
      "Javier Ortega-Garcia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.06166",
    "title": "Game Theory for Adversarial Attacks and Defenses",
    "abstract": " Comments: With the agreement of my coauthors, I would like to withdraw the manuscript \"Game Theory for Adversarial Attacks and Defenses\". Some experimental procedures were not included in the manuscript, which makes a part of important claims not meaningful ",
    "url": "https://arxiv.org/abs/2110.06166",
    "authors": [
      "Shorya Sharma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2110.14875",
    "title": "Finding a Concise, Precise, and Exhaustive Set of Near Bi-Cliques in  Dynamic Graphs",
    "abstract": " Comments: To be published in WSDM 2022 ",
    "url": "https://arxiv.org/abs/2110.14875",
    "authors": [
      "Hyeonjeong Shin",
      "Taehyung Kwon",
      "Neil Shah",
      "Kijung Shin"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2111.09034",
    "title": "Using Convolutional Neural Networks to Detect Compression Algorithms",
    "abstract": " Comments: Pre-print Under Review ",
    "url": "https://arxiv.org/abs/2111.09034",
    "authors": [
      "Shubham Bharadwaj"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.10189",
    "title": "Analysis of autocorrelation times in Neural Markov Chain Monte Carlo  simulations",
    "abstract": " Comments: 23 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2111.10189",
    "authors": [
      "Piotr Białas",
      "Piotr Korcyl",
      "Tomasz Stebel"
    ],
    "subjectives": [
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Lattice (hep-lat)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.03163",
    "title": "Encouraging Disentangled and Convex Representation with Controllable  Interpolation Regularization",
    "abstract": " Comments: 14 pages, 15 figure (including appendix) ",
    "url": "https://arxiv.org/abs/2112.03163",
    "authors": [
      "Yunhao Ge",
      "Zhi Xu",
      "Yao Xiao",
      "Gan Xin",
      "Yunkui Pang",
      "Laurent Itti"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.04684",
    "title": "Trajectory-Constrained Deep Latent Visual Attention for Improved Local  Planning in Presence of Heterogeneous Terrain",
    "abstract": " Comments: Published in International Conference on Intelligent Robots and Systems (IROS) 2021 proceedings. Project website: this https URL ",
    "url": "https://arxiv.org/abs/2112.04684",
    "authors": [
      "Stefan Wapnick",
      "Travis Manderson",
      "David Meger",
      "Gregory Dudek"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.05883",
    "title": "Self-supervised Spatiotemporal Representation Learning by Exploiting  Video Continuity",
    "abstract": " Title: Self-supervised Spatiotemporal Representation Learning by Exploiting  Video Continuity ",
    "url": "https://arxiv.org/abs/2112.05883",
    "authors": [
      "Hanwen Liang",
      "Niamul Quader",
      "Zhixiang Chi",
      "Lizhe Chen",
      "Peng Dai",
      "Juwei Lu",
      "Yang Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.11088",
    "title": "EPNet++: Cascade Bi-directional Fusion for Multi-Modal 3D Object  Detection",
    "abstract": " Title: EPNet++: Cascade Bi-directional Fusion for Multi-Modal 3D Object  Detection ",
    "url": "https://arxiv.org/abs/2112.11088",
    "authors": [
      "Zhe Liu",
      "Tengteng Huang",
      "Bingling Li",
      "Xiwu Chen",
      "Xi Wang",
      "Xiang Bai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.00436",
    "title": "An Efficient and Accurate Rough Set for Feature Selection,  Classification and Knowledge Representation",
    "abstract": " Title: An Efficient and Accurate Rough Set for Feature Selection,  Classification and Knowledge Representation ",
    "url": "https://arxiv.org/abs/2201.00436",
    "authors": [
      "Shuyin Xia",
      "Xinyu Bai",
      "Guoyin Wang",
      "Deyu Meng",
      "Xinbo Gao",
      "Zizhong Chen",
      "Elisabeth Giem"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2201.03246",
    "title": "Vision in adverse weather: Augmentation using CycleGANs with various  object detectors for robust perception in autonomous racing",
    "abstract": " Comments: Corrected typos on page one ",
    "url": "https://arxiv.org/abs/2201.03246",
    "authors": [
      "Izzeddin Teeti",
      "Valentina Musat",
      "Salman Khan",
      "Alexander Rast",
      "Fabio Cuzzolin",
      "Andrew Bradley"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.03681",
    "title": "FairEdit: Preserving Fairness in Graph Neural Networks through Greedy  Graph Editing",
    "abstract": " Title: FairEdit: Preserving Fairness in Graph Neural Networks through Greedy  Graph Editing ",
    "url": "https://arxiv.org/abs/2201.03681",
    "authors": [
      "Donald Loveland",
      "Jiayi Pan",
      "Aaresh Farrokh Bhathena",
      "Yiyang Lu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03817",
    "title": "Tackling Multipath and Biased Training Data for IMU-Assisted BLE  Proximity Detection",
    "abstract": " Title: Tackling Multipath and Biased Training Data for IMU-Assisted BLE  Proximity Detection ",
    "url": "https://arxiv.org/abs/2201.03817",
    "authors": [
      "Tianlang He",
      "Jiajie Tan",
      "Weipeng Zhuo",
      "Maximilian Printz",
      "S.-H. Gary Chan"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2201.03943",
    "title": "Neural Architecture Search For LF-MMI Trained Time Delay Neural Networks",
    "abstract": " Comments: Submitted to TASLP. arXiv admin note: text overlap with arXiv:2007.08818 ",
    "url": "https://arxiv.org/abs/2201.03943",
    "authors": [
      "Shoukang Hu",
      "Xurong Xie",
      "Mingyu Cui",
      "Jiajun Deng",
      "Shansong Liu",
      "Jianwei Yu",
      "Mengzhe Geng",
      "Xunying Liu",
      "Helen Meng"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2201.04011",
    "title": "Similarity-based Gray-box Adversarial Attack Against Deep Face  Recognition",
    "abstract": " Comments: ACCEPTED in IEEE International Conference on Automatic Face and Gesture Recognition (FG 2021) ",
    "url": "https://arxiv.org/abs/2201.04011",
    "authors": [
      "Hanrui Wang",
      "Shuo Wang",
      "Zhe Jin",
      "Yandan Wang",
      "Cunjian Chen",
      "Massimo Tistarell"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]