[
  {
    "id": "arXiv:2306.03179",
    "title": "Fair Patient Model: Mitigating Bias in the Patient Representation  Learned from the Electronic Health Records",
    "abstract": "Objective: To pre-train fair and unbiased patient representations from Electronic Health Records (EHRs) using a novel weighted loss function that reduces bias and improves fairness in deep representation learning models. Methods: We defined a new loss function, called weighted loss function, in the deep representation learning model to balance the importance of different groups of patients and features. We applied the proposed model, called Fair Patient Model (FPM), to a sample of 34,739 patients from the MIMIC-III dataset and learned patient representations for four clinical outcome prediction tasks. Results: FPM outperformed the baseline models in terms of three fairness metrics: demographic parity, equality of opportunity difference, and equalized odds ratio. FPM also achieved comparable predictive performance with the baselines, with an average accuracy of 0.7912. Feature analysis revealed that FPM captured more information from clinical features than the baselines. Conclusion: FPM is a novel method to pre-train fair and unbiased patient representations from EHR data using a weighted loss function. The learned representations can be used for various downstream tasks in healthcare and can be extended to other domains where bias and fairness are important. ",
    "url": "https://arxiv.org/abs/2306.03179",
    "authors": [
      "Sonish Sivarajkumar",
      "Yufei Huang",
      "Yanshan Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2306.03203",
    "title": "A Static Evaluation of Code Completion by Large Language Models",
    "abstract": "Large language models trained on code have shown great potential to increase productivity of software developers. Several execution-based benchmarks have been proposed to evaluate functional correctness of model-generated code on simple programming problems. Nevertheless, it is expensive to perform the same evaluation on complex real-world projects considering the execution cost. On the contrary, static analysis tools such as linters, which can detect errors without running the program, haven't been well explored for evaluating code generation models. In this work, we propose a static evaluation framework to quantify static errors in Python code completions, by leveraging Abstract Syntax Trees. Compared with execution-based evaluation, our method is not only more efficient, but also applicable to code in the wild. For experiments, we collect code context from open source repos to generate one million function bodies using public models. Our static analysis reveals that Undefined Name and Unused Variable are the most common errors among others made by language models. Through extensive studies, we also show the impact of sampling temperature, model size, and context on static errors in code completions. ",
    "url": "https://arxiv.org/abs/2306.03203",
    "authors": [
      "Hantian Ding",
      "Varun Kumar",
      "Yuchen Tian",
      "Zijian Wang",
      "Rob Kwiatkowski",
      "Xiaopeng Li",
      "Murali Krishna Ramanathan",
      "Baishakhi Ray",
      "Parminder Bhatia",
      "Sudipta Sengupta",
      "Dan Roth",
      "Bing Xiang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2306.03206",
    "title": "MoDAR: Using Motion Forecasting for 3D Object Detection in Point Cloud  Sequences",
    "abstract": "Occluded and long-range objects are ubiquitous and challenging for 3D object detection. Point cloud sequence data provide unique opportunities to improve such cases, as an occluded or distant object can be observed from different viewpoints or gets better visibility over time. However, the efficiency and effectiveness in encoding long-term sequence data can still be improved. In this work, we propose MoDAR, using motion forecasting outputs as a type of virtual modality, to augment LiDAR point clouds. The MoDAR modality propagates object information from temporal contexts to a target frame, represented as a set of virtual points, one for each object from a waypoint on a forecasted trajectory. A fused point cloud of both raw sensor points and the virtual points can then be fed to any off-the-shelf point-cloud based 3D object detector. Evaluated on the Waymo Open Dataset, our method significantly improves prior art detectors by using motion forecasting from extra-long sequences (e.g. 18 seconds), achieving new state of the arts, while not adding much computation overhead. ",
    "url": "https://arxiv.org/abs/2306.03206",
    "authors": [
      "Yingwei Li",
      "Charles R. Qi",
      "Yin Zhou",
      "Chenxi Liu",
      "Dragomir Anguelov"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03207",
    "title": "H2-Mapping: Real-time Dense Mapping Using Hierarchical Hybrid  Representation",
    "abstract": "Constructing a high-quality dense map in real-time is essential for robotics, AR/VR, and digital twins applications. As Neural Radiance Field (NeRF) greatly improves the mapping performance, in this paper, we propose a NeRF-based mapping method that enables higher-quality reconstruction and real-time capability even on edge computers. Specifically, we propose a novel hierarchical hybrid representation that leverages implicit multiresolution hash encoding aided by explicit octree SDF priors, describing the scene at different levels of detail. This representation allows for fast scene geometry initialization and makes scene geometry easier to learn. Besides, we present a coverage-maximizing keyframe selection strategy to address the forgetting issue and enhance mapping quality, particularly in marginal areas. To the best of our knowledge, our method is the first to achieve high-quality NeRF-based mapping on edge computers of handheld devices and quadrotors in real-time. Experiments demonstrate that our method outperforms existing NeRF-based mapping methods in geometry accuracy, texture realism, and time consumption. The code will be released at: https://github.com/SYSU-STAR/H2-Mapping ",
    "url": "https://arxiv.org/abs/2306.03207",
    "authors": [
      "Chenxing Jiang",
      "Hanwen Zhang",
      "Peize Liu",
      "Zehuan Yu",
      "Hui Cheng",
      "Boyu Zhou",
      "Shaojie Shen"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2306.03221",
    "title": "Structural Re-weighting Improves Graph Domain Adaptation",
    "abstract": "In many real-world applications, graph-structured data used for training and testing have differences in distribution, such as in high energy physics (HEP) where simulation data used for training may not match real experiments. Graph domain adaptation (GDA) is a method used to address these differences. However, current GDA primarily works by aligning the distributions of node representations output by a single graph neural network encoder shared across the training and testing domains, which may often yield sub-optimal solutions. This work examines different impacts of distribution shifts caused by either graph structure or node attributes and identifies a new type of shift, named conditional structure shift (CSS), which current GDA approaches are provably sub-optimal to deal with. A novel approach, called structural reweighting (StruRW), is proposed to address this issue and is tested on synthetic graphs, four benchmark datasets, and a new application in HEP. StruRW has shown significant performance improvement over the baselines in the settings with large graph structure shifts, and reasonable performance improvement when node attribute shift dominates. ",
    "url": "https://arxiv.org/abs/2306.03221",
    "authors": [
      "Shikun Liu",
      "Tianchun Li",
      "Yongbin Feng",
      "Nhan Tran",
      "Han Zhao",
      "Qiu Qiang",
      "Pan Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2306.03228",
    "title": "Discovering Novel Biological Traits From Images Using Phylogeny-Guided  Neural Networks",
    "abstract": "Discovering evolutionary traits that are heritable across species on the tree of life (also referred to as a phylogenetic tree) is of great interest to biologists to understand how organisms diversify and evolve. However, the measurement of traits is often a subjective and labor-intensive process, making trait discovery a highly label-scarce problem. We present a novel approach for discovering evolutionary traits directly from images without relying on trait labels. Our proposed approach, Phylo-NN, encodes the image of an organism into a sequence of quantized feature vectors -- or codes -- where different segments of the sequence capture evolutionary signals at varying ancestry levels in the phylogeny. We demonstrate the effectiveness of our approach in producing biologically meaningful results in a number of downstream tasks including species image generation and species-to-species image translation, using fish species as a target example. ",
    "url": "https://arxiv.org/abs/2306.03228",
    "authors": [
      "Mohannad Elhamod",
      "Mridul Khurana",
      "Harish Babu Manogaran",
      "Josef C. Uyeda",
      "Meghan A. Balk",
      "Wasila Dahdul",
      "Yasin Bakış",
      "Henry L. Bart Jr.",
      "Paula M. Mabee",
      "Hilmar Lapp",
      "James P. Balhoff",
      "Caleb Charpentier",
      "David Carlyn",
      "Wei-Lun Chao",
      "Charles V. Stewart",
      "Daniel I. Rubenstein",
      "Tanya Berger-Wolf",
      "Anuj Karpatne"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2306.03229",
    "title": "Adversarial alignment: Breaking the trade-off between the strength of an  attack and its relevance to human perception",
    "abstract": "Deep neural networks (DNNs) are known to have a fundamental sensitivity to adversarial attacks, perturbations of the input that are imperceptible to humans yet powerful enough to change the visual decision of a model. Adversarial attacks have long been considered the \"Achilles' heel\" of deep learning, which may eventually force a shift in modeling paradigms. Nevertheless, the formidable capabilities of modern large-scale DNNs have somewhat eclipsed these early concerns. Do adversarial attacks continue to pose a threat to DNNs? Here, we investigate how the robustness of DNNs to adversarial attacks has evolved as their accuracy on ImageNet has continued to improve. We measure adversarial robustness in two different ways: First, we measure the smallest adversarial attack needed to cause a model to change its object categorization decision. Second, we measure how aligned successful attacks are with the features that humans find diagnostic for object recognition. We find that adversarial attacks are inducing bigger and more easily detectable changes to image pixels as DNNs grow better on ImageNet, but these attacks are also becoming less aligned with features that humans find diagnostic for recognition. To better understand the source of this trade-off, we turn to the neural harmonizer, a DNN training routine that encourages models to leverage the same features as humans to solve tasks. Harmonized DNNs achieve the best of both worlds and experience attacks that are detectable and affect features that humans find diagnostic for recognition, meaning that attacks on these models are more likely to be rendered ineffective by inducing similar effects on human perception. Our findings suggest that the sensitivity of DNNs to adversarial attacks can be mitigated by DNN scale, data scale, and training routines that align models with biological intelligence. ",
    "url": "https://arxiv.org/abs/2306.03229",
    "authors": [
      "Drew Linsley",
      "Pinyuan Feng",
      "Thibaut Boissin",
      "Alekh Karkada Ashok",
      "Thomas Fel",
      "Stephanie Olaiya",
      "Thomas Serre"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03234",
    "title": "CONCORD: Clone-aware Contrastive Learning for Source Code",
    "abstract": "Deep Learning (DL) models to analyze source code have shown immense promise during the past few years. More recently, self-supervised pre-training has gained traction for learning generic code representations valuable for many downstream SE tasks, such as clone and bug detection. While previous work successfully learned from different code abstractions (e.g., token, AST, graph), we argue that it is also essential to factor in how developers code day-to-day for general-purpose representation learning. On the one hand, human developers tend to write repetitive programs referencing existing code snippets from the current codebase or online resources (e.g., Stack Overflow website) rather than implementing functions from scratch; such behaviors result in a vast number of code clones. In contrast, a deviant clone by mistake might trigger malicious program behaviors. Thus, as a proxy to incorporate developers' coding behavior into the pre-training scheme, we propose to include code clones and their deviants. In particular, we propose CONCORD, a self-supervised, contrastive learning strategy to place benign clones closer in the representation space while moving deviants further apart. We show that CONCORD's clone-aware contrastive learning drastically reduces the need for expensive pre-training resources while improving the performance of downstream SE tasks. We also empirically demonstrate that CONCORD can improve existing pre-trained models to learn better representations that consequently become more efficient in both identifying semantically equivalent programs and differentiating buggy from non-buggy code. ",
    "url": "https://arxiv.org/abs/2306.03234",
    "authors": [
      "Yangruibo Ding",
      "Saikat Chakraborty",
      "Luca Buratti",
      "Saurabh Pujar",
      "Alessandro Morari",
      "Gail Kaiser",
      "Baishakhi Ray"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2306.03254",
    "title": "Characterizing the Effects of Single Bus Perturbation on Power Systems  Graph Signals",
    "abstract": "This article explores the effects of a single bus perturbation in the electrical grid using a Graph Signal Processing (GSP) perspective. The perturbation is characterized by a sudden change in real-power load demand or generation. The study focuses on analyzing the spread of the perturbation throughout the grid and proposes a measure of spreadability based on GSP. Moreover, the global and local smoothness properties of the difference bus voltage angle graph signals are evaluated for understanding their embedded patterns of spreadability property. It is demonstrated that the global smoothness of the bus voltage angle graph signal follows a quadratic relationship with the perturbation strength, which helps in characterizing the critical perturbation strength after which the power flow diverges indicating a stressed system. The impact of a single bus perturbation on power system graph signals has been investigated through both analytical derivations using the DC power flow model and simulation using the AC power flow model. The results reveal that the proposed measure of spreadability as well as local and global smoothness properties of the graph signals are independent of the perturbation strength and instead mainly depend on the perturbation's location. ",
    "url": "https://arxiv.org/abs/2306.03254",
    "authors": [
      "Md Abul Hasnat",
      "Mia Naeini"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2306.03256",
    "title": "Explaining and Adapting Graph Conditional Shift",
    "abstract": "Graph Neural Networks (GNNs) have shown remarkable performance on graph-structured data. However, recent empirical studies suggest that GNNs are very susceptible to distribution shift. There is still significant ambiguity about why graph-based models seem more vulnerable to these shifts. In this work we provide a thorough theoretical analysis on it by quantifying the magnitude of conditional shift between the input features and the output label. Our findings show that both graph heterophily and model architecture exacerbate conditional shifts, leading to performance degradation. To address this, we propose an approach that involves estimating and minimizing the conditional shift for unsupervised domain adaptation on graphs. In our controlled synthetic experiments, our algorithm demonstrates robustness towards distribution shift, resulting in up to 10% absolute ROC AUC improvement versus the second-best algorithm. Furthermore, comprehensive experiments on both node classification and graph classification show its robust performance under various distribution shifts. ",
    "url": "https://arxiv.org/abs/2306.03256",
    "authors": [
      "Qi Zhu",
      "Yizhu Jiao",
      "Natalia Ponomareva",
      "Jiawei Han",
      "Bryan Perozzi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2306.03273",
    "title": "Under-Counted Tensor Completion with Neural Incorporation of Attributes",
    "abstract": "Systematic under-counting effects are observed in data collected across many disciplines, e.g., epidemiology and ecology. Under-counted tensor completion (UC-TC) is well-motivated for many data analytics tasks, e.g., inferring the case numbers of infectious diseases at unobserved locations from under-counted case numbers in neighboring regions. However, existing methods for similar problems often lack supports in theory, making it hard to understand the underlying principles and conditions beyond empirical successes. In this work, a low-rank Poisson tensor model with an expressive unknown nonlinear side information extractor is proposed for under-counted multi-aspect data. A joint low-rank tensor completion and neural network learning algorithm is designed to recover the model. Moreover, the UC-TC formulation is supported by theoretical analysis showing that the fully counted entries of the tensor and each entry's under-counting probability can be provably recovered from partial observations -- under reasonable conditions. To our best knowledge, the result is the first to offer theoretical supports for under-counted multi-aspect data completion. Simulations and real-data experiments corroborate the theoretical claims. ",
    "url": "https://arxiv.org/abs/2306.03273",
    "authors": [
      "Shahana Ibrahim",
      "Xiao Fu",
      "Rebecca Hutchinson",
      "Eugene Seo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2306.03316",
    "title": "CoSiNES: Contrastive Siamese Network for Entity Standardization",
    "abstract": "Entity standardization maps noisy mentions from free-form text to standard entities in a knowledge base. The unique challenge of this task relative to other entity-related tasks is the lack of surrounding context and numerous variations in the surface form of the mentions, especially when it comes to generalization across domains where labeled data is scarce. Previous research mostly focuses on developing models either heavily relying on context, or dedicated solely to a specific domain. In contrast, we propose CoSiNES, a generic and adaptable framework with Contrastive Siamese Network for Entity Standardization that effectively adapts a pretrained language model to capture the syntax and semantics of the entities in a new domain. We construct a new dataset in the technology domain, which contains 640 technical stack entities and 6,412 mentions collected from industrial content management systems. We demonstrate that CoSiNES yields higher accuracy and faster runtime than baselines derived from leading methods in this domain. CoSiNES also achieves competitive performance in four standard datasets from the chemistry, medicine, and biomedical domains, demonstrating its cross-domain applicability. ",
    "url": "https://arxiv.org/abs/2306.03316",
    "authors": [
      "Jiaqing Yuan",
      "Michele Merler",
      "Mihir Choudhury",
      "Raju Pavuluri",
      "Munindar P. Singh",
      "Maja Vukovic"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2306.03318",
    "title": "Student Classroom Behavior Detection based on Improved YOLOv7",
    "abstract": "Accurately detecting student behavior in classroom videos can aid in analyzing their classroom performance and improving teaching effectiveness. However, the current accuracy rate in behavior detection is low. To address this challenge, we propose the Student Classroom Behavior Detection method, based on improved YOLOv7. First, we created the Student Classroom Behavior dataset (SCB-Dataset), which includes 18.4k labels and 4.2k images, covering three behaviors: hand raising, reading, and writing. To improve detection accuracy in crowded scenes, we integrated the biformer attention module and Wise-IoU into the YOLOv7 network. Finally, experiments were conducted on the SCB-Dataset, and the model achieved an mAP@0.5 of 79%, resulting in a 1.8% improvement over previous results. The SCB-Dataset and code are available for download at: https://github.com/Whiffe/SCB-dataset. ",
    "url": "https://arxiv.org/abs/2306.03318",
    "authors": [
      "Fan Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03322",
    "title": "Stochastic Multi-Level Compositional Optimization Algorithms over  Networks with Level-Independent Convergence Rate",
    "abstract": "Stochastic multi-level compositional optimization problems cover many new machine learning paradigms, e.g., multi-step model-agnostic meta-learning, which require efficient optimization algorithms for large-scale applications. This paper studies the decentralized stochastic multi-level optimization algorithm, which is challenging because the multi-level structure and decentralized communication scheme may make the number of levels affect the order of the convergence rate. To this end, we develop two novel decentralized optimization algorithms to deal with the multi-level function and its gradient. Our theoretical results show that both algorithms can achieve the level-independent convergence rate for nonconvex problems under much milder conditions compared with existing single-machine algorithms. To the best of our knowledge, this is the first work that achieves the level-independent convergence rate under the decentralized setting. Moreover, extensive experiments confirm the efficacy of our proposed algorithms. ",
    "url": "https://arxiv.org/abs/2306.03322",
    "authors": [
      "Hongchang Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03331",
    "title": "A Robust Likelihood Model for Novelty Detection",
    "abstract": "Current approaches to novelty or anomaly detection are based on deep neural networks. Despite their effectiveness, neural networks are also vulnerable to imperceptible deformations of the input data. This is a serious issue in critical applications, or when data alterations are generated by an adversarial attack. While this is a known problem that has been studied in recent years for the case of supervised learning, the case of novelty detection has received very limited attention. Indeed, in this latter setting the learning is typically unsupervised because outlier data is not available during training, and new approaches for this case need to be investigated. We propose a new prior that aims at learning a robust likelihood for the novelty test, as a defense against attacks. We also integrate the same prior with a state-of-the-art novelty detection approach. Because of the geometric properties of that approach, the resulting robust training is computationally very efficient. An initial evaluation of the method indicates that it is effective at improving performance with respect to the standard models in the absence and presence of attacks. ",
    "url": "https://arxiv.org/abs/2306.03331",
    "authors": [
      "Ranya Almohsen",
      "Shivang Patel",
      "Donald A. Adjeroh",
      "Gianfranco Doretto"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03354",
    "title": "Simulation-Based Counterfactual Causal Discovery on Real World Driver  Behaviour",
    "abstract": "Being able to reason about how one's behaviour can affect the behaviour of others is a core skill required of intelligent driving agents. Despite this, the state of the art struggles to meet the need of agents to discover causal links between themselves and others. Observational approaches struggle because of the non-stationarity of causal links in dynamic environments, and the sparsity of causal interactions while requiring the approaches to work in an online fashion. Meanwhile interventional approaches are impractical as a vehicle cannot experiment with its actions on a public road. To counter the issue of non-stationarity we reformulate the problem in terms of extracted events, while the previously mentioned restriction upon interventions can be overcome with the use of counterfactual simulation. We present three variants of the proposed counterfactual causal discovery method and evaluate these against state of the art observational temporal causal discovery methods across 3396 causal scenes extracted from a real world driving dataset. We find that the proposed method significantly outperforms the state of the art on the proposed task quantitatively and can offer additional insights by comparing the outcome of an alternate series of decisions in a way that observational and interventional approaches cannot. ",
    "url": "https://arxiv.org/abs/2306.03354",
    "authors": [
      "Rhys Howard",
      "Lars Kunze"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03355",
    "title": "BatchSampler: Sampling Mini-Batches for Contrastive Learning in Vision,  Language, and Graphs",
    "abstract": "In-Batch contrastive learning is a state-of-the-art self-supervised method that brings semantically-similar instances close while pushing dissimilar instances apart within a mini-batch. Its key to success is the negative sharing strategy, in which every instance serves as a negative for the others within the mini-batch. Recent studies aim to improve performance by sampling hard negatives \\textit{within the current mini-batch}, whose quality is bounded by the mini-batch itself. In this work, we propose to improve contrastive learning by sampling mini-batches from the input data. We present BatchSampler\\footnote{The code is available at \\url{https://github.com/THUDM/BatchSampler}} to sample mini-batches of hard-to-distinguish (i.e., hard and true negatives to each other) instances. To make each mini-batch have fewer false negatives, we design the proximity graph of randomly-selected instances. To form the mini-batch, we leverage random walk with restart on the proximity graph to help sample hard-to-distinguish instances. BatchSampler is a simple and general technique that can be directly plugged into existing contrastive learning models in vision, language, and graphs. Extensive experiments on datasets of three modalities show that BatchSampler can consistently improve the performance of powerful contrastive models, as shown by significant improvements of SimCLR on ImageNet-100, SimCSE on STS (language), and GraphCL and MVGRL on graph datasets. ",
    "url": "https://arxiv.org/abs/2306.03355",
    "authors": [
      "Zhen Yang",
      "Tinglin Huang",
      "Ming Ding",
      "Yuxiao Dong",
      "Rex Ying",
      "Yukuo Cen",
      "Yangliao Geng",
      "Jie Tang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03367",
    "title": "Bridging the Gap Between Multi-Step and One-Shot Trajectory Prediction  via Self-Supervision",
    "abstract": "Accurate vehicle trajectory prediction is an unsolved problem in autonomous driving with various open research questions. State-of-the-art approaches regress trajectories either in a one-shot or step-wise manner. Although one-shot approaches are usually preferred for their simplicity, they relinquish powerful self-supervision schemes that can be constructed by chaining multiple time-steps. We address this issue by proposing a middle-ground where multiple trajectory segments are chained together. Our proposed Multi-Branch Self-Supervised Predictor receives additional training on new predictions starting at intermediate future segments. In addition, the model 'imagines' the latent context and 'predicts the past' while combining multi-modal trajectories in a tree-like manner. We deliberately keep aspects such as interaction and environment modeling simplistic and nevertheless achieve competitive results on the INTERACTION dataset. Furthermore, we investigate the sparsely explored uncertainty estimation of deterministic predictors. We find positive correlations between the prediction error and two proposed metrics, which might pave way for determining prediction confidence. ",
    "url": "https://arxiv.org/abs/2306.03367",
    "authors": [
      "Faris Janjoš",
      "Max Keller",
      "Maxim Dolgov",
      "J. Marius Zöllner"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03374",
    "title": "PGformer: Proxy-Bridged Game Transformer for Multi-Person Extremely  Interactive Motion Prediction",
    "abstract": "Multi-person motion prediction is a challenging task, especially for real-world scenarios of densely interacted persons. Most previous works have been devoted to studying the case of weak interactions (e.g., hand-shaking), which typically forecast each human pose in isolation. In this paper, we focus on motion prediction for multiple persons with extreme collaborations and attempt to explore the relationships between the highly interactive persons' motion trajectories. Specifically, a novel cross-query attention (XQA) module is proposed to bilaterally learn the cross-dependencies between the two pose sequences tailored for this situation. Additionally, we introduce and build a proxy entity to bridge the involved persons, which cooperates with our proposed XQA module and subtly controls the bidirectional information flows, acting as a motion intermediary. We then adapt these designs to a Transformer-based architecture and devise a simple yet effective end-to-end framework called proxy-bridged game Transformer (PGformer) for multi-person interactive motion prediction. The effectiveness of our method has been evaluated on the challenging ExPI dataset, which involves highly interactive actions. We show that our PGformer consistently outperforms the state-of-the-art methods in both short- and long-term predictions by a large margin. Besides, our approach can also be compatible with the weakly interacted CMU-Mocap and MuPoTS-3D datasets and achieve encouraging results. Our code will become publicly available upon acceptance. ",
    "url": "https://arxiv.org/abs/2306.03374",
    "authors": [
      "Yanwen Fang",
      "Chao Li",
      "Jintai Chen",
      "Pengtao Jiang",
      "Yifeng Geng",
      "Xuansong Xie",
      "Eddy K.F. LAM",
      "Guodong Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03379",
    "title": "OptimShare: A Unified Framework for Privacy Preserving Data Sharing --  Towards the Practical Utility of Data with Privacy",
    "abstract": "Tabular data sharing serves as a common method for data exchange. However, sharing sensitive information without adequate privacy protection can compromise individual privacy. Thus, ensuring privacy-preserving data sharing is crucial. Differential privacy (DP) is regarded as the gold standard in data privacy. Despite this, current DP methods tend to generate privacy-preserving tabular datasets that often suffer from limited practical utility due to heavy perturbation and disregard for the tables' utility dynamics. Besides, there has not been much research on selective attribute release, particularly in the context of controlled partially perturbed data sharing. This has significant implications for scenarios such as cross-agency data sharing in real-world situations. We introduce OptimShare: a utility-focused, multi-criteria solution designed to perturb input datasets selectively optimized for specific real-world applications. OptimShare combines the principles of differential privacy, fuzzy logic, and probability theory to establish an integrated tool for privacy-preserving data sharing. Empirical assessments confirm that OptimShare successfully strikes a balance between better data utility and robust privacy, effectively serving various real-world problem scenarios. ",
    "url": "https://arxiv.org/abs/2306.03379",
    "authors": [
      "M.A.P. Chamikara",
      "Seung Ick Jang",
      "Ian Oppermann",
      "Dongxi Liu",
      "Musotto Roberto",
      "Sushmita Ruj",
      "Arindam Pal",
      "Meisam Mohammady",
      "Seyit Camtepe",
      "Sylvia Young",
      "Chris Dorrian",
      "Nasir David"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2306.03389",
    "title": "Phase perturbation improves channel robustness for speech spoofing  countermeasures",
    "abstract": "In this paper, we aim to address the problem of channel robustness in speech countermeasure (CM) systems, which are used to distinguish synthetic speech from human natural speech. On the basis of two hypotheses, we suggest an approach for perturbing phase information during the training of time-domain CM systems. Communication networks often employ lossy compression codec that encodes only magnitude information, therefore heavily altering phase information. Also, state-of-the-art CM systems rely on phase information to identify spoofed speech. Thus, we believe the information loss in the phase domain induced by lossy compression codec degrades the performance of the unseen channel. We first establish the dependence of time-domain CM systems on phase information by perturbing phase in evaluation, showing strong degradation. Then, we demonstrated that perturbing phase during training leads to a significant performance improvement, whereas perturbing magnitude leads to further degradation. ",
    "url": "https://arxiv.org/abs/2306.03389",
    "authors": [
      "Yongyi Zang",
      "You Zhang",
      "Zhiyao Duan"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2306.03390",
    "title": "Origin-Destination Network Generation via Gravity-Guided GAN",
    "abstract": "Origin-destination (OD) flow, which contains valuable population mobility information including direction and volume, is critical in many urban applications, such as urban planning, transportation management, etc. However, OD data is not always easy to access due to high costs or privacy concerns. Therefore, we must consider generating OD through mathematical models. Existing works utilize physics laws or machine learning (ML) models to build the association between urban structures and OD flows while these two kinds of methods suffer from the limitation of over-simplicity and poor generalization ability, respectively. In this paper, we propose to adopt physics-informed ML paradigm, which couple the physics scientific knowledge and data-driven ML methods, to construct a model named Origin-Destination Generation Networks (ODGN) for better population mobility modeling by leveraging the complementary strengths of combining physics and ML methods. Specifically, we first build a Multi-view Graph Attention Networks (MGAT) to capture the urban features of every region and then use a gravity-guided predictor to obtain OD flow between every two regions. Furthermore, we use a conditional GAN training strategy and design a sequence-based discriminator to consider the overall topological features of OD as a network. Extensive experiments on real-world datasets have been done to demonstrate the superiority of our proposed method compared with baselines. ",
    "url": "https://arxiv.org/abs/2306.03390",
    "authors": [
      "Can Rong",
      "Huandong Wang",
      "Yong Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03392",
    "title": "Tree based Progressive Regression Model for Watch-Time Prediction in  Short-video Recommendation",
    "abstract": "An accurate prediction of watch time has been of vital importance to enhance user engagement in video recommender systems. To achieve this, there are four properties that a watch time prediction framework should satisfy: first, despite its continuous value, watch time is also an ordinal variable and the relative ordering between its values reflects the differences in user preferences. Therefore the ordinal relations should be reflected in watch time predictions. Second, the conditional dependence between the video-watching behaviors should be captured in the model. For instance, one has to watch half of the video before he/she finishes watching the whole video. Third, modeling watch time with a point estimation ignores the fact that models might give results with high uncertainty and this could cause bad cases in recommender systems. Therefore the framework should be aware of prediction uncertainty. Forth, the real-life recommender systems suffer from severe bias amplifications thus an estimation without bias amplification is expected. Therefore we propose TPM for watch time prediction. Specifically, the ordinal ranks of watch time are introduced into TPM and the problem is decomposed into a series of conditional dependent classification tasks which are organized into a tree structure. The expectation of watch time can be generated by traversing the tree and the variance of watch time predictions is explicitly introduced into the objective function as a measurement for uncertainty. Moreover, we illustrate that backdoor adjustment can be seamlessly incorporated into TPM, which alleviates bias amplifications. Extensive offline evaluations have been conducted in public datasets and TPM have been deployed in a real-world video app Kuaishou with over 300 million DAUs. The results indicate that TPM outperforms state-of-the-art approaches and indeed improves video consumption significantly. ",
    "url": "https://arxiv.org/abs/2306.03392",
    "authors": [
      "Xiao Lin",
      "Xiaokai Chen",
      "Linfeng Song",
      "Jingwei Liu",
      "Biao Li",
      "Peng Jiang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2306.03397",
    "title": "A Survey on Federated Learning Poisoning Attacks and Defenses",
    "abstract": "As one kind of distributed machine learning technique, federated learning enables multiple clients to build a model across decentralized data collaboratively without explicitly aggregating the data. Due to its ability to break data silos, federated learning has received increasing attention in many fields, including finance, healthcare, and education. However, the invisibility of clients' training data and the local training process result in some security issues. Recently, many works have been proposed to research the security attacks and defenses in federated learning, but there has been no special survey on poisoning attacks on federated learning and the corresponding defenses. In this paper, we investigate the most advanced schemes of federated learning poisoning attacks and defenses and point out the future directions in these areas. ",
    "url": "https://arxiv.org/abs/2306.03397",
    "authors": [
      "Junchuan Lianga",
      "Rong Wang",
      "Chaosheng Feng",
      "Chin-Chen Chang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2306.03406",
    "title": "Deep neural networks architectures from the perspective of manifold  learning",
    "abstract": "Despite significant advances in the field of deep learning in ap-plications to various areas, an explanation of the learning pro-cess of neural network models remains an important open ques-tion. The purpose of this paper is a comprehensive comparison and description of neural network architectures in terms of ge-ometry and topology. We focus on the internal representation of neural networks and on the dynamics of changes in the topology and geometry of a data manifold on different layers. In this paper, we use the concepts of topological data analysis (TDA) and persistent homological fractal dimension. We present a wide range of experiments with various datasets and configurations of convolutional neural network (CNNs) architectures and Transformers in CV and NLP tasks. Our work is a contribution to the development of the important field of explainable and interpretable AI within the framework of geometrical deep learning. ",
    "url": "https://arxiv.org/abs/2306.03406",
    "authors": [
      "German Magai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Algebraic Topology (math.AT)"
    ]
  },
  {
    "id": "arXiv:2306.03412",
    "title": "DEK-Forecaster: A Novel Deep Learning Model Integrated with EMD-KNN for  Traffic Prediction",
    "abstract": "Internet traffic volume estimation has a significant impact on the business policies of the ISP (Internet Service Provider) industry and business successions. Forecasting the internet traffic demand helps to shed light on the future traffic trend, which is often helpful for ISPs decision-making in network planning activities and investments. Besides, the capability to understand future trend contributes to managing regular and long-term operations. This study aims to predict the network traffic volume demand using deep sequence methods that incorporate Empirical Mode Decomposition (EMD) based noise reduction, Empirical rule based outlier detection, and $K$-Nearest Neighbour (KNN) based outlier mitigation. In contrast to the former studies, the proposed model does not rely on a particular EMD decomposed component called Intrinsic Mode Function (IMF) for signal denoising. In our proposed traffic prediction model, we used an average of all IMFs components for signal denoising. Moreover, the abnormal data points are replaced by $K$ nearest data points average, and the value for $K$ has been optimized based on the KNN regressor prediction error measured in Root Mean Squared Error (RMSE). Finally, we selected the best time-lagged feature subset for our prediction model based on AutoRegressive Integrated Moving Average (ARIMA) and Akaike Information Criterion (AIC) value. Our experiments are conducted on real-world internet traffic datasets from industry, and the proposed method is compared with various traditional deep sequence baseline models. Our results show that the proposed EMD-KNN integrated prediction models outperform comparative models. ",
    "url": "https://arxiv.org/abs/2306.03412",
    "authors": [
      "Sajal Saha",
      "Sudipto Baral",
      "Anwar Haque"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03424",
    "title": "Change Diffusion: Change Detection Map Generation Based on  Difference-Feature Guided DDPM",
    "abstract": "Deep learning (DL) approaches based on CNN-purely or Transformer networks have demonstrated promising results in bitemporal change detection (CD). However, their performance is limited by insufficient contextual information aggregation, as they struggle to fully capture the implicit contextual dependency relationships among feature maps at different levels. Additionally, researchers have utilized pre-trained denoising diffusion probabilistic models (DDPMs) for training lightweight CD classifiers. Nevertheless, training a DDPM to generate intricately detailed, multi-channel remote sensing images requires months of training time and a substantial volume of unlabeled remote sensing datasets, making it significantly more complex than generating a single-channel change map. To overcome these challenges, we propose a novel end-to-end DDPM-based model architecture called change-aware diffusion model (CADM), which can be trained using a limited annotated dataset quickly. Furthermore, we introduce dynamic difference conditional encoding to enhance step-wise regional attention in DDPM for bitemporal images in CD datasets. This method establishes state-adaptive conditions for each sampling step, emphasizing two main innovative points of our model: 1) its end-to-end nature and 2) difference conditional encoding. We evaluate CADM on four remote sensing CD tasks with different ground scenarios, including CDD, WHU, Levier, and GVLM. Experimental results demonstrate that CADM significantly outperforms state-of-the-art methods, indicating the generalization and effectiveness of the proposed model. ",
    "url": "https://arxiv.org/abs/2306.03424",
    "authors": [
      "Yihan Wen",
      "Jialu Sui",
      "Xianping Ma",
      "Wendi Liang",
      "Xiaokang Zhang",
      "Man-On Pun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03430",
    "title": "Revisiting the Trade-off between Accuracy and Robustness via Weight  Distribution of Filters",
    "abstract": "Adversarial attacks have been proven to be potential threats to Deep Neural Networks (DNNs), and many methods are proposed to defend against adversarial attacks. However, while enhancing the robustness, the clean accuracy will decline to a certain extent, implying a trade-off existed between the accuracy and robustness. In this paper, we firstly empirically find an obvious distinction between standard and robust models in the filters' weight distribution of the same architecture, and then theoretically explain this phenomenon in terms of the gradient regularization, which shows this difference is an intrinsic property for DNNs, and thus a static network architecture is difficult to improve the accuracy and robustness at the same time. Secondly, based on this observation, we propose a sample-wise dynamic network architecture named Adversarial Weight-Varied Network (AW-Net), which focuses on dealing with clean and adversarial examples with a ``divide and rule\" weight strategy. The AW-Net dynamically adjusts network's weights based on regulation signals generated by an adversarial detector, which is directly influenced by the input sample. Benefiting from the dynamic network architecture, clean and adversarial examples can be processed with different network weights, which provides the potentiality to enhance the accuracy and robustness simultaneously. A series of experiments demonstrate that our AW-Net is architecture-friendly to handle both clean and adversarial examples and can achieve better trade-off performance than state-of-the-art robust models. ",
    "url": "https://arxiv.org/abs/2306.03430",
    "authors": [
      "Xingxing Wei",
      "Shiji Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03434",
    "title": "Learning-Based Heuristic for Combinatorial Optimization of the Minimum  Dominating Set Problem using Graph Convolutional Networks",
    "abstract": "A dominating set of a graph $\\mathcal{G=(V, E)}$ is a subset of vertices $S\\subseteq\\mathcal{V}$ such that every vertex $v\\in \\mathcal{V} \\setminus S$ outside the dominating set is adjacent to a vertex $u\\in S$ within the set. The minimum dominating set problem seeks to find a dominating set of minimum cardinality and is a well-established NP-hard combinatorial optimization problem. We propose a novel learning-based heuristic approach to compute solutions for the minimum dominating set problem using graph convolutional networks. We conduct an extensive experimental evaluation of the proposed method on a combination of randomly generated graphs and real-world graph datasets. Our results indicate that the proposed learning-based approach can outperform a classical greedy approximation algorithm. Furthermore, we demonstrate the generalization capability of the graph convolutional network across datasets and its ability to scale to graphs of higher order than those on which it was trained. Finally, we utilize the proposed learning-based heuristic in an iterative greedy algorithm, achieving state-of-the-art performance in the computation of dominating sets. ",
    "url": "https://arxiv.org/abs/2306.03434",
    "authors": [
      "Abihith Kothapalli",
      "Mudassir Shabbir",
      "Xenofon Koutsoukos"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2306.03438",
    "title": "Large Language Models of Code Fail at Completing Code with Potential  Bugs",
    "abstract": "Large language models of code (Code-LLMs) have recently brought tremendous advances to code completion, a fundamental feature of programming assistance and code intelligence. However, most existing works ignore the possible presence of bugs in the code context for generation, which are inevitable in software development. Therefore, we introduce and study the buggy-code completion problem, inspired by the realistic scenario of real-time code suggestion where the code context contains potential bugs -- anti-patterns that can become bugs in the completed program. To systematically study the task, we introduce two datasets: one with synthetic bugs derived from semantics-altering operator changes (buggy-HumanEval) and one with realistic bugs derived from user submissions to coding problems (buggy-FixEval). We find that the presence of potential bugs significantly degrades the generation performance of the high-performing Code-LLMs. For instance, the passing rates of CodeGen-2B-mono on test cases of buggy-HumanEval drop more than 50% given a single potential bug in the context. Finally, we investigate several post-hoc methods for mitigating the adverse effect of potential bugs and find that there remains a large gap in post-mitigation performance. ",
    "url": "https://arxiv.org/abs/2306.03438",
    "authors": [
      "Tuan Dinh",
      "Jinman Zhao",
      "Samson Tan",
      "Renato Negrinho",
      "Leonard Lausen",
      "Sheng Zha",
      "George Karypis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2306.03440",
    "title": "Quantifying the Variability Collapse of Neural Networks",
    "abstract": "Recent studies empirically demonstrate the positive relationship between the transferability of neural networks and the within-class variation of the last layer features. The recently discovered Neural Collapse (NC) phenomenon provides a new perspective of understanding such last layer geometry of neural networks. In this paper, we propose a novel metric, named Variability Collapse Index (VCI), to quantify the variability collapse phenomenon in the NC paradigm. The VCI metric is well-motivated and intrinsically related to the linear probing loss on the last layer features. Moreover, it enjoys desired theoretical and empirical properties, including invariance under invertible linear transformations and numerical stability, that distinguishes it from previous metrics. Our experiments verify that VCI is indicative of the variability collapse and the transferability of pretrained neural networks. ",
    "url": "https://arxiv.org/abs/2306.03440",
    "authors": [
      "Jing Xu",
      "Haoxiong Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03441",
    "title": "Reconstructing human activities via coupling mobile phone data with  location-based social networks",
    "abstract": "In the era of big data, the ubiquity of location-aware portable devices provides an unprecedented opportunity to understand inhabitants' behavior and their interactions with the built environments. Among the widely used data resources, mobile phone data is the one passively collected and has the largest coverage in the population. However, mobile operators cannot pinpoint one user within meters, leading to the difficulties in activity inference. To that end, we propose a data analysis framework to identify user's activity via coupling the mobile phone data with location-based social networks (LBSN) data. The two datasets are integrated into a Bayesian inference module, considering people's circadian rhythms in both time and space. Specifically, the framework considers the pattern of arrival time to each type of facility and the spatial distribution of facilities. The former can be observed from the LBSN Data and the latter is provided by the points of interest (POIs) dataset. Taking Shanghai as an example, we reconstruct the activity chains of 1,000,000 active mobile phone users and analyze the temporal and spatial characteristics of each activity type. We assess the results with some official surveys and a real-world check-in dataset collected in Shanghai, indicating that the proposed method can capture and analyze human activities effectively. Next, we cluster users' inferred activity chains with a topic model to understand the behavior of different groups of users. This data analysis framework provides an example of reconstructing and understanding the activity of the population at an urban scale with big data fusion. ",
    "url": "https://arxiv.org/abs/2306.03441",
    "authors": [
      "Le Huang",
      "Fan Xia",
      "Hui Chen",
      "Bowen Hu",
      "Xiao Zhou",
      "Chunxiao Li",
      "Yaohui Jin",
      "Yanyan Xu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2306.03445",
    "title": "MetaGait: Learning to Learn an Omni Sample Adaptive Representation for  Gait Recognition",
    "abstract": "Gait recognition, which aims at identifying individuals by their walking patterns, has recently drawn increasing research attention. However, gait recognition still suffers from the conflicts between the limited binary visual clues of the silhouette and numerous covariates with diverse scales, which brings challenges to the model's adaptiveness. In this paper, we address this conflict by developing a novel MetaGait that learns to learn an omni sample adaptive representation. Towards this goal, MetaGait injects meta-knowledge, which could guide the model to perceive sample-specific properties, into the calibration network of the attention mechanism to improve the adaptiveness from the omni-scale, omni-dimension, and omni-process perspectives. Specifically, we leverage the meta-knowledge across the entire process, where Meta Triple Attention and Meta Temporal Pooling are presented respectively to adaptively capture omni-scale dependency from spatial/channel/temporal dimensions simultaneously and to adaptively aggregate temporal information through integrating the merits of three complementary temporal aggregation methods. Extensive experiments demonstrate the state-of-the-art performance of the proposed MetaGait. On CASIA-B, we achieve rank-1 accuracy of 98.7%, 96.0%, and 89.3% under three conditions, respectively. On OU-MVLP, we achieve rank-1 accuracy of 92.4%. ",
    "url": "https://arxiv.org/abs/2306.03445",
    "authors": [
      "Huanzhang Dou",
      "Pengyi Zhang",
      "Wei Su",
      "Yunlong Yu",
      "Xi Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03446",
    "title": "Computational Agent-based Models in Opinion Dynamics: A Survey on Social  Simulations and Empirical Studies",
    "abstract": "Understanding how an individual changes its attitude, belief, and opinion due to other people's social influences is vital because of its wide implications. A core methodology that is used to study the change of attitude under social influences is agent-based model (ABM). The goal of this review paper is to compare and contrast existing ABMs, which I classify into two families, the deductive ABMs and the inductive ABMs. The former subsumes social simulation studies, and the latter involves human experiments. To facilitate the comparison between ABMs of different formulations, I propose a general unified formulation, in which all ABMs can be viewed as special cases. In addition, I show the connections between deductive ABMs and inductive ABMs, and point out their strengths and limitations. At the end of the paper, I identify underexplored areas and suggest future research directions. ",
    "url": "https://arxiv.org/abs/2306.03446",
    "authors": [
      "Yun-Shiuan Chuang",
      "Timothy T. Rogers"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2306.03447",
    "title": "GRAFENNE: Learning on Graphs with Heterogeneous and Dynamic Feature Sets",
    "abstract": "Graph neural networks (GNNs), in general, are built on the assumption of a static set of features characterizing each node in a graph. This assumption is often violated in practice. Existing methods partly address this issue through feature imputation. However, these techniques (i) assume uniformity of feature set across nodes, (ii) are transductive by nature, and (iii) fail to work when features are added or removed over time. In this work, we address these limitations through a novel GNN framework called GRAFENNE. GRAFENNE performs a novel allotropic transformation on the original graph, wherein the nodes and features are decoupled through a bipartite encoding. Through a carefully chosen message passing framework on the allotropic transformation, we make the model parameter size independent of the number of features and thereby inductive to both unseen nodes and features. We prove that GRAFENNE is at least as expressive as any of the existing message-passing GNNs in terms of Weisfeiler-Leman tests, and therefore, the additional inductivity to unseen features does not come at the cost of expressivity. In addition, as demonstrated over four real-world graphs, GRAFENNE empowers the underlying GNN with high empirical efficacy and the ability to learn in continual fashion over streaming feature sets. ",
    "url": "https://arxiv.org/abs/2306.03447",
    "authors": [
      "Shubham Gupta",
      "Sahil Manchanda",
      "Sayan Ranu",
      "Srikanta Bedathur"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03454",
    "title": "Benchmarking Robustness of AI-enabled Multi-sensor Fusion Systems:  Challenges and Opportunities",
    "abstract": "Multi-Sensor Fusion (MSF) based perception systems have been the foundation in supporting many industrial applications and domains, such as self-driving cars, robotic arms, and unmanned aerial vehicles. Over the past few years, the fast progress in data-driven artificial intelligence (AI) has brought a fast-increasing trend to empower MSF systems by deep learning techniques to further improve performance, especially on intelligent systems and their perception systems. Although quite a few AI-enabled MSF perception systems and techniques have been proposed, up to the present, limited benchmarks that focus on MSF perception are publicly available. Given that many intelligent systems such as self-driving cars are operated in safety-critical contexts where perception systems play an important role, there comes an urgent need for a more in-depth understanding of the performance and reliability of these MSF systems. To bridge this gap, we initiate an early step in this direction and construct a public benchmark of AI-enabled MSF-based perception systems including three commonly adopted tasks (i.e., object detection, object tracking, and depth completion). Based on this, to comprehensively understand MSF systems' robustness and reliability, we design 14 common and realistic corruption patterns to synthesize large-scale corrupted datasets. We further perform a systematic evaluation of these systems through our large-scale evaluation. Our results reveal the vulnerability of the current AI-enabled MSF perception systems, calling for researchers and practitioners to take robustness and reliability into account when designing AI-enabled MSF. ",
    "url": "https://arxiv.org/abs/2306.03454",
    "authors": [
      "Xinyu Gao",
      "Zhijie Wang",
      "Yang Feng",
      "Lei Ma",
      "Zhenyu Chen",
      "Baowen Xu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03480",
    "title": "GSHOT: Few-shot Generative Modeling of Labeled Graphs",
    "abstract": "Deep graph generative modeling has gained enormous attraction in recent years due to its impressive ability to directly learn the underlying hidden graph distribution. Despite their initial success, these techniques, like much of the existing deep generative methods, require a large number of training samples to learn a good model. Unfortunately, large number of training samples may not always be available in scenarios such as drug discovery for rare diseases. At the same time, recent advances in few-shot learning have opened door to applications where available training data is limited. In this work, we introduce the hitherto unexplored paradigm of few-shot graph generative modeling. Towards this, we develop GSHOT, a meta-learning based framework for few-shot labeled graph generative modeling. GSHOT learns to transfer meta-knowledge from similar auxiliary graph datasets. Utilizing these prior experiences, GSHOT quickly adapts to an unseen graph dataset through self-paced fine-tuning. Through extensive experiments on datasets from diverse domains having limited training samples, we establish that GSHOT generates graphs of superior fidelity compared to existing baselines. ",
    "url": "https://arxiv.org/abs/2306.03480",
    "authors": [
      "Sahil Manchanda",
      "Shubham Gupta",
      "Sayan Ranu",
      "Srikanta Bedathur"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03490",
    "title": "Complexity of Anchored Crossing Number and Crossing Number of Almost  Planar Graphs",
    "abstract": "In this paper we deal with the problem of computing the exact crossing number of almost planar graphs and the closely related problem of computing the exact anchored crossing number of a pair of planar graphs. It was shown by [Cabello and Mohar, 2013] that both problems are NP-hard; although they required an unbounded number of high-degree vertices (in the first problem) or an unbounded number of anchors (in the second problem) to prove their result. Somehow surprisingly, only three vertices of degree greater than 3, or only three anchors, are sufficient to maintain hardness of these problems, as we prove here. The new result also improves the previous result on hardness of joint crossing number on surfaces by [Hlin\\v{e}n\\'y and Salazar, 2015]. Our result is best possible in the anchored case since the anchored crossing number of a pair of planar graphs with two anchors each is trivial, and close to being best possible in the almost planar case since the crossing number is efficiently computable for almost planar graphs of maximum degree 3 [Riskin 1996, Cabello and Mohar 2011]. ",
    "url": "https://arxiv.org/abs/2306.03490",
    "authors": [
      "Petr Hliněný"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2306.03492",
    "title": "Efficient Anomaly Detection with Budget Annotation Using Semi-Supervised  Residual Transformer",
    "abstract": "Anomaly Detection is challenging as usually only the normal samples are seen during training and the detector needs to discover anomalies on-the-fly. The recently proposed deep-learning-based approaches could somehow alleviate the problem but there is still a long way to go in obtaining an industrial-class anomaly detector for real-world applications. On the other hand, in some particular AD tasks, a few anomalous samples are labeled manually for achieving higher accuracy. However, this performance gain is at the cost of considerable annotation efforts, which can be intractable in many practical scenarios. In this work, the above two problems are addressed in a unified framework. Firstly, inspired by the success of the patch-matching-based AD algorithms, we train a sliding vision transformer over the residuals generated by a novel position-constrained patch-matching. Secondly, the conventional pixel-wise segmentation problem is cast into a block-wise classification problem. Thus the sliding transformer can attain even higher accuracy with much less annotation labor. Thirdly, to further reduce the labeling cost, we propose to label the anomalous regions using only bounding boxes. The unlabeled regions caused by the weak labels are effectively exploited using a highly-customized semi-supervised learning scheme equipped with two novel data augmentation methods. The proposed method outperforms all the state-of-the-art approaches using all the evaluation metrics in both the unsupervised and supervised scenarios. On the popular MVTec-AD dataset, our SemiREST algorithm obtains the Average Precision (AP) of 81.2% in the unsupervised condition and 84.4% AP for supervised anomaly detection. Surprisingly, with the bounding-box-based semi-supervisions, SemiREST still outperforms the SOTA methods with full supervision (83.8% AP) on MVTec-AD. ",
    "url": "https://arxiv.org/abs/2306.03492",
    "authors": [
      "Hanxi Li",
      "Jingqi Wu",
      "Hao Chen",
      "Mingwen Wang",
      "Chunhua Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03500",
    "title": "Towards Adaptable and Interactive Image Captioning with Data  Augmentation and Episodic Memory",
    "abstract": "Interactive machine learning (IML) is a beneficial learning paradigm in cases of limited data availability, as human feedback is incrementally integrated into the training process. In this paper, we present an IML pipeline for image captioning which allows us to incrementally adapt a pre-trained image captioning model to a new data distribution based on user input. In order to incorporate user input into the model, we explore the use of a combination of simple data augmentation methods to obtain larger data batches for each newly annotated data instance and implement continual learning methods to prevent catastrophic forgetting from repeated updates. For our experiments, we split a domain-specific image captioning dataset, namely VizWiz, into non-overlapping parts to simulate an incremental input flow for continually adapting the model to new data. We find that, while data augmentation worsens results, even when relatively small amounts of data are available, episodic memory is an effective strategy to retain knowledge from previously seen clusters. ",
    "url": "https://arxiv.org/abs/2306.03500",
    "authors": [
      "Aliki Anagnostopoulou",
      "Mareike Hartmann",
      "Daniel Sonntag"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03502",
    "title": "Russo-Ukrainian War: Prediction and explanation of Twitter suspension",
    "abstract": "On 24 February 2022, Russia invaded Ukraine, starting what is now known as the Russo-Ukrainian War, initiating an online discourse on social media. Twitter as one of the most popular SNs, with an open and democratic character, enables a transparent discussion among its large user base. Unfortunately, this often leads to Twitter's policy violations, propaganda, abusive actions, civil integrity violation, and consequently to user accounts' suspension and deletion. This study focuses on the Twitter suspension mechanism and the analysis of shared content and features of the user accounts that may lead to this. Toward this goal, we have obtained a dataset containing 107.7M tweets, originating from 9.8 million users, using Twitter API. We extract the categories of shared content of the suspended accounts and explain their characteristics, through the extraction of text embeddings in junction with cosine similarity clustering. Our results reveal scam campaigns taking advantage of trending topics regarding the Russia-Ukrainian conflict for Bitcoin and Ethereum fraud, spam, and advertisement campaigns. Additionally, we apply a machine learning methodology including a SHapley Additive explainability model to understand and explain how user accounts get suspended. ",
    "url": "https://arxiv.org/abs/2306.03502",
    "authors": [
      "Alexander Shevtsov",
      "Despoina Antonakaki",
      "Ioannis Lamprou",
      "Ioannis Kontogiorgakis",
      "Polyvios Pratikakis",
      "Sotiris Ioannidis"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03506",
    "title": "Subgraph Networks Based Contrastive Learning",
    "abstract": "Graph contrastive learning (GCL), as a self-supervised learning method, can solve the problem of annotated data scarcity. It mines explicit features in unannotated graphs to generate favorable graph representations for downstream tasks. Most existing GCL methods focus on the design of graph augmentation strategies and mutual information estimation operations. Graph augmentation produces augmented views by graph perturbations. These views preserve a locally similar structure and exploit explicit features. However, these methods have not considered the interaction existing in subgraphs. To explore the impact of substructure interactions on graph representations, we propose a novel framework called subgraph network-based contrastive learning (SGNCL). SGNCL applies a subgraph network generation strategy to produce augmented views. This strategy converts the original graph into an Edge-to-Node mapping network with both topological and attribute features. The single-shot augmented view is a first-order subgraph network that mines the interaction between nodes, node-edge, and edges. In addition, we also investigate the impact of the second-order subgraph augmentation on mining graph structure interactions, and further, propose a contrastive objective that fuses the first-order and second-order subgraph information. We compare SGNCL with classical and state-of-the-art graph contrastive learning methods on multiple benchmark datasets of different domains. Extensive experiments show that SGNCL achieves competitive or better performance (top three) on all datasets in unsupervised learning settings. Furthermore, SGNCL achieves the best average gain of 6.9\\% in transfer learning compared to the best method. Finally, experiments also demonstrate that mining substructure interactions have positive implications for graph contrastive learning. ",
    "url": "https://arxiv.org/abs/2306.03506",
    "authors": [
      "Jinhuan Wang",
      "Jiafei Shao",
      "Zeyu Wang",
      "Shanqing Yu",
      "Qi Xuan",
      "Xiaoniu Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03515",
    "title": "Logic Diffusion for Knowledge Graph Reasoning",
    "abstract": "Most recent works focus on answering first order logical queries to explore the knowledge graph reasoning via multi-hop logic predictions. However, existing reasoning models are limited by the circumscribed logical paradigms of training samples, which leads to a weak generalization of unseen logic. To address these issues, we propose a plug-in module called Logic Diffusion (LoD) to discover unseen queries from surroundings and achieves dynamical equilibrium between different kinds of patterns. The basic idea of LoD is relation diffusion and sampling sub-logic by random walking as well as a special training mechanism called gradient adaption. Besides, LoD is accompanied by a novel loss function to further achieve the robust logical diffusion when facing noisy data in training or testing sets. Extensive experiments on four public datasets demonstrate the superiority of mainstream knowledge graph reasoning models with LoD over state-of-the-art. Moreover, our ablation study proves the general effectiveness of LoD on the noise-rich knowledge graph. ",
    "url": "https://arxiv.org/abs/2306.03515",
    "authors": [
      "Xiaoying Xie",
      "Biao Gong",
      "Yiliang Lv",
      "Zhen Han",
      "Guoshuai Zhao",
      "Xueming Qian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2306.03517",
    "title": "dMAPAR-HMM: Reforming Traffic Model for Improving Performance Bound with  Stochastic Network Calculus",
    "abstract": "A popular branch of stochastic network calculus (SNC) utilizes moment-generating functions (MGFs) to characterize arrivals and services, which enables end-to-end performance analysis. However, existing traffic models for SNC cannot effectively represent the complicated nature of real-world network traffic such as dramatic burstiness. To conquer this challenge, we propose an adaptive spatial-temporal traffic model: dMAPAR-HMM. Specifically, we model the temporal on-off switching process as a dual Markovian arrival process (dMAP) and the arrivals during the on phases as an autoregressive hidden Markov model (AR-HMM). The dMAPAR-HMM model fits in with the MGF-SNC analysis framework, unifies various state-of-the-art arrival models, and matches real-world data more closely. We perform extensive experiments with real-world traces under different network topologies and utilization levels. Experimental results show that dMAPAR-HMM significantly outperforms prevailing models in MGF-SNC. ",
    "url": "https://arxiv.org/abs/2306.03517",
    "authors": [
      "Qingqing Yang",
      "Xi Peng",
      "Huiwen Yang",
      "Gong Zhang",
      "Bo Bai"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2306.03522",
    "title": "A Functional Data Perspective and Baseline On Multi-Layer  Out-of-Distribution Detection",
    "abstract": "A key feature of out-of-distribution (OOD) detection is to exploit a trained neural network by extracting statistical patterns and relationships through the multi-layer classifier to detect shifts in the expected input data distribution. Despite achieving solid results, several state-of-the-art methods rely on the penultimate or last layer outputs only, leaving behind valuable information for OOD detection. Methods that explore the multiple layers either require a special architecture or a supervised objective to do so. This work adopts an original approach based on a functional view of the network that exploits the sample's trajectories through the various layers and their statistical dependencies. It goes beyond multivariate features aggregation and introduces a baseline rooted in functional anomaly detection. In this new framework, OOD detection translates into detecting samples whose trajectories differ from the typical behavior characterized by the training set. We validate our method and empirically demonstrate its effectiveness in OOD detection compared to strong state-of-the-art baselines on computer vision benchmarks. ",
    "url": "https://arxiv.org/abs/2306.03522",
    "authors": [
      "Eduardo Dadalto",
      "Pierre Colombo",
      "Guillaume Staerman",
      "Nathan Noiry",
      "Pablo Piantanida"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2306.03527",
    "title": "Rec4Ad: A Free Lunch to Mitigate Sample Selection Bias for Ads CTR  Prediction in Taobao",
    "abstract": "Click-Through Rate (CTR) prediction serves as a fundamental component in online advertising. A common practice is to train a CTR model on advertisement (ad) impressions with user feedback. Since ad impressions are purposely selected by the model itself, their distribution differs from the inference distribution and thus exhibits sample selection bias (SSB) that affects model performance. Existing studies on SSB mainly employ sample re-weighting techniques which suffer from high variance and poor model calibration. Another line of work relies on costly uniform data that is inadequate to train industrial models. Thus mitigating SSB in industrial models with a uniform-data-free framework is worth exploring. Fortunately, many platforms display mixed results of organic items (i.e., recommendations) and sponsored items (i.e., ads) to users, where impressions of ads and recommendations are selected by different systems but share the same user decision rationales. Based on the above characteristics, we propose to leverage recommendations samples as a free lunch to mitigate SSB for ads CTR model (Rec4Ad). After elaborating data augmentation, Rec4Ad learns disentangled representations with alignment and decorrelation modules for enhancement. When deployed in Taobao display advertising system, Rec4Ad achieves substantial gains in key business metrics, with a lift of up to +6.6\\% CTR and +2.9\\% RPM. ",
    "url": "https://arxiv.org/abs/2306.03527",
    "authors": [
      "Jingyue Gao",
      "Shuguang Han",
      "Han Zhu",
      "Siran Yang",
      "Yuning Jiang",
      "Jian Xu",
      "Bo Zheng"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03528",
    "title": "Adversarial Attacks and Defenses for Semantic Communication in Vehicular  Metaverses",
    "abstract": "For vehicular metaverses, one of the ultimate user-centric goals is to optimize the immersive experience and Quality of Service (QoS) for users on board. Semantic Communication (SemCom) has been introduced as a revolutionary paradigm that significantly eases communication resource pressure for vehicular metaverse applications to achieve this goal. SemCom enables high-quality and ultra-efficient vehicular communication, even with explosively increasing data traffic among vehicles. In this article, we propose a hierarchical SemCom-enabled vehicular metaverses framework consisting of the global metaverse, local metaverses, SemCom module, and resource pool. The global and local metaverses are brand-new concepts from the metaverse's distribution standpoint. Considering the QoS of users, this article explores the potential security vulnerabilities of the proposed framework. To that purpose, this study highlights a specific security risk to the framework's SemCom module and offers a viable defense solution, so encouraging community researchers to focus more on vehicular metaverse security. Finally, we provide an overview of the open issues of secure SemCom in the vehicular metaverses, notably pointing out potential future research directions. ",
    "url": "https://arxiv.org/abs/2306.03528",
    "authors": [
      "Jiawen Kang",
      "Jiayi He",
      "Hongyang Du",
      "Zehui Xiong",
      "Zhaohui Yang",
      "Xumin Huang",
      "Shengli Xie"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03537",
    "title": "Real-Time Onboard Object Detection for Augmented Reality: Enhancing  Head-Mounted Display with YOLOv8",
    "abstract": "This paper introduces a software architecture for real-time object detection using machine learning (ML) in an augmented reality (AR) environment. Our approach uses the recent state-of-the-art YOLOv8 network that runs onboard on the Microsoft HoloLens 2 head-mounted display (HMD). The primary motivation behind this research is to enable the application of advanced ML models for enhanced perception and situational awareness with a wearable, hands-free AR platform. We show the image processing pipeline for the YOLOv8 model and the techniques used to make it real-time on the resource-limited edge computing platform of the headset. The experimental results demonstrate that our solution achieves real-time processing without needing offloading tasks to the cloud or any other external servers while retaining satisfactory accuracy regarding the usual mAP metric and measured qualitative performance ",
    "url": "https://arxiv.org/abs/2306.03537",
    "authors": [
      "Mikołaj Łysakowski",
      "Kamil Żywanowski",
      "Adam Banaszczyk",
      "Michał R. Nowicki",
      "Piotr Skrzypczyński",
      "Sławomir K. Tadeja"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2306.03540",
    "title": "Greedy-Mine: A Profitable Mining Attack Strategy in Bitcoin-NG",
    "abstract": "Bitcoin-NG is an extensible blockchain protocol based on the same trust model as Bitcoin. It divides each epoch into one Key-Block and multiple Micro-Blocks, effectively improving transaction processing capacity. Bitcoin-NG adopts a special incentive mechanism (i.e., the transaction fees in each epoch are split to the current and next leader) to maintain its security. However, there are some limitations to the existing incentive analysis of Bitcoin-NG in recent works. First, the incentive division method of Bitcoin-NG only includes some specific mining attack strategies of adversary, while ignoring more stubborn attack strategies. Second, once adversaries find a whale transaction, they will deviate from honest mining strategy to obtain extra reward. In this paper, we are committed to solving these two limitations. First, we propose a novel mining strategy named Greedy-Mine attack. Then, we formulate a Markov Decision Process (MDP) model to analyze the competition of honest miners and adversaries. Furthermore, we analysis the extra reward of adversaries and summarize the mining power proportion range required for malicious adversaries to launch Greedy-Mine to obtain extra returns. Finally, we make a backward-compatibility progressive modification to Bitcoin-NG protocol that would raise the threshold of propagation factor from 0 to 1. Meanwhile, we get the winning condition of adversaries when adopting Greedy-Mine, compared with honest mining. Simulation and experimental results indicate that Bitcoin-NG is not incentive compatible, which is vulnerable to Greedy-Mine attack. ",
    "url": "https://arxiv.org/abs/2306.03540",
    "authors": [
      "Junjie Hu",
      "Zhe Jiang",
      "Chunxiang Xu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2306.03576",
    "title": "Human 3D Avatar Modeling with Implicit Neural Representation: A Brief  Survey",
    "abstract": "A human 3D avatar is one of the important elements in the metaverse, and the modeling effect directly affects people's visual experience. However, the human body has a complex topology and diverse details, so it is often expensive, time-consuming, and laborious to build a satisfactory model. Recent studies have proposed a novel method, implicit neural representation, which is a continuous representation method and can describe objects with arbitrary topology at arbitrary resolution. Researchers have applied implicit neural representation to human 3D avatar modeling and obtained more excellent results than traditional methods. This paper comprehensively reviews the application of implicit neural representation in human body modeling. First, we introduce three implicit representations of occupancy field, SDF, and NeRF, and make a classification of the literature investigated in this paper. Then the application of implicit modeling methods in the body, hand, and head are compared and analyzed respectively. Finally, we point out the shortcomings of current work and provide available suggestions for researchers. ",
    "url": "https://arxiv.org/abs/2306.03576",
    "authors": [
      "Mingyang Sun",
      "Dingkang Yang",
      "Dongliang Kou",
      "Yang Jiang",
      "Weihua Shan",
      "Zhe Yan",
      "Lihua Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03577",
    "title": "An Open Patch Generator based Fingerprint Presentation Attack Detection  using Generative Adversarial Network",
    "abstract": "The low-cost, user-friendly, and convenient nature of Automatic Fingerprint Recognition Systems (AFRS) makes them suitable for a wide range of applications. This spreading use of AFRS also makes them vulnerable to various security threats. Presentation Attack (PA) or spoofing is one of the threats which is caused by presenting a spoof of a genuine fingerprint to the sensor of AFRS. Fingerprint Presentation Attack Detection (FPAD) is a countermeasure intended to protect AFRS against fake or spoof fingerprints created using various fabrication materials. In this paper, we have proposed a Convolutional Neural Network (CNN) based technique that uses a Generative Adversarial Network (GAN) to augment the dataset with spoof samples generated from the proposed Open Patch Generator (OPG). This OPG is capable of generating realistic fingerprint samples which have no resemblance to the existing spoof fingerprint samples generated with other materials. The augmented dataset is fed to the DenseNet classifier which helps in increasing the performance of the Presentation Attack Detection (PAD) module for the various real-world attacks possible with unknown spoof materials. Experimental evaluations of the proposed approach are carried out on the Liveness Detection (LivDet) 2015, 2017, and 2019 competition databases. An overall accuracy of 96.20\\%, 94.97\\%, and 92.90\\% has been achieved on the LivDet 2015, 2017, and 2019 databases, respectively under the LivDet protocol scenarios. The performance of the proposed PAD model is also validated in the cross-material and cross-sensor attack paradigm which further exhibits its capability to be used under real-world attack scenarios. ",
    "url": "https://arxiv.org/abs/2306.03577",
    "authors": [
      "Anuj Rai",
      "Ashutosh Anshul",
      "Ashwini Jha",
      "Prayag Jain",
      "Ramprakash Sharma",
      "Somnath Dey"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03594",
    "title": "Emotional Talking Head Generation based on Memory-Sharing and  Attention-Augmented Networks",
    "abstract": "Given an audio clip and a reference face image, the goal of the talking head generation is to generate a high-fidelity talking head video. Although some audio-driven methods of generating talking head videos have made some achievements in the past, most of them only focused on lip and audio synchronization and lack the ability to reproduce the facial expressions of the target person. To this end, we propose a talking head generation model consisting of a Memory-Sharing Emotion Feature extractor (MSEF) and an Attention-Augmented Translator based on U-net (AATU). Firstly, MSEF can extract implicit emotional auxiliary features from audio to estimate more accurate emotional face landmarks.~Secondly, AATU acts as a translator between the estimated landmarks and the photo-realistic video frames. Extensive qualitative and quantitative experiments have shown the superiority of the proposed method to the previous works. Codes will be made publicly available. ",
    "url": "https://arxiv.org/abs/2306.03594",
    "authors": [
      "Jianrong Wang",
      "Yaxin Zhao",
      "Li Liu",
      "Tianyi Xu",
      "Qi Li",
      "Sen Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03597",
    "title": "Human-Object Interaction Prediction in Videos through Gaze Following",
    "abstract": "Understanding the human-object interactions (HOIs) from a video is essential to fully comprehend a visual scene. This line of research has been addressed by detecting HOIs from images and lately from videos. However, the video-based HOI anticipation task in the third-person view remains understudied. In this paper, we design a framework to detect current HOIs and anticipate future HOIs in videos. We propose to leverage human gaze information since people often fixate on an object before interacting with it. These gaze features together with the scene contexts and the visual appearances of human-object pairs are fused through a spatio-temporal transformer. To evaluate the model in the HOI anticipation task in a multi-person scenario, we propose a set of person-wise multi-label metrics. Our model is trained and validated on the VidHOI dataset, which contains videos capturing daily life and is currently the largest video HOI dataset. Experimental results in the HOI detection task show that our approach improves the baseline by a great margin of 36.3% relatively. Moreover, we conduct an extensive ablation study to demonstrate the effectiveness of our modifications and extensions to the spatio-temporal transformer. Our code is publicly available on https://github.com/nizhf/hoi-prediction-gaze-transformer. ",
    "url": "https://arxiv.org/abs/2306.03597",
    "authors": [
      "Zhifan Ni",
      "Esteve Valls Mascaró",
      "Hyemin Ahn",
      "Dongheui Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03600",
    "title": "Avoid Adversarial Adaption in Federated Learning by Multi-Metric  Investigations",
    "abstract": "Federated Learning (FL) trains machine learning models on data distributed across multiple devices, avoiding data transfer to a central location. This improves privacy, reduces communication costs, and enhances model performance. However, FL is prone to poisoning attacks, which can be untargeted aiming to reduce the model performance, or targeted, so-called backdoors, which add adversarial behavior that can be triggered with appropriately crafted inputs. Striving for stealthiness, backdoor attacks are harder to deal with. Mitigation techniques against poisoning attacks rely on monitoring certain metrics and filtering malicious model updates. However, previous works didn't consider real-world adversaries and data distributions. To support our statement, we define a new notion of strong adaptive adversaries that can simultaneously adapt to multiple objectives and demonstrate through extensive tests, that existing defense methods can be circumvented in this adversary model. We also demonstrate, that existing defenses have limited effectiveness when no assumptions are made about underlying data distributions. To address realistic scenarios and adversary models, we propose Metric-Cascades (MESAS) a new defense that leverages multiple detection metrics simultaneously for the filtering of poisoned model updates. This approach forces adaptive attackers into a heavy multi-objective optimization problem, and our evaluation with nine backdoors and three datasets shows that even our strong adaptive attacker cannot evade MESAS's detection. We show that MESAS outperforms existing defenses in distinguishing backdoors from distortions originating from different data distributions within and across the clients. Overall, MESAS is the first defense that is robust against strong adaptive adversaries and is effective in real-world data scenarios while introducing a low overhead of 24.37s on average. ",
    "url": "https://arxiv.org/abs/2306.03600",
    "authors": [
      "Torsten Krauß",
      "Alexandra Dmitrienko"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03606",
    "title": "BioBLP: A Modular Framework for Learning on Multimodal Biomedical  Knowledge Graphs",
    "abstract": "Knowledge graphs (KGs) are an important tool for representing complex relationships between entities in the biomedical domain. Several methods have been proposed for learning embeddings that can be used to predict new links in such graphs. Some methods ignore valuable attribute data associated with entities in biomedical KGs, such as protein sequences, or molecular graphs. Other works incorporate such data, but assume that entities can be represented with the same data modality. This is not always the case for biomedical KGs, where entities exhibit heterogeneous modalities that are central to their representation in the subject domain. We propose a modular framework for learning embeddings in KGs with entity attributes, that allows encoding attribute data of different modalities while also supporting entities with missing attributes. We additionally propose an efficient pretraining strategy for reducing the required training runtime. We train models using a biomedical KG containing approximately 2 million triples, and evaluate the performance of the resulting entity embeddings on the tasks of link prediction, and drug-protein interaction prediction, comparing against methods that do not take attribute data into account. In the standard link prediction evaluation, the proposed method results in competitive, yet lower performance than baselines that do not use attribute data. When evaluated in the task of drug-protein interaction prediction, the method compares favorably with the baselines. We find settings involving low degree entities, which make up for a substantial amount of the set of entities in the KG, where our method outperforms the baselines. Our proposed pretraining strategy yields significantly higher performance while reducing the required training runtime. Our implementation is available at https://github.com/elsevier-AI-Lab/BioBLP . ",
    "url": "https://arxiv.org/abs/2306.03606",
    "authors": [
      "Daniel Daza",
      "Dimitrios Alivanistos",
      "Payal Mitra",
      "Thom Pijnenburg",
      "Michael Cochez",
      "Paul Groth"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03617",
    "title": "A Data-Efficient Approach for Long-Term Human Motion Prediction Using  Maps of Dynamics",
    "abstract": "Human motion prediction is essential for the safe and smooth operation of mobile service robots and intelligent vehicles around people. Commonly used neural network-based approaches often require large amounts of complete trajectories to represent motion dynamics in complex semantically-rich spaces. This requirement may complicate deployment of physical systems in new environments, especially when the data is being collected online from onboard sensors. In this paper we explore a data-efficient alternative using maps of dynamics (MoD) to represent place-dependent multi-modal spatial motion patterns, learned from prior observations. Our approach can perform efficient human motion prediction in the long-term perspective of up to 60 seconds. We quantitatively evaluate its accuracy with limited amount of training data in comparison to an LSTM-based baseline, and qualitatively show that the predicted trajectories reflect the natural semantic properties of the environment, e.g. the locations of short- and long-term goals, navigation in narrow passages, around obstacles, etc. ",
    "url": "https://arxiv.org/abs/2306.03617",
    "authors": [
      "Yufei Zhu",
      "Andrey Rudenko",
      "Tomasz P. Kucner",
      "Achim J. Lilienthal",
      "Martin Magnusson"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2306.03623",
    "title": "Spike-based computation using classical recurrent neural networks",
    "abstract": "Spiking neural networks are a type of artificial neural networks in which communication between neurons is only made of events, also called spikes. This property allows neural networks to make asynchronous and sparse computations and therefore to drastically decrease energy consumption when run on specialized hardware. However, training such networks is known to be difficult, mainly due to the non-differentiability of the spike activation, which prevents the use of classical backpropagation. This is because state-of-the-art spiking neural networks are usually derived from biologically-inspired neuron models, to which are applied machine learning methods for training. Nowadays, research about spiking neural networks focuses on the design of training algorithms whose goal is to obtain networks that compete with their non-spiking version on specific tasks. In this paper, we attempt the symmetrical approach: we modify the dynamics of a well-known, easily trainable type of recurrent neural network to make it event-based. This new RNN cell, called the Spiking Recurrent Cell, therefore communicates using events, i.e. spikes, while being completely differentiable. Vanilla backpropagation can thus be used to train any network made of such RNN cell. We show that this new network can achieve performance comparable to other types of spiking networks in the MNIST benchmark and its variants, the Fashion-MNIST and the Neuromorphic-MNIST. Moreover, we show that this new cell makes the training of deep spiking networks achievable. ",
    "url": "https://arxiv.org/abs/2306.03623",
    "authors": [
      "Florent De Geeter",
      "Damien Ernst",
      "Guillaume Drion"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03624",
    "title": "On Manipulating Signals of User-Item Graph: A Jacobi Polynomial-based  Graph Collaborative Filtering",
    "abstract": "Collaborative filtering (CF) is an important research direction in recommender systems that aims to make recommendations given the information on user-item interactions. Graph CF has attracted more and more attention in recent years due to its effectiveness in leveraging high-order information in the user-item bipartite graph for better recommendations. Specifically, recent studies show the success of graph neural networks (GNN) for CF is attributed to its low-pass filtering effects. However, current researches lack a study of how different signal components contributes to recommendations, and how to design strategies to properly use them well. To this end, from the view of spectral transformation, we analyze the important factors that a graph filter should consider to achieve better performance. Based on the discoveries, we design JGCF, an efficient and effective method for CF based on Jacobi polynomial bases and frequency decomposition strategies. Extensive experiments on four widely used public datasets show the effectiveness and efficiency of the proposed methods, which brings at most 27.06% performance gain on Alibaba-iFashion. Besides, the experimental results also show that JGCF is better at handling sparse datasets, which shows potential in making recommendations for cold-start users. ",
    "url": "https://arxiv.org/abs/2306.03624",
    "authors": [
      "Jiayan Guo",
      "Lun Du",
      "Xu Chen",
      "Xiaojun Ma",
      "Qiang Fu",
      "Shi Han",
      "Dongmei Zhang",
      "Yan Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03630",
    "title": "Mutual Information Regularization for Weakly-supervised RGB-D Salient  Object Detection",
    "abstract": "In this paper, we present a weakly-supervised RGB-D salient object detection model via scribble supervision. Specifically, as a multimodal learning task, we focus on effective multimodal representation learning via inter-modal mutual information regularization. In particular, following the principle of disentangled representation learning, we introduce a mutual information upper bound with a mutual information minimization regularizer to encourage the disentangled representation of each modality for salient object detection. Based on our multimodal representation learning framework, we introduce an asymmetric feature extractor for our multimodal data, which is proven more effective than the conventional symmetric backbone setting. We also introduce multimodal variational auto-encoder as stochastic prediction refinement techniques, which takes pseudo labels from the first training stage as supervision and generates refined prediction. Experimental results on benchmark RGB-D salient object detection datasets verify both effectiveness of our explicit multimodal disentangled representation learning method and the stochastic prediction refinement strategy, achieving comparable performance with the state-of-the-art fully supervised models. Our code and data are available at: https://github.com/baneitixiaomai/MIRV. ",
    "url": "https://arxiv.org/abs/2306.03630",
    "authors": [
      "Aixuan Li",
      "Yuxin Mao",
      "Jing Zhang",
      "Yuchao Dai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03640",
    "title": "Tight Complexity Bounds for Counting Generalized Dominating Sets in  Bounded-Treewidth Graphs Part II: Hardness Results",
    "abstract": "For a well-studied family of domination-type problems, in bounded-treewidth graphs, we investigate whether it is possible to find faster algorithms. For sets $\\sigma,\\rho$ of non-negative integers, a $(\\sigma,\\rho)$-set of a graph $G$ is a set $S$ of vertices such that $|N(u)\\cap S|\\in \\sigma$ for every $u\\in S$, and $|N(v)\\cap S|\\in \\rho$ for every $v\\not\\in S$. The problem of finding a $(\\sigma,\\rho)$-set (of a certain size) unifies common problems like $\\text{Independent Set}$, $\\text{Dominating Set}$, $\\text{Independent Dominating Set}$, and many others. In an accompanying paper, it is proven that, for all pairs of finite or cofinite sets $(\\sigma,\\rho)$, there is an algorithm that counts $(\\sigma,\\rho)$-sets in time $(c_{\\sigma,\\rho})^{\\text{tw}}\\cdot n^{O(1)}$ (if a tree decomposition of width $\\text{tw}$ is given in the input). Here, $c_{\\sigma,\\rho}$ is a constant with an intricate dependency on $\\sigma$ and $\\rho$. Despite this intricacy, we show that the algorithms in the accompanying paper are most likely optimal, i.e., for any pair $(\\sigma, \\rho)$ of finite or cofinite sets where the problem is non-trivial, and any $\\varepsilon>0$, a $(c_{\\sigma,\\rho}-\\varepsilon)^{\\text{tw}}\\cdot n^{O(1)}$-algorithm counting the number of $(\\sigma,\\rho)$-sets would violate the Counting Strong Exponential-Time Hypothesis ($\\#$SETH). For finite sets $\\sigma$ and $\\rho$, our lower bounds also extend to the decision version, showing that those algorithms are optimal in this setting as well. ",
    "url": "https://arxiv.org/abs/2306.03640",
    "authors": [
      "Jacob Focke",
      "Dániel Marx",
      "Fionn Mc Inerney",
      "Daniel Neuen",
      "Govind S. Sankar",
      "Philipp Schepper",
      "Philip Wellnitz"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2306.03645",
    "title": "Novel DeepONet architecture to predict stresses in elastoplastic  structures with variable complex geometries and loads",
    "abstract": "A novel deep operator network (DeepONet) with a residual U-Net (ResUNet) as the trunk network is devised to predict full-field highly nonlinear elastic-plastic stress response for complex geometries obtained from topology optimization under variable loads. The proposed DeepONet uses a ResUNet in the trunk to encode complex input geometries, and a fully-connected branch network encodes the parametric loads. Additional information fusion is introduced via an element-wise multiplication of the encoded latent space to improve prediction accuracy further. The performance of the proposed DeepONet was compared to two baseline models, a standalone ResUNet and a DeepONet with fully connected networks as the branch and trunk. The results show that ResUNet and the proposed DeepONet share comparable accuracy; both can predict the stress field and accurately identify stress concentration points. However, the novel DeepONet is more memory efficient and allows greater flexibility with framework architecture modifications. The DeepONet with fully connected networks suffers from high prediction error due to its inability to effectively encode the complex, varying geometry. Once trained, all three networks can predict the full stress distribution orders of magnitude faster than finite element simulations. The proposed network can quickly guide preliminary optimization, designs, sensitivity analysis, uncertainty quantification, and many other nonlinear analyses that require extensive forward evaluations with variable geometries, loads, and other parameters. This work marks the first time a ResUNet is used as the trunk network in the DeepONet architecture and the first time that DeepONet solves problems with complex, varying input geometries under parametric loads and elasto-plastic material behavior. ",
    "url": "https://arxiv.org/abs/2306.03645",
    "authors": [
      "Junyan He",
      "Seid Koric",
      "Shashank Kushwaha",
      "Jaewan Park",
      "Diab Abueidda",
      "Iwona Jasiuk"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2306.03647",
    "title": "Proximal Symmetric Non-negative Latent Factor Analysis: A Novel Approach  to Highly-Accurate Representation of Undirected Weighted Networks",
    "abstract": "An Undirected Weighted Network (UWN) is commonly found in big data-related applications. Note that such a network's information connected with its nodes, and edges can be expressed as a Symmetric, High-Dimensional and Incomplete (SHDI) matrix. However, existing models fail in either modeling its intrinsic symmetry or low-data density, resulting in low model scalability or representation learning ability. For addressing this issue, a Proximal Symmetric Nonnegative Latent-factor-analysis (PSNL) model is proposed. It incorporates a proximal term into symmetry-aware and data density-oriented objective function for high representation accuracy. Then an adaptive Alternating Direction Method of Multipliers (ADMM)-based learning scheme is implemented through a Tree-structured of Parzen Estimators (TPE) method for high computational efficiency. Empirical studies on four UWNs demonstrate that PSNL achieves higher accuracy gain than state-of-the-art models, as well as highly competitive computational efficiency. ",
    "url": "https://arxiv.org/abs/2306.03647",
    "authors": [
      "Yurong Zhong",
      "Zhe Xie",
      "Weiling Li",
      "Xin Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03655",
    "title": "Online Learning under Adversarial Nonlinear Constraints",
    "abstract": "In many applications, learning systems are required to process continuous non-stationary data streams. We study this problem in an online learning framework and propose an algorithm that can deal with adversarial time-varying and nonlinear constraints. As we show in our work, the algorithm called Constraint Violation Velocity Projection (CVV-Pro) achieves $\\sqrt{T}$ regret and converges to the feasible set at a rate of $1/\\sqrt{T}$, despite the fact that the feasible set is slowly time-varying and a priori unknown to the learner. CVV-Pro only relies on local sparse linear approximations of the feasible set and therefore avoids optimizing over the entire set at each iteration, which is in sharp contrast to projected gradients or Frank-Wolfe methods. We also empirically evaluate our algorithm on two-player games, where the players are subjected to a shared constraint. ",
    "url": "https://arxiv.org/abs/2306.03655",
    "authors": [
      "Pavel Kolev",
      "Georg Martius",
      "Michael Muehlebach"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2306.03659",
    "title": "Schema First! Learn Versatile Knowledge Graph Embeddings by Capturing  Semantics with MASCHInE",
    "abstract": "Knowledge graph embedding models (KGEMs) have gained considerable traction in recent years. These models learn a vector representation of knowledge graph entities and relations, a.k.a. knowledge graph embeddings (KGEs). Learning versatile KGEs is desirable as it makes them useful for a broad range of tasks. However, KGEMs are usually trained for a specific task, which makes their embeddings task-dependent. In parallel, the widespread assumption that KGEMs actually create a semantic representation of the underlying entities and relations (e.g., project similar entities closer than dissimilar ones) has been challenged. In this work, we design heuristics for generating protographs -- small, modified versions of a KG that leverage schema-based information. The learnt protograph-based embeddings are meant to encapsulate the semantics of a KG, and can be leveraged in learning KGEs that, in turn, also better capture semantics. Extensive experiments on various evaluation benchmarks demonstrate the soundness of this approach, which we call Modular and Agnostic SCHema-based Integration of protograph Embeddings (MASCHInE). In particular, MASCHInE helps produce more versatile KGEs that yield substantially better performance for entity clustering and node classification tasks. For link prediction, using MASCHInE has little impact on rank-based performance but increases the number of semantically valid predictions. ",
    "url": "https://arxiv.org/abs/2306.03659",
    "authors": [
      "Nicolas Hubert",
      "Heiko Paulheim",
      "Pierre Monnin",
      "Armelle Brun",
      "Davy Monticolo"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03686",
    "title": "YONA: You Only Need One Adjacent Reference-frame for Accurate and Fast  Video Polyp Detection",
    "abstract": "Accurate polyp detection is essential for assisting clinical rectal cancer diagnoses. Colonoscopy videos contain richer information than still images, making them a valuable resource for deep learning methods. Great efforts have been made to conduct video polyp detection through multi-frame temporal/spatial aggregation. However, unlike common fixed-camera video, the camera-moving scene in colonoscopy videos can cause rapid video jitters, leading to unstable training for existing video detection models. Additionally, the concealed nature of some polyps and the complex background environment further hinder the performance of existing video detectors. In this paper, we propose the \\textbf{YONA} (\\textbf{Y}ou \\textbf{O}nly \\textbf{N}eed one \\textbf{A}djacent Reference-frame) method, an efficient end-to-end training framework for video polyp detection. YONA fully exploits the information of one previous adjacent frame and conducts polyp detection on the current frame without multi-frame collaborations. Specifically, for the foreground, YONA adaptively aligns the current frame's channel activation patterns with its adjacent reference frames according to their foreground similarity. For the background, YONA conducts background dynamic alignment guided by inter-frame difference to eliminate the invalid features produced by drastic spatial jitters. Moreover, YONA applies cross-frame contrastive learning during training, leveraging the ground truth bounding box to improve the model's perception of polyp and background. Quantitative and qualitative experiments on three public challenging benchmarks demonstrate that our proposed YONA outperforms previous state-of-the-art competitors by a large margin in both accuracy and speed. ",
    "url": "https://arxiv.org/abs/2306.03686",
    "authors": [
      "Yuncheng Jiang",
      "Zixun Zhang",
      "Ruimao Zhang",
      "Guanbin Li",
      "Shuguang Cui",
      "Zhen Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03693",
    "title": "ESL-SNNs: An Evolutionary Structure Learning Strategy for Spiking Neural  Networks",
    "abstract": "Spiking neural networks (SNNs) have manifested remarkable advantages in power consumption and event-driven property during the inference process. To take full advantage of low power consumption and improve the efficiency of these models further, the pruning methods have been explored to find sparse SNNs without redundancy connections after training. However, parameter redundancy still hinders the efficiency of SNNs during training. In the human brain, the rewiring process of neural networks is highly dynamic, while synaptic connections maintain relatively sparse during brain development. Inspired by this, here we propose an efficient evolutionary structure learning (ESL) framework for SNNs, named ESL-SNNs, to implement the sparse SNN training from scratch. The pruning and regeneration of synaptic connections in SNNs evolve dynamically during learning, yet keep the structural sparsity at a certain level. As a result, the ESL-SNNs can search for optimal sparse connectivity by exploring all possible parameters across time. Our experiments show that the proposed ESL-SNNs framework is able to learn SNNs with sparse structures effectively while reducing the limited accuracy. The ESL-SNNs achieve merely 0.28% accuracy loss with 10% connection density on the DVS-Cifar10 dataset. Our work presents a brand-new approach for sparse training of SNNs from scratch with biologically plausible evolutionary mechanisms, closing the gap in the expressibility between sparse training and dense training. Hence, it has great potential for SNN lightweight training and inference with low power consumption and small memory usage. ",
    "url": "https://arxiv.org/abs/2306.03693",
    "authors": [
      "Jiangrong Shen",
      "Qi Xu",
      "Jian K. Liu",
      "Yueming Wang",
      "Gang Pan",
      "Huajin Tang"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03698",
    "title": "Fine-grained Expressivity of Graph Neural Networks",
    "abstract": "Numerous recent works have analyzed the expressive power of message-passing graph neural networks (MPNNs), primarily utilizing combinatorial techniques such as the $1$-dimensional Weisfeiler-Leman test ($1$-WL) for the graph isomorphism problem. However, the graph isomorphism objective is inherently binary, not giving insights into the degree of similarity between two given graphs. This work resolves this issue by considering continuous extensions of both $1$-WL and MPNNs to graphons. Concretely, we show that the continuous variant of $1$-WL delivers an accurate topological characterization of the expressive power of MPNNs on graphons, revealing which graphs these networks can distinguish and the level of difficulty in separating them. We identify the finest topology where MPNNs separate points and prove a universal approximation theorem. Consequently, we provide a theoretical framework for graph and graphon similarity combining various topological variants of classical characterizations of the $1$-WL. In particular, we characterize the expressive power of MPNNs in terms of the tree distance, which is a graph distance based on the concepts of fractional isomorphisms, and substructure counts via tree homomorphisms, showing that these concepts have the same expressive power as the $1$-WL and MPNNs on graphons. Empirically, we validate our theoretical findings by showing that randomly initialized MPNNs, without training, exhibit competitive performance compared to their trained counterparts. Moreover, we evaluate different MPNN architectures based on their ability to preserve graph distances, highlighting the significance of our continuous $1$-WL test in understanding MPNNs' expressivity. ",
    "url": "https://arxiv.org/abs/2306.03698",
    "authors": [
      "Jan Böker",
      "Ron Levie",
      "Ningyuan Huang",
      "Soledad Villar",
      "Christopher Morris"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Discrete Mathematics (cs.DM)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2306.03707",
    "title": "Effective Intrusion Detection in Highly Imbalanced IoT Networks with  Lightweight S2CGAN-IDS",
    "abstract": "Since the advent of the Internet of Things (IoT), exchanging vast amounts of information has increased the number of security threats in networks. As a result, intrusion detection based on deep learning (DL) has been developed to achieve high throughput and high precision. Unlike general deep learning-based scenarios, IoT networks contain benign traffic far more than abnormal traffic, with some rare attacks. However, most existing studies have been focused on sacrificing the detection rate of the majority class in order to improve the detection rate of the minority class in class-imbalanced IoT networks. Although this way can reduce the false negative rate of minority classes, it both wastes resources and reduces the credibility of the intrusion detection systems. To address this issue, we propose a lightweight framework named S2CGAN-IDS. The proposed framework leverages the distribution characteristics of network traffic to expand the number of minority categories in both data space and feature space, resulting in a substantial increase in the detection rate of minority categories while simultaneously ensuring the detection precision of majority categories. To reduce the impact of sparsity on the experiments, the CICIDS2017 numeric dataset is utilized to demonstrate the effectiveness of the proposed method. The experimental results indicate that our proposed approach outperforms the superior method in both Precision and Recall, particularly with a 10.2% improvement in the F1-score. ",
    "url": "https://arxiv.org/abs/2306.03707",
    "authors": [
      "Caihong Wang",
      "Du Xu",
      "Zonghang Li",
      "Dusit Niyato"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03715",
    "title": "Unleashing Mask: Explore the Intrinsic Out-of-Distribution Detection  Capability",
    "abstract": "Out-of-distribution (OOD) detection is an indispensable aspect of secure AI when deploying machine learning models in real-world applications. Previous paradigms either explore better scoring functions or utilize the knowledge of outliers to equip the models with the ability of OOD detection. However, few of them pay attention to the intrinsic OOD detection capability of the given model. In this work, we generally discover the existence of an intermediate stage of a model trained on in-distribution (ID) data having higher OOD detection performance than that of its final stage across different settings, and further identify one critical data-level attribution to be learning with the atypical samples. Based on such insights, we propose a novel method, Unleashing Mask, which aims to restore the OOD discriminative capabilities of the well-trained model with ID data. Our method utilizes a mask to figure out the memorized atypical samples, and then finetune the model or prune it with the introduced mask to forget them. Extensive experiments and analysis demonstrate the effectiveness of our method. The code is available at: https://github.com/tmlr-group/Unleashing-Mask. ",
    "url": "https://arxiv.org/abs/2306.03715",
    "authors": [
      "Jianing Zhu",
      "Hengzhuang Li",
      "Jiangchao Yao",
      "Tongliang Liu",
      "Jianliang Xu",
      "Bo Han"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03722",
    "title": "Evaluating the Effectiveness of Natural Language Inference for Hate  Speech Detection in Languages with Limited Labeled Data",
    "abstract": "Most research on hate speech detection has focused on English where a sizeable amount of labeled training data is available. However, to expand hate speech detection into more languages, approaches that require minimal training data are needed. In this paper, we test whether natural language inference (NLI) models which perform well in zero- and few-shot settings can benefit hate speech detection performance in scenarios where only a limited amount of labeled data is available in the target language. Our evaluation on five languages demonstrates large performance improvements of NLI fine-tuning over direct fine-tuning in the target language. However, the effectiveness of previous work that proposed intermediate fine-tuning on English data is hard to match. Only in settings where the English training data does not match the test domain, can our customised NLI-formulation outperform intermediate fine-tuning on English. Based on our extensive experiments, we propose a set of recommendations for hate speech detection in languages where minimal labeled training data is available. ",
    "url": "https://arxiv.org/abs/2306.03722",
    "authors": [
      "Janis Goldzycher",
      "Moritz Preisig",
      "Chantal Amrhein",
      "Gerold Schneider"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2306.03726",
    "title": "Exploring Model Dynamics for Accumulative Poisoning Discovery",
    "abstract": "Adversarial poisoning attacks pose huge threats to various machine learning applications. Especially, the recent accumulative poisoning attacks show that it is possible to achieve irreparable harm on models via a sequence of imperceptible attacks followed by a trigger batch. Due to the limited data-level discrepancy in real-time data streaming, current defensive methods are indiscriminate in handling the poison and clean samples. In this paper, we dive into the perspective of model dynamics and propose a novel information measure, namely, Memorization Discrepancy, to explore the defense via the model-level information. By implicitly transferring the changes in the data manipulation to that in the model outputs, Memorization Discrepancy can discover the imperceptible poison samples based on their distinct dynamics from the clean samples. We thoroughly explore its properties and propose Discrepancy-aware Sample Correction (DSC) to defend against accumulative poisoning attacks. Extensive experiments comprehensively characterized Memorization Discrepancy and verified its effectiveness. The code is publicly available at: https://github.com/tmlr-group/Memorization-Discrepancy. ",
    "url": "https://arxiv.org/abs/2306.03726",
    "authors": [
      "Jianing Zhu",
      "Xiawei Guo",
      "Jiangchao Yao",
      "Chao Du",
      "Li He",
      "Shuo Yuan",
      "Tongliang Liu",
      "Liang Wang",
      "Bo Han"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2306.03733",
    "title": "A Novel Approach To User Agent String Parsing For Vulnerability Analysis  Using Mutli-Headed Attention",
    "abstract": "The increasing reliance on the internet has led to the proliferation of a diverse set of web-browsers and operating systems (OSs) capable of browsing the web. User agent strings (UASs) are a component of web browsing that are transmitted with every Hypertext Transfer Protocol (HTTP) request. They contain information about the client device and software, which is used by web servers for various purposes such as content negotiation and security. However, due to the proliferation of various browsers and devices, parsing UASs is a non-trivial task due to a lack of standardization of UAS formats. Current rules-based approaches are often brittle and can fail when encountering such non-standard formats. In this work, a novel methodology for parsing UASs using Multi-Headed Attention Based transformers is proposed. The proposed methodology exhibits strong performance in parsing a variety of UASs with differing formats. Furthermore, a framework to utilize parsed UASs to estimate the vulnerability scores for large sections of publicly visible IT networks or regions is also discussed. The methodology present here can also be easily extended or deployed for real-time parsing of logs in enterprise settings. ",
    "url": "https://arxiv.org/abs/2306.03733",
    "authors": [
      "Dhruv Nandakumar",
      "Sathvik Murli",
      "Ankur Khosla",
      "Kevin Choi",
      "Abdul Rahman",
      "Drew Walsh",
      "Scott Riede",
      "Eric Dull",
      "Edward Bowen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2306.03750",
    "title": "Goal-Oriented Scheduling in Sensor Networks with Application Timing  Awareness",
    "abstract": "Taking inspiration from linguistics, the communications theoretical community has recently shown a significant recent interest in pragmatic , or goal-oriented, communication. In this paper, we tackle the problem of pragmatic communication with multiple clients with different, and potentially conflicting, objectives. We capture the goal-oriented aspect through the metric of Value of Information (VoI), which considers the estimation of the remote process as well as the timing constraints. However, the most common definition of VoI is simply the Mean Square Error (MSE) of the whole system state, regardless of the relevance for a specific client. Our work aims to overcome this limitation by including different summary statistics, i.e., value functions of the state, for separate clients, and a diversified query process on the client side, expressed through the fact that different applications may request different functions of the process state at different times. A query-aware Deep Reinforcement Learning (DRL) solution based on statically defined VoI can outperform naive approaches by 15-20%. ",
    "url": "https://arxiv.org/abs/2306.03750",
    "authors": [
      "Josefine Holm",
      "Federico Chiariotti",
      "Anders E. Kalør",
      "Beatriz Soret",
      "Torben Bach Pedersen",
      "Petar Popovski"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2306.03756",
    "title": "Continuous-Time Graph Learning for Cascade Popularity Prediction",
    "abstract": "Information propagation on social networks could be modeled as cascades, and many efforts have been made to predict the future popularity of cascades. However, most of the existing research treats a cascade as an individual sequence. Actually, the cascades might be correlated with each other due to the shared users or similar topics. Moreover, the preferences of users and semantics of a cascade are usually continuously evolving over time. In this paper, we propose a continuous-time graph learning method for cascade popularity prediction, which first connects different cascades via a universal sequence of user-cascade and user-user interactions and then chronologically learns on the sequence by maintaining the dynamic states of users and cascades. Specifically, for each interaction, we present an evolution learning module to continuously update the dynamic states of the related users and cascade based on their currently encoded messages and previous dynamic states. We also devise a cascade representation learning component to embed the temporal information and structural information carried by the cascade. Experiments on real-world datasets demonstrate the superiority and rationality of our approach. ",
    "url": "https://arxiv.org/abs/2306.03756",
    "authors": [
      "Xiaodong Lu",
      "Shuo Ji",
      "Le Yu",
      "Leilei Sun",
      "Bowen Du",
      "Tongyu Zhu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2306.03757",
    "title": "Exploring the effects of robotic design on learning and neural control",
    "abstract": "The ongoing deep learning revolution has allowed computers to outclass humans in various games and perceive features imperceptible to humans during classification tasks. Current machine learning techniques have clearly distinguished themselves in specialized tasks. However, we have yet to see robots capable of performing multiple tasks at an expert level. Most work in this field is focused on the development of more sophisticated learning algorithms for a robot's controller given a largely static and presupposed robotic design. By focusing on the development of robotic bodies, rather than neural controllers, I have discovered that robots can be designed such that they overcome many of the current pitfalls encountered by neural controllers in multitask settings. Through this discovery, I also present novel metrics to explicitly measure the learning ability of a robotic design and its resistance to common problems such as catastrophic interference. Traditionally, the physical robot design requires human engineers to plan every aspect of the system, which is expensive and often relies on human intuition. In contrast, within the field of evolutionary robotics, evolutionary algorithms are used to automatically create optimized designs, however, such designs are often still limited in their ability to perform in a multitask setting. The metrics created and presented here give a novel path to automated design that allow evolved robots to synergize with their controller to improve the computational efficiency of their learning while overcoming catastrophic interference. Overall, this dissertation intimates the ability to automatically design robots that are more general purpose than current robots and that can perform various tasks while requiring less computation. ",
    "url": "https://arxiv.org/abs/2306.03757",
    "authors": [
      "Joshua Paul Powers"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2306.03770",
    "title": "Graph Classification Gaussian Processes via Spectral Features",
    "abstract": "Graph classification aims to categorise graphs based on their structure and node attributes. In this work, we propose to tackle this task using tools from graph signal processing by deriving spectral features, which we then use to design two variants of Gaussian process models for graph classification. The first variant uses spectral features based on the distribution of energy of a node feature signal over the spectrum of the graph. We show that even such a simple approach, having no learned parameters, can yield competitive performance compared to strong neural network and graph kernel baselines. A second, more sophisticated variant is designed to capture multi-scale and localised patterns in the graph by learning spectral graph wavelet filters, obtaining improved performance on synthetic and real-world data sets. Finally, we show that both models produce well calibrated uncertainty estimates, enabling reliable decision making based on the model predictions. ",
    "url": "https://arxiv.org/abs/2306.03770",
    "authors": [
      "Felix L. Opolka",
      "Yin-Cong Zhi",
      "Pietro Liò",
      "Xiaowen Dong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2306.03779",
    "title": "Performance-optimized deep neural networks are evolving into worse  models of inferotemporal visual cortex",
    "abstract": "One of the most impactful findings in computational neuroscience over the past decade is that the object recognition accuracy of deep neural networks (DNNs) correlates with their ability to predict neural responses to natural images in the inferotemporal (IT) cortex. This discovery supported the long-held theory that object recognition is a core objective of the visual cortex, and suggested that more accurate DNNs would serve as better models of IT neuron responses to images. Since then, deep learning has undergone a revolution of scale: billion parameter-scale DNNs trained on billions of images are rivaling or outperforming humans at visual tasks including object recognition. Have today's DNNs become more accurate at predicting IT neuron responses to images as they have grown more accurate at object recognition? Surprisingly, across three independent experiments, we find this is not the case. DNNs have become progressively worse models of IT as their accuracy has increased on ImageNet. To understand why DNNs experience this trade-off and evaluate if they are still an appropriate paradigm for modeling the visual system, we turn to recordings of IT that capture spatially resolved maps of neuronal activity elicited by natural images. These neuronal activity maps reveal that DNNs trained on ImageNet learn to rely on different visual features than those encoded by IT and that this problem worsens as their accuracy increases. We successfully resolved this issue with the neural harmonizer, a plug-and-play training routine for DNNs that aligns their learned representations with humans. Our results suggest that harmonized DNNs break the trade-off between ImageNet accuracy and neural prediction accuracy that assails current DNNs and offer a path to more accurate models of biological vision. ",
    "url": "https://arxiv.org/abs/2306.03779",
    "authors": [
      "Drew Linsley",
      "Ivan F. Rodriguez",
      "Thomas Fel",
      "Michael Arcaro",
      "Saloni Sharma",
      "Margaret Livingstone",
      "Thomas Serre"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03782",
    "title": "Non-parametric Probabilistic Time Series Forecasting via Innovations  Representation",
    "abstract": "Probabilistic time series forecasting predicts the conditional probability distributions of the time series at a future time given past realizations. Such techniques are critical in risk-based decision-making and planning under uncertainties. Existing approaches are primarily based on parametric or semi-parametric time-series models that are restrictive, difficult to validate, and challenging to adapt to varying conditions. This paper proposes a nonparametric method based on the classic notion of {\\em innovations} pioneered by Norbert Wiener and Gopinath Kallianpur that causally transforms a nonparametric random process to an independent and identical uniformly distributed {\\em innovations process}. We present a machine-learning architecture and a learning algorithm that circumvent two limitations of the original Wiener-Kallianpur innovations representation: (i) the need for known probability distributions of the time series and (ii) the existence of a causal decoder that reproduces the original time series from the innovations representation. We develop a deep-learning approach and a Monte Carlo sampling technique to obtain a generative model for the predicted conditional probability distribution of the time series based on a weak notion of Wiener-Kallianpur innovations representation. The efficacy of the proposed probabilistic forecasting technique is demonstrated on a variety of electricity price datasets, showing marked improvement over leading benchmarks of probabilistic forecasting techniques. ",
    "url": "https://arxiv.org/abs/2306.03782",
    "authors": [
      "Xinyi Wang",
      "Meijen Lee",
      "Qing Zhao",
      "Lang Tong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03786",
    "title": "Residual-based error bound for physics-informed neural networks",
    "abstract": "Neural networks are universal approximators and are studied for their use in solving differential equations. However, a major criticism is the lack of error bounds for obtained solutions. This paper proposes a technique to rigorously evaluate the error bound of Physics-Informed Neural Networks (PINNs) on most linear ordinary differential equations (ODEs), certain nonlinear ODEs, and first-order linear partial differential equations (PDEs). The error bound is based purely on equation structure and residual information and does not depend on assumptions of how well the networks are trained. We propose algorithms that bound the error efficiently. Some proposed algorithms provide tighter bounds than others at the cost of longer run time. ",
    "url": "https://arxiv.org/abs/2306.03786",
    "authors": [
      "Shuheng Liu",
      "Xiyue Huang",
      "Pavlos Protopapas"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2306.03833",
    "title": "Patient Dropout Prediction in Virtual Health: A Multimodal Dynamic  Knowledge Graph and Text Mining Approach",
    "abstract": "Virtual health has been acclaimed as a transformative force in healthcare delivery. Yet, its dropout issue is critical that leads to poor health outcomes, increased health, societal, and economic costs. Timely prediction of patient dropout enables stakeholders to take proactive steps to address patients' concerns, potentially improving retention rates. In virtual health, the information asymmetries inherent in its delivery format, between different stakeholders, and across different healthcare delivery systems hinder the performance of existing predictive methods. To resolve those information asymmetries, we propose a Multimodal Dynamic Knowledge-driven Dropout Prediction (MDKDP) framework that learns implicit and explicit knowledge from doctor-patient dialogues and the dynamic and complex networks of various stakeholders in both online and offline healthcare delivery systems. We evaluate MDKDP by partnering with one of the largest virtual health platforms in China. MDKDP improves the F1-score by 3.26 percentage points relative to the best benchmark. Comprehensive robustness analyses show that integrating stakeholder attributes, knowledge dynamics, and compact bilinear pooling significantly improves the performance. Our work provides significant implications for healthcare IT by revealing the value of mining relations and knowledge across different service modalities. Practically, MDKDP offers a novel design artifact for virtual health platforms in patient dropout management. ",
    "url": "https://arxiv.org/abs/2306.03833",
    "authors": [
      "Shuang Geng",
      "Wenli Zhang",
      "Jiaheng Xie",
      "Gemin Liang",
      "Ben Niu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03834",
    "title": "MTS2Graph: Interpretable Multivariate Time Series Classification with  Temporal Evolving Graphs",
    "abstract": "Conventional time series classification approaches based on bags of patterns or shapelets face significant challenges in dealing with a vast amount of feature candidates from high-dimensional multivariate data. In contrast, deep neural networks can learn low-dimensional features efficiently, and in particular, Convolutional Neural Networks (CNN) have shown promising results in classifying Multivariate Time Series (MTS) data. A key factor in the success of deep neural networks is this astonishing expressive power. However, this power comes at the cost of complex, black-boxed models, conflicting with the goals of building reliable and human-understandable models. An essential criterion in understanding such predictive deep models involves quantifying the contribution of time-varying input variables to the classification. Hence, in this work, we introduce a new framework for interpreting multivariate time series data by extracting and clustering the input representative patterns that highly activate CNN neurons. This way, we identify each signal's role and dependencies, considering all possible combinations of signals in the MTS input. Then, we construct a graph that captures the temporal relationship between the extracted patterns for each layer. An effective graph merging strategy finds the connection of each node to the previous layer's nodes. Finally, a graph embedding algorithm generates new representations of the created interpretable time-series features. To evaluate the performance of our proposed framework, we run extensive experiments on eight datasets of the UCR/UEA archive, along with HAR and PAM datasets. The experiments indicate the benefit of our time-aware graph-based representation in MTS classification while enriching them with more interpretability. ",
    "url": "https://arxiv.org/abs/2306.03834",
    "authors": [
      "Raneen Younis",
      "Abdul Hakmeh",
      "Zahra Ahmadi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.03838",
    "title": "Spherical Fourier Neural Operators: Learning Stable Dynamics on the  Sphere",
    "abstract": "Fourier Neural Operators (FNOs) have proven to be an efficient and effective method for resolution-independent operator learning in a broad variety of application areas across scientific machine learning. A key reason for their success is their ability to accurately model long-range dependencies in spatio-temporal data by learning global convolutions in a computationally efficient manner. To this end, FNOs rely on the discrete Fourier transform (DFT), however, DFTs cause visual and spectral artifacts as well as pronounced dissipation when learning operators in spherical coordinates since they incorrectly assume a flat geometry. To overcome this limitation, we generalize FNOs on the sphere, introducing Spherical FNOs (SFNOs) for learning operators on spherical geometries. We apply SFNOs to forecasting atmospheric dynamics, and demonstrate stable auto\\-regressive rollouts for a year of simulated time (1,460 steps), while retaining physically plausible dynamics. The SFNO has important implications for machine learning-based simulation of climate dynamics that could eventually help accelerate our response to climate change. ",
    "url": "https://arxiv.org/abs/2306.03838",
    "authors": [
      "Boris Bonev",
      "Thorsten Kurth",
      "Christian Hundt",
      "Jaideep Pathak",
      "Maximilian Baust",
      "Karthik Kashinath",
      "Anima Anandkumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2306.03849",
    "title": "Considering Human Factors in Risk Maps for Robust and Foresighted Driver  Warning",
    "abstract": "Driver support systems that include human states in the support process is an active research field. Many recent approaches allow, for example, to sense the driver's drowsiness or awareness of the driving situation. However, so far, this rich information has not been utilized much for improving the effectiveness of support systems. In this paper, we therefore propose a warning system that uses human states in the form of driver errors and can warn users in some cases of upcoming risks several seconds earlier than the state of the art systems not considering human factors. The system consists of a behavior planner Risk Maps which directly changes its prediction of the surrounding driving situation based on the sensed driver errors. By checking if this driver's behavior plan is objectively safe, a more robust and foresighted driver warning is achieved. In different simulations of a dynamic lane change and intersection scenarios, we show how the driver's behavior plan can become unsafe, given the estimate of driver errors, and experimentally validate the advantages of considering human factors. ",
    "url": "https://arxiv.org/abs/2306.03849",
    "authors": [
      "Tim Puphal",
      "Ryohei Hirano",
      "Malte Probst",
      "Raphael Wenzel",
      "Akihito Kimata"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2306.03882",
    "title": "Causal interventions expose implicit situation models for commonsense  language understanding",
    "abstract": "Accounts of human language processing have long appealed to implicit ``situation models'' that enrich comprehension with relevant but unstated world knowledge. Here, we apply causal intervention techniques to recent transformer models to analyze performance on the Winograd Schema Challenge (WSC), where a single context cue shifts interpretation of an ambiguous pronoun. We identify a relatively small circuit of attention heads that are responsible for propagating information from the context word that guides which of the candidate noun phrases the pronoun ultimately attends to. We then compare how this circuit behaves in a closely matched ``syntactic'' control where the situation model is not strictly necessary. These analyses suggest distinct pathways through which implicit situation models are constructed to guide pronoun resolution. ",
    "url": "https://arxiv.org/abs/2306.03882",
    "authors": [
      "Takateru Yamakoshi",
      "James L. McClelland",
      "Adele E. Goldberg",
      "Robert D. Hawkins"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2306.03902",
    "title": "Utterance Classification with Logical Neural Network: Explainable AI for  Mental Disorder Diagnosis",
    "abstract": "In response to the global challenge of mental health problems, we proposes a Logical Neural Network (LNN) based Neuro-Symbolic AI method for the diagnosis of mental disorders. Due to the lack of effective therapy coverage for mental disorders, there is a need for an AI solution that can assist therapists with the diagnosis. However, current Neural Network models lack explainability and may not be trusted by therapists. The LNN is a Recurrent Neural Network architecture that combines the learning capabilities of neural networks with the reasoning capabilities of classical logic-based AI. The proposed system uses input predicates from clinical interviews to output a mental disorder class, and different predicate pruning techniques are used to achieve scalability and higher scores. In addition, we provide an insight extraction method to aid therapists with their diagnosis. The proposed system addresses the lack of explainability of current Neural Network models and provides a more trustworthy solution for mental disorder diagnosis. ",
    "url": "https://arxiv.org/abs/2306.03902",
    "authors": [
      "Yeldar Toleubay",
      "Don Joven Agravante",
      "Daiki Kimura",
      "Baihan Lin",
      "Djallel Bouneffouf",
      "Michiaki Tatsubori"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Logic in Computer Science (cs.LO)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2306.03907",
    "title": "CL-UZH at SemEval-2023 Task 10: Sexism Detection through Incremental  Fine-Tuning and Multi-Task Learning with Label Descriptions",
    "abstract": "The widespread popularity of social media has led to an increase in hateful, abusive, and sexist language, motivating methods for the automatic detection of such phenomena. The goal of the SemEval shared task \\textit{Towards Explainable Detection of Online Sexism} (EDOS 2023) is to detect sexism in English social media posts (subtask A), and to categorize such posts into four coarse-grained sexism categories (subtask B), and eleven fine-grained subcategories (subtask C). In this paper, we present our submitted systems for all three subtasks, based on a multi-task model that has been fine-tuned on a range of related tasks and datasets before being fine-tuned on the specific EDOS subtasks. We implement multi-task learning by formulating each task as binary pairwise text classification, where the dataset and label descriptions are given along with the input text. The results show clear improvements over a fine-tuned DeBERTa-V3 serving as a baseline leading to $F_1$-scores of 85.9\\% in subtask A (rank 13/84), 64.8\\% in subtask B (rank 19/69), and 44.9\\% in subtask C (26/63). ",
    "url": "https://arxiv.org/abs/2306.03907",
    "authors": [
      "Janis Goldzycher"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2306.03099",
    "title": "CrystalGPT: Enhancing system-to-system transferability in  crystallization prediction and control using time-series-transformers",
    "abstract": "For prediction and real-time control tasks, machine-learning (ML)-based digital twins are frequently employed. However, while these models are typically accurate, they are custom-designed for individual systems, making system-to-system (S2S) transferability difficult. This occurs even when substantial similarities exist in the process dynamics across different chemical systems. To address this challenge, we developed a novel time-series-transformer (TST) framework that exploits the powerful transfer learning capabilities inherent in transformer algorithms. This was demonstrated using readily available process data obtained from different crystallizers operating under various operational scenarios. Using this extensive dataset, we trained a TST model (CrystalGPT) to exhibit remarkable S2S transferability not only across all pre-established systems, but also to an unencountered system. CrystalGPT achieved a cumulative error across all systems, which is eight times superior to that of existing ML models. Additionally, we coupled CrystalGPT with a predictive controller to reduce the variance in setpoint tracking to just 1%. ",
    "url": "https://arxiv.org/abs/2306.03099",
    "authors": [
      "Niranjan Sitapure",
      "Joseph S. Kwon"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03202",
    "title": "Nonlinear Distributionally Robust Optimization",
    "abstract": "This article focuses on a class of distributionally robust optimization (DRO) problems where, unlike the growing body of the literature, the objective function is potentially non-linear in the distribution. Existing methods to optimize nonlinear functions in probability space use the Frechet derivatives, which present both theoretical and computational challenges. Motivated by this, we propose an alternative notion for the derivative and corresponding smoothness based on Gateaux (G)-derivative for generic risk measures. These concepts are explained via three running risk measure examples of variance, entropic risk, and risk on finite support sets. We then propose a G-derivative based Frank-Wolfe~(FW) algorithm for generic non-linear optimization problems in probability spaces and establish its convergence under the proposed notion of smoothness in a completely norm-independent manner. We use the set-up of the FW algorithm to devise a methodology to compute a saddle point of the non-linear DRO problem. Finally, for the minimum variance portfolio selection problem we analyze the regularity conditions and compute the FW-oracle in various settings, and validate the theoretical results numerically. ",
    "url": "https://arxiv.org/abs/2306.03202",
    "authors": [
      "Mohammed Rayyan Sheriff",
      "Peyman Mohajerin Esfahani"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2306.03270",
    "title": "Brain Tumor Recurrence vs. Radiation Necrosis Classification and Patient  Survivability Prediction",
    "abstract": "GBM (Glioblastoma multiforme) is the most aggressive type of brain tumor in adults that has a short survival rate even after aggressive treatment with surgery and radiation therapy. The changes on magnetic resonance imaging (MRI) for patients with GBM after radiotherapy are indicative of either radiation-induced necrosis (RN) or recurrent brain tumor (rBT). Screening for rBT and RN at an early stage is crucial for facilitating faster treatment and better outcomes for the patients. Differentiating rBT from RN is challenging as both may present with similar radiological and clinical characteristics on MRI. Moreover, learning-based rBT versus RN classification using MRI may suffer from class imbalance due to lack of patient data. While synthetic data generation using generative models has shown promise to address class imbalance, the underlying data representation may be different in synthetic or augmented data. This study proposes computational modeling with statistically rigorous repeated random sub-sampling to balance the subset sample size for rBT and RN classification. The proposed pipeline includes multiresolution radiomic feature (MRF) extraction followed by feature selection with statistical significance testing (p<0.05). The five-fold cross validation results show the proposed model with MRF features classifies rBT from RN with an area under the curve (AUC) of 0.8920+-.055. Moreover, considering the dependence between survival time and censor time (where patients are not followed up until death), we demonstrate the feasibility of using MRF radiomic features as a non-invasive biomarker to identify patients who are at higher risk of recurrence or radiation necrosis. The cross-validated results show that the MRF model provides the best overall performance with an AUC of 0.770+-.032. ",
    "url": "https://arxiv.org/abs/2306.03270",
    "authors": [
      "M. S. Sadique",
      "W. Farzana",
      "A. Temtam",
      "E. Lappinen",
      "A. Vossough",
      "K. M. Iftekharuddin"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03271",
    "title": "Dual self-distillation of U-shaped networks for 3D medical image  segmentation",
    "abstract": "U-shaped networks and its variants have demonstrated exceptional results for medical image segmentation. In this paper, we propose a novel dual self-distillation (DSD) framework for U-shaped networks for 3D medical image segmentation. DSD distills knowledge from the ground-truth segmentation labels to the decoder layers and also between the encoder and decoder layers of a single U-shaped network. DSD is a generalized training strategy that could be attached to the backbone architecture of any U-shaped network to further improve its segmentation performance. We attached DSD on two state-of-the-art U-shaped backbones, and extensive experiments on two public 3D medical image segmentation datasets (cardiac substructure and brain tumor) demonstrated significant improvement over those backbones. On average, after attaching DSD to the U-shaped backbones, we observed an improvement of 4.25% and 3.15% in Dice similarity score for cardiac substructure and brain tumor segmentation respectively. ",
    "url": "https://arxiv.org/abs/2306.03271",
    "authors": [
      "Soumyanil Banerjee",
      "Ming Dong",
      "Carri Glide-Hurst"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03373",
    "title": "CiT-Net: Convolutional Neural Networks Hand in Hand with Vision  Transformers for Medical Image Segmentation",
    "abstract": "The hybrid architecture of convolutional neural networks (CNNs) and Transformer are very popular for medical image segmentation. However, it suffers from two challenges. First, although a CNNs branch can capture the local image features using vanilla convolution, it cannot achieve adaptive feature learning. Second, although a Transformer branch can capture the global features, it ignores the channel and cross-dimensional self-attention, resulting in a low segmentation accuracy on complex-content images. To address these challenges, we propose a novel hybrid architecture of convolutional neural networks hand in hand with vision Transformers (CiT-Net) for medical image segmentation. Our network has two advantages. First, we design a dynamic deformable convolution and apply it to the CNNs branch, which overcomes the weak feature extraction ability due to fixed-size convolution kernels and the stiff design of sharing kernel parameters among different inputs. Second, we design a shifted-window adaptive complementary attention module and a compact convolutional projection. We apply them to the Transformer branch to learn the cross-dimensional long-term dependency for medical images. Experimental results show that our CiT-Net provides better medical image segmentation results than popular SOTA methods. Besides, our CiT-Net requires lower parameters and less computational costs and does not rely on pre-training. The code is publicly available at https://github.com/SR0920/CiT-Net. ",
    "url": "https://arxiv.org/abs/2306.03373",
    "authors": [
      "Tao Lei",
      "Rui Sun",
      "Xuan Wang",
      "Yingbo Wang",
      "Xi He",
      "Asoke Nandi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03376",
    "title": "Infinite families of $k$-vertex-critical ($P_5$, $C_5$)-free graphs",
    "abstract": "A graph is $k$-vertex-critical if $\\chi(G)=k$ but $\\chi(G-v)<k$ for all $v\\in V(G)$. We construct a new infinite families of $k$-vertex-critical $(P_5,C_5)$-free graphs for all $k\\ge 6$. Our construction generalizes known constructions for $4$-vertex-critical $P_7$-free graphs and $5$-vertex-critical $P_5$-free graphs and is in contrast to the fact that there are only finitely many $5$-vertex-critical $(P_5,C_5)$-free graphs. In fact, our construction is actually even more well-structured, being $(2P_2,K_3+P_1,C_5)$-free. ",
    "url": "https://arxiv.org/abs/2306.03376",
    "authors": [
      "Ben Cameron",
      "Chính T. Hoàng"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2306.03479",
    "title": "Extremal spectral behavior of weighted random $d$-regular graphs",
    "abstract": "Analyzing the spectral behavior of random matrices with dependency among entries is a challenging problem. The adjacency matrix of the random $d$-regular graph is a prominent example that has attracted immense interest. A crucial spectral observable is the extremal eigenvalue, which reveals useful geometric properties of the graph. According to the Alon's conjecture, which was verified by Friedman, the (nontrivial) extremal eigenvalue of the random $d$-regular graph is approximately $2\\sqrt{d-1}$. In the present paper, we analyze the extremal spectrum of the random $d$-regular graph (with $d\\ge 3$ fixed) equipped with random edge-weights, and precisely describe its phase transition behavior with respect to the tail of edge-weights. In addition, we establish that the extremal eigenvector is always localized, showing a sharp contrast to the unweighted case where all eigenvectors are delocalized. Our method is robust and inspired by a sparsification technique developed in the context of Erd\\H{o}s-R\\'{e}nyi graphs (Ganguly and Nam, '22), which can also be applied to analyze the spectrum of general random matrices whose entries are dependent. ",
    "url": "https://arxiv.org/abs/2306.03479",
    "authors": [
      "Jaehun Lee",
      "Kyeongsik Nam"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2306.03511",
    "title": "Curriculum-Based Augmented Fourier Domain Adaptation for Robust Medical  Image Segmentation",
    "abstract": "Accurate and robust medical image segmentation is fundamental and crucial for enhancing the autonomy of computer-aided diagnosis and intervention systems. Medical data collection normally involves different scanners, protocols, and populations, making domain adaptation (DA) a highly demanding research field to alleviate model degradation in the deployment site. To preserve the model performance across multiple testing domains, this work proposes the Curriculum-based Augmented Fourier Domain Adaptation (Curri-AFDA) for robust medical image segmentation. In particular, our curriculum learning strategy is based on the causal relationship of a model under different levels of data shift in the deployment phase, where the higher the shift is, the harder to recognize the variance. Considering this, we progressively introduce more amplitude information from the target domain to the source domain in the frequency space during the curriculum-style training to smoothly schedule the semantic knowledge transfer in an easier-to-harder manner. Besides, we incorporate the training-time chained augmentation mixing to help expand the data distributions while preserving the domain-invariant semantics, which is beneficial for the acquired model to be more robust and generalize better to unseen domains. Extensive experiments on two segmentation tasks of Retina and Nuclei collected from multiple sites and scanners suggest that our proposed method yields superior adaptation and generalization performance. Meanwhile, our approach proves to be more robust under various corruption types and increasing severity levels. In addition, we show our method is also beneficial in the domain-adaptive classification task with skin lesion datasets. The code is available at https://github.com/lofrienger/Curri-AFDA. ",
    "url": "https://arxiv.org/abs/2306.03511",
    "authors": [
      "An Wang",
      "Mobarakol Islam",
      "Mengya Xu",
      "Hongliang Ren"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03625",
    "title": "Fair and Robust Estimation of Heterogeneous Treatment Effects for Policy  Learning",
    "abstract": "We propose a simple and general framework for nonparametric estimation of heterogeneous treatment effects under fairness constraints. Under standard regularity conditions, we show that the resulting estimators possess the double robustness property. We use this framework to characterize the trade-off between fairness and the maximum welfare achievable by the optimal policy. We evaluate the methods in a simulation study and illustrate them in a real-world case study. ",
    "url": "https://arxiv.org/abs/2306.03625",
    "authors": [
      "Kwangho Kim",
      "José R. Zubizarreta"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2306.03741",
    "title": "Pre-training Tensor-Train Networks Facilitates Machine Learning with  Variational Quantum Circuits",
    "abstract": "Variational quantum circuit (VQC) is a promising approach for implementing quantum neural networks on noisy intermediate-scale quantum (NISQ) devices. Recent studies have shown that a tensor-train network (TTN) for VQC, namely TTN-VQC, can improve the representation and generalization powers of VQC. However, the Barren Plateau problem leads to the gradients of the cost function vanishing exponentially small as the number of qubits increases, making it difficult to find the optimal parameters for the VQC. To address this issue, we put forth a new learning approach called Pre+TTN-VQC that builds upon the TTN-VQC architecture by incorporating a pre-trained TTN to alleviate the Barren Plateau problem. The pre-trained TTN allows for efficient fine-tuning of target data, which reduces the depth of the VQC required to achieve good empirical performance and potentially alleviates the training obstacles posed by the Barren Plateau landscape. Furthermore, we highlight the advantages of Pre+TTN-VQC in terms of representation and generalization powers by exploiting the error performance analysis. Moreover, we characterize the optimization performance of Pre+TTN-VQC without the need for the Polyak-Lojasiewicz condition, thereby enhancing the practicality of implementing quantum neural networks on NISQ devices. We conduct experiments on a handwritten digit classification dataset to corroborate our proposed methods and theorems. ",
    "url": "https://arxiv.org/abs/2306.03741",
    "authors": [
      "Jun Qi",
      "Chao-Han Huck Yang",
      "Pin-Yu Chen",
      "Min-Hsiu Hsieh"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03763",
    "title": "ChatGPT Informed Graph Neural Network for Stock Movement Prediction",
    "abstract": "ChatGPT has demonstrated remarkable capabilities across various natural language processing (NLP) tasks. However, its potential for inferring dynamic network structures from temporal textual data, specifically financial news, remains an unexplored frontier. In this research, we introduce a novel framework that leverages ChatGPT's graph inference capabilities to enhance Graph Neural Networks (GNN). Our framework adeptly extracts evolving network structures from textual data, and incorporates these networks into graph neural networks for subsequent predictive tasks. The experimental results from stock movement forecasting indicate our model has consistently outperformed the state-of-the-art Deep Learning-based benchmarks. Furthermore, the portfolios constructed based on our model's outputs demonstrate higher annualized cumulative returns, alongside reduced volatility and maximum drawdown. This superior performance highlights the potential of ChatGPT for text-based network inferences and underscores its promising implications for the financial sector. ",
    "url": "https://arxiv.org/abs/2306.03763",
    "authors": [
      "Zihan Chen",
      "Lei Nico Zheng",
      "Cheng Lu",
      "Jialu Yuan",
      "Di Zhu"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Computational Finance (q-fin.CP)"
    ]
  },
  {
    "id": "arXiv:2306.03778",
    "title": "Streaming Speech-to-Confusion Network Speech Recognition",
    "abstract": "In interactive automatic speech recognition (ASR) systems, low-latency requirements limit the amount of search space that can be explored during decoding, particularly in end-to-end neural ASR. In this paper, we present a novel streaming ASR architecture that outputs a confusion network while maintaining limited latency, as needed for interactive applications. We show that 1-best results of our model are on par with a comparable RNN-T system, while the richer hypothesis set allows second-pass rescoring to achieve 10-20\\% lower word error rate on the LibriSpeech task. We also show that our model outperforms a strong RNN-T baseline on a far-field voice assistant task. ",
    "url": "https://arxiv.org/abs/2306.03778",
    "authors": [
      "Denis Filimonov",
      "Prabhat Pandey",
      "Ariya Rastrow",
      "Ankur Gandhe",
      "Andreas Stolcke"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2306.03789",
    "title": "On the Robustness of Arabic Speech Dialect Identification",
    "abstract": "Arabic dialect identification (ADI) tools are an important part of the large-scale data collection pipelines necessary for training speech recognition models. As these pipelines require application of ADI tools to potentially out-of-domain data, we aim to investigate how vulnerable the tools may be to this domain shift. With self-supervised learning (SSL) models as a starting point, we evaluate transfer learning and direct classification from SSL features. We undertake our evaluation under rich conditions, with a goal to develop ADI systems from pretrained models and ultimately evaluate performance on newly collected data. In order to understand what factors contribute to model decisions, we carry out a careful human study of a subset of our data. Our analysis confirms that domain shift is a major challenge for ADI models. We also find that while self-training does alleviate this challenges, it may be insufficient for realistic conditions. ",
    "url": "https://arxiv.org/abs/2306.03789",
    "authors": [
      "Peter Sullivan",
      "AbdelRahim Elmadany",
      "Muhammad Abdul-Mageed"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03835",
    "title": "Atrial Septal Defect Detection in Children Based on Ultrasound Video  Using Multiple Instances Learning",
    "abstract": "Purpose: Congenital heart defect (CHD) is the most common birth defect. Thoracic echocardiography (TTE) can provide sufficient cardiac structure information, evaluate hemodynamics and cardiac function, and is an effective method for atrial septal defect (ASD) examination. This paper aims to study a deep learning method based on cardiac ultrasound video to assist in ASD diagnosis. Materials and methods: We select two standard views of the atrial septum (subAS) and low parasternal four-compartment view (LPS4C) as the two views to identify ASD. We enlist data from 300 children patients as part of a double-blind experiment for five-fold cross-validation to verify the performance of our model. In addition, data from 30 children patients (15 positives and 15 negatives) are collected for clinician testing and compared to our model test results (these 30 samples do not participate in model training). We propose an echocardiography video-based atrial septal defect diagnosis system. In our model, we present a block random selection, maximal agreement decision and frame sampling strategy for training and testing respectively, resNet18 and r3D networks are used to extract the frame features and aggregate them to build a rich video-level representation. Results: We validate our model using our private dataset by five-cross validation. For ASD detection, we achieve 89.33 AUC, 84.95 accuracy, 85.70 sensitivity, 81.51 specificity and 81.99 F1 score. Conclusion: The proposed model is multiple instances learning-based deep learning model for video atrial septal defect detection which effectively improves ASD detection accuracy when compared to the performances of previous networks and clinical doctors. ",
    "url": "https://arxiv.org/abs/2306.03835",
    "authors": [
      "Yiman Liu",
      "Qiming Huang",
      "Xiaoxiang Han",
      "Tongtong Liang",
      "Zhifang Zhang",
      "Lijun Chen",
      "Jinfeng Wang",
      "Angelos Stefanidis",
      "Jionglong Su",
      "Jiangang Chen",
      "Qingli Li",
      "Yuqi Zhang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2004.13612",
    "title": "Denise: Deep Robust Principal Component Analysis for Positive  Semidefinite Matrices",
    "abstract": " Title: Denise: Deep Robust Principal Component Analysis for Positive  Semidefinite Matrices ",
    "url": "https://arxiv.org/abs/2004.13612",
    "authors": [
      "Calypso Herrera",
      "Florian Krach",
      "Anastasis Kratsios",
      "Pierre Ruyssen",
      "Josef Teichmann"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Computational Finance (q-fin.CP)"
    ]
  },
  {
    "id": "arXiv:2007.06676",
    "title": "UnRectDepthNet: Self-Supervised Monocular Depth Estimation using a  Generic Framework for Handling Common Camera Distortion Models",
    "abstract": " Comments: Minor fixes added after IROS 2020 Camera ready submission. IROS 2020 presentation video - this https URL ",
    "url": "https://arxiv.org/abs/2007.06676",
    "authors": [
      "Varun Ravi Kumar",
      "Senthil Yogamani",
      "Markus Bach",
      "Christian Witt",
      "Stefan Milz",
      "Patrick Mader"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2007.15353",
    "title": "Growing Efficient Deep Networks by Structured Continuous Sparsification",
    "abstract": " Comments: Published as a conference paper at ICLR 2021 ",
    "url": "https://arxiv.org/abs/2007.15353",
    "authors": [
      "Xin Yuan",
      "Pedro Savarese",
      "Michael Maire"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2102.07448",
    "title": "OmniDet: Surround View Cameras based Multi-task Visual Perception  Network for Autonomous Driving",
    "abstract": " Comments: Best Robot Vision paper award finalist (top 4). Camera ready version accepted for RA-L and ICRA 2021 publication ",
    "url": "https://arxiv.org/abs/2102.07448",
    "authors": [
      "Varun Ravi Kumar",
      "Senthil Yogamani",
      "Hazem Rashed",
      "Ganesh Sistu",
      "Christian Witt",
      "Isabelle Leang",
      "Stefan Milz",
      "Patrick Mäder"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2110.04398",
    "title": "The Role of Masks in Mitigating Viral Spread on Networks",
    "abstract": " Comments: Accepted at Physical Review E ",
    "url": "https://arxiv.org/abs/2110.04398",
    "authors": [
      "Yurun Tian",
      "Anirudh Sridhar",
      "Chai Wah Wu",
      "Simon A. Levin",
      "Kathleen M. Carley",
      "H.Vincent Poor",
      "Osman Yagan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2112.14869",
    "title": "Label Distributionally Robust Losses for Multi-class Classification:  Consistency, Robustness and Adaptivity",
    "abstract": " Comments: To appear in ICML2023; 37 pages ",
    "url": "https://arxiv.org/abs/2112.14869",
    "authors": [
      "Dixian Zhu",
      "Yiming Ying",
      "Tianbao Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.05535",
    "title": "A Lightweight, Efficient and Explainable-by-Design Convolutional Neural  Network for Internet Traffic Classification",
    "abstract": " Comments: Accepted for publication in the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining, Long Beach, USA, 2023 ",
    "url": "https://arxiv.org/abs/2202.05535",
    "authors": [
      "Kevin Fauvel",
      "Fuxing Chen",
      "Dario Rossi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.04285",
    "title": "A Unification Framework for Euclidean and Hyperbolic Graph Neural  Networks",
    "abstract": " Title: A Unification Framework for Euclidean and Hyperbolic Graph Neural  Networks ",
    "url": "https://arxiv.org/abs/2206.04285",
    "authors": [
      "Mehrdad Khatir",
      "Nurendra Choudhary",
      "Sutanay Choudhury",
      "Khushbu Agarwal",
      "Chandan K. Reddy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2206.04882",
    "title": "$\\mathsf{G^2Retro}$ as a Two-Step Graph Generative Models for  Retrosynthesis Prediction",
    "abstract": " Title: $\\mathsf{G^2Retro}$ as a Two-Step Graph Generative Models for  Retrosynthesis Prediction ",
    "url": "https://arxiv.org/abs/2206.04882",
    "authors": [
      "Ziqi Chen",
      "Oluwatosin R. Ayinde",
      "James R. Fuchs",
      "Huan Sun",
      "Xia Ning"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Chemical Physics (physics.chem-ph)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2206.05731",
    "title": "Human Mobility Prediction with Causal and Spatial-constrained Multi-task  Network",
    "abstract": " Comments: Updated version (We have corrected the title error in the previous version.) ",
    "url": "https://arxiv.org/abs/2206.05731",
    "authors": [
      "Zongyuan Huang",
      "Shengyuan Xu",
      "Menghan Wang",
      "Hansi Wu",
      "Yanyan Xu",
      "Yaohui Jin"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2206.10858",
    "title": "Robust Universal Adversarial Perturbations",
    "abstract": " Comments: 16 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2206.10858",
    "authors": [
      "Changming Xu",
      "Gagandeep Singh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2206.12839",
    "title": "Repository-Level Prompt Generation for Large Language Models of Code",
    "abstract": " Comments: ICML 2023 (Camera-Ready version) ",
    "url": "https://arxiv.org/abs/2206.12839",
    "authors": [
      "Disha Shrivastava",
      "Hugo Larochelle",
      "Daniel Tarlow"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2209.15404",
    "title": "Entropy-driven Unsupervised Keypoint Representation Learning in Videos",
    "abstract": " Comments: 29 pages, 14 figures, Accepted at ICML 2023 ",
    "url": "https://arxiv.org/abs/2209.15404",
    "authors": [
      "Ali Younes",
      "Simone Schaub-Meyer",
      "Georgia Chalvatzaki"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.00949",
    "title": "Block-wise Training of Residual Networks via the Minimizing Movement  Scheme",
    "abstract": " Comments: 1st International Workshop on Practical Deep Learning in the Wild at AAAI 2022 ",
    "url": "https://arxiv.org/abs/2210.00949",
    "authors": [
      "Skander Karkar",
      "Ibrahim Ayed",
      "Emmanuel de Bézenac",
      "Patrick Gallinari"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.03338",
    "title": "On Routing Optimization in Networks with Embedded Computational Services",
    "abstract": " Comments: 16 figures ",
    "url": "https://arxiv.org/abs/2210.03338",
    "authors": [
      "Lifan Mei",
      "Jinrui Gou",
      "Jingrui Yang",
      "Yujin Cai",
      "Yong Liu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2210.05901",
    "title": "Zero-Shot Prompting for Implicit Intent Prediction and Recommendation  with Commonsense Reasoning",
    "abstract": " Title: Zero-Shot Prompting for Implicit Intent Prediction and Recommendation  with Commonsense Reasoning ",
    "url": "https://arxiv.org/abs/2210.05901",
    "authors": [
      "Hui-Chi Kuo",
      "Yun-Nung Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.14309",
    "title": "Empowering Long-tail Item Recommendation through Cross Decoupling  Network (CDN)",
    "abstract": " Comments: Accepted by KDD 2023 Applied Data Science (ADS) track ",
    "url": "https://arxiv.org/abs/2210.14309",
    "authors": [
      "Yin Zhang",
      "Ruoxi Wang",
      "Derek Zhiyuan Cheng",
      "Tiansheng Yao",
      "Xinyang Yi",
      "Lichan Hong",
      "James Caverlee",
      "Ed H. Chi"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2211.02139",
    "title": "Can Querying for Bias Leak Protected Attributes? Achieving Privacy With  Smooth Sensitivity",
    "abstract": " Comments: Published in 2023 ACM Conference on Fairness, Accountability, and Transparency (FAccT2023) ",
    "url": "https://arxiv.org/abs/2211.02139",
    "authors": [
      "Faisal Hamman",
      "Jiahao Chen",
      "Sanghamitra Dutta"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2212.01953",
    "title": "Context-aware multi-head self-attentional neural network model for next  location prediction",
    "abstract": " Comments: Updated figures and added more descriptions in Appendix ",
    "url": "https://arxiv.org/abs/2212.01953",
    "authors": [
      "Ye Hong",
      "Yatao Zhang",
      "Konrad Schindler",
      "Martin Raubal"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.07981",
    "title": "Revisiting the Gold Standard: Grounding Summarization Evaluation with  Robust Human Evaluation",
    "abstract": " Comments: ACL 2023 Camera Ready ",
    "url": "https://arxiv.org/abs/2212.07981",
    "authors": [
      "Yixin Liu",
      "Alexander R. Fabbri",
      "Pengfei Liu",
      "Yilun Zhao",
      "Linyong Nan",
      "Ruilin Han",
      "Simeng Han",
      "Shafiq Joty",
      "Chien-Sheng Wu",
      "Caiming Xiong",
      "Dragomir Radev"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2212.08333",
    "title": "AnyGrasp: Robust and Efficient Grasp Perception in Spatial and Temporal  Domains",
    "abstract": " Comments: Paper accepted to T-RO. Project page is at this https URL ",
    "url": "https://arxiv.org/abs/2212.08333",
    "authors": [
      "Hao-Shu Fang",
      "Chenxi Wang",
      "Hongjie Fang",
      "Minghao Gou",
      "Jirong Liu",
      "Hengxu Yan",
      "Wenhai Liu",
      "Yichen Xie",
      "Cewu Lu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2212.14665",
    "title": "Sizing Grid-Connected Wind Power Generation and Energy Storage  Considering Wake Effect and Endogenous Uncertainty: A Distributionally Robust  Method",
    "abstract": " Comments: 27 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2212.14665",
    "authors": [
      "Rui Xie",
      "Wei Wei",
      "Yue Chen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2301.01905",
    "title": "FireFly: A High-Throughput Hardware Accelerator for Spiking Neural  Networks with Efficient DSP and Memory Optimization",
    "abstract": " Title: FireFly: A High-Throughput Hardware Accelerator for Spiking Neural  Networks with Efficient DSP and Memory Optimization ",
    "url": "https://arxiv.org/abs/2301.01905",
    "authors": [
      "Jindong Li",
      "Guobin Shen",
      "Dongcheng Zhao",
      "Qian Zhang",
      "Yi Zeng"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2301.03722",
    "title": "Revisiting Cellular Throughput Prediction over the Edge: Collaborative  Multi-device, Multi-network in-situ Learning",
    "abstract": " Comments: 12 pages, 10 figures, Accepted in International Conference on Embedded Wireless Systems and Networks (EWSN 2023) ",
    "url": "https://arxiv.org/abs/2301.03722",
    "authors": [
      "Argha Sen",
      "Ayan Zunaid",
      "Soumyajit Chatterjee",
      "Basabdatta Palit",
      "Sandip Chakraborty"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2301.08987",
    "title": "Tier Balancing: Towards Dynamic Fairness over Underlying Causal Factors",
    "abstract": " Title: Tier Balancing: Towards Dynamic Fairness over Underlying Causal Factors ",
    "url": "https://arxiv.org/abs/2301.08987",
    "authors": [
      "Zeyu Tang",
      "Yatong Chen",
      "Yang Liu",
      "Kun Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.11462",
    "title": "How poor is the stimulus? Evaluating hierarchical generalization in  neural networks trained on child-directed speech",
    "abstract": " Comments: 10 pages plus references and appendices; accepted to ACL ",
    "url": "https://arxiv.org/abs/2301.11462",
    "authors": [
      "Aditya Yedetore",
      "Tal Linzen",
      "Robert Frank",
      "R. Thomas McCoy"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.11526",
    "title": "Direct Parameterization of Lipschitz-Bounded Deep Networks",
    "abstract": " Comments: accepted to ICML 2023 ",
    "url": "https://arxiv.org/abs/2301.11526",
    "authors": [
      "Ruigang Wang",
      "Ian R. Manchester"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.13293",
    "title": "Overcoming Simplicity Bias in Deep Networks using a Feature Sieve",
    "abstract": " Comments: Accepted at ICML 2023 ",
    "url": "https://arxiv.org/abs/2301.13293",
    "authors": [
      "Rishabh Tiwari",
      "Pradeep Shenoy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.13370",
    "title": "On the Correctness of Automatic Differentiation for Neural Networks with  Machine-Representable Parameters",
    "abstract": " Comments: To appear at ICML 2023 ",
    "url": "https://arxiv.org/abs/2301.13370",
    "authors": [
      "Wonyeol Lee",
      "Sejun Park",
      "Alex Aiken"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.01567",
    "title": "Deep Reinforcement Learning for Online Error Detection in Cyber-Physical  Systems",
    "abstract": " Comments: There are some problems in the paper, so the authors decide to withdraw the paper ",
    "url": "https://arxiv.org/abs/2302.01567",
    "authors": [
      "Seyyedamirhossein Saeidi",
      "Forouzan Fallah",
      "Saeed Samieezafarghandi",
      "Hamed Farbeh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.02209",
    "title": "A Theory of Link Prediction via Relational Weisfeiler-Leman",
    "abstract": " Title: A Theory of Link Prediction via Relational Weisfeiler-Leman ",
    "url": "https://arxiv.org/abs/2302.02209",
    "authors": [
      "Xingyue Huang",
      "Miguel Romero Orth",
      "İsmail İlkan Ceylan",
      "Pablo Barceló"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.02563",
    "title": "Stochastic Gradient Descent-Induced Drift of Representation in a  Two-Layer Neural Network",
    "abstract": " Comments: International Conference on Machine Learning (ICML) 2023 ",
    "url": "https://arxiv.org/abs/2302.02563",
    "authors": [
      "Farhad Pashakhanloo",
      "Alexei Koulakov"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.02923",
    "title": "In Search of Insights, Not Magic Bullets: Towards Demystification of the  Model Selection Dilemma in Heterogeneous Treatment Effect Estimation",
    "abstract": " Comments: To appear in the Proceedings of the 40th International Conference on Machine Learning, Honolulu, Hawaii, USA. PMLR 202, 2023 ",
    "url": "https://arxiv.org/abs/2302.02923",
    "authors": [
      "Alicia Curth",
      "Mihaela van der Schaar"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Econometrics (econ.EM)"
    ]
  },
  {
    "id": "arXiv:2302.04578",
    "title": "Adversarial Example Does Good: Preventing Painting Imitation from  Diffusion Models via Adversarial Examples",
    "abstract": " Comments: Accepted by ICML2023 (Oral) ",
    "url": "https://arxiv.org/abs/2302.04578",
    "authors": [
      "Chumeng Liang",
      "Xiaoyu Wu",
      "Yang Hua",
      "Jiaru Zhang",
      "Yiming Xue",
      "Tao Song",
      "Zhengui Xue",
      "Ruhui Ma",
      "Haibing Guan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.04775",
    "title": "Adap-$τ$: Adaptively Modulating Embedding Magnitude for  Recommendation",
    "abstract": " Title: Adap-$τ$: Adaptively Modulating Embedding Magnitude for  Recommendation ",
    "url": "https://arxiv.org/abs/2302.04775",
    "authors": [
      "Jiawei Chen",
      "Junkang Wu",
      "Jiancan Wu",
      "Sheng Zhou",
      "Xuezhi Cao",
      "Xiangnan He"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.05783",
    "title": "ConCerNet: A Contrastive Learning Based Framework for Automated  Conservation Law Discovery and Trustworthy Dynamical System Prediction",
    "abstract": " Comments: Accepted by ICML 2023 ",
    "url": "https://arxiv.org/abs/2302.05783",
    "authors": [
      "Wang Zhang",
      "Tsui-Wei Weng",
      "Subhro Das",
      "Alexandre Megretski",
      "Luca Daniel",
      "Lam M. Nguyen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07636",
    "title": "DP-BART for Privatized Text Rewriting under Local Differential Privacy",
    "abstract": " Comments: Accepted at ACL Findings 2023 ",
    "url": "https://arxiv.org/abs/2302.07636",
    "authors": [
      "Timour Igamberdiev",
      "Ivan Habernal"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.14011",
    "title": "Causal isotonic calibration for heterogeneous treatment effects",
    "abstract": " Comments: Accepted to ICML2023 ",
    "url": "https://arxiv.org/abs/2302.14011",
    "authors": [
      "Lars van der Laan",
      "Ernesto Ulloa-Pérez",
      "Marco Carone",
      "Alex Luedtke"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2303.02278",
    "title": "Federated Virtual Learning on Heterogeneous Data with Local-global  Distillation",
    "abstract": " Title: Federated Virtual Learning on Heterogeneous Data with Local-global  Distillation ",
    "url": "https://arxiv.org/abs/2303.02278",
    "authors": [
      "Chun-Yin Huang",
      "Ruinan Jin",
      "Can Zhao",
      "Daguang Xu",
      "Xiaoxiao Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.03592",
    "title": "Exploring the Limits of Model-Targeted Indiscriminate Data Poisoning  Attacks",
    "abstract": " Comments: Accepted to ICML 2023 ",
    "url": "https://arxiv.org/abs/2303.03592",
    "authors": [
      "Yiwei Lu",
      "Gautam Kamath",
      "Yaoliang Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2303.04791",
    "title": "Ewald-based Long-Range Message Passing for Molecular Graphs",
    "abstract": " Comments: Published at the 40th International Conference on Machine Learning (ICML 2023) ",
    "url": "https://arxiv.org/abs/2303.04791",
    "authors": [
      "Arthur Kosmala",
      "Johannes Gasteiger",
      "Nicholas Gao",
      "Stephan Günnemann"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Materials Science (cond-mat.mtrl-sci)",
      "Chemical Physics (physics.chem-ph)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2303.10623",
    "title": "Active hypothesis testing in unknown environments using recurrent neural  networks and model free reinforcement learning",
    "abstract": " Comments: 5 pages, 6 tables ",
    "url": "https://arxiv.org/abs/2303.10623",
    "authors": [
      "George Stamatelis",
      "Nicholas Kalouptsidis"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2303.10909",
    "title": "Graph Neural Rough Differential Equations for Traffic Forecasting",
    "abstract": " Comments: Accepted to ACM Transactions on Intelligent Systems and Technology (ACM TIST). arXiv admin note: substantial text overlap with arXiv:2112.03558 ",
    "url": "https://arxiv.org/abs/2303.10909",
    "authors": [
      "Jeongwhan Choi",
      "Noseong Park"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.11249",
    "title": "What Makes Data Suitable for a Locally Connected Neural Network? A  Necessary and Sufficient Condition Based on Quantum Entanglement",
    "abstract": " Title: What Makes Data Suitable for a Locally Connected Neural Network? A  Necessary and Sufficient Condition Based on Quantum Entanglement ",
    "url": "https://arxiv.org/abs/2303.11249",
    "authors": [
      "Yotam Alexander",
      "Nimrod De La Vega",
      "Noam Razin",
      "Nadav Cohen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2304.06653",
    "title": "Graph2topic: an opensource topic modeling framework based on sentence  embedding and community detection",
    "abstract": " Comments: 11pages ",
    "url": "https://arxiv.org/abs/2304.06653",
    "authors": [
      "Leihang Zhang",
      "Jiapeng Liu",
      "Qiang Yan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.08297",
    "title": "Comments on 'Fast and scalable search of whole-slide images via  self-supervised deep learning'",
    "abstract": " Title: Comments on 'Fast and scalable search of whole-slide images via  self-supervised deep learning' ",
    "url": "https://arxiv.org/abs/2304.08297",
    "authors": [
      "Milad Sikaroudi",
      "Mehdi Afshari",
      "Abubakr Shafique",
      "Shivam Kalra",
      "H.R. Tizhoosh"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.14209",
    "title": "A transparent approach to data representation",
    "abstract": " Title: A transparent approach to data representation ",
    "url": "https://arxiv.org/abs/2304.14209",
    "authors": [
      "Sean Deyo",
      "Veit Elser"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.14590",
    "title": "A logical word embedding for learning grammar",
    "abstract": " Title: A logical word embedding for learning grammar ",
    "url": "https://arxiv.org/abs/2304.14590",
    "authors": [
      "Sean Deyo",
      "Veit Elser"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.04379",
    "title": "Data Efficient Training with Imbalanced Label Sample Distribution for  Fashion Detection",
    "abstract": " Comments: We have identified a substantial error in the experimental results and a potentially misleading explanation of the algorithm. We kindly request that you consider withdrawing this version to mitigate the risk of disseminating inaccurate information ",
    "url": "https://arxiv.org/abs/2305.04379",
    "authors": [
      "Xin Shen",
      "Praful Agrawal",
      "Zhongwei Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.04447",
    "title": "Neural Steerer: Novel Steering Vector Synthesis with a Causal Neural  Field over Frequency and Source Positions",
    "abstract": " Comments: Correction in the model (2) ",
    "url": "https://arxiv.org/abs/2305.04447",
    "authors": [
      "Diego Di Carlo",
      "Aditya Arie Nugraha",
      "Mathieu Fontaine",
      "Mathieu Fontaine",
      "Kazuyoshi Yoshii"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2305.04990",
    "title": "Explanation-based Finetuning Makes Models More Robust to Spurious Cues",
    "abstract": " Title: Explanation-based Finetuning Makes Models More Robust to Spurious Cues ",
    "url": "https://arxiv.org/abs/2305.04990",
    "authors": [
      "Josh Magnus Ludan",
      "Yixuan Meng",
      "Tai Nguyen",
      "Saurabh Shah",
      "Qing Lyu",
      "Marianna Apidianaki",
      "Chris Callison-Burch"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.05222",
    "title": "FishRecGAN: An End to End GAN Based Network for Fisheye Rectification  and Calibration",
    "abstract": " Title: FishRecGAN: An End to End GAN Based Network for Fisheye Rectification  and Calibration ",
    "url": "https://arxiv.org/abs/2305.05222",
    "authors": [
      "Xin Shen",
      "Kyungdon Joo",
      "Jean Oh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.05228",
    "title": "Semantic Embedded Deep Neural Network: A Generic Approach to Boost  Multi-Label Image Classification Performance",
    "abstract": " Title: Semantic Embedded Deep Neural Network: A Generic Approach to Boost  Multi-Label Image Classification Performance ",
    "url": "https://arxiv.org/abs/2305.05228",
    "authors": [
      "Xin Shen",
      "Xiaonan Zhao",
      "Rui Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.05267",
    "title": "Learning Personalized Page Content Ranking Using Customer Representation",
    "abstract": " Title: Learning Personalized Page Content Ranking Using Customer Representation ",
    "url": "https://arxiv.org/abs/2305.05267",
    "authors": [
      "Xin Shen",
      "Yan Zhao",
      "Sujan Perera",
      "Yujia Liu",
      "Jinyun Yan",
      "Mitchell Goodman"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Multiagent Systems (cs.MA)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.07580",
    "title": "Fisher Information Embedding for Node and Graph Learning",
    "abstract": " Comments: ICML 2023 ",
    "url": "https://arxiv.org/abs/2305.07580",
    "authors": [
      "Dexiong Chen",
      "Paolo Pellizzoni",
      "Karsten Borgwardt"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07598",
    "title": "RHINO: Rotated DETR with Dynamic Denoising via Hungarian Matching for  Oriented Object Detection",
    "abstract": " Comments: State-of-the-art rotated object detector in DOTA v1.0/v1.5/v2.0 and DIOR-R at the time of publication ",
    "url": "https://arxiv.org/abs/2305.07598",
    "authors": [
      "Hakjin Lee",
      "Minki Song",
      "Jamyoung Koo",
      "Junghoon Seo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11640",
    "title": "Distribution-Free Matrix Prediction Under Arbitrary Missing Pattern",
    "abstract": " Comments: 12 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2305.11640",
    "authors": [
      "Meijia Shao",
      "Yuan Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.12464",
    "title": "Self-supervised Predictive Coding Models Encode Speaker and Phonetic  Information in Orthogonal Subspaces",
    "abstract": " Comments: Accepted to Interspeech 2023 ",
    "url": "https://arxiv.org/abs/2305.12464",
    "authors": [
      "Oli Liu",
      "Hao Tang",
      "Sharon Goldwater"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2305.12635",
    "title": "A bioinspired three-stage model for camouflaged object detection",
    "abstract": " Title: A bioinspired three-stage model for camouflaged object detection ",
    "url": "https://arxiv.org/abs/2305.12635",
    "authors": [
      "Tianyou Chen",
      "Jin Xiao",
      "Xiaoguang Hu",
      "Guofeng Zhang",
      "Shaojie Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.15598",
    "title": "Linear Neural Network Layers Promote Learning Single- and Multiple-Index  Models",
    "abstract": " Title: Linear Neural Network Layers Promote Learning Single- and Multiple-Index  Models ",
    "url": "https://arxiv.org/abs/2305.15598",
    "authors": [
      "Suzanna Parkinson",
      "Greg Ongie",
      "Rebecca Willett"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.17449",
    "title": "FishEye8K: A Benchmark and Dataset for Fisheye Camera Object Detection",
    "abstract": " Comments: CVPR Workshops 2023 ",
    "url": "https://arxiv.org/abs/2305.17449",
    "authors": [
      "Munkhjargal Gochoo",
      "Munkh-Erdene Otgonbold",
      "Erkhembayar Ganbold",
      "Jun-Wei Hsieh",
      "Ming-Ching Chang",
      "Ping-Yang Chen",
      "Byambaa Dorj",
      "Hamad Al Jassmi",
      "Ganzorig Batnasan",
      "Fady Alnajjar",
      "Mohammed Abduljabbar",
      "Fang-Pang Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.18885",
    "title": "Criteria Tell You More than Ratings: Criteria Preference-Aware Light  Graph Convolution for Effective Multi-Criteria Recommendation",
    "abstract": " Comments: 12 pages, 10 figures, 5 tables; 29th ACM SIGKDD Conference on Knowledge Discovery & Data (KDD 2023) (to appear) (Please cite our conference version.) ",
    "url": "https://arxiv.org/abs/2305.18885",
    "authors": [
      "Jin-Duk Park",
      "Siqing Li",
      "Xin Cao",
      "Won-Yong Shin"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.00107",
    "title": "MERT: Acoustic Music Understanding Model with Large-Scale  Self-supervised Training",
    "abstract": " Title: MERT: Acoustic Music Understanding Model with Large-Scale  Self-supervised Training ",
    "url": "https://arxiv.org/abs/2306.00107",
    "authors": [
      "Yizhi Li",
      "Ruibin Yuan",
      "Ge Zhang",
      "Yinghao Ma",
      "Xingran Chen",
      "Hanzhi Yin",
      "Chenghua Lin",
      "Anton Ragni",
      "Emmanouil Benetos",
      "Norbert Gyenge",
      "Roger Dannenberg",
      "Ruibo Liu",
      "Wenhu Chen",
      "Gus Xia",
      "Yemin Shi",
      "Wenhao Huang",
      "Yike Guo",
      "Jie Fu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2306.00597",
    "title": "Analysis of ChatGPT on Source Code",
    "abstract": " Comments: 40 pages, examples provided for each experiment ",
    "url": "https://arxiv.org/abs/2306.00597",
    "authors": [
      "Ahmed R. Sadik",
      "Antonello Ceravola",
      "Frank Joublin",
      "Jibesh Patra"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2306.00698",
    "title": "Prediction of Post-Operative Renal and Pulmonary Complications Using  Transformers",
    "abstract": " Title: Prediction of Post-Operative Renal and Pulmonary Complications Using  Transformers ",
    "url": "https://arxiv.org/abs/2306.00698",
    "authors": [
      "Reza Shirkavand",
      "Fei Zhang",
      "Heng Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.01951",
    "title": "GAD-NR: Graph Anomaly Detection via Neighborhood Reconstruction",
    "abstract": " Title: GAD-NR: Graph Anomaly Detection via Neighborhood Reconstruction ",
    "url": "https://arxiv.org/abs/2306.01951",
    "authors": [
      "Amit Roy",
      "Juan Shu",
      "Jia Li",
      "Carl Yang",
      "Olivier Elshocht",
      "Jeroen Smeets",
      "Pan Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.02157",
    "title": "Transforming to Yoked Neural Networks to Improve ANN Structure",
    "abstract": " Title: Transforming to Yoked Neural Networks to Improve ANN Structure ",
    "url": "https://arxiv.org/abs/2306.02157",
    "authors": [
      "Xinshun Liu",
      "Yizhi Fang",
      "Yichao Jiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.02239",
    "title": "Generative Flow Network for Listwise Recommendation",
    "abstract": " Comments: 11 pages, 5 figures, 9 tables ",
    "url": "https://arxiv.org/abs/2306.02239",
    "authors": [
      "Shuchang Liu",
      "Qingpeng Cai",
      "Zhankui He",
      "Bowen Sun",
      "Julian McAuley",
      "Done Zheng",
      "Peng Jiang",
      "Kun Gai"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2306.02744",
    "title": "Towards Better Explanations for Object Detection",
    "abstract": " Comments: 9 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2306.02744",
    "authors": [
      "Van Binh Truong",
      "Truong Thanh Hung Nguyen",
      "Vo Thanh Khang Nguyen",
      "Quoc Khanh Nguyen",
      "Quoc Hung Cao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03013",
    "title": "Hiding in Plain Sight: Disguising Data Stealing Attacks in Federated  Learning",
    "abstract": " Title: Hiding in Plain Sight: Disguising Data Stealing Attacks in Federated  Learning ",
    "url": "https://arxiv.org/abs/2306.03013",
    "authors": [
      "Kostadin Garov",
      "Dimitar I. Dimitrov",
      "Nikola Jovanović",
      "Martin Vechev"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  }
]