[
  {
    "id": "arXiv:2109.11735",
    "title": "Comments on \"Robust reversible data hiding scheme based on two-layer  embedding strategy\"",
    "abstract": "In paper \"Robust reversible data hiding scheme based on two-layer embedding strategy\" published in INS recently, Kumar et al. proposed an Robust Reversible Data Hiding (RRDH) scheme based on two-layer embedding. Secret data is embedded into Most Significant Bit (MSB) planes and sorting strategy based on local complexity is adopted to reduce distortion. However, Kumar et al.'s RDH scheme is not as robust as stated and can not be called RRDH. In this comment, we give a brief description of Kumar et al.'s RDH scheme at first and then show robust testing experiments by analysing the changes in each bit plane after Joint Photographic Experts Group (JPEG) compression and the changes in pixel value ordering. ",
    "url": "https://arxiv.org/abs/2109.11735",
    "authors": [
      "Wen Yin",
      "Longfei Ke",
      "Zhaoxia Yin",
      "Jin Tang",
      "Bin Luo"
    ],
    "subjectives": [
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2109.11763",
    "title": "Lacking the embedding of a word? Look it up into a traditional  dictionary",
    "abstract": "Word embeddings are powerful dictionaries, which may easily capture language variations. However, these dictionaries fail to give sense to rare words, which are surprisingly often covered by traditional dictionaries. In this paper, we propose to use definitions retrieved in traditional dictionaries to produce word embeddings for rare words. For this purpose, we introduce two methods: Definition Neural Network (DefiNNet) and Define BERT (DefBERT). In our experiments, DefiNNet and DefBERT significantly outperform state-of-the-art as well as baseline methods devised for producing embeddings of unknown words. In fact, DefiNNet significantly outperforms FastText, which implements a method for the same task-based on n-grams, and DefBERT significantly outperforms the BERT method for OOV words. Then, definitions in traditional dictionaries are useful to build word embeddings for rare words. ",
    "url": "https://arxiv.org/abs/2109.11763",
    "authors": [
      "Elena Sofia Ruzzetti",
      "Leonardo Ranaldi",
      "Michele Mastromattei",
      "Francesca Fallucchi",
      "Fabio Massimo Zanzotto"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.11848",
    "title": "How to find a good image-text embedding for remote sensing visual  question answering?",
    "abstract": "Visual question answering (VQA) has recently been introduced to remote sensing to make information extraction from overhead imagery more accessible to everyone. VQA considers a question (in natural language, therefore easy to formulate) about an image and aims at providing an answer through a model based on computer vision and natural language processing methods. As such, a VQA model needs to jointly consider visual and textual features, which is frequently done through a fusion step. In this work, we study three different fusion methodologies in the context of VQA for remote sensing and analyse the gains in accuracy with respect to the model complexity. Our findings indicate that more complex fusion mechanisms yield an improved performance, yet that seeking a trade-of between model complexity and performance is worthwhile in practice. ",
    "url": "https://arxiv.org/abs/2109.11848",
    "authors": [
      "Christel Chappuis",
      "Sylvain Lobry",
      "Benjamin Kellenberger",
      "Bertrand Le Saux",
      "Devis Tuia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.11970",
    "title": "Making opportunistic networks in IoT environments CCN-ready: A  performance evaluation of the MobCCN protocol",
    "abstract": "In future IoT environments it is expected that the role of personal devices of mobile users in the physical area where IoT devices are deployed will become more and more important. In particular, due to the push towards decentralisation of services towards the edge, it is likely that a significant share of data generated by IoT devices will be needed by other (mobile) nodes nearby, while global Internet access will be limited only to a small fraction of data. In this context, opportunistic networking schemes can be adopted to build efficient content-centric protocols, through which data generated by IoT devices (or by mobile nodes themselves) can be accessed by the other nodes nearby. In this paper, we propose MobCCN, which is an ICN-compliant protocol for this heterogeneous environment. MobCCN is designed to implement the routing and forwarding mechanisms of the main ICN realisations, such as CCN. The original aspect of MobCCN is to implement an efficient opportunistic networking routing scheme to populate the Forwarding Interest Base (FIB) tables of the nodes, in order to guide the propagation of Interest packets towards nodes that store the required data. Specifically, MobCCN defines the utility of each node as a forwarder of Interest packets for a certain type of content, such that Interest packets can be propagated along a positive utility gradient, until reaching some node storing the data. We evaluate MobCCN against protocols representing two possible endpoints of the spectrum, respectively in terms of minimising the data delivery delay and the resource consumption. Performance results show that MobCCN is very effective and efficient, as it guarantees very high delivery rates and low delays, while keeping the total generated traffic at a reasonable level and also saving local resources. ",
    "url": "https://arxiv.org/abs/2109.11970",
    "authors": [
      "Eleonora Borgia",
      "Raffaele Bruno",
      "Andrea Passarella"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2109.12061",
    "title": "Computing the Barnes $G$-function in the entire complex plane",
    "abstract": "We present an algorithm for generating approximations for the logarithm of Barnes $G$-function in the half-plane ${\\textrm{Re}}(z)\\ge 3/2$. These approximations involve only elementary functions and are easy to implement. The algorithm is based on a two-point Pad\\'e approximation and we use it to provide two approximations to $\\ln(G(z))$, accurate to $3 \\times 10^{-16}$ and $3 \\times 10^{-31}$ in the half-plane ${\\textrm{Re}}(z)\\ge 3/2$; a reflection formula is then used to compute Barnes $G$-function in the entire complex plane. A by-product of our algorithm is that it also produces accurate approximations to the gamma function. ",
    "url": "https://arxiv.org/abs/2109.12061",
    "authors": [
      "Alexey Kuznetsov"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2109.12079",
    "title": "SEED: Semantic Graph based Deep detection for type-4 clone",
    "abstract": "Background: Type-4 clones refer to a pair of code snippets with similar functionality but written in different syntax, which challenges the existing code clone detection techniques. Previous studies, however, highly rely on syntactic structures and textual tokens, which cannot precisely represent the semantic information of code and might introduce nonnegligible noise into the detection models. Aims: To overcome these limitations, we explore an effective semantic-based solution for Type-4 clone detection. Additionally, we conducted an empirical study on the characteristics of Type-4 clone pairs. We found that NOT all tokens contain semantics that the Type-4 clone detection required. Operators and API calls emerge as distinct candidates for Type-4 code semantic representation. Method: To bridge this gap, we design a novel semantic graph based deep detection approach, called SEED. For a pair of code snippets, SEED constructs a semantic graph of each code snippet based on intermediate representation to represent the code functionality more precisely compared to the representations based on lexical and syntactic analysis. To accommodate the characteristics of Type-4 clones, a semantic graph is constructed focusing on the operators and API calls instead of all tokens. Then, SEED generates the feature vectors by using the graph deep neural network and performs code clone detection based on the similarity among the vectors. Results: Extensive experiments show that our approach significantly outperforms two baseline approaches over two public datasets and one customized dataset. Specially, SEED outperforms other baseline methods by an average of 25.2% in the form of F1-Score. Conclusions: Our experiments demonstrate that SEED can reach state-of-the-art and be useful for Type-4 clone detection in practice. ",
    "url": "https://arxiv.org/abs/2109.12079",
    "authors": [
      "Zhipeng Xue",
      "Haoran Liu",
      "Chen Zeng",
      "Chenglong Zhou",
      "Xiaodong Liu",
      "Yangtao Ge",
      "Jinjing Zhao"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2109.11579",
    "title": "Remaining useful life prediction with uncertainty quantification:  development of a highly accurate model for rotating machinery",
    "abstract": "Rotating machinery is essential to modern life, from power generation to transportation and a host of other industrial applications. Since such equipment generally operates under challenging working conditions, which can lead to untimely failures, accurate remaining useful life (RUL) prediction is essential for maintenance planning and to prevent catastrophic failures. In this work, we address current challenges in data-driven RUL prediction for rotating machinery. The challenges revolve around the accuracy and uncertainty quantification of the prediction, and the non-stationarity of the system degradation and RUL estimation given sensor data. We devise a novel architecture and RUL prediction model with uncertainty quantification, termed VisPro, which integrates time-frequency analysis, deep learning image recognition, and nonstationary Gaussian process regression. We analyze and benchmark the results obtained with our model against those of other advanced data-driven RUL prediction models for rotating machinery using the PHM12 bearing vibration dataset. The computational experiments show that (1) the VisPro predictions are highly accurate and provide significant improvements over existing prediction models (three times more accurate than the second-best model), and (2) the RUL uncertainty bounds are valid and informative. We identify and discuss the architectural and modeling choices made that explain this excellent predictive performance of VisPro. ",
    "url": "https://arxiv.org/abs/2109.11579",
    "authors": [
      "Zhaoyi Xu",
      "Yanjie Guo",
      "Joseph Homer Saleh"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.11676",
    "title": "Theory of overparametrization in quantum neural networks",
    "abstract": "The prospect of achieving quantum advantage with Quantum Neural Networks (QNNs) is exciting. Understanding how QNN properties (e.g., the number of parameters $M$) affect the loss landscape is crucial to the design of scalable QNN architectures. Here, we rigorously analyze the overparametrization phenomenon in QNNs with periodic structure. We define overparametrization as the regime where the QNN has more than a critical number of parameters $M_c$ that allows it to explore all relevant directions in state space. Our main results show that the dimension of the Lie algebra obtained from the generators of the QNN is an upper bound for $M_c$, and for the maximal rank that the quantum Fisher information and Hessian matrices can reach. Underparametrized QNNs have spurious local minima in the loss landscape that start disappearing when $M\\geq M_c$. Thus, the overparametrization onset corresponds to a computational phase transition where the QNN trainability is greatly improved by a more favorable landscape. We then connect the notion of overparametrization to the QNN capacity, so that when a QNN is overparametrized, its capacity achieves its maximum possible value. We run numerical simulations for eigensolver, compilation, and autoencoding applications to showcase the overparametrization computational phase transition. We note that our results also apply to variational quantum algorithms and quantum optimal control. ",
    "url": "https://arxiv.org/abs/2109.11676",
    "authors": [
      "Martin Larocca",
      "Nathan Ju",
      "Diego García-Martín",
      "Patrick J. Coles",
      "M. Cerezo"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2109.11927",
    "title": "$2$-distance $(Δ+2)$-coloring of sparse graphs",
    "abstract": "A $2$-distance $k$-coloring of a graph is a proper $k$-coloring of the vertices where vertices at distance at most 2 cannot share the same color. We prove the existence of a $2$-distance ($\\Delta+2$)-coloring for graphs with maximum average degree less than $\\frac{8}{3}$ (resp. $\\frac{14}{5}$) and maximum degree $\\Delta\\geq 6$ (resp. $\\Delta\\geq 10$). As a corollary, every planar graph with girth at least $8$ (resp. $7$) and maximum degree $\\Delta\\geq 6$ (resp. $\\Delta\\geq 10$) admits a $2$-distance $(\\Delta+2)$-coloring. ",
    "url": "https://arxiv.org/abs/2109.11927",
    "authors": [
      "Hoang La",
      "Mickael Montassier"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2009.05474",
    "title": "A black-box adversarial attack for poisoning clustering",
    "abstract": " Comments: 18 pages ",
    "url": "https://arxiv.org/abs/2009.05474",
    "authors": [
      "Antonio Emanuele Cinà",
      "Alessandro Torcinovich",
      "Marcello Pelillo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2011.12690",
    "title": "DeepKoCo: Efficient latent planning with a task-relevant Koopman  representation",
    "abstract": " Title: DeepKoCo: Efficient latent planning with a task-relevant Koopman  representation ",
    "url": "https://arxiv.org/abs/2011.12690",
    "authors": [
      "Bas van der Heijden",
      "Laura Ferranti",
      "Jens Kober",
      "Robert Babuska"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2103.03561",
    "title": "Nishimori meets Bethe: a spectral method for node classification in  sparse weighted graphs",
    "abstract": " Title: Nishimori meets Bethe: a spectral method for node classification in  sparse weighted graphs ",
    "url": "https://arxiv.org/abs/2103.03561",
    "authors": [
      "Lorenzo Dall'Amico",
      "Romain Couillet",
      "Nicolas Tremblay"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.11911",
    "title": "Research networks generated by organizational structures, co-authorships  and citations: A Case Study of German Centre for Integrative Biodiversity  Research (iDiv)",
    "abstract": " Comments: I should withdraw revise it as the funding agency required ",
    "url": "https://arxiv.org/abs/2103.11911",
    "authors": [
      "Zhao Qu"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2104.03618",
    "title": "MRI-based Alzheimer's disease prediction via distilling the knowledge in  multi-modal data",
    "abstract": " Title: MRI-based Alzheimer's disease prediction via distilling the knowledge in  multi-modal data ",
    "url": "https://arxiv.org/abs/2104.03618",
    "authors": [
      "Hao Guan",
      "Chaoyue Wang",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2104.03776",
    "title": "Statistically significant detection of semantic shifts using contextual  word embeddings",
    "abstract": " Title: Statistically significant detection of semantic shifts using contextual  word embeddings ",
    "url": "https://arxiv.org/abs/2104.03776",
    "authors": [
      "Yang Liu",
      "Alan Medlar",
      "Dorota Glowacka"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2106.12322",
    "title": "Distributed coloring and the local structure of unit-disk graphs",
    "abstract": " Comments: 24 pages, revised according to the referee reports of the conference version. A preliminary version of this work appeared in the proceedings of the 17th International Symposium on Algorithms and Experiments for Wireless Sensor Networks (ALGOSENSORS 2021) ",
    "url": "https://arxiv.org/abs/2106.12322",
    "authors": [
      "Louis Esperet",
      "Sébastien Julliot",
      "Arnaud de Mesmay"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Computational Geometry (cs.CG)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2108.04614",
    "title": "White blood cell subtype detection and classification",
    "abstract": " Title: White blood cell subtype detection and classification ",
    "url": "https://arxiv.org/abs/2108.04614",
    "authors": [
      "Nalla Praveen",
      "Narinder Singh Punn",
      "Sanjay Kumar Sonbhadra",
      "Sonali Agarwal",
      "M. Syafrullah",
      "Krisna Adiyarta"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.09574",
    "title": "On the representation of non-holonomic power series",
    "abstract": " Comments: 16 pages; 23 references. Update: correction of typos from the previous version ",
    "url": "https://arxiv.org/abs/2109.09574",
    "authors": [
      "Bertrand Teguia Tabuguia",
      "Wolfram Koepf"
    ],
    "subjectives": [
      "Symbolic Computation (cs.SC)"
    ]
  }
]