[
  {
    "id": "arXiv:2404.18935",
    "title": "What's in the Flow? Exploiting Temporal Motion Cues for Unsupervised  Generic Event Boundary Detection",
    "abstract": "Generic Event Boundary Detection (GEBD) task aims to recognize generic, taxonomy-free boundaries that segment a video into meaningful events. Current methods typically involve a neural model trained on a large volume of data, demanding substantial computational power and storage space. We explore two pivotal questions pertaining to GEBD: Can non-parametric algorithms outperform unsupervised neural methods? Does motion information alone suffice for high performance? This inquiry drives us to algorithmically harness motion cues for identifying generic event boundaries in videos. In this work, we propose FlowGEBD, a non-parametric, unsupervised technique for GEBD. Our approach entails two algorithms utilizing optical flow: (i) Pixel Tracking and (ii) Flow Normalization. By conducting thorough experimentation on the challenging Kinetics-GEBD and TAPOS datasets, our results establish FlowGEBD as the new state-of-the-art (SOTA) among unsupervised methods. FlowGEBD exceeds the neural models on the Kinetics-GEBD dataset by obtaining an F1@0.05 score of 0.713 with an absolute gain of 31.7% compared to the unsupervised baseline and achieves an average F1 score of 0.623 on the TAPOS validation dataset. ",
    "url": "https://arxiv.org/abs/2404.18935",
    "authors": [
      "Sourabh Vasant Gothe",
      "Vibhav Agarwal",
      "Sourav Ghosh",
      "Jayesh Rajkumar Vachhani",
      "Pranay Kashyap",
      "Barath Raj Kandur Raja"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.18942",
    "title": "GuideWalk -- Heterogeneous Data Fusion for Enhanced Learning -- A  Multiclass Document Classification Case",
    "abstract": "One of the prime problems of computer science and machine learning is to extract information efficiently from large-scale, heterogeneous data. Text data, with its syntax, semantics, and even hidden information content, possesses an exceptional place among the data types in concern. The processing of the text data requires embedding, a method of translating the content of the text to numeric vectors. A correct embedding algorithm is the starting point for obtaining the full information content of the text data. In this work, a new embedding method based on the graph structure of the meaningful sentences is proposed. The design of the algorithm aims to construct an embedding vector that constitutes syntactic and semantic elements as well as the hidden content of the text data. The success of the proposed embedding method is tested in classification problems. Among the wide range of application areas, text classification is the best laboratory for embedding methods; the classification power of the method can be tested using dimensional reduction without any further processing. Furthermore, the method can be compared with different embedding algorithms and machine learning methods. The proposed method is tested with real-world data sets and eight well-known and successful embedding algorithms. The proposed embedding method shows significantly better classification for binary and multiclass datasets compared to well-known algorithms. ",
    "url": "https://arxiv.org/abs/2404.18942",
    "authors": [
      "Sarmad N. Mohammed",
      "Semra Gündüç"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2404.18944",
    "title": "Investigating the dissemination of STEM content on social media with  computational tools",
    "abstract": "Social media platforms can quickly disseminate STEM content to diverse audiences, but their operation can be mysterious. We used open-source machine learning methods such as clustering, regression, and sentiment analysis to analyze over 1000 videos and metrics thereof from 6 social media STEM creators. Our data provide insights into how audiences generate interest signals(likes, bookmarks, comments, shares), on the correlation of various signals with views, and suggest that content from newer creators is disseminated differently. We also share insights on how to optimize dissemination by analyzing data available exclusively to content creators as well as via sentiment analysis of comments. ",
    "url": "https://arxiv.org/abs/2404.18944",
    "authors": [
      "Oluwamayokun Oshinowo",
      "Priscila Delgado",
      "Meredith Fay",
      "C. Alessandra Luna",
      "Anjana Dissanayaka",
      "Rebecca Jeltuhin",
      "David R. Myers"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.18948",
    "title": "Sub-Adjacent Transformer: Improving Time Series Anomaly Detection with  Reconstruction Error from Sub-Adjacent Neighborhoods",
    "abstract": "In this paper, we present the Sub-Adjacent Transformer with a novel attention mechanism for unsupervised time series anomaly detection. Unlike previous approaches that rely on all the points within some neighborhood for time point reconstruction, our method restricts the attention to regions not immediately adjacent to the target points, termed sub-adjacent neighborhoods. Our key observation is that owing to the rarity of anomalies, they typically exhibit more pronounced differences from their sub-adjacent neighborhoods than from their immediate vicinities. By focusing the attention on the sub-adjacent areas, we make the reconstruction of anomalies more challenging, thereby enhancing their detectability. Technically, our approach concentrates attention on the non-diagonal areas of the attention matrix by enlarging the corresponding elements in the training stage. To facilitate the implementation of the desired attention matrix pattern, we adopt linear attention because of its flexibility and adaptability. Moreover, a learnable mapping function is proposed to improve the performance of linear attention. Empirically, the Sub-Adjacent Transformer achieves state-of-the-art performance across six real-world anomaly detection benchmarks, covering diverse fields such as server monitoring, space exploration, and water treatment. ",
    "url": "https://arxiv.org/abs/2404.18948",
    "authors": [
      "Wenzhen Yue",
      "Xianghua Ying",
      "Ruohao Guo",
      "DongDong Chen",
      "Ji Shi",
      "Bowei Xing",
      "Yuqing Zhu",
      "Taiyan Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.18949",
    "title": "The Simpler The Better: An Entropy-Based Importance Metric To Reduce  Neural Networks' Depth",
    "abstract": "While deep neural networks are highly effective at solving complex tasks, large pre-trained models are commonly employed even to solve consistently simpler downstream tasks, which do not necessarily require a large model's complexity. Motivated by the awareness of the ever-growing AI environmental impact, we propose an efficiency strategy that leverages prior knowledge transferred by large models. Simple but effective, we propose a method relying on an Entropy-bASed Importance mEtRic (EASIER) to reduce the depth of over-parametrized deep neural networks, which alleviates their computational burden. We assess the effectiveness of our method on traditional image classification setups. The source code will be publicly released upon acceptance of the article. ",
    "url": "https://arxiv.org/abs/2404.18949",
    "authors": [
      "Victor Quétu",
      "Zhu Liao",
      "Enzo Tartaglione"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.18952",
    "title": "CUE-Net: Violence Detection Video Analytics with Spatial Cropping,  Enhanced UniformerV2 and Modified Efficient Additive Attention",
    "abstract": "In this paper we introduce CUE-Net, a novel architecture designed for automated violence detection in video surveillance. As surveillance systems become more prevalent due to technological advances and decreasing costs, the challenge of efficiently monitoring vast amounts of video data has intensified. CUE-Net addresses this challenge by combining spatial Cropping with an enhanced version of the UniformerV2 architecture, integrating convolutional and self-attention mechanisms alongside a novel Modified Efficient Additive Attention mechanism (which reduces the quadratic time complexity of self-attention) to effectively and efficiently identify violent activities. This approach aims to overcome traditional challenges such as capturing distant or partially obscured subjects within video frames. By focusing on both local and global spatiotemporal features, CUE-Net achieves state-of-the-art performance on the RWF-2000 and RLVS datasets, surpassing existing methods. ",
    "url": "https://arxiv.org/abs/2404.18952",
    "authors": [
      "Damith Chamalke Senadeera",
      "Xiaoyun Yang",
      "Dimitrios Kollias",
      "Gregory Slabaugh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.18984",
    "title": "\"I'm in the Bluesky Tonight\": Insights from a Year Worth of Social Data",
    "abstract": "Pollution of online social spaces caused by rampaging d/misinformation is a growing societal concern. However, recent decisions to reduce access to social media APIs are causing a shortage of publicly available, recent, social media data, thus hindering the advancement of computational social science as a whole. We present a large, high-coverage dataset of social interactions and user-generated content from Bluesky Social to address this pressing issue. The dataset contains the complete post history of over 4M users (81% of all registered accounts), totalling 235M posts. We also make available social data covering follow, comment, repost, and quote interactions. Since Bluesky allows users to create and bookmark feed generators (i.e., content recommendation algorithms), we also release the full output of several popular algorithms available on the platform, along with their timestamped ``like'' interactions and time of bookmarking. This dataset allows unprecedented analysis of online behavior and human-machine engagement patterns. Notably, it provides ground-truth data for studying the effects of content exposure and self-selection and performing content virality and diffusion analysis. ",
    "url": "https://arxiv.org/abs/2404.18984",
    "authors": [
      "Andrea Failla",
      "Giulio Rossetti"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2404.18990",
    "title": "Timely Status Updates in Slotted ALOHA Network With Energy Harvesting",
    "abstract": "We investigate the age of information (AoI) in a scenario where energy-harvesting devices send status updates to a gateway following the slotted ALOHA protocol and receive no feedback. We let the devices adjust the transmission probabilities based on their current battery level. Using a Markovian analysis, we derive analytically the average AoI. We further provide an approximate analysis for accurate and easy-to-compute approximations of both the average AoI and the age-violation probability (AVP), i.e., the probability that the AoI exceeds a given threshold. We also analyze the average throughput. Via numerical results, we investigate two baseline strategies: transmit a new update whenever possible to exploit every opportunity to reduce the AoI, and transmit only when sufficient energy is available to increase the chance of successful decoding. The two strategies are beneficial for low and high update-generation rates, respectively. We show that an optimized policy that balances the two strategies outperforms them significantly in terms of both AoI metrics and throughput. Finally, we show the benefit of decoding multiple packets in a slot using successive interference cancellation and adapting the transmission probability based on both the current battery level and the time elapsed since the last transmission. ",
    "url": "https://arxiv.org/abs/2404.18990",
    "authors": [
      "Khac-Hoang Ngo",
      "Giuseppe Durisi",
      "Andrea Munari",
      "Francisco Lázaro",
      "Alexandre Graell i Amat"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2404.19025",
    "title": "Unsupervised Binary Code Translation with Application to Code Similarity  Detection and Vulnerability Discovery",
    "abstract": "Binary code analysis has immense importance in the research domain of software security. Today, software is very often compiled for various Instruction Set Architectures (ISAs). As a result, cross-architecture binary code analysis has become an emerging problem. Recently, deep learning-based binary analysis has shown promising success. It is widely known that training a deep learning model requires a massive amount of data. However, for some low-resource ISAs, an adequate amount of data is hard to find, preventing deep learning from being widely adopted for binary analysis. To overcome the data scarcity problem and facilitate cross-architecture binary code analysis, we propose to apply the ideas and techniques in Neural Machine Translation (NMT) to binary code analysis. Our insight is that a binary, after disassembly, is represented in some assembly language. Given a binary in a low-resource ISA, we translate it to a binary in a high-resource ISA (e.g., x86). Then we can use a model that has been trained on the high-resource ISA to test the translated binary. We have implemented the model called UNSUPERBINTRANS, and conducted experiments to evaluate its performance. Specifically, we conducted two downstream tasks, including code similarity detection and vulnerability discovery. In both tasks, we achieved high accuracies. ",
    "url": "https://arxiv.org/abs/2404.19025",
    "authors": [
      "Iftakhar Ahmad",
      "Lannan Luo"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.19038",
    "title": "Embedded Representation Learning Network for Animating Styled Video  Portrait",
    "abstract": "The talking head generation recently attracted considerable attention due to its widespread application prospects, especially for digital avatars and 3D animation design. Inspired by this practical demand, several works explored Neural Radiance Fields (NeRF) to synthesize the talking heads. However, these methods based on NeRF face two challenges: (1) Difficulty in generating style-controllable talking heads. (2) Displacement artifacts around the neck in rendered images. To overcome these two challenges, we propose a novel generative paradigm \\textit{Embedded Representation Learning Network} (ERLNet) with two learning stages. First, the \\textit{ audio-driven FLAME} (ADF) module is constructed to produce facial expression and head pose sequences synchronized with content audio and style video. Second, given the sequence deduced by the ADF, one novel \\textit{dual-branch fusion NeRF} (DBF-NeRF) explores these contents to render the final images. Extensive empirical studies demonstrate that the collaboration of these two stages effectively facilitates our method to render a more realistic talking head than the existing algorithms. ",
    "url": "https://arxiv.org/abs/2404.19038",
    "authors": [
      "Tianyong Wang",
      "Xiangyu Liang",
      "Wangguandong Zheng",
      "Dan Niu",
      "Haifeng Xia",
      "Siyu Xia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.19052",
    "title": "Exploring Weighted Property Approaches for RDF Graph Similarity Measure",
    "abstract": "Measuring similarity between RDF graphs is essential for various applications, including knowledge discovery, semantic web analysis, and recommender systems. However, traditional similarity measures often treat all properties equally, potentially overlooking the varying importance of different properties in different contexts. Consequently, exploring weighted property approaches for RDF graph similarity measure presents an intriguing avenue for investigation. Therefore, in this paper, we propose a weighted property approach for RDF graph similarity measure to address this limitation. Our approach incorporates the relative importance of properties into the similarity calculation, enabling a more nuanced and context-aware measures of similarity. We evaluate our approach through a comprehensive experimental study on an RDF graph dataset in the vehicle domain. Our results demonstrate that the proposed approach achieves promising accuracy and effectively reflects the perceived similarity between RDF graphs. ",
    "url": "https://arxiv.org/abs/2404.19052",
    "authors": [
      "Ngoc Luyen Le",
      "Marie-Hélène Abel",
      "Philippe Gouspillou"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2404.19095",
    "title": "Catalyzing Social Interactions in Mixed Reality using ML Recommendation  Systems",
    "abstract": "We create an innovative mixed reality-first social recommendation model, utilizing features uniquely collected through mixed reality (MR) systems to promote social interaction, such as gaze recognition, proximity, noise level, congestion level, and conversational intensity. We further extend these models to include right-time features to deliver timely notifications. We measure performance metrics across various models by creating a new intersection of user features, MR features, and right-time features. We create four model types trained on different combinations of the feature classes, where we compare the baseline model trained on the class of user features against the models trained on MR features, right-time features, and a combination of all of the feature classes. Due to limitations in data collection and cost, we observe performance degradation in the right-time, mixed reality, and combination models. Despite these challenges, we introduce optimizations to improve accuracy across all models by over 14 percentage points, where the best performing model achieved 24% greater accuracy. ",
    "url": "https://arxiv.org/abs/2404.19095",
    "authors": [
      "Sparsh Srivastava",
      "Rohan Arora"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2404.19096",
    "title": "Data-Driven Min-Max MPC for Linear Systems: Robustness and Adaptation",
    "abstract": "Data-driven controllers design is an important research problem, in particular when data is corrupted by the noise. In this paper, we propose a data-driven min-max model predictive control (MPC) scheme using noisy input-state data for unknown linear time-invariant (LTI) system. The unknown system matrices are characterized by a set-membership representation using the noisy input-state data. Leveraging this representation, we derive an upper bound on the worst-case cost and determine the corresponding optimal state-feedback control law through a semidefinite program (SDP). We prove that the resulting closed-loop system is robustly stabilized and satisfies the input and state constraints. Further, we propose an adaptive data-driven min-max MPC scheme which exploits additional online input-state data to improve closed-loop performance. Numerical examples show the effectiveness of the proposed methods. ",
    "url": "https://arxiv.org/abs/2404.19096",
    "authors": [
      "Yifan Xie",
      "Julian Berberich",
      "Frank Allgöwer"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2404.19108",
    "title": "Real-Time Convolutional Neural Network-Based Star Detection and  Centroiding Method for CubeSat Star Tracker",
    "abstract": "Star trackers are one of the most accurate celestial sensors used for absolute attitude determination. The devices detect stars in captured images and accurately compute their projected centroids on an imaging focal plane with subpixel precision. Traditional algorithms for star detection and centroiding often rely on threshold adjustments for star pixel detection and pixel brightness weighting for centroid computation. However, challenges like high sensor noise and stray light can compromise algorithm performance. This article introduces a Convolutional Neural Network (CNN)-based approach for star detection and centroiding, tailored to address the issues posed by noisy star tracker images in the presence of stray light and other artifacts. Trained using simulated star images overlayed with real sensor noise and stray light, the CNN produces both a binary segmentation map distinguishing star pixels from the background and a distance map indicating each pixel's proximity to the nearest star centroid. Leveraging this distance information alongside pixel coordinates transforms centroid calculations into a set of trilateration problems solvable via the least squares method. Our method employs efficient UNet variants for the underlying CNN architectures, and the variants' performances are evaluated. Comprehensive testing has been undertaken with synthetic image evaluations, hardware-in-the-loop assessments, and night sky tests. The tests consistently demonstrated that our method outperforms several existing algorithms in centroiding accuracy and exhibits superior resilience to high sensor noise and stray light interference. An additional benefit of our algorithms is that they can be executed in real-time on low-power edge AI processors. ",
    "url": "https://arxiv.org/abs/2404.19108",
    "authors": [
      "Hongrui Zhao",
      "Michael F. Lembeck",
      "Adrian Zhuang",
      "Riya Shah",
      "Jesse Wei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2404.19109",
    "title": "The Shape of Money Laundering: Subgraph Representation Learning on the  Blockchain with the Elliptic2 Dataset",
    "abstract": "Subgraph representation learning is a technique for analyzing local structures (or shapes) within complex networks. Enabled by recent developments in scalable Graph Neural Networks (GNNs), this approach encodes relational information at a subgroup level (multiple connected nodes) rather than at a node level of abstraction. We posit that certain domain applications, such as anti-money laundering (AML), are inherently subgraph problems and mainstream graph techniques have been operating at a suboptimal level of abstraction. This is due in part to the scarcity of annotated datasets of real-world size and complexity, as well as the lack of software tools for managing subgraph GNN workflows at scale. To enable work in fundamental algorithms as well as domain applications in AML and beyond, we introduce Elliptic2, a large graph dataset containing 122K labeled subgraphs of Bitcoin clusters within a background graph consisting of 49M node clusters and 196M edge transactions. The dataset provides subgraphs known to be linked to illicit activity for learning the set of \"shapes\" that money laundering exhibits in cryptocurrency and accurately classifying new criminal activity. Along with the dataset we share our graph techniques, software tooling, promising early experimental results, and new domain insights already gleaned from this approach. Taken together, we find immediate practical value in this approach and the potential for a new standard in anti-money laundering and forensic analytics in cryptocurrencies and other financial networks. ",
    "url": "https://arxiv.org/abs/2404.19109",
    "authors": [
      "Claudio Bellei",
      "Muhua Xu",
      "Ross Phillips",
      "Tom Robinson",
      "Mark Weber",
      "Tim Kaler",
      "Charles E. Leiserson",
      "Arvind",
      "Jie Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "General Finance (q-fin.GN)"
    ]
  },
  {
    "id": "arXiv:2404.19114",
    "title": "Enhancing IoT Security: A Novel Feature Engineering Approach for  ML-Based Intrusion Detection Systems",
    "abstract": "The integration of Internet of Things (IoT) applications in our daily lives has led to a surge in data traffic, posing significant security challenges. IoT applications using cloud and edge computing are at higher risk of cyberattacks because of the expanded attack surface from distributed edge and cloud services, the vulnerability of IoT devices, and challenges in managing security across interconnected systems leading to oversights. This led to the rise of ML-based solutions for intrusion detection systems (IDSs), which have proven effective in enhancing network security and defending against diverse threats. However, ML-based IDS in IoT systems encounters challenges, particularly from noisy, redundant, and irrelevant features in varied IoT datasets, potentially impacting its performance. Therefore, reducing such features becomes crucial to enhance system performance and minimize computational costs. This paper focuses on improving the effectiveness of ML-based IDS at the edge level by introducing a novel method to find a balanced trade-off between cost and accuracy through the creation of informative features in a two-tier edge-user IoT environment. A hybrid Binary Quantum-inspired Artificial Bee Colony and Genetic Programming algorithm is utilized for this purpose. Three IoT intrusion detection datasets, namely NSL-KDD, UNSW-NB15, and BoT-IoT, are used for the evaluation of the proposed approach. ",
    "url": "https://arxiv.org/abs/2404.19114",
    "authors": [
      "Afsaneh Mahanipour",
      "Hana Khamfroush"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2404.19117",
    "title": "Coexistence of eMBB+ and mMTC+ in Uplink Cell-Free Massive MIMO Networks",
    "abstract": "This paper tackles the problem of designing proper uplink multiple access (MA) schemes for coexistence between enhanced mobile broadband+ (eMBB+) users and massive machine-type communications+ (mMTC+) devices in a terminal-centric cell-free massive MIMO system. Specifically, the use of a time-frequency spreading technique for the mMTC+ devices has been proposed. Coupled with the assumption of imperfect channel knowledge, closed-form bounds of the achievable (ergodic) rate for the two types of data services are derived. Using suitable power control mechanisms, we show it is possible to efficiently multiplex eMBB+ and mMTC+ traffic in the same time-frequency resource grid. Numerical experiments reveal interesting trade-offs in the selection of the spreading gain and the number of serving access points within the system. Results also demonstrate that the performance of the mMTC+ devices is slightly affected by the presence of the eMBB+ users. Overall, our approach can endow good quality of service to both 6G cornerstones at once. ",
    "url": "https://arxiv.org/abs/2404.19117",
    "authors": [
      "Sergi Liesegang",
      "Stefano Buzzi"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2404.19126",
    "title": "Compositional Factorization of Visual Scenes with Convolutional Sparse  Coding and Resonator Networks",
    "abstract": "We propose a system for visual scene analysis and recognition based on encoding the sparse, latent feature-representation of an image into a high-dimensional vector that is subsequently factorized to parse scene content. The sparse feature representation is learned from image statistics via convolutional sparse coding, while scene parsing is performed by a resonator network. The integration of sparse coding with the resonator network increases the capacity of distributed representations and reduces collisions in the combinatorial search space during factorization. We find that for this problem the resonator network is capable of fast and accurate vector factorization, and we develop a confidence-based metric that assists in tracking the convergence of the resonator network. ",
    "url": "https://arxiv.org/abs/2404.19126",
    "authors": [
      "Christopher J. Kymn",
      "Sonia Mazelet",
      "Annabel Ng",
      "Denis Kleyko",
      "Bruno A. Olshausen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2404.19130",
    "title": "SpherE: Expressive and Interpretable Knowledge Graph Embedding for Set  Retrieval",
    "abstract": "Knowledge graphs (KGs), which store an extensive number of relational facts (head, relation, tail), serve various applications. While many downstream tasks highly rely on the expressive modeling and predictive embedding of KGs, most of the current KG representation learning methods, where each entity is embedded as a vector in the Euclidean space and each relation is embedded as a transformation, follow an entity ranking protocol. On one hand, such an embedding design cannot capture many-to-many relations. On the other hand, in many retrieval cases, the users wish to get an exact set of answers without any ranking, especially when the results are expected to be precise, e.g., which genes cause an illness. Such scenarios are commonly referred to as \"set retrieval\". This work presents a pioneering study on the KG set retrieval problem. We show that the set retrieval highly depends on expressive modeling of many-to-many relations, and propose a new KG embedding model SpherE to address this problem. SpherE is based on rotational embedding methods, but each entity is embedded as a sphere instead of a vector. While inheriting the high interpretability of rotational-based models, our SpherE can more expressively model one-to-many, many-to-one, and many-to-many relations. Through extensive experiments, we show that our SpherE can well address the set retrieval problem while still having a good predictive ability to infer missing facts. The code is available at https://github.com/Violet24K/SpherE. ",
    "url": "https://arxiv.org/abs/2404.19130",
    "authors": [
      "Zihao Li",
      "Yuyi Ao",
      "Jingrui He"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19139",
    "title": "HMTRace: Hardware-Assisted Memory-Tagging based Dynamic Data Race  Detection",
    "abstract": "Data race, a category of insidious software concurrency bugs, is often challenging and resource-intensive to detect and debug. Existing dynamic race detection tools incur significant execution time and memory overhead while exhibiting high false positives. This paper proposes HMTRace, a novel Armv8.5-A memory tag extension (MTE) based dynamic data race detection framework, emphasizing low compute and memory requirements while maintaining high accuracy and precision. HMTRace supports race detection in userspace OpenMP- and Pthread-based multi-threaded C applications. HMTRace showcases a combined f1-score of 0.86 while incurring a mean execution time overhead of 4.01% and peak memory (RSS) overhead of 54.31%. HMTRace also does not report false positives, asserting all reported races. ",
    "url": "https://arxiv.org/abs/2404.19139",
    "authors": [
      "Jaidev Shastri",
      "Xiaoguang Wang",
      "Basavesh Ammanaghatta Shivakumar",
      "Freek Verbeek",
      "Binoy Ravindran"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2404.19146",
    "title": "Automated Construction of Theme-specific Knowledge Graphs",
    "abstract": "Despite widespread applications of knowledge graphs (KGs) in various tasks such as question answering and intelligent conversational systems, existing KGs face two major challenges: information granularity and deficiency in timeliness. These hinder considerably the retrieval and analysis of in-context, fine-grained, and up-to-date knowledge from KGs, particularly in highly specialized themes (e.g., specialized scientific research) and rapidly evolving contexts (e.g., breaking news or disaster tracking). To tackle such challenges, we propose a theme-specific knowledge graph (i.e., ThemeKG), a KG constructed from a theme-specific corpus, and design an unsupervised framework for ThemeKG construction (named TKGCon). The framework takes raw theme-specific corpus and generates a high-quality KG that includes salient entities and relations under the theme. Specifically, we start with an entity ontology of the theme from Wikipedia, based on which we then generate candidate relations by Large Language Models (LLMs) to construct a relation ontology. To parse the documents from the theme corpus, we first map the extracted entity pairs to the ontology and retrieve the candidate relations. Finally, we incorporate the context and ontology to consolidate the relations for entity pairs. We observe that directly prompting GPT-4 for theme-specific KG leads to inaccurate entities (such as \"two main types\" as one entity in the query result) and unclear (such as \"is\", \"has\") or wrong relations (such as \"have due to\", \"to start\"). In contrast, by constructing the theme-specific KG step by step, our model outperforms GPT-4 and could consistently identify accurate entities and relations. Experimental results also show that our framework excels in evaluations compared with various KG construction baselines. ",
    "url": "https://arxiv.org/abs/2404.19146",
    "authors": [
      "Linyi Ding",
      "Sizhe Zhou",
      "Jinfeng Xiao",
      "Jiawei Han"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2404.19148",
    "title": "Enhancing Brazilian Sign Language Recognition through Skeleton Image  Representation",
    "abstract": "Effective communication is paramount for the inclusion of deaf individuals in society. However, persistent communication barriers due to limited Sign Language (SL) knowledge hinder their full participation. In this context, Sign Language Recognition (SLR) systems have been developed to improve communication between signing and non-signing individuals. In particular, there is the problem of recognizing isolated signs (Isolated Sign Language Recognition, ISLR) of great relevance in the development of vision-based SL search engines, learning tools, and translation systems. This work proposes an ISLR approach where body, hands, and facial landmarks are extracted throughout time and encoded as 2-D images. These images are processed by a convolutional neural network, which maps the visual-temporal information into a sign label. Experimental results demonstrate that our method surpassed the state-of-the-art in terms of performance metrics on two widely recognized datasets in Brazilian Sign Language (LIBRAS), the primary focus of this study. In addition to being more accurate, our method is more time-efficient and easier to train due to its reliance on a simpler network architecture and solely RGB data as input. ",
    "url": "https://arxiv.org/abs/2404.19148",
    "authors": [
      "Carlos Eduardo G. R. Alves",
      "Francisco de Assis Boldt",
      "Thiago M. Paixão"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19164",
    "title": "Optimal Bridge, Twin Bridges and Beyond: Inserting Edges into a Road  Network to Minimize the Constrained Diameters",
    "abstract": "Given a road network modelled as a planar straight-line graph $G=(V,E)$ with $|V|=n$, let $(u,v)\\in V\\times V$, the shortest path (distance) between $u,v$ is denoted as $\\delta_G(u,v)$. Let $\\delta(G)=\\max_{(u,v)}\\delta_G(u,v)$, for $(u,v)\\in V\\times V$, which is called the diameter of $G$. Given a disconnected road network modelled as two disjoint trees $T_1$ and $T_2$, this paper first aims at inserting one and two edges (bridges) between them to minimize the (constrained) diameter $\\delta(T_1\\cup T_2\\cup I_j)$ going through the inserted edges, where $I_j, j=1,2$, is the set of inserted edges with $|I_1|=1$ and $|I_2|=2$. The corresponding problems are called the {\\em optimal bridge} and {\\em twin bridges} problems. Since when more than one edge are inserted between two trees the resulting graph is becoming more complex, for the general network $G$ we consider the problem of inserting a minimum of $k$ edges such that the shortest distances between a set of $m$ pairs $P=\\{(u_i,v_i)\\mid u_i,v_i\\in V, i\\in [m]\\}$, $\\delta_G(u_i,v_i)$'s, are all decreased. The main results of this paper are summarized as follows: (1) We show that the optimal bridge problem can be solved in $O(n^2)$ time and that a variation of it has a near-quadratic lower bound unless SETH fails. The proof also implies that the famous 3-SUM problem does have a near-quadratic lower bound for large integers, e.g., each of the $n$ input integers has $\\Omega(\\log n)$ decimal digits. We then give a simple factor-2 $O(n\\log n)$ time approximation algorithm for the optimal bridge problem. (2) We present an $O(n^4)$ time algorithm to solve the twin bridges problem, exploiting some new property not in the optimal bridge problem. (3) For the general problem of inserting $k$ edges to reduce the (graph) distances between $m$ given pairs, we show that the problem is NP-complete. ",
    "url": "https://arxiv.org/abs/2404.19164",
    "authors": [
      "Zhidan Feng",
      "Henning Fernau",
      "Binhai Zhu"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2404.19165",
    "title": "DelGrad: Exact gradients in spiking networks for learning transmission  delays and weights",
    "abstract": "Spiking neural networks (SNNs) inherently rely on the timing of signals for representing and processing information. Transmission delays play an important role in shaping these temporal characteristics. Recent work has demonstrated the substantial advantages of learning these delays along with synaptic weights, both in terms of accuracy and memory efficiency. However, these approaches suffer from drawbacks in terms of precision and efficiency, as they operate in discrete time and with approximate gradients, while also requiring membrane potential recordings for calculating parameter updates. To alleviate these issues, we propose an analytical approach for calculating exact loss gradients with respect to both synaptic weights and delays in an event-based fashion. The inclusion of delays emerges naturally within our proposed formalism, enriching the model's search space with a temporal dimension. Our algorithm is purely based on the timing of individual spikes and does not require access to other variables such as membrane potentials. We explicitly compare the impact on accuracy and parameter efficiency of different types of delays - axonal, dendritic and synaptic. Furthermore, while previous work on learnable delays in SNNs has been mostly confined to software simulations, we demonstrate the functionality and benefits of our approach on the BrainScaleS-2 neuromorphic platform. ",
    "url": "https://arxiv.org/abs/2404.19165",
    "authors": [
      "Julian Göltz",
      "Jimmy Weber",
      "Laura Kriener",
      "Peter Lake",
      "Melika Payvand",
      "Mihai A. Petrovici"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19168",
    "title": "PEVA-Net: Prompt-Enhanced View Aggregation Network for Zero/Few-Shot  Multi-View 3D Shape Recognition",
    "abstract": "Large vision-language models have impressively promote the performance of 2D visual recognition under zero/few-shot scenarios. In this paper, we focus on exploiting the large vision-language model, i.e., CLIP, to address zero/few-shot 3D shape recognition based on multi-view representations. The key challenge for both tasks is to generate a discriminative descriptor of the 3D shape represented by multiple view images under the scenarios of either without explicit training (zero-shot 3D shape recognition) or training with a limited number of data (few-shot 3D shape recognition). We analyze that both tasks are relevant and can be considered simultaneously. Specifically, leveraging the descriptor which is effective for zero-shot inference to guide the tuning of the aggregated descriptor under the few-shot training can significantly improve the few-shot learning efficacy. Hence, we propose Prompt-Enhanced View Aggregation Network (PEVA-Net) to simultaneously address zero/few-shot 3D shape recognition. Under the zero-shot scenario, we propose to leverage the prompts built up from candidate categories to enhance the aggregation process of multiple view-associated visual features. The resulting aggregated feature serves for effective zero-shot recognition of the 3D shapes. Under the few-shot scenario, we first exploit a transformer encoder to aggregate the view-associated visual features into a global descriptor. To tune the encoder, together with the main classification loss, we propose a self-distillation scheme via a feature distillation loss by treating the zero-shot descriptor as the guidance signal for the few-shot descriptor. This scheme can significantly enhance the few-shot learning efficacy. ",
    "url": "https://arxiv.org/abs/2404.19168",
    "authors": [
      "Dongyun Lin",
      "Yi Cheng",
      "Shangbo Mao",
      "Aiyuan Guo",
      "Yiqun Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19171",
    "title": "Explicit Correlation Learning for Generalizable Cross-Modal Deepfake  Detection",
    "abstract": "With the rising prevalence of deepfakes, there is a growing interest in developing generalizable detection methods for various types of deepfakes. While effective in their specific modalities, traditional detection methods fall short in addressing the generalizability of detection across diverse cross-modal deepfakes. This paper aims to explicitly learn potential cross-modal correlation to enhance deepfake detection towards various generation scenarios. Our approach introduces a correlation distillation task, which models the inherent cross-modal correlation based on content information. This strategy helps to prevent the model from overfitting merely to audio-visual synchronization. Additionally, we present the Cross-Modal Deepfake Dataset (CMDFD), a comprehensive dataset with four generation methods to evaluate the detection of diverse cross-modal deepfakes. The experimental results on CMDFD and FakeAVCeleb datasets demonstrate the superior generalizability of our method over existing state-of-the-art methods. Our code and data can be found at \\url{https://github.com/ljj898/CMDFD-Dataset-and-Deepfake-Detection}. ",
    "url": "https://arxiv.org/abs/2404.19171",
    "authors": [
      "Cai Yu",
      "Shan Jia",
      "Xiaomeng Fu",
      "Jin Liu",
      "Jiahe Tian",
      "Jiao Dai",
      "Xi Wang",
      "Siwei Lyu",
      "Jizhong Han"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.19173",
    "title": "Revisiting Reward Design and Evaluation for Robust Humanoid Standing and  Walking",
    "abstract": "A necessary capability for humanoid robots is the ability to stand and walk while rejecting natural disturbances. Recent progress has been made using sim-to-real reinforcement learning (RL) to train such locomotion controllers, with approaches differing mainly in their reward functions. However, prior works lack a clear method to systematically test new reward functions and compare controller performance through repeatable experiments. This limits our understanding of the trade-offs between approaches and hinders progress. To address this, we propose a low-cost, quantitative benchmarking method to evaluate and compare the real-world performance of standing and walking (SaW) controllers on metrics like command following, disturbance recovery, and energy efficiency. We also revisit reward function design and construct a minimally constraining reward function to train SaW controllers. We experimentally verify that our benchmarking framework can identify areas for improvement, which can be systematically addressed to enhance the policies. We also compare our new controller to state-of-the-art controllers on the Digit humanoid robot. The results provide clear quantitative trade-offs among the controllers and suggest directions for future improvements to the reward functions and expansion of the benchmarks. ",
    "url": "https://arxiv.org/abs/2404.19173",
    "authors": [
      "Bart van Marum",
      "Aayam Shrestha",
      "Helei Duan",
      "Pranay Dugar",
      "Jeremy Dao",
      "Alan Fern"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2404.19214",
    "title": "EfficientASR: Speech Recognition Network Compression via Attention  Redundancy and Chunk-Level FFN Optimization",
    "abstract": "In recent years, Transformer networks have shown remarkable performance in speech recognition tasks. However, their deployment poses challenges due to high computational and storage resource requirements. To address this issue, a lightweight model called EfficientASR is proposed in this paper, aiming to enhance the versatility of Transformer models. EfficientASR employs two primary modules: Shared Residual Multi-Head Attention (SRMHA) and Chunk-Level Feedforward Networks (CFFN). The SRMHA module effectively reduces redundant computations in the network, while the CFFN module captures spatial knowledge and reduces the number of parameters. The effectiveness of the EfficientASR model is validated on two public datasets, namely Aishell-1 and HKUST. Experimental results demonstrate a 36% reduction in parameters compared to the baseline Transformer network, along with improvements of 0.3% and 0.2% in Character Error Rate (CER) on the Aishell-1 and HKUST datasets, respectively. ",
    "url": "https://arxiv.org/abs/2404.19214",
    "authors": [
      "Jianzong Wang",
      "Ziqi Liang",
      "Xulong Zhang",
      "Ning Cheng",
      "Jing Xiao"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2404.19218",
    "title": "Flight Trajectory Prediction Using an Enhanced CNN-LSTM Network",
    "abstract": "Aiming at the problem of low accuracy of flight trajectory prediction caused by the high speed of fighters, the diversity of tactical maneuvers, and the transient nature of situational change in close range air combat, this paper proposes an enhanced CNN-LSTM network as a fighter flight trajectory prediction method. Firstly, we extract spatial features from fighter trajectory data using CNN, aggregate spatial features of multiple fighters using the social-pooling module to capture geographic information and positional relationships in the trajectories, and use the attention mechanism to capture mutated trajectory features in air combat; subsequently, we extract temporal features by using the memory nature of LSTM to capture long-term temporal dependence in the trajectories; and finally, we merge the temporal and spatial features to predict the flight trajectories of enemy fighters. Extensive simulation experiments verify that the proposed method improves the trajectory prediction accuracy compared to the original CNN-LSTM method, with the improvements of 32% and 34% in ADE and FDE indicators. ",
    "url": "https://arxiv.org/abs/2404.19218",
    "authors": [
      "Qinzhi Hao",
      "Jiali Zhang",
      "Tengyu Jing",
      "Wei Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19227",
    "title": "Espresso: Robust Concept Filtering in Text-to-Image Models",
    "abstract": "Diffusion-based text-to-image (T2I) models generate high-fidelity images for given textual prompts. They are trained on large datasets scraped from the Internet, potentially containing unacceptable concepts (e.g., copyright infringing or unsafe). Retraining T2I models after filtering out unacceptable concepts in the training data is inefficient and degrades utility. Hence, there is a need for concept removal techniques (CRTs) which are effective in removing unacceptable concepts, utility-preserving on acceptable concepts, and robust against evasion with adversarial prompts. None of the prior filtering and fine-tuning CRTs satisfy all these requirements simultaneously. We introduce Espresso, the first robust concept filter based on Contrastive Language-Image Pre-Training (CLIP). It identifies unacceptable concepts by projecting the generated image's embedding onto the vector connecting unacceptable and acceptable concepts in the joint text-image embedding space. This ensures robustness by restricting the adversary to adding noise only along this vector, in the direction of the acceptable concept. Further fine-tuning Espresso to separate embeddings of acceptable and unacceptable concepts, while preserving their pairing with image embeddings, ensures both effectiveness and utility. We evaluate Espresso on eleven concepts to show that it is effective (~5% CLIP accuracy on unacceptable concepts), utility-preserving (~93% normalized CLIP score on acceptable concepts), and robust (~4% CLIP accuracy on adversarial prompts for unacceptable concepts). Finally, we present theoretical bounds for the certified robustness of Espresso against adversarial prompts, and an empirical analysis. ",
    "url": "https://arxiv.org/abs/2404.19227",
    "authors": [
      "Anudeep Das",
      "Vasisht Duddu",
      "Rui Zhang",
      "N. Asokan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.19234",
    "title": "Multi-hop Question Answering over Knowledge Graphs using Large Language  Models",
    "abstract": "Knowledge graphs (KGs) are large datasets with specific structures representing large knowledge bases (KB) where each node represents a key entity and relations amongst them are typed edges. Natural language queries formed to extract information from a KB entail starting from specific nodes and reasoning over multiple edges of the corresponding KG to arrive at the correct set of answer nodes. Traditional approaches of question answering on KG are based on (a) semantic parsing (SP), where a logical form (e.g., S-expression, SPARQL query, etc.) is generated using node and edge embeddings and then reasoning over these representations or tuning language models to generate the final answer directly, or (b) information-retrieval based that works by extracting entities and relations sequentially. In this work, we evaluate the capability of (LLMs) to answer questions over KG that involve multiple hops. We show that depending upon the size and nature of the KG we need different approaches to extract and feed the relevant information to an LLM since every LLM comes with a fixed context window. We evaluate our approach on six KGs with and without the availability of example-specific sub-graphs and show that both the IR and SP-based methods can be adopted by LLMs resulting in an extremely competitive performance. ",
    "url": "https://arxiv.org/abs/2404.19234",
    "authors": [
      "Abir Chakraborty"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2404.19243",
    "title": "Co-occurrence order-preserving pattern mining",
    "abstract": "Recently, order-preserving pattern (OPP) mining has been proposed to discover some patterns, which can be seen as trend changes in time series. Although existing OPP mining algorithms have achieved satisfactory performance, they discover all frequent patterns. However, in some cases, users focus on a particular trend and its associated trends. To efficiently discover trend information related to a specific prefix pattern, this paper addresses the issue of co-occurrence OPP mining (COP) and proposes an algorithm named COP-Miner to discover COPs from historical time series. COP-Miner consists of three parts: extracting keypoints, preparation stage, and iteratively calculating supports and mining frequent COPs. Extracting keypoints is used to obtain local extreme points of patterns and time series. The preparation stage is designed to prepare for the first round of mining, which contains four steps: obtaining the suffix OPP of the keypoint sub-time series, calculating the occurrences of the suffix OPP, verifying the occurrences of the keypoint sub-time series, and calculating the occurrences of all fusion patterns of the keypoint sub-time series. To further improve the efficiency of support calculation, we propose a support calculation method with an ending strategy that uses the occurrences of prefix and suffix patterns to calculate the occurrences of superpatterns. Experimental results indicate that COP-Miner outperforms the other competing algorithms in running time and scalability. Moreover, COPs with keypoint alignment yield better prediction performance. ",
    "url": "https://arxiv.org/abs/2404.19243",
    "authors": [
      "Youxi Wu",
      "Zhen Wang",
      "Yan Li",
      "Yingchun Guo",
      "He Jiang",
      "Xingquan Zhu",
      "Xindong Wu"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2404.19252",
    "title": "Exploiting Hatred by Targets for Hate Speech Detection on Vietnamese  Social Media Texts",
    "abstract": "The growth of social networks makes toxic content spread rapidly. Hate speech detection is a task to help decrease the number of harmful comments. With the diversity in the hate speech created by users, it is necessary to interpret the hate speech besides detecting it. Hence, we propose a methodology to construct a system for targeted hate speech detection from online streaming texts from social media. We first introduce the ViTHSD - a targeted hate speech detection dataset for Vietnamese Social Media Texts. The dataset contains 10K comments, each comment is labeled to specific targets with three levels: clean, offensive, and hate. There are 5 targets in the dataset, and each target is labeled with the corresponding level manually by humans with strict annotation guidelines. The inter-annotator agreement obtained from the dataset is 0.45 by Cohen's Kappa index, which is indicated as a moderate level. Then, we construct a baseline for this task by combining the Bi-GRU-LSTM-CNN with the pre-trained language model to leverage the power of text representation of BERTology. Finally, we suggest a methodology to integrate the baseline model for targeted hate speech detection into the online streaming system for practical application in preventing hateful and offensive content on social media. ",
    "url": "https://arxiv.org/abs/2404.19252",
    "authors": [
      "Cuong Nhat Vo",
      "Khanh Bao Huynh",
      "Son T. Luu",
      "Trong-Hop Do"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.19257",
    "title": "Persistent Homology generalizations for Social Media Network Analysis",
    "abstract": "This study details an approach for the analysis of social media collected political data through the lens of Topological Data Analysis, with a specific focus on Persistent Homology and the political processes they represent by proposing a set of mathematical generalizations using Gaussian functions to define and analyze these Persistent Homology categories. Three distinct types of Persistent Homologies were recurrent across datasets that had been plotted through retweeting patterns and analyzed through the k-Nearest-Neighbor filtrations. As these Persistent Homologies continued to appear, they were then categorized and dubbed Nuclear, Bipolar, and Multipolar Constellations. Upon investigating the content of these plotted tweets, specific patterns of interaction and political information dissemination were identified, namely Political Personalism and Political Polarization. Through clustering and application of Gaussian density functions, I have mathematically characterized each category, encapsulating their distinctive topological features. The mathematical generalizations of Bipolar, Nuclear, and Multipolar Constellations developed in this study are designed to inspire other political science digital media researchers to utilize these categories as to identify Persistent Homology in datasets derived from various social media platforms, suggesting the broader hypothesis that such structures are bound to be present on political scraped data regardless of the social media it's derived from. This method aims to offer a new perspective in Network Analysis as it allows for an exploration of the underlying shape of the networks formed by retweeting patterns, enhancing the understanding of digital interactions within the sphere of Computational Social Sciences. ",
    "url": "https://arxiv.org/abs/2404.19257",
    "authors": [
      "Isabela Rocha"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Computational Geometry (cs.CG)",
      "Data Structures and Algorithms (cs.DS)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2404.19260",
    "title": "Aspect and Opinion Term Extraction Using Graph Attention Network",
    "abstract": "In this work we investigate the capability of Graph Attention Network for extracting aspect and opinion terms. Aspect and opinion term extraction is posed as a token-level classification task akin to named entity recognition. We use the dependency tree of the input query as additional feature in a Graph Attention Network along with the token and part-of-speech features. We show that the dependency structure is a powerful feature that in the presence of a CRF layer substantially improves the performance and generates the best result on the commonly used datasets from SemEval 2014, 2015 and 2016. We experiment with additional layers like BiLSTM and Transformer in addition to the CRF layer. We also show that our approach works well in the presence of multiple aspects or sentiments in the same query and it is not necessary to modify the dependency tree based on a single aspect as was the original application for sentiment classification. ",
    "url": "https://arxiv.org/abs/2404.19260",
    "authors": [
      "Abir Chakraborty"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.19276",
    "title": "C2FDrone: Coarse-to-Fine Drone-to-Drone Detection using Vision  Transformer Networks",
    "abstract": "A vision-based drone-to-drone detection system is crucial for various applications like collision avoidance, countering hostile drones, and search-and-rescue operations. However, detecting drones presents unique challenges, including small object sizes, distortion, occlusion, and real-time processing requirements. Current methods integrating multi-scale feature fusion and temporal information have limitations in handling extreme blur and minuscule objects. To address this, we propose a novel coarse-to-fine detection strategy based on vision transformers. We evaluate our approach on three challenging drone-to-drone detection datasets, achieving F1 score enhancements of 7%, 3%, and 1% on the FL-Drones, AOT, and NPS-Drones datasets, respectively. Additionally, we demonstrate real-time processing capabilities by deploying our model on an edge-computing device. Our code will be made publicly available. ",
    "url": "https://arxiv.org/abs/2404.19276",
    "authors": [
      "Sairam VC Rebbapragada",
      "Pranoy Panda",
      "Vineeth N Balasubramanian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19281",
    "title": "Audio-Visual Traffic Light State Detection for Urban Robots",
    "abstract": "We present a multimodal traffic light state detection using vision and sound, from the viewpoint of a quadruped robot navigating in urban settings. This is a challenging problem because of the visual occlusions and noise from robot locomotion. Our method combines features from raw audio with the ratios of red and green pixels within bounding boxes, identified by established vision-based detectors. The fusion method aggregates features across multiple frames in a given timeframe, increasing robustness and adaptability. Results show that our approach effectively addresses the challenge of visual occlusion and surpasses the performance of single-modality solutions when the robot is in motion. This study serves as a proof of concept, highlighting the significant, yet often overlooked, potential of multi-modal perception in robotics. ",
    "url": "https://arxiv.org/abs/2404.19281",
    "authors": [
      "Sagar Gupta",
      "Akansel Cosgun"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2404.19283",
    "title": "MAP-Former: Multi-Agent-Pair Gaussian Joint Prediction",
    "abstract": "There is a gap in risk assessment of trajectories between the trajectory information coming from a traffic motion prediction module and what is actually needed. Closing this gap necessitates advancements in prediction beyond current practices. Existing prediction models yield joint predictions of agents' future trajectories with uncertainty weights or marginal Gaussian probability density functions (PDFs) for single agents. Although, these methods achieve high accurate trajectory predictions, they only provide little or no information about the dependencies of interacting agents. Since traffic is a process of highly interdependent agents, whose actions directly influence their mutual behavior, the existing methods are not sufficient to reliably assess the risk of future trajectories. This paper addresses that gap by introducing a novel approach to motion prediction, focusing on predicting agent-pair covariance matrices in a ``scene-centric'' manner, which can then be used to model Gaussian joint PDFs for all agent-pairs in a scene. We propose a model capable of predicting those agent-pair covariance matrices, leveraging an enhanced awareness of interactions. Utilizing the prediction results of our model, this work forms the foundation for comprehensive risk assessment with statistically based methods for analyzing agents' relations by their joint PDFs. ",
    "url": "https://arxiv.org/abs/2404.19283",
    "authors": [
      "Marlon Steiner",
      "Marvin Klemp",
      "Christoph Stiller"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19287",
    "title": "Revisiting the Adversarial Robustness of Vision Language Models: a  Multimodal Perspective",
    "abstract": "Pretrained vision-language models (VLMs) like CLIP have shown impressive generalization performance across various downstream tasks, yet they remain vulnerable to adversarial attacks. While prior research has primarily concentrated on improving the adversarial robustness of image encoders to guard against attacks on images, the exploration of text-based and multimodal attacks has largely been overlooked. In this work, we initiate the first known and comprehensive effort to study adapting vision-language models for adversarial robustness under the multimodal attack. Firstly, we introduce a multimodal attack strategy and investigate the impact of different attacks. We then propose a multimodal contrastive adversarial training loss, aligning the clean and adversarial text embeddings with the adversarial and clean visual features, to enhance the adversarial robustness of both image and text encoders of CLIP. Extensive experiments on 15 datasets across two tasks demonstrate that our method significantly improves the adversarial robustness of CLIP. Interestingly, we find that the model fine-tuned against multimodal adversarial attacks exhibits greater robustness than its counterpart fine-tuned solely against image-based attacks, even in the context of image attacks, which may open up new possibilities for enhancing the security of VLMs. ",
    "url": "https://arxiv.org/abs/2404.19287",
    "authors": [
      "Wanqi Zhou",
      "Shuanghao Bai",
      "Qibin Zhao",
      "Badong Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19288",
    "title": "Training-free Graph Neural Networks and the Power of Labels as Features",
    "abstract": "We propose training-free graph neural networks (TFGNNs), which can be used without training and can also be improved with optional training, for transductive node classification. We first advocate labels as features (LaF), which is an admissible but not explored technique. We show that LaF provably enhances the expressive power of graph neural networks. We design TFGNNs based on this analysis. In the experiments, we confirm that TFGNNs outperform existing GNNs in the training-free setting and converge with much fewer training iterations than traditional GNNs. ",
    "url": "https://arxiv.org/abs/2404.19288",
    "authors": [
      "Ryoma Sato"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2404.19289",
    "title": "On Improving the Algorithm-, Model-, and Data- Efficiency of  Self-Supervised Learning",
    "abstract": "Self-supervised learning (SSL) has developed rapidly in recent years. However, most of the mainstream methods are computationally expensive and rely on two (or more) augmentations for each image to construct positive pairs. Moreover, they mainly focus on large models and large-scale datasets, which lack flexibility and feasibility in many practical applications. In this paper, we propose an efficient single-branch SSL method based on non-parametric instance discrimination, aiming to improve the algorithm, model, and data efficiency of SSL. By analyzing the gradient formula, we correct the update rule of the memory bank with improved performance. We further propose a novel self-distillation loss that minimizes the KL divergence between the probability distribution and its square root version. We show that this alleviates the infrequent updating problem in instance discrimination and greatly accelerates convergence. We systematically compare the training overhead and performance of different methods in different scales of data, and under different backbones. Experimental results show that our method outperforms various baselines with significantly less overhead, and is especially effective for limited amounts of data and small models. ",
    "url": "https://arxiv.org/abs/2404.19289",
    "authors": [
      "Yun-Hao Cao",
      "Jianxin Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19294",
    "title": "Masked Spatial Propagation Network for Sparsity-Adaptive Depth  Refinement",
    "abstract": "The main function of depth completion is to compensate for an insufficient and unpredictable number of sparse depth measurements of hardware sensors. However, existing research on depth completion assumes that the sparsity -- the number of points or LiDAR lines -- is fixed for training and testing. Hence, the completion performance drops severely when the number of sparse depths changes significantly. To address this issue, we propose the sparsity-adaptive depth refinement (SDR) framework, which refines monocular depth estimates using sparse depth points. For SDR, we propose the masked spatial propagation network (MSPN) to perform SDR with a varying number of sparse depths effectively by gradually propagating sparse depth information throughout the entire depth map. Experimental results demonstrate that MPSN achieves state-of-the-art performance on both SDR and conventional depth completion scenarios. ",
    "url": "https://arxiv.org/abs/2404.19294",
    "authors": [
      "Jinyoung Jun",
      "Jae-Han Lee",
      "Chang-Su Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19296",
    "title": "Octopus v4: Graph of language models",
    "abstract": "Language models have been effective in a wide range of applications, yet the most sophisticated models are often proprietary. For example, GPT-4 by OpenAI and various models by Anthropic are expensive and consume substantial energy. In contrast, the open-source community has produced competitive models, like Llama3. Furthermore, niche-specific smaller language models, such as those tailored for legal, medical or financial tasks, have outperformed their proprietary counterparts. This paper introduces a novel approach that employs \\textit{functional tokens} to integrate \\textbf{multiple open-source models}, each optimized for particular tasks. Our newly developed Octopus v4 model leverages \\textit{functional tokens} to intelligently direct user queries to the most appropriate vertical model and reformat the query to achieve the best performance. Octopus v4, an evolution of the Octopus v1, v2, and v3 models, excels in selection and parameter understanding and reformatting. Additionally, we explore the use of graph as a versatile data structure that effectively coordinates multiple open-source models by harnessing the capabilities of the Octopus model and \\textit{functional tokens}. Use our open-sourced GitHub (\\url{https://www.nexa4ai.com/}) to try Octopus v4 models (\\url{https://huggingface.co/NexaAIDev/Octopus-v4}), and contrite to a larger graph of language models. By activating models less than 10B parameters, we achieved SOTA MMLU score of 74.8 among the same level models. ",
    "url": "https://arxiv.org/abs/2404.19296",
    "authors": [
      "Wei Chen",
      "Zhiyuan Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.19299",
    "title": "Robust Pedestrian Detection via Constructing Versatile Pedestrian  Knowledge Bank",
    "abstract": "Pedestrian detection is a crucial field of computer vision research which can be adopted in various real-world applications (e.g., self-driving systems). However, despite noticeable evolution of pedestrian detection, pedestrian representations learned within a detection framework are usually limited to particular scene data in which they were trained. Therefore, in this paper, we propose a novel approach to construct versatile pedestrian knowledge bank containing representative pedestrian knowledge which can be applicable to various detection frameworks and adopted in diverse scenes. We extract generalized pedestrian knowledge from a large-scale pretrained model, and we curate them by quantizing most representative features and guiding them to be distinguishable from background scenes. Finally, we construct versatile pedestrian knowledge bank which is composed of such representations, and then we leverage it to complement and enhance pedestrian features within a pedestrian detection framework. Through comprehensive experiments, we validate the effectiveness of our method, demonstrating its versatility and outperforming state-of-the-art detection performances. ",
    "url": "https://arxiv.org/abs/2404.19299",
    "authors": [
      "Sungjune Park",
      "Hyunjun Kim",
      "Yong Man Ro"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19311",
    "title": "A Light-weight Transformer-based Self-supervised Matching Network for  Heterogeneous Images",
    "abstract": "Matching visible and near-infrared (NIR) images remains a significant challenge in remote sensing image fusion. The nonlinear radiometric differences between heterogeneous remote sensing images make the image matching task even more difficult. Deep learning has gained substantial attention in computer vision tasks in recent years. However, many methods rely on supervised learning and necessitate large amounts of annotated data. Nevertheless, annotated data is frequently limited in the field of remote sensing image matching. To address this challenge, this paper proposes a novel keypoint descriptor approach that obtains robust feature descriptors via a self-supervised matching network. A light-weight transformer network, termed as LTFormer, is designed to generate deep-level feature descriptors. Furthermore, we implement an innovative triplet loss function, LT Loss, to enhance the matching performance further. Our approach outperforms conventional hand-crafted local feature descriptors and proves equally competitive compared to state-of-the-art deep learning-based methods, even amidst the shortage of annotated data. ",
    "url": "https://arxiv.org/abs/2404.19311",
    "authors": [
      "Wang Zhang",
      "Tingting Li",
      "Yuntian Zhang",
      "Gensheng Pei",
      "Xiruo Jiang",
      "Yazhou Yao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2404.19314",
    "title": "Alternative paths computation for congestion mitigation in  segment-routing networks",
    "abstract": "In backbone networks, it is fundamental to quickly protect traffic against any unexpected event, such as failures or congestions, which may impact Quality of Service (QoS). Standard solutions based on Segment Routing (SR), such as Topology-Independent Loop-Free Alternate (TI-LFA), are used in practice to handle failures, but no distributed solutions exist for distributed and tactical congestion mitigation. A promising approach leveraging SR has been recently proposed to quickly steer traffic away from congested links over alternative paths. As the pre-computation of alternative paths plays a paramount role to efficiently mitigating congestions, we investigate the associated path computation problem aiming at maximizing the amount of traffic that can be rerouted as well as the resilience against any 1-link failure. In particular, we focus on two variants of this problem. First, we maximize the residual flow after all possible failures. We show that the problem is NP-Hard, and we solve it via a Benders decomposition algorithm. Then, to provide a practical and scalable solution, we solve a relaxed variant problem, that maximizes, instead of flow, the number of surviving alternative paths after all possible failures. We provide a polynomial algorithm. Through numerical experiments, we compare the two variants and show that they allow to increase the amount of rerouted traffic and the resiliency of the network after any 1-link failure. ",
    "url": "https://arxiv.org/abs/2404.19314",
    "authors": [
      "Sébastien Martin",
      "Youcef Magnouche",
      "Paolo Medagliani",
      "Jérémie Leguay"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2404.19316",
    "title": "QLSC: A Query Latent Semantic Calibrator for Robust Extractive Question  Answering",
    "abstract": "Extractive Question Answering (EQA) in Machine Reading Comprehension (MRC) often faces the challenge of dealing with semantically identical but format-variant inputs. Our work introduces a novel approach, called the ``Query Latent Semantic Calibrator (QLSC)'', designed as an auxiliary module for existing MRC models. We propose a unique scaling strategy to capture latent semantic center features of queries. These features are then seamlessly integrated into traditional query and passage embeddings using an attention mechanism. By deepening the comprehension of the semantic queries-passage relationship, our approach diminishes sensitivity to variations in text format and boosts the model's capability in pinpointing accurate answers. Experimental results on robust Question-Answer datasets confirm that our approach effectively handles format-variant but semantically identical queries, highlighting the effectiveness and adaptability of our proposed method. ",
    "url": "https://arxiv.org/abs/2404.19316",
    "authors": [
      "Sheng Ouyang",
      "Jianzong Wang",
      "Yong Zhang",
      "Zhitao Li",
      "Ziqi Liang",
      "Xulong Zhang",
      "Ning Cheng",
      "Jing Xiao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.19317",
    "title": "Revisiting N-Gram Models: Their Impact in Modern Neural Networks for  Handwritten Text Recognition",
    "abstract": "In recent advances in automatic text recognition (ATR), deep neural networks have demonstrated the ability to implicitly capture language statistics, potentially reducing the need for traditional language models. This study directly addresses whether explicit language models, specifically n-gram models, still contribute to the performance of state-of-the-art deep learning architectures in the field of handwriting recognition. We evaluate two prominent neural network architectures, PyLaia and DAN, with and without the integration of explicit n-gram language models. Our experiments on three datasets - IAM, RIMES, and NorHand v2 - at both line and page level, investigate optimal parameters for n-gram models, including their order, weight, smoothing methods and tokenization level. The results show that incorporating character or subword n-gram models significantly improves the performance of ATR models on all datasets, challenging the notion that deep learning models alone are sufficient for optimal performance. In particular, the combination of DAN with a character language model outperforms current benchmarks, confirming the value of hybrid approaches in modern document analysis systems. ",
    "url": "https://arxiv.org/abs/2404.19317",
    "authors": [
      "Solène Tarride",
      "Christopher Kermorvant"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.19318",
    "title": "Enhancing Trust in LLM-Generated Code Summaries with Calibrated  Confidence Scores",
    "abstract": "A good summary can often be very useful during program comprehension. While a brief, fluent, and relevant summary can be helpful, it does require significant human effort to produce. Often, good summaries are unavailable in software projects, thus making maintenance more difficult. There has been a considerable body of research into automated AI-based methods, using Large Language models (LLMs), to generate summaries of code; there also has been quite a bit work on ways to measure the performance of such summarization methods, with special attention paid to how closely these AI-generated summaries resemble a summary a human might have produced. Measures such as BERTScore and BLEU have been suggested and evaluated with human-subject studies. However, LLMs often err and generate something quite unlike what a human might say. Given an LLM-produced code summary, is there a way to gauge whether it's likely to be sufficiently similar to a human produced summary, or not? In this paper, we study this question, as a calibration problem: given a summary from an LLM, can we compute a confidence measure, which is a good indication of whether the summary is sufficiently similar to what a human would have produced in this situation? We examine this question using several LLMs, for several languages, and in several different settings. We suggest an approach which provides well-calibrated predictions of likelihood of similarity to human summaries. ",
    "url": "https://arxiv.org/abs/2404.19318",
    "authors": [
      "Yuvraj Virk",
      "Premkumar Devanbu",
      "Toufique Ahmed"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.19330",
    "title": "G2LTraj: A Global-to-Local Generation Approach for Trajectory Prediction",
    "abstract": "Predicting future trajectories of traffic agents accurately holds substantial importance in various applications such as autonomous driving. Previous methods commonly infer all future steps of an agent either recursively or simultaneously. However, the recursive strategy suffers from the accumulated error, while the simultaneous strategy overlooks the constraints among future steps, resulting in kinematically infeasible predictions. To address these issues, in this paper, we propose G2LTraj, a plug-and-play global-to-local generation approach for trajectory prediction. Specifically, we generate a series of global key steps that uniformly cover the entire future time range. Subsequently, the local intermediate steps between the adjacent key steps are recursively filled in. In this way, we prevent the accumulated error from propagating beyond the adjacent key steps. Moreover, to boost the kinematical feasibility, we not only introduce the spatial constraints among key steps but also strengthen the temporal constraints among the intermediate steps. Finally, to ensure the optimal granularity of key steps, we design a selectable granularity strategy that caters to each predicted trajectory. Our G2LTraj significantly improves the performance of seven existing trajectory predictors across the ETH, UCY and nuScenes datasets. Experimental results demonstrate its effectiveness. Code will be available at https://github.com/Zhanwei-Z/G2LTraj. ",
    "url": "https://arxiv.org/abs/2404.19330",
    "authors": [
      "Zhanwei Zhang",
      "Zishuo Hua",
      "Minghao Chen",
      "Wei Lu",
      "Binbin Lin",
      "Deng Cai",
      "Wenxiao Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.19334",
    "title": "Multi-Scale Heterogeneity-Aware Hypergraph Representation for  Histopathology Whole Slide Images",
    "abstract": "Survival prediction is a complex ordinal regression task that aims to predict the survival coefficient ranking among a cohort of patients, typically achieved by analyzing patients' whole slide images. Existing deep learning approaches mainly adopt multiple instance learning or graph neural networks under weak supervision. Most of them are unable to uncover the diverse interactions between different types of biological entities(\\textit{e.g.}, cell cluster and tissue block) across multiple scales, while such interactions are crucial for patient survival prediction. In light of this, we propose a novel multi-scale heterogeneity-aware hypergraph representation framework. Specifically, our framework first constructs a multi-scale heterogeneity-aware hypergraph and assigns each node with its biological entity type. It then mines diverse interactions between nodes on the graph structure to obtain a global representation. Experimental results demonstrate that our method outperforms state-of-the-art approaches on three benchmark datasets. Code is publicly available at \\href{https://github.com/Hanminghao/H2GT}{https://github.com/Hanminghao/H2GT}. ",
    "url": "https://arxiv.org/abs/2404.19334",
    "authors": [
      "Minghao Han",
      "Xukun Zhang",
      "Dingkang Yang",
      "Tao Liu",
      "Haopeng Kuang",
      "Jinghui Feng",
      "Lihua Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19337",
    "title": "Design of a Representation Information Repository for the Long-Term  Usability of Digital Building Documents",
    "abstract": "The long-term usability of digital building documents is essential for the maintenance and optimization of infrastructure portfolios. It supports the preservation of building-specific knowledge and the cultural heritage hidden within. However, having to do this throughout the lifecycle of a building - or even indefinitely - remains a major challenge. This is especially true for organizations responsible for large collections of digital building documents, such as public administrations or archives. In this article, we first describe the challenges and requirements associated with preservation tasks, and then introduce the concept of so-called representation information within BIM (Building Information Modeling). This type of information is important to give meaning to the stored bit sequences for a particular community. Then, we design a repository for representation information and introduce some so-called 23 BIMcore content elements. Finally, we focus on BIM and the construction sector and explain how the proposed repository can be used to implement the two concepts introduced in the ISO reference model OAIS (Open Archival Information System), namely the representation information and the context information, as well as the concept of significant properties, which has not yet been explicitly modeled in OAIS. ",
    "url": "https://arxiv.org/abs/2404.19337",
    "authors": [
      "Uwe M. Borghoff",
      "Eberhard Pfeiffer",
      "Peter Rödig"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2404.19358",
    "title": "QML-IB: Quantized Collaborative Intelligence between Multiple Devices  and the Mobile Network",
    "abstract": "The integration of artificial intelligence (AI) and mobile networks is regarded as one of the most important scenarios for 6G. In 6G, a major objective is to realize the efficient transmission of task-relevant data. Then a key problem arises, how to design collaborative AI models for the device side and the network side, so that the transmitted data between the device and the network is efficient enough, which means the transmission overhead is low but the AI task result is accurate. In this paper, we propose the multi-link information bottleneck (ML-IB) scheme for such collaborative models design. We formulate our problem based on a novel performance metric, which can evaluate both task accuracy and transmission overhead. Then we introduce a quantizer that is adjustable in the quantization bit depth, amplitudes, and breakpoints. Given the infeasibility of calculating our proposed metric on high-dimensional data, we establish a variational upper bound for this metric. However, due to the incorporation of quantization, the closed form of the variational upper bound remains uncomputable. Hence, we employ the Log-Sum Inequality to derive an approximation and provide a theoretical guarantee. Based on this, we devise the quantized multi-link information bottleneck (QML-IB) algorithm for collaborative AI models generation. Finally, numerical experiments demonstrate the superior performance of our QML-IB algorithm compared to the state-of-the-art algorithm. ",
    "url": "https://arxiv.org/abs/2404.19358",
    "authors": [
      "Jingchen Peng",
      "Boxiang Ren",
      "Lu Yang",
      "Chenghui Peng",
      "Panpan Niu",
      "Hao Wu"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2404.19364",
    "title": "Navigating Brain Language Representations: A Comparative Analysis of  Neural Language Models and Psychologically Plausible Models",
    "abstract": "Neural language models, particularly large-scale ones, have been consistently proven to be most effective in predicting brain neural activity across a range of studies. However, previous research overlooked the comparison of these models with psychologically plausible ones. Moreover, evaluations were reliant on limited, single-modality, and English cognitive datasets. To address these questions, we conducted an analysis comparing encoding performance of various neural language models and psychologically plausible models. Our study utilized extensive multi-modal cognitive datasets, examining bilingual word and discourse levels. Surprisingly, our findings revealed that psychologically plausible models outperformed neural language models across diverse contexts, encompassing different modalities such as fMRI and eye-tracking, and spanning languages from English to Chinese. Among psychologically plausible models, the one incorporating embodied information emerged as particularly exceptional. This model demonstrated superior performance at both word and discourse levels, exhibiting robust prediction of brain activation across numerous regions in both English and Chinese. ",
    "url": "https://arxiv.org/abs/2404.19364",
    "authors": [
      "Yunhao Zhang",
      "Shaonan Wang",
      "Xinyi Dong",
      "Jiajun Yu",
      "Chengqing Zong"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.19368",
    "title": "Exploring Multi-Lingual Bias of Large Code Models in Code Generation",
    "abstract": "Code generation aims to synthesize code and fulfill functional requirements based on natural language (NL) specifications, which can greatly improve development efficiency. In the era of large language models (LLMs), large code models (LCMs) have been recently proposed to generate source code. LCMs can generate highly feasible solutions for programming problems described in natural language. Despite the effectiveness, we observe a noticeable multilingual bias in the generation performance of LCMs. Specifically, LCMs demonstrate proficiency in generating solutions when provided with instructions in English, yet may falter when faced with semantically equivalent instructions in other NLs such as Chinese. Moreover, the ability of LCMs to generate code exhibits variety across different programming languages (PLs), such as Python and C++. The observed phenomenon indicates the presence of multi-lingual bias within the generative capabilities of LCMs, which has remained unexplored. In this paper, we aim to investigate the multi-lingual bias that exists in current LCMs. First, we initiate our investigation by constructing the first multi-lingual evaluation benchmark X-HumanEval-X, enabling us to systematically evaluate the extent of multi-lingual bias that exists in current LCMs. In our large-scale experiments on nine popular LCMs, we observe a pronounced multi-lingual bias of LCMs in code generation, including multi-NL and multi-PL bias. Specifically, when using Chinese instructions, the code generation capabilities of LCMs decrease by at least 13% in terms of the Pass@1 metric. Furthermore, LCMs perform variously across different programming languages, e.g., the performance gap between Python and C++ reaches as high as 20.9%. ... ",
    "url": "https://arxiv.org/abs/2404.19368",
    "authors": [
      "Chaozheng Wang",
      "Zongjie Li",
      "Cuiyun Gao",
      "Wenxuan Wang",
      "Ting Peng",
      "Hailiang Huang",
      "Yuetang Deng",
      "Shuai Wang",
      "Michael R. Lyu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.19372",
    "title": "AutoNet: Automatic Reachability Policy Management in Public Cloud  Networks",
    "abstract": "Virtual Private Cloud (VPC) is the main network abstraction technology used in public cloud systems. VPCs are composed of a set of network services that permit the definition of complex network reachability properties among internal and external cloud entities such as tenants' VMs or some generic internet nodes. Although hiding the underlying complexity through a comprehensible abstraction layer, manually enforcing particular reachability intents in VPC networks is still notably error-prone and complex. In this paper, we propose AutoNet, a new model for assisting cloud tenants in managing reachability-based policies in VPC networks. AutoNet is capable of safely generating incremental VPC configurations while satisfying some metric-based high-level intent defined by the tenants. To achieve this goal, we leverage a MaxSAT-based encoding of the network configuration combined with several optimizations to scale to topologies with thousands of nodes. Our results show that the developed system is capable of achieving a sub-second response time for production VPC deployments while still providing fine-grained control over the generated configurations. ",
    "url": "https://arxiv.org/abs/2404.19372",
    "authors": [
      "German Sviridov",
      "Zheng Tao Shen",
      "Jorge Cardoso"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2404.19379",
    "title": "SemanticFormer: Holistic and Semantic Traffic Scene Representation for  Trajectory Prediction using Knowledge Graphs",
    "abstract": "Trajectory prediction in autonomous driving relies on accurate representation of all relevant contexts of the driving scene including traffic participants, road topology, traffic signs as well as their semantic relations to each other. Despite increased attention to this issue, most approaches in trajectory prediction do not consider all of these factors sufficiently. This paper describes a method SemanticFormer to predict multimodal trajectories by reasoning over a semantic traffic scene graph using a hybrid approach. We extract high-level information in the form of semantic meta-paths from a knowledge graph which is then processed by a novel pipeline based on multiple attention mechanisms to predict accurate trajectories. The proposed architecture comprises a hierarchical heterogeneous graph encoder, which can capture spatio-temporal and relational information across agents and between agents and road elements, and a predictor that fuses the different encodings and decodes trajectories with probabilities. Finally, a refinement module evaluates permitted meta-paths of trajectories and speed profiles to obtain final predicted trajectories. Evaluation of the nuScenes benchmark demonstrates improved performance compared to the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2404.19379",
    "authors": [
      "Zhigang Sun",
      "Zixu Wang",
      "Lavdim Halilaj",
      "Juergen Luettin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2404.19382",
    "title": "Probing Unlearned Diffusion Models: A Transferable Adversarial Attack  Perspective",
    "abstract": "Advanced text-to-image diffusion models raise safety concerns regarding identity privacy violation, copyright infringement, and Not Safe For Work content generation. Towards this, unlearning methods have been developed to erase these involved concepts from diffusion models. However, these unlearning methods only shift the text-to-image mapping and preserve the visual content within the generative space of diffusion models, leaving a fatal flaw for restoring these erased concepts. This erasure trustworthiness problem needs probe, but previous methods are sub-optimal from two perspectives: (1) Lack of transferability: Some methods operate within a white-box setting, requiring access to the unlearned model. And the learned adversarial input often fails to transfer to other unlearned models for concept restoration; (2) Limited attack: The prompt-level methods struggle to restore narrow concepts from unlearned models, such as celebrity identity. Therefore, this paper aims to leverage the transferability of the adversarial attack to probe the unlearning robustness under a black-box setting. This challenging scenario assumes that the unlearning method is unknown and the unlearned model is inaccessible for optimization, requiring the attack to be capable of transferring across different unlearned models. Specifically, we employ an adversarial search strategy to search for the adversarial embedding which can transfer across different unlearned models. This strategy adopts the original Stable Diffusion model as a surrogate model to iteratively erase and search for embeddings, enabling it to find the embedding that can restore the target concept for different unlearning methods. Extensive experiments demonstrate the transferability of the searched adversarial embedding across several state-of-the-art unlearning methods and its effectiveness for different levels of concepts. ",
    "url": "https://arxiv.org/abs/2404.19382",
    "authors": [
      "Xiaoxuan Han",
      "Songlin Yang",
      "Wei Wang",
      "Yang Li",
      "Jing Dong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19384",
    "title": "Pseudo Label Refinery for Unsupervised Domain Adaptation on  Cross-dataset 3D Object Detection",
    "abstract": "Recent self-training techniques have shown notable improvements in unsupervised domain adaptation for 3D object detection (3D UDA). These techniques typically select pseudo labels, i.e., 3D boxes, to supervise models for the target domain. However, this selection process inevitably introduces unreliable 3D boxes, in which 3D points cannot be definitively assigned as foreground or background. Previous techniques mitigate this by reweighting these boxes as pseudo labels, but these boxes can still poison the training process. To resolve this problem, in this paper, we propose a novel pseudo label refinery framework. Specifically, in the selection process, to improve the reliability of pseudo boxes, we propose a complementary augmentation strategy. This strategy involves either removing all points within an unreliable box or replacing it with a high-confidence box. Moreover, the point numbers of instances in high-beam datasets are considerably higher than those in low-beam datasets, also degrading the quality of pseudo labels during the training process. We alleviate this issue by generating additional proposals and aligning RoI features across different domains. Experimental results demonstrate that our method effectively enhances the quality of pseudo labels and consistently surpasses the state-of-the-art methods on six autonomous driving benchmarks. Code will be available at https://github.com/Zhanwei-Z/PERE. ",
    "url": "https://arxiv.org/abs/2404.19384",
    "authors": [
      "Zhanwei Zhang",
      "Minghao Chen",
      "Shuai Xiao",
      "Liang Peng",
      "Hengjia Li",
      "Binbin Lin",
      "Ping Li",
      "Wenxiao Wang",
      "Boxi Wu",
      "Deng Cai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.19415",
    "title": "Two-Stage Robust Planning Model for Park-Level Integrated Energy System  Considering Uncertain Equipment Contingency",
    "abstract": "In this paper, we propose a two-stage robust planning model for an Integrated Energy System (IES) that serves an industrial park. The term 'Park-level IES' is used to refers to IES of a smaller scale but have high demands for various forms of energy. The proposed planning model considers uncertainties like load demand fluctuations and equipment contingencies, and provides a reliable scheme of equipment selection and sizing for IES investors. Inspired by the unit commitment problem, we formulate an equipment contingency uncertainty set to accurately describe the potential equipment contingencies which happen and can be repaired within a day. Then, a novel and modified nested column-and-constraint generation algorithm is applied to solve this two-stage robust planning model with integer recourse efficiently. In the case study, the role of energy storage system for IES reliability enhancement is analyzed in detail. Computational results demonstrate the advantage of the proposed models over the deterministic planning model in terms of improving reliability. ",
    "url": "https://arxiv.org/abs/2404.19415",
    "authors": [
      "Zuxun Xiong",
      "Xinwei Shen",
      "Hongbin Sun"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2404.19417",
    "title": "Physical Backdoor: Towards Temperature-based Backdoor Attacks in the  Physical World",
    "abstract": "Backdoor attacks have been well-studied in visible light object detection (VLOD) in recent years. However, VLOD can not effectively work in dark and temperature-sensitive scenarios. Instead, thermal infrared object detection (TIOD) is the most accessible and practical in such environments. In this paper, our team is the first to investigate the security vulnerabilities associated with TIOD in the context of backdoor attacks, spanning both the digital and physical realms. We introduce two novel types of backdoor attacks on TIOD, each offering unique capabilities: Object-affecting Attack and Range-affecting Attack. We conduct a comprehensive analysis of key factors influencing trigger design, which include temperature, size, material, and concealment. These factors, especially temperature, significantly impact the efficacy of backdoor attacks on TIOD. A thorough understanding of these factors will serve as a foundation for designing physical triggers and temperature controlling experiments. Our study includes extensive experiments conducted in both digital and physical environments. In the digital realm, we evaluate our approach using benchmark datasets for TIOD, achieving an Attack Success Rate (ASR) of up to 98.21%. In the physical realm, we test our approach in two real-world settings: a traffic intersection and a parking lot, using a thermal infrared camera. Here, we attain an ASR of up to 98.38%. ",
    "url": "https://arxiv.org/abs/2404.19417",
    "authors": [
      "Wen Yin",
      "Jian Lou",
      "Pan Zhou",
      "Yulai Xie",
      "Dan Feng",
      "Yuhua Sun",
      "Tailai Zhang",
      "Lichao Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19418",
    "title": "Energy Cyber Attacks to Smart Healthcare Devices: A Testbed",
    "abstract": "The Internet of Things (IoT) has garnered significant interest in both research and industry due to its profound impact on human life. The rapid expansion of IoT technology has ushered in smart healthcare, smart devices, smart cities, and smart grids. However, the security of IoT devices, particularly in healthcare, has become a major concern, with recent attacks revealing serious vulnerabilities. In IoT networks, where connected devices are susceptible to resource-constraint attacks, such as energy consumption attacks, security is paramount. This paper explores the impact of Distributed Denial of Service (DDoS) and Fake Access Points (F-APs) attacks on WiFi-enabled smart healthcare devices. Specifically, it investigates how these attacks can disrupt service on victim devices and Access Points (APs), focusing on device connectivity and energy consumption during attacks. Key findings include identifying the attack rates of DDoS attacks that disrupt services and quantifying the energy consumption impact of Energy Consumption Distributed Denial of Service (EC-DDoS) and F-APs attacks on smart healthcare devices. The study highlights communication protocols, attack rates, payload sizes, and port states of victim devices as critical factors influencing energy consumption. These insights provide a comprehensive understanding of IoT device vulnerabilities in smart healthcare environments and lay the groundwork for future defense strategies. ",
    "url": "https://arxiv.org/abs/2404.19418",
    "authors": [
      "Zainab Alwaisi",
      "Simone Soderi",
      "Rocco De Nicola"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.19419",
    "title": "Active Dendrites Enable Efficient Continual Learning in  Time-To-First-Spike Neural Networks",
    "abstract": "While the human brain efficiently adapts to new tasks from a continuous stream of information, neural network models struggle to learn from sequential information without catastrophically forgetting previously learned tasks. This limitation presents a significant hurdle in deploying edge devices in real-world scenarios where information is presented in an inherently sequential manner. Active dendrites of pyramidal neurons play an important role in the brain ability to learn new tasks incrementally. By exploiting key properties of time-to-first-spike encoding and leveraging its high sparsity, we present a novel spiking neural network model enhanced with active dendrites. Our model can efficiently mitigate catastrophic forgetting in temporally-encoded SNNs, which we demonstrate with an end-of-training accuracy across tasks of 88.3% on the test set using the Split MNIST dataset. Furthermore, we provide a novel digital hardware architecture that paves the way for real-world deployment in edge devices. Using a Xilinx Zynq-7020 SoC FPGA, we demonstrate a 100-% match with our quantized software model, achieving an average inference time of 37.3 ms and an 80.0% accuracy. ",
    "url": "https://arxiv.org/abs/2404.19419",
    "authors": [
      "Lorenzo Pes",
      "Rick Luiken",
      "Federico Corradi",
      "Charlotte Frenkel"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2404.19420",
    "title": "Let's Focus: Focused Backdoor Attack against Federated Transfer Learning",
    "abstract": "Federated Transfer Learning (FTL) is the most general variation of Federated Learning. According to this distributed paradigm, a feature learning pre-step is commonly carried out by only one party, typically the server, on publicly shared data. After that, the Federated Learning phase takes place to train a classifier collaboratively using the learned feature extractor. Each involved client contributes by locally training only the classification layers on a private training set. The peculiarity of an FTL scenario makes it hard to understand whether poisoning attacks can be developed to craft an effective backdoor. State-of-the-art attack strategies assume the possibility of shifting the model attention toward relevant features introduced by a forged trigger injected in the input data by some untrusted clients. Of course, this is not feasible in FTL, as the learned features are fixed once the server performs the pre-training step. Consequently, in this paper, we investigate this intriguing Federated Learning scenario to identify and exploit a vulnerability obtained by combining eXplainable AI (XAI) and dataset distillation. In particular, the proposed attack can be carried out by one of the clients during the Federated Learning phase of FTL by identifying the optimal local for the trigger through XAI and encapsulating compressed information of the backdoor class. Due to its behavior, we refer to our approach as a focused backdoor approach (FB-FTL for short) and test its performance by explicitly referencing an image classification scenario. With an average 80% attack success rate, obtained results show the effectiveness of our attack also against existing defenses for Federated Learning. ",
    "url": "https://arxiv.org/abs/2404.19420",
    "authors": [
      "Marco Arazzi",
      "Stefanos Koffas",
      "Antonino Nocera",
      "Stjepan Picek"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.19422",
    "title": "Efficient Algorithms for Earliest and Fastest Paths in Public Transport  Networks",
    "abstract": "Public transport administrators rely on efficient algorithms for various problems that arise in public transport networks. In particular, our study focused on designing linear-time algorithms for two fundamental path problems: the earliest arrival time (\\textsc{eat}) and the fastest path duration (\\textsc{fpd}) on public transportation data. We conduct a comparative analysis with state-of-the-art algorithms. The results are quite promising, indicating substantial efficiency improvements. Specifically, the fastest path problem shows a remarkable 34-fold speedup, while the earliest arrival time problem exhibits an even more impressive 183-fold speedup. These findings highlight the effectiveness of our algorithms to solve \\textsc{eat} and \\textsc{fpd} problems in public transport, and eventually help public administrators to enrich the urban transport experience. ",
    "url": "https://arxiv.org/abs/2404.19422",
    "authors": [
      "Mithinti Srikanth",
      "G.Ramakrishna"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2404.19429",
    "title": "Lancet: Accelerating Mixture-of-Experts Training via Whole Graph  Computation-Communication Overlapping",
    "abstract": "The Mixture-of-Expert (MoE) technique plays a crucial role in expanding the size of DNN model parameters. However, it faces the challenge of extended all-to-all communication latency during the training process. Existing methods attempt to mitigate this issue by overlapping all-to-all with expert computation. Yet, these methods frequently fall short of achieving sufficient overlap, consequently restricting the potential for performance enhancements. In our study, we extend the scope of this challenge by considering overlap at the broader training graph level. During the forward pass, we enable non-MoE computations to overlap with all-to-all through careful partitioning and pipelining. In the backward pass, we achieve overlap with all-to-all by scheduling gradient weight computations. We implement these techniques in Lancet, a system using compiler-based optimization to automatically enhance MoE model training. Our extensive evaluation reveals that Lancet significantly reduces the time devoted to non-overlapping communication, by as much as 77%. Moreover, it achieves a notable end-to-end speedup of up to 1.3 times when compared to the state-of-the-art solutions. ",
    "url": "https://arxiv.org/abs/2404.19429",
    "authors": [
      "Chenyu Jiang",
      "Ye Tian",
      "Zhen Jia",
      "Shuai Zheng",
      "Chuan Wu",
      "Yida Wang"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19434",
    "title": "Detection of Energy Consumption Cyber Attacks on Smart Devices",
    "abstract": "With the rapid development of Internet of Things (IoT) technology, intelligent systems are increasingly integrating into everyday life and people's homes. However, the proliferation of these technologies raises concerns about the security of smart home devices. These devices often face resource constraints and may connect to unreliable networks, posing risks to the data they handle. Securing IoT technology is crucial due to the sensitive data involved. Preventing energy attacks and ensuring the security of IoT infrastructure are key challenges in modern smart homes. Monitoring energy consumption can be an effective approach to detecting abnormal behavior and IoT cyberattacks. Lightweight algorithms are necessary to accommodate the resource limitations of IoT devices. This paper presents a lightweight technique for detecting energy consumption attacks on smart home devices by analyzing received packets. The proposed algorithm considers TCP, UDP, and MQTT protocols, as well as device statuses (Idle, active, under attack). It accounts for resource constraints and promptly alerts administrators upon detecting an attack. The proposed approach effectively identifies energy consumption attacks by measuring packet reception rates for different protocols. ",
    "url": "https://arxiv.org/abs/2404.19434",
    "authors": [
      "Zainab Alwaisi",
      "Simone Soderi",
      "Rocco De Nicola"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.19449",
    "title": "AoI-aware Sensing Scheduling and Trajectory Optimization for  Multi-UAV-assisted Wireless Backscatter Networks",
    "abstract": "This paper considers multiple unmanned aerial vehicles (UAVs) to assist sensing data transmissions from the ground users (GUs) to a remote base station (BS). Each UAV collects sensing data from the GUs and then forwards the sensing data to the remote BS. The GUs first backscatter their data to the UAVs and then all UAVs forward data to the BS by the nonorthogonal multiple access (NOMA) transmissions. We formulate a multi-stage stochastic optimization problem to minimize the long-term time-averaged age-of-information (AoI) by jointly optimizing the GUs' access control, the UAVs' beamforming, and trajectory planning strategies. To solve this problem, we first model the dynamics of the GUs' AoI statuses by virtual queueing systems, and then propose the AoI-aware sensing scheduling and trajectory optimization (AoI-STO) algorithm. This allows us to transform the multi-stage AoI minimization problem into a series of per-slot control problems by using the Lyapunov optimization framework. In each time slot, the GUs' access control, the UAVs' beamforming, and mobility control strategies are updated by using the block coordinate descent (BCD) method according to the instant GUs' AoI statuses. Simulation results reveal that the proposed AoI-STO algorithm can reduce the overall AoI by more than 50%. The GUs' scheduling fairness is also improved greatly by adapting the GUs' access control compared with typical baseline schemes. ",
    "url": "https://arxiv.org/abs/2404.19449",
    "authors": [
      "Yusi Long",
      "Songhan Zhao",
      "Shimin Gong",
      "Bo Gu",
      "Dusit Niyato",
      "Xuemin",
      "Shen"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2404.19452",
    "title": "How to Sustainably Monitor ML-Enabled Systems? Accuracy and Energy  Efficiency Tradeoffs in Concept Drift Detection",
    "abstract": "ML-enabled systems that are deployed in a production environment typically suffer from decaying model prediction quality through concept drift, i.e., a gradual change in the statistical characteristics of a certain real-world domain. To combat this, a simple solution is to periodically retrain ML models, which unfortunately can consume a lot of energy. One recommended tactic to improve energy efficiency is therefore to systematically monitor the level of concept drift and only retrain when it becomes unavoidable. Different methods are available to do this, but we know very little about their concrete impact on the tradeoff between accuracy and energy efficiency, as these methods also consume energy themselves. To address this, we therefore conducted a controlled experiment to study the accuracy vs. energy efficiency tradeoff of seven common methods for concept drift detection. We used five synthetic datasets, each in a version with abrupt and one with gradual drift, and trained six different ML models as base classifiers. Based on a full factorial design, we tested 420 combinations (7 drift detectors * 5 datasets * 2 types of drift * 6 base classifiers) and compared energy consumption and drift detection accuracy. Our results indicate that there are three types of detectors: a) detectors that sacrifice energy efficiency for detection accuracy (KSWIN), b) balanced detectors that consume low to medium energy with good accuracy (HDDM_W, ADWIN), and c) detectors that consume very little energy but are unusable in practice due to very poor accuracy (HDDM_A, PageHinkley, DDM, EDDM). By providing rich evidence for this energy efficiency tactic, our findings support ML practitioners in choosing the best suited method of concept drift detection for their ML-enabled systems. ",
    "url": "https://arxiv.org/abs/2404.19452",
    "authors": [
      "Rafiullah Omar",
      "Justus Bogner",
      "Joran Leest",
      "Vincenzo Stoico",
      "Patricia Lago",
      "Henry Muccini"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.19453",
    "title": "Structural Parameters for Dense Temporal Graphs",
    "abstract": "Temporal graphs provide a useful model for many real-world networks. Unfortunately the majority of algorithmic problems we might consider on such graphs are intractable. There has been recent progress in defining structural parameters which describe tractable cases by simultaneously restricting the underlying structure and the times at which edges appear in the graph. These all rely on the temporal graph being sparse in some sense. We introduce temporal analogues of three increasingly restrictive static graph parameters -- cliquewidth, modular-width and neighbourhood diversity -- which take small values for highly structured temporal graphs, even if a large number of edges are active at each timestep. The computational problems solvable efficiently when the temporal cliquewidth of the input graph is bounded form a subset of those solvable efficiently when the temporal modular-width is bounded, which is in turn a subset of problems efficiently solvable when the temporal neighbourhood diversity is bounded. By considering specific temporal graph problems, we demonstrate that (up to standard complexity theoretic assumptions) these inclusions are strict. ",
    "url": "https://arxiv.org/abs/2404.19453",
    "authors": [
      "Jessica Enright",
      "Samuel D. Hand",
      "Laura Larios-Jones",
      "Kitty Meeks"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2404.19454",
    "title": "Optimized neural forms for solving ordinary differential equations",
    "abstract": "A critical issue in approximating solutions of ordinary differential equations using neural networks is the exact satisfaction of the boundary or initial conditions. For this purpose, neural forms have been introduced, i.e., functional expressions that depend on neural networks which, by design, satisfy the prescribed conditions exactly. Expanding upon prior progress, the present work contributes in three distinct aspects. First, it presents a novel formalism for crafting optimized neural forms. Second, it outlines a method for establishing an upper bound on the absolute deviation from the exact solution. Third, it introduces a technique for converting problems with Neumann or Robin conditions into equivalent problems with parametric Dirichlet conditions. The proposed optimized neural forms were numerically tested on a set of diverse problems, encompassing first-order and second-order ordinary differential equations, as well as first-order systems. Stiff and delay differential equations were also considered. The obtained solutions were compared against solutions obtained via Runge-Kutta methods and exact solutions wherever available. The reported results and analysis verify that in addition to the exact satisfaction of the boundary or initial conditions, optimized neural forms provide closed-form solutions of superior interpolation capability and controllable overall accuracy. ",
    "url": "https://arxiv.org/abs/2404.19454",
    "authors": [
      "Adam D. Kypriadis",
      "Isaac E. Lagaris",
      "Aristidis Likas",
      "Konstantinos E. Parsopoulos"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.19460",
    "title": "AttackBench: Evaluating Gradient-based Attacks for Adversarial Examples",
    "abstract": "Adversarial examples are typically optimized with gradient-based attacks. While novel attacks are continuously proposed, each is shown to outperform its predecessors using different experimental setups, hyperparameter settings, and number of forward and backward calls to the target models. This provides overly-optimistic and even biased evaluations that may unfairly favor one particular attack over the others. In this work, we aim to overcome these limitations by proposing AttackBench, i.e., the first evaluation framework that enables a fair comparison among different attacks. To this end, we first propose a categorization of gradient-based attacks, identifying their main components and differences. We then introduce our framework, which evaluates their effectiveness and efficiency. We measure these characteristics by (i) defining an optimality metric that quantifies how close an attack is to the optimal solution, and (ii) limiting the number of forward and backward queries to the model, such that all attacks are compared within a given maximum query budget. Our extensive experimental analysis compares more than 100 attack implementations with a total of over 800 different configurations against CIFAR-10 and ImageNet models, highlighting that only very few attacks outperform all the competing approaches. Within this analysis, we shed light on several implementation issues that prevent many attacks from finding better solutions or running at all. We release AttackBench as a publicly available benchmark, aiming to continuously update it to include and evaluate novel gradient-based attacks for optimizing adversarial examples. ",
    "url": "https://arxiv.org/abs/2404.19460",
    "authors": [
      "Antonio Emanuele Cinà",
      "Jérôme Rony",
      "Maura Pintor",
      "Luca Demetrio",
      "Ambra Demontis",
      "Battista Biggio",
      "Ismail Ben Ayed",
      "Fabio Roli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19462",
    "title": "Continual Model-based Reinforcement Learning for Data Efficient Wireless  Network Optimisation",
    "abstract": "We present a method that addresses the pain point of long lead-time required to deploy cell-level parameter optimisation policies to new wireless network sites. Given a sequence of action spaces represented by overlapping subsets of cell-level configuration parameters provided by domain experts, we formulate throughput optimisation as Continual Reinforcement Learning of control policies. Simulation results suggest that the proposed system is able to shorten the end-to-end deployment lead-time by two-fold compared to a reinitialise-and-retrain baseline without any drop in optimisation gain. ",
    "url": "https://arxiv.org/abs/2404.19462",
    "authors": [
      "Cengis Hasan",
      "Alexandros Agapitos",
      "David Lynch",
      "Alberto Castagna",
      "Giorgio Cruciata",
      "Hao Wang",
      "Aleksandar Milenovic"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19467",
    "title": "Bayesian Functional Connectivity and Graph Convolutional Network for  Working Memory Load Classification",
    "abstract": "Brain responses related to working memory originate from distinct brain areas and oscillate at different frequencies. EEG signals with high temporal correlation can effectively capture these responses. Therefore, estimating the functional connectivity of EEG for working memory protocols in different frequency bands plays a significant role in analyzing the brain dynamics with increasing memory and cognitive loads, which remains largely unexplored. The present study introduces a Bayesian structure learning algorithm to learn the functional connectivity of EEG in sensor space. Next, the functional connectivity graphs are taken as input to the graph convolutional network to classify the working memory loads. The intrasubject (subject-specific) classification performed on 154 subjects for six different verbal working memory loads produced the highest classification accuracy of 96% and average classification accuracy of 89%, outperforming state-of-the-art classification models proposed in the literature. Furthermore, the proposed Bayesian structure learning algorithm is compared with state-of-the-art functional connectivity estimation methods through intersubject and intrasubject statistical analysis of variance. The results also show that the alpha and theta bands have better classification accuracy than the beta band. ",
    "url": "https://arxiv.org/abs/2404.19467",
    "authors": [
      "Harshini Gangapuram",
      "Vidya Manian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2404.19479",
    "title": "Reachability in temporal graphs under perturbation",
    "abstract": "Reachability and other path-based measures on temporal graphs can be used to understand spread of infection, information, and people in modelled systems. Due to delays and errors in reporting, temporal graphs derived from data are unlikely to perfectly reflect reality, especially with respect to the precise times at which edges appear. To reflect this uncertainty, we consider a model in which some number $\\zeta$ of edge appearances may have their timestamps perturbed by $\\pm\\delta$ for some $\\delta$. Within this model, we investigate temporal reachability and consider the problem of determining the maximum number of vertices any vertex can reach under these perturbations. We show that this problem is intractable in general but is efficiently solvable when $\\zeta$ is sufficiently large. We also give algorithms which solve this problem in several restricted settings. We complement this with some contrasting results concerning the complexity of related temporal eccentricity problems under perturbation. ",
    "url": "https://arxiv.org/abs/2404.19479",
    "authors": [
      "Jessica Enright",
      "Laura Larios-Jones",
      "Kitty Meeks",
      "William Pettersson"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2404.19480",
    "title": "Mitigating and Analysis of Memory Usage Attack in IoE System",
    "abstract": "Internet of Everything (IoE) is a newly emerging trend, especially in homes. Marketing forces toward smart homes are also accelerating the spread of IoE devices in households. An obvious risk of the rapid adoption of these smart devices is that many lack controls for protecting the privacy and security of end users from attacks designed to disrupt lives and incur financial losses. Today the smart home is a system for managing the basic life support processes of both small systems, e.g., commercial, office premises, apartments, cottages, and largely automated complexes, e.g., commercial and industrial complexes. One of the critical tasks to be solved by the concept of a modern smart home is the problem of preventing the usage of IoE resources. Recently, there has been a rapid increase in attacks on consumer IoE devices. Memory corruption vulnerabilities constitute a significant class of vulnerabilities in software security through which attackers can gain control of an entire system. Numerous memory corruption vulnerabilities have been found in IoE firmware already deployed in the consumer market. This paper aims to analyze and explain the resource usage attack and create a low-cost simulation environment to aid in the dynamic analysis of the attack. Further, we perform controlled resource usage attacks while measuring resource consumption on resource-constrained victims' IoE devices, such as CPU and memory utilization. We also build a lightweight algorithm to detect memory usage attacks in the IoE environment. The result shows high efficiency in detecting and mitigating memory usage attacks by detecting when the intruder starts and stops the attack. ",
    "url": "https://arxiv.org/abs/2404.19480",
    "authors": [
      "Zainab Alwaisi",
      "Simone Soderi",
      "Rocco De Nicola"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.19486",
    "title": "Safe Training with Sensitive In-domain Data: Leveraging Data  Fragmentation To Mitigate Linkage Attacks",
    "abstract": "Current text generation models are trained using real data which can potentially contain sensitive information, such as confidential patient information and the like. Under certain conditions output of the training data which they have memorised can be triggered, exposing sensitive data. To mitigate against this risk we propose a safer alternative which sees fragmented data in the form of domain-specific short phrases randomly grouped together shared instead of full texts. Thus, text fragments that could re-identify an individual cannot be reproduced by the model in one sequence, giving significant protection against linkage attacks. We fine-tune several state-of-the-art LLMs using meaningful syntactic chunks to explore their utility. In particular, we fine-tune BERT-based models to predict two cardiovascular diagnoses. Our results demonstrate the capacity of LLMs to benefit from the pre-trained knowledge and deliver classification results when fine-tuned with fragmented data comparable to fine-tuning with full training data. ",
    "url": "https://arxiv.org/abs/2404.19486",
    "authors": [
      "Mariia Ignashina",
      "Julia Ive"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19489",
    "title": "EvGNN: An Event-driven Graph Neural Network Accelerator for Edge Vision",
    "abstract": "Edge vision systems combining sensing and embedded processing promise low-latency, decentralized, and energy-efficient solutions that forgo reliance on the cloud. As opposed to conventional frame-based vision sensors, event-based cameras deliver a microsecond-scale temporal resolution with sparse information encoding, thereby outlining new opportunities for edge vision systems. However, mainstream algorithms for frame-based vision, which mostly rely on convolutional neural networks (CNNs), can hardly exploit the advantages of event-based vision as they are typically optimized for dense matrix-vector multiplications. While event-driven graph neural networks (GNNs) have recently emerged as a promising solution for sparse event-based vision, their irregular structure is a challenge that currently hinders the design of efficient hardware accelerators. In this paper, we propose EvGNN, the first event-driven GNN accelerator for low-footprint, ultra-low-latency, and high-accuracy edge vision with event-based cameras. It relies on three central ideas: (i) directed dynamic graphs exploiting single-hop nodes with edge-free storage, (ii) event queues for the efficient identification of local neighbors within a spatiotemporally decoupled search range, and (iii) a novel layer-parallel processing scheme enabling the low-latency execution of multi-layer GNNs. We deployed EvGNN on a Xilinx KV260 Ultrascale+ MPSoC platform and benchmarked it on the N-CARS dataset for car recognition, demonstrating a classification accuracy of 87.8% and an average latency per event of 16$\\mu$s, thereby enabling real-time, microsecond-resolution event-based vision at the edge. ",
    "url": "https://arxiv.org/abs/2404.19489",
    "authors": [
      "Yufeng Yang",
      "Adrian Kneip",
      "Charlotte Frenkel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Hardware Architecture (cs.AR)",
      "Emerging Technologies (cs.ET)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2404.19508",
    "title": "Temporal Graph ODEs for Irregularly-Sampled Time Series",
    "abstract": "Modern graph representation learning works mostly under the assumption of dealing with regularly sampled temporal graph snapshots, which is far from realistic, e.g., social networks and physical systems are characterized by continuous dynamics and sporadic observations. To address this limitation, we introduce the Temporal Graph Ordinary Differential Equation (TG-ODE) framework, which learns both the temporal and spatial dynamics from graph streams where the intervals between observations are not regularly spaced. We empirically validate the proposed approach on several graph benchmarks, showing that TG-ODE can achieve state-of-the-art performance in irregular graph stream tasks. ",
    "url": "https://arxiv.org/abs/2404.19508",
    "authors": [
      "Alessio Gravina",
      "Daniele Zambon",
      "Davide Bacciu",
      "Cesare Alippi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19519",
    "title": "Generating Robust Counterfactual Witnesses for Graph Neural Networks",
    "abstract": "This paper introduces a new class of explanation structures, called robust counterfactual witnesses (RCWs), to provide robust, both counterfactual and factual explanations for graph neural networks. Given a graph neural network M, a robust counterfactual witness refers to the fraction of a graph G that are counterfactual and factual explanation of the results of M over G, but also remains so for any \"disturbed\" G by flipping up to k of its node pairs. We establish the hardness results, from tractable results to co-NP-hardness, for verifying and generating robust counterfactual witnesses. We study such structures for GNN-based node classification, and present efficient algorithms to verify and generate RCWs. We also provide a parallel algorithm to verify and generate RCWs for large graphs with scalability guarantees. We experimentally verify our explanation generation process for benchmark datasets, and showcase their applications. ",
    "url": "https://arxiv.org/abs/2404.19519",
    "authors": [
      "Dazhuo Qiu",
      "Mengying Wang",
      "Arijit Khan",
      "Yinghui Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2404.19531",
    "title": "MoST: Multi-modality Scene Tokenization for Motion Prediction",
    "abstract": "Many existing motion prediction approaches rely on symbolic perception outputs to generate agent trajectories, such as bounding boxes, road graph information and traffic lights. This symbolic representation is a high-level abstraction of the real world, which may render the motion prediction model vulnerable to perception errors (e.g., failures in detecting open-vocabulary obstacles) while missing salient information from the scene context (e.g., poor road conditions). An alternative paradigm is end-to-end learning from raw sensors. However, this approach suffers from the lack of interpretability and requires significantly more training resources. In this work, we propose tokenizing the visual world into a compact set of scene elements and then leveraging pre-trained image foundation models and LiDAR neural networks to encode all the scene elements in an open-vocabulary manner. The image foundation model enables our scene tokens to encode the general knowledge of the open world while the LiDAR neural network encodes geometry information. Our proposed representation can efficiently encode the multi-frame multi-modality observations with a few hundred tokens and is compatible with most transformer-based architectures. To evaluate our method, we have augmented Waymo Open Motion Dataset with camera embeddings. Experiments over Waymo Open Motion Dataset show that our approach leads to significant performance improvements over the state-of-the-art. ",
    "url": "https://arxiv.org/abs/2404.19531",
    "authors": [
      "Norman Mu",
      "Jingwei Ji",
      "Zhenpei Yang",
      "Nate Harada",
      "Haotian Tang",
      "Kan Chen",
      "Charles R. Qi",
      "Runzhou Ge",
      "Kratarth Goel",
      "Zoey Yang",
      "Scott Ettinger",
      "Rami Al-Rfou",
      "Dragomir Anguelov",
      "Yin Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19542",
    "title": "One-Stage Open-Vocabulary Temporal Action Detection Leveraging Temporal  Multi-scale and Action Label Features",
    "abstract": "Open-vocabulary Temporal Action Detection (Open-vocab TAD) is an advanced video analysis approach that expands Closed-vocabulary Temporal Action Detection (Closed-vocab TAD) capabilities. Closed-vocab TAD is typically confined to localizing and classifying actions based on a predefined set of categories. In contrast, Open-vocab TAD goes further and is not limited to these predefined categories. This is particularly useful in real-world scenarios where the variety of actions in videos can be vast and not always predictable. The prevalent methods in Open-vocab TAD typically employ a 2-stage approach, which involves generating action proposals and then identifying those actions. However, errors made during the first stage can adversely affect the subsequent action identification accuracy. Additionally, existing studies face challenges in handling actions of different durations owing to the use of fixed temporal processing methods. Therefore, we propose a 1-stage approach consisting of two primary modules: Multi-scale Video Analysis (MVA) and Video-Text Alignment (VTA). The MVA module captures actions at varying temporal resolutions, overcoming the challenge of detecting actions with diverse durations. The VTA module leverages the synergy between visual and textual modalities to precisely align video segments with corresponding action labels, a critical step for accurate action identification in Open-vocab scenarios. Evaluations on widely recognized datasets THUMOS14 and ActivityNet-1.3, showed that the proposed method achieved superior results compared to the other methods in both Open-vocab and Closed-vocab settings. This serves as a strong demonstration of the effectiveness of the proposed method in the TAD task. ",
    "url": "https://arxiv.org/abs/2404.19542",
    "authors": [
      "Trung Thanh Nguyen",
      "Yasutomo Kawanishi",
      "Takahiro Komamizu",
      "Ichiro Ide"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19545",
    "title": "Discrete de-Rham complex involving a discontinuous finite element space  for velocities: the case of periodic straight triangular and Cartesian meshes",
    "abstract": "The aim of this article is to derive discontinuous finite elements vector spaces which can be put in a discrete de-Rham complex for which an harmonic gap property may be proven. First, discontinuous finite element spaces inspired by classical N{\\'e}d{\\'e}lec or Raviart-Thomas conforming space are considered, and we prove that by relaxing the normal or tangential constraint, discontinuous spaces ensuring the harmonic gap property can be built. Then the triangular case is addressed, for which we prove that such a property holds for the classical discontinuous finite element space for vectors. On Cartesian meshes, this result does not hold for the classical discontinuous finite element space for vectors. We then show how to use the de-Rham complex found for triangular meshes for enriching the finite element space on Cartesian meshes in order to recover a de-Rham complex, on which the same harmonic gap property is proven. ",
    "url": "https://arxiv.org/abs/2404.19545",
    "authors": [
      "Vincent Perrier"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2404.19563",
    "title": "RepEval: Effective Text Evaluation with LLM Representation",
    "abstract": "Automatic evaluation metrics for generated texts play an important role in the NLG field, especially with the rapid growth of LLMs. However, existing metrics are often limited to specific scenarios, making it challenging to meet the evaluation requirements of expanding LLM applications. Therefore, there is a demand for new, flexible, and effective metrics. In this study, we introduce RepEval, the first metric leveraging the projection of LLM representations for evaluation. RepEval requires minimal sample pairs for training, and through simple prompt modifications, it can easily transition to various tasks. Results on ten datasets from three tasks demonstrate the high effectiveness of our method, which exhibits stronger correlations with human judgments compared to previous metrics, even outperforming GPT-4. Our work underscores the richness of information regarding text quality embedded within LLM representations, offering insights for the development of new metrics. ",
    "url": "https://arxiv.org/abs/2404.19563",
    "authors": [
      "Shuqian Sheng",
      "Yi Xu",
      "Tianhang Zhang",
      "Zanwei Shen",
      "Luoyi Fu",
      "Jiaxin Ding",
      "Lei Zhou",
      "Xinbing Wang",
      "Chenghu Zhou"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.19567",
    "title": "Causal Perception Inspired Representation Learning for Trustworthy Image  Quality Assessment",
    "abstract": "Despite great success in modeling visual perception, deep neural network based image quality assessment (IQA) still remains unreliable in real-world applications due to its vulnerability to adversarial perturbations and the inexplicit black-box structure. In this paper, we propose to build a trustworthy IQA model via Causal Perception inspired Representation Learning (CPRL), and a score reflection attack method for IQA model. More specifically, we assume that each image is composed of Causal Perception Representation (CPR) and non-causal perception representation (N-CPR). CPR serves as the causation of the subjective quality label, which is invariant to the imperceptible adversarial perturbations. Inversely, N-CPR presents spurious associations with the subjective quality label, which may significantly change with the adversarial perturbations. To extract the CPR from each input image, we develop a soft ranking based channel-wise activation function to mediate the causally sufficient (beneficial for high prediction accuracy) and necessary (beneficial for high robustness) deep features, and based on intervention employ minimax game to optimize. Experiments on four benchmark databases show that the proposed CPRL method outperforms many state-of-the-art adversarial defense methods and provides explicit model interpretation. ",
    "url": "https://arxiv.org/abs/2404.19567",
    "authors": [
      "Lei Wang",
      "Desen Yuan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2404.19591",
    "title": "Towards Interactively Improving ML Data Preparation Code via \"Shadow  Pipelines\"",
    "abstract": "Data scientists develop ML pipelines in an iterative manner: they repeatedly screen a pipeline for potential issues, debug it, and then revise and improve its code according to their findings. However, this manual process is tedious and error-prone. Therefore, we propose to support data scientists during this development cycle with automatically derived interactive suggestions for pipeline improvements. We discuss our vision to generate these suggestions with so-called shadow pipelines, hidden variants of the original pipeline that modify it to auto-detect potential issues, try out modifications for improvements, and suggest and explain these modifications to the user. We envision to apply incremental view maintenance-based optimisations to ensure low-latency computation and maintenance of the shadow pipelines. We conduct preliminary experiments to showcase the feasibility of our envisioned approach and the potential benefits of our proposed optimisations. ",
    "url": "https://arxiv.org/abs/2404.19591",
    "authors": [
      "Stefan Grafberger",
      "Paul Groth",
      "Sebastian Schelter"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.19596",
    "title": "Debiased Collaborative Filtering with Kernel-Based Causal Balancing",
    "abstract": "Debiased collaborative filtering aims to learn an unbiased prediction model by removing different biases in observational datasets. To solve this problem, one of the simple and effective methods is based on the propensity score, which adjusts the observational sample distribution to the target one by reweighting observed instances. Ideally, propensity scores should be learned with causal balancing constraints. However, existing methods usually ignore such constraints or implement them with unreasonable approximations, which may affect the accuracy of the learned propensity scores. To bridge this gap, in this paper, we first analyze the gaps between the causal balancing requirements and existing methods such as learning the propensity with cross-entropy loss or manually selecting functions to balance. Inspired by these gaps, we propose to approximate the balancing functions in reproducing kernel Hilbert space and demonstrate that, based on the universal property and representer theorem of kernel functions, the causal balancing constraints can be better satisfied. Meanwhile, we propose an algorithm that adaptively balances the kernel function and theoretically analyze the generalization error bound of our methods. We conduct extensive experiments to demonstrate the effectiveness of our methods, and to promote this research direction, we have released our project at https://github.com/haoxuanli-pku/ICLR24-Kernel-Balancing. ",
    "url": "https://arxiv.org/abs/2404.19596",
    "authors": [
      "Haoxuan Li",
      "Chunyuan Zheng",
      "Yanghao Xiao",
      "Peng Wu",
      "Zhi Geng",
      "Xu Chen",
      "Peng Cui"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19597",
    "title": "Transferring Troubles: Cross-Lingual Transferability of Backdoor Attacks  in LLMs with Instruction Tuning",
    "abstract": "The implications of backdoor attacks on English-centric large language models (LLMs) have been widely examined - such attacks can be achieved by embedding malicious behaviors during training and activated under specific conditions that trigger malicious outputs. However, the impact of backdoor attacks on multilingual models remains under-explored. Our research focuses on cross-lingual backdoor attacks against multilingual LLMs, particularly investigating how poisoning the instruction-tuning data in one or two languages can affect the outputs in languages whose instruction-tuning data was not poisoned. Despite its simplicity, our empirical analysis reveals that our method exhibits remarkable efficacy in models like mT5, BLOOM, and GPT-3.5-turbo, with high attack success rates, surpassing 95% in several languages across various scenarios. Alarmingly, our findings also indicate that larger models show increased susceptibility to transferable cross-lingual backdoor attacks, which also applies to LLMs predominantly pre-trained on English data, such as Llama2, Llama3, and Gemma. Moreover, our experiments show that triggers can still work even after paraphrasing, and the backdoor mechanism proves highly effective in cross-lingual response settings across 25 languages, achieving an average attack success rate of 50%. Our study aims to highlight the vulnerabilities and significant security risks present in current multilingual LLMs, underscoring the emergent need for targeted security measures. ",
    "url": "https://arxiv.org/abs/2404.19597",
    "authors": [
      "Xuanli He",
      "Jun Wang",
      "Qiongkai Xu",
      "Pasquale Minervini",
      "Pontus Stenetorp",
      "Benjamin I. P. Rubinstein",
      "Trevor Cohn"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.19605",
    "title": "Data-Driven Invertible Neural Surrogates of Atmospheric Transmission",
    "abstract": "We present a framework for inferring an atmospheric transmission profile from a spectral scene. This framework leverages a lightweight, physics-based simulator that is automatically tuned - by virtue of autodifferentiation and differentiable programming - to construct a surrogate atmospheric profile to model the observed data. We demonstrate utility of the methodology by (i) performing atmospheric correction, (ii) recasting spectral data between various modalities (e.g. radiance and reflectance at the surface and at the sensor), and (iii) inferring atmospheric transmission profiles, such as absorbing bands and their relative magnitudes. ",
    "url": "https://arxiv.org/abs/2404.19605",
    "authors": [
      "James Koch",
      "Brenda Forland",
      "Bruce Bernacki",
      "Timothy Doster",
      "Tegan Emerson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)"
    ]
  },
  {
    "id": "arXiv:2404.19630",
    "title": "Analyzing and Exploring Training Recipes for Large-Scale  Transformer-Based Weather Prediction",
    "abstract": "The rapid rise of deep learning (DL) in numerical weather prediction (NWP) has led to a proliferation of models which forecast atmospheric variables with comparable or superior skill than traditional physics-based NWP. However, among these leading DL models, there is a wide variance in both the training settings and architecture used. Further, the lack of thorough ablation studies makes it hard to discern which components are most critical to success. In this work, we show that it is possible to attain high forecast skill even with relatively off-the-shelf architectures, simple training procedures, and moderate compute budgets. Specifically, we train a minimally modified SwinV2 transformer on ERA5 data, and find that it attains superior forecast skill when compared against IFS. We present some ablations on key aspects of the training pipeline, exploring different loss functions, model sizes and depths, and multi-step fine-tuning to investigate their effect. We also examine the model performance with metrics beyond the typical ACC and RMSE, and investigate how the performance scales with model size. ",
    "url": "https://arxiv.org/abs/2404.19630",
    "authors": [
      "Jared D. Willard",
      "Peter Harrington",
      "Shashank Subramanian",
      "Ankur Mahesh",
      "Travis A. O'Brien",
      "William D. Collins"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19631",
    "title": "On Training a Neural Network to Explain Binaries",
    "abstract": "In this work, we begin to investigate the possibility of training a deep neural network on the task of binary code understanding. Specifically, the network would take, as input, features derived directly from binaries and output English descriptions of functionality to aid a reverse engineer in investigating the capabilities of a piece of closed-source software, be it malicious or benign. Given recent success in applying large language models (generative AI) to the task of source code summarization, this seems a promising direction. However, in our initial survey of the available datasets, we found nothing of sufficiently high quality and volume to train these complex models. Instead, we build our own dataset derived from a capture of Stack Overflow containing 1.1M entries. A major result of our work is a novel dataset evaluation method using the correlation between two distances on sample pairs: one distance in the embedding space of inputs and the other in the embedding space of outputs. Intuitively, if two samples have inputs close in the input embedding space, their outputs should also be close in the output embedding space. We found this Embedding Distance Correlation (EDC) test to be highly diagnostic, indicating that our collected dataset and several existing open-source datasets are of low quality as the distances are not well correlated. We proceed to explore the general applicability of EDC, applying it to a number of qualitatively known good datasets and a number of synthetically known bad ones and found it to be a reliable indicator of dataset value. ",
    "url": "https://arxiv.org/abs/2404.19631",
    "authors": [
      "Alexander Interrante-Grant",
      "Andy Davis",
      "Heather Preslier",
      "Tim Leek"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.19634",
    "title": "DF Louvain: Fast Incrementally Expanding Approach for Community  Detection on Dynamic Graphs",
    "abstract": "Community detection is the problem of recognizing natural divisions in networks. A relevant challenge in this problem is to find communities on rapidly evolving graphs. In this report we present our Parallel Dynamic Frontier (DF) Louvain algorithm, which given a batch update of edge deletions and insertions, incrementally identifies and processes an approximate set of affected vertices in the graph with minimal overhead, while using a novel approach of incrementally updating weighted-degrees of vertices and total edge weights of communities. We also present our parallel implementations of Naive-dynamic (ND) and Delta-screening (DS) Louvain. On a server with a 64-core AMD EPYC-7742 processor, our experiments show that DF Louvain obtains speedups of 179x, 7.2x, and 5.3x on real-world dynamic graphs, compared to Static, ND, and DS Louvain, respectively, and is 183x, 13.8x, and 8.7x faster, respectively, on large graphs with random batch updates. Moreover, DF Louvain improves its performance by 1.6x for every doubling of threads. ",
    "url": "https://arxiv.org/abs/2404.19634",
    "authors": [
      "Subhajit Sahu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2404.19640",
    "title": "Attacking Bayes: On the Adversarial Robustness of Bayesian Neural  Networks",
    "abstract": "Adversarial examples have been shown to cause neural networks to fail on a wide range of vision and language tasks, but recent work has claimed that Bayesian neural networks (BNNs) are inherently robust to adversarial perturbations. In this work, we examine this claim. To study the adversarial robustness of BNNs, we investigate whether it is possible to successfully break state-of-the-art BNN inference methods and prediction pipelines using even relatively unsophisticated attacks for three tasks: (1) label prediction under the posterior predictive mean, (2) adversarial example detection with Bayesian predictive uncertainty, and (3) semantic shift detection. We find that BNNs trained with state-of-the-art approximate inference methods, and even BNNs trained with Hamiltonian Monte Carlo, are highly susceptible to adversarial attacks. We also identify various conceptual and experimental errors in previous works that claimed inherent adversarial robustness of BNNs and conclusively demonstrate that BNNs and uncertainty-aware Bayesian prediction pipelines are not inherently robust against adversarial attacks. ",
    "url": "https://arxiv.org/abs/2404.19640",
    "authors": [
      "Yunzhen Feng",
      "Tim G. J. Rudner",
      "Nikolaos Tsilivis",
      "Julia Kempe"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2404.19651",
    "title": "Provably Robust Conformal Prediction with Improved Efficiency",
    "abstract": "Conformal prediction is a powerful tool to generate uncertainty sets with guaranteed coverage using any predictive model, under the assumption that the training and test data are i.i.d.. Recently, it has been shown that adversarial examples are able to manipulate conformal methods to construct prediction sets with invalid coverage rates, as the i.i.d. assumption is violated. To address this issue, a recent work, Randomized Smoothed Conformal Prediction (RSCP), was first proposed to certify the robustness of conformal prediction methods to adversarial noise. However, RSCP has two major limitations: (i) its robustness guarantee is flawed when used in practice and (ii) it tends to produce large uncertainty sets. To address these limitations, we first propose a novel framework called RSCP+ to provide provable robustness guarantee in evaluation, which fixes the issues in the original RSCP method. Next, we propose two novel methods, Post-Training Transformation (PTT) and Robust Conformal Training (RCT), to effectively reduce prediction set size with little computation overhead. Experimental results in CIFAR10, CIFAR100, and ImageNet suggest the baseline method only yields trivial predictions including full label set, while our methods could boost the efficiency by up to $4.36\\times$, $5.46\\times$, and $16.9\\times$ respectively and provide practical robustness guarantee. Our codes are available at https://github.com/Trustworthy-ML-Lab/Provably-Robust-Conformal-Prediction. ",
    "url": "https://arxiv.org/abs/2404.19651",
    "authors": [
      "Ge Yan",
      "Yaniv Romano",
      "Tsui-Wei Weng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19668",
    "title": "SQUAT: Stateful Quantization-Aware Training in Recurrent Spiking Neural  Networks",
    "abstract": "Weight quantization is used to deploy high-performance deep learning models on resource-limited hardware, enabling the use of low-precision integers for storage and computation. Spiking neural networks (SNNs) share the goal of enhancing efficiency, but adopt an 'event-driven' approach to reduce the power consumption of neural network inference. While extensive research has focused on weight quantization, quantization-aware training (QAT), and their application to SNNs, the precision reduction of state variables during training has been largely overlooked, potentially diminishing inference performance. This paper introduces two QAT schemes for stateful neurons: (i) a uniform quantization strategy, an established method for weight quantization, and (ii) threshold-centered quantization, which allocates exponentially more quantization levels near the firing threshold. Our results show that increasing the density of quantization levels around the firing threshold improves accuracy across several benchmark datasets. We provide an ablation analysis of the effects of weight and state quantization, both individually and combined, and how they impact models. Our comprehensive empirical evaluation includes full precision, 8-bit, 4-bit, and 2-bit quantized SNNs, using QAT, stateful QAT (SQUAT), and post-training quantization methods. The findings indicate that the combination of QAT and SQUAT enhance performance the most, but given the choice of one or the other, QAT improves performance by the larger degree. These trends are consistent all datasets. Our methods have been made available in our Python library snnTorch: https://github.com/jeshraghian/snntorch. ",
    "url": "https://arxiv.org/abs/2404.19668",
    "authors": [
      "Sreyes Venkatesh",
      "Razvan Marinescu",
      "Jason K. Eshraghian"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19671",
    "title": "ML-based handover prediction over a real O-RAN deployment using RAN  Intelligent controller",
    "abstract": "O-RAN introduces intelligent and flexible network control in all parts of the network. The use of controllers with open interfaces allow us to gather real time network measurements and make intelligent/informed decision. The work in this paper focuses on developing a use-case for open and reconfigurable networks to investigate the possibility to predict handover events and understand the value of such predictions for all stakeholders that rely on the communication network to conduct their business. We propose a Long-Short Term Memory Machine Learning approach that takes standard Radio Access Network measurements to predict handover events. The models were trained on real network data collected from a commercial O-RAN setup deployed in our OpenIreland testbed. Our results show that the proposed approach can be optimized for either recall or precision, depending on the defined application level objective. We also link the performance of the Machine Learning (ML) algorithm to the network operation cost. Our results show that ML-based matching between the required and available resources can reduce operational cost by more than 80%, compared to long term resource purchases. ",
    "url": "https://arxiv.org/abs/2404.19671",
    "authors": [
      "Merim Dzaferagic",
      "Bruno Missi Xavier",
      "Diarmuid Collins",
      "Vince D'Onofrio",
      "Magnos Martinello",
      "Marco Ruffini"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19673",
    "title": "Neural Controlled Differential Equations with Quantum Hidden Evolutions",
    "abstract": "We introduce a class of neural controlled differential equation inspired by quantum mechanics. Neural quantum controlled differential equations (NQDEs) model the dynamics by analogue of the Schr\\\"{o}dinger equation. Specifically, the hidden state represents the wave function, and its collapse leads to an interpretation of the classification probability. We implement and compare the results of four variants of NQDEs on a toy spiral classification problem. ",
    "url": "https://arxiv.org/abs/2404.19673",
    "authors": [
      "Lingyi Yang",
      "Zhen Shao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19677",
    "title": "A Comprehensive Analysis of Pegasus Spyware and Its Implications for  Digital Privacy and Security",
    "abstract": "This paper comprehensively analyzes the Pegasus spyware and its implications for digital privacy and security. The Israeli cyber intelligence company NSO Group's Pegasus has gained recognition as a potent surveillance tool capable of hacking into smartphones and extracting data without the user's knowledge [49], [50]. The research emphasizes the technical aspects of this spyware, its deployment methods, and the controversies surrounding its use. The research also emphasizes the growing worries surrounding digital privacy and security as a result of the prevalent use of advanced spyware. By delving into legal, ethical, and policy issues, the objective of this study is to deliver a holistic understanding of the challenges posed by Pegasus and similar spyware tools. Through a comprehensive examination of the subject, the paper presents potential solutions to mitigate the threats and protect users from invasive surveillance techniques. ",
    "url": "https://arxiv.org/abs/2404.19677",
    "authors": [
      "Karwan Kareem"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.19710",
    "title": "A rank decomposition for the topological classification of neural  representations",
    "abstract": "Neural networks can be thought of as applying a transformation to an input dataset. The way in which they change the topology of such a dataset often holds practical significance for many tasks, particularly those demanding non-homeomorphic mappings for optimal solutions, such as classification problems. In this work, we leverage the fact that neural networks are equivalent to continuous piecewise-affine maps, whose rank can be used to pinpoint regions in the input space that undergo non-homeomorphic transformations, leading to alterations in the topological structure of the input dataset. Our approach enables us to make use of the relative homology sequence, with which one can study the homology groups of the quotient of a manifold $\\mathcal{M}$ and a subset $A$, assuming some minimal properties on these spaces. As a proof of principle, we empirically investigate the presence of low-rank (topology-changing) affine maps as a function of network width and mean weight. We show that in randomly initialized narrow networks, there will be regions in which the (co)homology groups of a data manifold can change. As the width increases, the homology groups of the input manifold become more likely to be preserved. We end this part of our work by constructing highly non-random wide networks that do not have this property and relating this non-random regime to Dale's principle, which is a defining characteristic of biological neural networks. Finally, we study simple feedforward networks trained on MNIST, as well as on toy classification and regression tasks, and show that networks manipulate the topology of data differently depending on the continuity of the task they are trained on. ",
    "url": "https://arxiv.org/abs/2404.19710",
    "authors": [
      "Kosio Beshkov",
      "Gaute T. Einevoll"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Algebraic Topology (math.AT)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2404.19714",
    "title": "ThangDLU at #SMM4H 2024: Encoder-decoder models for classifying text  data on social disorders in children and adolescents",
    "abstract": "This paper describes our participation in Task 3 and Task 5 of the #SMM4H (Social Media Mining for Health) 2024 Workshop, explicitly targeting the classification challenges within tweet data. Task 3 is a multi-class classification task centered on tweets discussing the impact of outdoor environments on symptoms of social anxiety. Task 5 involves a binary classification task focusing on tweets reporting medical disorders in children. We applied transfer learning from pre-trained encoder-decoder models such as BART-base and T5-small to identify the labels of a set of given tweets. We also presented some data augmentation methods to see their impact on the model performance. Finally, the systems obtained the best F1 score of 0.627 in Task 3 and the best F1 score of 0.841 in Task 5. ",
    "url": "https://arxiv.org/abs/2404.19714",
    "authors": [
      "Hoang-Thang Ta",
      "Abu Bakar Siddiqur Rahman",
      "Lotfollah Najjar",
      "Alexander Gelbukh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.19715",
    "title": "Assessing LLMs in Malicious Code Deobfuscation of Real-world Malware  Campaigns",
    "abstract": "The integration of large language models (LLMs) into various pipelines is increasingly widespread, effectively automating many manual tasks and often surpassing human capabilities. Cybersecurity researchers and practitioners have recognised this potential. Thus, they are actively exploring its applications, given the vast volume of heterogeneous data that requires processing to identify anomalies, potential bypasses, attacks, and fraudulent incidents. On top of this, LLMs' advanced capabilities in generating functional code, comprehending code context, and summarising its operations can also be leveraged for reverse engineering and malware deobfuscation. To this end, we delve into the deobfuscation capabilities of state-of-the-art LLMs. Beyond merely discussing a hypothetical scenario, we evaluate four LLMs with real-world malicious scripts used in the notorious Emotet malware campaign. Our results indicate that while not absolutely accurate yet, some LLMs can efficiently deobfuscate such payloads. Thus, fine-tuning LLMs for this task can be a viable potential for future AI-powered threat intelligence pipelines in the fight against obfuscated malware. ",
    "url": "https://arxiv.org/abs/2404.19715",
    "authors": [
      "Constantinos Patsakis",
      "Fran Casino",
      "Nikolaos Lykousas"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.19729",
    "title": "A Framework for Leveraging Human Computation Gaming to Enhance Knowledge  Graphs for Accuracy Critical Generative AI Applications",
    "abstract": "External knowledge graphs (KGs) can be used to augment large language models (LLMs), while simultaneously providing an explainable knowledge base of facts that can be inspected by a human. This approach may be particularly valuable in domains where explainability is critical, like human trafficking data analysis. However, creating KGs can pose challenges. KGs parsed from documents may comprise explicit connections (those directly stated by a document) but miss implicit connections (those obvious to a human although not directly stated). To address these challenges, this preliminary research introduces the GAME-KG framework, standing for \"Gaming for Augmenting Metadata and Enhancing Knowledge Graphs.\" GAME-KG is a federated approach to modifying explicit as well as implicit connections in KGs by using crowdsourced feedback collected through video games. GAME-KG is shown through two demonstrations: a Unity test scenario from Dark Shadows, a video game that collects feedback on KGs parsed from US Department of Justice (DOJ) Press Releases on human trafficking, and a following experiment where OpenAI's GPT-4 is prompted to answer questions based on a modified and unmodified KG. Initial results suggest that GAME-KG can be an effective framework for enhancing KGs, while simultaneously providing an explainable set of structured facts verified by humans. ",
    "url": "https://arxiv.org/abs/2404.19729",
    "authors": [
      "Steph Buongiorno",
      "Corey Clark"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.19735",
    "title": "Selective Parallel Loading of Large-Scale Compressed Graphs with  ParaGrapher",
    "abstract": "Comprehensive evaluation is one of the basis of experimental science. In High-Performance Graph Processing, a thorough evaluation of contributions becomes more achievable by supporting common input formats over different frameworks. However, each framework creates its specific format, which may not support reading large-scale real-world graph datasets. This shows a demand for high-performance libraries capable of loading graphs to (i)~accelerate designing new graph algorithms, (ii)~to evaluate the contributions on a wide range of graph algorithms, and (iii)~to facilitate easy and fast comparison over different graph frameworks. To that end, we present ParaGrapher, a high-performance API and library for loading large-scale and compressed graphs. ParaGrapher supports different types of requests for accessing graphs in shared- and distributed-memory and out-of-core graph processing. We explain the design of ParaGrapher and present a performance model of graph decompression, which is used for evaluation of ParaGrapher over three storage types. Our evaluation shows that by decompressing compressed graphs in WebGraph format, ParaGrapher delivers up to 3.2 times speedup in loading and up to 5.2 times speedup in end-to-end execution in comparison to the binary and textual formats. ParaGrapher is available online on https://blogs.qub.ac.uk/DIPSA/ParaGrapher/. ",
    "url": "https://arxiv.org/abs/2404.19735",
    "authors": [
      "Mohsen Koohi Esfahani",
      "Marco D'Antonio",
      "Syed Ibtisam Tauhidi",
      "Thai Son Mai",
      "Hans Vandierendonck"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Performance (cs.PF)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.19737",
    "title": "Better & Faster Large Language Models via Multi-token Prediction",
    "abstract": "Large language models such as GPT and Llama are trained with a next-token prediction loss. In this work, we suggest that training language models to predict multiple future tokens at once results in higher sample efficiency. More specifically, at each position in the training corpus, we ask the model to predict the following n tokens using n independent output heads, operating on top of a shared model trunk. Considering multi-token prediction as an auxiliary training task, we measure improved downstream capabilities with no overhead in training time for both code and natural language models. The method is increasingly useful for larger model sizes, and keeps its appeal when training for multiple epochs. Gains are especially pronounced on generative benchmarks like coding, where our models consistently outperform strong baselines by several percentage points. Our 13B parameter models solves 12 % more problems on HumanEval and 17 % more on MBPP than comparable next-token models. Experiments on small algorithmic tasks demonstrate that multi-token prediction is favorable for the development of induction heads and algorithmic reasoning capabilities. As an additional benefit, models trained with 4-token prediction are up to 3 times faster at inference, even with large batch sizes. ",
    "url": "https://arxiv.org/abs/2404.19737",
    "authors": [
      "Fabian Gloeckle",
      "Badr Youbi Idrissi",
      "Baptiste Rozière",
      "David Lopez-Paz",
      "Gabriel Synnaeve"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.19744",
    "title": "PrivComp-KG : Leveraging Knowledge Graph and Large Language Models for  Privacy Policy Compliance Verification",
    "abstract": "Data protection and privacy is becoming increasingly crucial in the digital era. Numerous companies depend on third-party vendors and service providers to carry out critical functions within their operations, encompassing tasks such as data handling and storage. However, this reliance introduces potential vulnerabilities, as these vendors' security measures and practices may not always align with the standards expected by regulatory bodies. Businesses are required, often under the penalty of law, to ensure compliance with the evolving regulatory rules. Interpreting and implementing these regulations pose challenges due to their complexity. Regulatory documents are extensive, demanding significant effort for interpretation, while vendor-drafted privacy policies often lack the detail required for full legal compliance, leading to ambiguity. To ensure a concise interpretation of the regulatory requirements and compliance of organizational privacy policy with said regulations, we propose a Large Language Model (LLM) and Semantic Web based approach for privacy compliance. In this paper, we develop the novel Privacy Policy Compliance Verification Knowledge Graph, PrivComp-KG. It is designed to efficiently store and retrieve comprehensive information concerning privacy policies, regulatory frameworks, and domain-specific knowledge pertaining to the legal landscape of privacy. Using Retrieval Augmented Generation, we identify the relevant sections in a privacy policy with corresponding regulatory rules. This information about individual privacy policies is populated into the PrivComp-KG. Combining this with the domain context and rules, the PrivComp-KG can be queried to check for compliance with privacy policies by each vendor against relevant policy regulations. We demonstrate the relevance of the PrivComp-KG, by verifying compliance of privacy policy documents for various organizations. ",
    "url": "https://arxiv.org/abs/2404.19744",
    "authors": [
      "Leon Garza",
      "Lavanya Elluri",
      "Anantaa Kotal",
      "Aritran Piplai",
      "Deepti Gupta",
      "Anupam Joshi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.19756",
    "title": "KAN: Kolmogorov-Arnold Networks",
    "abstract": "Inspired by the Kolmogorov-Arnold representation theorem, we propose Kolmogorov-Arnold Networks (KANs) as promising alternatives to Multi-Layer Perceptrons (MLPs). While MLPs have fixed activation functions on nodes (\"neurons\"), KANs have learnable activation functions on edges (\"weights\"). KANs have no linear weights at all -- every weight parameter is replaced by a univariate function parametrized as a spline. We show that this seemingly simple change makes KANs outperform MLPs in terms of accuracy and interpretability. For accuracy, much smaller KANs can achieve comparable or better accuracy than much larger MLPs in data fitting and PDE solving. Theoretically and empirically, KANs possess faster neural scaling laws than MLPs. For interpretability, KANs can be intuitively visualized and can easily interact with human users. Through two examples in mathematics and physics, KANs are shown to be useful collaborators helping scientists (re)discover mathematical and physical laws. In summary, KANs are promising alternatives for MLPs, opening opportunities for further improving today's deep learning models which rely heavily on MLPs. ",
    "url": "https://arxiv.org/abs/2404.19756",
    "authors": [
      "Ziming Liu",
      "Yixuan Wang",
      "Sachin Vaidya",
      "Fabian Ruehle",
      "James Halverson",
      "Marin Soljačić",
      "Thomas Y. Hou",
      "Max Tegmark"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2404.19760",
    "title": "Lightplane: Highly-Scalable Components for Neural 3D Fields",
    "abstract": "Contemporary 3D research, particularly in reconstruction and generation, heavily relies on 2D images for inputs or supervision. However, current designs for these 2D-3D mapping are memory-intensive, posing a significant bottleneck for existing methods and hindering new applications. In response, we propose a pair of highly scalable components for 3D neural fields: Lightplane Render and Splatter, which significantly reduce memory usage in 2D-3D mapping. These innovations enable the processing of vastly more and higher resolution images with small memory and computational costs. We demonstrate their utility in various applications, from benefiting single-scene optimization with image-level losses to realizing a versatile pipeline for dramatically scaling 3D reconstruction and generation. Code: \\url{https://github.com/facebookresearch/lightplane}. ",
    "url": "https://arxiv.org/abs/2404.19760",
    "authors": [
      "Ang Cao",
      "Justin Johnson",
      "Andrea Vedaldi",
      "David Novotny"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2404.19075",
    "title": "Distributed Stochastic Optimization of a Neural Representation Network  for Time-Space Tomography Reconstruction",
    "abstract": "4D time-space reconstruction of dynamic events or deforming objects using X-ray computed tomography (CT) is an extremely ill-posed inverse problem. Existing approaches assume that the object remains static for the duration of several tens or hundreds of X-ray projection measurement images (reconstruction of consecutive limited-angle CT scans). However, this is an unrealistic assumption for many in-situ experiments that causes spurious artifacts and inaccurate morphological reconstructions of the object. To solve this problem, we propose to perform a 4D time-space reconstruction using a distributed implicit neural representation (DINR) network that is trained using a novel distributed stochastic training algorithm. Our DINR network learns to reconstruct the object at its output by iterative optimization of its network parameters such that the measured projection images best match the output of the CT forward measurement model. We use a continuous time and space forward measurement model that is a function of the DINR outputs at a sparsely sampled set of continuous valued object coordinates. Unlike existing state-of-the-art neural representation architectures that forward and back propagate through dense voxel grids that sample the object's entire time-space coordinates, we only propagate through the DINR at a small subset of object coordinates in each iteration resulting in an order-of-magnitude reduction in memory and compute for training. DINR leverages distributed computation across several compute nodes and GPUs to produce high-fidelity 4D time-space reconstructions even for extremely large CT data sizes. We use both simulated parallel-beam and experimental cone-beam X-ray CT datasets to demonstrate the superior performance of our approach. ",
    "url": "https://arxiv.org/abs/2404.19075",
    "authors": [
      "K. Aditya Mohan",
      "Massimiliano Ferrucci",
      "Chuck Divin",
      "Garrett A. Stevenson",
      "Hyojin Kim"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2404.19083",
    "title": "Longitudinal Mammogram Risk Prediction",
    "abstract": "Breast cancer is one of the leading causes of mortality among women worldwide. Early detection and risk assessment play a crucial role in improving survival rates. Therefore, annual or biennial mammograms are often recommended for screening in high-risk groups. Mammograms are typically interpreted by expert radiologists based on the Breast Imaging Reporting and Data System (BI-RADS), which provides a uniform way to describe findings and categorizes them to indicate the level of concern for breast cancer. Recently, machine learning (ML) and computational approaches have been developed to automate and improve the interpretation of mammograms. However, both BI-RADS and the ML-based methods focus on the analysis of data from the present and sometimes the most recent prior visit. While it is clear that temporal changes in image features of the longitudinal scans should carry value for quantifying breast cancer risk, no prior work has conducted a systematic study of this. In this paper, we extend a state-of-the-art ML model to ingest an arbitrary number of longitudinal mammograms and predict future breast cancer risk. On a large-scale dataset, we demonstrate that our model, LoMaR, achieves state-of-the-art performance when presented with only the present mammogram. Furthermore, we use LoMaR to characterize the predictive value of prior visits. Our results show that longer histories (e.g., up to four prior annual mammograms) can significantly boost the accuracy of predicting future breast cancer risk, particularly beyond the short-term. Our code and model weights are available at https://github.com/batuhankmkaraman/LoMaR. ",
    "url": "https://arxiv.org/abs/2404.19083",
    "authors": [
      "Batuhan K. Karaman",
      "Katerina Dodelzon",
      "Gozde B. Akar",
      "Mert R. Sabuncu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19157",
    "title": "Scalable Bayesian Inference in the Era of Deep Learning: From Gaussian  Processes to Deep Neural Networks",
    "abstract": "Large neural networks trained on large datasets have become the dominant paradigm in machine learning. These systems rely on maximum likelihood point estimates of their parameters, precluding them from expressing model uncertainty. This may result in overconfident predictions and it prevents the use of deep learning models for sequential decision making. This thesis develops scalable methods to equip neural networks with model uncertainty. In particular, we leverage the linearised Laplace approximation to equip pre-trained neural networks with the uncertainty estimates provided by their tangent linear models. This turns the problem of Bayesian inference in neural networks into one of Bayesian inference in conjugate Gaussian-linear models. Alas, the cost of this remains cubic in either the number of network parameters or in the number of observations times output dimensions. By assumption, neither are tractable. We address this intractability by using stochastic gradient descent (SGD) -- the workhorse algorithm of deep learning -- to perform posterior sampling in linear models and their convex duals: Gaussian processes. With this, we turn back to linearised neural networks, finding the linearised Laplace approximation to present a number of incompatibilities with modern deep learning practices -- namely, stochastic optimisation, early stopping and normalisation layers -- when used for hyperparameter learning. We resolve these and construct a sample-based EM algorithm for scalable hyperparameter learning with linearised neural networks. We apply the above methods to perform linearised neural network inference with ResNet-50 (25M parameters) trained on Imagenet (1.2M observations and 1000 output dimensions). Additionally, we apply our methods to estimate uncertainty for 3d tomographic reconstructions obtained with the deep image prior network. ",
    "url": "https://arxiv.org/abs/2404.19157",
    "authors": [
      "Javier Antoran"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19481",
    "title": "SpecstatOR: Speckle statistics-based iOCT Segmentation Network for  Ophthalmic Surgery",
    "abstract": "This paper presents an innovative approach to intraoperative Optical Coherence Tomography (iOCT) image segmentation in ophthalmic surgery, leveraging statistical analysis of speckle patterns to incorporate statistical pathology-specific prior knowledge. Our findings indicate statistically different speckle patterns within the retina and between retinal layers and surgical tools, facilitating the segmentation of previously unseen data without the necessity for manual labeling. The research involves fitting various statistical distributions to iOCT data, enabling the differentiation of different ocular structures and surgical tools. The proposed segmentation model aims to refine the statistical findings based on prior tissue understanding to leverage statistical and biological knowledge. Incorporating statistical parameters, physical analysis of light-tissue interaction, and deep learning informed by biological structures enhance segmentation accuracy, offering potential benefits to real-time applications in ophthalmic surgical procedures. The study demonstrates the adaptability and precision of using Gamma distribution parameters and the derived binary maps as sole inputs for segmentation, notably enhancing the model's inference performance on unseen data. ",
    "url": "https://arxiv.org/abs/2404.19481",
    "authors": [
      "Kristina Mach",
      "Hessam Roodaki",
      "Michael Sommersperger",
      "Nassir Navab"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.19557",
    "title": "Neural Dynamic Data Valuation",
    "abstract": "Data constitute the foundational component of the data economy and its marketplaces. Efficient and fair data valuation has emerged as a topic of significant interest.\\ Many approaches based on marginal contribution have shown promising results in various downstream tasks. However, they are well known to be computationally expensive as they require training a large number of utility functions, which are used to evaluate the usefulness or value of a given dataset for a specific purpose. As a result, it has been recognized as infeasible to apply these methods to a data marketplace involving large-scale datasets. Consequently, a critical issue arises: how can the re-training of the utility function be avoided? To address this issue, we propose a novel data valuation method from the perspective of optimal control, named the neural dynamic data valuation (NDDV). Our method has solid theoretical interpretations to accurately identify the data valuation via the sensitivity of the data optimal control state. In addition, we implement a data re-weighting strategy to capture the unique features of data points, ensuring fairness through the interaction between data points and the mean-field states. Notably, our method requires only training once to estimate the value of all data points, significantly improving the computational efficiency. We conduct comprehensive experiments using different datasets and tasks. The results demonstrate that the proposed NDDV method outperforms the existing state-of-the-art data valuation methods in accurately identifying data points with either high or low values and is more computationally efficient. ",
    "url": "https://arxiv.org/abs/2404.19557",
    "authors": [
      "Zhangyong Liang",
      "Huanhuan Gao",
      "Ji Zhang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.19689",
    "title": "Continuum limit of $p$-biharmonic equations on graphs",
    "abstract": "This paper studies the $p$-biharmonic equation on graphs, which arises in point cloud processing and can be interpreted as a natural extension of the graph $p$-Laplacian from the perspective of hypergraph. The asymptotic behavior of the solution is investigated when the random geometric graph is considered and the number of data points goes to infinity. We show that the continuum limit is an appropriately weighted $p$-biharmonic equation with homogeneous Neumann boundary conditions. The result relies on the uniform $L^p$ estimates for solutions and gradients of nonlocal and graph Poisson equations. The $L^\\infty$ estimates of solutions are also obtained as a byproduct. ",
    "url": "https://arxiv.org/abs/2404.19689",
    "authors": [
      "Kehan Shi",
      "Martin Burger"
    ],
    "subjectives": [
      "Analysis of PDEs (math.AP)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2404.19723",
    "title": "Attention-Constrained Inference for Robust Decoder-Only Text-to-Speech",
    "abstract": "Recent popular decoder-only text-to-speech models are known for their ability of generating natural-sounding speech. However, such models sometimes suffer from word skipping and repeating due to the lack of explicit monotonic alignment constraints. In this paper, we notice from the attention maps that some particular attention heads of the decoder-only model indicate the alignments between speech and text. We call the attention maps of those heads Alignment-Emerged Attention Maps (AEAMs). Based on this discovery, we propose a novel inference method without altering the training process, named Attention-Constrained Inference (ACI), to facilitate monotonic synthesis. It first identifies AEAMs using the Attention Sweeping algorithm and then applies constraining masks on AEAMs. Our experimental results on decoder-only TTS model VALL-E show that the WER of synthesized speech is reduced by up to 20.5% relatively with ACI while the naturalness and speaker similarity are comparable. ",
    "url": "https://arxiv.org/abs/2404.19723",
    "authors": [
      "Hankun Wang",
      "Chenpeng Du",
      "Yiwei Guo",
      "Shuai Wang",
      "Xie Chen",
      "Kai Yu"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2111.03683",
    "title": "On Homomorphism Graphs",
    "abstract": " Title: On Homomorphism Graphs ",
    "url": "https://arxiv.org/abs/2111.03683",
    "authors": [
      "Sebastian Brandt",
      "Yi-Jun Chang",
      "Jan Grebík",
      "Christoph Grunau",
      "Václav Rozhoň",
      "Zoltán Vidnyánszky"
    ],
    "subjectives": [
      "Logic (math.LO)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2203.01014",
    "title": "Cumulative Merging Percolation: A long-range percolation process in  networks",
    "abstract": " Comments: 12 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2203.01014",
    "authors": [
      "Lorenzo Cirigliano",
      "Giulio Cimini",
      "Romualdo Pastor-Satorras",
      "Claudio Castellano"
    ],
    "subjectives": [
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2205.08858",
    "title": "Tight Differential Privacy Guarantees for the Shuffle Model with  $k$-Randomized Response",
    "abstract": " Title: Tight Differential Privacy Guarantees for the Shuffle Model with  $k$-Randomized Response ",
    "url": "https://arxiv.org/abs/2205.08858",
    "authors": [
      "Sayan Biswas",
      "Kangsoo Jung",
      "Catuscia Palamidessi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2207.10170",
    "title": "Illusory Attacks: Detectability Matters in Adversarial Attacks on  Sequential Decision-Makers",
    "abstract": " Title: Illusory Attacks: Detectability Matters in Adversarial Attacks on  Sequential Decision-Makers ",
    "url": "https://arxiv.org/abs/2207.10170",
    "authors": [
      "Tim Franzmeyer",
      "Stephen McAleer",
      "João F. Henriques",
      "Jakob N. Foerster",
      "Philip H.S. Torr",
      "Adel Bibi",
      "Christian Schroeder de Witt"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.01554",
    "title": "Distributionally Robust Lyapunov Function Search Under Uncertainty",
    "abstract": " Comments: 5th Annual Learning for Dynamics & Control Conference ",
    "url": "https://arxiv.org/abs/2212.01554",
    "authors": [
      "Kehan Long",
      "Yinzhuang Yi",
      "Jorge Cortes",
      "Nikolay Atanasov"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.02368",
    "title": "Emergence of simple and complex contagion dynamics from weighted belief  networks",
    "abstract": " Title: Emergence of simple and complex contagion dynamics from weighted belief  networks ",
    "url": "https://arxiv.org/abs/2301.02368",
    "authors": [
      "Rachith Aiyappa",
      "Alessandro Flammini",
      "Yong-Yeol Ahn"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2303.02243",
    "title": "Neural Operator Learning for Long-Time Integration in Dynamical Systems  with Recurrent Neural Networks",
    "abstract": " Comments: 8 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2303.02243",
    "authors": [
      "Katarzyna Michałowska",
      "Somdatta Goswami",
      "George Em Karniadakis",
      "Signe Riemer-Sørensen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.07230",
    "title": "Systematic Evaluation of Deep Learning Models for Failure Prediction",
    "abstract": " Title: Systematic Evaluation of Deep Learning Models for Failure Prediction ",
    "url": "https://arxiv.org/abs/2303.07230",
    "authors": [
      "Fatemeh Hadadi",
      "Joshua H. Dawes",
      "Donghwan Shin",
      "Domenico Bianculli",
      "Lionel Briand"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2304.04664",
    "title": "Inductive biases in deep learning models for weather prediction",
    "abstract": " Title: Inductive biases in deep learning models for weather prediction ",
    "url": "https://arxiv.org/abs/2304.04664",
    "authors": [
      "Jannik Thuemmel",
      "Matthias Karlbauer",
      "Sebastian Otte",
      "Christiane Zarfl",
      "Georg Martius",
      "Nicole Ludwig",
      "Thomas Scholten",
      "Ulrich Friedrich",
      "Volker Wulfmeyer",
      "Bedartha Goswami",
      "Martin V. Butz"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.01658",
    "title": "A Non-autoregressive Multi-Horizon Flight Trajectory Prediction  Framework with Gray Code Representation",
    "abstract": " Comments: An extend version based on the AAAI version ",
    "url": "https://arxiv.org/abs/2305.01658",
    "authors": [
      "Dongyue Guo",
      "Zheng Zhang",
      "Zhen Yan",
      "Jianwei Zhang",
      "Yi Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.02149",
    "title": "A General Framework for Interpretable Neural Learning based on Local  Information-Theoretic Goal Functions",
    "abstract": " Comments: 26 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2306.02149",
    "authors": [
      "Abdullah Makkeh",
      "Marcel Graetz",
      "Andreas C. Schneider",
      "David A. Ehrlich",
      "Viola Priesemann",
      "Michael Wibral"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2306.06327",
    "title": "Any-dimensional equivariant neural networks",
    "abstract": " Comments: 21 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2306.06327",
    "authors": [
      "Eitan Levin",
      "Mateo Díaz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Representation Theory (math.RT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2306.06945",
    "title": "Underwater Acoustic Target Recognition based on Smoothness-inducing  Regularization and Spectrogram-based Data Augmentation",
    "abstract": " Title: Underwater Acoustic Target Recognition based on Smoothness-inducing  Regularization and Spectrogram-based Data Augmentation ",
    "url": "https://arxiv.org/abs/2306.06945",
    "authors": [
      "Ji Xu",
      "Yuan Xie",
      "Wenchao Wang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.08765",
    "title": "Causal Discovery from Time Series with Hybrids of Constraint-Based and  Noise-Based Algorithms",
    "abstract": " Comments: Accepted in TMLR: this https URL ",
    "url": "https://arxiv.org/abs/2306.08765",
    "authors": [
      "Daria Bystrova",
      "Charles K. Assaad",
      "Julyan Arbel",
      "Emilie Devijver",
      "Eric Gaussier",
      "Wilfried Thuiller"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.05590",
    "title": "Efficient Computation of Magnetic Polarizability Tensor Spectral  Signatures for Object Characterisation in Metal Detection",
    "abstract": " Comments: 25 pages, 18 figures. Updated to include new results and demonstrations of computational performance ",
    "url": "https://arxiv.org/abs/2307.05590",
    "authors": [
      "James Elgy",
      "Paul D. Ledger"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2308.00957",
    "title": "Causal Inference with Differentially Private (Clustered) Outcomes",
    "abstract": " Comments: 41 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2308.00957",
    "authors": [
      "Adel Javanmard",
      "Vahab Mirrokni",
      "Jean Pouget-Abadie"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2308.14250",
    "title": "Rule-Based Error Detection and Correction to Operationalize Movement  Trajectory Classification",
    "abstract": " Title: Rule-Based Error Detection and Correction to Operationalize Movement  Trajectory Classification ",
    "url": "https://arxiv.org/abs/2308.14250",
    "authors": [
      "Bowen Xi",
      "Kevin Scaria",
      "Paulo Shakarian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2309.10924",
    "title": "Change of Scenery: Unsupervised LiDAR Change Detection for Mobile Robots",
    "abstract": " Comments: 8 pages (7 content, 1 references). 7 figures, Presented at 2024 Conference on Robots and Vision (CRV) ",
    "url": "https://arxiv.org/abs/2309.10924",
    "authors": [
      "Alexander Krawciw",
      "Jordy Sehn",
      "Timothy D. Barfoot"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.11924",
    "title": "Generic Selfish Mining MDP for DAG Protocols",
    "abstract": " Comments: v2: update authors, fix my implementation of Roi's model ",
    "url": "https://arxiv.org/abs/2309.11924",
    "authors": [
      "Patrik Keller"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2310.16452",
    "title": "Faithful Path Language Modeling for Explainable Recommendation over  Knowledge Graph",
    "abstract": " Title: Faithful Path Language Modeling for Explainable Recommendation over  Knowledge Graph ",
    "url": "https://arxiv.org/abs/2310.16452",
    "authors": [
      "Giacomo Balloccu",
      "Ludovico Boratto",
      "Christian Cancedda",
      "Gianni Fenu",
      "Mirko Marras"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.01025",
    "title": "Integrating Language-Derived Appearance Elements with Visual Cues in  Pedestrian Detection",
    "abstract": " Title: Integrating Language-Derived Appearance Elements with Visual Cues in  Pedestrian Detection ",
    "url": "https://arxiv.org/abs/2311.01025",
    "authors": [
      "Sungjune Park",
      "Hyunjun Kim",
      "Yong Man Ro"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.07614",
    "title": "Application of a Dense Fusion Attention Network in Fault Diagnosis of  Centrifugal Fan",
    "abstract": " Comments: The research direction between authors needs to be adjusted, so the preprint is requested to be revoked ",
    "url": "https://arxiv.org/abs/2311.07614",
    "authors": [
      "Ruijun Wang",
      "Yuan Liu",
      "Zhixia Fan",
      "Xiaogang Xu",
      "Huijie Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07865",
    "title": "SimAC: A Simple Anti-Customization Method for Protecting Face Privacy  against Text-to-Image Synthesis of Diffusion Models",
    "abstract": " Title: SimAC: A Simple Anti-Customization Method for Protecting Face Privacy  against Text-to-Image Synthesis of Diffusion Models ",
    "url": "https://arxiv.org/abs/2312.07865",
    "authors": [
      "Feifei Wang",
      "Zhentao Tan",
      "Tianyi Wei",
      "Yue Wu",
      "Qidong Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09956",
    "title": "An artificial neural network approach to finding the key length of the  Vigenère cipher",
    "abstract": " Title: An artificial neural network approach to finding the key length of the  Vigenère cipher ",
    "url": "https://arxiv.org/abs/2312.09956",
    "authors": [
      "Christian Millichap",
      "Yeeka Yau"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.11793",
    "title": "An Effective Image Copy-Move Forgery Detection Using Entropy Information",
    "abstract": " Title: An Effective Image Copy-Move Forgery Detection Using Entropy Information ",
    "url": "https://arxiv.org/abs/2312.11793",
    "authors": [
      "Li Jiang",
      "Zhaowei Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computers and Society (cs.CY)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2312.12135",
    "title": "Object Detection for Automated Coronary Artery Using Deep Learning",
    "abstract": " Comments: The results in the article need fundamental corrections ",
    "url": "https://arxiv.org/abs/2312.12135",
    "authors": [
      "Hadis Keshavarz",
      "Hossein Sadr"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.13912",
    "title": "Solving Long-run Average Reward Robust MDPs via Stochastic Games",
    "abstract": " Title: Solving Long-run Average Reward Robust MDPs via Stochastic Games ",
    "url": "https://arxiv.org/abs/2312.13912",
    "authors": [
      "Krishnendu Chatterjee",
      "Ehsan Kafshdar Goharshady",
      "Mehrdad Karrabi",
      "Petr Novotný",
      "Đorđe Žikelić"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.11647",
    "title": "LW-FedSSL: Resource-efficient Layer-wise Federated Self-supervised  Learning",
    "abstract": " Title: LW-FedSSL: Resource-efficient Layer-wise Federated Self-supervised  Learning ",
    "url": "https://arxiv.org/abs/2401.11647",
    "authors": [
      "Ye Lin Tun",
      "Chu Myaet Thwal",
      "Le Quang Huy",
      "Minh N. H. Nguyen",
      "Choong Seon Hong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.13839",
    "title": "Edge-coloring sparse graphs with $Δ$ colors in quasilinear time",
    "abstract": " Comments: This version differs significantly from the previous one. Here, a partitioning technique of Zhou et al. has been applied, which simplified the randomized algorithm considerably and allowed for a deterministic algorithm, though with worse dependency on mad(G) than the randomized one ",
    "url": "https://arxiv.org/abs/2401.13839",
    "authors": [
      "Lukasz Kowalik"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2401.15583",
    "title": "SCTransNet: Spatial-channel Cross Transformer Network for Infrared Small  Target Detection",
    "abstract": " Title: SCTransNet: Spatial-channel Cross Transformer Network for Infrared Small  Target Detection ",
    "url": "https://arxiv.org/abs/2401.15583",
    "authors": [
      "Shuai Yuan",
      "Hanlin Qin",
      "Xiang Yan",
      "Naveed AKhtar",
      "Ajmal Mian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.06537",
    "title": "Feature Density Estimation for Out-of-Distribution Detection via  Normalizing Flows",
    "abstract": " Comments: Accepted to CRV 2024 ",
    "url": "https://arxiv.org/abs/2402.06537",
    "authors": [
      "Evan D. Cook",
      "Marc-Antoine Lavoie",
      "Steven L. Waslander"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.06665",
    "title": "The Essential Role of Causality in Foundation World Models for Embodied  AI",
    "abstract": " Title: The Essential Role of Causality in Foundation World Models for Embodied  AI ",
    "url": "https://arxiv.org/abs/2402.06665",
    "authors": [
      "Tarun Gupta",
      "Wenbo Gong",
      "Chao Ma",
      "Nick Pawlowski",
      "Agrin Hilmkil",
      "Meyer Scetbon",
      "Marc Rigter",
      "Ade Famoti",
      "Ashley Juan Llorens",
      "Jianfeng Gao",
      "Stefan Bauer",
      "Danica Kragic",
      "Bernhard Schölkopf",
      "Cheng Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2402.10321",
    "title": "LaserSAM: Zero-Shot Change Detection Using Visual Segmentation of  Spinning LiDAR",
    "abstract": " Comments: 9 pages (8 content, 1 references). 9 figures, Presented at 2024 Conference on Robots and Vision (CRV) ",
    "url": "https://arxiv.org/abs/2402.10321",
    "authors": [
      "Alexander Krawciw",
      "Sven Lilge",
      "Timothy D. Barfoot"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2402.10741",
    "title": "Identifying heterogeneous micromechanical properties of biological  tissues via physics-informed neural networks",
    "abstract": " Title: Identifying heterogeneous micromechanical properties of biological  tissues via physics-informed neural networks ",
    "url": "https://arxiv.org/abs/2402.10741",
    "authors": [
      "Wensi Wu",
      "Mitchell Daneker",
      "Kevin T. Turner",
      "Matthew A. Jolley",
      "Lu Lu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Biological Physics (physics.bio-ph)"
    ]
  },
  {
    "id": "arXiv:2402.11919",
    "title": "Unraveling Complex Data Diversity in Underwater Acoustic Target  Recognition through Convolution-based Mixture of Experts",
    "abstract": " Title: Unraveling Complex Data Diversity in Underwater Acoustic Target  Recognition through Convolution-based Mixture of Experts ",
    "url": "https://arxiv.org/abs/2402.11919",
    "authors": [
      "Yuan Xie",
      "Jiawei Ren",
      "Ji Xu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2402.12303",
    "title": "UncertaintyTrack: Exploiting Detection and Localization Uncertainty in  Multi-Object Tracking",
    "abstract": " Comments: Accepted to ICRA 2024 ",
    "url": "https://arxiv.org/abs/2402.12303",
    "authors": [
      "Chang Won Lee",
      "Steven L. Waslander"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2402.12365",
    "title": "Universal Physics Transformers: A Framework For Efficiently Scaling  Neural Operators",
    "abstract": " Title: Universal Physics Transformers: A Framework For Efficiently Scaling  Neural Operators ",
    "url": "https://arxiv.org/abs/2402.12365",
    "authors": [
      "Benedikt Alkin",
      "Andreas Fürst",
      "Simon Schmid",
      "Lukas Gruber",
      "Markus Holzleitner",
      "Johannes Brandstetter"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2402.17420",
    "title": "PANDAS: Prototype-based Novel Class Discovery and Detection",
    "abstract": " Comments: Accepted to the Conference on Lifelong Learning Agents (CoLLAs 2024) ",
    "url": "https://arxiv.org/abs/2402.17420",
    "authors": [
      "Tyler L. Hayes",
      "César R. de Souza",
      "Namil Kim",
      "Jiwon Kim",
      "Riccardo Volpi",
      "Diane Larlus"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.18370",
    "title": "Adversarial Example Soups: Improving Transferability and Stealthiness  for Free",
    "abstract": " Comments: Under review ",
    "url": "https://arxiv.org/abs/2402.18370",
    "authors": [
      "Bo Yang",
      "Hengwei Zhang",
      "Jindong Wang",
      "Yulong Yang",
      "Chenhao Lin",
      "Chao Shen",
      "Zhengyu Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04918",
    "title": "Secure Information Embedding and Extraction in Forensic 3D  Fingerprinting",
    "abstract": " Title: Secure Information Embedding and Extraction in Forensic 3D  Fingerprinting ",
    "url": "https://arxiv.org/abs/2403.04918",
    "authors": [
      "Canran Wang",
      "Jinwen Wang",
      "Mi Zhou",
      "Vinh Pham",
      "Senyue Hao",
      "Chao Zhou",
      "Ning Zhang",
      "Netanel Raviv"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.05000",
    "title": "Medical Speech Symptoms Classification via Disentangled Representation",
    "abstract": " Comments: Accepted by the 27th International Conference on Computer Supported Cooperative Work in Design (CSCWD 2024) ",
    "url": "https://arxiv.org/abs/2403.05000",
    "authors": [
      "Jianzong Wang",
      "Pengcheng Li",
      "Xulong Zhang",
      "Ning Cheng",
      "Jing Xiao"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05593",
    "title": "Introducing First-Principles Calculations: New Approach to Group  Dynamics and Bridging Social Phenomena in TeNP-Chain Based Social Dynamics  Simulations",
    "abstract": " Comments: TeNP Chains, First-principles calculations, Tellurium nanoparticles (TeNPs), Graphene, Fake news dissemination, Social cohesion, Information Flow Disruption, Quantum Mechanics, Interdisciplinary approach, Misinformation mitigation ",
    "url": "https://arxiv.org/abs/2403.05593",
    "authors": [
      "Yasuko Kawahata"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Artificial Intelligence (cs.AI)",
      "Physics Education (physics.ed-ph)"
    ]
  },
  {
    "id": "arXiv:2403.11585",
    "title": "Linguacodus: A Synergistic Framework for Transformative Code Generation  in Machine Learning Pipelines",
    "abstract": " Title: Linguacodus: A Synergistic Framework for Transformative Code Generation  in Machine Learning Pipelines ",
    "url": "https://arxiv.org/abs/2403.11585",
    "authors": [
      "Ekaterina Trofimova",
      "Emil Sataev",
      "Andrey E. Ustyuzhanin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Programming Languages (cs.PL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2403.14385",
    "title": "Estimating Causal Effects with Double Machine Learning -- A Method  Evaluation",
    "abstract": " Title: Estimating Causal Effects with Double Machine Learning -- A Method  Evaluation ",
    "url": "https://arxiv.org/abs/2403.14385",
    "authors": [
      "Jonathan Fuhr",
      "Philipp Berens",
      "Dominik Papies"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Econometrics (econ.EM)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2403.16771",
    "title": "Synthetic Data Generation and Joint Learning for Robust Code-Mixed  Translation",
    "abstract": " Comments: 9 pages, 2 figures, to be published in LREC-COLING 2024 ",
    "url": "https://arxiv.org/abs/2403.16771",
    "authors": [
      "Kartik Kartik",
      "Sanjana Soni",
      "Anoop Kunchukuttan",
      "Tanmoy Chakraborty",
      "Md Shad Akhtar"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.04496",
    "title": "Towards Better Graph Neural Network-based Fault Localization Through  Enhanced Code Representation",
    "abstract": " Title: Towards Better Graph Neural Network-based Fault Localization Through  Enhanced Code Representation ",
    "url": "https://arxiv.org/abs/2404.04496",
    "authors": [
      "Md Nakhla Rafi",
      "Dong Jae Kim",
      "An Ran Chen",
      "Tse-Hsun Chen",
      "Shaowei Wang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.06741",
    "title": "An Animation-based Augmentation Approach for Action Recognition from  Discontinuous Video",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2401.13414 ",
    "url": "https://arxiv.org/abs/2404.06741",
    "authors": [
      "Xingyu Song",
      "Zhan Li",
      "Shi Chen",
      "Xin-Qiang Cai",
      "Kazuyuki Demachi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.09709",
    "title": "Scenario-Adaptive Fine-Grained Personalization Network: Tailoring User  Behavior Representation to the Scenario Context",
    "abstract": " Comments: Accepted by SIGIR 2024, 10 pages, 5 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2404.09709",
    "authors": [
      "Moyu Zhang",
      "Yongxiang Tang",
      "Jinxin Hu",
      "Yu Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.10610",
    "title": "Shining Light into the Tunnel: Understanding and Classifying Network  Traffic of Residential Proxies",
    "abstract": " Title: Shining Light into the Tunnel: Understanding and Classifying Network  Traffic of Residential Proxies ",
    "url": "https://arxiv.org/abs/2404.10610",
    "authors": [
      "Ronghong Huang",
      "Dongfang Zhao",
      "Xianghang Mi",
      "Xiaofeng Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.10702",
    "title": "Retrieval Augmented Verification: Unveiling Disinformation with  Structured Representations for Zero-Shot Real-Time Evidence-guided  Fact-Checking of Multi-modal Social media posts",
    "abstract": " Title: Retrieval Augmented Verification: Unveiling Disinformation with  Structured Representations for Zero-Shot Real-Time Evidence-guided  Fact-Checking of Multi-modal Social media posts ",
    "url": "https://arxiv.org/abs/2404.10702",
    "authors": [
      "Arka Ujjal Dey",
      "Artemis Llabrés",
      "Ernest Valveny",
      "Dimosthenis Karatzas"
    ],
    "subjectives": [
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2404.12079",
    "title": "Trajectory Planning for Autonomous Vehicle Using Iterative Reward  Prediction in Reinforcement Learning",
    "abstract": " Comments: 8 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2404.12079",
    "authors": [
      "Hyunwoo Park"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2404.12538",
    "title": "TrACT: A Training Dynamics Aware Contrastive Learning Framework for  Long-tail Trajectory Prediction",
    "abstract": " Comments: 2024 IEEE Intelligent Vehicles Symposium (IV) ",
    "url": "https://arxiv.org/abs/2404.12538",
    "authors": [
      "Junrui Zhang",
      "Mozhgan Pourkeshavarz",
      "Amir Rasouli"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.16726",
    "title": "History repeats Itself: A Baseline for Temporal Knowledge Graph  Forecasting",
    "abstract": " Comments: Accepted at IJCAI 2024 ",
    "url": "https://arxiv.org/abs/2404.16726",
    "authors": [
      "Julia Gastinger",
      "Christian Meilicke",
      "Federico Errica",
      "Timo Sztyler",
      "Anett Schuelke",
      "Heiner Stuckenschmidt"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.17454",
    "title": "Domain Adaptive and Fine-grained Anomaly Detection for Single-cell  Sequencing Data and Beyond",
    "abstract": " Comments: 17 pages, 2 figures. Accepted by IJCAI 2024 ",
    "url": "https://arxiv.org/abs/2404.17454",
    "authors": [
      "Kaichen Xu",
      "Yueyang Ding",
      "Suyang Hou",
      "Weiqiang Zhan",
      "Nisang Chen",
      "Jun Wang",
      "Xiaobo Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2404.17489",
    "title": "Tabular Data Contrastive Learning via Class-Conditioned and  Feature-Correlation Based Augmentation",
    "abstract": " Comments: 14 pages, 4 algorithms, 3 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2404.17489",
    "authors": [
      "Wei Cui",
      "Rasa Hosseinzadeh",
      "Junwei Ma",
      "Tongzi Wu",
      "Yi Sui",
      "Keyvan Golestan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2404.18151",
    "title": "Decidability of Graph Neural Networks via Logical Characterizations",
    "abstract": " Title: Decidability of Graph Neural Networks via Logical Characterizations ",
    "url": "https://arxiv.org/abs/2404.18151",
    "authors": [
      "Michael Benedikt",
      "Chia-Hsuan Lu",
      "Boris Motik",
      "Tony Tan"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2404.18225",
    "title": "Quadruped robot traversing 3D complex environments with limited  perception",
    "abstract": " Comments: 10 pages, 8 figures,submitted to iros2024 ",
    "url": "https://arxiv.org/abs/2404.18225",
    "authors": [
      "Yi Cheng",
      "Hang Liu",
      "Guoping Pan",
      "Linqi Ye",
      "Houde Liu",
      "Bin Liang"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2404.18562",
    "title": "Time Reversal for Near-Field Communications on Multi-chip Wireless  Networks",
    "abstract": " Title: Time Reversal for Near-Field Communications on Multi-chip Wireless  Networks ",
    "url": "https://arxiv.org/abs/2404.18562",
    "authors": [
      "Fátima Rodríguez-Galán",
      "Ama Bandara",
      "Elana Pereira de Santana",
      "Peter Haring Bolívar",
      "Eduard Alarcón",
      "Sergi Abadal"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2404.18826",
    "title": "Winning the Social Media Influence Battle: Uncertainty-Aware Opinions to  Understand and Spread True Information via Competitive Influence Maximization",
    "abstract": " Comments: 8 pages, 3 figures, submitted to ASONAM 2024 ",
    "url": "https://arxiv.org/abs/2404.18826",
    "authors": [
      "Qi Zhang",
      "Lance M. Kaplan",
      "Audun Jøsang",
      "Dong Hyun. Jeong",
      "Feng Chen",
      "Jin-Hee Cho"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  }
]