[
  {
    "id": "arXiv:2206.10592",
    "title": "Identifying Electrocardiogram Abnormalities Using a  Handcrafted-Rule-Enhanced Neural Network",
    "abstract": "A large number of people suffer from life-threatening cardiac abnormalities, and electrocardiogram (ECG) analysis is beneficial to determining whether an individual is at risk of such abnormalities. Automatic ECG classification methods, especially the deep learning based ones, have been proposed to detect cardiac abnormalities using ECG records, showing good potential to improve clinical diagnosis and help early prevention of cardiovascular diseases. However, the predictions of the known neural networks still do not satisfactorily meet the needs of clinicians, and this phenomenon suggests that some information used in clinical diagnosis may not be well captured and utilized by these methods. In this paper, we introduce some rules into convolutional neural networks, which help present clinical knowledge to deep learning based ECG analysis, in order to improve automated ECG diagnosis performance. Specifically, we propose a Handcrafted-Rule-enhanced Neural Network (called HRNN) for ECG classification with standard 12-lead ECG input, which consists of a rule inference module and a deep learning module. Experiments on two large-scale public ECG datasets show that our new approach considerably outperforms existing state-of-the-art methods. Further, our proposed approach not only can improve the diagnosis performance, but also can assist in detecting mislabelled ECG samples. Our codes are available at https://github.com/alwaysbyx/ecg_processing. ",
    "url": "https://arxiv.org/abs/2206.10592",
    "authors": [
      "Yuexin Bian",
      "Jintai Chen",
      "Xiaojun Chen",
      "Xiaoxian Yang",
      "Danny Z. Chen",
      "JIan Wu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2206.10604",
    "title": "Artificial intelligence system based on multi-value classification of  fully connected neural network for construction management",
    "abstract": "This study is devoted to solving the problem to determine the professional adaptive capabilities of construction management staff using artificial intelligence systems.It is proposed Fully Connected Feed-Forward Neural Network architecture and performed empirical modeling to create a Data Set. Model of artificial intelligence system allows evaluating the processes in an Fully Connected Feed-Forward Neural Network during the execution of multi-value classification of professional areas. A method has been developed for the training process of a machine learning model, which reflects the internal connections between the components of an artificial intelligence system that allow it to learn from training data. To train the neural network, a data set of 35 input parameters and 29 output parameters was used; the amount of data in the set is 936 data lines. Neural network training occurred in the proportion of 10% and 90%, respectively. Results of this study research can be used to further improve the knowledge and skills necessary for successful professional realization. ",
    "url": "https://arxiv.org/abs/2206.10604",
    "authors": [
      "Tetyana Honcharenko",
      "Roman Akselrod",
      "Andrii Shpakov",
      "Oleksandr Khomenko"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.10611",
    "title": "Neural Activation Patterns (NAPs): Visual Explainability of Learned  Concepts",
    "abstract": "A key to deciphering the inner workings of neural networks is understanding what a model has learned. Promising methods for discovering learned features are based on analyzing activation values, whereby current techniques focus on analyzing high activation values to reveal interesting features on a neuron level. However, analyzing high activation values limits layer-level concept discovery. We present a method that instead takes into account the entire activation distribution. By extracting similar activation profiles within the high-dimensional activation space of a neural network layer, we find groups of inputs that are treated similarly. These input groups represent neural activation patterns (NAPs) and can be used to visualize and interpret learned layer concepts. We release a framework with which NAPs can be extracted from pre-trained models and provide a visual introspection tool that can be used to analyze NAPs. We tested our method with a variety of networks and show how it complements existing methods for analyzing neural network activation values. ",
    "url": "https://arxiv.org/abs/2206.10611",
    "authors": [
      "Alex Bäuerle",
      "Daniel Jönsson",
      "Timo Ropinski"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.10655",
    "title": "To What Extent Cognitive-Driven Development Improves Code Readability?",
    "abstract": "Cognitive-Driven Development (CDD) is a coding design technique that aims to reduce the cognitive effort that developers place in understanding a given code unit (e.g., a class). By following CDD design practices, it is expected that the coding units to be smaller, and, thus, easier to maintain and evolve. However, it is so far unknown whether these smaller code units coded using CDD standards are, indeed, easier to understand. In this work we aim to assess to what CDD improves code readability. To achieve this goal, we conducted a two-phase study. We start by inviting professional software developers to vote (and justify their rationale) on the most readable pair of code snippets (from a set of 10 pairs); one of the pairs was coded using CDD practices. We received 133 answers. In the second phase, we applied the state-of-the art readability model on the 10-pairs of CDD-guided refactorings. We observed some conflicting results. On the one hand, developers perceived that seven (out of 10) CDD-guided refactorings were more readable than their counterparts; for two other CDD-guided refactorings, developers were undecided, while only in one of the CDD-guided refactorings, developers preferred the original code snippet. On the other hand, we noticed that only one CDD-guided refactorings have better performance readability, assessed by state-of-the-art readability models. Our results provide initial evidence that CDD could be an interesting approach for software design. ",
    "url": "https://arxiv.org/abs/2206.10655",
    "authors": [
      "Leonardo Barbosa",
      "Victor Hugo Santiago",
      "Alberto Luiz Oliveira Tavares de Souza",
      "Gustavo Pinto"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2206.10665",
    "title": "BOSS: A Benchmark for Human Belief Prediction in Object-context  Scenarios",
    "abstract": "Humans with an average level of social cognition can infer the beliefs of others based solely on the nonverbal communication signals (e.g. gaze, gesture, pose and contextual information) exhibited during social interactions. This social cognitive ability to predict human beliefs and intentions is more important than ever for ensuring safe human-robot interaction and collaboration. This paper uses the combined knowledge of Theory of Mind (ToM) and Object-Context Relations to investigate methods for enhancing collaboration between humans and autonomous systems in environments where verbal communication is prohibited. We propose a novel and challenging multimodal video dataset for assessing the capability of artificial intelligence (AI) systems in predicting human belief states in an object-context scenario. The proposed dataset consists of precise labelling of human belief state ground-truth and multimodal inputs replicating all nonverbal communication inputs captured by human perception. We further evaluate our dataset with existing deep learning models and provide new insights into the effects of the various input modalities and object-context relations on the performance of the baseline models. ",
    "url": "https://arxiv.org/abs/2206.10665",
    "authors": [
      "Jiafei Duan",
      "Samson Yu",
      "Nicholas Tan",
      "Li Yi",
      "Cheston Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.10673",
    "title": "Natural Backdoor Datasets",
    "abstract": "Extensive literature on backdoor poison attacks has studied attacks and defenses for backdoors using \"digital trigger patterns.\" In contrast, \"physical backdoors\" use physical objects as triggers, have only recently been identified, and are qualitatively different enough to resist all defenses targeting digital trigger backdoors. Research on physical backdoors is limited by access to large datasets containing real images of physical objects co-located with targets of classification. Building these datasets is time- and labor-intensive. This works seeks to address the challenge of accessibility for research on physical backdoor attacks. We hypothesize that there may be naturally occurring physically co-located objects already present in popular datasets such as ImageNet. Once identified, a careful relabeling of these data can transform them into training samples for physical backdoor attacks. We propose a method to scalably identify these subsets of potential triggers in existing datasets, along with the specific classes they can poison. We call these naturally occurring trigger-class subsets natural backdoor datasets. Our techniques successfully identify natural backdoors in widely-available datasets, and produce models behaviorally equivalent to those trained on manually curated datasets. We release our code to allow the research community to create their own datasets for research on physical backdoor attacks. ",
    "url": "https://arxiv.org/abs/2206.10673",
    "authors": [
      "Emily Wenger",
      "Roma Bhattacharjee",
      "Arjun Nitin Bhagoji",
      "Josephine Passananti",
      "Emilio Andere",
      "Haitao Zheng",
      "Ben Y. Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2206.10681",
    "title": "Near-Linear $\\varepsilon$-Emulators for Planar Graphs",
    "abstract": "We study vertex sparsification for distances, in the setting of planar graphs with distortion: Given a planar graph $G$ (with edge weights) and a subset of $k$ terminal vertices, the goal is to construct an $\\varepsilon$-emulator, which is a small planar graph $G'$ that contains the terminals and preserves the distances between the terminals up to factor $1+\\varepsilon$. We construct the first $\\varepsilon$-emulators for planar graphs of near-linear size $\\tilde O(k/\\varepsilon^{O(1)})$. In terms of $k$, this is a dramatic improvement over the previous quadratic upper bound of Cheung, Goranci and Henzinger, and breaks below known quadratic lower bounds for exact emulators (the case when $\\varepsilon=0$). Moreover, our emulators can be computed in (near-)linear time, which lead to fast $(1+\\varepsilon)$-approximation algorithms for basic optimization problems on planar graphs, including multiple-source shortest paths, minimum $(s,t)$-cut, graph diameter, and dynamic distace oracle. ",
    "url": "https://arxiv.org/abs/2206.10681",
    "authors": [
      "Hsien-Chih Chang",
      "Robert Krauthgamer",
      "Zihan Tan"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Geometry (cs.CG)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2206.10691",
    "title": "Towards OOD Detection in Graph Classification from Uncertainty  Estimation Perspective",
    "abstract": "The problem of out-of-distribution detection for graph classification is far from being solved. The existing models tend to be overconfident about OOD examples or completely ignore the detection task. In this work, we consider this problem from the uncertainty estimation perspective and perform the comparison of several recently proposed methods. In our experiment, we find that there is no universal approach for OOD detection, and it is important to consider both graph representations and predictive categorical distribution. ",
    "url": "https://arxiv.org/abs/2206.10691",
    "authors": [
      "Gleb Bazhenov",
      "Sergei Ivanov",
      "Maxim Panov",
      "Alexey Zaytsev",
      "Evgeny Burnaev"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10692",
    "title": "Multi-level Domain Adaptation for Lane Detection",
    "abstract": "We focus on bridging domain discrepancy in lane detection among different scenarios to greatly reduce extra annotation and re-training costs for autonomous driving. Critical factors hinder the performance improvement of cross-domain lane detection that conventional methods only focus on pixel-wise loss while ignoring shape and position priors of lanes. To address the issue, we propose the Multi-level Domain Adaptation (MLDA) framework, a new perspective to handle cross-domain lane detection at three complementary semantic levels of pixel, instance and category. Specifically, at pixel level, we propose to apply cross-class confidence constraints in self-training to tackle the imbalanced confidence distribution of lane and background. At instance level, we go beyond pixels to treat segmented lanes as instances and facilitate discriminative features in target domain with triplet learning, which effectively rebuilds the semantic context of lanes and contributes to alleviating the feature confusion. At category level, we propose an adaptive inter-domain embedding module to utilize the position prior of lanes during adaptation. In two challenging datasets, ie TuSimple and CULane, our approach improves lane detection performance by a large margin with gains of 8.8% on accuracy and 7.4% on F1-score respectively, compared with state-of-the-art domain adaptation algorithms. ",
    "url": "https://arxiv.org/abs/2206.10692",
    "authors": [
      "Chenguang Li",
      "Boheng Zhang",
      "Jia Shi",
      "Guangliang Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10695",
    "title": "Exploring the Effectiveness of Self-supervised Learning and Classifier  Chains in Emotion Recognition of Nonverbal Vocalizations",
    "abstract": "We present an emotion recognition system for nonverbal vocalizations (NVs) submitted to the ExVo Few-Shot track of the ICML Expressive Vocalizations Competition 2022. The proposed method uses self-supervised learning (SSL) models to extract features from NVs and uses a classifier chain to model the label dependency between emotions. Experimental results demonstrate that the proposed method can significantly improve the performance of this task compared to several baseline methods. Our proposed method obtained a mean concordance correlation coefficient (CCC) of $0.725$ in the validation set and $0.739$ in the test set, while the best baseline method only obtained $0.554$ in the validation set. We publicate our code at https://github.com/Aria-K-Alethia/ExVo to help others to reproduce our experimental results. ",
    "url": "https://arxiv.org/abs/2206.10695",
    "authors": [
      "Detai Xin",
      "Shinnosuke Takamichi",
      "Hiroshi Saruwatari"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2206.10696",
    "title": "Epicasting: An Ensemble Wavelet Neural Network (EWNet) for Forecasting  Epidemics",
    "abstract": "Infectious diseases remain among the top contributors to human illness and death worldwide, among which many diseases produce epidemic waves of infection. The unavailability of specific drugs and ready-to-use vaccines to prevent most of these epidemics makes the situation worse. These force public health officials, health care providers, and policymakers to rely on early warning systems generated by reliable and accurate forecasts of epidemics. Accurate forecasts of epidemics can assist stakeholders in tailoring countermeasures, such as vaccination campaigns, staff scheduling, and resource allocation, to the situation at hand, which could translate to reductions in the impact of a disease. Unfortunately, most of these past epidemics (e.g., dengue, malaria, hepatitis, influenza, and most recent, Covid-19) exhibit nonlinear and non-stationary characteristics due to their spreading fluctuations based on seasonal-dependent variability and the nature of these epidemics. We analyze a wide variety of epidemic time series datasets using a maximal overlap discrete wavelet transform (MODWT) based autoregressive neural network and call it EWNet. MODWT techniques effectively characterize non-stationary behavior and seasonal dependencies in the epidemic time series and improve the forecasting scheme of the autoregressive neural network in the proposed ensemble wavelet network framework. From a nonlinear time series viewpoint, we explore the asymptotic stationarity of the proposed EWNet model to show the asymptotic behavior of the associated Markov Chain. We also theoretically investigate the effect of learning stability and the choice of hidden neurons in the proposed EWNet model. From a practical perspective, we compare our proposed EWNet framework with several statistical, machine learning, and deep learning models that have been previously used for epidemic forecasting. ",
    "url": "https://arxiv.org/abs/2206.10696",
    "authors": [
      "Madhurima Panja",
      "Tanujit Chakraborty",
      "Uttam Kumar",
      "Nan Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Chaotic Dynamics (nlin.CD)",
      "Populations and Evolution (q-bio.PE)",
      "Quantitative Methods (q-bio.QM)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2206.10697",
    "title": "Performance Prediction Under Dataset Shift",
    "abstract": "ML models deployed in production often have to face unknown domain changes, fundamentally different from their training settings. Performance prediction models carry out the crucial task of measuring the impact of these changes on model performance. We study the generalization capabilities of various performance prediction models to new domains by learning on generated synthetic perturbations. Empirical validation on a benchmark of ten tabular datasets shows that models based upon state-of-the-art shift detection metrics are not expressive enough to generalize to unseen domains, while Error Predictors bring a consistent improvement in performance prediction under shift. We additionally propose a natural and effortless uncertainty estimation of the predicted accuracy that ensures reliable use of performance predictors. Our implementation is available at https: //github.com/dataiku-research/performance_prediction_under_shift. ",
    "url": "https://arxiv.org/abs/2206.10697",
    "authors": [
      "Simona Maggio",
      "Victor Bouvier",
      "Léo Dreyfus-Schmidt"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10698",
    "title": "TiCo: Transformation Invariance and Covariance Contrast for  Self-Supervised Visual Representation Learning",
    "abstract": "We present Transformation Invariance and Covariance Contrast (TiCo) for self-supervised visual representation learning. Similar to other recent self-supervised learning methods, our method is based on maximizing the agreement among embeddings of different distorted versions of the same image, which pushes the encoder to produce transformation invariant representations. To avoid the trivial solution where the encoder generates constant vectors, we regularize the covariance matrix of the embeddings from different images by penalizing low rank solutions. By jointly minimizing the transformation invariance loss and covariance contrast loss, we get an encoder that is able to produce useful representations for downstream tasks. We analyze our method and show that it can be viewed as a variant of MoCo with an implicit memory bank of unlimited size at no extra memory cost. This makes our method perform better than alternative methods when using small batch sizes. TiCo can also be seen as a modification of Barlow Twins. By connecting the contrastive and redundancy-reduction methods together, TiCo gives us new insights into how joint embedding methods work. ",
    "url": "https://arxiv.org/abs/2206.10698",
    "authors": [
      "Jiachen Zhu",
      "Rafael M. Moraes",
      "Serkan Karakulak",
      "Vlad Sobol",
      "Alfredo Canziani",
      "Yann LeCun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10708",
    "title": "FlashSyn: Flash Loan Attack Synthesis via Counter Example Driven  Approximation",
    "abstract": "In decentralized finance (DeFi) ecosystem, lenders can offer flash loans to borrowers, i.e., loans that are only valid within a blockchain transaction and must be repaid with some fees by the end of that transaction. Unlike normal loans, flash loans allow borrowers to borrow a large amount of assets without upfront collaterals deposits. Malicious adversaries can use flash loans to gather large amount of assets to launch costly exploitations targeting DeFi protocols. In this paper, we introduce a new framework for automated synthesis of adversarial contracts that exploit DeFi protocols using flash loans. To bypass the complexity of a DeFi protocol, we propose a new technique to approximate DeFi protocol functional behaviors using numerical methods. Then, we propose a novel algorithm to find an adversarial attack which constitutes of a sequence of invocations of functions in a DeFi protocol with the optimized parameters for profits. We implemented our framework in a tool called FlashSyn. We run FlashSyn on 5 DeFi protocols that were victims to flash loan attacks and DeFi protocols from Damn Vulnerable DeFi challenges. FlashSyn automatically synthesizes an adversarial attack for each one of them. ",
    "url": "https://arxiv.org/abs/2206.10708",
    "authors": [
      "Zhiyang Chen",
      "Sidi Mohamed Beillahi",
      "Fan Long"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2206.10720",
    "title": "Predicting Team Performance with Spatial Temporal Graph Convolutional  Networks",
    "abstract": "This paper presents a new approach for predicting team performance from the behavioral traces of a set of agents. This spatiotemporal forecasting problem is very relevant to sports analytics challenges such as coaching and opponent modeling. We demonstrate that our proposed model, Spatial Temporal Graph Convolutional Networks (ST-GCN), outperforms other classification techniques at predicting game score from a short segment of player movement and game features. Our proposed architecture uses a graph convolutional network to capture the spatial relationships between team members and Gated Recurrent Units to analyze dynamic motion information. An ablative evaluation was performed to demonstrate the contributions of different aspects of our architecture. ",
    "url": "https://arxiv.org/abs/2206.10720",
    "authors": [
      "Shengnan Hu",
      "Gita Sukthankar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10745",
    "title": "Derivate Informed Neural Operator: An Efficient Framework for  High-Dimensional Parametric Derivative Learning",
    "abstract": "Neural operators have gained significant attention recently due to their ability to approximate high-dimensional parametric maps between function spaces. At present, only parametric function approximation has been addressed in the neural operator literature. In this work we investigate incorporating parametric derivative information in neural operator training; this information can improve function approximations, additionally it can be used to improve the approximation of the derivative with respect to the parameter, which is often the key to scalable solution of high-dimensional outer-loop problems (e.g. Bayesian inverse problems). Parametric Jacobian information is formally intractable to incorporate due to its high-dimensionality, to address this concern we propose strategies based on reduced SVD, randomized sketching and the use of reduced basis surrogates. All of these strategies only require only $O(r)$ Jacobian actions to construct sample Jacobian data, and allow us to reduce the linear algebra and memory costs associated with the Jacobian training from the product of the input and output dimensions down to $O(r^2)$, where $r$ is the dimensionality associated with the dimension reduction technique. Numerical results for parametric PDE problems demonstrate that the addition of derivative information to the training problem can significantly improve the parametric map approximation, particularly given few data. When Jacobian actions are inexpensive compared to the parametric map, this information can be economically substituted for parametric map data. Additionally we show that Jacobian error approximations improve significantly with the introduction of Jacobian training data. This result opens the door to the use of derivative informed neural operators (DINOs) in outer-loop algorithms where they can amortize the additional training data cost via repeated evaluations. ",
    "url": "https://arxiv.org/abs/2206.10745",
    "authors": [
      "Thomas O'Leary-Roseberry",
      "Peng Chen",
      "Umberto Villa",
      "Omar Ghattas"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2206.10781",
    "title": "Efficient and effective training of language and graph neural network  models",
    "abstract": "Can we combine heterogenous graph structure with text to learn high-quality semantic and behavioural representations? Graph neural networks (GNN)s encode numerical node attributes and graph structure to achieve impressive performance in a variety of supervised learning tasks. Current GNN approaches are challenged by textual features, which typically need to be encoded to a numerical vector before provided to the GNN that may incur some information loss. In this paper, we put forth an efficient and effective framework termed language model GNN (LM-GNN) to jointly train large-scale language models and graph neural networks. The effectiveness in our framework is achieved by applying stage-wise fine-tuning of the BERT model first with heterogenous graph information and then with a GNN model. Several system and design optimizations are proposed to enable scalable and efficient training. LM-GNN accommodates node and edge classification as well as link prediction tasks. We evaluate the LM-GNN framework in different datasets performance and showcase the effectiveness of the proposed approach. LM-GNN provides competitive results in an Amazon query-purchase-product application. ",
    "url": "https://arxiv.org/abs/2206.10781",
    "authors": [
      "Vassilis N. Ioannidis",
      "Xiang Song",
      "Da Zheng",
      "Houyu Zhang",
      "Jun Ma",
      "Yi Xu",
      "Belinda Zeng",
      "Trishul Chilimbi",
      "George Karypis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2206.10821",
    "title": "Coupling Visual Semantics of Artificial Neural Networks and Human Brain  Function via Synchronized Activations",
    "abstract": "Artificial neural networks (ANNs), originally inspired by biological neural networks (BNNs), have achieved remarkable successes in many tasks such as visual representation learning. However, whether there exists semantic correlations/connections between the visual representations in ANNs and those in BNNs remains largely unexplored due to both the lack of an effective tool to link and couple two different domains, and the lack of a general and effective framework of representing the visual semantics in BNNs such as human functional brain networks (FBNs). To answer this question, we propose a novel computational framework, Synchronized Activations (Sync-ACT), to couple the visual representation spaces and semantics between ANNs and BNNs in human brain based on naturalistic functional magnetic resonance imaging (nfMRI) data. With this approach, we are able to semantically annotate the neurons in ANNs with biologically meaningful description derived from human brain imaging for the first time. We evaluated the Sync-ACT framework on two publicly available movie-watching nfMRI datasets. The experiments demonstrate a) the significant correlation and similarity of the semantics between the visual representations in FBNs and those in a variety of convolutional neural networks (CNNs) models; b) the close relationship between CNN's visual representation similarity to BNNs and its performance in image classification tasks. Overall, our study introduces a general and effective paradigm to couple the ANNs and BNNs and provides novel insights for future studies such as brain-inspired artificial intelligence. ",
    "url": "https://arxiv.org/abs/2206.10821",
    "authors": [
      "Lin Zhao",
      "Haixing Dai",
      "Zihao Wu",
      "Zhenxiang Xiao",
      "Lu Zhang",
      "David Weizhong Liu",
      "Xintao Hu",
      "Xi Jiang",
      "Sheng Li",
      "Dajiang Zhu",
      "Tianming Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.10830",
    "title": "A Feature Memory Rearrangement Network for Visual Inspection of Textured  Surface Defects Toward Edge Intelligent Manufacturing",
    "abstract": "Recent advances in the industrial inspection of textured surfaces-in the form of visual inspection-have made such inspections possible for efficient, flexible manufacturing systems. We propose an unsupervised feature memory rearrangement network (FMR-Net) to accurately detect various textural defects simultaneously. Consistent with mainstream methods, we adopt the idea of background reconstruction; however, we innovatively utilize artificial synthetic defects to enable the model to recognize anomalies, while traditional wisdom relies only on defect-free samples. First, we employ an encoding module to obtain multiscale features of the textured surface. Subsequently, a contrastive-learning-based memory feature module (CMFM) is proposed to obtain discriminative representations and construct a normal feature memory bank in the latent space, which can be employed as a substitute for defects and fast anomaly scores at the patch level. Next, a novel global feature rearrangement module (GFRM) is proposed to further suppress the reconstruction of residual defects. Finally, a decoding module utilizes the restored features to reconstruct the normal texture background. In addition, to improve inspection performance, a two-phase training strategy is utilized for accurate defect restoration refinement, and we exploit a multimodal inspection method to achieve noise-robust defect localization. We verify our method through extensive experiments and test its practical deployment in collaborative edge--cloud intelligent manufacturing scenarios by means of a multilevel detection method, demonstrating that FMR-Net exhibits state-of-the-art inspection accuracy and shows great potential for use in edge-computing-enabled smart industries. ",
    "url": "https://arxiv.org/abs/2206.10830",
    "authors": [
      "Haiming Yao",
      "Wenyong Yu",
      "Xue Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.10833",
    "title": "Robust Bayesian Recourse",
    "abstract": "Algorithmic recourse aims to recommend an informative feedback to overturn an unfavorable machine learning decision. We introduce in this paper the Bayesian recourse, a model-agnostic recourse that minimizes the posterior probability odds ratio. Further, we present its min-max robust counterpart with the goal of hedging against future changes in the machine learning model parameters. The robust counterpart explicitly takes into account possible perturbations of the data in a Gaussian mixture ambiguity set prescribed using the optimal transport (Wasserstein) distance. We show that the resulting worst-case objective function can be decomposed into solving a series of two-dimensional optimization subproblems, and the min-max recourse finding problem is thus amenable to a gradient descent algorithm. Contrary to existing methods for generating robust recourses, the robust Bayesian recourse does not require a linear approximation step. The numerical experiment demonstrates the effectiveness of our proposed robust Bayesian recourse facing model shifts. Our code is available at https://github.com/VinAIResearch/robust-bayesian-recourse. ",
    "url": "https://arxiv.org/abs/2206.10833",
    "authors": [
      "Tuan-Duy H. Nguyen",
      "Ngoc Bui",
      "Duy Nguyen",
      "Man-Chung Yue",
      "Viet Anh Nguyen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10835",
    "title": "Interpreting Graph-based Sybil Detection Methods as Low-Pass Filtering",
    "abstract": "Online social networks (OSNs) are threatened by Sybil attacks, which create fake accounts (also called Sybils) on OSNs and use them for various malicious activities. Therefore, Sybil detection is a fundamental task for OSN security. Most existing Sybil detection methods are based on the graph structure of OSNs, and various methods have been proposed recently. However, although almost all methods have been compared experimentally in terms of detection performance and noise robustness, theoretical understanding of them is still lacking. In this study, we show that existing graph-based Sybil detection methods can be interpreted in a unified framework of low-pass filtering. This framework enables us to theoretically compare and analyze each method from two perspectives: filter kernel properties and the spectrum of shift matrices. Our analysis reveals that the detection performance of each method depends on how well low-pass filtering can extract low frequency components and remove noisy high frequency components. Furthermore, on the basis of the analysis, we propose a novel Sybil detection method called SybilHeat. Numerical experiments on synthetic graphs and real social networks demonstrate that SybilHeat performs consistently well on graphs with various structural properties. This study lays a theoretical foundation for graph-based Sybil detection and leads to a better understanding of Sybil detection methods. ",
    "url": "https://arxiv.org/abs/2206.10835",
    "authors": [
      "Satoshi Furutani",
      "Toshiki Shibahara",
      "Mitsuaki Akiyama",
      "Masaki Aida"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2206.10839",
    "title": "Proximity Graph Maintenance for Fast Online Nearest Neighbor Search",
    "abstract": "Approximate Nearest Neighbor (ANN) search is a fundamental technique for (e.g.,) the deployment of recommender systems. Recent studies bring proximity graph-based methods into practitioners' attention -- proximity graph-based methods outperform other solutions such as quantization, hashing, and tree-based ANN algorithm families. In current recommendation systems, data point insertions, deletions, and queries are streamed into the system in an online fashion as users and items change dynamically. As proximity graphs are constructed incrementally by inserting data points as new vertices into the graph, online insertions and queries are well-supported in proximity graph. However, a data point deletion incurs removing a vertex from the proximity graph index, while no proper graph index updating mechanisms are discussed in previous studies. To tackle the challenge, we propose an incremental proximity graph maintenance (IPGM) algorithm for online ANN. IPGM supports both vertex deletion and insertion on proximity graphs. Given a vertex deletion request, we thoroughly investigate solutions to update the connections of the vertex. The proposed updating scheme eliminates the performance drop in online ANN methods on proximity graphs, making the algorithm suitable for practical systems. ",
    "url": "https://arxiv.org/abs/2206.10839",
    "authors": [
      "Zhaozhuo Xu",
      "Weijie Zhao",
      "Shulong Tan",
      "Zhixin Zhou",
      "Ping Li"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2206.10844",
    "title": "Quantization Robust Federated Learning for Efficient Inference on  Heterogeneous Devices",
    "abstract": "Federated Learning (FL) is a machine learning paradigm to distributively learn machine learning models from decentralized data that remains on-device. Despite the success of standard Federated optimization methods, such as Federated Averaging (FedAvg) in FL, the energy demands and hardware induced constraints for on-device learning have not been considered sufficiently in the literature. Specifically, an essential demand for on-device learning is to enable trained models to be quantized to various bit-widths based on the energy needs and heterogeneous hardware designs across the federation. In this work, we introduce multiple variants of federated averaging algorithm that train neural networks robust to quantization. Such networks can be quantized to various bit-widths with only limited reduction in full precision model accuracy. We perform extensive experiments on standard FL benchmarks to evaluate our proposed FedAvg variants for quantization robustness and provide a convergence analysis for our Quantization-Aware variants in FL. Our results demonstrate that integrating quantization robustness results in FL models that are significantly more robust to different bit-widths during quantized on-device inference. ",
    "url": "https://arxiv.org/abs/2206.10844",
    "authors": [
      "Kartik Gupta",
      "Marios Fournarakis",
      "Matthias Reisser",
      "Christos Louizos",
      "Markus Nagel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2206.10858",
    "title": "Robust Universal Adversarial Perturbations",
    "abstract": "Universal Adversarial Perturbations (UAPs) are imperceptible, image-agnostic vectors that cause deep neural networks (DNNs) to misclassify inputs from a data distribution with high probability. Existing methods do not create UAPs robust to transformations, thereby limiting their applicability as a real-world attacks. In this work, we introduce a new concept and formulation of robust universal adversarial perturbations. Based on our formulation, we build a novel, iterative algorithm that leverages probabilistic robustness bounds for generating UAPs robust against transformations generated by composing arbitrary sub-differentiable transformation functions. We perform an extensive evaluation on the popular CIFAR-10 and ILSVRC 2012 datasets measuring robustness under human-interpretable semantic transformations, such as rotation, contrast changes, etc, that are common in the real-world. Our results show that our generated UAPs are significantly more robust than those from baselines. ",
    "url": "https://arxiv.org/abs/2206.10858",
    "authors": [
      "Changming Xu",
      "Gagandeep Singh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2206.10864",
    "title": "Robust mixed finite element methods for a quad-curl singular  perturbation problem",
    "abstract": "Robust mixed finite element methods are developed for a quad-curl singular perturbation problem. Lower order H(grad curl)-nonconforming but H(curl)-conforming finite elements are constructed, which are extended to nonconforming finite element Stokes complexes and the associated commutative diagrams. Then H(grad curl)-nonconforming finite elements are employed to discretize the quad-curl singular perturbation problem, which possess the sharp and uniform error estimates with respect to the perturbation parameter. The Nitsche's technique is exploited to achieve the optimal convergence rate in the case of the boundary layers. Numerical results are provided to verify the theoretical convergence rates. In addition, the regularity of the quad-curl singular perturbation problem is established. ",
    "url": "https://arxiv.org/abs/2206.10864",
    "authors": [
      "Xuehai Huang",
      "Chao Zhang"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2206.10875",
    "title": "Guided Diffusion Model for Adversarial Purification from Random Noise",
    "abstract": "In this paper, we propose a novel guided diffusion purification approach to provide a strong defense against adversarial attacks. Our model achieves 89.62% robust accuracy under PGD-L_inf attack (eps = 8/255) on the CIFAR-10 dataset. We first explore the essential correlations between unguided diffusion models and randomized smoothing, enabling us to apply the models to certified robustness. The empirical results show that our models outperform randomized smoothing by 5% when the certified L2 radius r is larger than 0.5. ",
    "url": "https://arxiv.org/abs/2206.10875",
    "authors": [
      "Quanlin Wu",
      "Hang Ye",
      "Yuntian Gu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2206.10879",
    "title": "Symmetric Network with Spatial Relationship Modeling for Natural  Language-based Vehicle Retrieval",
    "abstract": "Natural language (NL) based vehicle retrieval aims to search specific vehicle given text description. Different from the image-based vehicle retrieval, NL-based vehicle retrieval requires considering not only vehicle appearance, but also surrounding environment and temporal relations. In this paper, we propose a Symmetric Network with Spatial Relationship Modeling (SSM) method for NL-based vehicle retrieval. Specifically, we design a symmetric network to learn the unified cross-modal representations between text descriptions and vehicle images, where vehicle appearance details and vehicle trajectory global information are preserved. Besides, to make better use of location information, we propose a spatial relationship modeling methods to take surrounding environment and mutual relationship between vehicles into consideration. The qualitative and quantitative experiments verify the effectiveness of the proposed method. We achieve 43.92% MRR accuracy on the test set of the 6th AI City Challenge on natural language-based vehicle retrieval track, yielding the 1st place among all valid submissions on the public leaderboard. The code is available at https://github.com/hbchen121/AICITY2022_Track2_SSM. ",
    "url": "https://arxiv.org/abs/2206.10879",
    "authors": [
      "Chuyang Zhao",
      "Haobo Chen",
      "Wenyuan Zhang",
      "Junru Chen",
      "Sipeng Zhang",
      "Yadong Li",
      "Boxun Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.10885",
    "title": "KiloNeuS: Implicit Neural Representations with Real-Time Global  Illumination",
    "abstract": "The latest trends in inverse rendering techniques for reconstruction use neural networks to learn 3D representations as neural fields. NeRF-based techniques fit multi-layer perceptrons (MLPs) to a set of training images to estimate a radiance field which can then be rendered from any virtual camera by means of volume rendering algorithms. Major drawbacks of these representations are the lack of well-defined surfaces and non-interactive rendering times, as wide and deep MLPs must be queried millions of times per single frame. These limitations have recently been singularly overcome, but managing to accomplish this simultaneously opens up new use cases. We present KiloNeuS, a new neural object representation that can be rendered in path-traced scenes at interactive frame rates. KiloNeuS enables the simulation of realistic light interactions between neural and classic primitives in shared scenes, and it demonstrably performs in real-time with plenty of room for future optimizations and extensions. ",
    "url": "https://arxiv.org/abs/2206.10885",
    "authors": [
      "Stefano Esposito",
      "Daniele Baieri",
      "Stefan Zellmann",
      "André Hinkenjann",
      "Emanuele Rodolà"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10886",
    "title": "Optical Flow Regularization of Implicit Neural Representations for Video  Frame Interpolation",
    "abstract": "Recent works have shown the ability of Implicit Neural Representations (INR) to carry meaningful representations of signal derivatives. In this work, we leverage this property to perform Video Frame Interpolation (VFI) by explicitly constraining the derivatives of the INR to satisfy the optical flow constraint equation. We achieve state of the art VFI on limited motion ranges using only a target video and its optical flow, without learning the interpolation operator from additional training data. We further show that constraining the INR derivatives not only allows to better interpolate intermediate frames but also improves the ability of narrow networks to fit the observed frames, which suggests potential applications to video compression and INR optimization. ",
    "url": "https://arxiv.org/abs/2206.10886",
    "authors": [
      "Weihao Zhuang",
      "Tristan Hascoet",
      "Ryoichi Takashima",
      "Tetsuya Takiguchi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10891",
    "title": "Exploring the Impact of Code Style in Identifying Good Programmers",
    "abstract": "Code style reflects the choice of textual representation of source code. This study, for the first time, explores whether code style can be used to identify good programmers with a vision that recruitment process in the software industry can be improved. For analysis, solutions from Google Code Jam were selected. The study used cluster analysis to find association between good programmers and style clusters. Furthermore, supervised machine learning models were trained with stylistic features to predict good programmers. Results reveal that, although association between programmers with particular clusters could not be concluded, supervised learning models can predict good programmers. ",
    "url": "https://arxiv.org/abs/2206.10891",
    "authors": [
      "Rafed Muhammad Yasir",
      "Ahmedul Kabir"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2206.10892",
    "title": "I^2R-Net: Intra- and Inter-Human Relation Network for Multi-Person Pose  Estimation",
    "abstract": "In this paper, we present the Intra- and Inter-Human Relation Networks (I^2R-Net) for Multi-Person Pose Estimation. It involves two basic modules. First, the Intra-Human Relation Module operates on a single person and aims to capture Intra-Human dependencies. Second, the Inter-Human Relation Module considers the relation between multiple instances and focuses on capturing Inter-Human interactions. The Inter-Human Relation Module can be designed very lightweight by reducing the resolution of feature map, yet learn useful relation information to significantly boost the performance of the Intra-Human Relation Module. Even without bells and whistles, our method can compete or outperform current competition winners. We conduct extensive experiments on COCO, CrowdPose, and OCHuman datasets. The results demonstrate that the proposed model surpasses all the state-of-the-art methods. Concretely, the proposed method achieves 77.4% AP on CrowPose dataset and 67.8% AP on OCHuman dataset respectively, outperforming existing methods by a large margin. Additionally, the ablation study and visualization analysis also prove the effectiveness of our model. ",
    "url": "https://arxiv.org/abs/2206.10892",
    "authors": [
      "Yiwei Ding",
      "Wenjin Deng",
      "Yinglin Zheng",
      "Pengfei Liu",
      "Meihong Wang",
      "Xuan Cheng",
      "Jianmin Bao",
      "Dong Chen",
      "Ming Zeng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.10897",
    "title": "How to Combine Variational Bayesian Networks in Federated Learning",
    "abstract": "Federated Learning enables multiple data centers to train a central model collaboratively without exposing any confidential data. Even though deterministic models are capable of performing high prediction accuracy, their lack of calibration and capability to quantify uncertainty is problematic for safety-critical applications. Different from deterministic models, probabilistic models such as Bayesian neural networks are relatively well-calibrated and able to quantify uncertainty alongside their competitive prediction accuracy. Both of the approaches appear in the federated learning framework; however, the aggregation scheme of deterministic models cannot be directly applied to probabilistic models since weights correspond to distributions instead of point estimates. In this work, we study the effects of various aggregation schemes for variational Bayesian neural networks. With empirical results on three image classification datasets, we observe that the degree of spread for an aggregated distribution is a significant factor in the learning process. Hence, we present an investigation on the question of how to combine variational Bayesian networks in federated learning, while providing benchmarks for different aggregation settings. ",
    "url": "https://arxiv.org/abs/2206.10897",
    "authors": [
      "Atahan Ozer",
      "Kadir Burak Buldu",
      "Abdullah Akgül",
      "Gozde Unal"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.10898",
    "title": "HybridRAM: The first quantum approach for key recovery attacks on  Rainbow",
    "abstract": "A rectangular MinRank attack, proposed by Ward Beullens in 2021, reduced the security of Rainbow below the security requirements set out by NIST. If quantum algorithms are applied to perform repeated operations in this attack, the rectangular MinRank attacks may be more threatening and dramatically lower the security level of Rainbow. In this paper, we propose a Hybrid Rank Attack Model called HybridRAM that reduces the computation complexity of rank-based attacks by applying Grover's quantum search algorithm. We also design a Grover oracle quantum circuit suitable for the rectangular MinRank attack and then propose a Hybrid Rectangular MinRank attack that recovers the keys of Rainbow using the designed quantum circuit. We show that even the parameter set V of Rainbow does not fall short of the 128-bit security level, the minimum security requirement. It means that Rainbow is no longer secure in quantum computing environments. ",
    "url": "https://arxiv.org/abs/2206.10898",
    "authors": [
      "Seong-Min Cho",
      "Aeyoung Kim",
      "Seung-Hyun Seo"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2206.10902",
    "title": "S2TNet: Spatio-Temporal Transformer Networks for Trajectory Prediction  in Autonomous Driving",
    "abstract": "To safely and rationally participate in dense and heterogeneous traffic, autonomous vehicles require to sufficiently analyze the motion patterns of surrounding traffic-agents and accurately predict their future trajectories. This is challenging because the trajectories of traffic-agents are not only influenced by the traffic-agents themselves but also by spatial interaction with each other. Previous methods usually rely on the sequential step-by-step processing of Long Short-Term Memory networks (LSTMs) and merely extract the interactions between spatial neighbors for single type traffic-agents. We propose the Spatio-Temporal Transformer Networks (S2TNet), which models the spatio-temporal interactions by spatio-temporal Transformer and deals with the temporel sequences by temporal Transformer. We input additional category, shape and heading information into our networks to handle the heterogeneity of traffic-agents. The proposed methods outperforms state-of-the-art methods on ApolloScape Trajectory dataset by more than 7\\% on both the weighted sum of Average and Final Displacement Error. Our code is available at https://github.com/chenghuang66/s2tnet. ",
    "url": "https://arxiv.org/abs/2206.10902",
    "authors": [
      "Weihuang Chen",
      "Fangfang Wang",
      "Hongbin Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2206.10910",
    "title": "SpA-Former: Transformer image shadow detection and removal via spatial  attention",
    "abstract": "In this paper, we propose an end-to-end SpA-Former to recover a shadow-free image from a single shaded image. Unlike traditional methods that require two steps for shadow detection and then shadow removal, the SpA-Former unifies these steps into one, which is a one-stage network capable of directly learning the mapping function between shadows and no shadows, it does not require a separate shadow detection. Thus, SpA-former is adaptable to real image de-shadowing for shadows projected on different semantic regions. SpA-Former consists of transformer layer and a series of joint Fourier transform residual blocks and two-wheel joint spatial attention. The network in this paper is able to handle the task while achieving a very fast processing efficiency. Our code is relased on https://github.com/ zhangbaijin/Spatial-Transformer-shadow-removal ",
    "url": "https://arxiv.org/abs/2206.10910",
    "authors": [
      "Xiao Feng Zhang",
      "Chao Chen Gu",
      "Shan Ying Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10915",
    "title": "Understanding the effect of sparsity on neural networks robustness",
    "abstract": "This paper examines the impact of static sparsity on the robustness of a trained network to weight perturbations, data corruption, and adversarial examples. We show that, up to a certain sparsity achieved by increasing network width and depth while keeping the network capacity fixed, sparsified networks consistently match and often outperform their initially dense versions. Robustness and accuracy decline simultaneously for very high sparsity due to loose connectivity between network layers. Our findings show that a rapid robustness drop caused by network compression observed in the literature is due to a reduced network capacity rather than sparsity. ",
    "url": "https://arxiv.org/abs/2206.10915",
    "authors": [
      "Lukas Timpl",
      "Rahim Entezari",
      "Hanie Sedghi",
      "Behnam Neyshabur",
      "Olga Saukh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.10927",
    "title": "Exploration of User Privacy in 802.11 Probe Requests with MAC Address  Randomization Using Temporal Pattern Analysis",
    "abstract": "Wireless networks have become an integral part of our daily lives and lately there is increased concern about privacy and protecting the identity of individual users. In this paper we address the evolution of privacy measures in Wi-Fi probe request frames. We focus on the lack of privacy measures before the implementation of MAC Address Randomization, and on the way anti-tracking measures evolved throughout the last decade. We do not try to reverse MAC address randomization to get the real ad-dress of the device, but instead analyse the possibility of further tracking/localization without needing the real MAC address of the specific users. To gain better analysis results, we introduce temporal pattern matching approach to identification of devices using randomized MAC addresses. ",
    "url": "https://arxiv.org/abs/2206.10927",
    "authors": [
      "Tomas Bravenec",
      "Joaquín Torres-Sospedra",
      "Michael Gould",
      "Tomas Fryza"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2206.10939",
    "title": "Evaluation of Embedding Models for Automatic Extraction and  Classification of Acknowledged Entities in Scientific Documents",
    "abstract": "Acknowledgments in scientific papers may give an insight into aspects of the scientific community, such as reward systems, collaboration patterns, and hidden research trends. The aim of the paper is to evaluate the performance of different embedding models for the task of automatic extraction and classification of acknowledged entities from the acknowledgment text in scientific papers. We trained and implemented a named entity recognition (NER) task using the Flair NLP-framework. The training was conducted using three default Flair NER models with two differently-sized corpora. The Flair Embeddings model trained on the larger training corpus showed the best accuracy of 0.77. Our model is able to recognize six entity types: funding agency, grant number, individuals, university, corporation and miscellaneous. The model works more precise for some entity types than the others, thus, individuals and grant numbers showed very good F1-Score over 0.9. Most of the previous works on acknowledgement analysis were limited by the manual evaluation of data and therefore by the amount of processed data. This model can be applied for the comprehensive analysis of the acknowledgement texts and may potentially make a great contribution to the field of automated acknowledgement analysis. ",
    "url": "https://arxiv.org/abs/2206.10939",
    "authors": [
      "Nina Smirnova",
      "Philipp Mayr"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Digital Libraries (cs.DL)"
    ]
  },
  {
    "id": "arXiv:2206.10941",
    "title": "The Robust Gait of a Tilt-rotor and Its Application to Tracking Control  -- Application of Two Color Map Theorem",
    "abstract": "Rylls tilt-rotor is a UAV with eight inputs; the four magnitudes of the thrusts as well as four tilting angles of the thrusts can be specified in need, e.g., based on a control rule. Despite of the success in simulation, conventional feedback linearization witnesses the over-intensive change in the inputs while applying to stabilize Rylls tilt-rotor. Our previous research thus put the extra procedure named gait plan forward to suppress the unexpected changes in the tilting angles. Accompanying the Two Color Map Theorem, the tilting-angles are planned robustly and continuously. The designed gaits are robust to the change of the attitude. However, this is not a complete theory before further applying to the tracking simulation test. This paper further discusses some gaits following the Two Color Map Theorem and simulates a tracking problem for a tilt-rotor. A uniform circular moving reference is designed to be tracked by the tilt-rotor equipped with the designed robust gait and the feedback linearization controller. The gaits satisfying Two Color Map Theorem show the robustness. The results from the simulation show the success in tracking of the tilt-rotor. ",
    "url": "https://arxiv.org/abs/2206.10941",
    "authors": [
      "Zhe Shen",
      "Takeshi Tsuchiya"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2206.10952",
    "title": "Social Network Community Detection Based on Textual Content Similarity  and Sentimental Tendency",
    "abstract": "Shared travel has gradually become one of the hot topics discussed on social networking platforms such as Micro Blog. In a timely manner, deeper network community detection on the evaluation content of shared travel in social networks can effectively conduct research and analysis on the public opinion orientation related to shared travel, which has great application prospects. The existing community detection algorithms generally measure the similarity of nodes in the network from the perspective of spatial distance. This paper proposes a Community detection algorithm based on Textual content Similarity and sentimental Tendency (CTST), considering the network structure and node attributes at the same time. The content similarity and sentimental tendency of network community users are taken as node attributes, and on this basis, an undirected weighted network is constructed for community detection. This paper conducts experiments with actual data and analyzes the experimental results. It is found that the modularity of the community detection results is high and the effect is good. ",
    "url": "https://arxiv.org/abs/2206.10952",
    "authors": [
      "Jie Gao",
      "Junping Du",
      "Yingxia Shao",
      "Ang Li",
      "Zeli Guan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2206.10959",
    "title": "Defect Prediction Using Stylistic Metrics",
    "abstract": "Defect prediction is one of the most popular research topics due to its potential to minimize software quality assurance efforts. Existing approaches have examined defect prediction from various perspectives such as complexity and developer metrics. However, none of these consider programming style for defect prediction. This paper aims at analyzing the impact of stylistic metrics on both within-project and crossproject defect prediction. For prediction, 4 widely used machine learning algorithms namely Naive Bayes, Support Vector Machine, Decision Tree and Logistic Regression are used. The experiment is conducted on 14 releases of 5 popular, open source projects. F1, Precision and Recall are inspected to evaluate the results. Results reveal that stylistic metrics are a good predictor of defects. ",
    "url": "https://arxiv.org/abs/2206.10959",
    "authors": [
      "Rafed Muhammad Yasir",
      "Moumita Asad",
      "Ahmedul Kabir"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10965",
    "title": "Polar Parametrization for Vision-based Surround-View 3D Detection",
    "abstract": "3D detection based on surround-view camera system is a critical technique in autopilot. In this work, we present Polar Parametrization for 3D detection, which reformulates position parametrization, velocity decomposition, perception range, label assignment and loss function in polar coordinate system. Polar Parametrization establishes explicit associations between image patterns and prediction targets, exploiting the view symmetry of surround-view cameras as inductive bias to ease optimization and boost performance. Based on Polar Parametrization, we propose a surround-view 3D DEtection TRansformer, named PolarDETR. PolarDETR achieves promising performance-speed trade-off on different backbone configurations. Besides, PolarDETR ranks 1st on the leaderboard of nuScenes benchmark in terms of both 3D detection and 3D tracking at the submission time (Mar. 4th, 2022). Code will be released at \\url{https://github.com/hustvl/PolarDETR}. ",
    "url": "https://arxiv.org/abs/2206.10965",
    "authors": [
      "Shaoyu Chen",
      "Xinggang Wang",
      "Tianheng Cheng",
      "Qian Zhang",
      "Chang Huang",
      "Wenyu Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.10967",
    "title": "Audience Response Prediction from Textual Context",
    "abstract": "Humans' perception system closely monitors audio-visual cues during multiparty interactions to react timely and naturally. Learning to predict timing and type of reaction responses during human-human interactions may help us to enrich human-computer interaction applications. In this paper we consider a presenter-audience setting and define an audience response prediction task from the presenter's textual speech. The task is formulated as a binary classification problem as occurrence and absence of response after the presenter's textual speech. We use the BERT model as our classifier and investigate models with different textual contexts under causal and non-causal prediction settings. While the non-causal textual context, one sentence preceding and one sentence following the response event, can hugely improve the accuracy of predictions, we showed that longer textual contexts with causal settings attain UAR and $F1$-Score improvements matching and exceeding the non-causal textual context performance within the experimental evaluations on the OPUS and TED datasets. ",
    "url": "https://arxiv.org/abs/2206.10967",
    "authors": [
      "Ibrahim Shoer",
      "Berker Turker",
      "Engin Erzin"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2206.10969",
    "title": "Single Morphing Attack Detection using Siamese Network and Few-shot  Learning",
    "abstract": "Face morphing attack detection is challenging and presents a concrete and severe threat for face verification systems. Reliable detection mechanisms for such attacks, which have been tested with a robust cross-database protocol and unknown morphing tools still is a research challenge. This paper proposes a framework following the Few-Shot-Learning approach that shares image information based on the siamese network using triplet-semi-hard-loss to tackle the morphing attack detection and boost the clustering classification process. This network compares a bona fide or potentially morphed image with triplets of morphing and bona fide face images. Our results show that this new network cluster the data points, and assigns them to classes in order to obtain a lower equal error rate in a cross-database scenario sharing only small image numbers from an unknown database. Few-shot learning helps to boost the learning process. Experimental results using a cross-datasets trained with FRGCv2 and tested with FERET and the AMSL open-access databases reduced the BPCER10 from 43% to 4.91% using ResNet50 and 5.50% for MobileNetV2. ",
    "url": "https://arxiv.org/abs/2206.10969",
    "authors": [
      "Juan Tapia",
      "Daniel Schulz",
      "Christoph Busch"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.10983",
    "title": "Traffic Congestion Prediction Using Machine Learning Techniques",
    "abstract": "The prediction of traffic congestion can serve a crucial role in making future decisions. Although many studies have been conducted regarding congestion, most of these could not cover all the important factors (e.g., weather conditions). We proposed a prediction model for traffic congestion that can predict congestion based on day, time and several weather data (e.g., temperature, humidity). To evaluate our model, it has been tested against the traffic data of New Delhi. With this model, congestion of a road can be predicted one week ahead with an average RMSE of 1.12. Therefore, this model can be used to take preventive measure beforehand. ",
    "url": "https://arxiv.org/abs/2206.10983",
    "authors": [
      "Moumita Asad",
      "Rafed Muhammad Yasir",
      "Dr. Naushin Nower",
      "Dr. Mohammad Shoyaib"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2206.10987",
    "title": "Human-AI communication for human-human communication: Applying  interpretable unsupervised anomaly detection to executive coaching",
    "abstract": "In this paper, we discuss the potential of applying unsupervised anomaly detection in constructing AI-based interactive systems that deal with highly contextual situations, i.e., human-human communication, in collaboration with domain experts. We reached this approach of utilizing unsupervised anomaly detection through our experience of developing a computational support tool for executive coaching, which taught us the importance of providing interpretable results so that expert coaches can take both the results and contexts into account. The key idea behind this approach is to leave room for expert coaches to unleash their open-ended interpretations, rather than simplifying the nature of social interactions to well-defined problems that are tractable by conventional supervised algorithms. In addition, we found that this approach can be extended to nurturing novice coaches; by prompting them to interpret the results from the system, it can provide the coaches with educational opportunities. Although the applicability of this approach should be validated in other domains, we believe that the idea of leveraging unsupervised anomaly detection to construct AI-based interactive systems would shed light on another direction of human-AI communication. ",
    "url": "https://arxiv.org/abs/2206.10987",
    "authors": [
      "Riku Arakawa",
      "Hiromu Yakura"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.10988",
    "title": "AdvSmo: Black-box Adversarial Attack by Smoothing Linear Structure of  Texture",
    "abstract": "Black-box attacks usually face two problems: poor transferability and the inability to evade the adversarial defense. To overcome these shortcomings, we create an original approach to generate adversarial examples by smoothing the linear structure of the texture in the benign image, called AdvSmo. We construct the adversarial examples without relying on any internal information to the target model and design the imperceptible-high attack success rate constraint to guide the Gabor filter to select appropriate angles and scales to smooth the linear texture from the input images to generate adversarial examples. Benefiting from the above design concept, AdvSmo will generate adversarial examples with strong transferability and solid evasiveness. Finally, compared to the four advanced black-box adversarial attack methods, for the eight target models, the results show that AdvSmo improves the average attack success rate by 9% on the CIFAR-10 and 16% on the Tiny-ImageNet dataset compared to the best of these attack methods. ",
    "url": "https://arxiv.org/abs/2206.10988",
    "authors": [
      "Hui Xia",
      "Rui Zhang",
      "Shuliang Jiang",
      "Zi Kang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.10989",
    "title": "Identity Documents Authentication based on Forgery Detection of  Guilloche Pattern",
    "abstract": "In cases such as digital enrolment via mobile and online services, identity document verification is critical in order to efficiently detect forgery and therefore build user trust in the digital world. In this paper, an authentication model for identity documents based on forgery detection of guilloche patterns is proposed. The proposed approach is made up of two steps: feature extraction and similarity measure between a pair of feature vectors of identity documents. The feature extraction step involves learning the similarity between a pair of identity documents via a convolutional neural network (CNN) architecture and ends by extracting highly discriminative features between them. While, the similarity measure step is applied to decide if a given identity document is authentic or forged. In this work, these two steps are combined together to achieve two objectives: (i) extracted features should have good anticollision (discriminative) capabilities to distinguish between a pair of identity documents belonging to different classes, (ii) checking out the conformity of the guilloche pattern of a given identity document and its similarity to the guilloche pattern of an authentic version of the same country. Experiments are conducted in order to analyze and identify the most proper parameters to achieve higher authentication performance. The experimental results are performed on the MIDV-2020 dataset. The results show the ability of the proposed approach to extract the relevant characteristics of the processed pair of identity documents in order to model the guilloche patterns, and thus distinguish them correctly. The implementation code and the forged dataset are provided here (https://drive.google.com/id-FDGP-1) ",
    "url": "https://arxiv.org/abs/2206.10989",
    "authors": [
      "Musab Al-Ghadi",
      "Zuheng Ming",
      "Petra Gomez-Krämer",
      "Jean-Christophe Burie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2206.10991",
    "title": "Graph Neural Networks as Gradient Flows",
    "abstract": "Dynamical systems minimizing an energy are ubiquitous in geometry and physics. We propose a gradient flow framework for GNNs where the equations follow the direction of steepest descent of a learnable energy. This approach allows to explain the GNN evolution from a multi-particle perspective as learning attractive and repulsive forces in feature space via the positive and negative eigenvalues of a symmetric \"channel-mixing\" matrix. We perform spectral analysis of the solutions and conclude that gradient flow graph convolutional models can induce a dynamics dominated by the graph high frequencies which is desirable for heterophilic datasets. We also describe structural constraints on common GNN architectures allowing to interpret them as gradient flows. We perform thorough ablation studies corroborating our theoretical analysis and show competitive performance of simple and lightweight models on real-world homophilic and heterophilic datasets. ",
    "url": "https://arxiv.org/abs/2206.10991",
    "authors": [
      "Francesco Di Giovanni",
      "James Rowbottom",
      "Benjamin P. Chamberlain",
      "Thomas Markovich",
      "Michael M. Bronstein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2206.10999",
    "title": "Neural Networks as Paths through the Space of Representations",
    "abstract": "Deep neural networks implement a sequence of layer-by-layer operations that are each relatively easy to understand, but the resulting overall computation is generally difficult to understand. We develop a simple idea for interpreting the layer-by-layer construction of useful representations: the role of each layer is to reformat information to reduce the \"distance\" to the target outputs. We formalize this intuitive idea of \"distance\" by leveraging recent work on metric representational similarity, and show how it leads to a rich space of geometric concepts. With this framework, the layer-wise computation implemented by a deep neural network can be viewed as a path in a high-dimensional representation space. We develop tools to characterize the geometry of these in terms of distances, angles, and geodesics. We then ask three sets of questions of residual networks trained on CIFAR-10: (1) how straight are paths, and how does each layer contribute towards the target? (2) how do these properties emerge over training? and (3) how similar are the paths taken by wider versus deeper networks? We conclude by sketching additional ways that this kind of representational geometry can be used to understand and interpret network training, or to prescriptively improve network architectures to suit a task. ",
    "url": "https://arxiv.org/abs/2206.10999",
    "authors": [
      "Richard D. Lange",
      "Jordan Matelsky",
      "Xinyue Wang",
      "Devin Kwok",
      "David S. Rolnick",
      "Konrad P. Kording"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2206.11004",
    "title": "Auto-Encoding Adversarial Imitation Learning",
    "abstract": "Reinforcement learning (RL) provides a powerful framework for decision-making, but its application in practice often requires a carefully designed reward function. Adversarial Imitation Learning (AIL) sheds light on automatic policy acquisition without access to the reward signal from the environment. In this work, we propose Auto-Encoding Adversarial Imitation Learning (AEAIL), a robust and scalable AIL framework. To induce expert policies from demonstrations, AEAIL utilizes the reconstruction error of an auto-encoder as a reward signal, which provides more information for optimizing policies than the prior discriminator-based ones. Subsequently, we use the derived objective functions to train the auto-encoder and the agent policy. Experiments show that our AEAIL performs superior compared to state-of-the-art methods in the MuJoCo environments. More importantly, AEAIL shows much better robustness when the expert demonstrations are noisy. Specifically, our method achieves $16.4\\%$ and $47.2\\%$ relative improvement overall compared to the best baseline FAIRL and PWIL on clean and noisy expert data, respectively. Video results, open-source code and dataset are available in https://sites.google.com/view/auto-encoding-imitation. ",
    "url": "https://arxiv.org/abs/2206.11004",
    "authors": [
      "Kaifeng Zhang",
      "Rui Zhao",
      "Ziming Zhang",
      "Yang Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.11010",
    "title": "Agent-based Graph Neural Networks",
    "abstract": "We present a novel graph neural network we call AgentNet, which is designed specifically for graph-level tasks. AgentNet is inspired by sublinear algorithms, featuring a computational complexity that is independent of the graph size. The architecture of AgentNet differs fundamentally from the architectures of known graph neural networks. In AgentNet, some trained \\textit{neural agents} intelligently walk the graph, and then collectively decide on the output. We provide an extensive theoretical analysis of AgentNet: We show that the agents can learn to systematically explore their neighborhood and that AgentNet can distinguish some structures that are even indistinguishable by 3-WL. Moreover, AgentNet is able to separate any two graphs which are sufficiently different in terms of subgraphs. We confirm these theoretical results with synthetic experiments on hard-to-distinguish graphs and real-world graph classification tasks. In both cases, we compare favorably not only to standard GNNs but also to computationally more expensive GNN extensions. ",
    "url": "https://arxiv.org/abs/2206.11010",
    "authors": [
      "Karolis Martinkus",
      "Pál András Papp",
      "Benedikt Schesch",
      "Roger Wattenhofer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2206.11011",
    "title": "Weakly-supervised Action Localization via Hierarchical Mining",
    "abstract": "Weakly-supervised action localization aims to localize and classify action instances in the given videos temporally with only video-level categorical labels. Thus, the crucial issue of existing weakly-supervised action localization methods is the limited supervision from the weak annotations for precise predictions. In this work, we propose a hierarchical mining strategy under video-level and snippet-level manners, i.e., hierarchical supervision and hierarchical consistency mining, to maximize the usage of the given annotations and prediction-wise consistency. To this end, a Hierarchical Mining Network (HiM-Net) is proposed. Concretely, it mines hierarchical supervision for classification in two grains: one is the video-level existence for ground truth categories captured by multiple instance learning; the other is the snippet-level inexistence for each negative-labeled category from the perspective of complementary labels, which is optimized by our proposed complementary label learning. As for hierarchical consistency, HiM-Net explores video-level co-action feature similarity and snippet-level foreground-background opposition, for discriminative representation learning and consistent foreground-background separation. Specifically, prediction variance is viewed as uncertainty to select the pairs with high consensus for proposed foreground-background collaborative learning. Comprehensive experimental results show that HiM-Net outperforms existing methods on THUMOS14 and ActivityNet1.3 datasets with large margins by hierarchically mining the supervision and consistency. Code will be available on GitHub. ",
    "url": "https://arxiv.org/abs/2206.11011",
    "authors": [
      "Jia-Chang Feng",
      "Fa-Ting Hong",
      "Jia-Run Du",
      "Zhongang Qi",
      "Ying Shan",
      "Xiaohu Qie",
      "Wei-Shi Zheng",
      "Jianping Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.11017",
    "title": "Object Type Clustering using Markov Directly-Follow Multigraph in  Object-Centric Process Mining",
    "abstract": "Object-centric process mining is a new paradigm with more realistic assumptions about underlying data by considering several case notions, e.g., an order handling process can be analyzed based on order, item, package, and route case notions. Including many case notions can result in a very complex model. To cope with such complexity, this paper introduces a new approach to cluster similar case notions based on Markov Directly-Follow Multigraph, which is an extended version of the well-known Directly-Follow Graph supported by many industrial and academic process mining tools. This graph is used to calculate a similarity matrix for discovering clusters of similar case notions based on a threshold. A threshold tuning algorithm is also defined to identify sets of different clusters that can be discovered based on different levels of similarity. Thus, the cluster discovery will not rely on merely analysts' assumptions. The approach is implemented and released as a part of a python library, called processmining, and it is evaluated through a Purchase to Pay (P2P) object-centric event log file. Some discovered clusters are evaluated by discovering Directly Follow-Multigraph by flattening the log based on the clusters. The similarity between identified clusters is also evaluated by calculating the similarity between the behavior of the process models discovered for each case notion using inductive miner based on footprints conformance checking. ",
    "url": "https://arxiv.org/abs/2206.11017",
    "authors": [
      "Amin Jalali"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.11023",
    "title": "Heterogeneous Graph Neural Networks for Software Effort Estimation",
    "abstract": "Software effort can be measured by story point [35]. Current approaches for automatically estimating story points focus on applying pre-trained embedding models and deep learning for text regression to solve this problem which required expensive embedding models. We propose HeteroSP, a tool for estimating story points from textual input of Agile software project issues. We select GPT2SP [12] and Deep-SE [8] as the baselines for comparison. First, from the analysis of the story point dataset [8], we conclude that software issues are actually a mixture of natural language sentences with quoted code snippets and have problems related to large-size vocabulary. Second, we provide a module to normalize the input text including words and code tokens of the software issues. Third, we design an algorithm to convert an input software issue to a graph with different types of nodes and edges. Fourth, we construct a heterogeneous graph neural networks model with the support of fastText [6] for constructing initial node embedding to learn and predict the story points of new issues. We did the comparison over three scenarios of estimation, including within project, cross-project within the repository, and cross-project cross repository with our baseline approaches. We achieve the average Mean Absolute Error (MAE) as 2.38, 2.61, and 2.63 for three scenarios. We outperform GPT2SP in 2/3 of the scenarios while outperforming Deep-SE in the most challenging scenario with significantly less amount of running time. We also compare our approaches with different homogeneous graph neural network models and the results show that the heterogeneous graph neural networks model outperforms the homogeneous models in story point estimation. For time performance, we achieve about 570 seconds as the time performance in both three processes: node embedding initialization, model construction, and story point estimation. ",
    "url": "https://arxiv.org/abs/2206.11023",
    "authors": [
      "Hung Phan",
      "Ali Jannesari"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.11024",
    "title": "ROSE: A RObust and SEcure DNN Watermarking",
    "abstract": "Protecting the Intellectual Property rights of DNN models is of primary importance prior to their deployment. So far, the proposed methods either necessitate changes to internal model parameters or the machine learning pipeline, or they fail to meet both the security and robustness requirements. This paper proposes a lightweight, robust, and secure black-box DNN watermarking protocol that takes advantage of cryptographic one-way functions as well as the injection of in-task key image-label pairs during the training process. These pairs are later used to prove DNN model ownership during testing. The main feature is that the value of the proof and its security are measurable. The extensive experiments watermarking image classification models for various datasets as well as exposing them to a variety of attacks, show that it provides protection while maintaining an adequate level of security and robustness. ",
    "url": "https://arxiv.org/abs/2206.11024",
    "authors": [
      "Kassem Kallas",
      "Teddy Furon"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.11037",
    "title": "World of Bugs: A Platform for Automated Bug Detection in 3D Video Games",
    "abstract": "We present World of Bugs (WOB), an open platform that aims to support Automated Bug Detection (ABD) research in video games. We discuss some open problems in ABD and how they relate to the platform's design, arguing that learning-based solutions are required if further progress is to be made. The platform's key feature is a growing collection of common video game bugs that may be used for training and evaluating ABD approaches. ",
    "url": "https://arxiv.org/abs/2206.11037",
    "authors": [
      "Benedict Wilkins",
      "Kostas Stathis"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2206.11057",
    "title": "Transformer Neural Networks Attending to Both Sequence and Structure for  Protein Prediction Tasks",
    "abstract": "The increasing number of protein sequences decoded from genomes is opening up new avenues of research on linking protein sequence to function with transformer neural networks. Recent research has shown that the number of known protein sequences supports learning useful, task-agnostic sequence representations via transformers. In this paper, we posit that learning joint sequence-structure representations yields better representations for function-related prediction tasks. We propose a transformer neural network that attends to both sequence and tertiary structure. We show that such joint representations are more powerful than sequence-based representations only, and they yield better performance on superfamily membership across various metrics. ",
    "url": "https://arxiv.org/abs/2206.11057",
    "authors": [
      "Anowarul Kabir",
      "Amarda Shehu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2206.11061",
    "title": "An Ontological Approach to Analysing Social Service Provisioning",
    "abstract": "This paper introduces ontological concepts required to evaluate and manage the coverage of social services in a Smart City context. Here, we focus on the perspective of key stakeholders, namely social purpose organizations and the clients they serve. The Compass ontology presented here extends the Common Impact Data Standard by introducing new concepts related to key dimensions: the who (Stakeholder), the what (Need, Need Satisfier, Outcome), the how (Service, Event), and the contributions (tracking resources). The paper first introduces key stakeholders, services, outcomes, events, needs and need satisfiers, along with their definitions. Second, a subset of competency questions are presented to illustrate the types of questions key stakeholders have posed. Third, the extension's ability to answer questions is evaluated by presenting SPARQL queries executed on a Compass-based knowledge graph and analysing their results. ",
    "url": "https://arxiv.org/abs/2206.11061",
    "authors": [
      "Mark S. Fox",
      "Bart Gajderowicz",
      "Daniela Rosu",
      "Alina Turner",
      "Lester Lyu"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Artificial Intelligence (cs.AI)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2206.11073",
    "title": "A Unified and Biologically-Plausible Relational Graph Representation of  Vision Transformers",
    "abstract": "Vision transformer (ViT) and its variants have achieved remarkable successes in various visual tasks. The key characteristic of these ViT models is to adopt different aggregation strategies of spatial patch information within the artificial neural networks (ANNs). However, there is still a key lack of unified representation of different ViT architectures for systematic understanding and assessment of model representation performance. Moreover, how those well-performing ViT ANNs are similar to real biological neural networks (BNNs) is largely unexplored. To answer these fundamental questions, we, for the first time, propose a unified and biologically-plausible relational graph representation of ViT models. Specifically, the proposed relational graph representation consists of two key sub-graphs: aggregation graph and affine graph. The former one considers ViT tokens as nodes and describes their spatial interaction, while the latter one regards network channels as nodes and reflects the information communication between channels. Using this unified relational graph representation, we found that: a) a sweet spot of the aggregation graph leads to ViTs with significantly improved predictive performance; b) the graph measures of clustering coefficient and average path length are two effective indicators of model prediction performance, especially when applying on the datasets with small samples; c) our findings are consistent across various ViT architectures and multiple datasets; d) the proposed relational graph representation of ViT has high similarity with real BNNs derived from brain science data. Overall, our work provides a novel unified and biologically-plausible paradigm for more interpretable and effective representation of ViT ANNs. ",
    "url": "https://arxiv.org/abs/2206.11073",
    "authors": [
      "Yuzhong Chen",
      "Yu Du",
      "Zhenxiang Xiao",
      "Lin Zhao",
      "Lu Zhang",
      "David Weizhong Liu",
      "Dajiang Zhu",
      "Tuo Zhang",
      "Xintao Hu",
      "Tianming Liu",
      "Xi Jiang"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.11074",
    "title": "Blockchain Function Virtualization: A New Approach for Mobile Networks  Beyond 5G",
    "abstract": "Many of the key enabling technologies of the fifth-generation (5G), such as network slicing, spectrum sharing, and federated learning, rely on a centralized authority. This may lead to pitfalls in terms of security or single point of failure. Distributed ledger technology, specifically blockchain, is currently employed by different applications related to the Internet of Things (IoT) and 5G to address the drawbacks of centralized systems. For this reason, mobile blockchain networks (MBNs) have recently attracted a great deal of attention. To add a transaction to the blockchain in MBNs, mobile or IoT users must perform various tasks like encryption, decryption, and mining. These tasks require energy and processing power, which impose limitations on mobile and IoT users' performance because they are usually battery powered and have a low processing power. One possible solution is to perform the tasks virtually on commodity servers provided by mobile edge computing (MEC) or cloud computing. To do so, all tasks needed to add a transaction to the blockchain can be treated as virtual blockchain functions that can be executed on commodity servers. We introduce a blockchain virtualization framework called blockchain function virtualization (BFV), through which all blockchain functions can be performed virtually by MEC or cloud computing. Furthermore, we describe applications of the BFV framework and resource allocation challenges brought by the BFV framework in mobile networks. In addition, to illustrate the advantages of BFV, we define an optimization problem to simultaneously minimize the energy consumption cost and maximize miners' rewards. Finally, simulation results show the performance of the proposed framework in terms of total energy consumption, transaction confirmation rate, and miners' average profit. ",
    "url": "https://arxiv.org/abs/2206.11074",
    "authors": [
      "Shiva Kazemi Taskou",
      "Mehdi Rasti",
      "Pedro H. J. Nardelli"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2206.11081",
    "title": "Descent Steps of a Relation-Aware Energy Produce Heterogeneous Graph  Neural Networks",
    "abstract": "Heterogeneous graph neural networks (GNNs) achieve strong performance on node classification tasks in a semi-supervised learning setting. However, as in the simpler homogeneous GNN case, message-passing-based heterogeneous GNNs may struggle to balance between resisting the oversmoothing occuring in deep models and capturing long-range dependencies graph structured data. Moreover, the complexity of this trade-off is compounded in the heterogeneous graph case due to the disparate heterophily relationships between nodes of different types. To address these issues, we proposed a novel heterogeneous GNN architecture in which layers are derived from optimization steps that descend a novel relation-aware energy function. The corresponding minimizer is fully differentiable with respect to the energy function parameters, such that bilevel optimization can be applied to effectively learn a functional form whose minimum provides optimal node representations for subsequent classification tasks. In particular, this methodology allows us to model diverse heterophily relationships between different node types while avoiding oversmoothing effects. Experimental results on 8 heterogeneous graph benchmarks demonstrates that our proposed method can achieve competitive node classification accuracy. ",
    "url": "https://arxiv.org/abs/2206.11081",
    "authors": [
      "Hongjoon Ahn",
      "Youngyi Yang",
      "Quan Gan",
      "David Wipf",
      "Taesup Moon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.11102",
    "title": "40 Years of Designing Code Comprehension Experiments: A Systematic  Mapping Study",
    "abstract": "The relevance of code comprehension in a developer's daily work was recognized more than 40 years ago. Over the years, several studies have gathered evidence that developers do indeed invest a considerable amount of their daily work in code comprehension. Consequently, many studies were conducted to find out how developers could be supported during code comprehension and which code characteristics contribute to better comprehension. Today, such experiments are more common than ever. While this is great for advancing the field, the number of publications makes it difficult to keep an overview. Additionally, designing rigorous experiments with human participants is a challenging task, and the multitude of design decisions and options can make it difficult for researchers to select a suitable design. We therefore conducted a systematic mapping study of 95 source code comprehension experiments published between 1979 and 2019. By systematically structuring the design characteristics of code comprehension studies, we provide a basis for subsequent discussion of the huge diversity of design options in the face of a lack of basic research on their consequences and comparability. We describe what topics have been studied, as well as how these studies have been designed, conducted, and reported. Frequently chosen design options and deficiencies are pointed out. We conclude with five concrete action items that we as a research community should address moving forward to improve publications of code comprehension experiments. ",
    "url": "https://arxiv.org/abs/2206.11102",
    "authors": [
      "Marvin Wyrich",
      "Justus Bogner",
      "Stefan Wagner"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2206.11114",
    "title": "Evolutionary Game-Theoretical Analysis for General Multiplayer  Asymmetric Games",
    "abstract": "Evolutionary game theory has been a successful tool to combine classical game theory with learning-dynamical descriptions in multiagent systems. Provided some symmetric structures of interacting players, many studies have been focused on using a simplified heuristic payoff table as input to analyse the dynamics of interactions. Nevertheless, even for the state-of-the-art method, there are two limits. First, there is inaccuracy when analysing the simplified payoff table. Second, no existing work is able to deal with 2-population multiplayer asymmetric games. In this paper, we fill the gap between heuristic payoff table and dynamic analysis without any inaccuracy. In addition, we propose a general framework for $m$ versus $n$ 2-population multiplayer asymmetric games. Then, we compare our method with the state-of-the-art in some classic games. Finally, to illustrate our method, we perform empirical game-theoretical analysis on Wolfpack as well as StarCraft II, both of which involve complex multiagent interactions. ",
    "url": "https://arxiv.org/abs/2206.11114",
    "authors": [
      "Xinyu Zhang",
      "Peng Peng",
      "Yushan Zhou",
      "Haifeng Wang",
      "Wenxin Li"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2206.11116",
    "title": "StaDRe and StaDRo: Reliability and Robustness Estimation of ML-based  Forecasting using Statistical Distance Measures",
    "abstract": "Reliability estimation of Machine Learning (ML) models is becoming a crucial subject. This is particularly the case when such \\mbox{models} are deployed in safety-critical applications, as the decisions based on model predictions can result in hazardous situations. In this regard, recent research has proposed methods to achieve safe, \\mbox{dependable}, and reliable ML systems. One such method consists of detecting and analyzing distributional shift, and then measuring how such systems respond to these shifts. This was proposed in earlier work in SafeML. This work focuses on the use of SafeML for time series data, and on reliability and robustness estimation of ML-forecasting methods using statistical distance measures. To this end, distance measures based on the Empirical Cumulative Distribution Function (ECDF) proposed in SafeML are explored to measure Statistical-Distance Dissimilarity (SDD) across time series. We then propose SDD-based Reliability Estimate (StaDRe) and SDD-based Robustness (StaDRo) measures. With the help of a clustering technique, the similarity between the statistical properties of data seen during training and the forecasts is identified. The proposed method is capable of providing a link between dataset SDD and Key Performance Indicators (KPIs) of the ML models. ",
    "url": "https://arxiv.org/abs/2206.11116",
    "authors": [
      "Mohammed Naveed Akram",
      "Akshatha Ambekar",
      "Ioannis Sorokos",
      "Koorosh Aslansefat",
      "Daniel Schneider"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.11120",
    "title": "Near-optimal control of dynamical systems with neural ordinary  differential equations",
    "abstract": "Optimal control problems naturally arise in many scientific applications where one wishes to steer a dynamical system from a certain initial state $\\mathbf{x}_0$ to a desired target state $\\mathbf{x}^*$ in finite time $T$. Recent advances in deep learning and neural network-based optimization have contributed to the development of methods that can help solve control problems involving high-dimensional dynamical systems. In particular, the framework of neural ordinary differential equations (neural ODEs) provides an efficient means to iteratively approximate continuous time control functions associated with analytically intractable and computationally demanding control tasks. Although neural ODE controllers have shown great potential in solving complex control problems, the understanding of the effects of hyperparameters such as network structure and optimizers on learning performance is still very limited. Our work aims at addressing some of these knowledge gaps to conduct efficient hyperparameter optimization. To this end, we first analyze how truncated and non-truncated backpropagation through time affect runtime performance and the ability of neural networks to learn optimal control functions. Using analytical and numerical methods, we then study the role of parameter initializations, optimizers, and neural-network architecture. Finally, we connect our results to the ability of neural ODE controllers to implicitly regularize control energy. ",
    "url": "https://arxiv.org/abs/2206.11120",
    "authors": [
      "Lucas Böttcher",
      "Thomas Asikis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2206.11128",
    "title": "tntorch: Tensor Network Learning with PyTorch",
    "abstract": "We present tntorch, a tensor learning framework that supports multiple decompositions (including Candecomp/Parafac, Tucker, and Tensor Train) under a unified interface. With our library, the user can learn and handle low-rank tensors with automatic differentiation, seamless GPU support, and the convenience of PyTorch's API. Besides decomposition algorithms, tntorch implements differentiable tensor algebra, rank truncation, cross-approximation, batch processing, comprehensive tensor arithmetics, and more. ",
    "url": "https://arxiv.org/abs/2206.11128",
    "authors": [
      "Mikhail Usvyatsov",
      "Rafael Ballester-Ripoll",
      "Konrad Schindler"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Mathematical Software (cs.MS)"
    ]
  },
  {
    "id": "arXiv:2206.11131",
    "title": "Variational Causal Dynamics: Discovering Modular World Models from  Interventions",
    "abstract": "Latent world models allow agents to reason about complex environments with high-dimensional observations. However, adapting to new environments and effectively leveraging previous knowledge remain significant challenges. We present variational causal dynamics (VCD), a structured world model that exploits the invariance of causal mechanisms across environments to achieve fast and modular adaptation. By causally factorising a transition model, VCD is able to identify reusable components across different environments. This is achieved by combining causal discovery and variational inference to learn a latent representation and transition model jointly in an unsupervised manner. Specifically, we optimise the evidence lower bound jointly over a representation model and a transition model structured as a causal graphical model. In evaluations on simulated environments with state and image observations, we show that VCD is able to successfully identify causal variables, and to discover consistent causal structures across different environments. Moreover, given a small number of observations in a previously unseen, intervened environment, VCD is able to identify the sparse changes in the dynamics and to adapt efficiently. In doing so, VCD significantly extends the capabilities of the current state-of-the-art in latent world models while also comparing favourably in terms of prediction accuracy. ",
    "url": "https://arxiv.org/abs/2206.11131",
    "authors": [
      "Anson Lei",
      "Bernhard Schölkopf",
      "Ingmar Posner"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2206.11133",
    "title": "Multi-party Secure Broad Learning System for Privacy Preserving",
    "abstract": "Multi-party learning is an indispensable technique for improving the learning performance via integrating data from multiple parties. Unfortunately, directly integrating multi-party data would not meet the privacy preserving requirements. Therefore, Privacy-Preserving Machine Learning (PPML) becomes a key research task in multi-party learning. In this paper, we present a new PPML method based on secure multi-party interactive protocol, namely Multi-party Secure Broad Learning System (MSBLS), and derive security analysis of the method. The existing PPML methods generally cannot simultaneously meet multiple requirements such as security, accuracy, efficiency and application scope, but MSBLS achieves satisfactory results in these aspects. It uses interactive protocol and random mapping to generate the mapped features of data, and then uses efficient broad learning to train neural network classifier. This is the first privacy computing method that combines secure multi-party computing and neural network. Theoretically, this method can ensure that the accuracy of the model will not be reduced due to encryption, and the calculation speed is very fast. We verify this conclusion on three classical datasets. ",
    "url": "https://arxiv.org/abs/2206.11133",
    "authors": [
      "Xiao-Kai Cao",
      "Chang-Dong Wang",
      "Jian-Huang Lai",
      "Qiong Huang",
      "C. L. Philip Chen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2206.11134",
    "title": "Open Vocabulary Object Detection with Proposal Mining and Prediction  Equalization",
    "abstract": "Open-vocabulary object detection (OVD) aims to scale up vocabulary size to detect objects of novel categories beyond the training vocabulary. Recent work resorts to the rich knowledge in pre-trained vision-language models. However, existing methods are ineffective in proposal-level vision-language alignment. Meanwhile, the models usually suffer from confidence bias toward base categories and perform worse on novel ones. To overcome the challenges, we present MEDet, a novel and effective OVD framework with proposal mining and prediction equalization. First, we design an online proposal mining to refine the inherited vision-semantic knowledge from coarse to fine, allowing for proposal-level detection-oriented feature alignment. Second, based on causal inference theory, we introduce a class-wise backdoor adjustment to reinforce the predictions on novel categories to improve the overall OVD performance. Extensive experiments on COCO and LVIS benchmarks verify the superiority of MEDet over the competing approaches in detecting objects of novel categories, e.g., 32.6% AP50 on COCO and 22.4% mask mAP on LVIS. ",
    "url": "https://arxiv.org/abs/2206.11134",
    "authors": [
      "Peixian Chen",
      "Kekai Sheng",
      "Mengdan Zhang",
      "Yunhang Shen",
      "Ke Li",
      "Chunhua Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.11141",
    "title": "Hybrid Physical Metric For 6-DoF Grasp Pose Detection",
    "abstract": "6-DoF grasp pose detection of multi-grasp and multi-object is a challenge task in the field of intelligent robot. To imitate human reasoning ability for grasping objects, data driven methods are widely studied. With the introduction of large-scale datasets, we discover that a single physical metric usually generates several discrete levels of grasp confidence scores, which cannot finely distinguish millions of grasp poses and leads to inaccurate prediction results. In this paper, we propose a hybrid physical metric to solve this evaluation insufficiency. First, we define a novel metric is based on the force-closure metric, supplemented by the measurement of the object flatness, gravity and collision. Second, we leverage this hybrid physical metric to generate elaborate confidence scores. Third, to learn the new confidence scores effectively, we design a multi-resolution network called Flatness Gravity Collision GraspNet (FGC-GraspNet). FGC-GraspNet proposes a multi-resolution features learning architecture for multiple tasks and introduces a new joint loss function that enhances the average precision of the grasp detection. The network evaluation and adequate real robot experiments demonstrate the effectiveness of our hybrid physical metric and FGC-GraspNet. Our method achieves 90.5\\% success rate in real-world cluttered scenes. Our code is available at https://github.com/luyh20/FGC-GraspNet. ",
    "url": "https://arxiv.org/abs/2206.11141",
    "authors": [
      "Yuhao Lu",
      "Beixing Deng",
      "Zhenyu Wang",
      "Peiyuan Zhi",
      "Yali Li",
      "Shengjin Wang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.11160",
    "title": "The Problem of Semantic Shift in Longitudinal Monitoring of Social  Media: A Case Study on Mental Health During the COVID-19 Pandemic",
    "abstract": "Social media allows researchers to track societal and cultural changes over time based on language analysis tools. Many of these tools rely on statistical algorithms which need to be tuned to specific types of language. Recent studies have shown the absence of appropriate tuning, specifically in the presence of semantic shift, can hinder robustness of the underlying methods. However, little is known about the practical effect this sensitivity may have on downstream longitudinal analyses. We explore this gap in the literature through a timely case study: understanding shifts in depression during the course of the COVID-19 pandemic. We find that inclusion of only a small number of semantically-unstable features can promote significant changes in longitudinal estimates of our target outcome. At the same time, we demonstrate that a recently-introduced method for measuring semantic shift may be used to proactively identify failure points of language-based models and, in turn, improve predictive generalization. ",
    "url": "https://arxiv.org/abs/2206.11160",
    "authors": [
      "Keith Harrigian",
      "Mark Dredze"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2206.11161",
    "title": "Sharing pattern submodels for prediction with missing values",
    "abstract": "Missing values are unavoidable in many applications of machine learning and present a challenge both during training and at test time. When variables are missing in recurring patterns, fitting separate pattern submodels have been proposed as a solution. However, independent models do not make efficient use of all available data. Conversely, fitting a shared model to the full data set typically relies on imputation which may be suboptimal when missingness depends on unobserved factors. We propose an alternative approach, called sharing pattern submodels, which make predictions that are a) robust to missing values at test time, b) maintains or improves the predictive power of pattern submodels, and c) has a short description enabling improved interpretability. We identify cases where sharing is provably optimal, even when missingness itself is predictive and when the prediction target depends on unobserved variables. Classification and regression experiments on synthetic data and two healthcare data sets demonstrate that our models achieve a favorable trade-off between pattern specialization and information sharing. ",
    "url": "https://arxiv.org/abs/2206.11161",
    "authors": [
      "Lena Stempfle",
      "Fredrik Johansson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2206.11168",
    "title": "Ordered Subgraph Aggregation Networks",
    "abstract": "Numerous subgraph-enhanced graph neural networks (GNNs) have emerged recently, provably boosting the expressive power of standard (message-passing) GNNs. However, there is a limited understanding of how these approaches relate to each other and to the Weisfeiler--Leman hierarchy. Moreover, current approaches either use all subgraphs of a given size, sample them uniformly at random, or use hand-crafted heuristics instead of learning to select subgraphs in a data-driven manner. Here, we offer a unified way to study such architectures by introducing a theoretical framework and extending the known expressivity results of subgraph-enhanced GNNs. Concretely, we show that increasing subgraph size always increases the expressive power and develop a better understanding of their limitations by relating them to the established $k\\text{-}\\mathsf{WL}$ hierarchy. In addition, we explore different approaches for learning to sample subgraphs using recent methods for backpropagating through complex discrete probability distributions. Empirically, we study the predictive performance of different subgraph-enhanced GNNs, showing that our data-driven architectures increase prediction accuracy on standard benchmark datasets compared to non-data-driven subgraph-enhanced graph neural networks while reducing computation time. ",
    "url": "https://arxiv.org/abs/2206.11168",
    "authors": [
      "Chendi Qian",
      "Gaurav Rattan",
      "Floris Geerts",
      "Christopher Morris",
      "Mathias Niepert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Data Structures and Algorithms (cs.DS)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2206.11171",
    "title": "Attack Techniques and Threat Identification for Vulnerabilities",
    "abstract": "Modern organizations struggle with insurmountable number of vulnerabilities that are discovered and reported by their network and application vulnerability scanners. Therefore, prioritization and focus become critical, to spend their limited time on the highest risk vulnerabilities. In doing this, it is important for these organizations not only to understand the technical descriptions of the vulnerabilities, but also to gain insights into attackers' perspectives. In this work, we use machine learning and natural language processing techniques, as well as several publicly available data sets to provide an explainable mapping of vulnerabilities to attack techniques and threat actors. This work provides new security intelligence, by predicting which attack techniques are most likely to be used to exploit a given vulnerability and which threat actors are most likely to conduct the exploitation. Lack of labeled data and different vocabularies make mapping vulnerabilities to attack techniques at scale a challenging problem that cannot be addressed easily using supervised or unsupervised (similarity search) learning techniques. To solve this problem, we first map the vulnerabilities to a standard set of common weaknesses, and then common weaknesses to the attack techniques. This approach yields a Mean Reciprocal Rank (MRR) of 0.95, an accuracy comparable with those reported for state-of-the-art systems. Our solution has been deployed to IBM Security X-Force Red Vulnerability Management Services, and in production since 2021. The solution helps security practitioners to assist customers to manage and prioritize their vulnerabilities, providing them with an explainable mapping of vulnerabilities to attack techniques and threat actors ",
    "url": "https://arxiv.org/abs/2206.11171",
    "authors": [
      "Constantin Adam",
      "Muhammed Fatih Bulut",
      "Daby Sow",
      "Steven Ocepek",
      "Chris Bedell",
      "Lilian Ngweta"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.11172",
    "title": "Neural Inverse Transform Sampler",
    "abstract": "Any explicit functional representation $f$ of a density is hampered by two main obstacles when we wish to use it as a generative model: designing $f$ so that sampling is fast, and estimating $Z = \\int f$ so that $Z^{-1}f$ integrates to 1. This becomes increasingly complicated as $f$ itself becomes complicated. In this paper, we show that when modeling one-dimensional conditional densities with a neural network, $Z$ can be exactly and efficiently computed by letting the network represent the cumulative distribution function of a target density, and applying a generalized fundamental theorem of calculus. We also derive a fast algorithm for sampling from the resulting representation by the inverse transform method. By extending these principles to higher dimensions, we introduce the \\textbf{Neural Inverse Transform Sampler (NITS)}, a novel deep learning framework for modeling and sampling from general, multidimensional, compactly-supported probability densities. NITS is a highly expressive density estimator that boasts end-to-end differentiability, fast sampling, and exact and cheap likelihood evaluation. We demonstrate the applicability of NITS by applying it to realistic, high-dimensional density estimation tasks: likelihood-based generative modeling on the CIFAR-10 dataset, and density estimation on the UCI suite of benchmark datasets, where NITS produces compelling results rivaling or surpassing the state of the art. ",
    "url": "https://arxiv.org/abs/2206.11172",
    "authors": [
      "Henry Li",
      "Yuval Kluger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.11180",
    "title": "Optimal transport meets noisy label robust loss and MixUp regularization  for domain adaptation",
    "abstract": "It is common in computer vision to be confronted with domain shift: images which have the same class but different acquisition conditions. In domain adaptation (DA), one wants to classify unlabeled target images using source labeled images. Unfortunately, deep neural networks trained on a source training set perform poorly on target images which do not belong to the training domain. One strategy to improve these performances is to align the source and target image distributions in an embedded space using optimal transport (OT). However OT can cause negative transfer, i.e. aligning samples with different labels, which leads to overfitting especially in the presence of label shift between domains. In this work, we mitigate negative alignment by explaining it as a noisy label assignment to target images. We then mitigate its effect by appropriate regularization. We propose to couple the MixUp regularization \\citep{zhang2018mixup} with a loss that is robust to noisy labels in order to improve domain adaptation performance. We show in an extensive ablation study that a combination of the two techniques is critical to achieve improved performance. Finally, we evaluate our method, called \\textsc{mixunbot}, on several benchmarks and real-world DA problems. ",
    "url": "https://arxiv.org/abs/2206.11180",
    "authors": [
      "Kilian Fatras",
      "Hiroki Naganuma",
      "Ioannis Mitliagkas"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2206.11182",
    "title": "Vulnerability Prioritization: An Offensive Security Approach",
    "abstract": "Organizations struggle to handle sheer number of vulnerabilities in their cloud environments. The de facto methodology used for prioritizing vulnerabilities is to use Common Vulnerability Scoring System (CVSS). However, CVSS has inherent limitations that makes it not ideal for prioritization. In this work, we propose a new way of prioritizing vulnerabilities. Our approach is inspired by how offensive security practitioners perform penetration testing. We evaluate our approach with a real world case study for a large client, and the accuracy of machine learning to automate the process end to end. ",
    "url": "https://arxiv.org/abs/2206.11182",
    "authors": [
      "Muhammed Fatih Bulut",
      "Abdulhamid Adebayo",
      "Daby Sow",
      "Steve Ocepek"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.11215",
    "title": "Correct and Certify: A New Approach to Self-Supervised 3D-Object  Perception",
    "abstract": "We consider an object pose estimation and model fitting problem, where - given a partial point cloud of an object - the goal is to estimate the object pose by fitting a CAD model to the sensor data. We solve this problem by combining (i) a semantic keypoint-based pose estimation model, (ii) a novel self-supervised training approach, and (iii) a certification procedure, that not only verifies whether the output produced by the model is correct or not, but also flags uniqueness of the produced solution. The semantic keypoint detector model is initially trained in simulation and does not perform well on real-data due to the domain gap. Our self-supervised training procedure uses a corrector and a certification module to improve the detector. The corrector module corrects the detected keypoints to compensate for the domain gap, and is implemented as a declarative layer, for which we develop a simple differentiation rule. The certification module declares whether the corrected output produced by the model is certifiable (i.e. correct) or not. At each iteration, the approach optimizes over the loss induced only by the certifiable input-output pairs. As training progresses, we see that the fraction of outputs that are certifiable increases, eventually reaching near $100\\%$ in many cases. We also introduce the notion of strong certifiability wherein the model can determine if the predicted object model fit is unique or not. The detected semantic keypoints help us implement this in the forward pass. We conduct extensive experiments to evaluate the performance of the corrector, the certification, and the proposed self-supervised training using the ShapeNet and YCB datasets, and show the proposed approach achieves performance comparable to fully supervised baselines while not requiring pose or keypoint supervision on real data. ",
    "url": "https://arxiv.org/abs/2206.11215",
    "authors": [
      "Rajat Talak",
      "Lisa Peng",
      "Luca Carlone"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2206.11225",
    "title": "RetrievalGuard: Provably Robust 1-Nearest Neighbor Image Retrieval",
    "abstract": "Recent research works have shown that image retrieval models are vulnerable to adversarial attacks, where slightly modified test inputs could lead to problematic retrieval results. In this paper, we aim to design a provably robust image retrieval model which keeps the most important evaluation metric Recall@1 invariant to adversarial perturbation. We propose the first 1-nearest neighbor (NN) image retrieval algorithm, RetrievalGuard, which is provably robust against adversarial perturbations within an $\\ell_2$ ball of calculable radius. The challenge is to design a provably robust algorithm that takes into consideration the 1-NN search and the high-dimensional nature of the embedding space. Algorithmically, given a base retrieval model and a query sample, we build a smoothed retrieval model by carefully analyzing the 1-NN search procedure in the high-dimensional embedding space. We show that the smoothed retrieval model has bounded Lipschitz constant and thus the retrieval score is invariant to $\\ell_2$ adversarial perturbations. Experiments on image retrieval tasks validate the robustness of our RetrievalGuard method. ",
    "url": "https://arxiv.org/abs/2206.11225",
    "authors": [
      "Yihan Wu",
      "Hongyang Zhang",
      "Heng Huang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.11241",
    "title": "Concentration inequalities and optimal number of layers for stochastic  deep neural networks",
    "abstract": "We state concentration and martingale inequalities for the output of the hidden layers of a stochastic deep neural network (SDNN), as well as for the output of the whole SDNN. These results allow us to introduce an expected classifier (EC), and to give probabilistic upper bound for the classification error of the EC. We also state the optimal number of layers for the SDNN via an optimal stopping procedure. We apply our analysis to a stochastic version of a feedforward neural network with ReLU activation function. ",
    "url": "https://arxiv.org/abs/2206.11241",
    "authors": [
      "Michele Caprio",
      "Sayan Mukherjee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2206.11249",
    "title": "GEMv2: Multilingual NLG Benchmarking in a Single Line of Code",
    "abstract": "Evaluation in machine learning is usually informed by past choices, for example which datasets or metrics to use. This standardization enables the comparison on equal footing using leaderboards, but the evaluation choices become sub-optimal as better alternatives arise. This problem is especially pertinent in natural language generation which requires ever-improving suites of datasets, metrics, and human evaluation to make definitive claims. To make following best model evaluation practices easier, we introduce GEMv2. The new version of the Generation, Evaluation, and Metrics Benchmark introduces a modular infrastructure for dataset, model, and metric developers to benefit from each others work. GEMv2 supports 40 documented datasets in 51 languages. Models for all datasets can be evaluated online and our interactive data card creation and rendering tools make it easier to add new datasets to the living benchmark. ",
    "url": "https://arxiv.org/abs/2206.11249",
    "authors": [
      "Sebastian Gehrmann",
      "Abhik Bhattacharjee",
      "Abinaya Mahendiran",
      "Alex Wang",
      "Alexandros Papangelis",
      "Aman Madaan",
      "Angelina McMillan-Major",
      "Anna Shvets",
      "Ashish Upadhyay",
      "Bingsheng Yao",
      "Bryan Wilie",
      "Chandra Bhagavatula",
      "Chaobin You",
      "Craig Thomson",
      "Cristina Garbacea",
      "Dakuo Wang",
      "Daniel Deutsch",
      "Deyi Xiong",
      "Di Jin",
      "Dimitra Gkatzia",
      "Dragomir Radev",
      "Elizabeth Clark",
      "Esin Durmus",
      "Faisal Ladhak",
      "Filip Ginter",
      "Genta Indra Winata",
      "Hendrik Strobelt",
      "Hiroaki Hayashi",
      "Jekaterina Novikova",
      "Jenna Kanerva",
      "Jenny Chim",
      "Jiawei Zhou",
      "Jordan Clive",
      "Joshua Maynez",
      "João Sedoc",
      "Juraj Juraska",
      "Kaustubh Dhole",
      "Khyathi Raghavi Chandu",
      "Leonardo F. R. Ribeiro",
      "Lewis Tunstall",
      "Li Zhang",
      "Mahima Pushkarna",
      "Mathias Creutz",
      "Michael White",
      "Mihir Sanjay Kale",
      "Moussa Kamal Eddine",
      "Nico Daheim",
      "Nishant Subramani",
      "Ondrej Dusek"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.11250",
    "title": "Depth-aware Glass Surface Detection with Cross-modal Context Mining",
    "abstract": "Glass surfaces are becoming increasingly ubiquitous as modern buildings tend to use a lot of glass panels. This however poses substantial challenges on the operations of autonomous systems such as robots, self-driving cars and drones, as the glass panels can become transparent obstacles to the navigation.Existing works attempt to exploit various cues, including glass boundary context or reflections, as a prior. However, they are all based on input RGB images.We observe that the transmission of 3D depth sensor light through glass surfaces often produces blank regions in the depth maps, which can offer additional insights to complement the RGB image features for glass surface detection. In this paper, we propose a novel framework for glass surface detection by incorporating RGB-D information, with two novel modules: (1) a cross-modal context mining (CCM) module to adaptively learn individual and mutual context features from RGB and depth information, and (2) a depth-missing aware attention (DAA) module to explicitly exploit spatial locations where missing depths occur to help detect the presence of glass surfaces. In addition, we propose a large-scale RGB-D glass surface detection dataset, called \\textit{RGB-D GSD}, for RGB-D glass surface detection. Our dataset comprises 3,009 real-world RGB-D glass surface images with precise annotations. Extensive experimental results show that our proposed model outperforms state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2206.11250",
    "authors": [
      "Jiaying Lin",
      "Yuen Hei Yeung",
      "Rynson W.H. Lau"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.11253",
    "title": "Towards Robust Blind Face Restoration with Codebook Lookup Transformer",
    "abstract": "Blind face restoration is a highly ill-posed problem that often requires auxiliary guidance to 1) improve the mapping from degraded inputs to desired outputs, or 2) complement high-quality details lost in the inputs. In this paper, we demonstrate that a learned discrete codebook prior in a small proxy space largely reduces the uncertainty and ambiguity of restoration mapping by casting blind face restoration as a code prediction task, while providing rich visual atoms for generating high-quality faces. Under this paradigm, we propose a Transformer-based prediction network, named CodeFormer, to model global composition and context of the low-quality faces for code prediction, enabling the discovery of natural faces that closely approximate the target faces even when the inputs are severely degraded. To enhance the adaptiveness for different degradation, we also propose a controllable feature transformation module that allows a flexible trade-off between fidelity and quality. Thanks to the expressive codebook prior and global modeling, CodeFormer outperforms state of the arts in both quality and fidelity, showing superior robustness to degradation. Extensive experimental results on synthetic and real-world datasets verify the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2206.11253",
    "authors": [
      "Shangchen Zhou",
      "Kelvin C.K. Chan",
      "Chongyi Li",
      "Chen Change Loy"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.10612",
    "title": "Metareview-informed Explainable Cytokine Storm Detection during CAR-T  cell Therapy",
    "abstract": "Cytokine release syndrome (CRS), also known as cytokine storm, is one of the most consequential adverse effects of chimeric antigen receptor therapies that have shown promising results in cancer treatment. When emerging, CRS could be identified by the analysis of specific cytokine and chemokine profiles that tend to exhibit similarities across patients. In this paper, we exploit these similarities using machine learning algorithms and set out to pioneer a meta--review informed method for the identification of CRS based on specific cytokine peak concentrations and evidence from previous clinical studies. We argue that such methods could support clinicians in analyzing suspect cytokine profiles by matching them against CRS knowledge from past clinical studies, with the ultimate aim of swift CRS diagnosis. During evaluation with real--world CRS clinical data, we emphasize the potential of our proposed method of producing interpretable results, in addition to being effective in identifying the onset of cytokine storm. ",
    "url": "https://arxiv.org/abs/2206.10612",
    "authors": [
      "Alex Bogatu",
      "Magdalena Wysocka",
      "Oskar Wysocki",
      "Holly Butterworth",
      "Donal Landers",
      "Elaine Kilgour",
      "Andre Freitas"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10677",
    "title": "ConTraNet: A single end-to-end hybrid network for EEG-based and  EMG-based human machine interfaces",
    "abstract": "Objective: Electroencephalography (EEG) and electromyography (EMG) are two non-invasive bio-signals, which are widely used in human machine interface (HMI) technologies (EEG-HMI and EMG-HMI paradigm) for the rehabilitation of physically disabled people. Successful decoding of EEG and EMG signals into respective control command is a pivotal step in the rehabilitation process. Recently, several Convolutional neural networks (CNNs) based architectures are proposed that directly map the raw time-series signal into decision space and the process of meaningful features extraction and classification are performed simultaneously. However, these networks are tailored to the learn the expected characteristics of the given bio-signal and are limited to single paradigm. In this work, we addressed the question that can we build a single architecture which is able to learn distinct features from different HMI paradigms and still successfully classify them. Approach: In this work, we introduce a single hybrid model called ConTraNet, which is based on CNN and Transformer architectures that is equally useful for EEG-HMI and EMG-HMI paradigms. ConTraNet uses CNN block to introduce inductive bias in the model and learn local dependencies, whereas the Transformer block uses the self-attention mechanism to learn the long-range dependencies in the signal, which are crucial for the classification of EEG and EMG signals. Main results: We evaluated and compared the ConTraNet with state-of-the-art methods on three publicly available datasets which belong to EEG-HMI and EMG-HMI paradigms. ConTraNet outperformed its counterparts in all the different category tasks (2-class, 3-class, 4-class, and 10-class decoding tasks). Significance: The results suggest that ConTraNet is robust to learn distinct features from different HMI paradigms and generalizes well as compared to the current state of the art algorithms. ",
    "url": "https://arxiv.org/abs/2206.10677",
    "authors": [
      "Omair Ali",
      "Muhammad Saif-ur-Rehman",
      "Tobias Glasmachers",
      "Ioannis Iossifidis",
      "Christian Klaes"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2206.10718",
    "title": "Physics-informed machine learning with differentiable programming for  heterogeneous underground reservoir pressure management",
    "abstract": "Avoiding over-pressurization in subsurface reservoirs is critical for applications like CO2 sequestration and wastewater injection. Managing the pressures by controlling injection/extraction are challenging because of complex heterogeneity in the subsurface. The heterogeneity typically requires high-fidelity physics-based models to make predictions on CO$_2$ fate. Furthermore, characterizing the heterogeneity accurately is fraught with parametric uncertainty. Accounting for both, heterogeneity and uncertainty, makes this a computationally-intensive problem challenging for current reservoir simulators. To tackle this, we use differentiable programming with a full-physics model and machine learning to determine the fluid extraction rates that prevent over-pressurization at critical reservoir locations. We use DPFEHM framework, which has trustworthy physics based on the standard two-point flux finite volume discretization and is also automatically differentiable like machine learning models. Our physics-informed machine learning framework uses convolutional neural networks to learn an appropriate extraction rate based on the permeability field. We also perform a hyperparameter search to improve the model's accuracy. Training and testing scenarios are executed to evaluate the feasibility of using physics-informed machine learning to manage reservoir pressures. We constructed and tested a sufficiently accurate simulator that is 400000 times faster than the underlying physics-based simulator, allowing for near real-time analysis and robust uncertainty quantification. ",
    "url": "https://arxiv.org/abs/2206.10718",
    "authors": [
      "Aleksandra Pachalieva",
      "Daniel O'Malley",
      "Dylan Robert Harp",
      "Hari Viswanathan"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Machine Learning (cs.LG)",
      "Geophysics (physics.geo-ph)"
    ]
  },
  {
    "id": "arXiv:2206.10743",
    "title": "Quantum-Enhanced Selection Operators for Evolutionary Algorithms",
    "abstract": "Genetic algorithms have unique properties which are useful when applied to black box optimization. Using selection, crossover, and mutation operators, candidate solutions may be obtained without the need to calculate a gradient. In this work, we study results obtained from using quantum-enhanced operators within the selection mechanism of a genetic algorithm. Our approach frames the selection process as a minimization of a binary quadratic model with which we encode fitness and distance between members of a population, and we leverage a quantum annealing system to sample low energy solutions for the selection mechanism. We benchmark these quantum-enhanced algorithms against classical algorithms over various black-box objective functions, including the OneMax function, and functions from the IOHProfiler library for black-box optimization. We observe a performance gain in average number of generations to convergence for the quantum-enhanced elitist selection operator in comparison to classical on the OneMax function. We also find that the quantum-enhanced selection operator with non-elitist selection outperform benchmarks on functions with fitness perturbation from the IOHProfiler library. Additionally, we find that in the case of elitist selection, the quantum-enhanced operators outperform classical benchmarks on functions with varying degrees of dummy variables and neutrality. ",
    "url": "https://arxiv.org/abs/2206.10743",
    "authors": [
      "David Von Dollen",
      "Sheir Yarkoni",
      "Daniel Weimer",
      "Florian Neukart",
      "Thomas Bäck"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2206.10870",
    "title": "Decentralized Gossip-Based Stochastic Bilevel Optimization over  Communication Networks",
    "abstract": "Bilevel optimization have gained growing interests, with numerous applications found in meta learning, minimax games, reinforcement learning, and nested composition optimization. This paper studies the problem of distributed bilevel optimization over a network where agents can only communicate with neighbors, including examples from multi-task, multi-agent learning and federated learning. In this paper, we propose a gossip-based distributed bilevel learning algorithm that allows networked agents to solve both the inner and outer optimization problems in a single timescale and share information via network propagation. We show that our algorithm enjoys the $\\mathcal{O}(\\frac{1}{K \\epsilon^2})$ per-agent sample complexity for general nonconvex bilevel optimization and $\\mathcal{O}(\\frac{1}{K \\epsilon})$ for strongly convex objective, achieving a speedup that scales linearly with the network size. The sample complexities are optimal in both $\\epsilon$ and $K$. We test our algorithm on the examples of hyperparameter tuning and decentralized reinforcement learning. Simulated experiments confirmed that our algorithm achieves the state-of-the-art training efficiency and test accuracy. ",
    "url": "https://arxiv.org/abs/2206.10870",
    "authors": [
      "Shuoguang Yang",
      "Xuezhou Zhang",
      "Mengdi Wang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2206.10911",
    "title": "Influence of uncertainty estimation techniques on false-positive  reduction in liver lesion detection",
    "abstract": "Deep learning techniques show success in detecting objects in medical images, but still suffer from false-positive predictions that may hinder accurate diagnosis. The estimated uncertainty of the neural network output has been used to flag incorrect predictions. We study the role played by features computed from neural network uncertainty estimates and shape-based features computed from binary predictions in reducing false positives in liver lesion detection by developing a classification-based post-processing step for different uncertainty estimation methods. We demonstrate an improvement in the lesion detection performance of the neural network (with respect to F1-score) for all uncertainty estimation methods on two datasets, comprising abdominal MR and CT images respectively. We show that features computed from neural network uncertainty estimates tend not to contribute much toward reducing false positives. Our results show that factors like class imbalance (true over false positive ratio) and shape-based features extracted from uncertainty maps play an important role in distinguishing false positive from true positive predictions ",
    "url": "https://arxiv.org/abs/2206.10911",
    "authors": [
      "Ishaan Bhat",
      "Josien P.W. Pluim",
      "Max A. Viergerver",
      "Hugo J. Kuijf"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10912",
    "title": "AI-based software for lung nodule detection in chest X-rays -- Time for  a second reader approach?",
    "abstract": "Objectives: To compare artificial intelligence (AI) as a second reader in detecting lung nodules on chest X-rays (CXR) versus radiologists of two binational institutions, and to evaluate AI performance when using two different modes: automated versus assisted (additional remote radiologist review). Methods: The CXR public database (n = 247) of the Japanese Society of Radiological Technology with various types and sizes of lung nodules was analyzed. Eight radiologists evaluated the CXR images with regard to the presence of lung nodules and nodule conspicuity. After radiologist review, the AI software processed and flagged the CXR with the highest probability of missed nodules. The calculated accuracy metrics were the area under the curve (AUC), sensitivity, specificity, F1 score, false negative case number (FN), and the effect of different AI modes (automated/assisted) on the accuracy of nodule detection. Results: For radiologists, the average AUC value was 0.77 $\\pm$ 0.07, while the average FN was 52.63 $\\pm$ 17.53 (all studies) and 32 $\\pm$ 11.59 (studies containing a nodule of malignant etiology = 32% rate of missed malignant nodules). Both AI modes -- automated and assisted -- produced an average increase in sensitivity (by 14% and 12%) and of F1-score (5% and 6%) and a decrease in specificity (by 10% and 3%, respectively). Conclusions: Both AI modes flagged the pulmonary nodules missed by radiologists in a significant number of cases. AI as a second reader has a high potential to improve diagnostic accuracy and radiology workflow. AI might detect certain pulmonary nodules earlier than radiologists, with a potentially significant impact on patient outcomes. ",
    "url": "https://arxiv.org/abs/2206.10912",
    "authors": [
      "Susanne Ohlmann-Knafo",
      "Naglis Ramanauskas",
      "Sebastian Huettinger",
      "Emil Johnson Jeyakumar",
      "Darius Barušauskas",
      "Neringa Bielskienė",
      "Vytautas Naujalis",
      "Jonas Bialopetravičius",
      "Jonas Ražanskas",
      "Artūras Samuilis",
      "Jūratė Dementavičienė",
      "Dirk Pickuth"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.11224",
    "title": "Deep reinforcement learning for fMRI prediction of Autism Spectrum  Disorder",
    "abstract": "Purpose : Because functional MRI (fMRI) data sets are in general small, we sought a data efficient approach to resting state fMRI classification of autism spectrum disorder (ASD) versus neurotypical (NT) controls. We hypothesized that a Deep Reinforcement Learning (DRL) classifier could learn effectively on a small fMRI training set. Methods : We trained a Deep Reinforcement Learning (DRL) classifier on 100 graph-label pairs from the Autism Brain Imaging Data Exchange (ABIDE) database. For comparison, we trained a Supervised Deep Learning (SDL) classifier on the same training set. Results : DRL significantly outperformed SDL, with a p-value of 2.4 x 10^(-7). DRL achieved superior results for a variety of classifier performance metrics, including an F1 score of 76, versus 67 for SDL. Whereas SDL quickly overfit the training data, DRL learned in a progressive manner that generalised to the separate testing set. Conclusion : DRL can learn to classify ASD versus NT in a data efficient manner, doing so for a small training set. Future work will involve optimizing the neural network for data efficiency and applying the approach to other fMRI data sets, namely for brain cancer patients. ",
    "url": "https://arxiv.org/abs/2206.11224",
    "authors": [
      "Joseph Stember",
      "Danielle Stember",
      "Luca Pasquini",
      "Jenabi Merhnaz",
      "Andrei Holodny",
      "Hrithwik Shalu"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2206.11228",
    "title": "Adversarially trained neural representations may already be as robust as  corresponding biological neural representations",
    "abstract": "Visual systems of primates are the gold standard of robust perception. There is thus a general belief that mimicking the neural representations that underlie those systems will yield artificial visual systems that are adversarially robust. In this work, we develop a method for performing adversarial visual attacks directly on primate brain activity. We then leverage this method to demonstrate that the above-mentioned belief might not be well founded. Specifically, we report that the biological neurons that make up visual systems of primates exhibit susceptibility to adversarial perturbations that is comparable in magnitude to existing (robustly trained) artificial neural networks. ",
    "url": "https://arxiv.org/abs/2206.11228",
    "authors": [
      "Chong Guo",
      "Michael J. Lee",
      "Guillaume Leclerc",
      "Joel Dapello",
      "Yug Rao",
      "Aleksander Madry",
      "James J. DiCarlo"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.11233",
    "title": "Automatic Autism Spectrum Disorder Detection Using Artificial  Intelligence Methods with MRI Neuroimaging: A Review",
    "abstract": "Autism spectrum disorder (ASD) is a brain condition characterized by diverse signs and symptoms that appear in early childhood. ASD is also associated with communication deficits and repetitive behavior in affected individuals. Various ASD detection methods have been developed, including neuroimaging modalities and psychological tests. Among these methods, magnetic resonance imaging (MRI) imaging modalities are of paramount importance to physicians. Clinicians rely on MRI modalities to diagnose ASD accurately. The MRI modalities are non-invasive methods that include functional (fMRI) and structural (sMRI) neuroimaging methods. However, the process of diagnosing ASD with fMRI and sMRI for specialists is often laborious and time-consuming; therefore, several computer-aided design systems (CADS) based on artificial intelligence (AI) have been developed to assist the specialist physicians. Conventional machine learning (ML) and deep learning (DL) are the most popular schemes of AI used for diagnosing ASD. This study aims to review the automated detection of ASD using AI. We review several CADS that have been developed using ML techniques for the automated diagnosis of ASD using MRI modalities. There has been very limited work on the use of DL techniques to develop automated diagnostic models for ASD. A summary of the studies developed using DL is provided in the appendix. Then, the challenges encountered during the automated diagnosis of ASD using MRI and AI techniques are described in detail. Additionally, a graphical comparison of studies using ML and DL to diagnose ASD automatically is discussed. We conclude by suggesting future approaches to detecting ASDs using AI techniques and MRI neuroimaging. ",
    "url": "https://arxiv.org/abs/2206.11233",
    "authors": [
      "Parisa Moridian",
      "Navid Ghassemi",
      "Mahboobeh Jafari",
      "Salam Salloum-Asfar",
      "Delaram Sadeghi",
      "Marjane Khodatars",
      "Afshin Shoeibi",
      "Abbas Khosravi",
      "Sai Ho Ling",
      "Abdulhamit Subasi",
      "Sara A Abdulla",
      "Roohallah Alizadehsani",
      "Juan M. Gorriz",
      "U. Rajendra Acharya"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:1906.03829",
    "title": "Transfer Learning for Hate Speech Detection in Social Media",
    "abstract": " Title: Transfer Learning for Hate Speech Detection in Social Media ",
    "url": "https://arxiv.org/abs/1906.03829",
    "authors": [
      "Lanqin Yuan",
      "Tianyu Wang",
      "Gabriela Ferraro",
      "Hanna Suominen",
      "Marian-Andrei Rizoiu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2003.01463",
    "title": "Robust High-Transparency Haptic Exploration for Dexterous  Telemanipulation",
    "abstract": " Title: Robust High-Transparency Haptic Exploration for Dexterous  Telemanipulation ",
    "url": "https://arxiv.org/abs/2003.01463",
    "authors": [
      "Keyhan Kouhkiloui Babarahmati",
      "Carlo Tiseo",
      "Quentin Rouxel",
      "Zhibin Li",
      "Michael Mistry"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2006.06417",
    "title": "Learning Monotone Dynamics by Neural Networks",
    "abstract": " Title: Learning Monotone Dynamics by Neural Networks ",
    "url": "https://arxiv.org/abs/2006.06417",
    "authors": [
      "Yu Wang",
      "Qitong Gao",
      "Miroslav Pajic"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2012.06326",
    "title": "exploRNN: Understanding Recurrent Neural Networks through Visual  Exploration",
    "abstract": " Title: exploRNN: Understanding Recurrent Neural Networks through Visual  Exploration ",
    "url": "https://arxiv.org/abs/2012.06326",
    "authors": [
      "Alex Bäuerle",
      "Patrick Albus",
      "Raphael Störk",
      "Tina Seufert",
      "Timo Ropinski"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2102.03494",
    "title": "FFConv: Fast Factorized Convolutional Neural Network Inference on  Encrypted Data",
    "abstract": " Comments: 12 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2102.03494",
    "authors": [
      "Yuxiao Lu",
      "Jie Lin",
      "Chao Jin",
      "Zhe Wang",
      "Min Wu",
      "Khin Mi Mi Aung",
      "Xiaoli Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2102.07035",
    "title": "Model-free Representation Learning and Exploration in Low-rank MDPs",
    "abstract": " Comments: Changelog v2: Significant reorganization of the paper, added an improved analysis of elliptic planner and updated discussion wrt follow-up work ",
    "url": "https://arxiv.org/abs/2102.07035",
    "authors": [
      "Aditya Modi",
      "Jinglin Chen",
      "Akshay Krishnamurthy",
      "Nan Jiang",
      "Alekh Agarwal"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2104.12069",
    "title": "Making Generated Images Hard To Spot: A Transferable Attack On Synthetic  Image Detectors",
    "abstract": " Title: Making Generated Images Hard To Spot: A Transferable Attack On Synthetic  Image Detectors ",
    "url": "https://arxiv.org/abs/2104.12069",
    "authors": [
      "Xinwei Zhao",
      "Matthew C. Stamm"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2106.12113",
    "title": "Prevention and Resolution of Conflicts in Social Navigation -- a Survey",
    "abstract": " Title: Prevention and Resolution of Conflicts in Social Navigation -- a Survey ",
    "url": "https://arxiv.org/abs/2106.12113",
    "authors": [
      "Reuth Mirsky",
      "Xuesu Xiao",
      "Justin Hart",
      "Peter Stone"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2107.01689",
    "title": "Restless and Uncertain: Robust Policies for Restless Bandits via Deep  Multi-Agent Reinforcement Learning",
    "abstract": " Comments: 16 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2107.01689",
    "authors": [
      "Jackson A. Killian",
      "Lily Xu",
      "Arpita Biswas",
      "Milind Tambe"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.04755",
    "title": "Beyond Low-pass Filtering: Graph Convolutional Networks with Automatic  Filtering",
    "abstract": " Comments: Accepted to IEEE Transactions on Knowledge and Data Engineering ",
    "url": "https://arxiv.org/abs/2107.04755",
    "authors": [
      "Zonghan Wu",
      "Shirui Pan",
      "Guodong Long",
      "Jing Jiang",
      "Chengqi Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.11214",
    "title": "Human Pose Estimation from Sparse Inertial Measurements through  Recurrent Graph Convolution",
    "abstract": " Comments: Preprint, in submission ",
    "url": "https://arxiv.org/abs/2107.11214",
    "authors": [
      "Patrik Puchert",
      "Timo Ropinski"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.12022",
    "title": "Distributed Neighbor Selection in Multi-agent Networks",
    "abstract": " Title: Distributed Neighbor Selection in Multi-agent Networks ",
    "url": "https://arxiv.org/abs/2107.12022",
    "authors": [
      "Haibin Shao",
      "Lulu Pan",
      "Mehran Mesbahi",
      "Yugeng Xi",
      "Dewei Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2108.01750",
    "title": "Ellipsotopes: Combining Ellipsoids and Zonotopes for Reachability  Analysis and Fault Detection",
    "abstract": " Title: Ellipsotopes: Combining Ellipsoids and Zonotopes for Reachability  Analysis and Fault Detection ",
    "url": "https://arxiv.org/abs/2108.01750",
    "authors": [
      "Shreyas Kousik",
      "Adam Dai",
      "Grace Gao"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2109.01903",
    "title": "Robust fine-tuning of zero-shot models",
    "abstract": " Comments: CVPR 2022 ",
    "url": "https://arxiv.org/abs/2109.01903",
    "authors": [
      "Mitchell Wortsman",
      "Gabriel Ilharco",
      "Jong Wook Kim",
      "Mike Li",
      "Simon Kornblith",
      "Rebecca Roelofs",
      "Raphael Gontijo-Lopes",
      "Hannaneh Hajishirzi",
      "Ali Farhadi",
      "Hongseok Namkoong",
      "Ludwig Schmidt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.00023",
    "title": "Mining for Strong Gravitational Lenses with Self-supervised Learning",
    "abstract": " Comments: 24 Pages, 15 figures, published in ApJ, data at github.com/georgestein/ssl-legacysurvey ",
    "url": "https://arxiv.org/abs/2110.00023",
    "authors": [
      "George Stein",
      "Jacqueline Blaum",
      "Peter Harrington",
      "Tomislav Medan",
      "Zarija Lukic"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Cosmology and Nongalactic Astrophysics (astro-ph.CO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.09581",
    "title": "Improving GNSS Positioning using Neural Network-based Corrections",
    "abstract": " Comments: 15 pages, 8 figures, accepted in Navigation: Journal of the Institute of Navigation ",
    "url": "https://arxiv.org/abs/2110.09581",
    "authors": [
      "Ashwin V. Kanhere",
      "Shubh Gupta",
      "Akshay Shetty",
      "Grace Gao"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2111.02541",
    "title": "Asymptotic-Preserving Neural Networks for Multiscale Time-Dependent  Linear Transport Equations",
    "abstract": " Title: Asymptotic-Preserving Neural Networks for Multiscale Time-Dependent  Linear Transport Equations ",
    "url": "https://arxiv.org/abs/2111.02541",
    "authors": [
      "Shi Jin",
      "Zheng Ma",
      "Keke Wu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2111.07764",
    "title": "Fidelity-Guarantee Entanglement Routing in Quantum Networks",
    "abstract": " Title: Fidelity-Guarantee Entanglement Routing in Quantum Networks ",
    "url": "https://arxiv.org/abs/2111.07764",
    "authors": [
      "Jian Li",
      "Mingjun Wang",
      "Qidong Jia",
      "Kaiping Xue",
      "Nenghai Yu",
      "Qibin Sun",
      "Jun Lu"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2111.11011",
    "title": "CDistNet: Perceiving Multi-Domain Character Distance for Robust Text  Recognition",
    "abstract": " Title: CDistNet: Perceiving Multi-Domain Character Distance for Robust Text  Recognition ",
    "url": "https://arxiv.org/abs/2111.11011",
    "authors": [
      "Tianlun Zheng",
      "Zhineng Chen",
      "Shancheng Fang",
      "Hongtao Xie",
      "Yu-Gang Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.15415",
    "title": "Establishing the Price of Privacy in Federated Data Trading",
    "abstract": " Title: Establishing the Price of Privacy in Federated Data Trading ",
    "url": "https://arxiv.org/abs/2111.15415",
    "authors": [
      "Kangsoo Jung",
      "Sayan Biswas",
      "Catuscia Palamidessi"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2112.10006",
    "title": "Contextual Semantic Embeddings for Ontology Subsumption Prediction",
    "abstract": " Title: Contextual Semantic Embeddings for Ontology Subsumption Prediction ",
    "url": "https://arxiv.org/abs/2112.10006",
    "authors": [
      "Jiaoyan Chen",
      "Yuan He",
      "Yuxia Geng",
      "Ernesto Jimenez-Ruiz",
      "Hang Dong",
      "Ian Horrocks"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.00443",
    "title": "Scene Graph Generation: A Comprehensive Survey",
    "abstract": " Comments: Submitted to TPAMI ",
    "url": "https://arxiv.org/abs/2201.00443",
    "authors": [
      "Guangming Zhu",
      "Liang Zhang",
      "Youliang Jiang",
      "Yixuan Dang",
      "Haoran Hou",
      "Peiyi Shen",
      "Mingtao Feng",
      "Xia Zhao",
      "Qiguang Miao",
      "Syed Afaq Ali Shah",
      "Mohammed Bennamoun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.01232",
    "title": "Exploring Longitudinal Cough, Breath, and Voice Data for COVID-19  Progression Prediction via Sequential Deep Learning: Model Development and  Validation",
    "abstract": " Comments: Updated title. Revised format according to journal requirements ",
    "url": "https://arxiv.org/abs/2201.01232",
    "authors": [
      "Ting Dang",
      "Jing Han",
      "Tong Xia",
      "Dimitris Spathis",
      "Erika Bondareva",
      "Chloë Siegele-Brown",
      "Jagmohan Chauhan",
      "Andreas Grammenos",
      "Apinan Hasthanasombat",
      "Andres Floto",
      "Pietro Cicuta",
      "Cecilia Mascolo"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2201.03454",
    "title": "3D Face Morphing Attacks: Generation, Vulnerability and Detection",
    "abstract": " Comments: The paper is currently under review at IEEE Transactions on Biometrics, Behavior and Identity Science ",
    "url": "https://arxiv.org/abs/2201.03454",
    "authors": [
      "Jag Mohan Singh",
      "Raghavendra Ramachandra"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.09672",
    "title": "PH-Net: Parallelepiped Microstructure Homogenization via 3D  Convolutional Neural Networks",
    "abstract": " Title: PH-Net: Parallelepiped Microstructure Homogenization via 3D  Convolutional Neural Networks ",
    "url": "https://arxiv.org/abs/2201.09672",
    "authors": [
      "Hao Peng",
      "An Liu",
      "Jingcheng Huang",
      "Lingxin Cao",
      "Jikai Liu",
      "Lin Lu"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2201.10620",
    "title": "Structural importance and evolution: an application to financial  transaction networks",
    "abstract": " Title: Structural importance and evolution: an application to financial  transaction networks ",
    "url": "https://arxiv.org/abs/2201.10620",
    "authors": [
      "Isobel Seabrook",
      "Paolo Barucca",
      "Fabio Caccioli"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2201.12489",
    "title": "A Context-Integrated Transformer-Based Neural Network for Auction Design",
    "abstract": " Comments: Accepted by ICML 2022 ",
    "url": "https://arxiv.org/abs/2201.12489",
    "authors": [
      "Zhijian Duan",
      "Jingwu Tang",
      "Yutong Yin",
      "Zhe Feng",
      "Xiang Yan",
      "Manzil Zaheer",
      "Xiaotie Deng"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2201.13100",
    "title": "Adversarial Masking for Self-Supervised Learning",
    "abstract": " Title: Adversarial Masking for Self-Supervised Learning ",
    "url": "https://arxiv.org/abs/2201.13100",
    "authors": [
      "Yuge Shi",
      "N. Siddharth",
      "Philip H.S. Torr",
      "Adam R. Kosiorek"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.02394",
    "title": "JARVix at SemEval-2022 Task 2: It Takes One to Know One? Idiomaticity  Detection using Zero and One Shot Learning",
    "abstract": " Comments: Accepted at the 16th International Workshop on Semantic Evaluation (SemEval-2022), NAACL. Best Project Award for Georgia Tech CS 7650. Code available at this https URL ",
    "url": "https://arxiv.org/abs/2202.02394",
    "authors": [
      "Yash Jakhotiya",
      "Vaibhav Kumar",
      "Ashwin Pathak",
      "Raj Shah"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03008",
    "title": "Algorithms that get old : the case of generative deep neural networks",
    "abstract": " Title: Algorithms that get old : the case of generative deep neural networks ",
    "url": "https://arxiv.org/abs/2202.03008",
    "authors": [
      "Gabriel Turinici"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04256",
    "title": "GiraffeDet: A Heavy-Neck Paradigm for Object Detection",
    "abstract": " Title: GiraffeDet: A Heavy-Neck Paradigm for Object Detection ",
    "url": "https://arxiv.org/abs/2202.04256",
    "authors": [
      "Yiqi Jiang",
      "Zhiyu Tan",
      "Junyan Wang",
      "Xiuyu Sun",
      "Ming Lin",
      "Hao Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.06558",
    "title": "Saute RL: Almost Surely Safe Reinforcement Learning Using State  Augmentation",
    "abstract": " Comments: ICML 2022 ",
    "url": "https://arxiv.org/abs/2202.06558",
    "authors": [
      "Aivar Sootla",
      "Alexander I. Cowen-Rivers",
      "Taher Jafferjee",
      "Ziyan Wang",
      "David Mguni",
      "Jun Wang",
      "Haitham Bou-Ammar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.09550",
    "title": "Multi-similarity based Hyperrelation Network for few-shot segmentation",
    "abstract": " Title: Multi-similarity based Hyperrelation Network for few-shot segmentation ",
    "url": "https://arxiv.org/abs/2203.09550",
    "authors": [
      "Xiangwen Shi",
      "Zhe Cui",
      "Shaobing Zhang",
      "Miao Cheng",
      "Lian He",
      "Xianghong Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.15936",
    "title": "Supervised Graph Contrastive Learning for Few-shot Node Classification",
    "abstract": " Comments: Accepted to ECML-PKDD 2022 ",
    "url": "https://arxiv.org/abs/2203.15936",
    "authors": [
      "Zhen Tan",
      "Kaize Ding",
      "Ruocheng Guo",
      "Huan Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.05351",
    "title": "Graph Ordering Attention Networks",
    "abstract": " Comments: 10 pages,3 figures ",
    "url": "https://arxiv.org/abs/2204.05351",
    "authors": [
      "Michail Chatzianastasis",
      "Johannes F. Lutzeyer",
      "George Dasoulas",
      "Michalis Vazirgiannis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.06250",
    "title": "Large-scale multi-objective influence maximisation with network  downscaling",
    "abstract": " Title: Large-scale multi-objective influence maximisation with network  downscaling ",
    "url": "https://arxiv.org/abs/2204.06250",
    "authors": [
      "Elia Cunegatti",
      "Giovanni Iacca",
      "Doina Bucur"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.08759",
    "title": "Edge-enhanced Feature Distillation Network for Efficient  Super-Resolution",
    "abstract": " Comments: Accepted to NTIRE workshop at CVPR 2022 ",
    "url": "https://arxiv.org/abs/2204.08759",
    "authors": [
      "Yan Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.08999",
    "title": "STPA-driven Multilevel Runtime Monitoring for In-time Hazard Detection",
    "abstract": " Title: STPA-driven Multilevel Runtime Monitoring for In-time Hazard Detection ",
    "url": "https://arxiv.org/abs/2204.08999",
    "authors": [
      "Smitha Gautham",
      "Georgios Bakirtzis",
      "Alexander Will",
      "Athira V. Jayakumar",
      "Carl R. Elks"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.11326",
    "title": "Beyond the Quadratic Approximation: the Multiscale Structure of Neural  Network Loss Landscapes",
    "abstract": " Title: Beyond the Quadratic Approximation: the Multiscale Structure of Neural  Network Loss Landscapes ",
    "url": "https://arxiv.org/abs/2204.11326",
    "authors": [
      "Chao Ma",
      "Daniel Kunin",
      "Lei Wu",
      "Lexing Ying"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12227",
    "title": "Open or not open: Are conventional radio access networks more secure and  trustworthy than Open-RAN?",
    "abstract": " Comments: Updates in Section III ",
    "url": "https://arxiv.org/abs/2204.12227",
    "authors": [
      "Felix Klement",
      "Stefan Katzenbeisser",
      "Vincent Ulitzsch",
      "Juliane Krämer",
      "Slawomir Stanczak",
      "Zoran Utkovski",
      "Igor Bjelakovic",
      "Gerhard Wunder"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.12584",
    "title": "Fast Aquatic Swimmer Optimization with Differentiable Projective  Dynamics and Neural Network Hydrodynamic Models",
    "abstract": " Comments: ICML 2022 ",
    "url": "https://arxiv.org/abs/2204.12584",
    "authors": [
      "Elvis Nava",
      "John Z. Zhang",
      "Mike Y. Michelis",
      "Tao Du",
      "Pingchuan Ma",
      "Benjamin F. Grewe",
      "Wojciech Matusik",
      "Robert K. Katzschmann"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2205.10338",
    "title": "Efficient visual object representation using a biologically plausible  spike-latency code and winner-take-all inhibition",
    "abstract": " Title: Efficient visual object representation using a biologically plausible  spike-latency code and winner-take-all inhibition ",
    "url": "https://arxiv.org/abs/2205.10338",
    "authors": [
      "Melani Sanchez-Garcia",
      "Tushar Chauhan",
      "Benoit R. Cottereau",
      "Michael Beyeler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.10683",
    "title": "Scalable and Efficient Training of Large Convolutional Neural Networks  with Differential Privacy",
    "abstract": " Title: Scalable and Efficient Training of Large Convolutional Neural Networks  with Differential Privacy ",
    "url": "https://arxiv.org/abs/2205.10683",
    "authors": [
      "Zhiqi Bu",
      "Jialin Mao",
      "Shiyun Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Complexity (cs.CC)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.15582",
    "title": "An Effective Fusion Method to Enhance the Robustness of CNN",
    "abstract": " Comments: We need to fix some errors ",
    "url": "https://arxiv.org/abs/2205.15582",
    "authors": [
      "Yating Ma",
      "Zhichao Lian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.01736",
    "title": "Adaptive Adversarial Training to Improve Adversarial Robustness of DNNs  for Medical Image Segmentation and Detection",
    "abstract": " Comments: 17 pages ",
    "url": "https://arxiv.org/abs/2206.01736",
    "authors": [
      "Linhai Ma",
      "Liang Liang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.03715",
    "title": "Modularized Transfer Learning with Multiple Knowledge Graphs for  Zero-shot Commonsense Reasoning",
    "abstract": " Comments: Accepted to NAACL2022 ",
    "url": "https://arxiv.org/abs/2206.03715",
    "authors": [
      "Yu Jin Kim",
      "Beong-woo Kwak",
      "Youngwook Kim",
      "Reinald Kim Amplayo",
      "Seung-won Hwang",
      "Jinyoung Yeo"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.04860",
    "title": "Conformal Prediction Intervals for Markov Decision Process Trajectories",
    "abstract": " Comments: 25 pages, 15 figures, 2 tables. Fixed typos and an error in the appendix plots ",
    "url": "https://arxiv.org/abs/2206.04860",
    "authors": [
      "Thomas G. Dietterich",
      "Jesse Hostetler"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2206.06908",
    "title": "LPCSE: Neural Speech Enhancement through Linear Predictive Coding",
    "abstract": " Title: LPCSE: Neural Speech Enhancement through Linear Predictive Coding ",
    "url": "https://arxiv.org/abs/2206.06908",
    "authors": [
      "Yang Liu",
      "Na Tang",
      "Xiaoli Chu",
      "Yang Yang",
      "Jun Wang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2206.07665",
    "title": "Region-enhanced Deep Graph Convolutional Networks for Rumor Detection",
    "abstract": " Title: Region-enhanced Deep Graph Convolutional Networks for Rumor Detection ",
    "url": "https://arxiv.org/abs/2206.07665",
    "authors": [
      "Ge Wang",
      "Li Tan",
      "Tianbao Song",
      "Wei Wang",
      "Ziliang Shang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.08523",
    "title": "A Spatio-Temporal Neural Network Forecasting Approach for Emulation of  Firefront Models",
    "abstract": " Title: A Spatio-Temporal Neural Network Forecasting Approach for Emulation of  Firefront Models ",
    "url": "https://arxiv.org/abs/2206.08523",
    "authors": [
      "Andrew Bolt",
      "Carolyn Huston",
      "Petra Kuhnert",
      "Joel Janek Dabrowski",
      "James Hilton",
      "Conrad Sanderson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.08675",
    "title": "Understanding Robust Overfitting of Adversarial Training and Beyond",
    "abstract": " Comments: ICML2022 ",
    "url": "https://arxiv.org/abs/2206.08675",
    "authors": [
      "Chaojian Yu",
      "Bo Han",
      "Li Shen",
      "Jun Yu",
      "Chen Gong",
      "Mingming Gong",
      "Tongliang Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.09112",
    "title": "Decoupled Dynamic Spatial-Temporal Graph Neural Network for Traffic  Forecasting",
    "abstract": " Comments: PVLDB 2022 ",
    "url": "https://arxiv.org/abs/2206.09112",
    "authors": [
      "Zezhi Shao",
      "Zhao Zhang",
      "Wei Wei",
      "Fei Wang",
      "Yongjun Xu",
      "Xin Cao",
      "Christian S. Jensen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.09153",
    "title": "Markov Chain Approaches to Payoff Optimization in the Self-Organizing  Network Coloring Game",
    "abstract": " Comments: 10 Pages; 5 Figures ",
    "url": "https://arxiv.org/abs/2206.09153",
    "authors": [
      "Zeyi Chen"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Computer Science and Game Theory (cs.GT)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2206.09182",
    "title": "Coin Flipping Neural Networks",
    "abstract": " Title: Coin Flipping Neural Networks ",
    "url": "https://arxiv.org/abs/2206.09182",
    "authors": [
      "Yuval Sieradzki",
      "Nitzan Hodos",
      "Gal Yehuda",
      "Assaf Schuster"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.09193",
    "title": "Multi-Modality Image Super-Resolution using Generative Adversarial  Networks",
    "abstract": " Comments: to be published in the Proceedings of 16th International Conference on Computer Graphics, Visualization, Computer Vision and Image Processing (CGVCVIP), Lisbon, Portugal, July 2022 ",
    "url": "https://arxiv.org/abs/2206.09193",
    "authors": [
      "Aref Abedjooy",
      "Mehran Ebrahimi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.09210",
    "title": "Multi-Modality Image Inpainting using Generative Adversarial Networks",
    "abstract": " Comments: to be published in the Proceedings of 26th Int'l Conf on Image Processing, Computer Vision, & Pattern Recognition (IPCV), July 2022 ",
    "url": "https://arxiv.org/abs/2206.09210",
    "authors": [
      "Aref Abedjooy",
      "Mehran Ebrahimi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.09513",
    "title": "$C^*$-algebra Net: A New Approach Generalizing Neural Network Parameters  to $C^*$-algebra",
    "abstract": " Comments: Accepted at ICML 2022 ",
    "url": "https://arxiv.org/abs/2206.09513",
    "authors": [
      "Yuka Hashimoto",
      "Zhao Wang",
      "Tomoko Matsui"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.09522",
    "title": "Multiple Testing Framework for Out-of-Distribution Detection",
    "abstract": " Title: Multiple Testing Framework for Out-of-Distribution Detection ",
    "url": "https://arxiv.org/abs/2206.09522",
    "authors": [
      "Akshayaa Magesh",
      "Venugopal V. Veeravalli",
      "Anirban Roy",
      "Susmit Jha"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.09607",
    "title": "NLOS Ranging Mitigation with Neural Network Model for UWB Localization",
    "abstract": " Comments: Accepted by 2022 IEEE International Conference on Automation Science and Engineering (CASE) ",
    "url": "https://arxiv.org/abs/2206.09607",
    "authors": [
      "Muhammad Shalihan",
      "Ran Liu",
      "Chau Yuen"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2206.09818",
    "title": "SMT-DTA: Improving Drug-Target Affinity Prediction with Semi-supervised  Multi-task Training",
    "abstract": " Title: SMT-DTA: Improving Drug-Target Affinity Prediction with Semi-supervised  Multi-task Training ",
    "url": "https://arxiv.org/abs/2206.09818",
    "authors": [
      "Qizhi Pei",
      "Lijun Wu",
      "Jinhua Zhu",
      "Yingce Xia",
      "Shufang Xie",
      "Tao Qin",
      "Haiguang Liu",
      "Tie-Yan Liu"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.09901",
    "title": "Only Tails Matter: Average-Case Universality and Robustness in the  Convex Regime",
    "abstract": " Comments: To be published in ICML 2022 ",
    "url": "https://arxiv.org/abs/2206.09901",
    "authors": [
      "Leonardo Cunha",
      "Gauthier Gidel",
      "Fabian Pedregosa",
      "Damien Scieur",
      "Courtney Paquette"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.09960",
    "title": "A Fast Algorithm for Ranking Users by their Influence in Online Social  Platforms",
    "abstract": " Comments: Submitted to the 2022 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM) ",
    "url": "https://arxiv.org/abs/2206.09960",
    "authors": [
      "Nouamane Arhachoui",
      "Esteban Bautista",
      "Maximilien Danisch",
      "Anastasios Giovanidis"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2206.10137",
    "title": "Few-Max: Few-Shot Domain Adaptation for Unsupervised Contrastive  Representation Learning",
    "abstract": " Title: Few-Max: Few-Shot Domain Adaptation for Unsupervised Contrastive  Representation Learning ",
    "url": "https://arxiv.org/abs/2206.10137",
    "authors": [
      "Ali Lotfi Rezaabad",
      "Sidharth Kumar",
      "Sriram Vishwanath",
      "Jonathan I. Tamir"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10289",
    "title": "Imitation Learning for Nonprehensile Manipulation through  Self-Supervised Learning Considering Motion Speed",
    "abstract": " Comments: Copyright 2022 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses, in any current or future media, including reprinting/republishing this material for advertising or promotional purposes, creating new collective works, for resale or redistribution to servers or lists, or reuse of any copyrighted component of this work in other works ",
    "url": "https://arxiv.org/abs/2206.10289",
    "authors": [
      "Yuki Saigusa",
      "Sho Sakaino",
      "Toshiaki Tsuji"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2206.10397",
    "title": "Neural Moving Horizon Estimation for Robust Flight Control",
    "abstract": " Title: Neural Moving Horizon Estimation for Robust Flight Control ",
    "url": "https://arxiv.org/abs/2206.10397",
    "authors": [
      "Bingheng Wang",
      "Zhengtian Ma",
      "Shupeng Lai",
      "Lin Zhao"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2206.10469",
    "title": "The Privacy Onion Effect: Memorization is Relative",
    "abstract": " Title: The Privacy Onion Effect: Memorization is Relative ",
    "url": "https://arxiv.org/abs/2206.10469",
    "authors": [
      "Nicholas Carlini",
      "Matthew Jagielski",
      "Chiyuan Zhang",
      "Nicolas Papernot",
      "Andreas Terzis",
      "Florian Tramer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2206.10525",
    "title": "Three-way optimization of privacy and utility of location data",
    "abstract": " Title: Three-way optimization of privacy and utility of location data ",
    "url": "https://arxiv.org/abs/2206.10525",
    "authors": [
      "Sayan Biswas",
      "Catuscia Palamidessi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)",
      "Probability (math.PR)"
    ]
  }
]