[
  {
    "id": "arXiv:2110.09519",
    "title": "Protection of the patient data against intentional attacks using a  hybrid robust watermarking code",
    "abstract": "The security of patient information is important during the transfer of medical data. A hybrid spatial domain watermarking algorithm that includes encryption, integrity protection and steganography is proposed to strengthen the information originality based on the authentication. The proposed algorithm checks whether the information of patients has been deliberately changed or not. The created code is distributed at every pixel of the medical image and not only in the regions of noninterest pixels, while the image details are still preserved. To enhance the security of the watermarking code, \"SHA-1\" is used to get the initial key for the Symmetric Encryption Algorithm. The target of this approach is to preserve the content of the image and the watermark simultaneously, this is achieved by synthesizing an encrypted watermark from one of the components of the original image and not by embedding a watermark in the image. To evaluate the proposed code the Least Significant Bit (LSB), Bit2SB, and Bit3SB were used. The evaluation of the proposed code showed that the LSB is of better quality but overall the Bit2SB is better in its ability against the active attacks up to a size of 2*2 pixels, and it preserves the high image quality. ",
    "url": "https://arxiv.org/abs/2110.09519",
    "authors": [
      "Ahmad Nagm",
      "Mohammed Safy Elwan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2110.09681",
    "title": "Permutation invariant graph-to-sequence model for template-free  retrosynthesis and reaction prediction",
    "abstract": "Synthesis planning and reaction outcome prediction are two fundamental problems in computer-aided organic chemistry for which a variety of data-driven approaches have emerged. Natural language approaches that model each problem as a SMILES-to-SMILES translation lead to a simple end-to-end formulation, reduce the need for data preprocessing, and enable the use of well-optimized machine translation model architectures. However, SMILES representations are not an efficient representation for capturing information about molecular structures, as evidenced by the success of SMILES augmentation to boost empirical performance. Here, we describe a novel Graph2SMILES model that combines the power of Transformer models for text generation with the permutation invariance of molecular graph encoders that mitigates the need for input data augmentation. As an end-to-end architecture, Graph2SMILES can be used as a drop-in replacement for the Transformer in any task involving molecule(s)-to-molecule(s) transformations. In our encoder, an attention-augmented directed message passing neural network (D-MPNN) captures local chemical environments, and the global attention encoder allows for long-range and intermolecular interactions, enhanced by graph-aware positional embedding. Graph2SMILES improves the top-1 accuracy of the Transformer baselines by $1.7\\%$ and $1.9\\%$ for reaction outcome prediction on USPTO_480k and USPTO_STEREO datasets respectively, and by $9.8\\%$ for one-step retrosynthesis on the USPTO_50k dataset. ",
    "url": "https://arxiv.org/abs/2110.09681",
    "authors": [
      "Zhengkai Tu",
      "Connor W. Coley"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.09702",
    "title": "A non-hierarchical attention network with modality dropout for textual  response generation in multimodal dialogue systems",
    "abstract": "Existing text- and image-based multimodal dialogue systems use the traditional Hierarchical Recurrent Encoder-Decoder (HRED) framework, which has an utterance-level encoder to model utterance representation and a context-level encoder to model context representation. Although pioneer efforts have shown promising performances, they still suffer from the following challenges: (1) the interaction between textual features and visual features is not fine-grained enough. (2) the context representation can not provide a complete representation for the context. To address the issues mentioned above, we propose a non-hierarchical attention network with modality dropout, which abandons the HRED framework and utilizes attention modules to encode each utterance and model the context representation. To evaluate our proposed model, we conduct comprehensive experiments on a public multimodal dialogue dataset. Automatic and human evaluation demonstrate that our proposed model outperforms the existing methods and achieves state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2110.09702",
    "authors": [
      "Rongyi Sun",
      "Borun Chen",
      "Qingyu Zhou",
      "Yinghui Li",
      "YunBo Cao",
      "Hai-Tao Zheng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2110.09773",
    "title": "Effective calculation of the causal capacitance matrix of a  multiconductor transmission line in the range of parameters by the method of  moments",
    "abstract": "The paper proposes a technique of non-uniform segmentation of multiconductor transmission lines with edge coupling. This technique allows obtaining causal capacitance matrices with the lowest computational costs on multivariate analysis in the range of the lines parameters. It was found that time savings could achieve 49%. ",
    "url": "https://arxiv.org/abs/2110.09773",
    "authors": [
      "A.E. Maksimov",
      "S.P. Kuksenko"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2110.09778",
    "title": "Explaining Deep Tractable Probabilistic Models: The sum-product network  case",
    "abstract": "We consider the problem of explaining a tractable deep probabilistic model, the Sum-Product Networks (SPNs).To this effect, we define the notion of a context-specific independence tree and present an iterative algorithm that converts an SPN to a CSI-tree. The resulting CSI-tree is both interpretable and explainable to the domain expert. To further compress the tree, we approximate the CSIs by fitting a supervised classifier. Our extensive empirical evaluations on synthetic, standard, and real-world clinical data sets demonstrate that the resulting models exhibit superior explainability without loss in performance. ",
    "url": "https://arxiv.org/abs/2110.09778",
    "authors": [
      "Athresh Karanam",
      "Saurabh Mathur",
      "Predrag Radivojac",
      "Kristian Kersting",
      "Sriraam Natarajan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.09866",
    "title": "Learning a self-supervised tone mapping operator via feature contrast  masking loss",
    "abstract": "High Dynamic Range (HDR) content is becoming ubiquitous due to the rapid development of capture technologies. Nevertheless, the dynamic range of common display devices is still limited, therefore tone mapping (TM) remains a key challenge for image visualization. Recent work has demonstrated that neural networks can achieve remarkable performance in this task when compared to traditional methods, however, the quality of the results of these learning-based methods is limited by the training data. Most existing works use as training set a curated selection of best-performing results from existing traditional tone mapping operators (often guided by a quality metric), therefore, the quality of newly generated results is fundamentally limited by the performance of such operators. This quality might be even further limited by the pool of HDR content that is used for training. In this work we propose a learning-based self-supervised tone mapping operator that is trained at test time specifically for each HDR image and does not need any data labeling. The key novelty of our approach is a carefully designed loss function built upon fundamental knowledge on contrast perception that allows for directly comparing the content in the HDR and tone mapped images. We achieve this goal by reformulating classic VGG feature maps into feature contrast maps that normalize local feature differences by their average magnitude in a local neighborhood, allowing our loss to account for contrast masking effects. We perform extensive ablation studies and exploration of parameters and demonstrate that our solution outperforms existing approaches with a single set of fixed parameters, as confirmed by both objective and subjective metrics. ",
    "url": "https://arxiv.org/abs/2110.09866",
    "authors": [
      "Chao Wang",
      "Bin Chen",
      "Hans-Peter Seidel",
      "Karol Myszkowski",
      "Ana Serrano"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2110.09815",
    "title": "Microstructure reconstruction via artificial neural networks: A  combination of causal and non-causal approach",
    "abstract": "We investigate the applicability of artificial neural networks (ANNs) in reconstructing a sample image of a sponge-like microstructure. We propose to reconstruct the image by predicting the phase of the current pixel based on its causal neighbourhood, and subsequently, use a non-causal ANN model to smooth out the reconstructed image as a form of post-processing. We also consider the impacts of different configurations of the ANN model (e.g. number of densely connected layers, number of neurons in each layer, the size of both the causal and non-causal neighbourhood) on the models' predictive abilities quantified by the discrepancy between the spatial statistics of the reference and the reconstructed sample. ",
    "url": "https://arxiv.org/abs/2110.09815",
    "authors": [
      "Kryštof Latka",
      "Martin Doškář",
      "Jan Zeman"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.10080",
    "title": "Surrogate and inverse modeling for two-phase flow in porous media via  theory-guided convolutional neural network",
    "abstract": "The theory-guided convolutional neural network (TgCNN) framework, which can incorporate discretized governing equation residuals into the training of convolutional neural networks (CNNs), is extended to two-phase porous media flow problems in this work. The two principal variables of the considered problem, pressure and saturation, are approximated simultaneously with two CNNs, respectively. Pressure and saturation are coupled with each other in the governing equations, and thus the two networks are also mutually conditioned in the training process by the discretized governing equations, which also increases the difficulty of model training. The coupled and discretized equations can provide valuable information in the training process. With the assistance of theory-guidance, the TgCNN surrogates can achieve better accuracy than ordinary CNN surrogates in two-phase flow problems. Moreover, a piecewise training strategy is proposed for the scenario with varying well controls, in which the TgCNN surrogates are constructed for different segments on the time dimension and stacked together to predict solutions for the whole time-span. For scenarios with larger variance of the formation property field, the TgCNN surrogates can also achieve satisfactory performance. The constructed TgCNN surrogates are further used for inversion of permeability fields by combining them with the iterative ensemble smoother (IES) algorithm, and sufficient inversion accuracy is obtained with improved efficiency. ",
    "url": "https://arxiv.org/abs/2110.10080",
    "authors": [
      "Nanzhe Wang",
      "Haibin Chang",
      "Dongxiao Zhang"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:1812.09691",
    "title": "Lower bounds on the chromatic number of random graphs",
    "abstract": " Title: Lower bounds on the chromatic number of random graphs ",
    "url": "https://arxiv.org/abs/1812.09691",
    "authors": [
      "Peter Ayre",
      "Amin Coja-Oghlan",
      "Catherine Greenhill"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:1911.08593",
    "title": "Multi-attribute community detection in International Trade Network",
    "abstract": " Title: Multi-attribute community detection in International Trade Network ",
    "url": "https://arxiv.org/abs/1911.08593",
    "authors": [
      "Paolo Bartesaghi",
      "Stefano Benati",
      "Gian Paolo Clemente",
      "Rosanna Grassi"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2006.12994",
    "title": "On the flip graphs on perfect matchings of complete graphs and signed  reversal graphs",
    "abstract": " Comments: 15 pages, 6 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2006.12994",
    "authors": [
      "Sebastian M. Cioabă",
      "Gordon Royle",
      "Zhao Kuang Tan"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2011.08001",
    "title": "Deep-LIBRA: Artificial intelligence method for robust quantification of  breast density with independent validation in breast cancer risk assessment",
    "abstract": " Title: Deep-LIBRA: Artificial intelligence method for robust quantification of  breast density with independent validation in breast cancer risk assessment ",
    "url": "https://arxiv.org/abs/2011.08001",
    "authors": [
      "Omid Haji Maghsoudi",
      "Aimilia Gastounioti",
      "Christopher Scott",
      "Lauren Pantalone",
      "Fang-Fang Wu",
      "Eric A. Cohen",
      "Stacey Winham",
      "Emily F. Conant",
      "Celine Vachon",
      "Despina Kontos"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2102.11991",
    "title": "Being correct is not enough: efficient verification using robust linear  temporal logic",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:1510.08970. v2 notes: Proof on the complexity of translating rLTL formulae to LTL formulae via the rewriting approach. New case study on the scalability of rLTL formulae in the proposed fragment. Accepted to appear in ACM Transactions on Computational Logic ",
    "url": "https://arxiv.org/abs/2102.11991",
    "authors": [
      "Tzanis Anevlavis",
      "Matthew Philippe",
      "Daniel Neider",
      "Paulo Tabuada"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)",
      "Computational Complexity (cs.CC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2102.13566",
    "title": "Sparse approximation in learning via neural ODEs",
    "abstract": " Comments: 24 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2102.13566",
    "authors": [
      "Carlos Esteve-Yagüe",
      "Borjan Geshkovski"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2109.05948",
    "title": "A deep learning guided memetic framework for graph coloring problems",
    "abstract": " Title: A deep learning guided memetic framework for graph coloring problems ",
    "url": "https://arxiv.org/abs/2109.05948",
    "authors": [
      "Olivier Goudet",
      "Cyril Grelier",
      "Jin-Kao Hao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.09304",
    "title": "Deformed semicircle law and concentration of nonlinear random matrices  for ultra-wide neural networks",
    "abstract": " Comments: 46 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2109.09304",
    "authors": [
      "Zhichao Wang",
      "Yizhe Zhu"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)",
      "Machine Learning (stat.ML)"
    ]
  }
]