[
  {
    "id": "arXiv:2209.06235",
    "title": "Improving Self-Supervised Learning by Characterizing Idealized  Representations",
    "abstract": "Despite the empirical successes of self-supervised learning (SSL) methods, it is unclear what characteristics of their representations lead to high downstream accuracies. In this work, we characterize properties that SSL representations should ideally satisfy. Specifically, we prove necessary and sufficient conditions such that for any task invariant to given data augmentations, desired probes (e.g., linear or MLP) trained on that representation attain perfect accuracy. These requirements lead to a unifying conceptual framework for improving existing SSL methods and deriving new ones. For contrastive learning, our framework prescribes simple but significant improvements to previous methods such as using asymmetric projection heads. For non-contrastive learning, we use our framework to derive a simple and novel objective. Our resulting SSL algorithms outperform baselines on standard benchmarks, including SwAV+multicrops on linear probing of ImageNet. ",
    "url": "https://arxiv.org/abs/2209.06235",
    "authors": [
      "Yann Dubois",
      "Tatsunori Hashimoto",
      "Stefano Ermon",
      "Percy Liang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.06262",
    "title": "Unifying Causal Inference and Reinforcement Learning using Higher-Order  Category Theory",
    "abstract": "We present a unified formalism for structure discovery of causal models and predictive state representation (PSR) models in reinforcement learning (RL) using higher-order category theory. Specifically, we model structure discovery in both settings using simplicial objects, contravariant functors from the category of ordinal numbers into any category. Fragments of causal models that are equivalent under conditional independence -- defined as causal horns -- as well as subsequences of potential tests in a predictive state representation -- defined as predictive horns -- are both special cases of horns of a simplicial object, subsets resulting from the removal of the interior and the face opposite a particular vertex. Latent structure discovery in both settings involve the same fundamental mathematical problem of finding extensions of horns of simplicial objects through solving lifting problems in commutative diagrams, and exploiting weak homotopies that define higher-order symmetries. Solutions to the problem of filling \"inner\" vs \"outer\" horns leads to various notions of higher-order categories, including weak Kan complexes and quasicategories. We define the abstract problem of structure discovery in both settings in terms of adjoint functors between the category of universal causal models or universal decision models and its simplicial object representation. ",
    "url": "https://arxiv.org/abs/2209.06262",
    "authors": [
      "Sridhar Mahadevan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Category Theory (math.CT)"
    ]
  },
  {
    "id": "arXiv:2209.06267",
    "title": "Co-Design of Watermarking and Robust Control for Security in  Cyber-Physical Systems",
    "abstract": "This work discusses a novel framework for simultaneous synthesis of optimal watermarking signal and robust controllers in cyber-physical systems to minimize the loss in performance due to added watermarking signal and to maximize the detection rate of the attack. A general dynamic controller is designed to improve system performance with respect to the $\\mathcal H_2$ norm, while a watermarking signal is added to improve security performance concerning the detection rate of replay attacks. The attack model considered in the paper is a replay attack, a natural attack mode when the dynamics of the system is unknown to the attacker. The paper first generalizes the existing result on the detection rate of $\\chi^2$ detector from a static-LQR controller to a general dynamic controller. The design improvements on both robustness and security fronts are obtained by iteratively solving the convex subsets of the formulated non-convex problem in terms of the controller and watermarking signal. A semi-definite programming optimization is formulated using Linear Matrix Inequality (LMI) results to solve the larger system-level design optimization problem. We highlight the effectiveness of our method over a simplified three-tank chemical system. ",
    "url": "https://arxiv.org/abs/2209.06267",
    "authors": [
      "Raman Goyal",
      "Christoforos Somarakis",
      "Erfaun Noorani",
      "Shantanu Rane"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2209.06273",
    "title": "Exploring Code Style Transfer with Neural Networks",
    "abstract": "Style is a significant component of natural language text, reflecting a change in the tone of text while keeping the underlying information the same. Even though programming languages have strict syntax rules, they also have style. Code can be written with the same functionality but using different language features. However, programming style is difficult to quantify, and thus as part of this work, we define style attributes, specifically for Python. To build a definition of style, we utilized hierarchical clustering to capture a style definition without needing to specify transformations. In addition to defining style, we explore the capability of a pre-trained code language model to capture information about code style. To do this, we fine-tuned pre-trained code-language models and evaluated their performance in code style transfer tasks. ",
    "url": "https://arxiv.org/abs/2209.06273",
    "authors": [
      "Karl Munson",
      "Anish Savla",
      "Chih-Kai Ting",
      "Serenity Wade",
      "Kiran Kate",
      "Kavitha Srinivas"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.06274",
    "title": "MLT-LE: predicting drug-target binding affinity with multi-task residual  neural networks",
    "abstract": "Assessing drug-target affinity is a critical step in the drug discovery and development process, but to obtain such data experimentally is both time consuming and expensive. For this reason, computational methods for predicting binding strength are being widely developed. However, these methods typically use a single-task approach for prediction, thus ignoring the additional information that can be extracted from the data and used to drive the learning process. Thereafter in this work, we present a multi-task approach for binding strength prediction. Our results suggest that these prediction can indeed benefit from a multi-task learning approach, by utilizing added information from related tasks and multi-task induced regularization. ",
    "url": "https://arxiv.org/abs/2209.06274",
    "authors": [
      "Elizaveta Vinogradova",
      "Karina Pats",
      "Ferdinand Molnár",
      "Siamac Fazli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06275",
    "title": "PANCETTA: Phoneme Aware Neural Completion to Elicit Tongue Twisters  Automatically",
    "abstract": "Tongue twisters are meaningful sentences that are difficult to pronounce. The process of automatically generating tongue twisters is challenging since the generated utterance must satisfy two conditions at once: phonetic difficulty and semantic meaning. Furthermore, phonetic difficulty is itself hard to characterize and is expressed in natural tongue twisters through a heterogeneous mix of phenomena such as alliteration and homophony. In this paper, we propose PANCETTA: Phoneme Aware Neural Completion to Elicit Tongue Twisters Automatically. We leverage phoneme representations to capture the notion of phonetic difficulty, and we train language models to generate original tongue twisters on two proposed task settings. To do this, we curate a dataset called PANCETTA, consisting of existing English tongue twisters. Through automatic and human evaluation, as well as qualitative analysis, we show that PANCETTA generates novel, phonetically difficult, fluent, and semantically meaningful tongue twisters. ",
    "url": "https://arxiv.org/abs/2209.06275",
    "authors": [
      "Sedrick Scott Keh",
      "Steven Y. Feng",
      "Varun Gangal",
      "Malihe Alikhani",
      "Eduard Hovy"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06292",
    "title": "ADMM based Distributed State Observer Design under Sparse Sensor Attacks",
    "abstract": "The Secure State Estimation (SSE) problem deals with the estimation of the system state in the presence of sensor attacks. We consider sparse attacks where the attacker targets a small subset of sensors. This paper proposes a distributed observer for state estimation and sparse attack detection in discrete time Linear Time Invariant (LTI) systems. An algorithm based on Alternating Direction Method of Multipliers (ADMM) is described for the same while formulating the SSE problem as a basis pursuit problem by exploiting the sparse nature of the attack vector. ",
    "url": "https://arxiv.org/abs/2209.06292",
    "authors": [
      "Vinaya Mary Prinse",
      "Rachel Kalpana Kalaimani"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2209.06300",
    "title": "PINCH: An Adversarial Extraction Attack Framework for Deep Learning  Models",
    "abstract": "Deep Learning (DL) models increasingly power a diversity of applications. Unfortunately, this pervasiveness also makes them attractive targets for extraction attacks which can steal the architecture, parameters, and hyper-parameters of a targeted DL model. Existing extraction attack studies have observed varying levels of attack success for different DL models and datasets, yet the underlying cause(s) behind their susceptibility often remain unclear. Ascertaining such root-cause weaknesses would help facilitate secure DL systems, though this requires studying extraction attacks in a wide variety of scenarios to identify commonalities across attack success and DL characteristics. The overwhelmingly high technical effort and time required to understand, implement, and evaluate even a single attack makes it infeasible to explore the large number of unique extraction attack scenarios in existence, with current frameworks typically designed to only operate for specific attack types, datasets and hardware platforms. In this paper we present PINCH: an efficient and automated extraction attack framework capable of deploying and evaluating multiple DL models and attacks across heterogeneous hardware platforms. We demonstrate the effectiveness of PINCH by empirically evaluating a large number of previously unexplored extraction attack scenarios, as well as secondary attack staging. Our key findings show that 1) multiple characteristics affect extraction attack success spanning DL model architecture, dataset complexity, hardware, attack type, and 2) partially successful extraction attacks significantly enhance the success of further adversarial attack staging. ",
    "url": "https://arxiv.org/abs/2209.06300",
    "authors": [
      "William Hackett",
      "Stefan Trawicki",
      "Zhengxin Yu",
      "Neeraj Suri",
      "Peter Garraghan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06324",
    "title": "Routing heterogeneous traffic in delay tolerant satellite networks",
    "abstract": "Delay Tolerant Networking (DTN) has been proposed as a new architecture to provide efficient store-carry-and-forward data transport in satellite networks. Since these networks relay on scheduled contact plans, the Contact Graph Routing (CGR) algorithm can be used to optimize routing and data delivery performance. However, in spite of the various improvements that have been made to CGR, there have been no significant proposals to prioritize traffic with different quality of service requirements. In this work we propose adaptations to CGR that allow performance improvements when sending traffic with different latency constraints, and develop a linear programming optimization model that works as a performance upper bound. The simulation results of the proposed schemes are promising and open the debate on other ways to improve performance while meeting the particular needs of heterogeneous traffic. ",
    "url": "https://arxiv.org/abs/2209.06324",
    "authors": [
      "Pablo G. Madoery",
      "Gunes Karabulut Kurt",
      "Halim Yanikomeroglu",
      "Peng Hu",
      "Khaled Ahmed",
      "Guillaume Lamontagne"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2209.06331",
    "title": "Learning Category-Level Manipulation Tasks from Point Clouds with  Dynamic Graph CNNs",
    "abstract": "This paper presents a new technique for learning category-level manipulation from raw RGB-D videos of task demonstrations, with no manual labels or annotations. Category-level learning aims to acquire skills that can be generalized to new objects, with geometries and textures that are different from the ones of the objects used in the demonstrations. We address this problem by first viewing both grasping and manipulation as special cases of tool use, where a tool object is moved to a sequence of key-poses defined in a frame of reference of a target object. Tool and target objects, along with their key-poses, are predicted using a dynamic graph convolutional neural network that takes as input an automatically segmented depth and color image of the entire scene. Empirical results on object manipulation tasks with a real robotic arm show that the proposed network can efficiently learn from real visual demonstrations to perform the tasks on novel objects within the same category, and outperforms alternative approaches. ",
    "url": "https://arxiv.org/abs/2209.06331",
    "authors": [
      "Junchi Liang",
      "Abdeslam Boularias"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.06345",
    "title": "Self-supervised Multi-Modal Video Forgery Attack Detection",
    "abstract": "Video forgery attack threatens the surveillance system by replacing the video captures with unrealistic synthesis, which can be powered by the latest augment reality and virtual reality technologies. From the machine perception aspect, visual objects often have RF signatures that are naturally synchronized with them during recording. In contrast to video captures, the RF signatures are more difficult to attack given their concealed and ubiquitous nature. In this work, we investigate multimodal video forgery attack detection methods using both vision and wireless modalities. Since wireless signal-based human perception is environmentally sensitive, we propose a self-supervised training strategy to enable the system to work without external annotation and thus can adapt to different environments. Our method achieves a perfect human detection accuracy and a high forgery attack detection accuracy of 94.38% which is comparable with supervised methods. ",
    "url": "https://arxiv.org/abs/2209.06345",
    "authors": [
      "Chenhui Zhao",
      "Xiang Li",
      "Siwen Dong",
      "Rabih Younes"
    ],
    "subjectives": [
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2209.06346",
    "title": "Prediction of the outcome of a Twenty-20 Cricket Match",
    "abstract": "Twenty20 cricket, sometimes written Twenty-20, and often abbreviated to T20, is a short form of cricket. In a Twenty20 game the two teams of 11 players have a single innings each, which is restricted to a maximum of 20 overs. This version of cricket is especially unpredictable and is one of the reasons it has gained popularity over recent times. However, in this paper we try four different approaches for predicting the results of T20 Cricket Matches. Specifically we take in to account: previous performance statistics of the players involved in the competing teams, ratings of players obtained from reputed cricket statistics websites, clustering the players' with similar performance statistics and using an ELO based approach to rate players. We compare the performances of each of these approaches by using logistic regression, support vector machines, bayes network, decision tree, random forest. ",
    "url": "https://arxiv.org/abs/2209.06346",
    "authors": [
      "Ashish V Shenoy",
      "Arjun Singhvi",
      "Shruthi Racha",
      "Srinivas Tunuguntla"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06351",
    "title": "DevNet: Self-supervised Monocular Depth Learning via Density Volume  Construction",
    "abstract": "Self-supervised depth learning from monocular images normally relies on the 2D pixel-wise photometric relation between temporally adjacent image frames. However, they neither fully exploit the 3D point-wise geometric correspondences, nor effectively tackle the ambiguities in the photometric warping caused by occlusions or illumination inconsistency. To address these problems, this work proposes Density Volume Construction Network (DevNet), a novel self-supervised monocular depth learning framework, that can consider 3D spatial information, and exploit stronger geometric constraints among adjacent camera frustums. Instead of directly regressing the pixel value from a single image, our DevNet divides the camera frustum into multiple parallel planes and predicts the pointwise occlusion probability density on each plane. The final depth map is generated by integrating the density along corresponding rays. During the training process, novel regularization strategies and loss functions are introduced to mitigate photometric ambiguities and overfitting. Without obviously enlarging model parameters size or running time, DevNet outperforms several representative baselines on both the KITTI-2015 outdoor dataset and NYU-V2 indoor dataset. In particular, the root-mean-square-deviation is reduced by around 4% with DevNet on both KITTI-2015 and NYU-V2 in the task of depth estimation. Code is available at https://github.com/gitkaichenzhou/DevNet. ",
    "url": "https://arxiv.org/abs/2209.06351",
    "authors": [
      "Kaichen Zhou",
      "Lanqing Hong",
      "Changhao Chen",
      "Hang Xu",
      "Chaoqiang Ye",
      "Qingyong Hu",
      "Zhenguo Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.06352",
    "title": "Analytics and Machine Learning Powered Wireless Network Optimization and  Planning",
    "abstract": "It is important that the wireless network is well optimized and planned, using the limited wireless spectrum resources, to serve the explosively growing traffic and diverse applications needs of end users. Considering the challenges of dynamics and complexity of the wireless systems, and the scale of the networks, it is desirable to have solutions to automatically monitor, analyze, optimize, and plan the network. This article discusses approaches and solutions of data analytics and machine learning powered optimization and planning. The approaches include analyzing some important metrics of performances and experiences, at the lower layers and upper layers of open systems interconnection (OSI) model, as well as deriving a metric of the end user perceived network congestion indicator. The approaches include monitoring and diagnosis such as anomaly detection of the metrics, root cause analysis for poor performances and experiences. The approaches include enabling network optimization with tuning recommendations, directly targeting to optimize the end users experiences, via sensitivity modeling and analysis of the upper layer metrics of the end users experiences v.s. the improvement of the lower layers metrics due to tuning the hardware configurations. The approaches also include deriving predictive metrics for network planning, traffic demand distributions and trends, detection and prediction of the suppressed traffic demand, and the incentives of traffic gains if the network is upgraded. These approaches of optimization and planning are for accurate detection of optimization and upgrading opportunities at a large scale, enabling more effective optimization and planning such as tuning cells configurations, upgrading cells capacity with more advanced technologies or new hardware, adding more cells, etc., improving the network performances and providing better experiences to end users. ",
    "url": "https://arxiv.org/abs/2209.06352",
    "authors": [
      "Ying Li",
      "Djordje Tujkovic",
      "Po-Han Huang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2209.06354",
    "title": "Tuple Packing: Efficient Batching of Small Graphs in Graph Neural  Networks",
    "abstract": "When processing a batch of graphs in machine learning models such as Graph Neural Networks (GNN), it is common to combine several small graphs into one overall graph to accelerate processing and reduce the overhead of padding. This is for example supported in the PyG library. However, the sizes of small graphs can vary substantially with respect to the number of nodes and edges, and hence the size of the combined graph can still vary considerably, especially for small batch sizes. So the costs of excessive padding and wasted compute are still incurred. This paper proposes a new approach -- tuple packing -- for generating batches that cause minimal overhead. The algorithm extends recently introduced sequence packing approaches to work on the 2D tuples of (|nodes|, |edges|). A monotone heuristic is applied to the 2D histogram of tuple values to define a priority for packing histogram bins together with the objective to reach a limit on the number of nodes as well as the number of edges. Experiments verify the effectiveness of the algorithm on multiple datasets. ",
    "url": "https://arxiv.org/abs/2209.06354",
    "authors": [
      "Mario Michael Krell",
      "Manuel Lopez",
      "Sreenidhi Anand",
      "Hatem Helal",
      "Andrew William Fitzgibbon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06357",
    "title": "DASH: Visual Analytics for Debiasing Image Classification via  User-Driven Synthetic Data Augmentation",
    "abstract": "Image classification models often learn to predict a class based on irrelevant co-occurrences between input features and an output class in training data. We call the unwanted correlations \"data biases,\" and the visual features causing data biases \"bias factors.\" It is challenging to identify and mitigate biases automatically without human intervention. Therefore, we conducted a design study to find a human-in-the-loop solution. First, we identified user tasks that capture the bias mitigation process for image classification models with three experts. Then, to support the tasks, we developed a visual analytics system called DASH that allows users to visually identify bias factors, to iteratively generate synthetic images using a state-of-the-art image-to-image translation model, and to supervise the model training process for improving the classification accuracy. Our quantitative evaluation and qualitative study with ten participants demonstrate the usefulness of DASH and provide lessons for future work. ",
    "url": "https://arxiv.org/abs/2209.06357",
    "authors": [
      "Bum Chul Kwon",
      "Jungsoo Lee",
      "Chaeyeon Chung",
      "Nyoungwoo Lee",
      "Ho-Jin Choi",
      "Jaegul Choo"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.06359",
    "title": "Federated Pruning: Improving Neural Network Efficiency with Federated  Learning",
    "abstract": "Automatic Speech Recognition models require large amount of speech data for training, and the collection of such data often leads to privacy concerns. Federated learning has been widely used and is considered to be an effective decentralized technique by collaboratively learning a shared prediction model while keeping the data local on different clients devices. However, the limited computation and communication resources on clients devices present practical difficulties for large models. To overcome such challenges, we propose Federated Pruning to train a reduced model under the federated setting, while maintaining similar performance compared to the full model. Moreover, the vast amount of clients data can also be leveraged to improve the pruning results compared to centralized training. We explore different pruning schemes and provide empirical evidence of the effectiveness of our methods. ",
    "url": "https://arxiv.org/abs/2209.06359",
    "authors": [
      "Rongmei Lin",
      "Yonghui Xiao",
      "Tien-Ju Yang",
      "Ding Zhao",
      "Li Xiong",
      "Giovanni Motta",
      "Françoise Beaufays"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.06360",
    "title": "I2CR: Improving Noise Robustness on Keyword Spotting Using Inter-Intra  Contrastive Regularization",
    "abstract": "Noise robustness in keyword spotting remains a challenge as many models fail to overcome the heavy influence of noises, causing the deterioration of the quality of feature embeddings. We proposed a contrastive regularization method called Inter-Intra Contrastive Regularization (I2CR) to improve the feature representations by guiding the model to learn the fundamental speech information specific to the cluster. This involves maximizing the similarity across Intra and Inter samples of the same class. As a result, it pulls the instances closer to more generalized representations that form more prominent clusters and reduces the adverse impact of noises. We show that our method provides consistent improvements in accuracy over different backbone model architectures under different noise environments. We also demonstrate that our proposed framework has improved the accuracy of unseen out-of-domain noises and unseen variant noise SNRs. This indicates the significance of our work with the overall refinement in noise robustness. ",
    "url": "https://arxiv.org/abs/2209.06360",
    "authors": [
      "Dianwen Ng",
      "Jia Qi Yip",
      "Tanmay Surana",
      "Zhao Yang",
      "Chong Zhang",
      "Yukun Ma",
      "Chongjia Ni",
      "Eng Siong Chng",
      "Bin Ma"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2209.06367",
    "title": "A Review and Roadmap of Deep Learning Causal Discovery in Different  Variable Paradigms",
    "abstract": "Understanding causality helps to structure interventions to achieve specific goals and enables predictions under interventions. With the growing importance of learning causal relationships, causal discovery tasks have transitioned from using traditional methods to infer potential causal structures from observational data to the field of pattern recognition involved in deep learning. The rapid accumulation of massive data promotes the emergence of causal search methods with brilliant scalability. Existing summaries of causal discovery methods mainly focus on traditional methods based on constraints, scores and FCMs, there is a lack of perfect sorting and elaboration for deep learning-based methods, also lacking some considers and exploration of causal discovery methods from the perspective of variable paradigms. Therefore, we divide the possible causal discovery tasks into three types according to the variable paradigm and give the definitions of the three tasks respectively, define and instantiate the relevant datasets for each task and the final causal model constructed at the same time, then reviews the main existing causal discovery methods for different tasks. Finally, we propose some roadmaps from different perspectives for the current research gaps in the field of causal discovery and point out future research directions. ",
    "url": "https://arxiv.org/abs/2209.06367",
    "authors": [
      "Hang Chen",
      "Keqing Du",
      "Xinyu Yang",
      "Chenguang Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2209.06373",
    "title": "SEEK: model extraction attack against hybrid secure inference protocols",
    "abstract": "Security concerns about a machine learning model used in a prediction-as-a-service include the privacy of the model, the query and the result. Secure inference solutions based on homomorphic encryption (HE) and/or multiparty computation (MPC) have been developed to protect all the sensitive information. One of the most efficient type of solution utilizes HE for linear layers, and MPC for non-linear layers. However, for such hybrid protocols with semi-honest security, an adversary can malleate the intermediate features in the inference process, and extract model information more effectively than methods against inference service in plaintext. In this paper, we propose SEEK, a general extraction method for hybrid secure inference services outputing only class labels. This method can extract each layer of the target model independently, and is not affected by the depth of the model. For ResNet-18, SEEK can extract a parameter with less than 50 queries on average, with average error less than $0.03\\%$. ",
    "url": "https://arxiv.org/abs/2209.06373",
    "authors": [
      "Si Chen",
      "Junfeng Fan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06375",
    "title": "Self-Supervised Clustering on Image-Subtracted Data with Deep-Embedded  Self-Organizing Map",
    "abstract": "Developing an effective automatic classifier to separate genuine sources from artifacts is essential for transient follow-ups in wide-field optical surveys. The identification of transient detections from the subtraction artifacts after the image differencing process is a key step in such classifiers, known as real-bogus classification problem. We apply a self-supervised machine learning model, the deep-embedded self-organizing map (DESOM) to this \"real-bogus\" classification problem. DESOM combines an autoencoder and a self-organizing map to perform clustering in order to distinguish between real and bogus detections, based on their dimensionality-reduced representations. We use 32x32 normalized detection thumbnails as the input of DESOM. We demonstrate different model training approaches, and find that our best DESOM classifier shows a missed detection rate of 6.6% with a false positive rate of 1.5%. DESOM offers a more nuanced way to fine-tune the decision boundary identifying likely real detections when used in combination with other types of classifiers, for example built on neural networks or decision trees. We also discuss other potential usages of DESOM and its limitations. ",
    "url": "https://arxiv.org/abs/2209.06375",
    "authors": [
      "Y. -L. Mong",
      "K. Ackley",
      "T. L. Killestein",
      "D. K. Galloway",
      "M. Dyer",
      "R. Cutter",
      "M. J. I. Brown",
      "J. Lyman",
      "K. Ulaczyk",
      "D. Steeghs",
      "V. Dhillon",
      "P. O'Brien",
      "G. Ramsay",
      "K. Noysena",
      "R. Kotak",
      "R. Breton",
      "L. Nuttall",
      "E. Palle",
      "D. Pollacco",
      "E. Thrane",
      "S. Awiphan",
      "U. Burhanudin",
      "P. Chote",
      "A. Chrimes",
      "E. Daw",
      "C. Duffy",
      "R. Eyles-Ferris",
      "B. P. Gompertz",
      "T. Heikkila",
      "P. Irawati",
      "M. Kennedy",
      "A. Levan",
      "S. Littlefair",
      "L. Makrygianni",
      "T. Marsh",
      "D. Mata Sanchez",
      "S. Mattila",
      "J. R. Maund",
      "J. McCormac",
      "D. Mkrtichian",
      "J. Mullaney",
      "E. Rol",
      "U. Sawangwit",
      "E. Stanway",
      "R. Starling",
      "P. Strom",
      "S. Tooke",
      "K. Wiersema"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)"
    ]
  },
  {
    "id": "arXiv:2209.06388",
    "title": "TSFool: Crafting High-quality Adversarial Time Series through  Multi-objective Optimization to Fool Recurrent Neural Network Classifiers",
    "abstract": "Deep neural network (DNN) classifiers are vulnerable to adversarial attacks. Although the existing gradient-based attacks have achieved good performance in feed-forward model and image recognition tasks, the extension for time series classification in the recurrent neural network (RNN) remains a dilemma, because the cyclical structure of RNN prevents direct model differentiation and the visual sensitivity to perturbations of time series data challenges the traditional local optimization objective to minimize perturbation. In this paper, an efficient and widely applicable approach called TSFool for crafting high-quality adversarial time series for the RNN classifier is proposed. We propose a novel global optimization objective named Camouflage Coefficient to consider how well the adversarial samples hide in class clusters, and accordingly redefine the high-quality adversarial attack as a multi-objective optimization problem. We also propose a new idea to use intervalized weighted finite automata (IWFA) to capture deeply embedded vulnerable samples having otherness between features and latent manifold to guide the approximation to the optimization solution. Experiments on 22 UCR datasets are conducted to confirm that TSFool is a widely effective, efficient and high-quality approach with 93.22% less local perturbation, 32.33% better global camouflage, and 1.12 times speedup to existing methods. ",
    "url": "https://arxiv.org/abs/2209.06388",
    "authors": [
      "Yanyun Wang",
      "Dehui Du",
      "Yuanhao Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.06389",
    "title": "Jointly Contrastive Representation Learning on Road Network and  Trajectory",
    "abstract": "Road network and trajectory representation learning are essential for traffic systems since the learned representation can be directly used in various downstream tasks (e.g., traffic speed inference, and travel time estimation). However, most existing methods only contrast within the same scale, i.e., treating road network and trajectory separately, which ignores valuable inter-relations. In this paper, we aim to propose a unified framework that jointly learns the road network and trajectory representations end-to-end. We design domain-specific augmentations for road-road contrast and trajectory-trajectory contrast separately, i.e., road segment with its contextual neighbors and trajectory with its detour replaced and dropped alternatives, respectively. On top of that, we further introduce the road-trajectory cross-scale contrast to bridge the two scales by maximizing the total mutual information. Unlike the existing cross-scale contrastive learning methods on graphs that only contrast a graph and its belonging nodes, the contrast between road segment and trajectory is elaborately tailored via novel positive sampling and adaptive weighting strategies. We conduct prudent experiments based on two real-world datasets with four downstream tasks, demonstrating improved performance and effectiveness. The code is available at https://github.com/mzy94/JCLRNT. ",
    "url": "https://arxiv.org/abs/2209.06389",
    "authors": [
      "Zhenyu Mao",
      "Ziyue Li",
      "Dedong Li",
      "Lei Bai",
      "Rui Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.06395",
    "title": "Point Cloud Registration-Driven Robust Feature Matching for 3D Siamese  Object Tracking",
    "abstract": "Learning robust feature matching between the template and search area is crucial for 3D Siamese tracking. The core of Siamese feature matching is how to assign high feature similarity on the corresponding points between the template and search area for precise object localization. In this paper, we propose a novel point cloud registration-driven Siamese tracking framework, with the intuition that spatially aligned corresponding points (via 3D registration) tend to achieve consistent feature representations. Specifically, our method consists of two modules, including a tracking-specific nonlocal registration module and a registration-aided Sinkhorn template-feature aggregation module. The registration module targets at the precise spatial alignment between the template and search area. The tracking-specific spatial distance constraint is proposed to refine the cross-attention weights in the nonlocal module for discriminative feature learning. Then, we use the weighted SVD to compute the rigid transformation between the template and search area, and align them to achieve the desired spatially aligned corresponding points. For the feature aggregation model, we formulate the feature matching between the transformed template and search area as an optimal transport problem and utilize the Sinkhorn optimization to search for the outlier-robust matching solution. Also, a registration-aided spatial distance map is built to improve the matching robustness in indistinguishable regions (e.g., smooth surface). Finally, guided by the obtained feature matching map, we aggregate the target information from the template into the search area to construct the target-specific feature, which is then fed into a CenterPoint-like detection head for object localization. Extensive experiments on KITTI, NuScenes and Waymo datasets verify the effectiveness of our proposed method. ",
    "url": "https://arxiv.org/abs/2209.06395",
    "authors": [
      "Haobo Jiang",
      "Kaihao Lan",
      "Le Hui",
      "Guangyu Li",
      "Jin Xie",
      "Jian Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.06397",
    "title": "Federated Learning based on Defending Against Data Poisoning Attacks in  IoT",
    "abstract": "The rapidly expanding number of Internet of Things (IoT) devices is generating huge quantities of data, but the data privacy and security exposure in IoT devices, especially in the automatic driving system. Federated learning (FL) is a paradigm that addresses data privacy, security, access rights, and access to heterogeneous message issues by integrating a global model based on distributed nodes. However, data poisoning attacks on FL can undermine the benefits, destroying the global model's availability and disrupting model training. To avoid the above issues, we build up a hierarchical defense data poisoning (HDDP) system framework to defend against data poisoning attacks in FL, which monitors each local model of individual nodes via abnormal detection to remove the malicious clients. Whether the poisoning defense server has a trusted test dataset, we design the \\underline{l}ocal \\underline{m}odel \\underline{t}est \\underline{v}oting (LMTV) and \\underline{k}ullback-\\underline{l}eibler divergence \\underline{a}nomaly parameters \\underline{d}etection (KLAD) algorithms to defend against label-flipping poisoning attacks. Specifically, the trusted test dataset is utilized to obtain the evaluation results for each classification to recognize the malicious clients in LMTV. More importantly, we adopt the kullback leibler divergence to measure the similarity between local models without the trusted test dataset in KLAD. Finally, through extensive evaluations and against the various label-flipping poisoning attacks, LMTV and KLAD algorithms could achieve the $100\\%$ and $40\\%$ to $85\\%$ successful defense ratios under different detection situations. ",
    "url": "https://arxiv.org/abs/2209.06397",
    "authors": [
      "Jiayin Li",
      "Wenzhong Guo",
      "Xingshuo Han",
      "Jianping Cai",
      "Ximeng Liu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.06399",
    "title": "A Survey on Evolutionary Computation for Computer Vision and Image  Analysis: Past, Present, and Future Trends",
    "abstract": "Computer vision (CV) is a big and important field in artificial intelligence covering a wide range of applications. Image analysis is a major task in CV aiming to extract, analyse and understand the visual content of images. However, image-related tasks are very challenging due to many factors, e.g., high variations across images, high dimensionality, domain expertise requirement, and image distortions. Evolutionary computation (EC) approaches have been widely used for image analysis with significant achievement. However, there is no comprehensive survey of existing EC approaches to image analysis. To fill this gap, this paper provides a comprehensive survey covering all essential EC approaches to important image analysis tasks including edge detection, image segmentation, image feature analysis, image classification, object detection, and others. This survey aims to provide a better understanding of evolutionary computer vision (ECV) by discussing the contributions of different approaches and exploring how and why EC is used for CV and image analysis. The applications, challenges, issues, and trends associated to this research field are also discussed and summarised to provide further guidelines and opportunities for future research. ",
    "url": "https://arxiv.org/abs/2209.06399",
    "authors": [
      "Ying Bi",
      "Bing Xue",
      "Pablo Mesejo",
      "Stefano Cagnoni",
      "Mengjie Zhang"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06407",
    "title": "Viewer-Centred Surface Completion for Unsupervised Domain Adaptation in  3D Object Detection",
    "abstract": "Every autonomous driving dataset has a different configuration of sensors, originating from distinct geographic regions and covering various scenarios. As a result, 3D detectors tend to overfit the datasets they are trained on. This causes a drastic decrease in accuracy when the detectors are trained on one dataset and tested on another. We observe that lidar scan pattern differences form a large component of this reduction in performance. We address this in our approach, SEE-VCN, by designing a novel viewer-centred surface completion network (VCN) to complete the surfaces of objects of interest within an unsupervised domain adaptation framework, SEE. With SEE-VCN, we obtain a unified representation of objects across datasets, allowing the network to focus on learning geometry, rather than overfitting on scan patterns. By adopting a domain-invariant representation, SEE-VCN can be classed as a multi-target domain adaptation approach where no annotations or re-training is required to obtain 3D detections for new scan patterns. Through extensive experiments, we show that our approach outperforms previous domain adaptation methods in multiple domain adaptation settings. Our code and data are available at https://github.com/darrenjkt/SEE-VCN. ",
    "url": "https://arxiv.org/abs/2209.06407",
    "authors": [
      "Darren Tsai",
      "Julie Stephany Berrio",
      "Mao Shan",
      "Eduardo Nebot",
      "Stewart Worrall"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.06416",
    "title": "ImageArg: A Multi-modal Tweet Dataset for Image Persuasiveness Mining",
    "abstract": "The growing interest in developing corpora of persuasive texts has promoted applications in automated systems, e.g., debating and essay scoring systems; however, there is little prior work mining image persuasiveness from an argumentative perspective. To expand persuasiveness mining into a multi-modal realm, we present a multi-modal dataset, ImageArg, consisting of annotations of image persuasiveness in tweets. The annotations are based on a persuasion taxonomy we developed to explore image functionalities and the means of persuasion. We benchmark image persuasiveness tasks on ImageArg using widely-used multi-modal learning methods. The experimental results show that our dataset offers a useful resource for this rich and challenging topic, and there is ample room for modeling improvement. ",
    "url": "https://arxiv.org/abs/2209.06416",
    "authors": [
      "Zhexiong Liu",
      "Meiqi Guo",
      "Yue Dai",
      "Diane Litman"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2209.06417",
    "title": "Considering Image Information and Self-similarity: A Compositional  Denoising Network",
    "abstract": "Recently, convolutional neural networks (CNNs) have been widely used in image denoising. Existing methods benefited from residual learning and achieved high performance. Much research has been paid attention to optimizing the network architecture of CNN but ignored the limitations of residual learning. This paper suggests two limitations of it. One is that residual learning focuses on estimating noise, thus overlooking the image information. The other is that the image self-similarity is not effectively considered. This paper proposes a compositional denoising network (CDN), whose image information path (IIP) and noise estimation path (NEP) will solve the two problems, respectively. IIP is trained by an image-to-image way to extract image information. For NEP, it utilizes the image self-similarity from the perspective of training. This similarity-based training method constrains NEP to output a similar estimated noise distribution for different image patches with a specific kind of noise. Finally, image information and noise distribution information will be comprehensively considered for image denoising. Experiments show that CDN achieves state-of-the-art results in synthetic and real-world image denoising. Our code will be released on https://github.com/JiaHongZ/CDN. ",
    "url": "https://arxiv.org/abs/2209.06417",
    "authors": [
      "Jiahong Zhang",
      "Yonggui Zhu",
      "Wenshu Yu",
      "Jingning Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2209.06418",
    "title": "Graph Perceiver IO: A General Architecture for Graph Structured Data",
    "abstract": "Multimodal machine learning has been widely studied for the development of general intelligence. Recently, the remarkable multimodal algorithms, the Perceiver and Perceiver IO, show competitive results for diverse dataset domains and tasks. However, recent works, Perceiver and Perceiver IO, have focused on heterogeneous modalities, including image, text, and speech, and there are few research works for graph structured datasets. A graph is one of the most generalized dataset structures, and we can represent the other dataset, including images, text, and speech, as graph structured data. A graph has an adjacency matrix different from other dataset domains such as text and image, and it is not trivial to handle the topological information, relational information, and canonical positional information. In this study, we provide a Graph Perceiver IO, the Perceiver IO for the graph structured dataset. We keep the main structure of the Graph Perceiver IO as the Perceiver IO because the Perceiver IO already handles the diverse dataset well, except for the graph structured dataset. The Graph Perceiver IO is a general method, and it can handle diverse datasets such as graph structured data as well as text and images. Comparing the graph neural networks, the Graph Perceiver IO requires a lower complexity, and it can incorporate the local and global information efficiently. We show that Graph Perceiver IO shows competitive results for diverse graph-related tasks, including node classification, graph classification, and link prediction. ",
    "url": "https://arxiv.org/abs/2209.06418",
    "authors": [
      "Seyun Bae",
      "Hoyoon Byun",
      "Changdae Oh",
      "Yoon-Sik Cho",
      "Kyungwoo Song"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06420",
    "title": "Robust ab initio solution of the cryo-EM reconstruction problem at low  resolution with small data sets",
    "abstract": "Single particle cryo-electron microscopy has become a critical tool in structural biology over the last decade, able to achieve atomic scale resolution in three dimensional models from hundreds of thousands of (noisy) two-dimensional projection views of particles frozen at unknown orientations. This is accomplished by using a suite of software tools to (i) identify particles in large micrographs, (ii) obtain low-resolution reconstructions, (iii) refine those low-resolution structures, and (iv) finally match the obtained electron scattering density to the constituent atoms that make up the macromolecule or macromolecular complex of interest. Here, we focus on the second stage of the reconstruction pipeline: obtaining a low resolution model from picked particle images. Our goal is to create an algorithm that is capable of ab initio reconstruction from small data sets (on the order of a few thousand selected particles). More precisely, we seek an algorithm that is robust, automatic, able to assess particle quality, and fast enough that it can potentially be used to assist in the assessment of the data being generated while the microscopy experiment is still underway. ",
    "url": "https://arxiv.org/abs/2209.06420",
    "authors": [
      "Aaditya V. Rangan",
      "Leslie Greengard"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2209.06426",
    "title": "Multi-Dimensional Unlimited Sampling and Robust Reconstruction",
    "abstract": "In this paper we introduce a new sampling and reconstruction approach for multi-dimensional analog signals. Building on top of the Unlimited Sensing Framework (USF), we present a new folded sampling operator called the multi-dimensional modulo-hysteresis that is also backwards compatible with the existing one-dimensional modulo operator. Unlike previous approaches, the proposed model is specifically tailored to multi-dimensional signals. In particular, the model uses certain redundancy in dimensions 2 and above, which is exploited for input recovery with robustness. We prove that the new operator is well-defined and its outputs have a bounded dynamic range. For the noiseless case, we derive a theoretically guaranteed input reconstruction approach. When the input is corrupted by Gaussian noise, we exploit redundancy in higher dimensions to provide a bound on the error probability and show this drops to 0 for high enough sampling rates leading to new theoretical guarantees for the noisy case. Our numerical examples corroborate the theoretical results and show that the proposed approach can handle a significantly larger amount of noise compared to USF. ",
    "url": "https://arxiv.org/abs/2209.06426",
    "authors": [
      "Dorian Florescu",
      "Ayush Bhandari"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2209.06427",
    "title": "Efficient low-thrust trajectory data generation based on generative  adversarial network",
    "abstract": "Deep learning-based techniques have been introduced into the field of trajectory optimization in recent years. Deep Neural Networks (DNNs) are trained and used as the surrogates of conventional optimization process. They can provide low thrust (LT) transfer cost estimation and enable more complex preliminary mission designs. However, it is a challenge to efficiently obtain the required amount of trajectory data for training. A Generative Adversarial Network (GAN) is adapted to generate the feasible LT trajectory data efficiently. The GAN consists of a generator and a discriminator, both of which are deep networks. The generator generates fake LT transfer features using random noise as input, while the discriminator distinguishes the generator's fake LT transfer features from real LT transfer features. The GAN is trained until the generator generates fake LT transfers that the discriminator cannot identify. This indicates the generator generates low thrust transfer features that have the same distribution as the real transfer features. The generated low thrust transfer data have a high convergence rate, and they can be used to efficiently produce training data for deep learning models. The proposed approach is validated by generating feasible LT transfers in a Near-Earth Asteroid (NEA) mission scenario. The convergence rate of GAN-generated samples is 84.3%. ",
    "url": "https://arxiv.org/abs/2209.06427",
    "authors": [
      "Ruida Xie",
      "Andrew G. Dempster"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2209.06430",
    "title": "CLIP-ViP: Adapting Pre-trained Image-Text Model to Video-Language  Representation Alignment",
    "abstract": "The pre-trained image-text models, like CLIP, have demonstrated the strong power of vision-language representation learned from a large scale of web-collected image-text data. In light of the well-learned visual features, some existing works transfer image representation to video domain and achieve good results. However, how to utilize image-language pre-trained model (e.g., CLIP) for video-language pre-training (post-pretraining) is still under explored. In this paper, we investigate two questions: 1) what are the factors hindering post-pretraining CLIP to further improve the performance on video-language tasks? and 2) how to mitigate the impact of these factors? Through a series of comparative experiments and analyses, we find that the data scale and domain gap between language sources have great impacts. Motivated by these, we propose a Omnisource Cross-modal Learning method equipped with a Video Proxy mechanism on the basis of CLIP, namely CLIP-ViP. Extensive results show that our approach improves the performance of CLIP on video-text retrieval by a large margin. Our model also achieves SOTA results on a variety of datasets, including MSR-VTT, DiDeMo, LSMDC, and ActivityNet. We release our code and pre-trained CLIP-ViP models at https://github.com/microsoft/XPretrain/tree/main/CLIP-ViP. ",
    "url": "https://arxiv.org/abs/2209.06430",
    "authors": [
      "Hongwei Xue",
      "Yuchong Sun",
      "Bei Liu",
      "Jianlong Fu",
      "Ruihua Song",
      "Houqiang Li",
      "Jiebo Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.06434",
    "title": "ConvNext Based Neural Network for Anti-Spoofing",
    "abstract": "Automatic speaker verification (ASV) has been widely used in the real life for identity authentication. However, with the rapid development of speech conversion, speech synthesis algorithms and the improvement of the quality of recording devices, ASV systems are vulnerable for spoof attacks. In recent years, there have many works about synthetic and replay speech detection, researchers had proposed a number of anti-spoofing methods based on hand-crafted features to improve the accuracy and robustness of synthetic and replay speech detection system. However, using hand-crafted features rather than raw waveform would lose certain information for anti-spoofing, which will reduce the detection performance of the system. Inspired by the promising performance of ConvNext in image classification tasks, we extend the ConvNext network architecture accordingly for spoof attacks detection task and propose an end-to-end anti-spoofing model. By integrating the extended architecture with the channel attention block, the proposed model can focus on the most informative sub-bands of speech representations to improve the anti-spoofing performance. Experiments show that our proposed best single system could achieve an equal error rate of 1.88% and 2.79% for the ASVSpoof 2019 LA evaluation dataset and PA evaluation dataset respectively, which demonstrate the model's capacity for anti-spoofing. ",
    "url": "https://arxiv.org/abs/2209.06434",
    "authors": [
      "Qiaowei Ma",
      "Jinghui Zhong",
      "Yitao Yang",
      "Weiheng Liu",
      "Ying Gao",
      "Wing W.Y. Ng"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2209.06435",
    "title": "Real-world Video Anomaly Detection by Extracting Salient Features in  Videos",
    "abstract": "We propose a lightweight and accurate method for detecting anomalies in videos. Existing methods used multiple-instance learning (MIL) to determine the normal/abnormal status of each segment of the video. Recent successful researches argue that it is important to learn the temporal relationships among segments to achieve high accuracy, instead of focusing on only a single segment. Therefore we analyzed the existing methods that have been successful in recent years, and found that while it is indeed important to learn all segments together, the temporal orders among them are irrelevant to achieving high accuracy. Based on this finding, we do not use the MIL framework, but instead propose a lightweight model with a self-attention mechanism to automatically extract features that are important for determining normal/abnormal from all input segments. As a result, our neural network model has 1.3\\% of the number of parameters of the existing method. We evaluated the frame-level detection accuracy of our method on three benchmark datasets (UCF-Crime, ShanghaiTech, and XD-Violence) and demonstrate that our method can achieve the comparable or better accuracy than state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2209.06435",
    "authors": [
      "Yudai Watanabe",
      "Makoto Okabe",
      "Yasunori Harada",
      "Naoji Kashima"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.06452",
    "title": "TrADe Re-ID -- Live Person Re-Identification using Tracking and Anomaly  Detection",
    "abstract": "Person Re-Identification (Re-ID) aims to search for a person of interest (query) in a network of cameras. In the classic Re-ID setting the query is sought in a gallery containing properly cropped images of entire bodies. Recently, the live Re-ID setting was introduced to represent the practical application context of Re-ID better. It consists in searching for the query in short videos, containing whole scene frames. The initial live Re-ID baseline used a pedestrian detector to build a large search gallery and a classic Re-ID model to find the query in the gallery. However, the galleries generated were too large and contained low-quality images, which decreased the live Re-ID performance. Here, we present a new live Re-ID approach called TrADe, to generate lower high-quality galleries. TrADe first uses a Tracking algorithm to identify sequences of images of the same individual in the gallery. Following, an Anomaly Detection model is used to select a single good representative of each tracklet. TrADe is validated on the live Re-ID version of the PRID-2011 dataset and shows significant improvements over the baseline. ",
    "url": "https://arxiv.org/abs/2209.06452",
    "authors": [
      "Luigy Machaca",
      "F. Oliver Sumari H",
      "Jose Huaman",
      "Esteban Clua",
      "Joris Guerin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06454",
    "title": "Prediction Intervals and Confidence Regions for Symbolic Regression  Models based on Likelihood Profiles",
    "abstract": "Symbolic regression is a nonlinear regression method which is commonly performed by an evolutionary computation method such as genetic programming. Quantification of uncertainty of regression models is important for the interpretation of models and for decision making. The linear approximation and so-called likelihood profiles are well-known possibilities for the calculation of confidence and prediction intervals for nonlinear regression models. These simple and effective techniques have been completely ignored so far in the genetic programming literature. In this work we describe the calculation of likelihood profiles in details and also provide some illustrative examples with models created with three different symbolic regression algorithms on two different datasets. The examples highlight the importance of the likelihood profiles to understand the limitations of symbolic regression models and to help the user taking an informed post-prediction decision. ",
    "url": "https://arxiv.org/abs/2209.06454",
    "authors": [
      "Fabricio Olivetti de Franca",
      "Gabriel Kronberger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2209.06461",
    "title": "Electric Vehicle Battery Sharing Game for Mobile Energy Storage  Provision in Power Networks",
    "abstract": "Electric vehicles (EVs) equipped with a bidirectional charger can provide valuable grid services as mobile energy storage. However, proper financial incentives need to be in place to enlist EV drivers to provide services to the grid. In this paper, we consider two types of EV drivers who may be willing to provide mobile storage service using their EVs: commuters taking a fixed route, and on-demand EV drivers who receive incentives from a transportation network company (TNC) and are willing to take any route. We model the behavior of each type of driver using game theoretic methods, and characterize the Nash equilibrium (NE) of an EV battery sharing game where each EV driver withdraws power from the grid to charge its EV battery at the origin of a route, travels from the origin to the destination, and then discharges power back to the grid at the destination of the route. The driver earns a payoff that depends on the participation of other drivers and power network conditions. We characterize the NE in three situations: when there are only commuters, when there are only on-demand TNC drivers, and when the two groups of drivers co-exist. In particular, we show that the equilibrium outcome supports the social welfare in each of these three cases. ",
    "url": "https://arxiv.org/abs/2209.06461",
    "authors": [
      "Utkarsha Agwan",
      "Junjie Qin",
      "Kameshwar Poolla",
      "Pravin Varaiya"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2209.06464",
    "title": "Personalized Emotion Detection using IoT and Machine Learning",
    "abstract": "The Medical Internet of Things, a recent technological advancement in medicine, is incredibly helpful in providing real-time monitoring of health metrics. This paper presents a non-invasive IoT system that tracks patients' emotions, especially those with autism spectrum disorder. With a few affordable sensors and cloud computing services, the individual's heart rates are monitored and analyzed to study the effects of changes in sweat and heartbeats per minute for different emotions. Under normal resting conditions of the individual, the proposed system could detect the right emotion using machine learning algorithms with a performance of up to 92% accuracy. The result of the proposed approach is comparable with the state-of-the-art solutions in medical IoT. ",
    "url": "https://arxiv.org/abs/2209.06464",
    "authors": [
      "Fiona Victoria Stanley Jothiraj",
      "Afra Mashhadi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2209.06495",
    "title": "Self-organizing Life Cycle Management of Mobile Ad hoc Networks",
    "abstract": "A Mobile Ad hoc NETwork (MANET) is a type of wireless network without any infrastructure, where nodes must adapt to the changing dynamic situations that result from their mobility. Because of the decentralization of nodes and the security needs of communications, management of MANETs must be self-organized, which is a major research challenge. In order to cope with the intrinsic properties of MANETs, a new decentralized management system for MANETs called Self-organizing Life Cycle Management (SLCM), is here fully described and evaluated. Regarding security, node authentication is the most critical component of access control in any network, and in particular in MANETs. Broadcasting is also a fundamental data dissemination mechanism in these networks. Both aspects have received special attention when defining the proposed SLCM system. In particular, both a strong access control algorithm based on the cryptographic paradigm of zero-knowledge proofs, and a three-step broadcast protocol, are here defined. This work includes the performance evaluation of the scheme, and the obtained experimental results show that SLCM significantly improves both the quality and the security of life cycle management of self-organized MANETs. ",
    "url": "https://arxiv.org/abs/2209.06495",
    "authors": [
      "C. Caballero-Gil",
      "P. Caballero-Gil",
      "J. Molina-Gil"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.06505",
    "title": "BERT-based Ensemble Approaches for Hate Speech Detection",
    "abstract": "With the freedom of communication provided in online social media, hate speech has increasingly generated. This leads to cyber conflicts affecting social life at the individual and national levels. As a result, hateful content classification is becoming increasingly demanded for filtering hate content before being sent to the social networks. This paper focuses on classifying hate speech in social media using multiple deep models that are implemented by integrating recent transformer-based language models such as BERT, and neural networks. To improve the classification performances, we evaluated with several ensemble techniques, including soft voting, maximum value, hard voting and stacking. We used three publicly available Twitter datasets (Davidson, HatEval2019, OLID) that are generated to identify offensive languages. We fused all these datasets to generate a single dataset (DHO dataset), which is more balanced across different labels, to perform multi-label classification. Our experiments have been held on Davidson dataset and the DHO corpora. The later gave the best overall results, especially F1 macro score, even it required more resources (time execution and memory). The experiments have shown good results especially the ensemble models, where stacking gave F1 score of 97% on Davidson dataset and aggregating ensembles 77% on the DHO dataset. ",
    "url": "https://arxiv.org/abs/2209.06505",
    "authors": [
      "Khouloud Mnassri",
      "Praboda Rajapaksha",
      "Reza Farahbakhsh",
      "Noel Crespi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06506",
    "title": "Order-Disorder: Imitation Adversarial Attacks for Black-box Neural  Ranking Models",
    "abstract": "Neural text ranking models have witnessed significant advancement and are increasingly being deployed in practice. Unfortunately, they also inherit adversarial vulnerabilities of general neural models, which have been detected but remain underexplored by prior studies. Moreover, the inherit adversarial vulnerabilities might be leveraged by blackhat SEO to defeat better-protected search engines. In this study, we propose an imitation adversarial attack on black-box neural passage ranking models. We first show that the target passage ranking model can be transparentized and imitated by enumerating critical queries/candidates and then train a ranking imitation model. Leveraging the ranking imitation model, we can elaborately manipulate the ranking results and transfer the manipulation attack to the target ranking model. For this purpose, we propose an innovative gradient-based attack method, empowered by the pairwise objective function, to generate adversarial triggers, which causes premeditated disorderliness with very few tokens. To equip the trigger camouflages, we add the next sentence prediction loss and the language model fluency constraint to the objective function. Experimental results on passage ranking demonstrate the effectiveness of the ranking imitation attack model and adversarial triggers against various SOTA neural ranking models. Furthermore, various mitigation analyses and human evaluation show the effectiveness of camouflages when facing potential mitigation approaches. To motivate other scholars to further investigate this novel and important problem, we make the experiment data and code publicly available. ",
    "url": "https://arxiv.org/abs/2209.06506",
    "authors": [
      "Jiawei Liu",
      "Yangyang Kang",
      "Di Tang",
      "Kaisong Song",
      "Changlong Sun",
      "Xiaofeng Wang",
      "Wei Lu",
      "Xiaozhong Liu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.06520",
    "title": "Scalable Spatiotemporal Graph Neural Networks",
    "abstract": "Neural forecasting of spatiotemporal time series drives both research and industrial innovation in several relevant application domains. Graph neural networks (GNNs) are often the core component of the forecasting architecture. However, in most spatiotemporal GNNs, the computational complexity scales up to a quadratic factor with the length of the sequence times the number of links in the graph, hence hindering the application of these models to large graphs and long temporal sequences. While methods to improve scalability have been proposed in the context of static graphs, few research efforts have been devoted to the spatiotemporal case. To fill this gap, we propose a scalable architecture that exploits an efficient encoding of both temporal and spatial dynamics. In particular, we use a randomized recurrent neural network to embed the history of the input time series into high-dimensional state representations encompassing multi-scale temporal dynamics. Such representations are then propagated along the spatial dimension using different powers of the graph adjacency matrix to generate node embeddings characterized by a rich pool of spatiotemporal features. The resulting node embeddings can be efficiently pre-computed in an unsupervised manner, before being fed to a feed-forward decoder that learns to map the multi-scale spatiotemporal representations to predictions. The training procedure can then be parallelized node-wise by sampling the node embeddings without breaking any dependency, thus enabling scalability to large networks. Empirical results on relevant datasets show that our approach achieves results competitive with the state of the art, while dramatically reducing the computational burden. ",
    "url": "https://arxiv.org/abs/2209.06520",
    "authors": [
      "Andrea Cini",
      "Ivan Marisca",
      "Filippo Maria Bianchi",
      "Cesare Alippi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.06522",
    "title": "ScaTE: A Scalable Framework for Self-Supervised Traversability  Estimation in Unstructured Environments",
    "abstract": "For the safe and successful navigation of autonomous vehicles in unstructured environments, the traversability of terrain should vary based on the driving capabilities of the vehicles. Actual driving experience can be utilized in a self-supervised fashion to learn vehicle-specific traversability. However, existing methods for learning self-supervised traversability are not highly scalable for learning the traversability of various vehicles. In this work, we introduce a scalable framework for learning self-supervised traversability, which can learn the traversability directly from vehicle-terrain interaction without any human supervision. We train a neural network that predicts the proprioceptive experience that a vehicle would undergo from 3D point clouds. Using a novel PU learning method, the network simultaneously identifies non-traversable regions where estimations can be overconfident. With driving data of various vehicles gathered from simulation and the real world, we show that our framework is capable of learning the self-supervised traversability of various vehicles. By integrating our framework with a model predictive controller, we demonstrate that estimated traversability results in effective navigation that enables distinct maneuvers based on the driving characteristics of the vehicles. In addition, experimental results validate the ability of our method to identify and avoid non-traversable regions. ",
    "url": "https://arxiv.org/abs/2209.06522",
    "authors": [
      "Junwon Seo",
      "Taekyung Kim",
      "Kiho Kwak",
      "Jihong Min",
      "Inwook Shim"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.06525",
    "title": "FCDSN-DC: An Accurate and Lightweight Convolutional Neural Network for  Stereo Estimation with Depth Completion",
    "abstract": "We propose an accurate and lightweight convolutional neural network for stereo estimation with depth completion. We name this method fully-convolutional deformable similarity network with depth completion (FCDSN-DC). This method extends FC-DCNN by improving the feature extractor, adding a network structure for training highly accurate similarity functions and a network structure for filling inconsistent disparity estimates. The whole method consists of three parts. The first part consists of fully-convolutional densely connected layers that computes expressive features of rectified image pairs. The second part of our network learns highly accurate similarity functions between this learned features. It consists of densely-connected convolution layers with a deformable convolution block at the end to further improve the accuracy of the results. After this step an initial disparity map is created and the left-right consistency check is performed in order to remove inconsistent points. The last part of the network then uses this input together with the corresponding left RGB image in order to train a network that fills in the missing measurements. Consistent depth estimations are gathered around invalid points and are parsed together with the RGB points into a shallow CNN network structure in order to recover the missing values. We evaluate our method on challenging real world indoor and outdoor scenes, in particular Middlebury, KITTI and ETH3D were it produces competitive results. We furthermore show that this method generalizes well and is well suited for many applications without the need of further training. The code of our full framework is available at: https://github.com/thedodo/FCDSN-DC ",
    "url": "https://arxiv.org/abs/2209.06525",
    "authors": [
      "Dominik Hirner",
      "Friedrich Fraundorfer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.06529",
    "title": "Data Privacy and Trustworthy Machine Learning",
    "abstract": "The privacy risks of machine learning models is a major concern when training them on sensitive and personal data. We discuss the tradeoffs between data privacy and the remaining goals of trustworthy machine learning (notably, fairness, robustness, and explainability). ",
    "url": "https://arxiv.org/abs/2209.06529",
    "authors": [
      "Martin Strobel",
      "Reza Shokri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.06535",
    "title": "CRAFT: Camera-Radar 3D Object Detection with Spatio-Contextual Fusion  Transformer",
    "abstract": "Camera and radar sensors have significant advantages in cost, reliability, and maintenance compared to LiDAR. Existing fusion methods often fuse the outputs of single modalities at the result-level, called the late fusion strategy. This can benefit from using off-the-shelf single sensor detection algorithms, but late fusion cannot fully exploit the complementary properties of sensors, thus having limited performance despite the huge potential of camera-radar fusion. Here we propose a novel proposal-level early fusion approach that effectively exploits both spatial and contextual properties of camera and radar for 3D object detection. Our fusion framework first associates image proposal with radar points in the polar coordinate system to efficiently handle the discrepancy between the coordinate system and spatial properties. Using this as a first stage, following consecutive cross-attention based feature fusion layers adaptively exchange spatio-contextual information between camera and radar, leading to a robust and attentive fusion. Our camera-radar fusion approach achieves the state-of-the-art 41.1% mAP and 52.3% NDS on the nuScenes test set, which is 8.7 and 10.8 points higher than the camera-only baseline, as well as yielding competitive performance on the LiDAR method. ",
    "url": "https://arxiv.org/abs/2209.06535",
    "authors": [
      "Youngseok Kim",
      "Sanmin Kim",
      "Jun Won Choi",
      "Dongsuk Kum"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.06539",
    "title": "Stability and bifurcations in transportation networks with heterogeneous  users",
    "abstract": "A critical aspect in strategic modeling of transportation systems is the users' heterogeneity. In many realistic situations, e.g., when tolls are charged and drivers have different trade-offs between time and money, or when they get informed by different routing apps, modeling users as rational decision makers with homogeneous utility functions becomes too restrictive. While global asymptotic stability of user equilibria in homogeneous routing games is known to hold for a broad class of evolutionary dynamics, the stability analysis of user equilibria in heterogeneous routing games is a largely open problem. In this work we study the logit dynamics in heterogeneous routing games on arbitrary network topologies. We show that the dynamics may exhibit bifurcations as the noise level of the dynamics varies, and provide sufficient conditions for asymptotic stability of user equilibria. ",
    "url": "https://arxiv.org/abs/2209.06539",
    "authors": [
      "Leonardo Cianfanelli",
      "Giacomo Como",
      "Tommaso Toso"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2209.06553",
    "title": "Collaborative SQL-injections detection system with machine learning",
    "abstract": "Data mining and information extraction from data is a field that has gained relevance in recent years thanks to techniques based on artificial intelligence and use of machine and deep learning. The main aim of the present work is the development of a tool based on a previous behaviour study of security audit tools (oriented to SQL pentesting) with the purpose of creating testing sets capable of performing an accurate detection of a SQL attack. The study is based on the information collected through the generated web server logs in a pentesting laboratory environment. Then, making use of the common extracted patterns from the logs, each attack vector has been classified in risk levels (dangerous attack, normal attack, non-attack, etc.). Finally, a training with the generated data was performed in order to obtain a classifier system that has a variable performance between 97 and 99 percent in positive attack detection. The training data is shared to other servers in order to create a distributed network capable of deciding if a query is an attack or is a real petition and inform to connected clients in order to block the petitions from the attacker's IP. ",
    "url": "https://arxiv.org/abs/2209.06553",
    "authors": [
      "M Lodeiro-Santiago",
      "C Caballero-Gil",
      "P Caballero-Gil"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.06560",
    "title": "Graph Contrastive Learning with Personalized Augmentation",
    "abstract": "Graph contrastive learning (GCL) has emerged as an effective tool for learning unsupervised representations of graphs. The key idea is to maximize the agreement between two augmented views of each graph via data augmentation. Existing GCL models mainly focus on applying \\textit{identical augmentation strategies} for all graphs within a given scenario. However, real-world graphs are often not monomorphic but abstractions of diverse natures. Even within the same scenario (e.g., macromolecules and online communities), different graphs might need diverse augmentations to perform effective GCL. Thus, blindly augmenting all graphs without considering their individual characteristics may undermine the performance of GCL arts.To deal with this, we propose the first principled framework, termed as \\textit{G}raph contrastive learning with \\textit{P}ersonalized \\textit{A}ugmentation (GPA), to advance conventional GCL by allowing each graph to choose its own suitable augmentation operations.In essence, GPA infers tailored augmentation strategies for each graph based on its topology and node attributes via a learnable augmentation selector, which is a plug-and-play module and can be effectively trained with downstream GCL models end-to-end. Extensive experiments across 11 benchmark graphs from different types and domains demonstrate the superiority of GPA against state-of-the-art competitors.Moreover, by visualizing the learned augmentation distributions across different types of datasets, we show that GPA can effectively identify the most suitable augmentations for each graph based on its characteristics. ",
    "url": "https://arxiv.org/abs/2209.06560",
    "authors": [
      "Xin Zhang",
      "Qiaoyu Tan",
      "Xiao Huang",
      "Bo Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06575",
    "title": "Efficient multi-relational network representation using primes",
    "abstract": "Multi-relational networks play an important role in today's world and are utilized to capture complex relationships between the data. Their applications span many domains such as biomedical, financial, social, etc., and because of their increasing usability, it becomes crucial to find efficient ways to deal with the added complexity of multiple layers. In this work, we propose a novel approach to represent these complex networks using a single aggregated adjacency matrix, by utilizing primes as surrogates for the relations. Due to the fundamental theorem of arithmetic, this allows for a lossless, compact representation of the whole multi-relational graph, using a single adjacency matrix. Moreover, this representation enables the fast computation of multi-hop adjacency matrices, that can be useful for a variety of downstream tasks. We present simple and complex tasks in which this representation can be useful and showcase its efficiency and performance. Finally, we also provide insights on the advantages and the open challenges that still need to be addressed and motivate future work. ",
    "url": "https://arxiv.org/abs/2209.06575",
    "authors": [
      "Konstantinos Bougiatiotis",
      "Georgios Paliouras"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06577",
    "title": "When Six Degrees of Separation Meets Online Social Networks: How Low Can  the Degree Be?",
    "abstract": "The proposal of Six Degrees of Separation makes people realize that the world is not as big as we imagined. Even if the world's population now exceeds 7 billion, two strangers can still get in touch through a limited intermediary. When online social networks have taken the world by storm, can people connect through shorter distances? This issue is worth thinking about. This paper describes Six Degrees of Separation and the limitations of this theory in practical applications. Combined with online social networks, the paper analyzes the development and change of the degrees of connection between people. Finally, the paper considers the actual coverage of online social networks and other issues, and rationalizes the possible degrees of the future Six Degrees of Separation. ",
    "url": "https://arxiv.org/abs/2209.06577",
    "authors": [
      "Zhimin Zhang",
      "Fang Zhou",
      "Huansheng Ning"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.06579",
    "title": "C^2:Co-design of Robots via Concurrent Networks Coupling Online and  Offline Reinforcement Learning",
    "abstract": "With the rise of computing power, using data-driven approaches for co-designing robots' morphology and controller has become a feasible way. Nevertheless, evaluating the fitness of the controller under each morphology is time-consuming. As a pioneering data-driven method, Co-adaptation utilizes a double-network mechanism with the aim of learning a Q function conditioned on morphology parameters to replace the traditional evaluation of a diverse set of candidates, thereby speeding up optimization. In this paper, we find that Co-adaptation ignores the existence of exploration error during training and state-action distribution shift during parameter transmitting, which hurt the performance. We propose the framework of the concurrent network that couples online and offline RL methods. By leveraging the behavior cloning term flexibly, we mitigate the impact of the above issues on the results. Simulation and physical experiments are performed to demonstrate that our proposed method outperforms baseline algorithms, which illustrates that the proposed method is an effective way of discovering the optimal combination of morphology and controller. ",
    "url": "https://arxiv.org/abs/2209.06579",
    "authors": [
      "Ci Chen",
      "Pingyu Xiang",
      "Haojian Lu",
      "Yue Wang",
      "Rong Xiong"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.06589",
    "title": "Towards Better Generalization with Flexible Representation of  Multi-Module Graph Neural Networks",
    "abstract": "Graph neural networks (GNNs) have become compelling models designed to perform learning and inference on graph-structured data, but little work has been done on understanding the fundamental limitations of GNNs to be scalable to larger graphs and generalized to out-of-distribution inputs. In this paper, we use a random graph generator that allows us to systematically investigate how the graph size and structural properties affect the predictive performance of GNNs. We present specific evidence that, among the many graph properties, the mean and modality of the node degree distribution are the key features that determine whether GNNs can generalize to unseen graphs. Accordingly, we propose flexible GNNs (Flex-GNNs), using multiple node update functions and the inner loop optimization as a generalization to the single type of canonical nonlinear transformation over aggregated inputs, allowing the network to adapt flexibly to new graphs. The Flex-GNN framework improves the generalization out of the training set on several inference tasks. ",
    "url": "https://arxiv.org/abs/2209.06589",
    "authors": [
      "Hyungeun Lee",
      "Hyunmok Park",
      "Kijung Yoon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.06612",
    "title": "Distribution Calibration for Out-of-Domain Detection with Bayesian  Approximation",
    "abstract": "Out-of-Domain (OOD) detection is a key component in a task-oriented dialog system, which aims to identify whether a query falls outside the predefined supported intent set. Previous softmax-based detection algorithms are proved to be overconfident for OOD samples. In this paper, we analyze overconfident OOD comes from distribution uncertainty due to the mismatch between the training and test distributions, which makes the model can't confidently make predictions thus probably causing abnormal softmax scores. We propose a Bayesian OOD detection framework to calibrate distribution uncertainty using Monte-Carlo Dropout. Our method is flexible and easily pluggable into existing softmax-based baselines and gains 33.33\\% OOD F1 improvements with increasing only 0.41\\% inference time compared to MSP. Further analyses show the effectiveness of Bayesian learning for OOD detection. ",
    "url": "https://arxiv.org/abs/2209.06612",
    "authors": [
      "Yanan Wu",
      "Zhiyuan Zeng",
      "Keqing He",
      "Yutao Mou",
      "Pei Wang",
      "Weiran Xu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.06614",
    "title": "Cluster-based multidimensional scaling embedding tool for data  visualization",
    "abstract": "We present a new technique for visualizing high-dimensional data called cluster MDS (cl-MDS), which addresses a common difficulty of dimensionality reduction methods: preserving both local and global structures of the original sample in a single 2-dimensional visualization. Its algorithm combines the well-known multidimensional scaling (MDS) tool with the $k$-medoids data clustering technique, and enables hierarchical embedding, sparsification and estimation of 2-dimensional coordinates for additional points. While cl-MDS is a generally applicable tool, we also include specific recipes for atomic structure applications. We apply this method to non-linear data of increasing complexity where different layers of locality are relevant, showing a clear improvement in their retrieval and visualization quality. ",
    "url": "https://arxiv.org/abs/2209.06614",
    "authors": [
      "Patricia Hernández-León",
      "Miguel A. Caro"
    ],
    "subjectives": [
      "Graphics (cs.GR)",
      "Materials Science (cond-mat.mtrl-sci)"
    ]
  },
  {
    "id": "arXiv:2209.06620",
    "title": "Distributionally Robust Offline Reinforcement Learning with Linear  Function Approximation",
    "abstract": "Among the reasons that hinder the application of reinforcement learning (RL) to real-world problems, two factors are critical: limited data and the mismatch of the testing environment compared to training one. In this paper, we attempt to address these issues simultaneously with the problem setup of distributionally robust offline RL. Particularly, we learn an RL agent with the historical data obtained from the source environment and optimize it to perform well in the perturbed one. Moreover, we consider the linear function approximation to apply the algorithm to large-scale problems. We prove our algorithm can achieve the suboptimality of $O(1/\\sqrt{K})$ depending on the linear function dimension $d$, which seems to be the first result with sample complexity guarantee in this setting. Diverse experiments are conducted to demonstrate our theoretical findings, showing the superiority of our algorithm against the non-robust one. ",
    "url": "https://arxiv.org/abs/2209.06620",
    "authors": [
      "Xiaoteng Ma",
      "Zhipeng Liang",
      "Li Xia",
      "Jiheng Zhang",
      "Jose Blanchet",
      "Mingwen Liu",
      "Qianchuan Zhao",
      "Zhengyuan Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.06623",
    "title": "Age of Information in Federated Learning over Wireless Networks",
    "abstract": "In this paper, federated learning (FL) over wireless networks is investigated. In each communication round, a subset of devices is selected to participate in the aggregation with limited time and energy. In order to minimize the convergence time, global loss and latency are jointly considered in a Stackelberg game based framework. Specifically, age of information (AoI) based device selection is considered at leader-level as a global loss minimization problem, while sub-channel assignment, computational resource allocation, and power allocation are considered at follower-level as a latency minimization problem. By dividing the follower-level problem into two sub-problems, the best response of the follower is obtained by a monotonic optimization based resource allocation algorithm and a matching based sub-channel assignment algorithm. By deriving the upper bound of convergence rate, the leader-level problem is reformulated, and then a list based device selection algorithm is proposed to achieve Stackelberg equilibrium. Simulation results indicate that the proposed device selection scheme outperforms other schemes in terms of the global loss, and the developed algorithms can significantly decrease the time consumption of computation and communication. ",
    "url": "https://arxiv.org/abs/2209.06623",
    "authors": [
      "Kaidi Wang",
      "Yi Ma",
      "Mahdi Boloursaz Mashhadi",
      "Chuan Heng Foh",
      "Rahim Tafazolli",
      "Zhi Ding"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06626",
    "title": "NAAP-440 Dataset and Baseline for Network Architecture Accuracy  Prediction",
    "abstract": "Network architecture search (NAS) has become a common approach to developing and discovering new neural architectures for different target platforms and purposes. However, scanning the search space is comprised of long training processes of many candidate architectures, which is costly in terms of computational resources and time. Regression algorithms are a common tool to predicting a candidate architecture's accuracy, which can dramatically accelerate the search procedure. We aim at proposing a new baseline that will support the development of regression algorithms that can predict an architecture's accuracy just from its scheme, or by only training it for a minimal number of epochs. Therefore, we introduce the NAAP-440 dataset of 440 neural architectures, which were trained on CIFAR10 using a fixed recipe. Our experiments indicate that by using off-the-shelf regression algorithms and running up to 10% of the training process, not only is it possible to predict an architecture's accuracy rather precisely, but that the values predicted for the architectures also maintain their accuracy order with a minimal number of monotonicity violations. This approach may serve as a powerful tool for accelerating NAS-based studies and thus dramatically increase their efficiency. The dataset and code used in the study have been made public. ",
    "url": "https://arxiv.org/abs/2209.06626",
    "authors": [
      "Tal Hakim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2209.06640",
    "title": "Revisiting Neural Scaling Laws in Language and Vision",
    "abstract": "The remarkable progress in deep learning in recent years is largely driven by improvements in scale, where bigger models are trained on larger datasets for longer schedules. To predict the benefit of scale empirically, we argue for a more rigorous methodology based on the extrapolation loss, instead of reporting the best-fitting (interpolating) parameters. We then present a recipe for estimating scaling law parameters reliably from learning curves. We demonstrate that it extrapolates more accurately than previous methods in a wide range of architecture families across several domains, including image classification, neural machine translation (NMT) and language modeling, in addition to tasks from the BIG-Bench evaluation benchmark. Finally, we release a benchmark dataset comprising of 90 evaluation tasks to facilitate research in this domain. ",
    "url": "https://arxiv.org/abs/2209.06640",
    "authors": [
      "Ibrahim Alabdulmohsin",
      "Behnam Neyshabur",
      "Xiaohua Zhai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.06641",
    "title": "CMR3D: Contextualized Multi-Stage Refinement for 3D Object Detection",
    "abstract": "Existing deep learning-based 3D object detectors typically rely on the appearance of individual objects and do not explicitly pay attention to the rich contextual information of the scene. In this work, we propose Contextualized Multi-Stage Refinement for 3D Object Detection (CMR3D) framework, which takes a 3D scene as input and strives to explicitly integrate useful contextual information of the scene at multiple levels to predict a set of object bounding-boxes along with their corresponding semantic labels. To this end, we propose to utilize a context enhancement network that captures the contextual information at different levels of granularity followed by a multi-stage refinement module to progressively refine the box positions and class predictions. Extensive experiments on the large-scale ScanNetV2 benchmark reveal the benefits of our proposed method, leading to an absolute improvement of 2.0% over the baseline. In addition to 3D object detection, we investigate the effectiveness of our CMR3D framework for the problem of 3D object counting. Our source code will be publicly released. ",
    "url": "https://arxiv.org/abs/2209.06641",
    "authors": [
      "Dhanalaxmi Gaddam",
      "Jean Lahoud",
      "Fahad Shahbaz Khan",
      "Rao Muhammad Anwer",
      "Hisham Cholakkal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.06675",
    "title": "Volumetric-based Contact Point Detection for 7-DoF Grasping",
    "abstract": "In this paper, we propose a novel grasp pipeline based on contact point detection on the truncated signed distance function (TSDF) volume to achieve closed-loop 7-degree-of-freedom (7-DoF) grasping on cluttered environments. The key aspects of our method are that 1) the proposed pipeline exploits the TSDF volume in terms of multi-view fusion, contact-point sampling and evaluation, and collision checking, which provides reliable and collision-free 7-DoF gripper poses with real-time performance; 2) the contact-based pose representation effectively eliminates the ambiguity introduced by the normal-based methods, which provides a more precise and flexible solution. Extensive simulated and real-robot experiments demonstrate that the proposed pipeline can select more antipodal and stable grasp poses and outperforms normal-based baselines in terms of the grasp success rate in both simulated and physical scenarios. ",
    "url": "https://arxiv.org/abs/2209.06675",
    "authors": [
      "Junhao Cai",
      "Jingcheng Su",
      "Zida Zhou",
      "Hui Cheng",
      "Qifeng Chen",
      "Michael Y Wang"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.06681",
    "title": "A Benchmark and a Baseline for Robust Multi-view Depth Estimation",
    "abstract": "Recent deep learning approaches for multi-view depth estimation are employed either in a depth-from-video or a multi-view stereo setting. Despite different settings, these approaches are technically similar: they correlate multiple source views with a keyview to estimate a depth map for the keyview. In this work, we introduce the Robust Multi-View Depth Benchmark that is built upon a set of public datasets and allows evaluation in both settings on data from different domains. We evaluate recent approaches and find imbalanced performances across domains. Further, we consider a third setting, where camera poses are available and the objective is to estimate the corresponding depth maps with their correct scale. We show that recent approaches do not generalize across datasets in this setting. This is because their cost volume output runs out of distribution. To resolve this, we present the Robust MVD Baseline model for multi-view depth estimation, which is built upon existing components but employs a novel scale augmentation procedure. It can be applied for robust multi-view depth estimation, independent of the target data. We provide code for the proposed benchmark and baseline model at https://github.com/lmb-freiburg/robustmvd. ",
    "url": "https://arxiv.org/abs/2209.06681",
    "authors": [
      "Philipp Schröppel",
      "Jan Bechtold",
      "Artemij Amiranashvili",
      "Thomas Brox"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.06691",
    "title": "Certified Robustness to Word Substitution Ranking Attack for Neural  Ranking Models",
    "abstract": "Neural ranking models (NRMs) have achieved promising results in information retrieval. NRMs have also been shown to be vulnerable to adversarial examples. A typical Word Substitution Ranking Attack (WSRA) against NRMs was proposed recently, in which an attacker promotes a target document in rankings by adding human-imperceptible perturbations to its text. This raises concerns when deploying NRMs in real-world applications. Therefore, it is important to develop techniques that defend against such attacks for NRMs. In empirical defenses adversarial examples are found during training and used to augment the training set. However, such methods offer no theoretical guarantee on the models' robustness and may eventually be broken by other sophisticated WSRAs. To escape this arms race, rigorous and provable certified defense methods for NRMs are needed. To this end, we first define the \\textit{Certified Top-$K$ Robustness} for ranking models since users mainly care about the top ranked results in real-world scenarios. A ranking model is said to be Certified Top-$K$ Robust on a ranked list when it is guaranteed to keep documents that are out of the top $K$ away from the top $K$ under any attack. Then, we introduce a Certified Defense method, named CertDR, to achieve certified top-$K$ robustness against WSRA, based on the idea of randomized smoothing. Specifically, we first construct a smoothed ranker by applying random word substitutions on the documents, and then leverage the ranking property jointly with the statistical property of the ensemble to provably certify top-$K$ robustness. Extensive experiments on two representative web search datasets demonstrate that CertDR can significantly outperform state-of-the-art empirical defense methods for ranking models. ",
    "url": "https://arxiv.org/abs/2209.06691",
    "authors": [
      "Chen Wu",
      "Ruqing Zhang",
      "Jiafeng Guo",
      "Wei Chen",
      "Yixing Fan",
      "Maarten de Rijke",
      "Xueqi Cheng"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2209.06695",
    "title": "Parameterized algorithms for node connectivity augmentation problems",
    "abstract": "A graph $G$ is $k$-out-connected from its node $s$ if it contains $k$ internally disjoint $sv$-paths to every node $v$; $G$ is $k$-connected if it is $k$-out-connected from every node. In connectivity augmentation problems the goal is to augment a graph $G_0=(V,E_0)$ by a minimum costs edge set $J$ such that $G_0 \\cup J$ has higher connectivity than $G_0$. In the $k$-Out-Connectivity Augmentation ($k$-OCA) problem, $G_0$ is $(k-1)$-out-connected from $s$ and $G_0 \\cup J$ should be $k$-out-connected from $s$; in the $k$-Connectivity Augmentation ($k$-CA) problem $G_0$ is $(k-1)$-connected and $G_0 \\cup J$ should be $k$-connected. The parameterized complexity status of these problems was open even for $k=3$ and unit costs. We will show that $k$-OCA and $3$-CA can be solved in time $9^p \\cdot n^{O(1)}$, where $p$ is the size of an optimal solution. Our paper is the first that shows fixed parameter tractability of a $k$-node-connectivity augmentation problem with high values of $k$. We will also consider the $(2,k)$-Connectivity Augmentation problem where $G_0$ is $(k-1)$-edge-connected and $G_0 \\cup J$ should be both $k$-edge-connected and $2$-connected. We will show that this problem can be solved in time $9^p \\cdot n^{O(1)}$, and for unit costs approximated within $1.892$. ",
    "url": "https://arxiv.org/abs/2209.06695",
    "authors": [
      "Zeev Nutov"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2209.06722",
    "title": "Detection of Smart Grid Integrity Attacks Using Signal Temporal Logic",
    "abstract": "Cyber-attacks can have severe impacts on critical infrastructures, from outages to economical loss and physical damage to people and environment. One of the main targets of these attacks is the smart grid. In this paper, we propose a new software detector for integrity attacks targeting smart meter readings. The detector relies upon mining parameters of temporal logic specifications for integrity attack classification. To this end, we use Signal Temporal Logic (STL) for specifying properties over time series. Our approach considers different \"attack scenarios\" found in last years: given a parametric formula for each \"attack scenario\" and a set of labeled traces, we aim at finding the parameter valuation that validates each template. ",
    "url": "https://arxiv.org/abs/2209.06722",
    "authors": [
      "José Ignacio Requeno"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2209.06723",
    "title": "Toward Improving Health Literacy in Patient Education Materials with  Neural Machine Translation Models",
    "abstract": "Health literacy is the central focus of Healthy People 2030, the fifth iteration of the U.S. national goals and objectives. People with low health literacy usually have trouble understanding health information, following post-visit instructions, and using prescriptions, which results in worse health outcomes and serious health disparities. In this study, we propose to leverage natural language processing techniques to improve health literacy in patient education materials by automatically translating illiterate languages in a given sentence. We scraped patient education materials from four online health information websites: MedlinePlus.gov, Drugs.com, Mayoclinic.org and Reddit.com. We trained and tested the state-of-the-art neural machine translation (NMT) models on a silver standard training dataset and a gold standard testing dataset, respectively. The experimental results showed that the Bidirectional Long Short-Term Memory (BiLSTM) NMT model outperformed Bidirectional Encoder Representations from Transformers (BERT)-based NMT models. We also verified the effectiveness of NMT models in translating health illiterate languages by comparing the ratio of health illiterate language in the sentence. The proposed NMT models were able to identify the correct complicated words and simplify into layman language while at the same time the models suffer from sentence completeness, fluency, readability, and have difficulty in translating certain medical terms. ",
    "url": "https://arxiv.org/abs/2209.06723",
    "authors": [
      "David Oniani",
      "Sreekanth Sreekumar",
      "Renuk DeAlmeida",
      "Dinuk DeAlmeida",
      "Vivian Hui",
      "Young Ji Lee",
      "Yiye Zhang",
      "Leming Zhou",
      "Yanshan Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.06767",
    "title": "Parameter-Efficient Finetuning for Robust Continual Multilingual  Learning",
    "abstract": "NLU systems deployed in the real world are expected to be regularly updated by retraining or finetuning the underlying neural network on new training examples accumulated over time. In our work, we focus on the multilingual setting where we would want to further finetune a multilingual model on new training data for the same NLU task on which the aforementioned model has already been trained for. We show that under certain conditions, naively updating the multilingual model can lead to losses in performance over a subset of languages although the aggregated performance metric shows an improvement. We establish this phenomenon over four tasks belonging to three task families (token-level, sentence-level and seq2seq) and find that the baseline is far from ideal for the setting at hand. We then build upon recent advances in parameter-efficient finetuning to develop novel finetuning pipelines that allow us to jointly minimize catastrophic forgetting while encouraging positive cross-lingual transfer, hence improving the spread of gains over different languages while reducing the losses incurred in this setup. ",
    "url": "https://arxiv.org/abs/2209.06767",
    "authors": [
      "Kartikeya Badola",
      "Shachi Dave",
      "Partha Talukdar"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.06790",
    "title": "Drawing Causal Inferences About Performance Effects in NLP",
    "abstract": "This article emphasizes that NLP as a science seeks to make inferences about the performance effects that result from applying one method (compared to another method) in the processing of natural language. Yet NLP research in practice usually does not achieve this goal: In NLP research articles, typically only a few models are compared. Each model results from a specific procedural pipeline (here named processing system) that is composed of a specific collection of methods that are used in preprocessing, pretraining, hyperparameter tuning, and training on the target task. To make generalizing inferences about the performance effect that is caused by applying some method A vs. another method B, it is not sufficient to compare a few specific models that are produced by a few specific (probably incomparable) processing systems. Rather, the following procedure would allow drawing inferences about methods' performance effects: (1) A population of processing systems that researchers seek to infer to has to be defined. (2) A random sample of processing systems from this population is drawn. (The drawn processing systems in the sample will vary with regard to the methods they apply along their procedural pipelines and also will vary regarding the compositions of their training and test data sets used for training and evaluation.) (3) Each processing system is applied once with method A and once with method B. (4) Based on the sample of applied processing systems, the expected generalization errors of method A and method B are approximated. (5) The difference between the expected generalization errors of method A and method B is the estimated average treatment effect due to applying method A compared to method B in the population of processing systems. ",
    "url": "https://arxiv.org/abs/2209.06790",
    "authors": [
      "Sandra Wankmüller"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.06804",
    "title": "Towards Automated Survey Variable Search and Summarization in Social  Science Publications",
    "abstract": "Nowadays there is a growing trend in many scientific disciplines to support researchers by providing enhanced information access through linking of publications and underlying datasets, so as to support research with infrastructure to enhance reproducibility and reusability of research results. In this research note, we present an overview of an ongoing research project, named VADIS (VAriable Detection, Interlinking and Summarization), that aims at developing technology and infrastructure for enhanced information access in the Social Sciences via search and summarization of publications on the basis of automatic identification and indexing of survey variables in text. We provide an overview of the overarching vision underlying our project, its main components, and related challenges, as well as a thorough discussion of how these are meant to address the limitations of current information access systems for publications in the Social Sciences. We show how this goal can be concretely implemented in an end-user system by presenting a search prototype, which is based on user requirements collected from qualitative interviews with empirical Social Science researchers. ",
    "url": "https://arxiv.org/abs/2209.06804",
    "authors": [
      "Yavuz Selim Kartal",
      "Sotaro Takeshita",
      "Tornike Tsereteli",
      "Kai Eckert",
      "Henning Kroll",
      "Philipp Mayr",
      "Simone Paolo Ponzetto",
      "Benjamin Zapilko",
      "Andrea Zielinski"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2209.06813",
    "title": "Will there be a construction? Predicting road constructions based on  heterogeneous spatiotemporal data",
    "abstract": "Road construction projects maintain transportation infrastructures. These projects range from the short-term (e.g., resurfacing or fixing potholes) to the long-term (e.g., adding a shoulder or building a bridge). Deciding what the next construction project is and when it is to be scheduled is traditionally done through inspection by humans using special equipment. This approach is costly and difficult to scale. An alternative is the use of computational approaches that integrate and analyze multiple types of past and present spatiotemporal data to predict location and time of future road constructions. This paper reports on such an approach, one that uses a deep-neural-network-based model to predict future constructions. Our model applies both convolutional and recurrent components on a heterogeneous dataset consisting of construction, weather, map and road-network data. We also report on how we addressed the lack of adequate publicly available data - by building a large scale dataset named \"US-Constructions\", that includes 6.2 million cases of road constructions augmented by a variety of spatiotemporal attributes and road-network features, collected in the contiguous United States (US) between 2016 and 2021. Using extensive experiments on several major cities in the US, we show the applicability of our work in accurately predicting future constructions - an average f1-score of 0.85 and accuracy 82.2% - that outperform baselines. Additionally, we show how our training pipeline addresses spatial sparsity of data. ",
    "url": "https://arxiv.org/abs/2209.06813",
    "authors": [
      "Amin Karimi Monsefi",
      "Sobhan Moosavi",
      "Rajiv Ramnath"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.06814",
    "title": "Neural Point-based Shape Modeling of Humans in Challenging Clothing",
    "abstract": "Parametric 3D body models like SMPL only represent minimally-clothed people and are hard to extend to clothing because they have a fixed mesh topology and resolution. To address these limitations, recent work uses implicit surfaces or point clouds to model clothed bodies. While not limited by topology, such methods still struggle to model clothing that deviates significantly from the body, such as skirts and dresses. This is because they rely on the body to canonicalize the clothed surface by reposing it to a reference shape. Unfortunately, this process is poorly defined when clothing is far from the body. Additionally, they use linear blend skinning to pose the body and the skinning weights are tied to the underlying body parts. In contrast, we model the clothing deformation in a local coordinate space without canonicalization. We also relax the skinning weights to let multiple body parts influence the surface. Specifically, we extend point-based methods with a coarse stage, that replaces canonicalization with a learned pose-independent \"coarse shape\" that can capture the rough surface geometry of clothing like skirts. We then refine this using a network that infers the linear blend skinning weights and pose dependent displacements from the coarse representation. The approach works well for garments that both conform to, and deviate from, the body. We demonstrate the usefulness of our approach by learning person-specific avatars from examples and then show how they can be animated in new poses and motions. We also show that the method can learn directly from raw scans with missing data, greatly simplifying the process of creating realistic avatars. Code is available for research purposes at {\\small\\url{https://qianlim.github.io/SkiRT}}. ",
    "url": "https://arxiv.org/abs/2209.06814",
    "authors": [
      "Qianli Ma",
      "Jinlong Yang",
      "Michael J. Black",
      "Siyu Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2209.06265",
    "title": "Automated detection of pronunciation errors in non-native English speech  employing deep learning",
    "abstract": "Despite significant advances in recent years, the existing Computer-Assisted Pronunciation Training (CAPT) methods detect pronunciation errors with a relatively low accuracy (precision of 60% at 40%-80% recall). This Ph.D. work proposes novel deep learning methods for detecting pronunciation errors in non-native (L2) English speech, outperforming the state-of-the-art method in AUC metric (Area under the Curve) by 41%, i.e., from 0.528 to 0.749. One of the problems with existing CAPT methods is the low availability of annotated mispronounced speech needed for reliable training of pronunciation error detection models. Therefore, the detection of pronunciation errors is reformulated to the task of generating synthetic mispronounced speech. Intuitively, if we could mimic mispronounced speech and produce any amount of training data, detecting pronunciation errors would be more effective. Furthermore, to eliminate the need to align canonical and recognized phonemes, a novel end-to-end multi-task technique to directly detect pronunciation errors was proposed. The pronunciation error detection models have been used at Amazon to automatically detect pronunciation errors in synthetic speech to accelerate the research into new speech synthesis methods. It was demonstrated that the proposed deep learning methods are applicable in the tasks of detecting and reconstructing dysarthric speech. ",
    "url": "https://arxiv.org/abs/2209.06265",
    "authors": [
      "Daniel Korzekwa"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)",
      "Other Quantitative Biology (q-bio.OT)"
    ]
  },
  {
    "id": "arXiv:2209.06349",
    "title": "Structure and Complexity of Graphical Designs for Weighted Graphs  through Eigenpolytopes",
    "abstract": "We extend the theory of graphical designs, which are quadrature rules for graphs, to positively weighted graphs. Through Gale duality for polytopes, we show that there is a bijection between graphical designs and the faces of eigenpolytopes associated to the graph. This bijection proves the existence of graphical designs with positive quadrature weights, and upper bounds the size of a graphical design. We further show that any combinatorial polytope appears as the eigenpolytope of a positively weighted graph. Through this universality, we establish two complexity results for graphical designs: it is strongly NP-complete to determine if there is a graphical design smaller than the mentioned upper bound, and it is #P-complete to count the number of minimal graphical designs. ",
    "url": "https://arxiv.org/abs/2209.06349",
    "authors": [
      "Catherine Babecki",
      "David Shiroma"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2209.06353",
    "title": "Label Refinement Network from Synthetic Error Augmentation for Medical  Image Segmentation",
    "abstract": "Deep convolutional neural networks for image segmentation do not learn the label structure explicitly and may produce segmentations with an incorrect structure, e.g., with disconnected cylindrical structures in the segmentation of tree-like structures such as airways or blood vessels. In this paper, we propose a novel label refinement method to correct such errors from an initial segmentation, implicitly incorporating information about label structure. This method features two novel parts: 1) a model that generates synthetic structural errors, and 2) a label appearance simulation network that produces synthetic segmentations (with errors) that are similar in appearance to the real initial segmentations. Using these synthetic segmentations and the original images, the label refinement network is trained to correct errors and improve the initial segmentations. The proposed method is validated on two segmentation tasks: airway segmentation from chest computed tomography (CT) scans and brain vessel segmentation from 3D CT angiography (CTA) images of the brain. In both applications, our method significantly outperformed a standard 3D U-Net and other previous refinement approaches. Improvements are even larger when additional unlabeled data is used for model training. In an ablation study, we demonstrate the value of the different components of the proposed method. ",
    "url": "https://arxiv.org/abs/2209.06353",
    "authors": [
      "Shuai Chen",
      "Antonio Garcia Uceda",
      "Jiahang Su",
      "Gijs van Tulder",
      "Lennard Wolff",
      "Theo van Walsum",
      "Marleen de Bruijne"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.06392",
    "title": "Joint User and Data Detection in Grant-Free NOMA with Attention-based  BiLSTM Network",
    "abstract": "We consider the multi-user detection (MUD) problem in uplink grant-free non-orthogonal multiple access (NOMA), where the access point has to identify the total number and correct identity of the active Internet of Things (IoT) devices and decode their transmitted data. We assume that IoT devices use complex spreading sequences and transmit information in a random-access manner following the burst-sparsity model, where some IoT devices transmit their data in multiple adjacent time slots with a high probability, while others transmit only once during a frame. Exploiting the temporal correlation, we propose an attention-based bidirectional long short-term memory (BiLSTM) network to solve the MUD problem. The BiLSTM network creates a pattern of the device activation history using forward and reverse pass LSTMs, whereas the attention mechanism provides essential context to the device activation points. By doing so, a hierarchical pathway is followed for detecting active devices in a grant-free scenario. Then, by utilising the complex spreading sequences, blind data detection for the estimated active devices is performed. The proposed framework does not require prior knowledge of device sparsity levels and channels for performing MUD. The results show that the proposed network achieves better performance compared to existing benchmark schemes. ",
    "url": "https://arxiv.org/abs/2209.06392",
    "authors": [
      "Saud Khan",
      "Salman Durrani",
      "Muhammad Basit Shahab",
      "Sarah J. Johnson",
      "Seyit Camtepe"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2209.06402",
    "title": "Embedding Irregular Colorings into Connected Factorizations",
    "abstract": "For $r:=(r_1,\\dots,r_k)$, an $r$-factorization of the complete $\\lambda$-fold $h$-uniform $n$-vertex hypergraph $\\lambda K_n^h$ is a partition of (the edges of) $\\lambda K_n^h$ into $F_1,\\dots, F_k$ such that for $i=1,\\dots,k$, $F_i$ is $r_i$-regular and spanning. Suppose that $n \\geq (h-1)(2m-1)$. Given a partial $r$-factorization of $\\lambda K_m^h$, that is, a coloring (i.e. partition) $P$ of the edges of $\\lambda K_m^h$ into $F_1,\\dots, F_k$ such that for $i=1,\\dots,k$, $F_i$ is spanning and the degree of each vertex in $F_i$ is at most $r_i$, we find necessary and sufficient conditions that ensure $P$ can be extended to a connected $r$-factorization of $\\lambda K_n^h$ (i.e. an $r$-factorization in which each factor is connected). Moreover, we prove a general result that implies the following. Given a partial $s$-factorization $P$ of any sub-hypergraph of $\\lambda K_m^h$, where $s:=(s_1,\\dots,s_q)$ and $q$ is not too big, we find necessary and sufficient conditions under which $P$ can be embedded into a connected $r$-factorization of $\\lambda K_n^h$. These results can be seen as unified generalizations of various classical combinatorial results such as Cruse's theorem on embedding partial symmetric latin squares, Baranyai's theorem on factorization of hypergraphs, Hilton's theorem on extending path decompositions into Hamiltonian decompositions, H\\\"{a}ggkvist and Hellgren's theorem on extending 1-factorizations, and Hilton, Johnson, Rodger, and Wantland's theorem on embedding connected factorizations. ",
    "url": "https://arxiv.org/abs/2209.06402",
    "authors": [
      "Amin Bahmanian",
      "Anna Johnsen"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2209.06413",
    "title": "Continuous longitudinal fetus brain atlas construction via implicit  neural representation",
    "abstract": "Longitudinal fetal brain atlas is a powerful tool for understanding and characterizing the complex process of fetus brain development. Existing fetus brain atlases are typically constructed by averaged brain images on discrete time points independently over time. Due to the differences in onto-genetic trends among samples at different time points, the resulting atlases suffer from temporal inconsistency, which may lead to estimating error of the brain developmental characteristic parameters along the timeline. To this end, we proposed a multi-stage deep-learning framework to tackle the time inconsistency issue as a 4D (3D brain volume + 1D age) image data denoising task. Using implicit neural representation, we construct a continuous and noise-free longitudinal fetus brain atlas as a function of the 4D spatial-temporal coordinate. Experimental results on two public fetal brain atlases (CRL and FBA-Chinese atlases) show that the proposed method can significantly improve the atlas temporal consistency while maintaining good fetus brain structure representation. In addition, the continuous longitudinal fetus brain atlases can also be extensively applied to generate finer 4D atlases in both spatial and temporal resolution. ",
    "url": "https://arxiv.org/abs/2209.06413",
    "authors": [
      "Lixuan Chen",
      "Jiangjie Wu",
      "Qing Wu",
      "Hongjiang Wei",
      "Yuyao Zhang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.06642",
    "title": "A Robust Scientific Machine Learning for Optimization: A Novel  Robustness Theorem",
    "abstract": "Scientific machine learning (SciML) is a field of increasing interest in several different application fields. In an optimization context, SciML-based tools have enabled the development of more efficient optimization methods. However, implementing SciML tools for optimization must be rigorously evaluated and performed with caution. This work proposes the deductions of a robustness test that guarantees the robustness of multiobjective SciML-based optimization by showing that its results respect the universal approximator theorem. The test is applied in the framework of a novel methodology which is evaluated in a series of benchmarks illustrating its consistency. Moreover, the proposed methodology results are compared with feasible regions of rigorous optimization, which requires a significantly higher computational effort. Hence, this work provides a robustness test for guaranteed robustness in applying SciML tools in multiobjective optimization with lower computational effort than the existent alternative. ",
    "url": "https://arxiv.org/abs/2209.06642",
    "authors": [
      "Luana P. Queiroz",
      "Carine M. Rebello",
      "Erber A. Costa",
      "Vinicius V. Santana",
      "Alirio E. Rodrigues",
      "Ana M. Ribeiro",
      "Idelfonso B. R. Nogueira"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2209.06760",
    "title": "Optimal Active Fault Detection in Inverter-Based Grids",
    "abstract": "Ground faults in converter-based grids can be difficult to detect because, unlike in grids with synchronous machines, they often do not result in large currents. One recent strategy is for each converter to inject a perturbation that makes faults easier to distinguish from normal operation. In this paper, we construct optimal perturbation sequences for use with the Multiple Model Kalman Filter. The perturbations maximize the difference between faulty and fault-free operation while respecting limits on performance degradation. Simulations show that the optimal input sequence increases the confidence of fault detection while decreasing detection time. It is shown that there is a tradeoff between detection and degradation of the control performance, and that the method is robust to parameter variations. ",
    "url": "https://arxiv.org/abs/2209.06760",
    "authors": [
      "Mohammad Pirani",
      "Mehdi Hosseinzadeh",
      "Joshua A. Taylor",
      "Bruno Sinopoli"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2105.08601",
    "title": "Graph Neural Networks for Decentralized Multi-Robot Submodular Action  Selection",
    "abstract": " Title: Graph Neural Networks for Decentralized Multi-Robot Submodular Action  Selection ",
    "url": "https://arxiv.org/abs/2105.08601",
    "authors": [
      "Lifeng Zhou",
      "Vishnu D. Sharma",
      "Qingbiao Li",
      "Amanda Prorok",
      "Alejandro Ribeiro",
      "Pratap Tokekar",
      "Vijay Kumar"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2107.01507",
    "title": "Mission-level Robustness with Rapidly-deployed, Autonomous Aerial  Vehicles by Carnegie Mellon Team Tartan at MBZIRC 2020",
    "abstract": " Comments: 29 pages, 26 figures. Published in Field Robotics, Special Issue on MBZIRC 2020 ",
    "url": "https://arxiv.org/abs/2107.01507",
    "authors": [
      "Anish Bhattacharya",
      "Akshit Gandhi",
      "Lukas Merkle",
      "Rohan Tiwari",
      "Karun Warrior",
      "Stanley Winata",
      "Andrew Saba",
      "Kevin Zhang",
      "Oliver Kroemer",
      "Sebastian Scherer"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2107.13144",
    "title": "Content-aware Directed Propagation Network with Pixel Adaptive Kernel  Attention",
    "abstract": " Title: Content-aware Directed Propagation Network with Pixel Adaptive Kernel  Attention ",
    "url": "https://arxiv.org/abs/2107.13144",
    "authors": [
      "Min-Cheol Sagong",
      "Yoon-Jae Yeo",
      "Seung-Won Jung",
      "Sung-Jea Ko"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.10229",
    "title": "Adoption and Actual Privacy of Decentralized CoinJoin Implementations in  Bitcoin",
    "abstract": " Title: Adoption and Actual Privacy of Decentralized CoinJoin Implementations in  Bitcoin ",
    "url": "https://arxiv.org/abs/2109.10229",
    "authors": [
      "Rainer Stütz",
      "Johann Stockinger",
      "Bernhard Haslhofer",
      "Pedro Moreno-Sanchez",
      "Matteo Maffei"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2110.05057",
    "title": "Can Stochastic Gradient Langevin Dynamics Provide Differential Privacy  for Deep Learning?",
    "abstract": " Title: Can Stochastic Gradient Langevin Dynamics Provide Differential Privacy  for Deep Learning? ",
    "url": "https://arxiv.org/abs/2110.05057",
    "authors": [
      "Guy Heller",
      "Ethan Fetaya"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2111.14549",
    "title": "MeshUDF: Fast and Differentiable Meshing of Unsigned Distance Field  Networks",
    "abstract": " Title: MeshUDF: Fast and Differentiable Meshing of Unsigned Distance Field  Networks ",
    "url": "https://arxiv.org/abs/2111.14549",
    "authors": [
      "Benoit Guillard",
      "Federico Stella",
      "Pascal Fua"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.10544",
    "title": "Wavenumber explicit convergence of a multiscale generalized finite  element method for heterogeneous Helmholtz problems",
    "abstract": " Title: Wavenumber explicit convergence of a multiscale generalized finite  element method for heterogeneous Helmholtz problems ",
    "url": "https://arxiv.org/abs/2112.10544",
    "authors": [
      "Chupeng Ma",
      "Christian Alber",
      "Robert Scheichl"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2201.11720",
    "title": "Simplicial Convolutional Filters",
    "abstract": " Comments: 16 pages, 13 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2201.11720",
    "authors": [
      "Maosheng Yang",
      "Elvin Isufi",
      "Michael T. Schaub",
      "Geert Leus"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Algebraic Topology (math.AT)",
      "Spectral Theory (math.SP)"
    ]
  },
  {
    "id": "arXiv:2202.00065",
    "title": "Learning affective meanings that derives the social behavior using  Bidirectional Encoder Representations from Transformers",
    "abstract": " Comments: Working paper ",
    "url": "https://arxiv.org/abs/2202.00065",
    "authors": [
      "Moeen Mostafavi",
      "Michael D. Porter",
      "Dawn T. Robinson"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2202.05777",
    "title": "Metastability of the Potts ferromagnet on random regular graphs",
    "abstract": " Comments: Abstract shortened for arXiv ",
    "url": "https://arxiv.org/abs/2202.05777",
    "authors": [
      "Amin Coja-Oghlan",
      "Andreas Galanis",
      "Leslie Ann Goldberg",
      "Jean Bernoulli Ravelomanana",
      "Daniel Stefankovic",
      "Eric Vigoda"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2202.08583",
    "title": "Point cloud completion via structured feature maps using a feedback  network",
    "abstract": " Comments: to be published in journel of computational visual media ",
    "url": "https://arxiv.org/abs/2202.08583",
    "authors": [
      "Zejia Su",
      "Haibin Huang",
      "Chongyang Ma",
      "Hui Huang",
      "Ruizhen Hu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.17110",
    "title": "Impact of Environmental Noise on Alzheimer's Disease Detection from  Speech: Should You Let a Baby Cry?",
    "abstract": " Comments: W-NUT at COLING 2022 ",
    "url": "https://arxiv.org/abs/2203.17110",
    "authors": [
      "Jekaterina Novikova"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.02455",
    "title": "Improving Voice Trigger Detection with Metric Learning",
    "abstract": " Comments: Accepted at InterSpeech 2022 ",
    "url": "https://arxiv.org/abs/2204.02455",
    "authors": [
      "Prateeth Nayak",
      "Takuya Higuchi",
      "Anmol Gupta",
      "Shivesh Ranjan",
      "Stephen Shum",
      "Siddharth Sigtia",
      "Erik Marchi",
      "Varun Lakshminarasimhan",
      "Minsik Cho",
      "Saurabh Adya",
      "Chandra Dhir",
      "Ahmed Tewfik"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.10194",
    "title": "Semantic Structure based Query Graph Prediction for Question Answering  over Knowledge Graph",
    "abstract": " Comments: Published as a conference paper at COLING 2022 ",
    "url": "https://arxiv.org/abs/2204.10194",
    "authors": [
      "Mingchen Li",
      "Shihao Ji"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.11294",
    "title": "Colorectal cancer survival prediction using deep distribution based  multiple-instance learning",
    "abstract": " Title: Colorectal cancer survival prediction using deep distribution based  multiple-instance learning ",
    "url": "https://arxiv.org/abs/2204.11294",
    "authors": [
      "Xingyu Li",
      "Jitendra Jonnagaddala",
      "Min Cen",
      "Hong Zhang",
      "Xu Steven Xu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12079",
    "title": "Exact Wirelength of Embedding 3-Ary n-Cubes into certain Cylinders and  Trees",
    "abstract": " Comments: 13 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2204.12079",
    "authors": [
      "Rajeshwari S",
      "M Rajesh"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2205.02620",
    "title": "Heterogeneous Semantic and Bit Communications: A Semi-NOMA Scheme",
    "abstract": " Comments: 32 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2205.02620",
    "authors": [
      "Xidong Mu",
      "Yuanwei Liu",
      "Li Guo",
      "Naofal Al-Dhahir"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.09229",
    "title": "PromptDA: Label-guided Data Augmentation for Prompt-based Few Shot  Learners",
    "abstract": " Title: PromptDA: Label-guided Data Augmentation for Prompt-based Few Shot  Learners ",
    "url": "https://arxiv.org/abs/2205.09229",
    "authors": [
      "Canyu Chen",
      "Kai Shu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.09867",
    "title": "Debiasing isn't enough! -- On the Effectiveness of Debiasing MLMs and  their Social Biases in Downstream Tasks",
    "abstract": " Comments: COLING 2022 ",
    "url": "https://arxiv.org/abs/2205.09867",
    "authors": [
      "Masahiro Kaneko",
      "Danushka Bollegala",
      "Naoaki Okazaki"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.10726",
    "title": "TWEET-FID: An Annotated Dataset for Multiple Foodborne Illness Detection  Tasks",
    "abstract": " Comments: LREC 2022 ",
    "url": "https://arxiv.org/abs/2205.10726",
    "authors": [
      "Ruofan Hu",
      "Dongyu Zhang",
      "Dandan Tao",
      "Thomas Hartvigsen",
      "Hao Feng",
      "Elke Rundensteiner"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10457",
    "title": "Domain Adaptive 3D Pose Augmentation for In-the-wild Human Mesh Recovery",
    "abstract": " Title: Domain Adaptive 3D Pose Augmentation for In-the-wild Human Mesh Recovery ",
    "url": "https://arxiv.org/abs/2206.10457",
    "authors": [
      "Zhenzhen Weng",
      "Kuan-Chieh Wang",
      "Angjoo Kanazawa",
      "Serena Yeung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05446",
    "title": "CoditT5: Pretraining for Source Code and Natural Language Editing",
    "abstract": " Comments: ASE 2022 (camera ready) ",
    "url": "https://arxiv.org/abs/2208.05446",
    "authors": [
      "Jiyang Zhang",
      "Sheena Panthaplackel",
      "Pengyu Nie",
      "Junyi Jessy Li",
      "Milos Gligoric"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.10378",
    "title": "Inductive Knowledge Graph Reasoning for Multi-batch Emerging Entities",
    "abstract": " Comments: Accepted in the 31st ACM International Conference on Information and Knowledge Management (CIKM 2022) ",
    "url": "https://arxiv.org/abs/2208.10378",
    "authors": [
      "Yuanning Cui",
      "Yuxin Wang",
      "Zequn Sun",
      "Wenqiang Liu",
      "Yiqiao Jiang",
      "Kexin Han",
      "Wei Hu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.01677",
    "title": "National Power as Network Flow",
    "abstract": " Title: National Power as Network Flow ",
    "url": "https://arxiv.org/abs/2209.01677",
    "authors": [
      "Michael Poulshock"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.04612",
    "title": "Harnessing Abstractive Summarization for Fact-Checked Claim Detection",
    "abstract": " Comments: 12 pages; Accepted at COLING 2022 ",
    "url": "https://arxiv.org/abs/2209.04612",
    "authors": [
      "Varad Bhatnagar",
      "Diptesh Kanojia",
      "Kameswari Chebrolu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.05040",
    "title": "SANCL: Multimodal Review Helpfulness Prediction with Selective Attention  and Natural Contrastive Learning",
    "abstract": " Comments: Accepted as a long paper at COLING 2022 ",
    "url": "https://arxiv.org/abs/2209.05040",
    "authors": [
      "Wei Han",
      "Hui Chen",
      "Zhen Hai",
      "Soujanya Poria",
      "Lidong Bing"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.05104",
    "title": "Bias Challenges in Counterfactual Data Augmentation",
    "abstract": " Comments: Accepted at UAI 2022 Workshop on Causal Representation Learning ",
    "url": "https://arxiv.org/abs/2209.05104",
    "authors": [
      "S Chandra Mouli",
      "Yangze Zhou",
      "Bruno Ribeiro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.05152",
    "title": "Detecting Network-based Internet Censorship via Latent Feature  Representation Learning",
    "abstract": " Title: Detecting Network-based Internet Censorship via Latent Feature  Representation Learning ",
    "url": "https://arxiv.org/abs/2209.05152",
    "authors": [
      "Shawn P. Duncan",
      "Hui Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.05166",
    "title": "Global Prototype Encoding for Incremental Video Highlights Detection",
    "abstract": " Title: Global Prototype Encoding for Incremental Video Highlights Detection ",
    "url": "https://arxiv.org/abs/2209.05166",
    "authors": [
      "Sen Pei",
      "Shixiong Xu",
      "Ye Yuan",
      "Xiaojie Jin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.06078",
    "title": "On the Optimal Combination of Cross-Entropy and Soft Dice Losses for  Lesion Segmentation with Out-of-Distribution Robustness",
    "abstract": " Comments: Accepted at the DFU Challenge Proceedings, part of MICCAI 2022 ",
    "url": "https://arxiv.org/abs/2209.06078",
    "authors": [
      "Adrian Galdran",
      "Gustavo Carneiro",
      "Miguel Ángel González Ballester"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]