[
  {
    "id": "arXiv:2109.03848",
    "title": "Knowledge mining of unstructured information: application to  cyber-domain",
    "abstract": "Cyber intelligence is widely and abundantly available in numerous open online sources with reports on vulnerabilities and incidents. This constant stream of noisy information requires new tools and techniques if it is to be used for the benefit of analysts and investigators in various organizations. In this paper we present and implement a novel knowledge graph and knowledge mining framework for extracting relevant information from free-form text about incidents in the cyber domain. Our framework includes a machine learning based pipeline as well as crawling methods for generating graphs of entities, attackers and the related information with our non-technical cyber ontology. We test our framework on publicly available cyber incident datasets to evaluate the accuracy of our knowledge mining methods as well as the usefulness of the framework in the use of cyber analysts. Our results show analyzing the knowledge graph constructed using the novel framework, an analyst can infer additional information from the current cyber landscape in terms of risk to various entities and the propagation of risk between industries and countries. Expanding the framework to accommodate more technical and operational level information can increase the accuracy and explainability of trends and risk in the knowledge graph. ",
    "url": "https://arxiv.org/abs/2109.03848",
    "authors": [
      "Tuomas Takko",
      "Kunal Bhattacharya",
      "Martti Lehto",
      "Pertti Jalasvirta",
      "Aapo Cederberg",
      "Kimmo Kaski"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.03926",
    "title": "Transformers in the loop: Polarity in neural models of language",
    "abstract": "Representation of linguistic phenomena in computational language models is typically assessed against the predictions of existing linguistic theories of these phenomena. Using the notion of polarity as a case study, we show that this is not always the most adequate set-up. We probe polarity via so-called 'negative polarity items' (in particular, English 'any') in two pre-trained Transformer-based models (BERT and GPT-2). We show that -- at least for polarity -- metrics derived from language models are more consistent with data from psycholinguistic experiments than linguistic theory predictions. Establishing this allows us to more adequately evaluate the performance of language models and also to use language models to discover new insights into natural language grammar beyond existing linguistic theories. Overall, our results encourage a closer tie between experiments with human subjects and with language models. We propose methods to enable this closer tie, with language models as part of experimental pipeline, and show this pipeline at work. ",
    "url": "https://arxiv.org/abs/2109.03926",
    "authors": [
      "Lisa Bylinina",
      "Alexey Tikhonov"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2109.03958",
    "title": "TrAISformer-A generative transformer for AIS trajectory prediction",
    "abstract": "Modelling trajectory in general, and vessel trajectory in particular, is a difficult task because of the multimodal and complex nature of motion data. In this paper, we present TrAISformer-a novel deep learning architecture that can forecast vessel positions using AIS (Automatic Identification System) observations. We address the multimodality by introducing a discrete representation of AIS data and re-frame the prediction, which is originally a regression problem, as a classification problem. The model encodes complex movement patterns in AIS data in high-dimensional vectors, then applies a transformer to extract useful long-term correlations from sequences of those embeddings to sample future vessel positions. Experimental results on real, public AIS data demonstrate that TrAISformer significantly outperforms state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2109.03958",
    "authors": [
      "Duong Nguyen",
      "Ronan Fablet"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.04119",
    "title": "HSMD: An object motion detection algorithm using a Hybrid Spiking Neural  Network Architecture",
    "abstract": "The detection of moving objects is a trivial task performed by vertebrate retinas, yet a complex computer vision task. Object-motion-sensitive ganglion cells (OMS-GC) are specialised cells in the retina that sense moving objects. OMS-GC take as input continuous signals and produce spike patterns as output, that are transmitted to the Visual Cortex via the optic nerve. The Hybrid Sensitive Motion Detector (HSMD) algorithm proposed in this work enhances the GSOC dynamic background subtraction (DBS) algorithm with a customised 3-layer spiking neural network (SNN) that outputs spiking responses akin to the OMS-GC. The algorithm was compared against existing background subtraction (BS) approaches, available on the OpenCV library, specifically on the 2012 change detection (CDnet2012) and the 2014 change detection (CDnet2014) benchmark datasets. The results show that the HSMD was ranked overall first among the competing approaches and has performed better than all the other algorithms on four of the categories across all the eight test metrics. Furthermore, the HSMD proposed in this paper is the first to use an SNN to enhance an existing state of the art DBS (GSOC) algorithm and the results demonstrate that the SNN provides near real-time performance in realistic applications. ",
    "url": "https://arxiv.org/abs/2109.04119",
    "authors": [
      "Pedro Machado",
      "Andreas Oikonomou",
      "Joao Filipe Ferreira",
      "T.M. McGinnity"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2109.04206",
    "title": "QUINT: Node embedding using network hashing",
    "abstract": "Representation learning using network embedding has received tremendous attention due to its efficacy to solve downstream tasks. Popular embedding methods (such as deepwalk, node2vec, LINE) are based on a neural architecture, thus unable to scale on large networks both in terms of time and space usage. Recently, we proposed BinSketch, a sketching technique for compressing binary vectors to binary vectors. In this paper, we show how to extend BinSketch and use it for network hashing. Our proposal named QUINT is built upon BinSketch, and it embeds nodes of a sparse network onto a low-dimensional space using simple bi-wise operations. QUINT is the first of its kind that provides tremendous gain in terms of speed and space usage without compromising much on the accuracy of the downstream tasks. Extensive experiments are conducted to compare QUINT with seven state-of-the-art network embedding methods for two end tasks - link prediction and node classification. We observe huge performance gain for QUINT in terms of speedup (up to 7000x) and space saving (up to 800x) due to its bit-wise nature to obtain node embedding. Moreover, QUINT is a consistent top-performer for both the tasks among the baselines across all the datasets. Our empirical observations are backed by rigorous theoretical analysis to justify the effectiveness of QUINT. In particular, we prove that QUINT retains enough structural information which can be used further to approximate many topological properties of networks with high confidence. ",
    "url": "https://arxiv.org/abs/2109.04206",
    "authors": [
      "Debajyoti Bera",
      "Rameshwar Pratap",
      "Bhisham Dev Verma",
      "Biswadeep Sen",
      "Tanmoy Chakraborty"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.04247",
    "title": "DAE : Discriminatory Auto-Encoder for multivariate time-series anomaly  detection in air transportation",
    "abstract": "The Automatic Dependent Surveillance Broadcast protocol is one of the latest compulsory advances in air surveillance. While it supports the tracking of the ever-growing number of aircraft in the air, it also introduces cybersecurity issues that must be mitigated e.g., false data injection attacks where an attacker emits fake surveillance information. The recent data sources and tools available to obtain flight tracking records allow the researchers to create datasets and develop Machine Learning models capable of detecting such anomalies in En-Route trajectories. In this context, we propose a novel multivariate anomaly detection model called Discriminatory Auto-Encoder (DAE). It uses the baseline of a regular LSTM-based auto-encoder but with several decoders, each getting data of a specific flight phase (e.g. climbing, cruising or descending) during its training.To illustrate the DAE's efficiency, an evaluation dataset was created using real-life anomalies as well as realistically crafted ones, with which the DAE as well as three anomaly detection models from the literature were evaluated. Results show that the DAE achieves better results in both accuracy and speed of detection. The dataset, the models implementations and the evaluation results are available in an online repository, thereby enabling replicability and facilitating future experiments. ",
    "url": "https://arxiv.org/abs/2109.04247",
    "authors": [
      "Antoine Chevrot",
      "Alexandre Vernotte",
      "Bruno Legeard"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.04257",
    "title": "GNisi: A graph network for reconstructing Ising models from multivariate  binarized data",
    "abstract": "Ising models are a simple generative approach to describing interacting binary variables. They have proven useful in a number of biological settings because they enable one to represent observed many-body correlations as the separable consequence of many direct, pairwise statistical interactions. The inference of Ising models from data can be computationally very challenging and often one must be satisfied with numerical approximations or limited precision. In this paper we present a novel method for the determination of Ising parameters from data, called GNisi, which uses a Graph Neural network trained on known Ising models in order to construct the parameters for unseen data. We show that GNisi is more accurate than the existing state of the art software, and we illustrate our method by applying GNisi to gene expression data. ",
    "url": "https://arxiv.org/abs/2109.04257",
    "authors": [
      "Emma Slade",
      "Sonya Kiselgof",
      "Lena Granovsky",
      "Jeremy L. England"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2109.04463",
    "title": "Neural Latents Benchmark '21: Evaluating latent variable models of  neural population activity",
    "abstract": "Advances in neural recording present increasing opportunities to study neural activity in unprecedented detail. Latent variable models (LVMs) are promising tools for analyzing this rich activity across diverse neural systems and behaviors, as LVMs do not depend on known relationships between the activity and external experimental variables. However, progress in latent variable modeling is currently impeded by a lack of standardization, resulting in methods being developed and compared in an ad hoc manner. To coordinate these modeling efforts, we introduce a benchmark suite for latent variable modeling of neural population activity. We curate four datasets of neural spiking activity from cognitive, sensory, and motor areas to promote models that apply to the wide variety of activity seen across these areas. We identify unsupervised evaluation as a common framework for evaluating models across datasets, and apply several baselines that demonstrate benchmark diversity. We release this benchmark through EvalAI. this http URL ",
    "url": "https://arxiv.org/abs/2109.04463",
    "authors": [
      "Felix Pei",
      "Joel Ye",
      "David Zoltowski",
      "Anqi Wu",
      "Raeed H. Chowdhury",
      "Hansem Sohn",
      "Joseph E. O'Doherty",
      "Krishna V. Shenoy",
      "Matthew T. Kaufman",
      "Mark Churchland",
      "Mehrdad Jazayeri",
      "Lee E. Miller",
      "Jonathan Pillow",
      "Il Memming Park",
      "Eva L. Dyer",
      "Chethan Pandarinath"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2109.04204",
    "title": "An optimal decision support framework for vaccine distribution across a  multi-tier cold chain network",
    "abstract": "The importance of vaccination and the logistics involved in the procurement, storage and distribution of vaccines across their cold chain has come to the forefront during the COVID-19 pandemic. In this paper, we present a decision support framework for optimizing multiple aspects of vaccine distribution across a multi-tier cold chain network. We propose two multi-period optimization formulations within this framework: first to minimize inventory, ordering, transportation, personnel and shortage costs associated with a single vaccine; the second being an extension of the first for the case when multiple vaccines with differing efficacies and costs are available for the same disease. Vaccine transportation and administration lead times are also incorporated within the models. We use the case of the Indian state of Bihar and COVID-19 vaccines to illustrate the implementation of the framework. We present computational experiments to demonstrate: (a) the organization of the model outputs; (b) how the models can be used to assess the impact of storage capacities at the cold chain points, transportation vehicle capacities, and manufacturer capacities on the optimal vaccine distribution pattern; and (c) the impact of vaccine efficacies and associated costs such as ordering and transportation costs on the vaccine selection decision informed by the model. We then consider the computational expense of the framework for realistic problem instances, and suggest multiple preprocessing techniques to reduce their computational burden. Our study presents public health authorities and other stakeholders with a vaccine distribution and capacity planning tool for multi-tier cold chain networks. ",
    "url": "https://arxiv.org/abs/2109.04204",
    "authors": [
      "Shanmukhi Sripada",
      "Ayush Jain",
      "Prasanna Ramamoorthy",
      "Varun Ramamohan"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2109.04261",
    "title": "Memory semantization through perturbed and adversarial dreaming",
    "abstract": "Classical theories of memory consolidation emphasize the importance of replay in extracting semantic information from episodic memories. However, the characteristic creative nature of dreams suggests that memory semantization may go beyond merely replaying previous experiences. We propose that rapid-eye-movement (REM) dreaming is essential for efficient memory semantization by randomly combining episodic memories to create new, virtual sensory experiences. We support this hypothesis by implementing a cortical architecture with hierarchically organized feedforward and feedback pathways, inspired by generative adversarial networks (GANs). Learning in our model is organized across three different global brain states mimicking wakefulness, non-REM (NREM) and REM sleep, optimizing different, but complementary objective functions. We train the model in an unsupervised fashion on standard datasets of natural images and evaluate the quality of the learned representations. Our results suggest that adversarial dreaming during REM sleep is essential for extracting memory contents, while perturbed dreaming during NREM sleep improves robustness of the latent representation to noisy sensory inputs. The model provides a new computational perspective on sleep states, memory replay and dreams and suggests a cortical implementation of GANs. ",
    "url": "https://arxiv.org/abs/2109.04261",
    "authors": [
      "Nicolas Deperrois",
      "Mihai A. Petrovici",
      "Walter Senn",
      "Jakob Jordan"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2001.02878",
    "title": "Positive algorithmic bias cannot stop fragmentation in homophilic  networks",
    "abstract": " Comments: Cite as: Chris Blex & Taha Yasseri (2020) Positive algorithmic bias cannot stop fragmentation in homophilic networks, The Journal of Mathematical Sociology, DOI: 10.1080/0022250X.2020.1818078 ",
    "url": "https://arxiv.org/abs/2001.02878",
    "authors": [
      "Chris Blex",
      "Taha Yasseri"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  }
]