[
  {
    "id": "arXiv:2106.13843",
    "title": "A logical framework with a graph meta-language",
    "abstract": "We conjecture that the relative unpopularity of logical frameworks among practitioners is partly due to their complex meta-languages, which often demand both programming skills and theoretical knowledge of the meta-language in question for them to be fruitfully used. We present ongoing work on a logical framework with a meta-language based on graphs. A simpler meta-language leads to a shallower embedding of the object language, but hopefully leads to easier implementation and usage. A graph-based logical framework also opens up interesting possibilities in time and space performance by using heavily optimized graph databases as backends and by proof compression algorithms geared towards graphs. Deductive systems can be specified using simple domain-specific languages built on top of the graph database's query language. There is support for interactive (through a web-based interface) and semiautomatic (following user-defined tactics specified by a domain-specific language) proof modes. We have so far implemented nine systems for propositional logic, including Fitch-style and backward-directed Natural Deduction systems for intuitionistic and classical logic (with the classical systems reusing the rules of the intuitionistic ones), and a Hilbert-style system for the K modal logic. ",
    "url": "https://arxiv.org/abs/2106.13843",
    "authors": [
      "Bruno Cuconato",
      "Jefferson de Barros Santos",
      "Edward Hermann Haeusler"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2106.14072",
    "title": "Detecting race and gender bias in visual representation of AI on web  search engines",
    "abstract": "Web search engines influence perception of social reality by filtering and ranking information. However, their outputs are often subjected to bias that can lead to skewed representation of subjects such as professional occupations or gender. In our paper, we use a mixed-method approach to investigate presence of race and gender bias in representation of artificial intelligence (AI) in image search results coming from six different search engines. Our findings show that search engines prioritize anthropomorphic images of AI that portray it as white, whereas non-white images of AI are present only in non-Western search engines. By contrast, gender representation of AI is more diverse and less skewed towards a specific gender that can be attributed to higher awareness about gender bias in search outputs. Our observations indicate both the the need and the possibility for addressing bias in representation of societally relevant subjects, such as technological innovation, and emphasize the importance of designing new approaches for detecting bias in information retrieval systems. ",
    "url": "https://arxiv.org/abs/2106.14072",
    "authors": [
      "Mykola Makhortykh",
      "Aleksandra Urman",
      "Roberto Ulloa"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2106.14120",
    "title": "On a novel training algorithm for sequence-to-sequence predictive  recurrent networks",
    "abstract": "Neural networks mapping sequences to sequences (seq2seq) lead to significant progress in machine translation and speech recognition. Their traditional architecture includes two recurrent networks (RNs) followed by a linear predictor. In this manuscript we perform analysis of a corresponding algorithm and show that the parameters of the RNs of the well trained predictive network are not independent of each other. Their dependence can be used to significantly improve the network effectiveness. The traditional seq2seq algorithms require short term memory of a size proportional to the predicted sequence length. This requirement is quite difficult to implement in a neuroscience context. We present a novel memoryless algorithm for seq2seq predictive networks and compare it to the traditional one in the context of time series prediction. We show that the new algorithm is more robust and makes predictions with higher accuracy than the traditional one. ",
    "url": "https://arxiv.org/abs/2106.14120",
    "authors": [
      "Boris Rubinstein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.14150",
    "title": "Image content dependent semi-fragile watermarking with localized tamper  detection",
    "abstract": "Content-independent watermarks and block-wise independency can be considered as vulnerabilities in semi-fragile watermarking methods. In this paper to achieve the objectives of semi-fragile watermarking techniques, a method is proposed to not have the mentioned shortcomings. In the proposed method, the watermark is generated by relying on image content and a key. Furthermore, the embedding scheme causes the watermarked blocks to become dependent on each other, using a key. In the embedding phase, the image is partitioned into non-overlapping blocks. In order to detect and separate the different types of attacks more precisely, the proposed method embeds three copies of each watermark bit into LWT coefficients of each 4x4 block. In the authentication phase, by voting between the extracted bits the error maps are created; these maps indicate image authenticity and reveal the modified regions. Also, in order to automate the authentication, the images are classified into four categories using seven features. Classification accuracy in the experiments is 97.97 percent. It is noted that our experiments demonstrate that the proposed method is robust against JPEG compression and is competitive with a state-of-the-art semi-fragile watermarking method, in terms of robustness and semi-fragility. ",
    "url": "https://arxiv.org/abs/2106.14150",
    "authors": [
      "Samira Hosseini",
      "Mojtaba Mahdavi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2106.14190",
    "title": "Mitigating severe over-parameterization in deep convolutional neural  networks through forced feature abstraction and compression with an  entropy-based heuristic",
    "abstract": "Convolutional Neural Networks (CNNs) such as ResNet-50, DenseNet-40 and ResNeXt-56 are severely over-parameterized, necessitating a consequent increase in the computational resources required for model training which scales exponentially for increments in model depth. In this paper, we propose an Entropy-Based Convolutional Layer Estimation (EBCLE) heuristic which is robust and simple, yet effective in resolving the problem of over-parameterization with regards to network depth of CNN model. The EBCLE heuristic employs a priori knowledge of the entropic data distribution of input datasets to determine an upper bound for convolutional network depth, beyond which identity transformations are prevalent offering insignificant contributions for enhancing model performance. Restricting depth redundancies by forcing feature compression and abstraction restricts over-parameterization while decreasing training time by 24.99% - 78.59% without degradation in model performance. We present empirical evidence to emphasize the relative effectiveness of broader, yet shallower models trained using the EBCLE heuristic, which maintains or outperforms baseline classification accuracies of narrower yet deeper models. The EBCLE heuristic is architecturally agnostic and EBCLE based CNN models restrict depth redundancies resulting in enhanced utilization of the available computational resources. The proposed EBCLE heuristic is a compelling technique for researchers to analytically justify their HyperParameter (HP) choices for CNNs. Empirical validation of the EBCLE heuristic in training CNN models was established on five benchmarking datasets (ImageNet32, CIFAR-10/100, STL-10, MNIST) and four network architectures (DenseNet, ResNet, ResNeXt and EfficientNet B0-B2) with appropriate statistical tests employed to infer any conclusive claims presented in this paper. ",
    "url": "https://arxiv.org/abs/2106.14190",
    "authors": [
      "Nidhi Gowdra",
      "Roopak Sinha",
      "Stephen MacDonell",
      "Wei Qi Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.14239",
    "title": "Radial complex scaling for anisotropic scalar resonance problems",
    "abstract": "The complex scaling/perfectly matched layer method is a widely spread technique to simulate wave propagation problems in open domains. The method is very popular, because its implementation is very easy and does not require the knowledge of a fundamental solution. However, for anisotropic media the method may yield an unphysical radiation condition and lead to erroneous and unstable results. In this article we argue that a radial scaling (opposed to a cartesian scaling) does not suffer from this drawback and produces the desired radiation condition. This result is of great importance as it rehabilitates the application of the complex scaling method for anisotropic media. To present further details we consider the radial complex scaling method for scalar anisotropic resonance problems. We prove that the associated operator is Fredholm and show the convergence of approximations generated by simulateneous domain truncation and finite element discretization. We present computational studies to undergird our theoretical results. ",
    "url": "https://arxiv.org/abs/2106.14239",
    "authors": [
      "Martin Halla"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2106.14354",
    "title": "Scheduling on uniform and unrelated machines with bipartite  incompatibility graphs",
    "abstract": "In this paper the problem of scheduling of jobs on parallel machines under incompatibility relation is considered. In this model a binary relation between jobs is given and no two jobs that are in the relation can be scheduled on the same machine. In particular, we consider job scheduling under incompatibility relation forming bipartite graphs, under makespan optimality criterion, on uniform and unrelated machines. We show that no algorithm can achieve a good approximation ratio for uniform machines, even for a case of unit time jobs, under $P \\neq NP$. We also provide an approximation algorithm that achieves the best possible approximation ratio, even for the case of jobs of arbitrary lengths $p_j$, under the same assumption. Precisely, we present an $O(n^{1/2-\\epsilon})$ inapproximability bound, for any $\\epsilon > 0$; and $\\sqrt{p_{sum}}$-approximation algorithm, respectively. To enrich the analysis, bipartite graphs generated randomly according to Gilbert's model $\\mathcal{G}_{n,n,p(n)}$ are considered. For a broad class of $p(n)$ functions we show that there exists an algorithm producing a schedule with makespan almost surely at most twice the optimum. Due to our knowledge, this is the first study of randomly generated graphs in the context of scheduling in the considered model. For unrelated machines, an FPTAS for $R2|G = bipartite|C_{\\max}$ is provided. We also show that there is no algorithm of approximation ratio $O(n^bp_{\\max}^{1-\\epsilon})$, even for $Rm|G = bipartite|C_{max}$ for $m \\ge 3$ and any $\\epsilon > 0$, $b > 0$, unless $P = NP$. ",
    "url": "https://arxiv.org/abs/2106.14354",
    "authors": [
      "Tytus Pikies",
      "Hanna Furmańczyk"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2106.14365",
    "title": "Integrating topic modeling and word embedding to characterize violent  deaths",
    "abstract": "There is an escalating need for methods to identify latent patterns in text data from many domains. We introduce a new method to identify topics in a corpus and represent documents as topic sequences. Discourse Atom Topic Modeling draws on advances in theoretical machine learning to integrate topic modeling and word embedding, capitalizing on the distinct capabilities of each. We first identify a set of vectors (\"discourse atoms\") that provide a sparse representation of an embedding space. Atom vectors can be interpreted as latent topics: Through a generative model, atoms map onto distributions over words; one can also infer the topic that generated a sequence of words. We illustrate our method with a prominent example of underutilized text: the U.S. National Violent Death Reporting System (NVDRS). The NVDRS summarizes violent death incidents with structured variables and unstructured narratives. We identify 225 latent topics in the narratives (e.g., preparation for death and physical aggression); many of these topics are not captured by existing structured variables. Motivated by known patterns in suicide and homicide by gender, and recent research on gender biases in semantic space, we identify the gender bias of our topics (e.g., a topic about pain medication is feminine). We then compare the gender bias of topics to their prevalence in narratives of female versus male victims. Results provide a detailed quantitative picture of reporting about lethal violence and its gendered nature. Our method offers a flexible and broadly applicable approach to model topics in text data. ",
    "url": "https://arxiv.org/abs/2106.14365",
    "authors": [
      "Alina Arseniev-Koehler",
      "Susan D. Cochran",
      "Vickie M. Mays",
      "Kai-Wei Chang",
      "Jacob Gates Foster"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.14459",
    "title": "Recurrent neural network transducer for Japanese and Chinese offline  handwritten text recognition",
    "abstract": "In this paper, we propose an RNN-Transducer model for recognizing Japanese and Chinese offline handwritten text line images. As far as we know, it is the first approach that adopts the RNN-Transducer model for offline handwritten text recognition. The proposed model consists of three main components: a visual feature encoder that extracts visual features from an input image by CNN and then encodes the visual features by BLSTM; a linguistic context encoder that extracts and encodes linguistic features from the input image by embedded layers and LSTM; and a joint decoder that combines and then decodes the visual features and the linguistic features into the final label sequence by fully connected and softmax layers. The proposed model takes advantage of both visual and linguistic information from the input image. In the experiments, we evaluated the performance of the proposed model on the two datasets: Kuzushiji and SCUT-EPT. Experimental results show that the proposed model achieves state-of-the-art performance on all datasets. ",
    "url": "https://arxiv.org/abs/2106.14459",
    "authors": [
      "Trung Tan Ngo",
      "Hung Tuan Nguyen",
      "Nam Tuan Ly",
      "Masaki Nakagawa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.14473",
    "title": "Error analysis for physics informed neural networks (PINNs)  approximating Kolmogorov PDEs",
    "abstract": "Physics informed neural networks approximate solutions of PDEs by minimizing pointwise residuals. We derive rigorous bounds on the error, incurred by PINNs in approximating the solutions of a large class of linear parabolic PDEs, namely Kolmogorov equations that include the heat equation and Black-Scholes equation of option pricing, as examples. We construct neural networks, whose PINN residual (generalization error) can be made as small as desired. We also prove that the total $L^2$-error can be bounded by the generalization error, which in turn is bounded in terms of the training error, provided that a sufficient number of randomly chosen training (collocation) points is used. Moreover, we prove that the size of the PINNs and the number of training samples only grow polynomially with the underlying dimension, enabling PINNs to overcome the curse of dimensionality in this context. These results enable us to provide a comprehensive error analysis for PINNs in approximating Kolmogorov PDEs. ",
    "url": "https://arxiv.org/abs/2106.14473",
    "authors": [
      "Tim De Ryck",
      "Siddhartha Mishra"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.14508",
    "title": "Towards anomaly detection in smart grids by combining Complex Events  Processing and SNMP objects",
    "abstract": "This paper describes the architecture and the fundamental methodology of an anomaly detector, which by continuously monitoring Simple Network Management Protocol data and by processing it as complex-events, is able to timely recognize patterns of faults and relevant cyber-attacks. This solution has been applied in the context of smart grids, and in particular as part of a security and resilience component of the Information and Communication Technologies (ICT) Gateway, a middleware-based architecture that correlates and fuses measurement data from different sources (e.g., Inverters, Smart Meters) to provide control coordination and to enable grid observability applications. The detector has been evaluated through experiments, where we selected some representative anomalies that can occur on the ICT side of the energy distribution infrastructure: non-malicious faults (indicated by patterns in the system resources usage), as well as effects of typical cyber-attacks directed to the smart grid infrastructure. The results show that the detection is promisingly fast and efficient. ",
    "url": "https://arxiv.org/abs/2106.14508",
    "authors": [
      "Massimiliano Leone Itria",
      "Enrico Schiavone",
      "Nicola Nostro"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2106.14613",
    "title": "An evaluation of template and ML-based generation of user-readable text  from a knowledge graph",
    "abstract": "Typical user-friendly renderings of knowledge graphs are visualisations and natural language text. Within the latter HCI solution approach, data-driven natural language generation systems receive increased attention, but they are often outperformed by template-based systems due to suffering from errors such as content dropping, hallucination, or repetition. It is unknown which of those errors are associated significantly with low quality judgements by humans who the text is aimed for, which hampers addressing errors based on their impact on improving human evaluations. We assessed their possible association with an experiment availing of expert and crowdsourced evaluations of human authored text, template generated text, and sequence-to-sequence model generated text. The results showed that there was no significant association between human authored texts with errors and the low human judgements of naturalness and quality. There was also no significant association between machine learning generated texts with dropped or hallucinated slots and the low human judgements of naturalness and quality. Thus, both approaches appear to be viable options for designing a natural language interface for knowledge graphs. ",
    "url": "https://arxiv.org/abs/2106.14613",
    "authors": [
      "Zola Mahlaza",
      "C. Maria Keet",
      "Jarryd Dunn",
      "Matthew Poulter"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2106.14798",
    "title": "Mapping flows on weighted and directed networks with incomplete  observations",
    "abstract": "Detecting significant community structure in networks with incomplete observations is challenging because the evidence for specific solutions fades away with missing data. For example, recent research shows that flow-based community detection methods can highlight spurious communities in sparse undirected and unweighted networks with missing links. Current Bayesian approaches developed to overcome this problem do not work for incomplete observations in weighted and directed networks that describe network flows. To address this gap, we extend the idea behind the Bayesian estimate of the map equation for unweighted and undirected networks to enable more robust community detection in weighted and directed networks. We derive a weighted and directed prior network that can incorporate metadata information and show how an efficient implementation in the community-detection method Infomap provides more reliable communities even with a significant fraction of data missing. ",
    "url": "https://arxiv.org/abs/2106.14798",
    "authors": [
      "Jelena Smiljanić",
      "Christopher Blöcker",
      "Daniel Edler",
      "Martin Rosvall"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2106.14831",
    "title": "Hybrid zonotopes: a new set representation for reachability analysis of  mixed logical dynamical systems",
    "abstract": "This article presents a new set representation named the hybrid zonotope. The hybrid zonotope is shown to be equivalent to $2^N$ constrained zonotopes through the addition of $N$ binary zonotope factors and is well-suited for the analysis of hybrid systems with both continuous and discrete states and inputs. The major contribution of this manuscript is a closed-form solution for exact forward reachable sets of linear mixed logical dynamical systems. This is given by a simple identity and does not require solving any optimization programs or taking set approximations. The proposed approach captures the worst-case exponential growth in the number of convex sets required to represent the nonconvex reachable set of a hybrid system while exhibiting only linear growth in the complexity of the hybrid zonotope set representation. To reduce both set representation complexity and the computational burden of reachability analysis, a binary tree is used to store only the combinations of binary factors of the hybrid zonotope that map to nonempty convex sets. The proposed approach is applied to an established benchmark example where the exact reachable set of a discrete-time hybrid system with six continuous and two discrete states is given by a single hybrid zonotope equivalent to the union of 657 constrained zonotopes, and is represented using only 283 continuous factors, 29 binary factors, and 177 linear equality constraints. Furthermore, the hybrid zonotope is closed under linear mappings, Minkowski sums, generalized intersections, and halfspace intersections. ",
    "url": "https://arxiv.org/abs/2106.14831",
    "authors": [
      "Trevor J. Bird",
      "Herschel C. Pangborn",
      "Neera Jain",
      "Justin P. Koeln"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2106.14465",
    "title": "Benchmarking convolutional neural networks for diagnosing Lyme disease  from images",
    "abstract": "Lyme disease is one of the most common infectious vector-borne diseases in the world. In the early stage, the disease manifests itself in most cases with erythema migrans (EM) skin lesions. Better diagnosis of these early forms would allow improving the prognosis by preventing the transition to a severe late form thanks to appropriate antibiotic therapy. Recent studies show that convolutional neural networks (CNNs) perform very well to identify skin lesions from the image but, there is not much work for Lyme disease prediction from EM lesion images. The main objective of this study is to extensively analyze the effectiveness of CNNs for diagnosing Lyme disease from images and to find out the best CNN architecture for the purpose. There is no publicly available EM image dataset for Lyme disease prediction mainly because of privacy concerns. In this study, we utilized an EM dataset consisting of images collected from Clermont-Ferrand University Hospital Center (CF-CHU) of France and the internet. CF-CHU collected the images from several hospitals in France. This dataset was labeled by expert dermatologists and infectiologists from CF-CHU. First, we benchmarked this dataset for twenty-three well-known CNN architectures in terms of predictive performance metrics, computational complexity metrics, and statistical significance tests. Second, to improve the performance of the CNNs, we used transfer learning from ImageNet pre-trained models as well as pre-trained the CNNs with the skin lesion dataset \"Human Against Machine with 10000 training images (HAM1000)\". In that process, we searched for the best performing number of layers to unfreeze during transfer learning fine-tuning for each of the CNNs. Third, for model explainability, we utilized Gradient-weighted Class Activation Mapping to visualize the regions of input that are significant to the CNNs for making predictions. Fourth, we provided guidelines for model selection based on predictive performance and computational complexity. Our study confirmed the effectiveness and potential of even some lightweight CNNs to be used for Lyme disease pre-scanner mobile applications. We also made all the trained models publicly available at https://dappem.limos.fr/download.html, which can be used by others for transfer learning and building pre-scanners for Lyme disease. ",
    "url": "https://arxiv.org/abs/2106.14465",
    "authors": [
      "Sk Imran Hossain",
      "Jocelyn de Goër de Herve",
      "Md Shahriar Hassan",
      "Delphine Martineau",
      "Evelina Petrosyan",
      "Violaine Corbain",
      "Jean Beytout",
      "Isabelle Lebert",
      "Elisabeth Baux",
      "Céline Cazorla",
      "Carole Eldin",
      "Yves Hansmann",
      "Solene Patrat-Delon",
      "Thierry Prazuck",
      "Alice Raffetin",
      "Pierre Tattevin",
      "Gwenaël Vourc'H",
      "Olivier Lesens",
      "Engelbert Nguifo"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.14623",
    "title": "Polyconvex anisotropic hyperelasticity with neural networks",
    "abstract": "In the present work, two machine learning based constitutive models for finite deformations are proposed. Using input convex neural networks, the models are hyperelastic, anisotropic and fulfill the polyconvexity condition, which implies ellipticity and thus ensures material stability. The first constitutive model is based on a set of polyconvex, anisotropic and objective invariants. The second approach is formulated in terms of the deformation gradient, its cofactor and determinant, uses group symmetrization to fulfill the material symmetry condition, and data augmentation to fulfill objectivity approximately. The extension of the dataset for the data augmentation approach is based on mechanical considerations and does not require additional experimental or simulation data. The models are calibrated with highly challenging simulation data of cubic lattice metamaterials, including finite deformations and lattice instabilities. A moderate amount of calibration data is used, based on deformations which are commonly applied in experimental investigations. While the invariant-based model shows drawbacks for several deformation modes, the model based on the deformation gradient alone is able to reproduce and predict the effective material behavior very well and exhibits excellent generalization capabilities. Thus, in particular the second model presents a highly flexible constitutive modeling approach, that leads to a mathematically well-posed problem. ",
    "url": "https://arxiv.org/abs/2106.14623",
    "authors": [
      "Dominik Klein",
      "Mauricio Fernández",
      "Robert J. Martin",
      "Patrizio Neff",
      "Oliver Weeger"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1803.07660",
    "title": "Decentralized decision making for networks of uncertain systems",
    "abstract": " Title: Decentralized decision making for networks of uncertain systems ",
    "url": "https://arxiv.org/abs/1803.07660",
    "authors": [
      "Georgios Darivianakis",
      "Angelos Georghiou",
      "John Lygeros"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Multiagent Systems (cs.MA)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:1811.00111",
    "title": "On finite-time and fixed-time consensus algorithms for dynamic networks  switching among disconnected digraphs",
    "abstract": " Comments: Please cite the publisher's version}. For the publisher's version and full citation details see: this https URL The following links provide access, for a limited time, to a free copy of the publisher's version: this https URL ",
    "url": "https://arxiv.org/abs/1811.00111",
    "authors": [
      "David Gómez-Gutiérrez",
      "Carlos Renato Vázquez",
      "Sergej Čelikovský",
      "Juan Diego Sánchez-Torres",
      "Javier Ruiz León"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Multiagent Systems (cs.MA)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2012.02701",
    "title": "Constant round distributed domination on graph classes with bounded  expansion",
    "abstract": " Comments: Paper accepted at SIROCCO 2021, implemented reviews, corrected an error in Lemma 1 ",
    "url": "https://arxiv.org/abs/2012.02701",
    "authors": [
      "Simeon Kublenz",
      "Sebastian Siebertz",
      "Alexandre Vigny"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2012.02976",
    "title": "Evaluating adversarial robustness in simulated cerebellum",
    "abstract": " Comments: 18 pages, 3 figures, NeurIPS 2020 Preregistration Workshop ",
    "url": "https://arxiv.org/abs/2012.02976",
    "authors": [
      "Liu Yuezhang",
      "Bo Li",
      "Qifeng Chen"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2102.01807",
    "title": "Building population models for large-scale neural recordings:  opportunities and pitfalls",
    "abstract": " Title: Building population models for large-scale neural recordings:  opportunities and pitfalls ",
    "url": "https://arxiv.org/abs/2102.01807",
    "authors": [
      "Cole Hurwitz",
      "Nina Kudryashova",
      "Arno Onken",
      "Matthias H. Hennig"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.10293",
    "title": "Neural tensor contractions and the expressive power of deep neural  quantum states",
    "abstract": " Title: Neural tensor contractions and the expressive power of deep neural  quantum states ",
    "url": "https://arxiv.org/abs/2103.10293",
    "authors": [
      "Or Sharir",
      "Amnon Shashua",
      "Giuseppe Carleo"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2106.04351",
    "title": "Si microring resonator crossbar array for on-chip inference and training  of optical neural network",
    "abstract": " Comments: 18 pages, 5 figures for main manuscript. 20 pages, 16 figures for supplementary information ",
    "url": "https://arxiv.org/abs/2106.04351",
    "authors": [
      "Shuhei Ohno",
      "Kasidit Toprasertpong",
      "Shinichi Takagi",
      "Mitsuru Takenaka"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2106.12612",
    "title": "Minimum sharpness: Scale-invariant parameter-robustness of neural  networks",
    "abstract": " Comments: 9 pages, accepted to ICML 2021 Workshop on Theoretic Foundation, Criticism, and Application Trend of Explainable AI ",
    "url": "https://arxiv.org/abs/2106.12612",
    "authors": [
      "Hikaru Ibayashi",
      "Takuo Hamaguchi",
      "Masaaki Imaizumi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.12893",
    "title": "Partial Wasserstein and Maximum Mean Discrepancy distances for bridging  the gap between outlier detection and drift detection",
    "abstract": " Title: Partial Wasserstein and Maximum Mean Discrepancy distances for bridging  the gap between outlier detection and drift detection ",
    "url": "https://arxiv.org/abs/2106.12893",
    "authors": [
      "Thomas Viehmann"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  }
]