[
  {
    "id": "arXiv:2111.14831",
    "title": "MIST-net: Multi-domain Integrative Swin Transformer network for  Sparse-View CT Reconstruction",
    "abstract": "The deep learning-based tomographic image reconstruction have been attracting much attention among these years. The sparse-view data reconstruction is one of typical underdetermined inverse problems, how to reconstruct high-quality CT images from dozens of projections is still a challenge in practice. To address this challenge, in this article we proposed a Multi-domain Integrative Swin Transformer network (MIST-net). First, the proposed MIST-net incorporated lavish domain features from data, residual-data, image, and residual-image using flexible network architectures. Here, the residual-data and residual-image domains network components can be considered as the data consistency module to eliminate interpolation errors in both residual data and image domains, and then further retain image details. Second, to detect the image features and further protect image edge, the trainable Sobel Filter was incorporated into the network to improve the encode-decode ability. Third, with the classical Swin transformer, we further designed the high-quality reconstruction transformer (i.e., Recformer) to improve the reconstruction performance. The Recformer inherited the power of Swin transformer to capture the global and local features of the reconstructed image. The experiments on the numerical datasets with 48 views demonstrated our proposed MIST-net provided higher reconstructed image quality with small feature recovery and edge protection than other competitors including the advanced unrolled networks. The quantitative results show that our MIST-net also obtained the best performance. The trained network was transferred to the real cardiac CT dataset with 48 views, the reconstruction results further validated the advantages of our MIST-net and further demonstrated the good robustness of our MIST in clinical applications. ",
    "url": "https://arxiv.org/abs/2111.14831",
    "authors": [
      "Jiayi Pan",
      "Weiwen Wu",
      "Zhifan Gao",
      "Heye Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2111.14923",
    "title": "Equitable modelling of brain imaging by counterfactual augmentation with  morphologically constrained 3D deep generative models",
    "abstract": "We describe Countersynth, a conditional generative model of diffeomorphic deformations that induce label-driven, biologically plausible changes in volumetric brain images. The model is intended to synthesise counterfactual training data augmentations for downstream discriminative modelling tasks where fidelity is limited by data imbalance, distributional instability, confounding, or underspecification, and exhibits inequitable performance across distinct subpopulations. Focusing on demographic attributes, we evaluate the quality of synthesized counterfactuals with voxel-based morphometry, classification and regression of the conditioning attributes, and the Fr\\'{e}chet inception distance. Examining downstream discriminative performance in the context of engineered demographic imbalance and confounding, we use UK Biobank magnetic resonance imaging data to benchmark CounterSynth augmentation against current solutions to these problems. We achieve state-of-the-art improvements, both in overall fidelity and equity. The source code for CounterSynth is available online. ",
    "url": "https://arxiv.org/abs/2111.14923",
    "authors": [
      "Guilherme Pombo",
      "Robert Gray",
      "Jorge Cardoso",
      "Sebastien Ourselin",
      "Geraint Rees",
      "John Ashburner",
      "Parashkev Nachev"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.14984",
    "title": "Continuous conditional generative adversarial networks for data-driven  solutions of poroelasticity with heterogeneous material properties",
    "abstract": "Machine learning-based data-driven modeling can be computationally efficient solutions of time-dependent subsurface geophysical systems. In this work, our previous approach of conditional generative adversarial networks (cGAN) developed for steady-state problems with heterogeneous materials is extended to time-dependent problems by adopting the concept of continuous cGAN (CcGAN). The CcGAN that can condition continuous variables in the cGAN framework is developed to incorporate the time domain through either element-wise addition or conditional batch normalization. As a demonstration case, the transient response of the coupled poroelastic process is studied in two different permeability fields: Zinn \\& Harvey transformation and a bimodal transformation. The proposed CcGAN uses heterogeneous permeability fields as input parameters while pressure and displacement fields over time are model output. Our results show that the model provides sufficient accuracy with computational speed-up. This robust framework will enable us to perform real-time reservoir management and robust uncertainty quantification in realistic problems. ",
    "url": "https://arxiv.org/abs/2111.14984",
    "authors": [
      "T. Kadeethum",
      "D. O'Malley",
      "Y. Choi",
      "H. S. Viswanathan",
      "N. Bouklas",
      "H. Yoon"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2111.14998",
    "title": "Harnessing expressive capacity of Machine Learning modeling to represent  complex coupling of Earth's auroral space weather regimes",
    "abstract": "We develop multiple Deep Learning (DL) models that advance the state-of-the-art predictions of the global auroral particle precipitation. We use observations from low Earth orbiting spacecraft of the electron energy flux to develop a model that improves global nowcasts (predictions at the time of observation) of the accelerated particles. Multiple Machine Learning (ML) modeling approaches are compared, including a novel multi-task model, models with tail- and distribution-based loss functions, and a spatio-temporally sparse 2D-convolutional model. We detail the data preparation process as well as the model development that will be illustrative for many similar time series global regression problems in space weather and across domains. Our ML improvements are three-fold: 1) loss function engineering; 2) multi-task learning; and 3) transforming the task from time series prediction to spatio-temporal prediction. Notably, the ML models improve prediction of the extreme events, historically obstinate to accurate specification and indicate that increased expressive capacity provided by ML innovation can address grand challenges in the science of space weather. ",
    "url": "https://arxiv.org/abs/2111.14998",
    "authors": [
      "Jack Ziegler",
      "Ryan M. Mcgranaghan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.15070",
    "title": "Core but not peripheral online social ties is a protective factor  against depression: evidence from a nationally representative sample of young  adults",
    "abstract": "As social interactions are increasingly taking place in the digital environment, online friendship and its effects on various life outcomes from health to happiness attract growing research attention. In most studies, online ties are treated as representing a single type of relationship. However, our online friendship networks are not homogeneous and could include close connections, e.g. a partner, as well as people we have never met in person. In this paper, we investigate the potentially differential effects of online friendship ties on mental health. Using data from a Russian panel study (N = 4,400), we find that - consistently with previous research - the number of online friends correlates with depression symptoms. However, this is true only for networks that do not exceed Dunbar's number in size (N <= 150) and only for core but not peripheral nodes of a friendship network. The findings suggest that online friendship could encode different types of social relationships that should be treated separately while investigating the association between online social integration and life outcomes, in particular well-being or mental health. ",
    "url": "https://arxiv.org/abs/2111.15070",
    "authors": [
      "Sofia Dokuka",
      "Elizaveta Sivak",
      "Ivan Smirnov"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2111.15208",
    "title": "HRNET: AI on Edge for mask detection and social distancing",
    "abstract": "The purpose of the paper is to provide innovative emerging technology framework for community to combat epidemic situations. The paper proposes a unique outbreak response system framework based on artificial intelligence and edge computing for citizen centric services to help track and trace people eluding safety policies like mask detection and social distancing measure in public or workplace setup. The framework further provides implementation guideline in industrial setup as well for governance and contact tracing tasks. The adoption will thus lead in smart city planning and development focusing on citizen health systems contributing to improved quality of life. The conceptual framework presented is validated through quantitative data analysis via secondary data collection from researcher's public websites, GitHub repositories and renowned journals and further benchmarking were conducted for experimental results in Microsoft Azure cloud environment. The study includes selective AI-models for benchmark analysis and were assessed on performance and accuracy in edge computing environment for large scale societal setup. Overall YOLO model Outperforms in object detection task and is faster enough for mask detection and HRNetV2 outperform semantic segmentation problem applied to solve social distancing task in AI-Edge inferencing environmental setup. The paper proposes new Edge-AI algorithm for building technology-oriented solutions for detecting mask in human movement and social distance. The paper enriches the technological advancement in artificial intelligence and edge-computing applied to problems in society and healthcare systems. The framework further equips government agency, system providers to design and constructs technology-oriented models in community setup to Increase the quality of life using emerging technologies into smart urban environments. ",
    "url": "https://arxiv.org/abs/2111.15208",
    "authors": [
      "Kinshuk Sengupta",
      "Praveen Ranjan Srivastava"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.15319",
    "title": "A framework to measure the robustness of programs in the unpredictable  environment",
    "abstract": "Due to the diffusion of IoT, modern software systems are often thought to control and coordinate smart devices in order to manage assets and resources, and to guarantee efficient behaviours. For this class of systems, which interact extensively with humans and with their environment, it is thus crucial to guarantee their correct behaviour in order to avoid unexpected and possibly dangerous situations. In this paper we will present a framework that allows us to measure the robustness of systems. This is the ability of a program to tolerate changes in the environmental conditions and preserving the original behaviour. In the proposed framework, the interaction of a program with its environment is represented as a sequence of random variables describing how both evolve in time. For this reason, the considered measures will be defined among probability distributions of observed data. The proposed framework will be then used to define the notions of adaptability and reliability. The former indicates the ability of a program to absorb perturbation on environmental conditions after a given amount of time. The latter expresses the ability of a program to maintain its intended behaviour (up-to some reasonable tolerance) despite the presence of perturbations in the environment. Moreover, an algorithm, based on statistical inference, it proposed to evaluate the proposed metric and the aforementioned properties. Throughout the paper, two case studies are used to the describe and evaluate the proposed approach. ",
    "url": "https://arxiv.org/abs/2111.15319",
    "authors": [
      "Valentina Castiglioni",
      "Michele Loreti",
      "Simone Tini"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2111.15348",
    "title": "Overcoming limited battery data challenges: A coupled neural network  approach",
    "abstract": "The Electric Vehicle (EV) Industry has seen extraordinary growth in the last few years. This is primarily due to an ever increasing awareness of the detrimental environmental effects of fossil fuel powered vehicles and availability of inexpensive Lithium-ion batteries (LIBs). In order to safely deploy these LIBs in Electric Vehicles, certain battery states need to be constantly monitored to ensure safe and healthy operation. The use of Machine Learning to estimate battery states such as State-of-Charge and State-of-Health have become an extremely active area of research. However, limited availability of open-source diverse datasets has stifled the growth of this field, and is a problem largely ignored in literature. In this work, we propose a novel method of time-series battery data augmentation using deep neural networks. We introduce and analyze the method of using two neural networks working together to alternatively produce synthetic charging and discharging battery profiles. One model produces battery charging profiles, and another produces battery discharging profiles. The proposed approach is evaluated using few public battery datasets to illustrate its effectiveness, and our results show the efficacy of this approach to solve the challenges of limited battery data. We also test this approach on dynamic Electric Vehicle drive cycles as well. ",
    "url": "https://arxiv.org/abs/2111.15348",
    "authors": [
      "Aniruddh Herle",
      "Janamejaya Channegowda",
      "Dinakar Prabhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.15379",
    "title": "Text classification problems via BERT embedding method and graph  convolutional neural network",
    "abstract": "This paper presents the novel way combining the BERT embedding method and the graph convolutional neural network. This combination is employed to solve the text classification problem. Initially, we apply the BERT embedding method to the texts (in the BBC news dataset and the IMDB movie reviews dataset) in order to transform all the texts to numerical vector. Then, the graph convolutional neural network will be applied to these numerical vectors to classify these texts into their ap-propriate classes/labels. Experiments show that the performance of the graph convolutional neural network model is better than the perfor-mances of the combination of the BERT embedding method with clas-sical machine learning models. ",
    "url": "https://arxiv.org/abs/2111.15379",
    "authors": [
      "Loc Hoang Tran",
      "Tuan Tran",
      "An Mai"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2111.15425",
    "title": "Exploring rationality of self awareness in social networking for logical  modeling of unintentional insiders",
    "abstract": "Unawareness of privacy risks together with approval seeking motivations make humans enter too much detail into the likes of Facebook, Twitter, and Instagram. To test whether the rationality principle applies, we construct a tool that shows to a user what is known publicly on social networking sites about her. In our experiment, we check whether this revelation changes human behaviour. To extrapolate and generalize, we use the insights gained by practical experimentation. Unaware users can become targeted by attackers. They then become unintentional insiders. We demonstrate this by extending the Isabelle Insider framework to accommodate a formal model of unintentional insiders, an open problem with long standing. ",
    "url": "https://arxiv.org/abs/2111.15425",
    "authors": [
      "Florian Kammüller",
      "Chelsea Mira Alvarado"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2111.15466",
    "title": "Citation network applications in a scientific co-authorship recommender  system",
    "abstract": "The problem of co-authors selection in the area of scientific collaborations might be a daunting one. In this paper, we propose a new pipeline that effectively utilizes citation data in the link prediction task on the co-authorship network. In particular, we explore the capabilities of a recommender system based on data aggregation strategies on different graphs. Since graph neural networks proved their efficiency on a wide range of tasks related to recommendation systems, we leverage them as a relevant method for the forecasting of potential collaborations in the scientific community. ",
    "url": "https://arxiv.org/abs/2111.15466",
    "authors": [
      "Vladislav Tishin",
      "Artyom Sosedka",
      "Peter Ibragimov",
      "Vadim Porvatov"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.15467",
    "title": "Car drivers' privacy concerns and trust perceptions",
    "abstract": "Modern cars are evolving in many ways. Technologies such as infotainment systems and companion mobile applications collect a variety of personal data from drivers to enhance the user experience. This paper investigates the extent to which car drivers understand the implications for their privacy, including that car manufacturers must treat that data in compliance with the relevant regulations. It does so by distilling out drivers' concerns on privacy and relating them to their perceptions of trust on car cyber-security. A questionnaire is designed for such purposes to collect answers from a set of 1101 participants, so that the results are statistically relevant. In short, privacy concerns are modest, perhaps because there still is insufficient general awareness on the personal data that are involved, both for in-vehicle treatment and for transmission over the Internet. Trust perceptions on cyber-security are modest too (lower than those on car safety), a surprising contradiction to our research hypothesis that privacy concerns and trust perceptions on car cyber-security are opponent. We interpret this as a clear demand for information and awareness-building campaigns for car drivers, as well as for technical cyber-security and privacy measures that are truly considerate of the human factor. ",
    "url": "https://arxiv.org/abs/2111.15467",
    "authors": [
      "Giampaolo Bella",
      "Pietro Biondi",
      "Giuseppe Tudisco"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2111.15527",
    "title": "Embedding Principle: a hierarchical structure of loss landscape of deep  neural networks",
    "abstract": "We prove a general Embedding Principle of loss landscape of deep neural networks (NNs) that unravels a hierarchical structure of the loss landscape of NNs, i.e., loss landscape of an NN contains all critical points of all the narrower NNs. This result is obtained by constructing a class of critical embeddings which map any critical point of a narrower NN to a critical point of the target NN with the same output function. By discovering a wide class of general compatible critical embeddings, we provide a gross estimate of the dimension of critical submanifolds embedded from critical points of narrower NNs. We further prove an irreversiblility property of any critical embedding that the number of negative/zero/positive eigenvalues of the Hessian matrix of a critical point may increase but never decrease as an NN becomes wider through the embedding. Using a special realization of general compatible critical embedding, we prove a stringent necessary condition for being a \"truly-bad\" critical point that never becomes a strict-saddle point through any critical embedding. This result implies the commonplace of strict-saddle points in wide NNs, which may be an important reason underlying the easy optimization of wide NNs widely observed in practice. ",
    "url": "https://arxiv.org/abs/2111.15527",
    "authors": [
      "Yaoyu Zhang",
      "Yuqing Li",
      "Zhongwang Zhang",
      "Tao Luo",
      "Zhi-Qin John Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.15528",
    "title": "Facets of the Total Matching Polytope for bipartite graphs",
    "abstract": "The Total Matching Polytope generalizes the Stable Set Polytope and the Matching Polytope. In this paper, we give the perfect formulation for Trees and we derive two new families of valid inequalities, the balanced biclique inequalities which are always facet-defining and the non-balanced lifted biclique inequalities obtained by a lifting procedure, which are facet-defining for bipartite graphs. Finally, we give a complete description for Complete Bipartite Graphs. ",
    "url": "https://arxiv.org/abs/2111.15528",
    "authors": [
      "Luca Ferrarini"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2111.15602",
    "title": "Fine-grained prediction of food insecurity using news streams",
    "abstract": "Anticipating the outbreak of a food crisis is crucial to efficiently allocate emergency relief and reduce human suffering. However, existing food insecurity early warning systems rely on risk measures that are often delayed, outdated, or incomplete. Here, we leverage recent advances in deep learning to extract high-frequency precursors to food crises from the text of a large corpus of news articles about fragile states published between 1980 and 2020. Our text features are causally grounded, interpretable, validated by existing data, and allow us to predict 32% more food crises than existing models up to three months ahead of time at the district level across 15 fragile states. These results could have profound implications on how humanitarian aid gets allocated and open new avenues for machine learning to improve decision making in data-scarce environments. ",
    "url": "https://arxiv.org/abs/2111.15602",
    "authors": [
      "Ananth Balashankar",
      "Lakshminarayanan Subramanian",
      "Samuel P. Fraiberger"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.14986",
    "title": "Feedback vertex sets in (directed) graphs of bounded degeneracy or  treewidth",
    "abstract": "We study the minimum size $f$ of a feedback vertex set in directed and undirected $n$-vertex graphs of given degeneracy or treewidth. In the undirected setting the bound $\\frac{k-1}{k+1}n$ is known to be tight for graphs with bounded treewidth $k$ or bounded odd degeneracy $k$. We show that neither of the easy upper and lower bounds $\\frac{k-1}{k+1}n$ and $\\frac{k}{k+2}n$ can be exact for the case of even degeneracy. More precisely, for even degeneracy $k$ we prove that $\\frac{3k-2}{3k+4}n\\leq f < \\frac{k}{k+2}n$. For directed graphs of bounded degeneracy $k$, we prove that $f\\leq\\frac{k-1}{k+1}n$ and that this inequality is strict when $k$ is odd. For directed graphs of bounded treewidth $k\\geq 2$, we show that $\\frac{k-2\\lfloor\\log_2(k)\\rfloor}{k+1}n\\leq f \\leq \\frac{k}{k+3}n$. Further, we provide several constructions of low degeneracy or treewidth and large $f$. ",
    "url": "https://arxiv.org/abs/2111.14986",
    "authors": [
      "Kolja Knauer",
      "Hoang La",
      "Petru Valicov"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2111.15196",
    "title": "PGNets: Planet mass prediction using convolutional neural networks for  radio continuum observations of protoplanetary disks",
    "abstract": "We developed Convolutional Neural Networks (CNNs) to rapidly and directly infer the planet mass from radio dust continuum images. Substructures induced by young planets in protoplanetary disks can be used to infer the potential young planets' properties. Hydrodynamical simulations have been used to study the relationships between the planet's properties and these disk features. However, these attempts either fine-tuned numerical simulations to fit one protoplanetary disk at a time, which was time-consuming, or azimuthally averaged simulation results to derive some linear relationships between the gap width/depth and the planet mass, which lost information on asymmetric features in disks. To cope with these disadvantages, we developed Planet Gap neural Networks (PGNets) to infer the planet mass from 2D images. We first fit the gridded data in Zhang et al. (2018) as a classification problem. Then, we quadrupled the data set by running additional simulations with near-randomly sampled parameters, and derived the planet mass and disk viscosity together as a regression problem. The classification approach can reach an accuracy of 92\\%, whereas the regression approach can reach 1$\\sigma$ as 0.16 dex for planet mass and 0.23 dex for disk viscosity. We can reproduce the degeneracy scaling $\\alpha$ $\\propto$ $M_p^3$ found in the linear fitting method, which means that the CNN method can even be used to find degeneracy relationship. The gradient-weighted class activation mapping effectively confirms that PGNets use proper disk features to constrain the planet mass. We provide programs for PGNets and the traditional fitting method from Zhang et al. (2018), and discuss each method's advantages and disadvantages. ",
    "url": "https://arxiv.org/abs/2111.15196",
    "authors": [
      "Shangjia Zhang",
      "Zhaohuan Zhu",
      "Mingon Kang"
    ],
    "subjectives": [
      "Earth and Planetary Astrophysics (astro-ph.EP)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Solar and Stellar Astrophysics (astro-ph.SR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.15426",
    "title": "Efficient and robust high-dimensional sparse logistic regression via  nonlinear primal-dual hybrid gradient algorithms",
    "abstract": "Logistic regression is a widely used statistical model to describe the relationship between a binary response variable and predictor variables in data sets. It is often used in machine learning to identify important predictor variables. This task, variable selection, typically amounts to fitting a logistic regression model regularized by a convex combination of $\\ell_1$ and $\\ell_{2}^{2}$ penalties. Since modern big data sets can contain hundreds of thousands to billions of predictor variables, variable selection methods depend on efficient and robust optimization algorithms to perform well. State-of-the-art algorithms for variable selection, however, were not traditionally designed to handle big data sets; they either scale poorly in size or are prone to produce unreliable numerical results. It therefore remains challenging to perform variable selection on big data sets without access to adequate and costly computational resources. In this paper, we propose a nonlinear primal-dual algorithm that addresses these shortcomings. Specifically, we propose an iterative algorithm that provably computes a solution to a logistic regression problem regularized by an elastic net penalty in $O(T(m,n)\\log(1/\\epsilon))$ operations, where $\\epsilon \\in (0,1)$ denotes the tolerance and $T(m,n)$ denotes the number of arithmetic operations required to perform matrix-vector multiplication on a data set with $m$ samples each comprising $n$ features. This result improves on the known complexity bound of $O(\\min(m^2n,mn^2)\\log(1/\\epsilon))$ for first-order optimization methods such as the classic primal-dual hybrid gradient or forward-backward splitting methods. ",
    "url": "https://arxiv.org/abs/2111.15426",
    "authors": [
      "Jérôme Darbon",
      "Gabriel P. Langlois"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.15498",
    "title": "Assessment of Data Consistency through Cascades of Independently  Recurrent Inference Machines for fast and robust accelerated MRI  reconstruction",
    "abstract": "Interpretability and robustness are imperative for integrating Machine Learning methods for accelerated Magnetic Resonance Imaging (MRI) reconstruction in clinical applications. Doing so would allow fast high-quality imaging of anatomy and pathology. Data Consistency (DC) is crucial for generalization in multi-modal data and robustness in detecting pathology. This work proposes the Cascades of Independently Recurrent Inference Machines (CIRIM) to assess DC through unrolled optimization, implicitly by gradient descent and explicitly by a designed term. We perform extensive comparison of the CIRIM to other unrolled optimization methods, being the End-to-End Variational Network (E2EVN) and the RIM, and to the UNet and Compressed Sensing (CS). Evaluation is done in two stages. Firstly, learning on multiple trained MRI modalities is assessed, i.e., brain data with ${T_1}$-weighting and FLAIR contrast, and ${T_2}$-weighted knee data. Secondly, robustness is tested on reconstructing pathology through white matter lesions in 3D FLAIR MRI data of relapsing remitting Multiple Sclerosis (MS) patients. Results show that the CIRIM performs best when implicitly enforcing DC, while the E2EVN requires explicitly formulated DC. The CIRIM shows the highest lesion contrast resolution in reconstructing the clinical MS data. Performance improves by approximately 11% compared to CS, while the reconstruction time is twenty times reduced. ",
    "url": "https://arxiv.org/abs/2111.15498",
    "authors": [
      "D. Karkalousos",
      "S. Noteboom",
      "H. E. Hulst",
      "F.M. Vos",
      "M.W.A. Caan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2111.15597",
    "title": "Surrogate-based optimization using an artificial neural network for a  parameter identification in a 3D marine ecosystem model",
    "abstract": "Parameter identification for marine ecosystem models is important for the assessment and validation of marine ecosystem models against observational data. The surrogate-based optimization (SBO) is a computationally efficient method to optimize complex models. SBO replaces the computationally expensive (high-fidelity) model by a surrogate constructed from a less accurate but computationally cheaper (low-fidelity) model in combination with an appropriate correction approach, which improves the accuracy of the low-fidelity model. To construct a computationally cheap low-fidelity model, we tested three different approaches to compute an approximation of the annual periodic solution (i.e., a steady annual cycle) of a marine ecosystem model: firstly, a reduced number of spin-up iterations (several decades instead of millennia), secondly, an artificial neural network (ANN) approximating the steady annual cycle and, finally, a combination of both approaches. Except for the low-fidelity model using only the ANN, the SBO yielded a solution close to the target and reduced the computational effort significantly. If an ANN approximating appropriately a marine ecosystem model is available, the SBO using this ANN as low-fidelity model presents a promising and computational efficient method for the validation. ",
    "url": "https://arxiv.org/abs/2111.15597",
    "authors": [
      "Markus Pfeil",
      "Thomas Slawig"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)",
      "Populations and Evolution (q-bio.PE)"
    ]
  },
  {
    "id": "arXiv:2008.11047",
    "title": "Uncovering hidden dependency in weighted networks via information  entropy",
    "abstract": " Comments: 20 pages, 15 figures ",
    "url": "https://arxiv.org/abs/2008.11047",
    "authors": [
      "Mi Jin Lee",
      "Eun Lee",
      "Byunghwee Lee",
      "Hawoong Jeong",
      "Deok-Sun Lee",
      "Sang Hoon Lee"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2008.11520",
    "title": "A neural network multigrid solver for the Navier-Stokes equations",
    "abstract": " Comments: 32 pages, 15 figures ",
    "url": "https://arxiv.org/abs/2008.11520",
    "authors": [
      "Nils Margenberg",
      "Dirk Hartmann",
      "Christian Lessig",
      "Thomas Richter"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2012.01867",
    "title": "Computational characteristics of feedforward neural networks for solving  a stiff differential equation",
    "abstract": " Title: Computational characteristics of feedforward neural networks for solving  a stiff differential equation ",
    "url": "https://arxiv.org/abs/2012.01867",
    "authors": [
      "Toni Schneidereit",
      "Michael Breuß"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2103.14400",
    "title": "Data-driven sparse skin stimulation can convey social touch information  to humans",
    "abstract": " Comments: Copyright 2021 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses, in any current or future media, including reprinting/republishing this material for advertising or promotional purposes, creating new collective works, for resale or redistribution to servers or lists, or reuse of any copyrighted component of this work in other works ",
    "url": "https://arxiv.org/abs/2103.14400",
    "authors": [
      "M. Salvato",
      "Sophia R. Williams",
      "Cara M. Nunez",
      "Xin Zhu",
      "Ali Israr",
      "Frances Lau",
      "Keith Klumb",
      "Freddy Abnousi",
      "Allison M. Okamura",
      "Heather Culbertson"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2106.07548",
    "title": "A scalable multi-step least squares method for network identification  with unknown disturbance topology",
    "abstract": " Comments: 17 pages, 4 figures, resubmitted to Automatica on 23 November 2021, provisionally accepted ",
    "url": "https://arxiv.org/abs/2106.07548",
    "authors": [
      "Stefanie J.M. Fonken",
      "Karthik R. Ramaswamy",
      "Paul M.J. Van den Hof"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2111.10969",
    "title": "Medical Aegis: Robust adversarial protectors for medical images",
    "abstract": " Title: Medical Aegis: Robust adversarial protectors for medical images ",
    "url": "https://arxiv.org/abs/2111.10969",
    "authors": [
      "Qingsong Yao",
      "Zecheng He",
      "S. Kevin Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.11001",
    "title": "Easy representation of multivariate functions with low-dimensional terms  via Gaussian process regression kernel design: applications to machine  learning of potential energy surfaces and kinetic energy densities from  sparse data",
    "abstract": " Comments: 9 pages, 1 figure, 2 tables ",
    "url": "https://arxiv.org/abs/2111.11001",
    "authors": [
      "Eita Sasaki",
      "Manabu Ihara",
      "Sergei Manzhos"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Computational Physics (physics.comp-ph)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2111.12804",
    "title": "Evolution of honesty in higher-order social networks",
    "abstract": " Comments: 12 two-column pages, 5 figures, supplementary information; accepted for publication in Physical Review E ",
    "url": "https://arxiv.org/abs/2111.12804",
    "authors": [
      "Aanjaneya Kumar",
      "Sandeep Chowdhary",
      "Valerio Capraro",
      "Matjaz Perc"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  }
]