[
  {
    "id": "arXiv:2308.14783",
    "title": "Distributed Dual Coordinate Ascent with Imbalanced Data on a General  Tree Network",
    "abstract": "In this paper, we investigate the impact of imbalanced data on the convergence of distributed dual coordinate ascent in a tree network for solving an empirical loss minimization problem in distributed machine learning. To address this issue, we propose a method called delayed generalized distributed dual coordinate ascent that takes into account the information of the imbalanced data, and provide the analysis of the proposed algorithm. Numerical experiments confirm the effectiveness of our proposed method in improving the convergence speed of distributed dual coordinate ascent in a tree network. ",
    "url": "https://arxiv.org/abs/2308.14783",
    "authors": [
      "Myung Cho",
      "Lifeng Lai",
      "Weiyu Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2308.14784",
    "title": "Generating tabular datasets under differential privacy",
    "abstract": "Machine Learning (ML) is accelerating progress across fields and industries, but relies on accessible and high-quality training data. Some of the most important datasets are found in biomedical and financial domains in the form of spreadsheets and relational databases. But this tabular data is often sensitive in nature. Synthetic data generation offers the potential to unlock sensitive data, but generative models tend to memorise and regurgitate training data, which undermines the privacy goal. To remedy this, researchers have incorporated the mathematical framework of Differential Privacy (DP) into the training process of deep neural networks. But this creates a trade-off between the quality and privacy of the resulting data. Generative Adversarial Networks (GANs) are the dominant paradigm for synthesising tabular data under DP, but suffer from unstable adversarial training and mode collapse, which are exacerbated by the privacy constraints and challenging tabular data modality. This work optimises the quality-privacy trade-off of generative models, producing higher quality tabular datasets with the same privacy guarantees. We implement novel end-to-end models that leverage attention mechanisms to learn reversible tabular representations. We also introduce TableDiffusion, the first differentially-private diffusion model for tabular data synthesis. Our experiments show that TableDiffusion produces higher-fidelity synthetic datasets, avoids the mode collapse problem, and achieves state-of-the-art performance on privatised tabular data synthesis. By implementing TableDiffusion to predict the added noise, we enabled it to bypass the challenges of reconstructing mixed-type tabular data. Overall, the diffusion paradigm proves vastly more data and privacy efficient than the adversarial paradigm, due to augmented re-use of each data batch and a smoother iterative training process. ",
    "url": "https://arxiv.org/abs/2308.14784",
    "authors": [
      "Gianluca Truda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2308.14806",
    "title": "Domain-based user embedding for competing events on social media",
    "abstract": "Data mining is a good way to find the relationship between raw data and predict the target we want which is also widely used in different field nowadays. In this project, we implement a lots of technology and method in data mining to predict the sale of an item based on its previous sale. We create a strong model to predict the sales. After evaluating this model, we Online social networks offer vast opportunities for computational social science, but effective user embedding is crucial for downstream tasks. Traditionally, researchers have used pre-defined network-based user features, such as degree, and centrality measures, and/or content-based features, such as posts and reposts. However, these measures may not capture the complex characteristics of social media users. In this study, we propose a user embedding method based on the URL domain co-occurrence network, which is simple but effective for representing social media users in competing events. We assessed the performance of this method in binary classification tasks using benchmark datasets that included Twitter users related to COVID-19 infodemic topics (QAnon, Biden, Ivermectin). Our results revealed that user embeddings generated directly from the retweet network, and those based on language, performed below expectations. In contrast, our domain-based embeddings outperformed these methods while reducing computation time. These findings suggest that the domain-based user embedding can serve as an effective tool to characterize social media users participating in competing events, such as political campaigns and public health crises. ",
    "url": "https://arxiv.org/abs/2308.14806",
    "authors": [
      "Wentao Xu",
      "Kazutoshi Sasahara"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2308.14815",
    "title": "Distributionally Robust Statistical Verification with Imprecise Neural  Networks",
    "abstract": "A particularly challenging problem in AI safety is providing guarantees on the behavior of high-dimensional autonomous systems. Verification approaches centered around reachability analysis fail to scale, and purely statistical approaches are constrained by the distributional assumptions about the sampling process. Instead, we pose a distributionally robust version of the statistical verification problem for black-box systems, where our performance guarantees hold over a large family of distributions. This paper proposes a novel approach based on a combination of active learning, uncertainty quantification, and neural network verification. A central piece of our approach is an ensemble technique called Imprecise Neural Networks, which provides the uncertainty to guide active learning. The active learning uses an exhaustive neural-network verification tool Sherlock to collect samples. An evaluation on multiple physical simulators in the openAI gym Mujoco environments with reinforcement-learned controllers demonstrates that our approach can provide useful and scalable guarantees for high-dimensional systems. ",
    "url": "https://arxiv.org/abs/2308.14815",
    "authors": [
      "Souradeep Dutta",
      "Michele Caprio",
      "Vivian Lin",
      "Matthew Cleaveland",
      "Kuk Jin Jang",
      "Ivan Ruchkin",
      "Oleg Sokolsky",
      "Insup Lee"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.14834",
    "title": "Graph Analytics on Evolving Data (Abstract)",
    "abstract": "We consider the problem of graph analytics on evolving graphs. In this scenario, a query typically needs to be applied to different snapshots of the graph over an extended time window. We propose CommonGraph, an approach for efficient processing of queries on evolving graphs. We first observe that edge deletions are significantly more expensive than addition operations. CommonGraph converts all deletions to additions by finding a common graph that exists across all snapshots. After computing the query on this graph, to reach any snapshot, we simply need to add the missing edges and incrementally update the query results. CommonGraph also allows sharing of common additions among snapshots that require them, and breaks the sequential dependency inherent in the traditional streaming approach where snapshots are processed in sequence, enabling additional opportunities for parallelism. We incorporate the CommonGraph approach by extending the KickStarter streaming framework. CommonGraph achieves 1.38x-8.17x improvement in performance over Kickstarter across multiple benchmarks. ",
    "url": "https://arxiv.org/abs/2308.14834",
    "authors": [
      "Mahbod Afarin",
      "Chao Gao",
      "Shafiur Rahman",
      "Nael Abu-Ghazaleh",
      "Rajiv Gupta"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2308.14837",
    "title": "Improving Oblivious Reconfigurable Networks with High Probability",
    "abstract": "Oblivious Reconfigurable Networks (ORNs) use rapidly reconfiguring switches to create a dynamic time-varying topology. Prior theoretical work on ORNs has focused on the tradeoff between maximum latency and guaranteed throughput. This work shows that by relaxing the notion of guaranteed throughput to an achievable rate with high probability, one can achieve a significant improvement in the latency/throughput tradeoff. For a fixed maximum latency, we show that almost twice the maximum possible guaranteed throughput rate can be achieved with high probability. Alternatively for a fixed throughput value, relaxing to achievement with high probability decreases the maximum latency to almost the square root of the latency required to guarantee the throughput rate. We first give a lower bound on the best maximum latency possible given an achieved throughput rate with high probability. This is done using an LP duality style argument. We then give a family of ORN designs which achieves these tradeoffs. The connection schedule is based on the Vandermonde Basis Scheme of Amir, Wilson, Shrivastav, Weatherspoon, Kleinberg, and Agarwal, although the period and routing scheme differ significantly. We prove achievable throughput with high probability by interpreting the amount of flow on each edge as a sum of negatively associated variables, and applying a Chernoff bound. This gives us a design with maximum latency that is tight with our lower bound (up to a log factor) for almost all constant throughput values. ",
    "url": "https://arxiv.org/abs/2308.14837",
    "authors": [
      "Tegan Wilson",
      "Daniel Amir",
      "Vishal Shrivastav",
      "Robert Kleinberg",
      "Hakim Weatherspoon"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2308.14843",
    "title": "Robust Activity Recognition for Adaptive Worker-Robot Interaction using  Transfer Learning",
    "abstract": "Human activity recognition (HAR) using machine learning has shown tremendous promise in detecting construction workers' activities. HAR has many applications in human-robot interaction research to enable robots' understanding of human counterparts' activities. However, many existing HAR approaches lack robustness, generalizability, and adaptability. This paper proposes a transfer learning methodology for activity recognition of construction workers that requires orders of magnitude less data and compute time for comparable or better classification accuracy. The developed algorithm transfers features from a model pre-trained by the original authors and fine-tunes them for the downstream task of activity recognition in construction. The model was pre-trained on Kinetics-400, a large-scale video-based human activity recognition dataset with 400 distinct classes. The model was fine-tuned and tested using videos captured from manual material handling (MMH) activities found on YouTube. Results indicate that the fine-tuned model can recognize distinct MMH tasks in a robust and adaptive manner which is crucial for the widespread deployment of collaborative robots in construction. ",
    "url": "https://arxiv.org/abs/2308.14843",
    "authors": [
      "Farid Shahnavaz",
      "Riley Tavassoli",
      "Reza Akhavian"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.14847",
    "title": "NSF: Neural Surface Fields for Human Modeling from Monocular Depth",
    "abstract": "Obtaining personalized 3D animatable avatars from a monocular camera has several real world applications in gaming, virtual try-on, animation, and VR/XR, etc. However, it is very challenging to model dynamic and fine-grained clothing deformations from such sparse data. Existing methods for modeling 3D humans from depth data have limitations in terms of computational efficiency, mesh coherency, and flexibility in resolution and topology. For instance, reconstructing shapes using implicit functions and extracting explicit meshes per frame is computationally expensive and cannot ensure coherent meshes across frames. Moreover, predicting per-vertex deformations on a pre-designed human template with a discrete surface lacks flexibility in resolution and topology. To overcome these limitations, we propose a novel method `\\keyfeature: Neural Surface Fields' for modeling 3D clothed humans from monocular depth. NSF defines a neural field solely on the base surface which models a continuous and flexible displacement field. NSF can be adapted to the base surface with different resolution and topology without retraining at inference time. Compared to existing approaches, our method eliminates the expensive per-frame surface extraction while maintaining mesh coherency, and is capable of reconstructing meshes with arbitrary resolution without retraining. To foster research in this direction, we release our code in project page at: https://yuxuan-xue.com/nsf. ",
    "url": "https://arxiv.org/abs/2308.14847",
    "authors": [
      "Yuxuan Xue",
      "Bharat Lal Bhatnagar",
      "Riccardo Marin",
      "Nikolaos Sarafianos",
      "Yuanlu Xu",
      "Gerard Pons-Moll",
      "Tony Tung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.14864",
    "title": "NAS-X: Neural Adaptive Smoothing via Twisting",
    "abstract": "We present Neural Adaptive Smoothing via Twisting (NAS-X), a method for learning and inference in sequential latent variable models based on reweighted wake-sleep (RWS). NAS-X works with both discrete and continuous latent variables, and leverages smoothing SMC to fit a broader range of models than traditional RWS methods. We test NAS-X on discrete and continuous tasks and find that it substantially outperforms previous variational and RWS-based methods in inference and parameter recovery. ",
    "url": "https://arxiv.org/abs/2308.14864",
    "authors": [
      "Dieterich Lawson",
      "Michael Li",
      "Scott Linderman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.14865",
    "title": "Finding Complex Patterns in Trajectory Data via Geometric Set Cover",
    "abstract": "Clustering trajectories is a central challenge when confronted with large amounts of movement data such as full-body motion data or GPS data. We study a clustering problem that can be stated as a geometric set cover problem: Given a polygonal curve of complexity $n$, find the smallest number $k$ of representative trajectories of complexity at most $l$ such that any point on the input trajectories lies on a subtrajectory of the input that has Fr\\'echet distance at most $\\Delta$ to one of the representative trajectories. This problem was first studied by Akitaya et al. (2021) and Br\\\"uning et al. (2022). They present a bicriteria approximation algorithm that returns a set of curves of size $O(kl\\log(kl))$ which covers the input with a radius of $11\\Delta$ in time $\\widetilde{O}((kl)^2n + kln^3)$, where $k$ is the smallest number of curves of complexity $l$ needed to cover the input with a distance of $\\Delta$. The representative trajectories computed by their algorithm are always line segments. In applications however, one is usually interested in representative curves of higher complexity which consist of several edges. We present a new approach that builds upon the works of Br\\\"uning et al. (2022) computing a set of curves of size $O(k\\log(n))$ in time $\\widetilde{O}(l^2n^4 + kln^4)$ with the same distance guarantee of $11\\Delta$, where each curve may consist of curves of complexity up to the given complexity parameter $l$. To validate our approach, we conduct experiments on different types of real world data: high-dimensional full-body motion data and low-dimensional GPS-tracking data. ",
    "url": "https://arxiv.org/abs/2308.14865",
    "authors": [
      "Jacobus Conradi",
      "Anne Driemel"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2308.14899",
    "title": "RobustCLEVR: A Benchmark and Framework for Evaluating Robustness in  Object-centric Learning",
    "abstract": "Object-centric representation learning offers the potential to overcome limitations of image-level representations by explicitly parsing image scenes into their constituent components. While image-level representations typically lack robustness to natural image corruptions, the robustness of object-centric methods remains largely untested. To address this gap, we present the RobustCLEVR benchmark dataset and evaluation framework. Our framework takes a novel approach to evaluating robustness by enabling the specification of causal dependencies in the image generation process grounded in expert knowledge and capable of producing a wide range of image corruptions unattainable in existing robustness evaluations. Using our framework, we define several causal models of the image corruption process which explicitly encode assumptions about the causal relationships and distributions of each corruption type. We generate dataset variants for each causal model on which we evaluate state-of-the-art object-centric methods. Overall, we find that object-centric methods are not inherently robust to image corruptions. Our causal evaluation approach exposes model sensitivities not observed using conventional evaluation processes, yielding greater insight into robustness differences across algorithms. Lastly, while conventional robustness evaluations view corruptions as out-of-distribution, we use our causal framework to show that even training on in-distribution image corruptions does not guarantee increased model robustness. This work provides a step towards more concrete and substantiated understanding of model performance and deterioration under complex corruption processes of the real-world. ",
    "url": "https://arxiv.org/abs/2308.14899",
    "authors": [
      "Nathan Drenkow",
      "Mathias Unberath"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.14902",
    "title": "Ad-Rec: Advanced Feature Interactions to Address Covariate-Shifts in  Recommendation Networks",
    "abstract": "Recommendation models are vital in delivering personalized user experiences by leveraging the correlation between multiple input features. However, deep learning-based recommendation models often face challenges due to evolving user behaviour and item features, leading to covariate shifts. Effective cross-feature learning is crucial to handle data distribution drift and adapting to changing user behaviour. Traditional feature interaction techniques have limitations in achieving optimal performance in this context. This work introduces Ad-Rec, an advanced network that leverages feature interaction techniques to address covariate shifts. This helps eliminate irrelevant interactions in recommendation tasks. Ad-Rec leverages masked transformers to enable the learning of higher-order cross-features while mitigating the impact of data distribution drift. Our approach improves model quality, accelerates convergence, and reduces training time, as measured by the Area Under Curve (AUC) metric. We demonstrate the scalability of Ad-Rec and its ability to achieve superior model quality through comprehensive ablation studies. ",
    "url": "https://arxiv.org/abs/2308.14902",
    "authors": [
      "Muhammad Adnan",
      "Yassaman Ebrahimzadeh Maboud",
      "Divya Mahajan",
      "Prashant J. Nair"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.14905",
    "title": "Neural approaches to spoken content embedding",
    "abstract": "Comparing spoken segments is a central operation to speech processing. Traditional approaches in this area have favored frame-level dynamic programming algorithms, such as dynamic time warping, because they require no supervision, but they are limited in performance and efficiency. As an alternative, acoustic word embeddings -- fixed-dimensional vector representations of variable-length spoken word segments -- have begun to be considered for such tasks as well. However, the current space of such discriminative embedding models, training approaches, and their application to real-world downstream tasks is limited. We start by considering ``single-view\" training losses where the goal is to learn an acoustic word embedding model that separates same-word and different-word spoken segment pairs. Then, we consider ``multi-view\" contrastive losses. In this setting, acoustic word embeddings are learned jointly with embeddings of character sequences to generate acoustically grounded embeddings of written words, or acoustically grounded word embeddings. In this thesis, we contribute new discriminative acoustic word embedding (AWE) and acoustically grounded word embedding (AGWE) approaches based on recurrent neural networks (RNNs). We improve model training in terms of both efficiency and performance. We take these developments beyond English to several low-resource languages and show that multilingual training improves performance when labeled data is limited. We apply our embedding models, both monolingual and multilingual, to the downstream tasks of query-by-example speech search and automatic speech recognition. Finally, we show how our embedding approaches compare with and complement more recent self-supervised speech models. ",
    "url": "https://arxiv.org/abs/2308.14905",
    "authors": [
      "Shane Settle"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2308.14938",
    "title": "Entropy-based Guidance of Deep Neural Networks for Accelerated  Convergence and Improved Performance",
    "abstract": "Neural networks have dramatically increased our capacity to learn from large, high-dimensional datasets across innumerable disciplines. However, their decisions are not easily interpretable, their computational costs are high, and building and training them are uncertain processes. To add structure to these efforts, we derive new mathematical results to efficiently measure the changes in entropy as fully-connected and convolutional neural networks process data, and introduce entropy-based loss terms. Experiments in image compression and image classification on benchmark datasets demonstrate these losses guide neural networks to learn rich latent data representations in fewer dimensions, converge in fewer training epochs, and achieve better test metrics. ",
    "url": "https://arxiv.org/abs/2308.14938",
    "authors": [
      "Mackenzie J. Meni",
      "Ryan T. White",
      "Michael Mayo",
      "Kevin Pilkiewicz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.14947",
    "title": "Improving Reinforcement Learning Training Regimes for Social Robot  Navigation",
    "abstract": "In order for autonomous mobile robots to navigate in human spaces, they must abide by our social norms. Reinforcement learning (RL) has emerged as an effective method to train robot navigation policies that are able to respect these norms. However, a large portion of existing work in the field conducts both RL training and testing in simplistic environments. This limits the generalization potential of these models to unseen environments, and the meaningfulness of their reported results. We propose a method to improve the generalization performance of RL social navigation methods using curriculum learning. By employing multiple environment types and by modeling pedestrians using multiple dynamics models, we are able to progressively diversify and escalate difficulty in training. Our results show that the use of curriculum learning in training can be used to achieve better generalization performance than previous training methods. We also show that results presented in many existing state-of-the art RL social navigation works do not evaluate their methods outside of their training environments, and thus do not reflect their policies' failure to adequately generalize to out-of-distribution scenarios. In response, we validate our training approach on larger and more crowded testing environments than those used in training, allowing for more meaningful measurements of model performance. ",
    "url": "https://arxiv.org/abs/2308.14947",
    "authors": [
      "Adam Sigal",
      "Hsiu-Chin Lin",
      "AJung Moon"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2308.14949",
    "title": "Low-bit Quantization for Deep Graph Neural Networks with  Smoothness-aware Message Propagation",
    "abstract": "Graph Neural Network (GNN) training and inference involve significant challenges of scalability with respect to both model sizes and number of layers, resulting in degradation of efficiency and accuracy for large and deep GNNs. We present an end-to-end solution that aims to address these challenges for efficient GNNs in resource constrained environments while avoiding the oversmoothing problem in deep GNNs. We introduce a quantization based approach for all stages of GNNs, from message passing in training to node classification, compressing the model and enabling efficient processing. The proposed GNN quantizer learns quantization ranges and reduces the model size with comparable accuracy even under low-bit quantization. To scale with the number of layers, we devise a message propagation mechanism in training that controls layer-wise changes of similarities between neighboring nodes. This objective is incorporated into a Lagrangian function with constraints and a differential multiplier method is utilized to iteratively find optimal embeddings. This mitigates oversmoothing and suppresses the quantization error to a bound. Significant improvements are demonstrated over state-of-the-art quantization methods and deep GNN approaches in both full-precision and quantized models. The proposed quantizer demonstrates superior performance in INT2 configurations across all stages of GNN, achieving a notable level of accuracy. In contrast, existing quantization approaches fail to generate satisfactory accuracy levels. Finally, the inference with INT2 and INT4 representations exhibits a speedup of 5.11 $\\times$ and 4.70 $\\times$ compared to full precision counterparts, respectively. ",
    "url": "https://arxiv.org/abs/2308.14949",
    "authors": [
      "Shuang Wang",
      "Bahaeddin Eravci",
      "Rustam Guliyev",
      "Hakan Ferhatosmanoglu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.14951",
    "title": "Robust Open-Set Spoken Language Identification and the CU MultiLang  Dataset",
    "abstract": "Most state-of-the-art spoken language identification models are closed-set; in other words, they can only output a language label from the set of classes they were trained on. Open-set spoken language identification systems, however, gain the ability to detect when an input exhibits none of the original languages. In this paper, we implement a novel approach to open-set spoken language identification that uses MFCC and pitch features, a TDNN model to extract meaningful feature embeddings, confidence thresholding on softmax outputs, and LDA and pLDA for learning to classify new unknown languages. We present a spoken language identification system that achieves 91.76% accuracy on trained languages and has the capability to adapt to unknown languages on the fly. To that end, we also built the CU MultiLang Dataset, a large and diverse multilingual speech corpus which was used to train and evaluate our system. ",
    "url": "https://arxiv.org/abs/2308.14951",
    "authors": [
      "Mustafa Eyceoz",
      "Justin Lee",
      "Siddharth Pittie",
      "Homayoon Beigi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2308.14958",
    "title": "Robust topology optimisation of lattice structures with spatially  correlated uncertainties",
    "abstract": "The uncertainties in material and other properties of structures are usually spatially correlated. We introduce an efficient technique for representing and processing spatially correlated random fields in robust topology optimisation of lattice structures. Robust optimisation considers the statistics of the structural response to obtain a design whose performance is less sensitive to the specific realisation of the random field. We represent Gaussian random fields on lattices by leveraging the established link between random fields and stochastic partial differential equations (SPDEs). It is known that the precision matrix, i.e. the inverse of the covariance matrix, of a random field with Mat\\'ern covariance is equal to the finite element stiffness matrix of a possibly fractional PDE with a second-order elliptic operator. We consider the discretisation of the PDE on the lattice to obtain a random field which, by design, considers its geometry and connectivity. The so-obtained random field can be interpreted as a physics-informed prior by the hypothesis that the elliptic SPDE models the physical processes occurring during manufacturing, like heat and mass diffusion. Although the proposed approach is general, we demonstrate its application to lattices modelled as pin-jointed trusses with uncertainties in member Young's moduli. We consider as a cost function the weighted sum of the expectation and standard deviation of the structural compliance. To compute the expectation and standard deviation and their gradients with respect to member cross-sections we use a first-order Taylor series approximation. The cost function and its gradient are computed using only sparse matrix operations. We demonstrate the efficiency of the proposed approach using several lattice examples with isotropic, anisotropic and non-stationary random fields and up to eighty thousand random and optimisation variables. ",
    "url": "https://arxiv.org/abs/2308.14958",
    "authors": [
      "Ismael Ben-Yelun",
      "Ahmet Oguzhan Yuksel",
      "Fehmi Cirak"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2308.14995",
    "title": "WSAM: Visual Explanations from Style Augmentation as Adversarial  Attacker and Their Influence in Image Classification",
    "abstract": "Currently, style augmentation is capturing attention due to convolutional neural networks (CNN) being strongly biased toward recognizing textures rather than shapes. Most existing styling methods either perform a low-fidelity style transfer or a weak style representation in the embedding vector. This paper outlines a style augmentation algorithm using stochastic-based sampling with noise addition to improving randomization on a general linear transformation for style transfer. With our augmentation strategy, all models not only present incredible robustness against image stylizing but also outperform all previous methods and surpass the state-of-the-art performance for the STL-10 dataset. In addition, we present an analysis of the model interpretations under different style variations. At the same time, we compare comprehensive experiments demonstrating the performance when applied to deep neural architectures in training settings. ",
    "url": "https://arxiv.org/abs/2308.14995",
    "authors": [
      "Felipe Moreno-Vera",
      "Edgar Medina",
      "Jorge Poco"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15002",
    "title": "Exploring the Limits of Historical Information for Temporal Knowledge  Graph Extrapolation",
    "abstract": "Temporal knowledge graphs, representing the dynamic relationships and interactions between entities over time, have been identified as a promising approach for event forecasting. However, a limitation of most temporal knowledge graph reasoning methods is their heavy reliance on the recurrence or periodicity of events, which brings challenges to inferring future events related to entities that lack historical interaction. In fact, the current state of affairs is often the result of a combination of historical information and underlying factors that are not directly observable. To this end, we investigate the limits of historical information for temporal knowledge graph extrapolation and propose a new event forecasting model called Contrastive Event Network (CENET) based on a novel training framework of historical contrastive learning. CENET learns both the historical and non-historical dependency to distinguish the most potential entities that best match the given query. Simultaneously, by launching contrastive learning, it trains representations of queries to probe whether the current moment is more dependent on historical or non-historical events. These representations further help train a binary classifier, whose output is a boolean mask, indicating the related entities in the search space. During the inference process, CENET employs a mask-based strategy to generate the final results. We evaluate our proposed model on five benchmark graphs. The results demonstrate that CENET significantly outperforms all existing methods in most metrics, achieving at least 8.3% relative improvement of Hits@1 over previous state-of-the-art baselines on event-based datasets. ",
    "url": "https://arxiv.org/abs/2308.15002",
    "authors": [
      "Yi Xu",
      "Junjie Ou",
      "Hui Xu",
      "Luoyi Fu",
      "Lei Zhou",
      "Xinbing Wang",
      "Chenghu Zhou"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15004",
    "title": "PBFormer: Capturing Complex Scene Text Shape with Polynomial Band  Transformer",
    "abstract": "We present PBFormer, an efficient yet powerful scene text detector that unifies the transformer with a novel text shape representation Polynomial Band (PB). The representation has four polynomial curves to fit a text's top, bottom, left, and right sides, which can capture a text with a complex shape by varying polynomial coefficients. PB has appealing features compared with conventional representations: 1) It can model different curvatures with a fixed number of parameters, while polygon-points-based methods need to utilize a different number of points. 2) It can distinguish adjacent or overlapping texts as they have apparent different curve coefficients, while segmentation-based or points-based methods suffer from adhesive spatial positions. PBFormer combines the PB with the transformer, which can directly generate smooth text contours sampled from predicted curves without interpolation. A parameter-free cross-scale pixel attention (CPA) module is employed to highlight the feature map of a suitable scale while suppressing the other feature maps. The simple operation can help detect small-scale texts and is compatible with the one-stage DETR framework, where no postprocessing exists for NMS. Furthermore, PBFormer is trained with a shape-contained loss, which not only enforces the piecewise alignment between the ground truth and the predicted curves but also makes curves' positions and shapes consistent with each other. Without bells and whistles about text pre-training, our method is superior to the previous state-of-the-art text detectors on the arbitrary-shaped text datasets. ",
    "url": "https://arxiv.org/abs/2308.15004",
    "authors": [
      "Ruijin Liu",
      "Ning Lu",
      "Dapeng Chen",
      "Cheng Li",
      "Zejian Yuan",
      "Wei Peng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15005",
    "title": "Few-Shot Object Detection via Synthetic Features with Optimal Transport",
    "abstract": "Few-shot object detection aims to simultaneously localize and classify the objects in an image with limited training samples. However, most existing few-shot object detection methods focus on extracting the features of a few samples of novel classes that lack diversity. Hence, they may not be sufficient to capture the data distribution. To address that limitation, in this paper, we propose a novel approach in which we train a generator to generate synthetic data for novel classes. Still, directly training a generator on the novel class is not effective due to the lack of novel data. To overcome that issue, we leverage the large-scale dataset of base classes. Our overarching goal is to train a generator that captures the data variations of the base dataset. We then transform the captured variations into novel classes by generating synthetic data with the trained generator. To encourage the generator to capture data variations on base classes, we propose to train the generator with an optimal transport loss that minimizes the optimal transport distance between the distributions of real and synthetic data. Extensive experiments on two benchmark datasets demonstrate that the proposed method outperforms the state of the art. Source code will be available. ",
    "url": "https://arxiv.org/abs/2308.15005",
    "authors": [
      "Anh-Khoa Nguyen Vu",
      "Thanh-Toan Do",
      "Vinh-Tiep Nguyen",
      "Tam Le",
      "Minh-Triet Tran",
      "Tam V. Nguyen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15009",
    "title": "Double Public Key Signing Function Oracle Attack on EdDSA Software  Implementations",
    "abstract": "EdDSA is a standardised elliptic curve digital signature scheme introduced to overcome some of the issues prevalent in the more established ECDSA standard. Due to the EdDSA standard specifying that the EdDSA signature be deterministic, if the signing function were to be used as a public key signing oracle for the attacker, the unforgeability notion of security of the scheme can be broken. This paper describes an attack against some of the most popular EdDSA implementations, which results in an adversary recovering the private key used during signing. With this recovered secret key, an adversary can sign arbitrary messages that would be seen as valid by the EdDSA verification function. A list of libraries with vulnerable APIs at the time of publication is provided. Furthermore, this paper provides two suggestions for securing EdDSA signing APIs against this vulnerability while it additionally discusses failed attempts to solve the issue. ",
    "url": "https://arxiv.org/abs/2308.15009",
    "authors": [
      "Sam Grierson",
      "Konstantinos Chalkias",
      "William J Buchanan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.15027",
    "title": "Improving Neural Ranking Models with Traditional IR Methods",
    "abstract": "Neural ranking methods based on large transformer models have recently gained significant attention in the information retrieval community, and have been adopted by major commercial solutions. Nevertheless, they are computationally expensive to create, and require a great deal of labeled data for specialized corpora. In this paper, we explore a low resource alternative which is a bag-of-embedding model for document retrieval and find that it is competitive with large transformer models fine tuned on information retrieval tasks. Our results show that a simple combination of TF-IDF, a traditional keyword matching method, with a shallow embedding model provides a low cost path to compete well with the performance of complex neural ranking models on 3 datasets. Furthermore, adding TF-IDF measures improves the performance of large-scale fine tuned models on these tasks. ",
    "url": "https://arxiv.org/abs/2308.15027",
    "authors": [
      "Anik Saha",
      "Oktie Hassanzadeh",
      "Alex Gittens",
      "Jian Ni",
      "Kavitha Srinivas",
      "Bulent Yener"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.15033",
    "title": "STEC: See-Through Transformer-based Encoder for CTR Prediction",
    "abstract": "Click-Through Rate (CTR) prediction holds a pivotal place in online advertising and recommender systems since CTR prediction performance directly influences the overall satisfaction of the users and the revenue generated by companies. Even so, CTR prediction is still an active area of research since it involves accurately modelling the preferences of users based on sparse and high-dimensional features where the higher-order interactions of multiple features can lead to different outcomes. Most CTR prediction models have relied on a single fusion and interaction learning strategy. The few CTR prediction models that have utilized multiple interaction modelling strategies have treated each interaction to be self-contained. In this paper, we propose a novel model named STEC that reaps the benefits of multiple interaction learning approaches in a single unified architecture. Additionally, our model introduces residual connections from different orders of interactions which boosts the performance by allowing lower level interactions to directly affect the predictions. Through extensive experiments on four real-world datasets, we demonstrate that STEC outperforms existing state-of-the-art approaches for CTR prediction thanks to its greater expressive capabilities. ",
    "url": "https://arxiv.org/abs/2308.15033",
    "authors": [
      "Serdarcan Dilbaz",
      "Hasan Saribas"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2308.15049",
    "title": "Pose-Free Neural Radiance Fields via Implicit Pose Regularization",
    "abstract": "Pose-free neural radiance fields (NeRF) aim to train NeRF with unposed multi-view images and it has achieved very impressive success in recent years. Most existing works share the pipeline of training a coarse pose estimator with rendered images at first, followed by a joint optimization of estimated poses and neural radiance field. However, as the pose estimator is trained with only rendered images, the pose estimation is usually biased or inaccurate for real images due to the domain gap between real images and rendered images, leading to poor robustness for the pose estimation of real images and further local minima in joint optimization. We design IR-NeRF, an innovative pose-free NeRF that introduces implicit pose regularization to refine pose estimator with unposed real images and improve the robustness of the pose estimation for real images. With a collection of 2D images of a specific scene, IR-NeRF constructs a scene codebook that stores scene features and captures the scene-specific pose distribution implicitly as priors. Thus, the robustness of pose estimation can be promoted with the scene priors according to the rationale that a 2D real image can be well reconstructed from the scene codebook only when its estimated pose lies within the pose distribution. Extensive experiments show that IR-NeRF achieves superior novel view synthesis and outperforms the state-of-the-art consistently across multiple synthetic and real datasets. ",
    "url": "https://arxiv.org/abs/2308.15049",
    "authors": [
      "Jiahui Zhang",
      "Fangneng Zhan",
      "Yingchen Yu",
      "Kunhao Liu",
      "Rongliang Wu",
      "Xiaoqin Zhang",
      "Ling Shao",
      "Shijian Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15061",
    "title": "AIoT-Based Drum Transcription Robot using Convolutional Neural Networks",
    "abstract": "With the development of information technology, robot technology has made great progress in various fields. These new technologies enable robots to be used in industry, agriculture, education and other aspects. In this paper, we propose a drum robot that can automatically complete music transcription in real-time, which is based on AIoT and fog computing technology. Specifically, this drum robot system consists of a cloud node for data storage, edge nodes for real-time computing, and data-oriented execution application nodes. In order to analyze drumming music and realize drum transcription, we further propose a light-weight convolutional neural network model to classify drums, which can be more effectively deployed in terminal devices for fast edge calculations. The experimental results show that the proposed system can achieve more competitive performance and enjoy a variety of smart applications and services. ",
    "url": "https://arxiv.org/abs/2308.15061",
    "authors": [
      "Yukun Su",
      "Yi Yang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15063",
    "title": "Learning Cross-modality Information Bottleneck Representation for  Heterogeneous Person Re-Identification",
    "abstract": "Visible-Infrared person re-identification (VI-ReID) is an important and challenging task in intelligent video surveillance. Existing methods mainly focus on learning a shared feature space to reduce the modality discrepancy between visible and infrared modalities, which still leave two problems underexplored: information redundancy and modality complementarity. To this end, properly eliminating the identity-irrelevant information as well as making up for the modality-specific information are critical and remains a challenging endeavor. To tackle the above problems, we present a novel mutual information and modality consensus network, namely CMInfoNet, to extract modality-invariant identity features with the most representative information and reduce the redundancies. The key insight of our method is to find an optimal representation to capture more identity-relevant information and compress the irrelevant parts by optimizing a mutual information bottleneck trade-off. Besides, we propose an automatically search strategy to find the most prominent parts that identify the pedestrians. To eliminate the cross- and intra-modality variations, we also devise a modality consensus module to align the visible and infrared modalities for task-specific guidance. Moreover, the global-local feature representations can also be acquired for key parts discrimination. Experimental results on four benchmarks, i.e., SYSU-MM01, RegDB, Occluded-DukeMTMC, Occluded-REID, Partial-REID and Partial\\_iLIDS dataset, have demonstrated the effectiveness of CMInfoNet. ",
    "url": "https://arxiv.org/abs/2308.15063",
    "authors": [
      "Haichao Shi",
      "Mandi Luo",
      "Xiao-Yu Zhang",
      "Ran He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15068",
    "title": "A Comprehensive Augmentation Framework for Anomaly Detection",
    "abstract": "Data augmentation methods are commonly integrated into the training of anomaly detection models. Previous approaches have primarily focused on replicating real-world anomalies or enhancing diversity, without considering that the standard of anomaly varies across different classes, potentially leading to a biased training distribution.This paper analyzes crucial traits of simulated anomalies that contribute to the training of reconstructive networks and condenses them into several methods, thus creating a comprehensive framework by selectively utilizing appropriate combinations.Furthermore, we integrate this framework with a reconstruction-based approach and concurrently propose a split training strategy that alleviates the issue of overfitting while avoiding introducing interference to the reconstruction process. The evaluations conducted on the MVTec anomaly detection dataset demonstrate that our method outperforms the previous state-of-the-art approach, particularly in terms of object classes.To evaluate generalizability, we generate a simulated dataset comprising anomalies with diverse characteristics since the original test samples only include specific types of anomalies and may lead to biased evaluations. Experimental results demonstrate that our approach exhibits promising potential for generalizing effectively to various unforeseen anomalies encountered in real-world scenarios. ",
    "url": "https://arxiv.org/abs/2308.15068",
    "authors": [
      "Jiang Lin",
      "Yaping Yan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15069",
    "title": "MadSGM: Multivariate Anomaly Detection with Score-based Generative  Models",
    "abstract": "The time-series anomaly detection is one of the most fundamental tasks for time-series. Unlike the time-series forecasting and classification, the time-series anomaly detection typically requires unsupervised (or self-supervised) training since collecting and labeling anomalous observations are difficult. In addition, most existing methods resort to limited forms of anomaly measurements and therefore, it is not clear whether they are optimal in all circumstances. To this end, we present a multivariate time-series anomaly detector based on score-based generative models, called MadSGM, which considers the broadest ever set of anomaly measurement factors: i) reconstruction-based, ii) density-based, and iii) gradient-based anomaly measurements. We also design a conditional score network and its denoising score matching loss for the time-series anomaly detection. Experiments on five real-world benchmark datasets illustrate that MadSGM achieves the most robust and accurate predictions. ",
    "url": "https://arxiv.org/abs/2308.15069",
    "authors": [
      "Haksoo Lim",
      "Sewon Park",
      "Minjung Kim",
      "Jaehoon Lee",
      "Seonkyu Lim",
      "Noseong Park"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15072",
    "title": "Advancing Adversarial Robustness Through Adversarial Logit Update",
    "abstract": "Deep Neural Networks are susceptible to adversarial perturbations. Adversarial training and adversarial purification are among the most widely recognized defense strategies. Although these methods have different underlying logic, both rely on absolute logit values to generate label predictions. In this study, we theoretically analyze the logit difference around successful adversarial attacks from a theoretical point of view and propose a new principle, namely Adversarial Logit Update (ALU), to infer adversarial sample's labels. Based on ALU, we introduce a new classification paradigm that utilizes pre- and post-purification logit differences for model's adversarial robustness boost. Without requiring adversarial or additional data for model training, our clean data synthesis model can be easily applied to various pre-trained models for both adversarial sample detection and ALU-based data classification. Extensive experiments on both CIFAR-10, CIFAR-100, and tiny-ImageNet datasets show that even with simple components, the proposed solution achieves superior robustness performance compared to state-of-the-art methods against a wide range of adversarial attacks. Our python implementation is submitted in our Supplementary document and will be published upon the paper's acceptance. ",
    "url": "https://arxiv.org/abs/2308.15072",
    "authors": [
      "Hao Xuan",
      "Peican Zhu",
      "Xingyu Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.15094",
    "title": "Group-Conditional Conformal Prediction via Quantile Regression  Calibration for Crop and Weed Classification",
    "abstract": "As deep learning predictive models become an integral part of a large spectrum of precision agricultural systems, a barrier to the adoption of such automated solutions is the lack of user trust in these highly complex, opaque and uncertain models. Indeed, deep neural networks are not equipped with any explicit guarantees that can be used to certify the system's performance, especially in highly varying uncontrolled environments such as the ones typically faced in computer vision for agriculture.Fortunately, certain methods developed in other communities can prove to be important for agricultural applications. This article presents the conformal prediction framework that provides valid statistical guarantees on the predictive performance of any black box prediction machine, with almost no assumptions, applied to the problem of deep visual classification of weeds and crops in real-world conditions. The framework is exposed with a focus on its practical aspects and special attention accorded to the Adaptive Prediction Sets (APS) approach that delivers marginal guarantees on the model's coverage. Marginal results are then shown to be insufficient to guarantee performance on all groups of individuals in the population as characterized by their environmental and pedo-climatic auxiliary data gathered during image acquisition.To tackle this shortcoming, group-conditional conformal approaches are presented: the ''classical'' method that consists of iteratively applying the APS procedure on all groups, and a proposed elegant reformulation and implementation of the procedure using quantile regression on group membership indicators. Empirical results showing the validity of the proposed approach are presented and compared to the marginal APS then discussed. ",
    "url": "https://arxiv.org/abs/2308.15094",
    "authors": [
      "Paul Melki",
      "Lionel Bombrun",
      "Boubacar Diallo",
      "Jérôme Dias",
      "Jean-Pierre da Costa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.15107",
    "title": "Stochastic Graph Bandit Learning with Side-Observations",
    "abstract": "In this paper, we investigate the stochastic contextual bandit with general function space and graph feedback. We propose an algorithm that addresses this problem by adapting to both the underlying graph structures and reward gaps. To the best of our knowledge, our algorithm is the first to provide a gap-dependent upper bound in this stochastic setting, bridging the research gap left by the work in [35]. In comparison to [31,33,35], our method offers improved regret upper bounds and does not require knowledge of graphical quantities. We conduct numerical experiments to demonstrate the computational efficiency and effectiveness of our approach in terms of regret upper bounds. These findings highlight the significance of our algorithm in advancing the field of stochastic contextual bandits with graph feedback, opening up avenues for practical applications in various domains. ",
    "url": "https://arxiv.org/abs/2308.15107",
    "authors": [
      "Xueping Gong",
      "Jiheng Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15118",
    "title": "Large Language Models on the Chessboard: A Study on ChatGPT's Formal  Language Comprehension and Complex Reasoning Skills",
    "abstract": "While large language models have made strides in natural language processing, their proficiency in complex reasoning tasks requiring formal language comprehension, such as chess, remains less investigated. This paper probes the performance of ChatGPT, a sophisticated language model by OpenAI in tackling such complex reasoning tasks, using chess as a case study. Through robust metrics examining both the legality and quality of moves, we assess ChatGPT's understanding of the chessboard, adherence to chess rules, and strategic decision-making abilities. Our evaluation identifies limitations within ChatGPT's attention mechanism that affect its formal language comprehension and uncovers the model's underdeveloped self-regulation abilities. Our study also reveals ChatGPT's propensity for a coherent strategy in its gameplay and a noticeable uptick in decision-making assertiveness when the model is presented with a greater volume of natural language or possesses a more lucid understanding of the state of the chessboard. These findings contribute to the growing exploration of language models' abilities beyond natural language processing, providing valuable information for future research towards models demonstrating human-like cognitive abilities. ",
    "url": "https://arxiv.org/abs/2308.15118",
    "authors": [
      "Mu-Tien Kuo",
      "Chih-Chung Hsueh",
      "Richard Tzong-Han Tsai"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.15120",
    "title": "Compiler Discovered Dynamic Scheduling of Irregular Code in High-Level  Synthesis",
    "abstract": "Dynamically scheduled high-level synthesis (HLS) achieves higher throughput than static HLS for codes with unpredictable memory accesses and control flow. However, excessive dataflow scheduling results in circuits that use more resources and have a slower critical path, even when only a part of the circuit exhibits dynamic behavior. Recent work has shown that marking parts of a dataflow circuit for static scheduling can save resources and improve performance (hybrid scheduling), but the dynamic part of the circuit still bottlenecks the critical path. We propose instead to selectively introduce dynamic scheduling into static HLS. This paper presents an algorithm for identifying code regions amenable to dynamic scheduling and shows a methodology for introducing dynamically scheduled basic blocks, loops, and memory operations into static HLS. Our algorithm is informed by modulo-scheduling and can be integrated into any modulo-scheduled HLS tool. On a set of ten benchmarks, we show that our approach achieves on average an up to 3.7$\\times$ and 3$\\times$ speedup against dynamic and hybrid scheduling, respectively, with an area overhead of 1.3$\\times$ and frequency degradation of 0.74$\\times$ when compared to static HLS. ",
    "url": "https://arxiv.org/abs/2308.15120",
    "authors": [
      "Robert Szafarczyk",
      "Syed Waqar Nabi",
      "Wim Vanderbauwhede"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2308.15131",
    "title": "Robust Transceiver Design for Covert Integrated Sensing and  Communications With Imperfect CSI",
    "abstract": "We propose a robust transceiver design for a covert integrated sensing and communications (ISAC) system with imperfect channel state information (CSI). Considering both bounded and probabilistic CSI error models, we formulate worst-case and outage-constrained robust optimization problems of joint trasceiver beamforming and radar waveform design to balance the radar performance of multiple targets while ensuring communications performance and covertness of the system. The optimization problems are challenging due to the non-convexity arising from the semi-infinite constraints (SICs) and the coupled transceiver variables. In an effort to tackle the former difficulty, S-procedure and Bernstein-type inequality are introduced for converting the SICs into finite convex linear matrix inequalities (LMIs) and second-order cone constraints. A robust alternating optimization framework referred to alternating double-checking is developed for decoupling the transceiver design problem into feasibility-checking transmitter- and receiver-side subproblems, transforming the rank-one constraints into a set of LMIs, and verifying the feasibility of beamforming by invoking the matrix-lifting scheme. Numerical results are provided to demonstrate the effectiveness and robustness of the proposed algorithm in improving the performance of covert ISAC systems. ",
    "url": "https://arxiv.org/abs/2308.15131",
    "authors": [
      "Yuchen Zhang",
      "Wanli Ni",
      "Jianquan Wang",
      "Wanbin Tang",
      "Min Jia",
      "Yonina C. Eldar",
      "Dusit Niyato"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.15136",
    "title": "CAGRA: Highly Parallel Graph Construction and Approximate Nearest  Neighbor Search for GPUs",
    "abstract": "Approximate Nearest Neighbor Search (ANNS) plays a critical role in various disciplines spanning data mining and artificial intelligence, from information retrieval and computer vision to natural language processing and recommender systems. Data volumes have soared in recent years and the computational cost of an exhaustive exact nearest neighbor search is often prohibitive, necessitating the adoption of approximate techniques. The balanced performance and recall of graph-based approaches have more recently garnered significant attention in ANNS algorithms, however, only a few studies have explored harnessing the power of GPUs and multi-core processors despite the widespread use of massively parallel and general-purpose computing. To bridge this gap, we introduce a novel parallel computing hardware-based proximity graph and search algorithm. By leveraging the high-performance capabilities of modern hardware, our approach achieves remarkable efficiency gains. In particular, our method surpasses existing CPU and GPU-based methods in constructing the proximity graph, demonstrating higher throughput in both large- and small-batch searches while maintaining compatible accuracy. In graph construction time, our method, CAGRA, is 2.2~27x faster than HNSW, which is one of the CPU SOTA implementations. In large-batch query throughput in the 90% to 95% recall range, our method is 33~77x faster than HNSW, and is 3.8~8.8x faster than the SOTA implementations for GPU. For a single query, our method is 3.4~53x faster than HNSW at 95% recall. ",
    "url": "https://arxiv.org/abs/2308.15136",
    "authors": [
      "Hiroyuki Ootomo",
      "Akira Naruse",
      "Corey Nolet",
      "Ray Wang",
      "Tamas Feher",
      "Yong Wang"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Databases (cs.DB)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2308.15137",
    "title": "Abdominal Multi-Organ Segmentation Based on Feature Pyramid Network and  Spatial Recurrent Neural Network",
    "abstract": "As recent advances in AI are causing the decline of conventional diagnostic methods, the realization of end-to-end diagnosis is fast approaching. Ultrasound image segmentation is an important step in the diagnostic process. An accurate and robust segmentation model accelerates the process and reduces the burden of sonographers. In contrast to previous research, we take two inherent features of ultrasound images into consideration: (1) different organs and tissues vary in spatial sizes, (2) the anatomical structures inside human body form a relatively constant spatial relationship. Based on those two ideas, we propose a new image segmentation model combining Feature Pyramid Network (FPN) and Spatial Recurrent Neural Network (SRNN). We discuss why we use FPN to extract anatomical structures of different scales and how SRNN is implemented to extract the spatial context features in abdominal ultrasound images. ",
    "url": "https://arxiv.org/abs/2308.15137",
    "authors": [
      "Yuhan Song",
      "Armagan Elibol",
      "Nak Young Chong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15139",
    "title": "PTTS: Zero-Knowledge Proof-based Private Token Transfer System on  Ethereum Blockchain and its Network Flow Based Balance Range Privacy Attack  Analysis",
    "abstract": "Blockchains are decentralized and immutable databases that are shared among the nodes of the network. Although blockchains have attracted a great scale of attention in the recent years by disrupting the traditional financial systems, the transaction privacy is still a challenging issue that needs to be addressed and analysed. We propose a Private Token Transfer System (PTTS) for the Ethereum public blockchain in the first part of this paper. For the proposed framework, zero-knowledge based protocol has been designed using Zokrates and integrated into our private token smart contract. With the help of web user interface designed, the end users can interact with the smart contract without any third-party setup. In the second part of the paper, we provide security and privacy analysis including the replay attack and the balance range privacy attack which has been modelled as a network flow problem. It is shown that in case some balance ranges are deliberately leaked out to particular organizations or adversial entities, it is possible to extract meaningful information about the user balances by employing minimum cost flow network algorithms that have polynomial complexity. The experimental study reports the Ethereum gas consumption and proof generation times for the proposed framework. It also reports network solution times and goodness rates for a subset of addresses under the balance range privacy attack with respect to number of addresses, number of transactions and ratio of leaked transfer transaction amounts. ",
    "url": "https://arxiv.org/abs/2308.15139",
    "authors": [
      "Goshgar Ismayilov",
      "Can Ozturan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.15150",
    "title": "Unleashing the Potential of Spiking Neural Networks for Sequential  Modeling with Contextual Embedding",
    "abstract": "The human brain exhibits remarkable abilities in integrating temporally distant sensory inputs for decision-making. However, existing brain-inspired spiking neural networks (SNNs) have struggled to match their biological counterpart in modeling long-term temporal relationships. To address this problem, this paper presents a novel Contextual Embedding Leaky Integrate-and-Fire (CE-LIF) spiking neuron model. Specifically, the CE-LIF model incorporates a meticulously designed contextual embedding component into the adaptive neuronal firing threshold, thereby enhancing the memory storage of spiking neurons and facilitating effective sequential modeling. Additionally, theoretical analysis is provided to elucidate how the CE-LIF model enables long-term temporal credit assignment. Remarkably, when compared to state-of-the-art recurrent SNNs, feedforward SNNs comprising the proposed CE-LIF neurons demonstrate superior performance across extensive sequential modeling tasks in terms of classification accuracy, network convergence speed, and memory capacity. ",
    "url": "https://arxiv.org/abs/2308.15150",
    "authors": [
      "Xinyi Chen",
      "Jibin Wu",
      "Huajin Tang",
      "Qinyuan Ren",
      "Kay Chen Tan"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2308.15161",
    "title": "TASEP: A Collaborative Social Engineering Tabletop Role-Playing Game to  Prevent Successful Social Engineering Attacks",
    "abstract": "Data breaches resulting from targeted attacks against organizations, e.g., by advanced persistent threat groups, often involve social engineering (SE) as the initial attack vector before malicious software is used, e.g., for persistence, lateral movement, and data exfiltration. While technical security controls, such as the automated detection of phishing emails, can contribute to mitigating SE risks, raising awareness for SE attacks through education and motivation of personnel is an important building block to increasing an organization's resilience. To facilitate hands-on SE awareness training as one component of broader SE awareness campaigns, we created a SE tabletop game called Tabletop As Social Engineering Prevention (TASEP) in two editions for (a) small and medium enterprises and (b) large corporations, respectively. Its game design is inspired by Dungeons & Dragons role-playing games and facilitates LEGO models of the in-game target organizations. Participants switch roles by playing a group of SE penetration testers and conducting a security audit guided by the game master. We evaluated the created game with different student groups, achieving highly immersive and flexible training, resulting in an entertaining way of learning about SE and raising awareness. ",
    "url": "https://arxiv.org/abs/2308.15161",
    "authors": [
      "Lukas Hafner",
      "Florian Wutz",
      "Daniela Pöhn",
      "Wolfgang Hommel"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.15164",
    "title": "ABS-SGD: A Delayed Synchronous Stochastic Gradient Descent Algorithm  with Adaptive Batch Size for Heterogeneous GPU Clusters",
    "abstract": "As the size of models and datasets grows, it has become increasingly common to train models in parallel. However, existing distributed stochastic gradient descent (SGD) algorithms suffer from insufficient utilization of computational resources and poor convergence in heterogeneous clusters. In this paper, we propose a delayed synchronous SGD algorithm with adaptive batch size (ABS-SGD) for heterogeneous GPU clusters. In ABS-SGD, workers perform global synchronization to accumulate delayed gradients and use the accumulated delayed gradients to update parameters. While workers are performing global synchronization for delayed gradients, they perform the computation of the next batch without specifying batch size in advance, which lasts until the next global synchronization starts, realizing the full utilization of computational resources. Since the gradient delay is only one iteration, the stale gradient problem can be alleviated. We theoretically prove the convergence of ABS-SGD in heterogeneous clusters. Extensive experiments in three types of heterogeneous clusters demonstrate that ABS-SGD can make full use of computational resources and accelerate model convergence: When training ResNet18 network with 4 workers, ABS-SGD increases the convergence speed by 1.30x on average compared with the best baseline algorithm. ",
    "url": "https://arxiv.org/abs/2308.15164",
    "authors": [
      "Xin Zhou",
      "Ling Chen",
      "Houming Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2308.15169",
    "title": "Uncovering the Unseen: Discover Hidden Intentions by Micro-Behavior  Graph Reasoning",
    "abstract": "This paper introduces a new and challenging Hidden Intention Discovery (HID) task. Unlike existing intention recognition tasks, which are based on obvious visual representations to identify common intentions for normal behavior, HID focuses on discovering hidden intentions when humans try to hide their intentions for abnormal behavior. HID presents a unique challenge in that hidden intentions lack the obvious visual representations to distinguish them from normal intentions. Fortunately, from a sociological and psychological perspective, we find that the difference between hidden and normal intentions can be reasoned from multiple micro-behaviors, such as gaze, attention, and facial expressions. Therefore, we first discover the relationship between micro-behavior and hidden intentions and use graph structure to reason about hidden intentions. To facilitate research in the field of HID, we also constructed a seminal dataset containing a hidden intention annotation of a typical theft scenario for HID. Extensive experiments show that the proposed network improves performance on the HID task by 9.9\\% over the state-of-the-art method SBP. ",
    "url": "https://arxiv.org/abs/2308.15169",
    "authors": [
      "Zhuo Zhou",
      "Wenxuan Liu",
      "Danni Xu",
      "Zheng Wang",
      "Jian Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2308.15177",
    "title": "Enhancements on a saturated control for stabilizing a quadcopter:  adaptive and robustness analysis in the flat output space",
    "abstract": "This paper extends our previous study on an explicit saturated control for a quadcopter, which ensures both constraint satisfaction and stability thanks to the linear representation of the system in the flat output space. The novelty here resides in the adaptivity of the controller's gain to enhance the system's performance without exciting its parasitic dynamics and avoid lavishing the input actuation with excessively high gain parameters. Moreover, we provide a thorough robustness analysis of the proposed controller when additive disturbances are affecting the system behavior. Finally, simulation and experimental tests validate the proposed controller. ",
    "url": "https://arxiv.org/abs/2308.15177",
    "authors": [
      "Huu-Thinh Do",
      "Franco Blanchini",
      "Ionela Prodan"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.15209",
    "title": "Shared Lexical Items as Triggers of Code Switching",
    "abstract": "Why do bilingual speakers code-switch (mix their two languages)? Among the several theories that attempt to explain this natural and ubiquitous phenomenon, the Triggering Hypothesis relates code-switching to the presence of lexical triggers, specifically cognates and proper names, adjacent to the switch point. We provide a fuller, more nuanced and refined exploration of the triggering hypothesis, based on five large datasets in three language pairs, reflecting both spoken and written bilingual interactions. Our results show that words that are assumed to reside in a mental lexicon shared by both languages indeed trigger code-switching; that the tendency to switch depends on the distance of the trigger from the switch point; and on whether the trigger precedes or succeeds the switch; but not on the etymology of the trigger words. We thus provide strong, robust, evidence-based confirmation to several hypotheses on the relationships between lexical triggers and code-switching. ",
    "url": "https://arxiv.org/abs/2308.15209",
    "authors": [
      "Shuly Wintner",
      "Safaa Shehadi",
      "Yuli Zeira",
      "Doreen Osmelak",
      "Yuval Nov"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15219",
    "title": "Comverse: A Federative-by-Design Platform for Community Computing",
    "abstract": "Communities, ranging from homes to cities, are a ubiquitous part of our lives. However, there is a lack of adequate support for applications built around these communities. As a result, current applications each need to implement their own notion of communities, making it difficult for both the app developers and the app users (\\ie the community admins and members) to create and use these community apps. In this paper, we argue that communities should be supported at the infrastructure-level rather than at the app-level. We refer to this approach as the Platform-Managed Community (PMC). We propose Comverse, a platform designed to this end. Comverse is predicated on the principle of federation, allowing autonomous nodes representing community members to voluntarily associate and share data while maintaining control over their data and participation. Through Comverse, we explore the vision of community computing by showcasing its applicability with real-world community apps. ",
    "url": "https://arxiv.org/abs/2308.15219",
    "authors": [
      "Silvery Fu",
      "Dylan Reimer",
      "Siyuan Dong",
      "Yifei Zhu",
      "Sylvia Ratnasamy"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2308.15232",
    "title": "Classification-Aware Neural Topic Model Combined With Interpretable  Analysis -- For Conflict Classification",
    "abstract": "A large number of conflict events are affecting the world all the time. In order to analyse such conflict events effectively, this paper presents a Classification-Aware Neural Topic Model (CANTM-IA) for Conflict Information Classification and Topic Discovery. The model provides a reliable interpretation of classification results and discovered topics by introducing interpretability analysis. At the same time, interpretation is introduced into the model architecture to improve the classification performance of the model and to allow interpretation to focus further on the details of the data. Finally, the model architecture is optimised to reduce the complexity of the model. ",
    "url": "https://arxiv.org/abs/2308.15232",
    "authors": [
      "Tianyu Liang",
      "Yida Mu",
      "Soonho Kim",
      "Darline Larissa Kengne Kuate",
      "Julie Lang",
      "Rob Vos",
      "Xingyi Song"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2308.15233",
    "title": "Multilevel Semantic Embedding of Software Patches: A Fine-to-Coarse  Grained Approach Towards Security Patch Detection",
    "abstract": "The growth of open-source software has increased the risk of hidden vulnerabilities that can affect downstream software applications. This concern is further exacerbated by software vendors' practice of silently releasing security patches without explicit warnings or common vulnerability and exposure (CVE) notifications. This lack of transparency leaves users unaware of potential security threats, giving attackers an opportunity to take advantage of these vulnerabilities. In the complex landscape of software patches, grasping the nuanced semantics of a patch is vital for ensuring secure software maintenance. To address this challenge, we introduce a multilevel Semantic Embedder for security patch detection, termed MultiSEM. This model harnesses word-centric vectors at a fine-grained level, emphasizing the significance of individual words, while the coarse-grained layer adopts entire code lines for vector representation, capturing the essence and interrelation of added or removed lines. We further enrich this representation by assimilating patch descriptions to obtain a holistic semantic portrait. This combination of multi-layered embeddings offers a robust representation, balancing word complexity, understanding code-line insights, and patch descriptions. Evaluating MultiSEM for detecting patch security, our results demonstrate its superiority, outperforming state-of-the-art models with promising margins: a 22.46\\% improvement on PatchDB and a 9.21\\% on SPI-DB in terms of the F1 metric. ",
    "url": "https://arxiv.org/abs/2308.15233",
    "authors": [
      "Xunzhu Tang",
      "zhenghan Chen",
      "Saad Ezzini",
      "Haoye Tian",
      "Yewei Song",
      "Jacques Klein",
      "Tegawende F. Bissyande"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.15234",
    "title": "Hyperbolic Code Retrieval: A Novel Approach for Efficient Code Search  Using Hyperbolic Space Embeddings",
    "abstract": "Within the realm of advanced code retrieval, existing methods have primarily relied on intricate matching and attention-based mechanisms. However, these methods often lead to computational and memory inefficiencies, posing a significant challenge to their real-world applicability. To tackle this challenge, we propose a novel approach, the Hyperbolic Code QA Matching (HyCoQA). This approach leverages the unique properties of Hyperbolic space to express connections between code fragments and their corresponding queries, thereby obviating the necessity for intricate interaction layers. The process commences with a reimagining of the code retrieval challenge, framed within a question-answering (QA) matching framework, constructing a dataset with triple matches characterized as \\texttt{<}negative code, description, positive code\\texttt{>}. These matches are subsequently processed via a static BERT embedding layer, yielding initial embeddings. Thereafter, a hyperbolic embedder transforms these representations into hyperbolic space, calculating distances between the codes and descriptions. The process concludes by implementing a scoring layer on these distances and leveraging hinge loss for model training. Especially, the design of HyCoQA inherently facilitates self-organization, allowing for the automatic detection of embedded hierarchical patterns during the learning phase. Experimentally, HyCoQA showcases remarkable effectiveness in our evaluations: an average performance improvement of 3.5\\% to 4\\% compared to state-of-the-art code retrieval techniques. ",
    "url": "https://arxiv.org/abs/2308.15234",
    "authors": [
      "Xunzhu Tang",
      "zhenghan Chen",
      "Saad Ezzini",
      "Haoye Tian",
      "Yewei Song",
      "Jacques Klein",
      "Tegawende F. Bissyande"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.15237",
    "title": "Assessing Cyclostationary Malware Detection via Feature Selection and  Classification",
    "abstract": "Cyclostationarity involves periodic statistical variations in signals and processes, commonly used in signal analysis and network security. In the context of attacks, cyclostationarity helps detect malicious behaviors within network traffic, such as traffic patterns in Distributed Denial of Service (DDoS) attacks or hidden communication channels in malware. This approach enhances security by identifying abnormal patterns and informing Network Intrusion Detection Systems (NIDSs) to recognize potential attacks, enhancing protection against both known and novel threats. This research focuses on identifying cyclostationary malware behavior and its detection. The main goal is to pinpoint essential cyclostationary features used in NIDSs. These features are extracted using algorithms such as Boruta and Principal Component Analysis (PCA), and then categorized to find the most significant cyclostationary patterns. The aim of this article is to reveal periodically changing malware behaviors through cyclostationarity. The study highlights the importance of spotting cyclostationary malware in NIDSs by using established datasets like KDD99, NSL-KDD, and the UGRansome dataset. The UGRansome dataset is designed for anomaly detection research and includes both normal and abnormal network threat categories of zero-day attacks. A comparison is made using the Random Forest (RF) and Support Vector Machine (SVM) algorithms, while also evaluating the effectiveness of Boruta and PCA. The findings show that PCA is more promising than using Boruta alone for extracting cyclostationary network feature patterns. Additionally, the analysis identifies the internet protocol as the most noticeable cyclostationary feature pattern used by malware. Notably, the UGRansome dataset outperforms the KDD99 and NSL-KDD, achieving 99% accuracy in signature malware detection using the RF algorithm and 98% with the SVM. ",
    "url": "https://arxiv.org/abs/2308.15237",
    "authors": [
      "Mike Nkongolo"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15246",
    "title": "A Classification-Guided Approach for Adversarial Attacks against Neural  Machine Translation",
    "abstract": "Neural Machine Translation (NMT) models have been shown to be vulnerable to adversarial attacks, wherein carefully crafted perturbations of the input can mislead the target model. In this paper, we introduce ACT, a novel adversarial attack framework against NMT systems guided by a classifier. In our attack, the adversary aims to craft meaning-preserving adversarial examples whose translations by the NMT model belong to a different class than the original translations in the target language. Unlike previous attacks, our new approach has a more substantial effect on the translation by altering the overall meaning, which leads to a different class determined by a classifier. To evaluate the robustness of NMT models to this attack, we propose enhancements to existing black-box word-replacement-based attacks by incorporating output translations of the target NMT model and the output logits of a classifier within the attack process. Extensive experiments in various settings, including a comparison with existing untargeted attacks, demonstrate that the proposed attack is considerably more successful in altering the class of the output translation and has more effect on the translation. This new paradigm can show the vulnerabilities of NMT systems by focusing on the class of translation rather than the mere translation quality as studied traditionally. ",
    "url": "https://arxiv.org/abs/2308.15246",
    "authors": [
      "Sahar Sadrizadeh",
      "Ljiljana Dolamic",
      "Pascal Frossard"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.15262",
    "title": "Enhancing OCR Performance through Post-OCR Models: Adopting Glyph  Embedding for Improved Correction",
    "abstract": "The study investigates the potential of post-OCR models to overcome limitations in OCR models and explores the impact of incorporating glyph embedding on post-OCR correction performance. In this study, we have developed our own post-OCR correction model. The novelty of our approach lies in embedding the OCR output using CharBERT and our unique embedding technique, capturing the visual characteristics of characters. Our findings show that post-OCR correction effectively addresses deficiencies in inferior OCR models, and glyph embedding enables the model to achieve superior results, including the ability to correct individual words. ",
    "url": "https://arxiv.org/abs/2308.15262",
    "authors": [
      "Yung-Hsin Chen",
      "Yuli Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.15267",
    "title": "Trustless Privacy-Preserving Data Aggregation on Ethereum with Hypercube  Network Topology",
    "abstract": "The privacy-preserving data aggregation is a critical problem for many applications where multiple parties need to collaborate with each other privately to arrive at certain results. Blockchain, as a database shared across the network, provides an underlying platform on which such aggregations can be carried out with a decentralized manner. Therefore, in this paper, we have proposed a scalable privacy-preserving data aggregation protocol for summation on the Ethereum blockchain by integrating several cryptographic primitives including commitment scheme, asymmetric encryption and zero-knowledge proof along with the hypercube network topology. The protocol consists of four stages as contract deployment, user registration, private submission and proof verification. The analysis of the protocol is made with respect to two main perspectives as security and scalability including computational, communicational and storage overheads. In the paper, the zero-knowledge proof, smart contract and web user interface models for the protocol are provided. We have performed an experimental study in order to identify the required gas costs per individual and per system. The general formulation is provided to characterize the changes in gas costs for the increasing number of users. The zero-knowledge proof generation and verification times are also measured. ",
    "url": "https://arxiv.org/abs/2308.15267",
    "authors": [
      "Goshgar Ismayilov",
      "Can Ozturan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.15280",
    "title": "ADFA: Attention-augmented Differentiable top-k Feature Adaptation for  Unsupervised Medical Anomaly Detection",
    "abstract": "The scarcity of annotated data, particularly for rare diseases, limits the variability of training data and the range of detectable lesions, presenting a significant challenge for supervised anomaly detection in medical imaging. To solve this problem, we propose a novel unsupervised method for medical image anomaly detection: Attention-Augmented Differentiable top-k Feature Adaptation (ADFA). The method utilizes Wide-ResNet50-2 (WR50) network pre-trained on ImageNet to extract initial feature representations. To reduce the channel dimensionality while preserving relevant channel information, we employ an attention-augmented patch descriptor on the extracted features. We then apply differentiable top-k feature adaptation to train the patch descriptor, mapping the extracted feature representations to a new vector space, enabling effective detection of anomalies. Experiments show that ADFA outperforms state-of-the-art (SOTA) methods on multiple challenging medical image datasets, confirming its effectiveness in medical anomaly detection. ",
    "url": "https://arxiv.org/abs/2308.15280",
    "authors": [
      "Yiming Huang",
      "Guole Liu",
      "Yaoru Luo",
      "Ge Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15284",
    "title": "ARTxAI: Explainable Artificial Intelligence Curates Deep Representation  Learning for Artistic Images using Fuzzy Techniques",
    "abstract": "Automatic art analysis employs different image processing techniques to classify and categorize works of art. When working with artistic images, we need to take into account further considerations compared to classical image processing. This is because such artistic paintings change drastically depending on the author, the scene depicted, and their artistic style. This can result in features that perform very well in a given task but do not grasp the whole of the visual and symbolic information contained in a painting. In this paper, we show how the features obtained from different tasks in artistic image classification are suitable to solve other ones of similar nature. We present different methods to improve the generalization capabilities and performance of artistic classification systems. Furthermore, we propose an explainable artificial intelligence method to map known visual traits of an image with the features used by the deep learning model considering fuzzy rules. These rules show the patterns and variables that are relevant to solve each task and how effective is each of the patterns found. Our results show that our proposed context-aware features can achieve up to $6\\%$ and $26\\%$ more accurate results than other context- and non-context-aware solutions, respectively, depending on the specific task. We also show that some of the features used by these models can be more clearly correlated to visual traits in the original image than others. ",
    "url": "https://arxiv.org/abs/2308.15284",
    "authors": [
      "Javier Fumanal-Idocin",
      "Javier Andreu-Perez",
      "Oscar Cordón",
      "Hani Hagras",
      "Humberto Bustince"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15293",
    "title": "A Hybrid Membership Latent Distance Model for Unsigned and Signed  Integer Weighted Networks",
    "abstract": "Graph representation learning (GRL) has become a prominent tool for furthering the understanding of complex networks providing tools for network embedding, link prediction, and node classification. In this paper, we propose the Hybrid Membership-Latent Distance Model (HM-LDM) by exploring how a Latent Distance Model (LDM) can be constrained to a latent simplex. By controlling the edge lengths of the corners of the simplex, the volume of the latent space can be systematically controlled. Thereby communities are revealed as the space becomes more constrained, with hard memberships being recovered as the simplex volume goes to zero. We further explore a recent likelihood formulation for signed networks utilizing the Skellam distribution to account for signed weighted networks and extend the HM-LDM to the signed Hybrid Membership-Latent Distance Model (sHM-LDM). Importantly, the induced likelihood function explicitly attracts nodes with positive links and deters nodes from having negative interactions. We demonstrate the utility of HM-LDM and sHM-LDM on several real networks. We find that the procedures successfully identify prominent distinct structures, as well as how nodes relate to the extracted aspects providing favorable performances in terms of link prediction when compared to prominent baselines. Furthermore, the learned soft memberships enable easily interpretable network visualizations highlighting distinct patterns. ",
    "url": "https://arxiv.org/abs/2308.15293",
    "authors": [
      "Nikolaos Nakis",
      "Abdulkadir Çelikkanat",
      "Morten Mørup"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15299",
    "title": "TaskLAMA: Probing the Complex Task Understanding of Language Models",
    "abstract": "Structured Complex Task Decomposition (SCTD) is the problem of breaking down a complex real-world task (such as planning a wedding) into a directed acyclic graph over individual steps that contribute to achieving the task, with edges specifying temporal dependencies between them. SCTD is an important component of assistive planning tools, and a challenge for commonsense reasoning systems. We probe how accurately SCTD can be done with the knowledge extracted from Large Language Models (LLMs). We introduce a high-quality human-annotated dataset for this problem and novel metrics to fairly assess performance of LLMs against several baselines. Our experiments reveal that LLMs are able to decompose complex tasks into individual steps effectively, with a relative improvement of 15% to 280% over the best baseline. We also propose a number of approaches to further improve their performance, with a relative improvement of 7% to 37% over the base model. However, we find that LLMs still struggle to predict pairwise temporal dependencies, which reveals a gap in their understanding of complex tasks. ",
    "url": "https://arxiv.org/abs/2308.15299",
    "authors": [
      "Quan Yuan",
      "Mehran Kazemi",
      "Xin Xu",
      "Isaac Noble",
      "Vaiva Imbrasaite",
      "Deepak Ramachandran"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.15300",
    "title": "MSFlow: Multi-Scale Flow-based Framework for Unsupervised Anomaly  Detection",
    "abstract": "Unsupervised anomaly detection (UAD) attracts a lot of research interest and drives widespread applications, where only anomaly-free samples are available for training. Some UAD applications intend to further locate the anomalous regions without any anomaly information. Although the absence of anomalous samples and annotations deteriorates the UAD performance, an inconspicuous yet powerful statistics model, the normalizing flows, is appropriate for anomaly detection and localization in an unsupervised fashion. The flow-based probabilistic models, only trained on anomaly-free data, can efficiently distinguish unpredictable anomalies by assigning them much lower likelihoods than normal data. Nevertheless, the size variation of unpredictable anomalies introduces another inconvenience to the flow-based methods for high-precision anomaly detection and localization. To generalize the anomaly size variation, we propose a novel Multi-Scale Flow-based framework dubbed MSFlow composed of asymmetrical parallel flows followed by a fusion flow to exchange multi-scale perceptions. Moreover, different multi-scale aggregation strategies are adopted for image-wise anomaly detection and pixel-wise anomaly localization according to the discrepancy between them. The proposed MSFlow is evaluated on three anomaly detection datasets, significantly outperforming existing methods. Notably, on the challenging MVTec AD benchmark, our MSFlow achieves a new state-of-the-art with a detection AUORC score of up to 99.7%, localization AUCROC score of 98.8%, and PRO score of 97.1%. The reproducible code is available at https://github.com/cool-xuan/msflow. ",
    "url": "https://arxiv.org/abs/2308.15300",
    "authors": [
      "Yixuan Zhou",
      "Xing Xu",
      "Jingkuan Song",
      "Fumin Shen",
      "Heng Tao Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15307",
    "title": "Compositional maps for registration in complex geometries",
    "abstract": "We develop and analyze a parametric registration procedure for manifolds associated with the solutions to parametric partial differential equations in two-dimensional domains. Given the domain $\\Omega \\subset \\mathbb{R}^2$ and the manifold $M=\\{ u_{\\mu} : \\mu\\in P\\}$ associated with the parameter domain $P \\subset \\mathbb{R}^P$ and the parametric field $\\mu\\mapsto u_{\\mu} \\in L^2(\\Omega)$, our approach takes as input a set of snapshots from $M$ and returns a parameter-dependent mapping $\\Phi: \\Omega \\times P \\to \\Omega$, which tracks coherent features (e.g., shocks, shear layers) of the solution field and ultimately simplifies the task of model reduction. We consider mappings of the form $\\Phi=\\texttt{N}(\\mathbf{a})$ where $\\texttt{N}:\\mathbb{R}^M \\to {\\rm Lip}(\\Omega; \\mathbb{R}^2)$ is a suitable linear or nonlinear operator; then, we state the registration problem as an unconstrained optimization statement for the coefficients $\\mathbf{a}$. We identify minimal requirements for the operator $\\texttt{N}$ to ensure the satisfaction of the bijectivity constraint; we propose a class of compositional maps that satisfy the desired requirements and enable non-trivial deformations over curved boundaries of $\\Omega$; we develop a thorough analysis of the proposed ansatz for polytopal domains and we discuss the approximation properties for general curved domains. We perform numerical experiments for a parametric inviscid transonic compressible flow past a cascade of turbine blades to illustrate the many features of the method. ",
    "url": "https://arxiv.org/abs/2308.15307",
    "authors": [
      "Tommaso Taddei"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2308.15308",
    "title": "On-Device Learning with Binary Neural Networks",
    "abstract": "Existing Continual Learning (CL) solutions only partially address the constraints on power, memory and computation of the deep learning models when deployed on low-power embedded CPUs. In this paper, we propose a CL solution that embraces the recent advancements in CL field and the efficiency of the Binary Neural Networks (BNN), that use 1-bit for weights and activations to efficiently execute deep learning models. We propose a hybrid quantization of CWR* (an effective CL approach) that considers differently forward and backward pass in order to retain more precision during gradient update step and at the same time minimizing the latency overhead. The choice of a binary network as backbone is essential to meet the constraints of low power devices and, to the best of authors' knowledge, this is the first attempt to prove on-device learning with BNN. The experimental validation carried out confirms the validity and the suitability of the proposed method. ",
    "url": "https://arxiv.org/abs/2308.15308",
    "authors": [
      "Lorenzo Vorabbi",
      "Davide Maltoni",
      "Stefano Santi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15309",
    "title": "Understanding the Privacy Risks of Popular Search Engine Advertising  Systems",
    "abstract": "We present the first extensive measurement of the privacy properties of the advertising systems used by privacy-focused search engines. We propose an automated methodology to study the impact of clicking on search ads on three popular private search engines which have advertising-based business models: StartPage, Qwant, and DuckDuckGo, and we compare them to two dominant data-harvesting ones: Google and Bing. We investigate the possibility of third parties tracking users when clicking on ads by analyzing first-party storage, redirection domain paths, and requests sent before, when, and after the clicks. Our results show that privacy-focused search engines fail to protect users' privacy when clicking ads. Users' requests are sent through redirectors on 4% of ad clicks on Bing, 86% of ad clicks on Qwant, and 100% of ad clicks on Google, DuckDuckGo, and StartPage. Even worse, advertising systems collude with advertisers across all search engines by passing unique IDs to advertisers in most ad clicks. These IDs allow redirectors to aggregate users' activity on ads' destination websites in addition to the activity they record when users are redirected through them. Overall, we observe that both privacy-focused and traditional search engines engage in privacy-harming behaviors allowing cross-site tracking, even in privacy-enhanced browsers. ",
    "url": "https://arxiv.org/abs/2308.15309",
    "authors": [
      "Salim Chouaki",
      "Oana Goga",
      "Hamed Haddadi",
      "Peter Snyder"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2308.15313",
    "title": "Spatio-temporal MLP-graph network for 3D human pose estimation",
    "abstract": "Graph convolutional networks and their variants have shown significant promise in 3D human pose estimation. Despite their success, most of these methods only consider spatial correlations between body joints and do not take into account temporal correlations, thereby limiting their ability to capture relationships in the presence of occlusions and inherent ambiguity. To address this potential weakness, we propose a spatio-temporal network architecture composed of a joint-mixing multi-layer perceptron block that facilitates communication among different joints and a graph weighted Jacobi network block that enables communication among various feature channels. The major novelty of our approach lies in a new weighted Jacobi feature propagation rule obtained through graph filtering with implicit fairing. We leverage temporal information from the 2D pose sequences, and integrate weight modulation into the model to enable untangling of the feature transformations of distinct nodes. We also employ adjacency modulation with the aim of learning meaningful correlations beyond defined linkages between body joints by altering the graph topology through a learnable modulation matrix. Extensive experiments on two benchmark datasets demonstrate the effectiveness of our model, outperforming recent state-of-the-art methods for 3D human pose estimation. ",
    "url": "https://arxiv.org/abs/2308.15313",
    "authors": [
      "Tanvir Hassan",
      "A. Ben Hamza"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15323",
    "title": "Occlusion-Aware Deep Convolutional Neural Network via Homogeneous  Tanh-transforms for Face Parsing",
    "abstract": "Face parsing infers a pixel-wise label map for each semantic facial component. Previous methods generally work well for uncovered faces, however overlook the facial occlusion and ignore some contextual area outside a single face, especially when facial occlusion has become a common situation during the COVID-19 epidemic. Inspired by the illumination theory of image, we propose a novel homogeneous tanh-transforms for image preprocessing, which made up of four tanh-transforms, that fuse the central vision and the peripheral vision together. Our proposed method addresses the dilemma of face parsing under occlusion and compresses more information of surrounding context. Based on homogeneous tanh-transforms, we propose an occlusion-aware convolutional neural network for occluded face parsing. It combines the information both in Tanh-polar space and Tanh-Cartesian space, capable of enhancing receptive fields. Furthermore, we introduce an occlusion-aware loss to focus on the boundaries of occluded regions. The network is simple and flexible, and can be trained end-to-end. To facilitate future research of occluded face parsing, we also contribute a new cleaned face parsing dataset, which is manually purified from several academic or industrial datasets, including CelebAMask-HQ, Short-video Face Parsing as well as Helen dataset and will make it public. Experiments demonstrate that our method surpasses state-of-art methods of face parsing under occlusion. ",
    "url": "https://arxiv.org/abs/2308.15323",
    "authors": [
      "Weihua Liu",
      "Chaochao Lin",
      "Haoping Yu",
      "Said Boumaraf",
      "Zhaoqiong Pi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15339",
    "title": "AI Framework for Early Diagnosis of Coronary Artery Disease: An  Integration of Borderline SMOTE, Autoencoders and Convolutional Neural  Networks Approach",
    "abstract": "The accuracy of coronary artery disease (CAD) diagnosis is dependent on a variety of factors, including demographic, symptom, and medical examination, ECG, and echocardiography data, among others. In this context, artificial intelligence (AI) can help clinicians identify high-risk patients early in the diagnostic process, by synthesizing information from multiple factors. To this aim, Machine Learning algorithms are used to classify patients based on their CAD disease risk. In this study, we contribute to this research filed by developing a methodology for balancing and augmenting data for more accurate prediction when the data is imbalanced and the sample size is small. The methodology can be used in a variety of other situations, particularly when data collection is expensive and the sample size is small. The experimental results revealed that the average accuracy of our proposed method for CAD prediction was 95.36, and was higher than random forest (RF), decision tree (DT), support vector machine (SVM), logistic regression (LR), and artificial neural network (ANN). ",
    "url": "https://arxiv.org/abs/2308.15339",
    "authors": [
      "Elham Nasarian",
      "Danial Sharifrazi",
      "Saman Mohsenirad",
      "Kwok Tsui",
      "Roohallah Alizadehsani"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15344",
    "title": "Imperceptible Adversarial Attack on Deep Neural Networks from Image  Boundary",
    "abstract": "Although Deep Neural Networks (DNNs), such as the convolutional neural networks (CNN) and Vision Transformers (ViTs), have been successfully applied in the field of computer vision, they are demonstrated to be vulnerable to well-sought Adversarial Examples (AEs) that can easily fool the DNNs. The research in AEs has been active, and many adversarial attacks and explanations have been proposed since they were discovered in 2014. The mystery of the AE's existence is still an open question, and many studies suggest that DNN training algorithms have blind spots. The salient objects usually do not overlap with boundaries; hence, the boundaries are not the DNN model's attention. Nevertheless, recent studies show that the boundaries can dominate the behavior of the DNN models. Hence, this study aims to look at the AEs from a different perspective and proposes an imperceptible adversarial attack that systemically attacks the input image boundary for finding the AEs. The experimental results have shown that the proposed boundary attacking method effectively attacks six CNN models and the ViT using only 32% of the input image content (from the boundaries) with an average success rate (SR) of 95.2% and an average peak signal-to-noise ratio of 41.37 dB. Correlation analyses are conducted, including the relation between the adversarial boundary's width and the SR and how the adversarial boundary changes the DNN model's attention. This paper's discoveries can potentially advance the understanding of AEs and provide a different perspective on how AEs can be constructed. ",
    "url": "https://arxiv.org/abs/2308.15344",
    "authors": [
      "Fahad Alrasheedi",
      "Xin Zhong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15346",
    "title": "Enhancing Mobile Face Anti-Spoofing: A Robust Framework for Diverse  Attack Types under Screen Flash",
    "abstract": "Face anti-spoofing (FAS) is crucial for securing face recognition systems. However, existing FAS methods with handcrafted binary or pixel-wise labels have limitations due to diverse presentation attacks (PAs). In this paper, we propose an attack type robust face anti-spoofing framework under light flash, called ATR-FAS. Due to imaging differences caused by various attack types, traditional FAS methods based on single binary classification network may result in excessive intra-class distance of spoof faces, leading to a challenge of decision boundary learning. Therefore, we employed multiple networks to reconstruct multi-frame depth maps as auxiliary supervision, and each network experts in one type of attack. A dual gate module (DGM) consisting of a type gate and a frame-attention gate is introduced, which perform attack type recognition and multi-frame attention generation, respectively. The outputs of DGM are utilized as weight to mix the result of multiple expert networks. The multi-experts mixture enables ATR-FAS to generate spoof-differentiated depth maps, and stably detects spoof faces without being affected by different types of PAs. Moreover, we design a differential normalization procedure to convert original flash frames into differential frames. This simple but effective processing enhances the details in flash frames, aiding in the generation of depth maps. To verify the effectiveness of our framework, we collected a large-scale dataset containing 12,660 live and spoof videos with diverse PAs under dynamic flash from the smartphone screen. Extensive experiments illustrate that the proposed ATR-FAS significantly outperforms existing state-of-the-art methods. The code and dataset will be available at https://github.com/Chaochao-Lin/ATR-FAS. ",
    "url": "https://arxiv.org/abs/2308.15346",
    "authors": [
      "Weihua Liu",
      "Chaochao Lin",
      "Yu Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15349",
    "title": "Lie-Poisson Neural Networks (LPNets): Data-Based Computing of  Hamiltonian Systems with Symmetries",
    "abstract": "An accurate data-based prediction of the long-term evolution of Hamiltonian systems requires a network that preserves the appropriate structure under each time step. Every Hamiltonian system contains two essential ingredients: the Poisson bracket and the Hamiltonian. Hamiltonian systems with symmetries, whose paradigm examples are the Lie-Poisson systems, have been shown to describe a broad category of physical phenomena, from satellite motion to underwater vehicles, fluids, geophysical applications, complex fluids, and plasma physics. The Poisson bracket in these systems comes from the symmetries, while the Hamiltonian comes from the underlying physics. We view the symmetry of the system as primary, hence the Lie-Poisson bracket is known exactly, whereas the Hamiltonian is regarded as coming from physics and is considered not known, or known approximately. Using this approach, we develop a network based on transformations that exactly preserve the Poisson bracket and the special functions of the Lie-Poisson systems (Casimirs) to machine precision. We present two flavors of such systems: one, where the parameters of transformations are computed from data using a dense neural network (LPNets), and another, where the composition of transformations is used as building blocks (G-LPNets). We also show how to adapt these methods to a larger class of Poisson brackets. We apply the resulting methods to several examples, such as rigid body (satellite) motion, underwater vehicles, a particle in a magnetic field, and others. The methods developed in this paper are important for the construction of accurate data-based methods for simulating the long-term dynamics of physical systems. ",
    "url": "https://arxiv.org/abs/2308.15349",
    "authors": [
      "Christopher Eldred",
      "François Gay-Balmaz",
      "Sofiia Huraka",
      "Vakhtang Putkaradze"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Mathematical Physics (math-ph)"
    ]
  },
  {
    "id": "arXiv:2308.15353",
    "title": "Detect, Augment, Compose, and Adapt: Four Steps for Unsupervised Domain  Adaptation in Object Detection",
    "abstract": "Unsupervised domain adaptation (UDA) plays a crucial role in object detection when adapting a source-trained detector to a target domain without annotated data. In this paper, we propose a novel and effective four-step UDA approach that leverages self-supervision and trains source and target data concurrently. We harness self-supervised learning to mitigate the lack of ground truth in the target domain. Our method consists of the following steps: (1) identify the region with the highest-confidence set of detections in each target image, which serve as our pseudo-labels; (2) crop the identified region and generate a collection of its augmented versions; (3) combine these latter into a composite image; (4) adapt the network to the target domain using the composed image. Through extensive experiments under cross-camera, cross-weather, and synthetic-to-real scenarios, our approach achieves state-of-the-art performance, improving upon the nearest competitor by more than 2% in terms of mean Average Precision (mAP). The code is available at https://github.com/MohamedTEV/DACA. ",
    "url": "https://arxiv.org/abs/2308.15353",
    "authors": [
      "Mohamed L. Mekhalfi",
      "Davide Boscaini",
      "Fabio Poiesi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15357",
    "title": "Ego-Motion Estimation and Dynamic Motion Separation from 3D Point Clouds  for Accumulating Data and Improving 3D Object Detection",
    "abstract": "New 3+1D high-resolution radar sensors are gaining importance for 3D object detection in the automotive domain due to their relative affordability and improved detection compared to classic low-resolution radar sensors. One limitation of high-resolution radar sensors, compared to lidar sensors, is the sparsity of the generated point cloud. This sparsity could be partially overcome by accumulating radar point clouds of subsequent time steps. This contribution analyzes limitations of accumulating radar point clouds on the View-of-Delft dataset. By employing different ego-motion estimation approaches, the dataset's inherent constraints, and possible solutions are analyzed. Additionally, a learning-based instance motion estimation approach is deployed to investigate the influence of dynamic motion on the accumulated point cloud for object detection. Experiments document an improved object detection performance by applying an ego-motion estimation and dynamic motion correction approach. ",
    "url": "https://arxiv.org/abs/2308.15357",
    "authors": [
      "Patrick Palmer",
      "Martin Krueger",
      "Richard Altendorfer",
      "Torsten Bertram"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15360",
    "title": "A Scalable Approach for Analysing Multi-Agent Systems with Heterogeneous  Stochastic Packet Loss",
    "abstract": "An important aspect in jointly analysing networked control systems and their communication is to model the networking in a sufficiently rich but at the same time mathematically tractable way. As such, this paper improves on a recently proposed scalable approach for analysing multi-agent systems with stochastic packet loss by allowing for heterogeneous transmission probabilities and temporal correlation in the communication model. The key idea is to consider the transmission probabilities as uncertain, which facilitates the use of tools from robust control. Due to being formulated in terms of linear matrix inequalities that grow linearly with the number of agents, the result is applicable to very large multi-agent systems, which is demonstrated by numerical simulations with up to 10000 agents. ",
    "url": "https://arxiv.org/abs/2308.15360",
    "authors": [
      "Christian Hespe",
      "Herbert Werner"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2308.15364",
    "title": "Heterogeneous Multi-Task Gaussian Cox Processes",
    "abstract": "This paper presents a novel extension of multi-task Gaussian Cox processes for modeling multiple heterogeneous correlated tasks jointly, e.g., classification and regression, via multi-output Gaussian processes (MOGP). A MOGP prior over the parameters of the dedicated likelihoods for classification, regression and point process tasks can facilitate sharing of information between heterogeneous tasks, while allowing for nonparametric parameter estimation. To circumvent the non-conjugate Bayesian inference in the MOGP modulated heterogeneous multi-task framework, we employ the data augmentation technique and derive a mean-field approximation to realize closed-form iterative updates for estimating model parameters. We demonstrate the performance and inference on both 1D synthetic data as well as 2D urban data of Vancouver. ",
    "url": "https://arxiv.org/abs/2308.15364",
    "authors": [
      "Feng Zhou",
      "Quyu Kong",
      "Zhijie Deng",
      "Fengxiang He",
      "Peng Cui",
      "Jun Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.15378",
    "title": "On the Robustness of Object Detection Models in Aerial Images",
    "abstract": "The robustness of object detection models is a major concern when applied to real-world scenarios. However, the performance of most object detection models degrades when applied to images subjected to corruptions, since they are usually trained and evaluated on clean datasets. Enhancing the robustness of object detection models is of utmost importance, especially for those designed for aerial images, which feature complex backgrounds, substantial variations in scales and orientations of objects. This paper addresses the challenge of assessing the robustness of object detection models in aerial images, with a specific emphasis on scenarios where images are affected by clouds. In this study, we introduce two novel benchmarks based on DOTA-v1.0. The first benchmark encompasses 19 prevalent corruptions, while the second focuses on cloud-corrupted images-a phenomenon uncommon in natural pictures yet frequent in aerial photography. We systematically evaluate the robustness of mainstream object detection models and perform numerous ablation experiments. Through our investigations, we find that enhanced model architectures, larger networks, well-crafted modules, and judicious data augmentation strategies collectively enhance the robustness of aerial object detection models. The benchmarks we propose and our comprehensive experimental analyses can facilitate research on robust object detection in aerial images. Codes and datasets are available at: (https://github.com/hehaodong530/DOTA-C) ",
    "url": "https://arxiv.org/abs/2308.15378",
    "authors": [
      "Haodong He",
      "Jian Ding",
      "Gui-Song Xia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15390",
    "title": "Bayesian Integration of Information Using Top-Down Modulated WTA  Networks",
    "abstract": "Winner Take All (WTA) circuits a type of Spiking Neural Networks (SNN) have been suggested as facilitating the brain's ability to process information in a Bayesian manner. Research has shown that WTA circuits are capable of approximating hierarchical Bayesian models via Expectation Maximization (EM). So far, research in this direction has focused on bottom up processes. This is contrary to neuroscientific evidence that shows that, besides bottom up processes, top down processes too play a key role in information processing by the human brain. Several functions ascribed to top down processes include direction of attention, adjusting for expectations, facilitation of encoding and recall of learned information, and imagery. This paper explores whether WTA circuits are suitable for further integrating information represented in separate WTA networks. Furthermore, it explores whether, and under what circumstances, top down processes can improve WTA network performance with respect to inference and learning. The results show that WTA circuits are capable of integrating the probabilistic information represented by other WTA networks, and that top down processes can improve a WTA network's inference and learning performance. Notably, it is able to do this according to key neuromorphic principles, making it ideal for low-latency and energy efficient implementation on neuromorphic hardware. ",
    "url": "https://arxiv.org/abs/2308.15390",
    "authors": [
      "Otto van der Himst",
      "Leila Bagheriye",
      "Johan Kwisthout"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15395",
    "title": "The CausalBench challenge: A machine learning contest for gene network  inference from single-cell perturbation data",
    "abstract": "In drug discovery, mapping interactions between genes within cellular systems is a crucial early step. This helps formulate hypotheses regarding molecular mechanisms that could potentially be targeted by future medicines. The CausalBench Challenge was an initiative to invite the machine learning community to advance the state of the art in constructing gene-gene interaction networks. These networks, derived from large-scale, real-world datasets of single cells under various perturbations, are crucial for understanding the causal mechanisms underlying disease biology. Using the framework provided by the CausalBench benchmark, participants were tasked with enhancing the capacity of the state of the art methods to leverage large-scale genetic perturbation data. This report provides an analysis and summary of the methods submitted during the challenge to give a partial image of the state of the art at the time of the challenge. The winning solutions significantly improved performance compared to previous baselines, establishing a new state of the art for this critical task in biology and medicine. ",
    "url": "https://arxiv.org/abs/2308.15395",
    "authors": [
      "Mathieu Chevalley",
      "Jacob Sackett-Sanders",
      "Yusuf Roohani",
      "Pascal Notin",
      "Artemy Bakulin",
      "Dariusz Brzezinski",
      "Kaiwen Deng",
      "Yuanfang Guan",
      "Justin Hong",
      "Michael Ibrahim",
      "Wojciech Kotlowski",
      "Marcin Kowiel",
      "Panagiotis Misiakos",
      "Achille Nazaret",
      "Markus Püschel",
      "Chris Wendler",
      "Arash Mehrjou",
      "Patrick Schwab"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Molecular Networks (q-bio.MN)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2308.15397",
    "title": "Color Aesthetics: Fuzzy based User-driven Method for Harmony and  Preference Prediction",
    "abstract": "Color is the most important intrinsic sensory feature that has a powerful impact on product sales. Color is even responsible for raising the aesthetic senses in our brains. Account for individual differences is crucial in color aesthetics. It requires user-driven mechanisms for various e-commerce applications. We propose a method for quantitative evaluation of all types of perceptual responses to color(s): distinct color preference, color harmony, and color combination preference. Preference for color schemes can be predicted by combining preferences for the basic colors and ratings of color harmony. Harmonious pallets are extracted from big data set using comparison algorithms based on fuzzy similarity and grouping. The proposed model results in useful predictions of harmony and preference of multicolored images. For example, in the context of apparel coordination, it allows predicting a preference for a look based on clothing colors. Our approach differs from standard aesthetic models, since in accounts for a personal variation. In addition, it can process not only lower-order color pairs, but also groups of several colors. ",
    "url": "https://arxiv.org/abs/2308.15397",
    "authors": [
      "Pakizar Shamoi",
      "Atsushi Inoue",
      "Hiroharu Kawanaka"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15405",
    "title": "Robust Long-Tailed Learning via Label-Aware Bounded CVaR",
    "abstract": "Data in the real-world classification problems are always imbalanced or long-tailed, wherein the majority classes have the most of the samples that dominate the model training. In such setting, the naive model tends to have poor performance on the minority classes. Previously, a variety of loss modifications have been proposed to address the long-tailed leaning problem, while these methods either treat the samples in the same class indiscriminatingly or lack a theoretical guarantee. In this paper, we propose two novel approaches based on CVaR (Conditional Value at Risk) to improve the performance of long-tailed learning with a solid theoretical ground. Specifically, we firstly introduce a Label-Aware Bounded CVaR (LAB-CVaR) loss to overcome the pessimistic result of the original CVaR, and further design the optimal weight bounds for LAB-CVaR theoretically. Based on LAB-CVaR, we additionally propose a LAB-CVaR with logit adjustment (LAB-CVaR-logit) loss to stabilize the optimization process, where we also offer the theoretical support. Extensive experiments on real-world datasets with long-tailed label distributions verify the superiority of our proposed methods. ",
    "url": "https://arxiv.org/abs/2308.15405",
    "authors": [
      "Hong Zhu",
      "Runpeng Yu",
      "Xing Tang",
      "Yifei Wang",
      "Yuan Fang",
      "Yisen Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2308.15441",
    "title": "Adversarial Low Degree Testing",
    "abstract": "In the $t$-online-erasure model in property testing, an adversary is allowed to erase $t$ values of a queried function for each query the tester makes. This model was recently formulated by Kalemaj, Raskhodnikova andVarma, who showed that the properties of linearity of functions as well as quadraticity can be tested in$O_t(1)$ many queries: $O(\\log (t))$ for linearity and $2^{2^{O(t)}}$ for quadraticity. They asked whether the more general property of low-degreeness can be tested in the online erasure model, whether better testers exist for quadraticity, and if similar results hold when ``erasures'' are replaced with ``corruptions''. We show that, in the $t$-online-erasure model, for a prime power $q$, given query access to a function $f: \\mathbb{F}_q^n \\xrightarrow[]{} \\mathbb{F}_q$, one can distinguish in $\\mathrm{poly}(\\log^{d+q}(t)/\\delta)$ queries between the case that $f$ is degree at most $d$, and the case that $f$ is $\\delta$-far from any degree $d$ function (with respect to the fractional hamming distance). This answers the aforementioned questions and brings the query complexity to nearly match the query complexity of low-degree testing in the classical property testing model. Our results are based on the observation that the property of low-degreeness admits a large and versatile family of query efficient testers. Our testers operates by querying a uniformly random, sufficiently large set of points in a large enough affine subspace, and finding a tester for low-degreeness that only utilizes queries from that set of points. We believe that this tester may find other applications to algorithms in the online-erasure model or other related models, and may be of independent interest. ",
    "url": "https://arxiv.org/abs/2308.15441",
    "authors": [
      "Dor Minzer",
      "Kai Zhe Zheng"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2308.15448",
    "title": "Vulgar Remarks Detection in Chittagonian Dialect of Bangla",
    "abstract": "The negative effects of online bullying and harassment are increasing with Internet popularity, especially in social media. One solution is using natural language processing (NLP) and machine learning (ML) methods for the automatic detection of harmful remarks, but these methods are limited in low-resource languages like the Chittagonian dialect of Bangla.This study focuses on detecting vulgar remarks in social media using supervised ML and deep learning algorithms.Logistic Regression achieved promising accuracy (0.91) while simple RNN with Word2vec and fastTex had lower accuracy (0.84-0.90), highlighting the issue that NN algorithms require more data. ",
    "url": "https://arxiv.org/abs/2308.15448",
    "authors": [
      "Tanjim Mahmud",
      "Michal Ptaszynski",
      "Fumito Masui"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.15453",
    "title": "Pseudo-Boolean Polynomials Approach To Edge Detection And Image  Segmentation",
    "abstract": "We introduce a deterministic approach to edge detection and image segmentation by formulating pseudo-Boolean polynomials on image patches. The approach works by applying a binary classification of blob and edge regions in an image based on the degrees of pseudo-Boolean polynomials calculated on patches extracted from the provided image. We test our method on simple images containing primitive shapes of constant and contrasting colour and establish the feasibility before applying it to complex instances like aerial landscape images. The proposed method is based on the exploitation of the reduction, polynomial degree, and equivalence properties of penalty-based pseudo-Boolean polynomials. ",
    "url": "https://arxiv.org/abs/2308.15453",
    "authors": [
      "Tendai Mapungwana Chikake",
      "Boris Goldengorin",
      "Alexey Samosyuk"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2308.15461",
    "title": "Canonical Factors for Hybrid Neural Fields",
    "abstract": "Factored feature volumes offer a simple way to build more compact, efficient, and intepretable neural fields, but also introduce biases that are not necessarily beneficial for real-world data. In this work, we (1) characterize the undesirable biases that these architectures have for axis-aligned signals -- they can lead to radiance field reconstruction differences of as high as 2 PSNR -- and (2) explore how learning a set of canonicalizing transformations can improve representations by removing these biases. We prove in a two-dimensional model problem that simultaneously learning these transformations together with scene appearance succeeds with drastically improved efficiency. We validate the resulting architectures, which we call TILTED, using image, signed distance, and radiance field reconstruction tasks, where we observe improvements across quality, robustness, compactness, and runtime. Results demonstrate that TILTED can enable capabilities comparable to baselines that are 2x larger, while highlighting weaknesses of neural field evaluation procedures. ",
    "url": "https://arxiv.org/abs/2308.15461",
    "authors": [
      "Brent Yi",
      "Weijia Zeng",
      "Sam Buchanan",
      "Yi Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2308.15469",
    "title": "Multimodal Contrastive Learning and Tabular Attention for Automated  Alzheimer's Disease Prediction",
    "abstract": "Alongside neuroimaging such as MRI scans and PET, Alzheimer's disease (AD) datasets contain valuable tabular data including AD biomarkers and clinical assessments. Existing computer vision approaches struggle to utilize this additional information. To address these needs, we propose a generalizable framework for multimodal contrastive learning of image data and tabular data, a novel tabular attention module for amplifying and ranking salient features in tables, and the application of these techniques onto Alzheimer's disease prediction. Experimental evaulations demonstrate the strength of our framework by detecting Alzheimer's disease (AD) from over 882 MR image slices from the ADNI database. We take advantage of the high interpretability of tabular data and our novel tabular attention approach and through attribution of the attention scores for each row of the table, we note and rank the most predominant features. Results show that the model is capable of an accuracy of over 83.8%, almost a 10% increase from previous state of the art. ",
    "url": "https://arxiv.org/abs/2308.15469",
    "authors": [
      "Weichen Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15473",
    "title": "Graph Theory and its Uses in Graph Algorithms and Beyond",
    "abstract": "Graphs are fundamental objects that find widespread applications across computer science and beyond. Graph Theory has yielded deep insights about structural properties of various families of graphs, which are leveraged in the design and analysis of algorithms for graph optimization problems and other computational optimization problems. These insights have also proved helpful in understanding the limits of efficient computation by providing constructions of hard problem instances. At the same time, algorithmic tools and techniques provide a fresh perspective on graph theoretic problems, often leading to novel discoveries. In this thesis, we exploit this symbiotic relationship between graph theory and algorithms for graph optimization problems and beyond. This thesis consists of three parts. In the first part, we study a graph routing problem called the Node-Disjoint Paths (NDP) problem. Given a graph and a set of source-destination pairs of its vertices, the goal is to route the maximum number of pairs via node-disjoint paths. We come close to resolving the approximability of NDP by showing that it is $n^{\\Omega(1/poly\\log\\log n)}$-hard to approximate, even on grid graphs, where n is the number of vertices. In the second part of this thesis, we use graph decomposition techniques developed for efficient algorithms to derive a graph theoretic result. We show that for every n-vertex expander graph G, if H is any graph with at most $O(n/\\log n)$ vertices and edges, then H is a minor of G. In the last part, we show that the graph theoretic tools and graph algorithmic techniques can shed light on problems seemingly unrelated to graphs. We show that the randomized space complexity of the Longest Increasing Subsequence (LIS) problem in the streaming model is intrinsically tied to the query-complexity of the Non-Crossing Matching problem on graphs in a new model of computation that we define. ",
    "url": "https://arxiv.org/abs/2308.15473",
    "authors": [
      "Rachit Nimavat"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2308.15474",
    "title": "A General-Purpose Self-Supervised Model for Computational Pathology",
    "abstract": "Tissue phenotyping is a fundamental computational pathology (CPath) task in learning objective characterizations of histopathologic biomarkers in anatomic pathology. However, whole-slide imaging (WSI) poses a complex computer vision problem in which the large-scale image resolutions of WSIs and the enormous diversity of morphological phenotypes preclude large-scale data annotation. Current efforts have proposed using pretrained image encoders with either transfer learning from natural image datasets or self-supervised pretraining on publicly-available histopathology datasets, but have not been extensively developed and evaluated across diverse tissue types at scale. We introduce UNI, a general-purpose self-supervised model for pathology, pretrained using over 100 million tissue patches from over 100,000 diagnostic haematoxylin and eosin-stained WSIs across 20 major tissue types, and evaluated on 33 representative CPath clinical tasks in CPath of varying diagnostic difficulties. In addition to outperforming previous state-of-the-art models, we demonstrate new modeling capabilities in CPath such as resolution-agnostic tissue classification, slide classification using few-shot class prototypes, and disease subtyping generalization in classifying up to 108 cancer types in the OncoTree code classification system. UNI advances unsupervised representation learning at scale in CPath in terms of both pretraining data and downstream evaluation, enabling data-efficient AI models that can generalize and transfer to a gamut of diagnostically-challenging tasks and clinical workflows in anatomic pathology. ",
    "url": "https://arxiv.org/abs/2308.15474",
    "authors": [
      "Richard J. Chen",
      "Tong Ding",
      "Ming Y. Lu",
      "Drew F. K. Williamson",
      "Guillaume Jaume",
      "Bowen Chen",
      "Andrew Zhang",
      "Daniel Shao",
      "Andrew H. Song",
      "Muhammad Shaban",
      "Mane Williams",
      "Anurag Vaidya",
      "Sharifa Sahai",
      "Lukas Oldenburg",
      "Luca L. Weishaupt",
      "Judy J. Wang",
      "Walt Williams",
      "Long Phi Le",
      "Georg Gerber",
      "Faisal Mahmood"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Tissues and Organs (q-bio.TO)"
    ]
  },
  {
    "id": "arXiv:2308.15478",
    "title": "An Adaptive Tangent Feature Perspective of Neural Networks",
    "abstract": "In order to better understand feature learning in neural networks, we propose a framework for understanding linear models in tangent feature space where the features are allowed to be transformed during training. We consider linear transformations of features, resulting in a joint optimization over parameters and transformations with a bilinear interpolation constraint. We show that this optimization problem has an equivalent linearly constrained optimization with structured regularization that encourages approximately low rank solutions. Specializing to neural network structure, we gain insights into how the features and thus the kernel function change, providing additional nuance to the phenomenon of kernel alignment when the target function is poorly represented using tangent features. In addition to verifying our theoretical observations in real neural networks on a simple regression problem, we empirically show that an adaptive feature implementation of tangent feature classification has an order of magnitude lower sample complexity than the fixed tangent feature model on MNIST and CIFAR-10. ",
    "url": "https://arxiv.org/abs/2308.15478",
    "authors": [
      "Daniel LeJeune",
      "Sina Alemohammad"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15479",
    "title": "3D Adversarial Augmentations for Robust Out-of-Domain Predictions",
    "abstract": "Since real-world training datasets cannot properly sample the long tail of the underlying data distribution, corner cases and rare out-of-domain samples can severely hinder the performance of state-of-the-art models. This problem becomes even more severe for dense tasks, such as 3D semantic segmentation, where points of non-standard objects can be confidently associated to the wrong class. In this work, we focus on improving the generalization to out-of-domain data. We achieve this by augmenting the training set with adversarial examples. First, we learn a set of vectors that deform the objects in an adversarial fashion. To prevent the adversarial examples from being too far from the existing data distribution, we preserve their plausibility through a series of constraints, ensuring sensor-awareness and shapes smoothness. Then, we perform adversarial augmentation by applying the learned sample-independent vectors to the available objects when training a model. We conduct extensive experiments across a variety of scenarios on data from KITTI, Waymo, and CrashD for 3D object detection, and on data from SemanticKITTI, Waymo, and nuScenes for 3D semantic segmentation. Despite training on a standard single dataset, our approach substantially improves the robustness and generalization of both 3D object detection and 3D semantic segmentation methods to out-of-domain data. ",
    "url": "https://arxiv.org/abs/2308.15479",
    "authors": [
      "Alexander Lehner",
      "Stefano Gasperini",
      "Alvaro Marcos-Ramiro",
      "Michael Schmidt",
      "Nassir Navab",
      "Benjamin Busam",
      "Federico Tombari"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.13604",
    "title": "Network science Ising states of matter",
    "abstract": "Network science provides very powerful tools for extracting information from interacting data. Although recently the unsupervised detection of phases of matter using machine learning has raised significant interest, the full prediction power of network science has not yet been systematically explored in this context. Here we fill this gap by providing an in-depth statistical, combinatorial, geometrical and topological characterization of 2D Ising snapshot networks (IsingNets) extracted from Monte Carlo simulations of the 2D Ising model at different temperatures, going across the phase transition. Our analysis reveals the complex organization properties of IsingNets in both the ferromagnetic and paramagnetic phases and demonstrates the significant deviations of the IsingNets with respect to randomized null models. In particular percolation properties of the IsingNets reflect the existence of the symmetry between configurations with opposite magnetization below the critical temperature and the very compact nature of the two emerging giant clusters revealed by our persistent homology analysis of the IsingNets. Moreover, the IsingNets display a very broad degree distribution and significant degree-degree correlations and weight-degree correlations demonstrating that they encode relevant information present in the configuration space of the 2D Ising model. The geometrical organization of the critical IsingNets is reflected in their spectral properties deviating from the one of the null model. This work reveals the important insights that network science can bring to the characterization of phases of matter. The set of tools described hereby can be applied as well to numerical and experimental data. ",
    "url": "https://arxiv.org/abs/2308.13604",
    "authors": [
      "Hanlin Sun",
      "Rajat Kumar Panda",
      "Roberto Verdel",
      "Alex Rodriguez",
      "Marcello Dalmonte",
      "Ginestra Bianconi"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Social and Information Networks (cs.SI)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2308.14774",
    "title": "EEG-Derived Voice Signature for Attended Speaker Detection",
    "abstract": "\\textit{Objective:} Conventional EEG-based auditory attention detection (AAD) is achieved by comparing the time-varying speech stimuli and the elicited EEG signals. However, in order to obtain reliable correlation values, these methods necessitate a long decision window, resulting in a long detection latency. Humans have a remarkable ability to recognize and follow a known speaker, regardless of the spoken content. In this paper, we seek to detect the attended speaker among the pre-enrolled speakers from the elicited EEG signals. In this manner, we avoid relying on the speech stimuli for AAD at run-time. In doing so, we propose a novel EEG-based attended speaker detection (E-ASD) task. \\textit{Methods:} We encode a speaker's voice with a fixed dimensional vector, known as speaker embedding, and project it to an audio-derived voice signature, which characterizes the speaker's unique voice regardless of the spoken content. We hypothesize that such a voice signature also exists in the listener's brain that can be decoded from the elicited EEG signals, referred to as EEG-derived voice signature. By comparing the audio-derived voice signature and the EEG-derived voice signature, we are able to effectively detect the attended speaker in the listening brain. \\textit{Results:} Experiments show that E-ASD can effectively detect the attended speaker from the 0.5s EEG decision windows, achieving 99.78\\% AAD accuracy, 99.94\\% AUC, and 0.27\\% EER. \\textit{Conclusion:} We conclude that it is possible to derive the attended speaker's voice signature from the EEG signals so as to detect the attended speaker in a listening brain. \\textit{Significance:} We present the first proof of concept for detecting the attended speaker from the elicited EEG signals in a cocktail party environment. The successful implementation of E-ASD marks a non-trivial, but crucial step towards smart hearing aids. ",
    "url": "https://arxiv.org/abs/2308.14774",
    "authors": [
      "Hongxu Zhu",
      "Siqi Cai",
      "Yidi Jiang",
      "Qiquan Zhang",
      "Haizhou Li"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2308.14789",
    "title": "Scattering with Neural Operators",
    "abstract": "Recent advances in machine learning establish the ability of certain neural-network architectures called neural operators to approximate maps between function spaces. Motivated by a prospect of employing them in fundamental physics, we examine applications to scattering processes in quantum mechanics. We use an iterated variant of Fourier neural operators to learn the physics of Schr\\\"odinger operators, which map from the space of initial wave functions and potentials to the final wave functions. These deep operator learning ideas are put to test in two concrete problems: a neural operator predicting the time evolution of a wave packet scattering off a central potential in $1+1$ dimensions, and the double-slit experiment in $2+1$ dimensions. At inference, neural operators can become orders of magnitude more efficient compared to traditional finite-difference solvers. ",
    "url": "https://arxiv.org/abs/2308.14789",
    "authors": [
      "Sebastian Mizera"
    ],
    "subjectives": [
      "High Energy Physics - Theory (hep-th)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2308.14920",
    "title": "Matbench Discovery -- An evaluation framework for machine learning  crystal stability prediction",
    "abstract": "Matbench Discovery simulates the deployment of machine learning (ML) energy models in a high-throughput search for stable inorganic crystals. We address the disconnect between (i) thermodynamic stability and formation energy and (ii) in-domain vs out-of-distribution performance. Alongside this paper, we publish a Python package to aid with future model submissions and a growing online leaderboard with further insights into trade-offs between various performance metrics. To answer the question which ML methodology performs best at materials discovery, our initial release explores a variety of models including random forests, graph neural networks (GNN), one-shot predictors, iterative Bayesian optimizers and universal interatomic potentials (UIP). Ranked best-to-worst by their test set F1 score on thermodynamic stability prediction, we find CHGNet > M3GNet > MACE > ALIGNN > MEGNet > CGCNN > CGCNN+P > Wrenformer > BOWSR > Voronoi tessellation fingerprints with random forest. The top 3 models are UIPs, the winning methodology for ML-guided materials discovery, achieving F1 scores of ~0.6 for crystal stability classification and discovery acceleration factors (DAF) of up to 5x on the first 10k most stable predictions compared to dummy selection from our test set. We also highlight a sharp disconnect between commonly used global regression metrics and more task-relevant classification metrics. Accurate regressors are susceptible to unexpectedly high false-positive rates if those accurate predictions lie close to the decision boundary at 0 eV/atom above the convex hull where most materials are. Our results highlight the need to focus on classification metrics that actually correlate with improved stability hit rate. ",
    "url": "https://arxiv.org/abs/2308.14920",
    "authors": [
      "Janosh Riebesell",
      "Rhys E. A. Goodall",
      "Anubhav Jain",
      "Philipp Benner",
      "Kristin A. Persson",
      "Alpha A. Lee"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.14935",
    "title": "Distributionally Robust Variational Quantum Algorithms with Shifted  Noise",
    "abstract": "Given their potential to demonstrate near-term quantum advantage, variational quantum algorithms (VQAs) have been extensively studied. Although numerous techniques have been developed for VQA parameter optimization, it remains a significant challenge. A practical issue is the high sensitivity of quantum noise to environmental changes, and its propensity to shift in real time. This presents a critical problem as an optimized VQA ansatz may not perform effectively under a different noise environment. For the first time, we explore how to optimize VQA parameters to be robust against unknown shifted noise. We model the noise level as a random variable with an unknown probability density function (PDF), and we assume that the PDF may shift within an uncertainty set. This assumption guides us to formulate a distributionally robust optimization problem, with the goal of finding parameters that maintain effectiveness under shifted noise. We utilize a distributionally robust Bayesian optimization solver for our proposed formulation. This provides numerical evidence in both the Quantum Approximate Optimization Algorithm (QAOA) and the Variational Quantum Eigensolver (VQE) with hardware-efficient ansatz, indicating that we can identify parameters that perform more robustly under shifted noise. We regard this work as the first step towards improving the reliability of VQAs influenced by real-time noise. ",
    "url": "https://arxiv.org/abs/2308.14935",
    "authors": [
      "Zichang He",
      "Bo Peng",
      "Yuri Alexeev",
      "Zheng Zhang"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2308.14941",
    "title": "Borel versions of the Local Lemma and LOCAL algorithms for graphs of  finite asymptotic separation index",
    "abstract": "Asymptotic separation index is a parameter that measures how easily a Borel graph can be approximated by its subgraphs with finite components. In contrast to the more classical notion of hyperfiniteness, asymptotic separation index is well-suited for combinatorial applications in the Borel setting. The main result of this paper is a Borel version of the Lov\\'asz Local Lemma -- a powerful general-purpose tool in probabilistic combinatorics -- under a finite asymptotic separation index assumption. As a consequence, we show that locally checkable labeling problems that are solvable by efficient randomized distributed algorithms admit Borel solutions on bounded degree Borel graphs with finite asymptotic separation index. From this we derive a number of corollaries, for example a Borel version of Brooks's theorem for graphs with finite asymptotic separation index. ",
    "url": "https://arxiv.org/abs/2308.14941",
    "authors": [
      "Anton Bernshteyn",
      "Felix Weilacher"
    ],
    "subjectives": [
      "Logic (math.LO)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2308.15019",
    "title": "Pyramid diffractive optical networks for unidirectional magnification  and demagnification",
    "abstract": "Diffractive deep neural networks (D2NNs) are composed of successive transmissive layers optimized using supervised deep learning to all-optically implement various computational tasks between an input and output field-of-view (FOV). Here, we present a pyramid-structured diffractive optical network design (which we term P-D2NN), optimized specifically for unidirectional image magnification and demagnification. In this P-D2NN design, the diffractive layers are pyramidally scaled in alignment with the direction of the image magnification or demagnification. Our analyses revealed the efficacy of this P-D2NN design in unidirectional image magnification and demagnification tasks, producing high-fidelity magnified or demagnified images in only one direction, while inhibiting the image formation in the opposite direction - confirming the desired unidirectional imaging operation. Compared to the conventional D2NN designs with uniform-sized successive diffractive layers, P-D2NN design achieves similar performance in unidirectional magnification tasks using only half of the diffractive degrees of freedom within the optical processor volume. Furthermore, it maintains its unidirectional image magnification/demagnification functionality across a large band of illumination wavelengths despite being trained with a single illumination wavelength. With this pyramidal architecture, we also designed a wavelength-multiplexed diffractive network, where a unidirectional magnifier and a unidirectional demagnifier operate simultaneously in opposite directions, at two distinct illumination wavelengths. The efficacy of the P-D2NN architecture was also validated experimentally using monochromatic terahertz illumination, successfully matching our numerical simulations. P-D2NN offers a physics-inspired strategy for designing task-specific visual processors. ",
    "url": "https://arxiv.org/abs/2308.15019",
    "authors": [
      "Bijie Bai",
      "Xilin Yang",
      "Tianyi Gan",
      "Jingxi Li",
      "Deniz Mengu",
      "Mona Jarrahi",
      "Aydogan Ozcan"
    ],
    "subjectives": [
      "Optics (physics.optics)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Applied Physics (physics.app-ph)"
    ]
  },
  {
    "id": "arXiv:2308.15088",
    "title": "Using deep learning for an automatic detection and classification of the  vascular bifurcations along the Circle of Willis",
    "abstract": "Most of the intracranial aneurysms (ICA) occur on a specific portion of the cerebral vascular tree named the Circle of Willis (CoW). More particularly, they mainly arise onto fifteen of the major arterial bifurcations constituting this circular structure. Hence, for an efficient and timely diagnosis it is critical to develop some methods being able to accurately recognize each Bifurcation of Interest (BoI). Indeed, an automatic extraction of the bifurcations presenting the higher risk of developing an ICA would offer the neuroradiologists a quick glance at the most alarming areas. Due to the recent efforts on Artificial Intelligence, Deep Learning turned out to be the best performing technology for many pattern recognition tasks. Moreover, various methods have been particularly designed for medical image analysis purposes. This study intends to assist the neuroradiologists to promptly locate any bifurcation presenting a high risk of ICA occurrence. It can be seen as a Computer Aided Diagnosis scheme, where the Artificial Intelligence facilitates the access to the regions of interest within the MRI. In this work, we propose a method for a fully automatic detection and recognition of the bifurcations of interest forming the Circle of Willis. Several neural networks architectures have been tested, and we thoroughly evaluate the bifurcation recognition rate. ",
    "url": "https://arxiv.org/abs/2308.15088",
    "authors": [
      "Rafic Nader",
      "Romain Bourcier",
      "Florent Autrusseau"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2308.15172",
    "title": "Is visual explanation with Grad-CAM more reliable for deeper neural  networks? a case study with automatic pneumothorax diagnosis",
    "abstract": "While deep learning techniques have provided the state-of-the-art performance in various clinical tasks, explainability regarding their decision-making process can greatly enhance the credence of these methods for safer and quicker clinical adoption. With high flexibility, Gradient-weighted Class Activation Mapping (Grad-CAM) has been widely adopted to offer intuitive visual interpretation of various deep learning models' reasoning processes in computer-assisted diagnosis. However, despite the popularity of the technique, there is still a lack of systematic study on Grad-CAM's performance on different deep learning architectures. In this study, we investigate its robustness and effectiveness across different popular deep learning models, with a focus on the impact of the networks' depths and architecture types, by using a case study of automatic pneumothorax diagnosis in X-ray scans. Our results show that deeper neural networks do not necessarily contribute to a strong improvement of pneumothorax diagnosis accuracy, and the effectiveness of GradCAM also varies among different network architectures. ",
    "url": "https://arxiv.org/abs/2308.15172",
    "authors": [
      "Zirui Qiu",
      "Hassan Rivaz",
      "Yiming Xiao"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15386",
    "title": "Shape-Margin Knowledge Augmented Network for Thyroid Nodule Segmentation  and Diagnosis",
    "abstract": "Thyroid nodule segmentation is a crucial step in the diagnostic procedure of physicians and computer-aided diagnosis systems. Mostly, current studies treat segmentation and diagnosis as independent tasks without considering the correlation between these tasks. The sequence steps of these independent tasks in computer-aided diagnosis systems may lead to the accumulation of errors. Therefore, it is worth combining them as a whole through exploring the relationship between thyroid nodule segmentation and diagnosis. According to the thyroid imaging reporting and data system (TI-RADS), the assessment of shape and margin characteristics is the prerequisite for the discrimination of benign and malignant thyroid nodules. These characteristics can be observed in the thyroid nodule segmentation masks. Inspired by the diagnostic procedure of TI-RADS, this paper proposes a shape-margin knowledge augmented network (SkaNet) for simultaneously thyroid nodule segmentation and diagnosis. Due to the similarity in visual features between segmentation and diagnosis, SkaNet shares visual features in the feature extraction stage and then utilizes a dual-branch architecture to perform thyroid nodule segmentation and diagnosis tasks simultaneously. To enhance effective discriminative features, an exponential mixture module is devised, which incorporates convolutional feature maps and self-attention maps by exponential weighting. Then, SkaNet is jointly optimized by a knowledge augmented multi-task loss function with a constraint penalty term. It embeds shape and margin characteristics through numerical computation and models the relationship between the thyroid nodule diagnosis results and segmentation masks. ",
    "url": "https://arxiv.org/abs/2308.15386",
    "authors": [
      "Weihua Liu",
      "Chaochao Lin"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15437",
    "title": "Existence of Pauli-like stabilizers for every quantum error-correcting  code",
    "abstract": "The Pauli stabilizer formalism is perhaps the most thoroughly studied means of procuring quantum error-correcting codes, whereby the code is obtained through commutative Pauli operators and ``stabilized'' by them. In this work we will show that every quantum error-correcting code, including Pauli stabilizer codes and subsystem codes, has a similar structure, in that the code can be stabilized by commutative ``Paulian'' operators which share many features with Pauli operators and which form a \\textbf{Paulian stabilizer group}. By facilitating a controlled gate we can measure these Paulian operators to acquire the error syndrome. Examples concerning codeword stabilized codes and bosonic codes will be presented; specifically, one of the examples has been demonstrated experimentally and the observable for detecting the error turns out to be Paulian, thereby showing the potential utility of this approach. This work provides a possible approach to implement error-correcting codes and to find new codes. ",
    "url": "https://arxiv.org/abs/2308.15437",
    "authors": [
      "Jhih-Yuan Kao",
      "Hsi-Sheng Goan"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2007.08600",
    "title": "Denial-of-Service Vulnerability of Hash-based Transaction Sharding:  Attack and Countermeasure",
    "abstract": " Comments: Revise spelling and grammar | Published in IEEE Transactions on Computers ",
    "url": "https://arxiv.org/abs/2007.08600",
    "authors": [
      "Truc Nguyen",
      "My T. Thai"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2011.01710",
    "title": "Ballistocardiogram artifact removal in simultaneous EEG-fMRI using  generative adversarial network",
    "abstract": " Title: Ballistocardiogram artifact removal in simultaneous EEG-fMRI using  generative adversarial network ",
    "url": "https://arxiv.org/abs/2011.01710",
    "authors": [
      "Guang Lin",
      "Jianhai Zhang",
      "Yuxi Liu",
      "Tianyang Gao",
      "Wanzeng Kong",
      "Xu Lei",
      "Tao Qiu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2101.10867",
    "title": "On metrics robust to noise, perturbations, and changes in projection  angle",
    "abstract": " Title: On metrics robust to noise, perturbations, and changes in projection  angle ",
    "url": "https://arxiv.org/abs/2101.10867",
    "authors": [
      "William Leeb"
    ],
    "subjectives": [
      "Functional Analysis (math.FA)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2110.01005",
    "title": "Cerberus: Query-driven Scalable Vulnerability Detection in OAuth Service  Provider Implementations",
    "abstract": " Comments: Appeared in ACM Conference on Computer and Communications Security (CCS 2022). Please cite the conference version ",
    "url": "https://arxiv.org/abs/2110.01005",
    "authors": [
      "Tamjid Al Rahat",
      "Yu Feng",
      "Yuan Tian"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2112.01694",
    "title": "On the Existence of the Adversarial Bayes Classifier (Extended Version)",
    "abstract": " Comments: 27 pages, 3 figures. Version 2: Corrects 2 errors in the paper \"On the Existence of the Adversarial Bayes Classifier\" published in NeurIPS. Version 3: Update to acknowledgements ",
    "url": "https://arxiv.org/abs/2112.01694",
    "authors": [
      "Pranjal Awasthi",
      "Natalie S. Frank",
      "Mehryar Mohri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2201.06313",
    "title": "A Deep Convolutional Neural Networks Based Multi-Task Ensemble Model for  Aspect and Polarity Classification in Persian Reviews",
    "abstract": " Title: A Deep Convolutional Neural Networks Based Multi-Task Ensemble Model for  Aspect and Polarity Classification in Persian Reviews ",
    "url": "https://arxiv.org/abs/2201.06313",
    "authors": [
      "Milad Vazan",
      "Fatemeh Sadat Masoumi",
      "Sepideh Saeedi Majd"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2201.06714",
    "title": "AdaTerm: Adaptive T-Distribution Estimated Robust Moments for  Noise-Robust Stochastic Gradient Optimization",
    "abstract": " Comments: 27 pages; Final version accepted by Elsevier Neurocomputing Journal (2023-08; this https URL) ",
    "url": "https://arxiv.org/abs/2201.06714",
    "authors": [
      "Wendyam Eric Lionel Ilboudo",
      "Taisuke Kobayashi",
      "Takamitsu Matsubara"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03402",
    "title": "Preserving Privacy and Security in Federated Learning",
    "abstract": " Comments: Published in IEEE/ACM Transactions on Networking ",
    "url": "https://arxiv.org/abs/2202.03402",
    "authors": [
      "Truc Nguyen",
      "My T. Thai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.09862",
    "title": "Recurrent segmentation meets block models in temporal networks",
    "abstract": " Title: Recurrent segmentation meets block models in temporal networks ",
    "url": "https://arxiv.org/abs/2205.09862",
    "authors": [
      "Chamalee Wickrama Arachchi",
      "Nikolaj Tatti"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.08464",
    "title": "PRANC: Pseudo RAndom Networks for Compacting deep models",
    "abstract": " Title: PRANC: Pseudo RAndom Networks for Compacting deep models ",
    "url": "https://arxiv.org/abs/2206.08464",
    "authors": [
      "Parsa Nooralinejad",
      "Ali Abbasi",
      "Soroush Abbasi Koohpayegani",
      "Kossar Pourahmadi Meibodi",
      "Rana Muhammad Shahroz Khan",
      "Soheil Kolouri",
      "Hamed Pirsiavash"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.00647",
    "title": "IntrinsicNeRF: Learning Intrinsic Neural Radiance Fields for Editable  Novel View Synthesis",
    "abstract": " Comments: Accepted to ICCV2023, Project webpage: this https URL, code: this https URL ",
    "url": "https://arxiv.org/abs/2210.00647",
    "authors": [
      "Weicai Ye",
      "Shuo Chen",
      "Chong Bao",
      "Hujun Bao",
      "Marc Pollefeys",
      "Zhaopeng Cui",
      "Guofeng Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2210.13004",
    "title": "Efficient Representation of Natural Image Patches",
    "abstract": " Title: Efficient Representation of Natural Image Patches ",
    "url": "https://arxiv.org/abs/2210.13004",
    "authors": [
      "Cheng Guo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2211.12821",
    "title": "Explainable AI for Pre-Trained Code Models: What Do They Learn? When  They Do Not Work?",
    "abstract": " Comments: 10 pages, 7 figures, Accepted at SCAM 2023 ",
    "url": "https://arxiv.org/abs/2211.12821",
    "authors": [
      "Ahmad Haji Mohammadkhani",
      "Chakkrit Tantithamthavorn",
      "Hadi Hemmati"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2211.14308",
    "title": "WALDO: Future Video Synthesis using Object Layer Decomposition and  Parametric Flow Prediction",
    "abstract": " Comments: Accepted to ICCV 2023 ",
    "url": "https://arxiv.org/abs/2211.14308",
    "authors": [
      "Guillaume Le Moing",
      "Jean Ponce",
      "Cordelia Schmid"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.07700",
    "title": "Colab NAS: Obtaining lightweight task-specific convolutional neural  networks following Occam's razor",
    "abstract": " Title: Colab NAS: Obtaining lightweight task-specific convolutional neural  networks following Occam's razor ",
    "url": "https://arxiv.org/abs/2212.07700",
    "authors": [
      "Andrea Mattia Garavagno",
      "Daniele Leonardis",
      "Antonio Frisoli"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.00270",
    "title": "Discovery and Exploitation of Generalized Network Effects",
    "abstract": " Comments: Under Submission ",
    "url": "https://arxiv.org/abs/2301.00270",
    "authors": [
      "Meng-Chieh Lee",
      "Shubhranshu Shekhar",
      "Jaemin Yoo",
      "Christos Faloutsos"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.02496",
    "title": "Stealthy Backdoor Attack for Code Models",
    "abstract": " Comments: 18 pages, Under review of IEEE Transactions on Software Engineering ",
    "url": "https://arxiv.org/abs/2301.02496",
    "authors": [
      "Zhou Yang",
      "Bowen Xu",
      "Jie M. Zhang",
      "Hong Jin Kang",
      "Jieke Shi",
      "Junda He",
      "David Lo"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2302.12095",
    "title": "On the Robustness of ChatGPT: An Adversarial and Out-of-distribution  Perspective",
    "abstract": " Comments: Highlighted paper at ICLR 2023 workshop on Trustworthy and Reliable Large-Scale Machine Learning Models; code is at: this https URL; more works: this https URL ",
    "url": "https://arxiv.org/abs/2302.12095",
    "authors": [
      "Jindong Wang",
      "Xixu Hu",
      "Wenxin Hou",
      "Hao Chen",
      "Runkai Zheng",
      "Yidong Wang",
      "Linyi Yang",
      "Haojun Huang",
      "Wei Ye",
      "Xiubo Geng",
      "Binxin Jiao",
      "Yue Zhang",
      "Xing Xie"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.01055",
    "title": "Physics-informed neural networks for solving forward and inverse  problems in complex beam systems",
    "abstract": " Title: Physics-informed neural networks for solving forward and inverse  problems in complex beam systems ",
    "url": "https://arxiv.org/abs/2303.01055",
    "authors": [
      "Taniya Kapoor",
      "Hongrui Wang",
      "Alfredo Nunez",
      "Rolf Dollevoet"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2303.07122",
    "title": "Quantifying Causes of Arctic Amplification via Deep Learning based  Time-series Causal Inference",
    "abstract": " Title: Quantifying Causes of Arctic Amplification via Deep Learning based  Time-series Causal Inference ",
    "url": "https://arxiv.org/abs/2303.07122",
    "authors": [
      "Sahara Ali",
      "Omar Faruque",
      "Yiyi Huang",
      "Md. Osman Gani",
      "Aneesh Subramanian",
      "Nicole-Jienne Shchlegel",
      "Jianwu Wang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2303.15544",
    "title": "Multi-Flow Transmission in Wireless Interference Networks: A Convergent  Graph Learning Approach",
    "abstract": " Comments: This paper has been accepted for publication in the IEEE Transactions on Wireless Communications ",
    "url": "https://arxiv.org/abs/2303.15544",
    "authors": [
      "Raz Paul",
      "Kobi Cohen",
      "Gil Kedar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2304.07239",
    "title": "Separating Key Agreement and Computational Differential Privacy",
    "abstract": " Comments: A key step in relating the probability that can be computed by the PSPACE algorithm to the statistical distinguishing probability is missing and not yet shown. Our arguments in this work so far have not yet been able to show this step. Thus the final conclusion that key agreement is black-box insufficient for CDP is not yet proven ",
    "url": "https://arxiv.org/abs/2304.07239",
    "authors": [
      "Vipul Arora",
      "Eldon Chung",
      "Zeyong Li",
      "Thomas Tan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.09121",
    "title": "Fast Neural Scene Flow",
    "abstract": " Comments: 17 pages, 11 figures, 6 tables ",
    "url": "https://arxiv.org/abs/2304.09121",
    "authors": [
      "Xueqian Li",
      "Jianqiao Zheng",
      "Francesco Ferroni",
      "Jhony Kaesemodel Pontes",
      "Simon Lucey"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.12534",
    "title": "Mobilizing Personalized Federated Learning in Infrastructure-Less and  Heterogeneous Environments via Random Walk Stochastic ADMM",
    "abstract": " Comments: 28 pages, 7 figures, 3 tables, 1 algorithm. Proof details are provided in the main body of the paper ",
    "url": "https://arxiv.org/abs/2304.12534",
    "authors": [
      "Ziba Parsons",
      "Fei Dou",
      "Houyi Du",
      "Zheng Song",
      "Jin Lu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2305.14713",
    "title": "Streaming Object Detection on Fisheye Cameras for Automatic Parking",
    "abstract": " Title: Streaming Object Detection on Fisheye Cameras for Automatic Parking ",
    "url": "https://arxiv.org/abs/2305.14713",
    "authors": [
      "Yixiong Yan",
      "Liangzhu Cheng",
      "Yongxu Li",
      "Xinjuan Tuo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.19867",
    "title": "Unsupervised Anomaly Detection in Medical Images Using Masked Diffusion  Model",
    "abstract": " Comments: Accepted in MICCAI 2023 Workshops ",
    "url": "https://arxiv.org/abs/2305.19867",
    "authors": [
      "Hasan Iqbal",
      "Umar Khalid",
      "Jing Hua",
      "Chen Chen"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.03454",
    "title": "Benchmarking Robustness of AI-Enabled Multi-sensor Fusion Systems:  Challenges and Opportunities",
    "abstract": " Comments: To appear in ESEC/FSE 2023 ",
    "url": "https://arxiv.org/abs/2306.03454",
    "authors": [
      "Xinyu Gao",
      "Zhijie Wang",
      "Yang Feng",
      "Lei Ma",
      "Zhenyu Chen",
      "Baowen Xu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.10720",
    "title": "Exploring the Relationship between Samples and Masks for Robust Defect  Localization",
    "abstract": " Title: Exploring the Relationship between Samples and Masks for Robust Defect  Localization ",
    "url": "https://arxiv.org/abs/2306.10720",
    "authors": [
      "Jiang Lin",
      "Yaping yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.11277",
    "title": "Frequency & Channel Attention for Computationally Efficient Sound Event  Detection",
    "abstract": " Comments: Accepted to DCASE 2023 workshop ",
    "url": "https://arxiv.org/abs/2306.11277",
    "authors": [
      "Hyeonuk Nam",
      "Seong-Hu Kim",
      "Deokki Min",
      "Yong-Hwa Park"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2306.16740",
    "title": "Principles and Guidelines for Evaluating Social Robot Navigation  Algorithms",
    "abstract": " Comments: 42 pages, 11 figures, 6 tables ",
    "url": "https://arxiv.org/abs/2306.16740",
    "authors": [
      "Anthony Francis",
      "Claudia Pérez-D'Arpino",
      "Chengshu Li",
      "Fei Xia",
      "Alexandre Alahi",
      "Rachid Alami",
      "Aniket Bera",
      "Abhijat Biswas",
      "Joydeep Biswas",
      "Rohan Chandra",
      "Hao-Tien Lewis Chiang",
      "Michael Everett",
      "Sehoon Ha",
      "Justin Hart",
      "Jonathan P. How",
      "Haresh Karnan",
      "Tsang-Wei Edward Lee",
      "Luis J. Manso",
      "Reuth Mirksy",
      "Sören Pirk",
      "Phani Teja Singamaneni",
      "Peter Stone",
      "Ada V. Taylor",
      "Peter Trautman",
      "Nathan Tsoi",
      "Marynel Vázquez",
      "Xuesu Xiao",
      "Peng Xu",
      "Naoki Yokoyama",
      "Alexander Toshev",
      "Roberto Martín-Martín"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.03854",
    "title": "inTformer: A Time-Embedded Attention-Based Transformer for Crash  Likelihood Prediction at Intersections Using Connected Vehicle Data",
    "abstract": " Comments: 29 pages, 10 figures, 8 tables ",
    "url": "https://arxiv.org/abs/2307.03854",
    "authors": [
      "B M Tazbiul Hassan Anik",
      "Zubayer Islam",
      "Mohamed Abdel-Aty"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.07439",
    "title": "Atlas-Based Interpretable Age Prediction In Whole-Body MR Images",
    "abstract": " Title: Atlas-Based Interpretable Age Prediction In Whole-Body MR Images ",
    "url": "https://arxiv.org/abs/2307.07439",
    "authors": [
      "Sophie Starck",
      "Yadunandan Vivekanand Kini",
      "Jessica Johanna Maria Ritter",
      "Rickmer Braren",
      "Daniel Rueckert",
      "Tamara Mueller"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.07494",
    "title": "TALL: Thumbnail Layout for Deepfake Video Detection",
    "abstract": " Comments: Accepted by ICCV 2023 ",
    "url": "https://arxiv.org/abs/2307.07494",
    "authors": [
      "Yuting Xu",
      "Jian Liang",
      "Gengyun Jia",
      "Ziming Yang",
      "Yanhao Zhang",
      "Ran He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.10875",
    "title": "Risk-optimized Outlier Removal for Robust Point Cloud Classification",
    "abstract": " Title: Risk-optimized Outlier Removal for Robust Point Cloud Classification ",
    "url": "https://arxiv.org/abs/2307.10875",
    "authors": [
      "Xinke Li",
      "Junchi Lu",
      "Henghui Ding",
      "Changsheng Sun",
      "Joey Tianyi Zhou",
      "Chee Yeow Meng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.11058",
    "title": "Anticipating Driving Behavior through Deep Learning-Based Policy  Prediction",
    "abstract": " Comments: 5 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2307.11058",
    "authors": [
      "Fuxiao Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.12488",
    "title": "The Effectiveness of Large Language Models (ChatGPT and CodeBERT) for  Security-Oriented Code Analysis",
    "abstract": " Comments: 3 Table, 8 figures ",
    "url": "https://arxiv.org/abs/2307.12488",
    "authors": [
      "Zhilong Wang",
      "Lan Zhang",
      "Chen Cao",
      "Peng Liu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.12676",
    "title": "Few-shot $\\mathbf{1/a}$ Anomalies Feedback : Damage Vision Mining  Opportunity and Embedding Feature Imbalance",
    "abstract": " Comments: 34 pages, 53 figures, 28 tables ",
    "url": "https://arxiv.org/abs/2307.12676",
    "authors": [
      "Takato Yasuno"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.03312",
    "title": "Symmetry-Preserving Program Representations for Learning Code Semantics",
    "abstract": " Title: Symmetry-Preserving Program Representations for Learning Code Semantics ",
    "url": "https://arxiv.org/abs/2308.03312",
    "authors": [
      "Kexin Pei",
      "Weichen Li",
      "Qirui Jin",
      "Shuyang Liu",
      "Scott Geng",
      "Lorenzo Cavallaro",
      "Junfeng Yang",
      "Suman Jana"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2308.03407",
    "title": "Spatially Varying Nanophotonic Neural Networks",
    "abstract": " Title: Spatially Varying Nanophotonic Neural Networks ",
    "url": "https://arxiv.org/abs/2308.03407",
    "authors": [
      "Kaixuan Wei",
      "Xiao Li",
      "Johannes Froech",
      "Praneeth Chakravarthula",
      "James Whitehead",
      "Ethan Tseng",
      "Arka Majumdar",
      "Felix Heide"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.03998",
    "title": "Real-time Strawberry Detection Based on Improved YOLOv5s Architecture  for Robotic Harvesting in open-field environment",
    "abstract": " Comments: 20 pages; 15 figures ",
    "url": "https://arxiv.org/abs/2308.03998",
    "authors": [
      "Zixuan He",
      "Salik Ram Khana",
      "Xin Zhang",
      "Manoj Karkee",
      "Qin Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.06399",
    "title": "Learning Bayesian Networks with Heterogeneous Agronomic Data Sets via  Mixed-Effect Models and Hierarchical Clustering",
    "abstract": " Comments: 28 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2308.06399",
    "authors": [
      "Lorenzo Valleggi",
      "Marco Scutari",
      "Federico Mattia Stefanini"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2308.06564",
    "title": "EquiDiff: A Conditional Equivariant Diffusion Model For Trajectory  Prediction",
    "abstract": " Title: EquiDiff: A Conditional Equivariant Diffusion Model For Trajectory  Prediction ",
    "url": "https://arxiv.org/abs/2308.06564",
    "authors": [
      "Kehua Chen",
      "Xianda Chen",
      "Zihan Yu",
      "Meixin Zhu",
      "Hai Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.10658",
    "title": "Learning Clothing and Pose Invariant 3D Shape Representation for  Long-Term Person Re-Identification",
    "abstract": " Comments: 10 pages, 7 figures, accepted by ICCV 2023 ",
    "url": "https://arxiv.org/abs/2308.10658",
    "authors": [
      "Feng Liu",
      "Minchul Kim",
      "ZiAng Gu",
      "Anil Jain",
      "Xiaoming Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.12651",
    "title": "Sink Location Problems in Dynamic Flow Grid Networks",
    "abstract": " Comments: 16 pages, 6 figures, full version of a paper accepted at COCOON 2023 ",
    "url": "https://arxiv.org/abs/2308.12651",
    "authors": [
      "Yuya Higashikawa",
      "Ayano Nishii",
      "Junichi Teruyama",
      "Yuki Tokuni"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2308.12817",
    "title": "MixNet: Toward Accurate Detection of Challenging Scene Text in the Wild",
    "abstract": " Title: MixNet: Toward Accurate Detection of Challenging Scene Text in the Wild ",
    "url": "https://arxiv.org/abs/2308.12817",
    "authors": [
      "Yu-Xiang Zeng",
      "Jun-Wei Hsieh",
      "Xin Li",
      "Ming-Ching Chang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.14066",
    "title": "Bi-Modality Medical Image Synthesis Using Semi-Supervised Sequential  Generative Adversarial Networks",
    "abstract": " Title: Bi-Modality Medical Image Synthesis Using Semi-Supervised Sequential  Generative Adversarial Networks ",
    "url": "https://arxiv.org/abs/2308.14066",
    "authors": [
      "Xin Yang",
      "Yi Lin",
      "Zhiwei Wang",
      "Xin Li",
      "Kwang-Ting Cheng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.14105",
    "title": "Unified and Dynamic Graph for Temporal Character Grouping in Long Videos",
    "abstract": " Title: Unified and Dynamic Graph for Temporal Character Grouping in Long Videos ",
    "url": "https://arxiv.org/abs/2308.14105",
    "authors": [
      "Xiujun Shu",
      "Wei Wen",
      "Liangsheng Xu",
      "Mingbao Lin",
      "Ruizhi Qiao",
      "Taian Guo",
      "Hanjun Li",
      "Bei Gan",
      "Xiao Wang",
      "Xing Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.14397",
    "title": "Ensemble of Anchor-Free Models for Robust Bangla Document Layout  Segmentation",
    "abstract": " Comments: 4 pages, 5 figures, 6 Tables ",
    "url": "https://arxiv.org/abs/2308.14397",
    "authors": [
      "U Mong Sain Chak",
      "Md. Asib Rahman"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]