[
  {
    "id": "arXiv:2108.08574",
    "title": "StructDepth: Leveraging the structural regularities for self-supervised  indoor depth estimation",
    "abstract": "Self-supervised monocular depth estimation has achieved impressive performance on outdoor datasets. Its performance however degrades notably in indoor environments because of the lack of textures. Without rich textures, the photometric consistency is too weak to train a good depth network. Inspired by the early works on indoor modeling, we leverage the structural regularities exhibited in indoor scenes, to train a better depth network. Specifically, we adopt two extra supervisory signals for self-supervised training: 1) the Manhattan normal constraint and 2) the co-planar constraint. The Manhattan normal constraint enforces the major surfaces (the floor, ceiling, and walls) to be aligned with dominant directions. The co-planar constraint states that the 3D points be well fitted by a plane if they are located within the same planar region. To generate the supervisory signals, we adopt two components to classify the major surface normal into dominant directions and detect the planar regions on the fly during training. As the predicted depth becomes more accurate after more training epochs, the supervisory signals also improve and in turn feedback to obtain a better depth model. Through extensive experiments on indoor benchmark datasets, the results show that our network outperforms the state-of-the-art methods. The source code is available at https://github.com/SJTU-ViSYS/StructDepth . ",
    "url": "https://arxiv.org/abs/2108.08574",
    "authors": [
      "Boying Li",
      "Yuan Huang",
      "Zeyu Liu",
      "Danping Zou",
      "Wenxian Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.08760",
    "title": "Efficient remedies for outlier detection with variational autoencoders",
    "abstract": "Deep networks often make confident, yet incorrect, predictions when tested with outlier data that is far removed from their training distributions. Likelihoods computed by deep generative models are a candidate metric for outlier detection with unlabeled data. Yet, previous studies have shown that such likelihoods are unreliable and can be easily biased by simple transformations to input data. Here, we examine outlier detection with variational autoencoders (VAEs), among the simplest class of deep generative models. First, we show that a theoretically-grounded correction readily ameliorates a key bias with VAE likelihood estimates. The bias correction is model-free, sample-specific, and accurately computed with the Bernoulli and continuous Bernoulli visible distributions. Second, we show that a well-known preprocessing technique, contrast normalization, extends the effectiveness of bias correction to natural image datasets. Third, we show that the variance of the likelihoods computed over an ensemble of VAEs also enables robust outlier detection. We perform a comprehensive evaluation of our remedies with nine (grayscale and natural) image datasets, and demonstrate significant advantages, in terms of both speed and accuracy, over four other state-of-the-art methods. Our lightweight remedies are biologically inspired and may serve to achieve efficient outlier detection with many types of deep generative models. ",
    "url": "https://arxiv.org/abs/2108.08760",
    "authors": [
      "Kushal Chauhan",
      "Pradeep Shenoy",
      "Manish Gupta",
      "Devarajan Sridharan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.08797",
    "title": "Physics-informed machine learning improves detection of head impacts",
    "abstract": "In this work we present a new physics-informed machine learning model that can be used to analyze kinematic data from an instrumented mouthguard and detect impacts to the head. Monitoring player impacts is vitally important to understanding and protecting from injuries like concussion. Typically, to analyze this data, a combination of video analysis and sensor data is used to ascertain the recorded events are true impacts and not false positives. In fact, due to the nature of using wearable devices in sports, false positives vastly outnumber the true positives. Yet, manual video analysis is time-consuming. This imbalance leads traditional machine learning approaches to exhibit poor performance in both detecting true positives and preventing false negatives. Here, we show that by simulating head impacts numerically using a standard Finite Element head-neck model, a large dataset of synthetic impacts can be created to augment the gathered, verified, impact data from mouthguards. This combined physics-informed machine learning impact detector reported improved performance on test datasets compared to traditional impact detectors with negative predictive value and positive predictive values of 88% and 87% respectively. Consequently, this model reported the best results to date for an impact detection algorithm for American Football, achieving an F1 score of 0.95. In addition, this physics-informed machine learning impact detector was able to accurately detect true and false impacts from a test dataset at a rate of 90% and 100% relative to a purely manual video analysis workflow. Saving over 12 hours of manual video analysis for a modest dataset, at an overall accuracy of 92%, these results indicate that this model could be used in place of, or alongside, traditional video analysis to allow for larger scale and more efficient impact detection in sports such as American Football. ",
    "url": "https://arxiv.org/abs/2108.08797",
    "authors": [
      "Samuel J. Raymond",
      "Nicholas J. Cecchi",
      "Hossein Vahid Alizadeh",
      "Ashlyn A. Callan",
      "Eli Rice",
      "Yuzhe Liu",
      "Zhou Zhou",
      "Michael Zeineh",
      "David B. Camarillo"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2108.08631",
    "title": "Determinant-free fermionic wave function using feed-forward neural  network",
    "abstract": "We propose a general framework for finding the ground state of many-body fermionic systems by using feed-forward neural networks. The anticommutation relation for fermions is usually implemented to a variational wave function by the Slater determinant (or Pfaffian), which is a computational bottleneck because of the numerical cost of $O(N^3)$ for $N$ particles. We bypass this bottleneck by explicitly calculating the sign changes associated with particle exchanges in real space and using fully connected neural networks for optimizing the rest parts of the wave function. This reduces the computational cost to $O(N^2)$ or less. We show that the accuracy of the approximation can be improved by optimizing the \"variance\" of the energy simultaneously with the energy itself. We also find that a reweighting method in Monte Carlo sampling can stabilize the calculation. These improvements can be applied to other approaches based on variational Monte Carlo methods. Moreover, we show that the accuracy can be further improved by using the symmetry of the system, the representative states, and an additional neural network implementing a generalized Gutzwiller-Jastrow factor. We demonstrate the efficiency of the method by applying it to a two-dimensional Hubbard model. ",
    "url": "https://arxiv.org/abs/2108.08631",
    "authors": [
      "Koji Inui",
      "Yasuyuki Kato",
      "Yukitoshi Motome"
    ],
    "subjectives": [
      "Strongly Correlated Electrons (cond-mat.str-el)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:1910.09419",
    "title": "The structure and the list 3-dynamic coloring of outer-1-planar graphs",
    "abstract": " Title: The structure and the list 3-dynamic coloring of outer-1-planar graphs ",
    "url": "https://arxiv.org/abs/1910.09419",
    "authors": [
      "Yan Li",
      "Xin Zhang"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2007.03193",
    "title": "Policies for elementary links in a quantum network",
    "abstract": " Comments: 17+40 pages, 5 figures. Improved presentation ",
    "url": "https://arxiv.org/abs/2007.03193",
    "authors": [
      "Sumeet Khatri"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2009.10623",
    "title": "Tailoring: encoding inductive biases by optimizing unsupervised  objectives at prediction time",
    "abstract": " Comments: NeurIPS 2020 workshops on Interpretable Inductive Biases and Meta-learning ",
    "url": "https://arxiv.org/abs/2009.10623",
    "authors": [
      "Ferran Alet",
      "Maria Bauza",
      "Kenji Kawaguchi",
      "Nurullah Giray Kuru",
      "Tomas Lozano-Perez",
      "Leslie Pack Kaelbling"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2010.15245",
    "title": "A marine radioisotope gamma-ray spectrum analysis method based on Monte  Carlo simulation and MLP neural network",
    "abstract": " Comments: 13 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2010.15245",
    "authors": [
      "Wenhan Dai",
      "Zhi Zeng",
      "Daowei Dou",
      "Hao Ma",
      "Jianping Chen",
      "Junli Li",
      "Hui Zhang"
    ],
    "subjectives": [
      "Instrumentation and Detectors (physics.ins-det)",
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2107.12198",
    "title": "Computational graphs for matrix functions",
    "abstract": " Title: Computational graphs for matrix functions ",
    "url": "https://arxiv.org/abs/2107.12198",
    "authors": [
      "Elias Jarlebring",
      "Massimiliano Fasi",
      "Emil Ringh"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2108.07046",
    "title": "WiseR: An end-to-end structure learning and deployment framework for  causal graphical models",
    "abstract": " Title: WiseR: An end-to-end structure learning and deployment framework for  causal graphical models ",
    "url": "https://arxiv.org/abs/2108.07046",
    "authors": [
      "Shubham Maheshwari",
      "Khushbu Pahwa",
      "Tavpritesh Sethi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  }
]