[
  {
    "id": "arXiv:2401.01895",
    "title": "A Robust Adversary Detection-Deactivation Method for Metaverse-oriented  Collaborative Deep Learning",
    "abstract": "Metaverse is trending to create a digital circumstance that can transfer the real world to an online platform supported by large quantities of real-time interactions. Pre-trained Artificial Intelligence (AI) models are demonstrating their increasing capability in aiding the metaverse to achieve an excellent response with negligible delay, and nowadays, many large models are collaboratively trained by various participants in a manner named collaborative deep learning (CDL). However, several security weaknesses can threaten the safety of the CDL training process, which might result in fatal attacks to either the pre-trained large model or the local sensitive data sets possessed by an individual entity. In CDL, malicious participants can hide within the major innocent and silently uploads deceptive parameters to degenerate the model performance, or they can abuse the downloaded parameters to construct a Generative Adversarial Network (GAN) to acquire the private information of others illegally. To compensate for these vulnerabilities, this paper proposes an adversary detection-deactivation method, which can limit and isolate the access of potential malicious participants, quarantine and disable the GAN-attack or harmful backpropagation of received threatening gradients. A detailed protection analysis has been conducted on a Multiview CDL case, and results show that the protocol can effectively prevent harmful access by heuristic manner analysis and can protect the existing model by swiftly checking received gradients using only one low-cost branch with an embedded firewall. ",
    "url": "https://arxiv.org/abs/2401.01895",
    "authors": [
      "Pengfei Li",
      "Zhibo Zhang",
      "Ameena S. Al-Sumaiti",
      "Naoufel Werghi",
      "Chan Yeob Yeun"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.01896",
    "title": "Reputation-Based Federated Learning Defense to Mitigate Threats in EEG  Signal Classification",
    "abstract": "This paper presents a reputation-based threat mitigation framework that defends potential security threats in electroencephalogram (EEG) signal classification during model aggregation of Federated Learning. While EEG signal analysis has attracted attention because of the emergence of brain-computer interface (BCI) technology, it is difficult to create efficient learning models for EEG analysis because of the distributed nature of EEG data and related privacy and security concerns. To address these challenges, the proposed defending framework leverages the Federated Learning paradigm to preserve privacy by collaborative model training with localized data from dispersed sources and introduces a reputation-based mechanism to mitigate the influence of data poisoning attacks and identify compromised participants. To assess the efficiency of the proposed reputation-based federated learning defense framework, data poisoning attacks based on the risk level of training data derived by Explainable Artificial Intelligence (XAI) techniques are conducted on both publicly available EEG signal datasets and the self-established EEG signal dataset. Experimental results on the poisoned datasets show that the proposed defense methodology performs well in EEG signal classification while reducing the risks associated with security threats. ",
    "url": "https://arxiv.org/abs/2401.01896",
    "authors": [
      "Zhibo Zhang",
      "Pengfei Li",
      "Ahmed Y. Al Hammadi",
      "Fusen Guo",
      "Ernesto Damiani",
      "Chan Yeob Yeun"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2401.01911",
    "title": "Backdoor Attack on Unpaired Medical Image-Text Foundation Models: A  Pilot Study on MedCLIP",
    "abstract": "In recent years, foundation models (FMs) have solidified their role as cornerstone advancements in the deep learning domain. By extracting intricate patterns from vast datasets, these models consistently achieve state-of-the-art results across a spectrum of downstream tasks, all without necessitating extensive computational resources. Notably, MedCLIP, a vision-language contrastive learning-based medical FM, has been designed using unpaired image-text training. While the medical domain has often adopted unpaired training to amplify data, the exploration of potential security concerns linked to this approach hasn't kept pace with its practical usage. Notably, the augmentation capabilities inherent in unpaired training also indicate that minor label discrepancies can result in significant model deviations. In this study, we frame this label discrepancy as a backdoor attack problem. We further analyze its impact on medical FMs throughout the FM supply chain. Our evaluation primarily revolves around MedCLIP, emblematic of medical FM employing the unpaired strategy. We begin with an exploration of vulnerabilities in MedCLIP stemming from unpaired image-text matching, termed BadMatch. BadMatch is achieved using a modest set of wrongly labeled data. Subsequently, we disrupt MedCLIP's contrastive learning through BadDist-assisted BadMatch by introducing a Bad-Distance between the embeddings of clean and poisoned data. Additionally, combined with BadMatch and BadDist, the attacking pipeline consistently fends off backdoor assaults across diverse model designs, datasets, and triggers. Also, our findings reveal that current defense strategies are insufficient in detecting these latent threats in medical FMs' supply chains. ",
    "url": "https://arxiv.org/abs/2401.01911",
    "authors": [
      "Ruinan Jin",
      "Chun-Yin Huang",
      "Chenyu You",
      "Xiaoxiao Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.01912",
    "title": "Shrinking Your TimeStep: Towards Low-Latency Neuromorphic Object  Recognition with Spiking Neural Network",
    "abstract": "Neuromorphic object recognition with spiking neural networks (SNNs) is the cornerstone of low-power neuromorphic computing. However, existing SNNs suffer from significant latency, utilizing 10 to 40 timesteps or more, to recognize neuromorphic objects. At low latencies, the performance of existing SNNs is drastically degraded. In this work, we propose the Shrinking SNN (SSNN) to achieve low-latency neuromorphic object recognition without reducing performance. Concretely, we alleviate the temporal redundancy in SNNs by dividing SNNs into multiple stages with progressively shrinking timesteps, which significantly reduces the inference latency. During timestep shrinkage, the temporal transformer smoothly transforms the temporal scale and preserves the information maximally. Moreover, we add multiple early classifiers to the SNN during training to mitigate the mismatch between the surrogate gradient and the true gradient, as well as the gradient vanishing/exploding, thus eliminating the performance degradation at low latency. Extensive experiments on neuromorphic datasets, CIFAR10-DVS, N-Caltech101, and DVS-Gesture have revealed that SSNN is able to improve the baseline accuracy by 6.55% ~ 21.41%. With only 5 average timesteps and without any data augmentation, SSNN is able to achieve an accuracy of 73.63% on CIFAR10-DVS. This work presents a heterogeneous temporal scale SNN and provides valuable insights into the development of high-performance, low-latency SNNs. ",
    "url": "https://arxiv.org/abs/2401.01912",
    "authors": [
      "Yongqi Ding",
      "Lin Zuo",
      "Mengmeng Jing",
      "Pei He",
      "Yongjun Xiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2401.01918",
    "title": "Distilling Temporal Knowledge with Masked Feature Reconstruction for 3D  Object Detection",
    "abstract": "Striking a balance between precision and efficiency presents a prominent challenge in the bird's-eye-view (BEV) 3D object detection. Although previous camera-based BEV methods achieved remarkable performance by incorporating long-term temporal information, most of them still face the problem of low efficiency. One potential solution is knowledge distillation. Existing distillation methods only focus on reconstructing spatial features, while overlooking temporal knowledge. To this end, we propose TempDistiller, a Temporal knowledge Distiller, to acquire long-term memory from a teacher detector when provided with a limited number of frames. Specifically, a reconstruction target is formulated by integrating long-term temporal knowledge through self-attention operation applied to feature teachers. Subsequently, novel features are generated for masked student features via a generator. Ultimately, we utilize this reconstruction target to reconstruct the student features. In addition, we also explore temporal relational knowledge when inputting full frames for the student model. We verify the effectiveness of the proposed method on the nuScenes benchmark. The experimental results show our method obtain an enhancement of +1.6 mAP and +1.1 NDS compared to the baseline, a speed improvement of approximately 6 FPS after compressing temporal knowledge, and the most accurate velocity estimation. ",
    "url": "https://arxiv.org/abs/2401.01918",
    "authors": [
      "Haowen Zheng",
      "Dong Cao",
      "Jintao Xu",
      "Rui Ai",
      "Weihao Gu",
      "Yang Yang",
      "Yanyan Liang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.01921",
    "title": "The Cytnx Library for Tensor Networks",
    "abstract": "We introduce a tensor network library designed for classical and quantum physics simulations called Cytnx (pronounced as sci-tens). This library provides almost an identical interface and syntax for both C++ and Python, allowing users to effortlessly switch between two languages. Aiming at a quick learning process for new users of tensor network algorithms, the interfaces resemble the popular Python scientific libraries like NumPy, Scipy, and PyTorch. Not only multiple global Abelian symmetries can be easily defined and implemented, Cytnx also provides a new tool called Network that allows users to store large tensor networks and perform tensor network contractions in an optimal order automatically. With the integration of cuQuantum, tensor calculations can also be executed efficiently on GPUs. We present benchmark results for tensor operations on both devices, CPU and GPU. We also discuss features and higher-level interfaces to be added in the future. ",
    "url": "https://arxiv.org/abs/2401.01921",
    "authors": [
      "Kai-Hsin Wu",
      "Chang-Teng Lin",
      "Ke Hsu",
      "Hao-Ti Hung",
      "Manuel Schneider",
      "Chia-Min Chung",
      "Ying-Jer Kao",
      "Pochung Chen"
    ],
    "subjectives": [
      "Mathematical Software (cs.MS)"
    ]
  },
  {
    "id": "arXiv:2401.01943",
    "title": "Generalist embedding models are better at short-context clinical  semantic search than specialized embedding models",
    "abstract": "The increasing use of tools and solutions based on Large Language Models (LLMs) for various tasks in the medical domain has become a prominent trend. Their use in this highly critical and sensitive domain has thus raised important questions about their robustness, especially in response to variations in input, and the reliability of the generated outputs. This study addresses these questions by constructing a textual dataset based on the ICD-10-CM code descriptions, widely used in US hospitals and containing many clinical terms, and their easily reproducible rephrasing. We then benchmarked existing embedding models, either generalist or specialized in the clinical domain, in a semantic search task where the goal was to correctly match the rephrased text to the original description. Our results showed that generalist models performed better than clinical models, suggesting that existing clinical specialized models are more sensitive to small changes in input that confuse them. The highlighted problem of specialized models may be due to the fact that they have not been trained on sufficient data, and in particular on datasets that are not diverse enough to have a reliable global language understanding, which is still necessary for accurate handling of medical documents. ",
    "url": "https://arxiv.org/abs/2401.01943",
    "authors": [
      "Jean-Baptiste Excoffier",
      "Tom Roehr",
      "Alexei Figueroa",
      "Michalis Papaaioannou",
      "Keno Bressem",
      "Matthieu Ortala"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.01954",
    "title": "Word-Representability of Graphs with respect to Split Recomposition",
    "abstract": "In this work, we show that the class of word-representable graphs is closed under split recomposition and determine the representation number of the graph obtained by recomposing two word-representable graphs. Accordingly, we show that the class of parity graphs is word-representable. Further, we obtain a characteristic property by which the recomposition of comparability graphs is a comparability graph. Consequently, we also establish the permutation-representation number (prn) of the resulting comparability graph. We also introduce a subclass of comparability graphs, called prn-irreducible graphs. We provide a criterion such that the split recomposition of two prn-irreducible graphs is a comparability graph and determine the prn of the resultant graph. ",
    "url": "https://arxiv.org/abs/2401.01954",
    "authors": [
      "Tithi Dwary",
      "K. V. Krishna"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2401.01960",
    "title": "Shadow Blade: A tool to interact with attack vectors",
    "abstract": "The increased demand of cyber security professionals has also increased the development of new platforms and tools that help those professionals to improve their offensive skills. One of these platforms is HackTheBox, an online cyber security training platform that delivers a controlled and safe environment for those professionals to explore virtual machines in a Capture the Flag (CTF) competition style. Most of the tools used in a CTF, or even on real-world Penetration Testing (Pentest), were developed for specific reasons so each tool usually has different input and output formats. These different formats make it hard for cyber security professionals and CTF competitors to develop an attack graph. In order to help cyber security professionals and CTF competitors to discover, select and exploit an attack vector, this paper presents Shadow Blade, a tool to aid users to interact with their attack vectors. ",
    "url": "https://arxiv.org/abs/2401.01960",
    "authors": [
      "Ariel R. Ril",
      "Daniel Dalalana Bertoglio",
      "Avelino F. Zorzo"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.01963",
    "title": "Integrated Cyber-Physical Resiliency for Power Grids under IoT-Enabled  Dynamic Botnet Attacks",
    "abstract": "The wide adoption of Internet of Things (IoT)-enabled energy devices improves the quality of life, but simultaneously, it enlarges the attack surface of the power grid system. The adversary can gain illegitimate control of a large number of these devices and use them as a means to compromise the physical grid operation, a mechanism known as the IoT botnet attack. This paper aims to improve the resiliency of cyber-physical power grids to such attacks. Specifically, we use an epidemic model to understand the dynamic botnet formation, which facilitates the assessment of the cyber layer vulnerability of the grid. The attacker aims to exploit this vulnerability to enable a successful physical compromise, while the system operator's goal is to ensure a normal operation of the grid by mitigating cyber risks. We develop a cross-layer game-theoretic framework for strategic decision-making to enhance cyber-physical grid resiliency. The cyber-layer game guides the system operator on how to defend against the botnet attacker as the first layer of defense, while the dynamic game strategy at the physical layer further counteracts the adversarial behavior in real time for improved physical resilience. A number of case studies on the IEEE-39 bus system are used to corroborate the devised approach. ",
    "url": "https://arxiv.org/abs/2401.01963",
    "authors": [
      "Yuhan Zhao",
      "Juntao Chen",
      "Quanyan Zhu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2401.01984",
    "title": "AUPIMO: Redefining Visual Anomaly Detection Benchmarks with High Speed  and Low Tolerance",
    "abstract": "Recent advances in visual anomaly detection research have seen AUROC and AUPRO scores on public benchmark datasets such as MVTec and VisA converge towards perfect recall, giving the impression that these benchmarks are near-solved. However, high AUROC and AUPRO scores do not always reflect qualitative performance, which limits the validity of these metrics in real-world applications. We argue that the artificial ceiling imposed by the lack of an adequate evaluation metric restrains progression of the field, and it is crucial that we revisit the evaluation metrics used to rate our algorithms. In response, we introduce Per-IMage Overlap (PIMO), a novel metric that addresses the shortcomings of AUROC and AUPRO. PIMO retains the recall-based nature of the existing metrics but introduces two distinctions: the assignment of curves (and respective area under the curve) is per-image, and its X-axis relies solely on normal images. Measuring recall per image simplifies instance score indexing and is more robust to noisy annotations. As we show, it also accelerates computation and enables the usage of statistical tests to compare models. By imposing low tolerance for false positives on normal images, PIMO provides an enhanced model validation procedure and highlights performance variations across datasets. Our experiments demonstrate that PIMO offers practical advantages and nuanced performance insights that redefine anomaly detection benchmarks -- notably challenging the perception that MVTec AD and VisA datasets have been solved by contemporary models. Available on GitHub: https://github.com/jpcbertoldo/aupimo. ",
    "url": "https://arxiv.org/abs/2401.01984",
    "authors": [
      "Joao P. C. Bertoldo",
      "Dick Ameln",
      "Ashwin Vaidya",
      "Samet Akçay"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.01987",
    "title": "Representation Learning of Multivariate Time Series using Attention and  Adversarial Training",
    "abstract": "A critical factor in trustworthy machine learning is to develop robust representations of the training data. Only under this guarantee methods are legitimate to artificially generate data, for example, to counteract imbalanced datasets or provide counterfactual explanations for blackbox decision-making systems. In recent years, Generative Adversarial Networks (GANs) have shown considerable results in forming stable representations and generating realistic data. While many applications focus on generating image data, less effort has been made in generating time series data, especially multivariate signals. In this work, a Transformer-based autoencoder is proposed that is regularized using an adversarial training scheme to generate artificial multivariate time series signals. The representation is evaluated using t-SNE visualizations, Dynamic Time Warping (DTW) and Entropy scores. Our results indicate that the generated signals exhibit higher similarity to an exemplary dataset than using a convolutional network approach. ",
    "url": "https://arxiv.org/abs/2401.01987",
    "authors": [
      "Leon Scharwächter",
      "Sebastian Otte"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.01990",
    "title": "GPS-SSL: Guided Positive Sampling to Inject Prior Into Self-Supervised  Learning",
    "abstract": "We propose Guided Positive Sampling Self-Supervised Learning (GPS-SSL), a general method to inject a priori knowledge into Self-Supervised Learning (SSL) positive samples selection. Current SSL methods leverage Data-Augmentations (DA) for generating positive samples and incorporate prior knowledge - an incorrect, or too weak DA will drastically reduce the quality of the learned representation. GPS-SSL proposes instead to design a metric space where Euclidean distances become a meaningful proxy for semantic relationship. In that space, it is now possible to generate positive samples from nearest neighbor sampling. Any prior knowledge can now be embedded into that metric space independently from the employed DA. From its simplicity, GPS-SSL is applicable to any SSL method, e.g. SimCLR or BYOL. A key benefit of GPS-SSL is in reducing the pressure in tailoring strong DAs. For example GPS-SSL reaches 85.58% on Cifar10 with weak DA while the baseline only reaches 37.51%. We therefore move a step forward towards the goal of making SSL less reliant on DA. We also show that even when using strong DAs, GPS-SSL outperforms the baselines on under-studied domains. We evaluate GPS-SSL along with multiple baseline SSL methods on numerous downstream datasets from different domains when the models use strong or minimal data augmentations. We hope that GPS-SSL will open new avenues in studying how to inject a priori knowledge into SSL in a principled manner. ",
    "url": "https://arxiv.org/abs/2401.01990",
    "authors": [
      "Aarash Feizi",
      "Randall Balestriero",
      "Adriana Romero-Soriano",
      "Reihaneh Rabbany"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.01991",
    "title": "DApps Ecosystems: Mapping the Network Structure of Smart Contract  Interactions",
    "abstract": "In recent years, decentralized applications (dApps) built on blockchain platforms such as Ethereum and coded in languages such as Solidity, have gained attention for their potential to disrupt traditional centralized systems. Despite their rapid adoption, limited research has been conducted to understand the underlying code structure of these applications. In particular, each dApp is composed of multiple smart contracts, each containing a number of functions that can be called to trigger a specific event, e.g., a token transfer. In this paper, we reconstruct and analyse the network of contracts and functions calls within the dApp, which is helpful to unveil vulnerabilities that can be exploited by malicious attackers. We show how decentralization is architecturally implemented, identifying common development patterns and anomalies that could influence the system's robustness and efficiency. We find a consistent network structure characterized by modular, self-sufficient contracts and a complex web of function interactions, indicating common coding practices across the blockchain community. Critically, a small number of key functions within each dApp play a pivotal role in maintaining network connectivity, making them potential targets for cyber attacks and highlighting the need for robust security measures. ",
    "url": "https://arxiv.org/abs/2401.01991",
    "authors": [
      "Sabrina Aufiero",
      "Giacomo Ibba",
      "Silvia Bartolucci",
      "Giuseppe Destefanis",
      "Rumyana Neykova",
      "Marco Ortu"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2401.02011",
    "title": "Decentralized Multi-Task Online Convex Optimization Under Random Link  Failures",
    "abstract": "Decentralized optimization methods often entail information exchange between neighbors. Transmission failures can happen due to network congestion, hardware/software issues, communication outage, and other factors. In this paper, we investigate the random link failure problem in decentralized multi-task online convex optimization, where agents have individual decisions that are coupled with each other via pairwise constraints. Although widely used in constrained optimization, conventional saddle-point algorithms are not directly applicable here because of random packet dropping. To address this issue, we develop a robust decentralized saddle-point algorithm against random link failures with heterogeneous probabilities by replacing the missing decisions of neighbors with their latest received values. Then, by judiciously bounding the accumulated deviation stemming from this replacement, we first establish that our algorithm achieves $\\mathcal{O}(\\sqrt{T})$ regret and $\\mathcal{O}(T^\\frac{3}{4})$ constraint violations for the full information scenario, where the complete information on the local cost function is revealed to each agent at the end of each time slot. These two bounds match, in order sense, the performance bounds of algorithms with perfect communications. Further, we extend our algorithm and analysis to the two-point bandit feedback scenario, where only the values of the local cost function at two random points are disclosed to each agent sequentially. Performance bounds of the same orders as the full information case are derived. Finally, we corroborate the efficacy of the proposed algorithms and the analytical results through numerical simulations. ",
    "url": "https://arxiv.org/abs/2401.02011",
    "authors": [
      "Wenjing Yan",
      "Xuanyu Cao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2401.02012",
    "title": "Fast & Fair: Efficient Second-Order Robust Optimization for Fairness in  Machine Learning",
    "abstract": "This project explores adversarial training techniques to develop fairer Deep Neural Networks (DNNs) to mitigate the inherent bias they are known to exhibit. DNNs are susceptible to inheriting bias with respect to sensitive attributes such as race and gender, which can lead to life-altering outcomes (e.g., demographic bias in facial recognition software used to arrest a suspect). We propose a robust optimization problem, which we demonstrate can improve fairness in several datasets, both synthetic and real-world, using an affine linear model. Leveraging second order information, we are able to find a solution to our optimization problem more efficiently than a purely first order method. ",
    "url": "https://arxiv.org/abs/2401.02012",
    "authors": [
      "Allen Minch",
      "Hung Anh Vu",
      "Anne Marie Warren"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2401.02015",
    "title": "Improving Diffusion-Based Image Synthesis with Context Prediction",
    "abstract": "Diffusion models are a new class of generative models, and have dramatically promoted image generation with unprecedented quality and diversity. Existing diffusion models mainly try to reconstruct input image from a corrupted one with a pixel-wise or feature-wise constraint along spatial axes. However, such point-based reconstruction may fail to make each predicted pixel/feature fully preserve its neighborhood context, impairing diffusion-based image synthesis. As a powerful source of automatic supervisory signal, context has been well studied for learning representations. Inspired by this, we for the first time propose ConPreDiff to improve diffusion-based image synthesis with context prediction. We explicitly reinforce each point to predict its neighborhood context (i.e., multi-stride features/tokens/pixels) with a context decoder at the end of diffusion denoising blocks in training stage, and remove the decoder for inference. In this way, each point can better reconstruct itself by preserving its semantic connections with neighborhood context. This new paradigm of ConPreDiff can generalize to arbitrary discrete and continuous diffusion backbones without introducing extra parameters in sampling procedure. Extensive experiments are conducted on unconditional image generation, text-to-image generation and image inpainting tasks. Our ConPreDiff consistently outperforms previous methods and achieves a new SOTA text-to-image generation results on MS-COCO, with a zero-shot FID score of 6.21. ",
    "url": "https://arxiv.org/abs/2401.02015",
    "authors": [
      "Ling Yang",
      "Jingwei Liu",
      "Shenda Hong",
      "Zhilong Zhang",
      "Zhilin Huang",
      "Zheming Cai",
      "Wentao Zhang",
      "Bin Cui"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02023",
    "title": "Stability Analysis of Higher-order Ecological Networks through Tensor  Decompositions",
    "abstract": "Complex ecological networks are characterized by intricate interactions that extend beyond traditional pairwise relationships. Understanding the stability of higher-order ecological networks is salient for species coexistence, biodiversity, and community persistence. In this article, we present a novel approach for stability analysis of higher-order ecological networks through tensor decompositions. We are particularly interested in the higher-order generalized Lotka-Volterra model, which captures high-order interactions using tensors of varying orders. To efficiently compute Jacobian matrices and thus determine stability in large ecological networks, we exploit various tensor decompositions, including higher-order singular value decomposition, Canonical Polyadic decomposition, and tensor train decomposition, accompanied by in-depth computational and memory complexity analyses. We demonstrate the effectiveness of our framework with numerical examples. ",
    "url": "https://arxiv.org/abs/2401.02023",
    "authors": [
      "Anqi Dong",
      "Can Chen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Numerical Analysis (math.NA)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2401.02031",
    "title": "Spy-Watermark: Robust Invisible Watermarking for Backdoor Attack",
    "abstract": "Backdoor attack aims to deceive a victim model when facing backdoor instances while maintaining its performance on benign data. Current methods use manual patterns or special perturbations as triggers, while they often overlook the robustness against data corruption, making backdoor attacks easy to defend in practice. To address this issue, we propose a novel backdoor attack method named Spy-Watermark, which remains effective when facing data collapse and backdoor defense. Therein, we introduce a learnable watermark embedded in the latent domain of images, serving as the trigger. Then, we search for a watermark that can withstand collapse during image decoding, cooperating with several anti-collapse operations to further enhance the resilience of our trigger against data corruption. Extensive experiments are conducted on CIFAR10, GTSRB, and ImageNet datasets, demonstrating that Spy-Watermark overtakes ten state-of-the-art methods in terms of robustness and stealthiness. ",
    "url": "https://arxiv.org/abs/2401.02031",
    "authors": [
      "Ruofei Wang",
      "Renjie Wan",
      "Zongyu Guo",
      "Qing Guo",
      "Rui Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02032",
    "title": "DiffusionEdge: Diffusion Probabilistic Model for Crisp Edge Detection",
    "abstract": "Limited by the encoder-decoder architecture, learning-based edge detectors usually have difficulty predicting edge maps that satisfy both correctness and crispness. With the recent success of the diffusion probabilistic model (DPM), we found it is especially suitable for accurate and crisp edge detection since the denoising process is directly applied to the original image size. Therefore, we propose the first diffusion model for the task of general edge detection, which we call DiffusionEdge. To avoid expensive computational resources while retaining the final performance, we apply DPM in the latent space and enable the classic cross-entropy loss which is uncertainty-aware in pixel level to directly optimize the parameters in latent space in a distillation manner. We also adopt a decoupled architecture to speed up the denoising process and propose a corresponding adaptive Fourier filter to adjust the latent features of specific frequencies. With all the technical designs, DiffusionEdge can be stably trained with limited resources, predicting crisp and accurate edge maps with much fewer augmentation strategies. Extensive experiments on four edge detection benchmarks demonstrate the superiority of DiffusionEdge both in correctness and crispness. On the NYUDv2 dataset, compared to the second best, we increase the ODS, OIS (without post-processing) and AC by 30.2%, 28.1% and 65.1%, respectively. Code: https://github.com/GuHuangAI/DiffusionEdge. ",
    "url": "https://arxiv.org/abs/2401.02032",
    "authors": [
      "Yunfan Ye",
      "Kai Xu",
      "Yuhang Huang",
      "Renjiao Yi",
      "Zhiping Cai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02043",
    "title": "Signal Detection for Ultra-Massive MIMO: An Information Geometry  Approach",
    "abstract": "In this paper, we propose an information geometry approach (IGA) for signal detection (SD) in ultra-massive multiple-input multiple-output (MIMO) systems. We formulate the signal detection as obtaining the marginals of the a posteriori probability distribution of the transmitted symbol vector. Then, a maximization of the a posteriori marginals (MPM) for signal detection can be performed. With the information geometry theory, we calculate the approximations of the a posteriori marginals. It is formulated as an iterative m-projection process between submanifolds with different constraints. We then apply the central-limit-theorem (CLT) to simplify the calculation of the m-projection since the direct calculation of the m-projection is of exponential-complexity. With the CLT, we obtain an approximate solution of the m-projection, which is asymptotically accurate. Simulation results demonstrate that the proposed IGA-SD emerges as a promising and efficient method to implement the signal detector in ultra-massive MIMO systems. ",
    "url": "https://arxiv.org/abs/2401.02043",
    "authors": [
      "Jiyuan Yang",
      "Yan Chen",
      "Xiqi Gao",
      "Dirk Slock",
      "Xiang-Gen Xia"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2401.02051",
    "title": "An Example of Evolutionary Computation + Large Language Model Beating  Human: Design of Efficient Guided Local Search",
    "abstract": "It is often very tedious for human experts to design efficient algorithms. Recently, we have proposed a novel Algorithm Evolution using Large Language Model (AEL) framework for automatic algorithm design. AEL combines the power of a large language model and the paradigm of evolutionary computation to design, combine, and modify algorithms automatically. In this paper, we use AEL to design the guide algorithm for guided local search (GLS) to solve the well-known traveling salesman problem (TSP). AEL automatically evolves elite GLS algorithms in two days, with minimal human effort and no model training. Experimental results on 1,000 TSP20-TSP100 instances and TSPLib instances show that AEL-designed GLS outperforms state-of-the-art human-designed GLS with the same iteration budget. It achieves a 0% gap on TSP20 and TSP50 and a 0.032% gap on TSP100 in 1,000 iterations. Our findings mark the emergence of a new era in automatic algorithm design. ",
    "url": "https://arxiv.org/abs/2401.02051",
    "authors": [
      "Fei Liu",
      "Xialiang Tong",
      "Mingxuan Yuan",
      "Xi Lin",
      "Fu Luo",
      "Zhenkun Wang",
      "Zhichao Lu",
      "Qingfu Zhang"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.02054",
    "title": "Less Conservative Robust Reference Governors and Their Applications",
    "abstract": "The applications of reference governors to systems with unmeasured set-bounded disturbances can lead to conservative solutions. This conservatism can be reduced by estimating the disturbance from output measurements and canceling it in the nominal control law. In this paper, a reference governor based on such an approach is considered and time-varying, disturbance and state estimation errors bounding sets are derived. Consequently, the traditional implementation of a reference governor, which exploits a constraint admissible positively-invariant set of constant commands and initial states, is replaced by one which utilizes a time-dependent sequence of similar sets (which are not necessary nested). Examples are reported which include two applications to longitudinal control of aircraft that illustrate handling of elevator uncertainty and wing icing. ",
    "url": "https://arxiv.org/abs/2401.02054",
    "authors": [
      "Miguel Castroviejo-Fernandez",
      "Huayi Li",
      "Andrés Cotorruelo",
      "Emanuele Garone",
      "Ilya Kolmanovsky"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2401.02058",
    "title": "Neural Collapse for Cross-entropy Class-Imbalanced Learning with  Unconstrained ReLU Feature Model",
    "abstract": "The current paradigm of training deep neural networks for classification tasks includes minimizing the empirical risk that pushes the training loss value towards zero, even after the training error has been vanished. In this terminal phase of training, it has been observed that the last-layer features collapse to their class-means and these class-means converge to the vertices of a simplex Equiangular Tight Frame (ETF). This phenomenon is termed as Neural Collapse (NC). To theoretically understand this phenomenon, recent works employ a simplified unconstrained feature model to prove that NC emerges at the global solutions of the training problem. However, when the training dataset is class-imbalanced, some NC properties will no longer be true. For example, the class-means geometry will skew away from the simplex ETF when the loss converges. In this paper, we generalize NC to imbalanced regime for cross-entropy loss under the unconstrained ReLU feature model. We prove that, while the within-class features collapse property still holds in this setting, the class-means will converge to a structure consisting of orthogonal vectors with different lengths. Furthermore, we find that the classifier weights are aligned to the scaled and centered class-means with scaling factors depend on the number of training samples of each class, which generalizes NC in the class-balanced setting. We empirically prove our results through experiments on practical architectures and dataset. ",
    "url": "https://arxiv.org/abs/2401.02058",
    "authors": [
      "Hien Dang",
      "Tho Tran",
      "Tan Nguyen",
      "Nhat Ho"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.02083",
    "title": "Outage Analysis for Active Reconfigurable Intelligent Surface-Enhanced  Wireless Powered Communication Networks",
    "abstract": "Wireless powered communication (WPC) involves the integration of energy harvesting and data transmission. This allows devices to communicate without constant battery replacements or wired power sources. Reconfigurable intelligent surfaces (RISs) can dynamically manipulate radio signals. In this paper, we explore the use of active elements to mitigate double-fading challenges inherent in RIS-aided links. We enhance the reliability performance for an energy-constrained user by combining active RIS and WPC. The theoretical closed-form analysis, which includes transmission rate, harvested energy, and outage probability, provides valuable insights that inform parameter selection. ",
    "url": "https://arxiv.org/abs/2401.02083",
    "authors": [
      "Waqas Khalid",
      "Heejung Yu",
      "Alexandros-Apostolos A. Boulogeorgos"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2401.02086",
    "title": "View-based Explanations for Graph Neural Networks",
    "abstract": "Generating explanations for graph neural networks (GNNs) has been studied to understand their behavior in analytical tasks such as graph classification. Existing approaches aim to understand the overall results of GNNs rather than providing explanations for specific class labels of interest, and may return explanation structures that are hard to access, nor directly queryable. We propose GVEX, a novel paradigm that generates Graph Views for EXplanation. (1) We design a two-tier explanation structure called explanation views. An explanation view consists of a set of graph patterns and a set of induced explanation subgraphs. Given a database G of multiple graphs and a specific class label l assigned by a GNN-based classifier M, it concisely describes the fraction of G that best explains why l is assigned by M. (2) We propose quality measures and formulate an optimization problem to compute optimal explanation views for GNN explanation. We show that the problem is $\\Sigma^2_P$-hard. (3) We present two algorithms. The first one follows an explain-and-summarize strategy that first generates high-quality explanation subgraphs which best explain GNNs in terms of feature influence maximization, and then performs a summarization step to generate patterns. We show that this strategy provides an approximation ratio of 1/2. Our second algorithm performs a single-pass to an input node stream in batches to incrementally maintain explanation views, having an anytime quality guarantee of 1/4 approximation. Using real-world benchmark data, we experimentally demonstrate the effectiveness, efficiency, and scalability of GVEX. Through case studies, we showcase the practical applications of GVEX. ",
    "url": "https://arxiv.org/abs/2401.02086",
    "authors": [
      "Tingyang Chen",
      "Dazhuo Qiu",
      "Yinghui Wu",
      "Arijit Khan",
      "Xiangyu Ke",
      "Yunjun Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02092",
    "title": "k-Winners-Take-All Ensemble Neural Network",
    "abstract": "Ensembling is one approach that improves the performance of a neural network by combining a number of independent neural networks, usually by either averaging or summing up their individual outputs. We modify this ensembling approach by training the sub-networks concurrently instead of independently. This concurrent training of sub-networks leads them to cooperate with each other, and we refer to them as \"cooperative ensemble\". Meanwhile, the mixture-of-experts approach improves a neural network performance by dividing up a given dataset to its sub-networks. It then uses a gating network that assigns a specialization to each of its sub-networks called \"experts\". We improve on these aforementioned ways for combining a group of neural networks by using a k-Winners-Take-All (kWTA) activation function, that acts as the combination method for the outputs of each sub-network in the ensemble. We refer to this proposed model as \"kWTA ensemble neural networks\" (kWTA-ENN). With the kWTA activation function, the losing neurons of the sub-networks are inhibited while the winning neurons are retained. This results in sub-networks having some form of specialization but also sharing knowledge with one another. We compare our approach with the cooperative ensemble and mixture-of-experts, where we used a feed-forward neural network with one hidden layer having 100 neurons as the sub-network architecture. Our approach yields a better performance compared to the baseline models, reaching the following test accuracies on benchmark datasets: 98.34% on MNIST, 88.06% on Fashion-MNIST, 91.56% on KMNIST, and 95.97% on WDBC. ",
    "url": "https://arxiv.org/abs/2401.02092",
    "authors": [
      "Abien Fred Agarap",
      "Arnulfo P. Azcarraga"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.02095",
    "title": "Politics and Propaganda on Social Media: How Twitter and Meta Moderate  State-Linked Information Operations",
    "abstract": "Why do Social Media Corporations (SMCs) engage in state-linked information operations? Social media can significantly influence the global political landscape, allowing governments and other political entities to engage in concerted information operations, shaping or manipulating domestic and foreign political agendas. In response to state-linked political manipulation tactics on social media, Twitter and Meta carried out take-down operations against propaganda networks, accusing them of interfering foreign elections, organizing disinformation campaigns, manipulating political debates and many other issues. This research investigates the two SMCs' policy orientation to explain which factors can affect these two companies' reaction against state-linked information operations. We find that good governance indicators such as democracy are significant elements of SMCs' country-focus. This article also examines whether Meta and Twitter's attention to political regime characteristics is influenced by international political alignments. This research illuminates recent trends in SMCs' take-down operations and illuminating interplay between geopolitics and domestic regime characteristics. ",
    "url": "https://arxiv.org/abs/2401.02095",
    "authors": [
      "Nihat Mugurtay",
      "Umut Duygu",
      "Onur Varol"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.02116",
    "title": "Starling: An I/O-Efficient Disk-Resident Graph Index Framework for  High-Dimensional Vector Similarity Search on Data Segment",
    "abstract": "High-dimensional vector similarity search (HVSS) is receiving a spotlight as a powerful tool for various data science and AI applications. As vector data grows larger, in-memory indexes become extremely expensive because they necessitate substantial expansion of main memory resources. One possible solution is to use disk-based implementation, which stores and searches vector data in high-performance devices like NVMe SSDs. However, HVSS for data segments is still challenging in vector databases, where one machine has multiple segments for system features (like scaling) purposes. In this setting, each segment has limited memory and disk space, so HVSS on the data segment needs to balance accuracy, efficiency, and space cost. Existing disk-based methods are sub-optimal because they do not consider all these requirements together. In this paper, we present Starling, an I/O-efficient disk-resident graph index framework that optimizes data layout and search strategy in the segment. It has two main components: (1) a data layout that includes an in-memory navigation graph and a reordered disk-based graph with locality enhancement, which reduces the search path length and disk bandwidth wastage; and (2) a block search strategy that minimizes expensive disk I/Os when executing a vector query. We conduct extensive experiments to verify Starling's effectiveness, efficiency, and scalability. On a data segment with 2GB memory and 10GB disk capacity, Starling can maintain up to 33 million vectors in 128 dimensions, and serve HVSS with more than 0.9 average precision and top-10 recall rate, and latency of under 1 millisecond. The results show that Starling exhibits 43.9$\\times$ higher throughput with 98% lower query latency than state-of-the-art methods under the same accuracy. ",
    "url": "https://arxiv.org/abs/2401.02116",
    "authors": [
      "Mengzhao Wang",
      "Weizhi Xu",
      "Xiaomeng Yi",
      "Songlin Wu",
      "Zhangyang Peng",
      "Xiangyu Ke",
      "Yunjun Gao",
      "Xiaoliang Xu",
      "Rentong Guo",
      "Charles Xie"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2401.02130",
    "title": "Spectral-based Graph Neutral Networks for Complementary Item  Recommendation",
    "abstract": "Modeling complementary relationships greatly helps recommender systems to accurately and promptly recommend the subsequent items when one item is purchased. Unlike traditional similar relationships, items with complementary relationships may be purchased successively (such as iPhone and Airpods Pro), and they not only share relevance but also exhibit dissimilarity. Since the two attributes are opposites, modeling complementary relationships is challenging. Previous attempts to exploit these relationships have either ignored or oversimplified the dissimilarity attribute, resulting in ineffective modeling and an inability to balance the two attributes. Since Graph Neural Networks (GNNs) can capture the relevance and dissimilarity between nodes in the spectral domain, we can leverage spectral-based GNNs to effectively understand and model complementary relationships. In this study, we present a novel approach called Spectral-based Complementary Graph Neural Networks (SComGNN) that utilizes the spectral properties of complementary item graphs. We make the first observation that complementary relationships consist of low-frequency and mid-frequency components, corresponding to the relevance and dissimilarity attributes, respectively. Based on this spectral observation, we design spectral graph convolutional networks with low-pass and mid-pass filters to capture the low-frequency and mid-frequency components. Additionally, we propose a two-stage attention mechanism to adaptively integrate and balance the two attributes. Experimental results on four e-commerce datasets demonstrate the effectiveness of our model, with SComGNN significantly outperforming existing baseline models. ",
    "url": "https://arxiv.org/abs/2401.02130",
    "authors": [
      "Haitong Luo",
      "Xuying Meng",
      "Suhang Wang",
      "Hanyun Cao",
      "Weiyao Zhang",
      "Yequan Wang",
      "Yujun Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.02143",
    "title": "Graph Neural Networks for Tabular Data Learning: A Survey with Taxonomy  and Directions",
    "abstract": "In this survey, we dive into Tabular Data Learning (TDL) using Graph Neural Networks (GNNs), a domain where deep learning-based approaches have increasingly shown superior performance in both classification and regression tasks compared to traditional methods. The survey highlights a critical gap in deep neural TDL methods: the underrepresentation of latent correlations among data instances and feature values. GNNs, with their innate capability to model intricate relationships and interactions between diverse elements of tabular data, have garnered significant interest and application across various TDL domains. Our survey provides a systematic review of the methods involved in designing and implementing GNNs for TDL (GNN4TDL). It encompasses a detailed investigation into the foundational aspects and an overview of GNN-based TDL methods, offering insights into their evolving landscape. We present a comprehensive taxonomy focused on constructing graph structures and representation learning within GNN-based TDL methods. In addition, the survey examines various training plans, emphasizing the integration of auxiliary tasks to enhance the effectiveness of instance representations. A critical part of our discussion is dedicated to the practical application of GNNs across a spectrum of GNN4TDL scenarios, demonstrating their versatility and impact. Lastly, we discuss the limitations and propose future research directions, aiming to spur advancements in GNN4TDL. This survey serves as a resource for researchers and practitioners, offering a thorough understanding of GNNs' role in revolutionizing TDL and pointing towards future innovations in this promising area. ",
    "url": "https://arxiv.org/abs/2401.02143",
    "authors": [
      "Cheng-Te Li",
      "Yu-Che Tsai",
      "Chih-Yao Chen",
      "Jay Chiehen Liao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.02150",
    "title": "Marginal Debiased Network for Fair Visual Recognition",
    "abstract": "Deep neural networks (DNNs) are often prone to learn the spurious correlations between target classes and bias attributes, like gender and race, inherent in a major portion of training data (bias-aligned samples), thus showing unfair behavior and arising controversy in the modern pluralistic and egalitarian society. In this paper, we propose a novel marginal debiased network (MDN) to learn debiased representations. More specifically, a marginal softmax loss (MSL) is designed by introducing the idea of margin penalty into the fairness problem, which assigns a larger margin for bias-conflicting samples (data without spurious correlations) than for bias-aligned ones, so as to deemphasize the spurious correlations and improve generalization on unbiased test criteria. To determine the margins, our MDN is optimized through a meta learning framework. We propose a meta equalized loss (MEL) to perceive the model fairness, and adaptively update the margin parameters by metaoptimization which requires the trained model guided by the optimal margins should minimize MEL computed on an unbiased meta-validation set. Extensive experiments on BiasedMNIST, Corrupted CIFAR-10, CelebA and UTK-Face datasets demonstrate that our MDN can achieve a remarkable performance on under-represented samples and obtain superior debiased results against the previous approaches. ",
    "url": "https://arxiv.org/abs/2401.02150",
    "authors": [
      "Mei Wang",
      "Weihong Deng",
      "Sen Su"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02154",
    "title": "Disentangle Estimation of Causal Effects from Cross-Silo Data",
    "abstract": "Estimating causal effects among different events is of great importance to critical fields such as drug development. Nevertheless, the data features associated with events may be distributed across various silos and remain private within respective parties, impeding direct information exchange between them. This, in turn, can result in biased estimations of local causal effects, which rely on the characteristics of only a subset of the covariates. To tackle this challenge, we introduce an innovative disentangle architecture designed to facilitate the seamless cross-silo transmission of model parameters, enriched with causal mechanisms, through a combination of shared and private branches. Besides, we introduce global constraints into the equation to effectively mitigate bias within the various missing domains, thereby elevating the accuracy of our causal effect estimation. Extensive experiments conducted on new semi-synthetic datasets show that our method outperforms state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2401.02154",
    "authors": [
      "Yuxuan Liu",
      "Haozhao Wang",
      "Shuang Wang",
      "Zhiming He",
      "Wenchao Xu",
      "Jialiang Zhu",
      "Fan Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2401.02162",
    "title": "Frequency Domain Nuances Mining for Visible-Infrared Person  Re-identification",
    "abstract": "The key of visible-infrared person re-identification (VIReID) lies in how to minimize the modality discrepancy between visible and infrared images. Existing methods mainly exploit the spatial information while ignoring the discriminative frequency information. To address this issue, this paper aims to reduce the modality discrepancy from the frequency domain perspective. Specifically, we propose a novel Frequency Domain Nuances Mining (FDNM) method to explore the cross-modality frequency domain information, which mainly includes an amplitude guided phase (AGP) module and an amplitude nuances mining (ANM) module. These two modules are mutually beneficial to jointly explore frequency domain visible-infrared nuances, thereby effectively reducing the modality discrepancy in the frequency domain. Besides, we propose a center-guided nuances mining loss to encourage the ANM module to preserve discriminative identity information while discovering diverse cross-modality nuances. To the best of our knowledge, this is the first work that explores the potential frequency information for VIReID research. Extensive experiments show that the proposed FDNM has significant advantages in improving the performance of VIReID. Specifically, our method outperforms the second-best method by 5.2\\% in Rank-1 accuracy and 5.8\\% in mAP on the SYSU-MM01 dataset under the indoor search mode, respectively. Besides, we also validate the effectiveness and generalization of our method on the challenging visible-infrared face recognition task. \\textcolor{magenta}{The code will be available.} ",
    "url": "https://arxiv.org/abs/2401.02162",
    "authors": [
      "Yukang Zhang",
      "Yang Lu",
      "Yan Yan",
      "Hanzi Wang",
      "Xuelong Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02163",
    "title": "Enumerating m-Length Walks in Directed Graphs with Constant Delay",
    "abstract": "In this paper, we provide a novel enumeration algorithm for the set of all walks of a given length within a directed graph. Our algorithm has worst-case constant delay between outputting succinct representations of such walks, after a preprocessing step requiring linear time relative to the size of the graph. We apply these results to the problem of enumerating succinct representations of the strings of a given length from a prefix-closed regular language (languages accepted by a finite automaton which has final states only). ",
    "url": "https://arxiv.org/abs/2401.02163",
    "authors": [
      "Duncan Adamson",
      "Pawel Gawrychowski",
      "Florin Manea"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2401.02172",
    "title": "Recognition of Unit Segment and Polyline Graphs is  $\\exists\\mathbb{R}$-Complete",
    "abstract": "Given a set of objects O in the plane, the corresponding intersection graph is defined as follows. A vertex is created for each object and an edge joins two vertices whenever the corresponding objects intersect. We study here the case of unit segments and polylines with exactly k bends. In the recognition problem, we are given a graph and want to decide whether the graph can be represented as the intersection graph of certain geometric objects. In previous work it was shown that various recognition problems are $\\exists\\mathbb{R}$-complete, leaving unit segments and polylines as few remaining natural cases. We show that recognition for both families of objects is $\\exists\\mathbb{R}$-complete. ",
    "url": "https://arxiv.org/abs/2401.02172",
    "authors": [
      "Michael Hoffmann",
      "Tillmann Miltzow",
      "Simon Weber",
      "Lasse Wulf"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2401.02212",
    "title": "Joint Multi-Facts Reasoning Network For Complex Temporal Question  Answering Over Knowledge Graph",
    "abstract": "Temporal Knowledge Graph (TKG) is an extension of regular knowledge graph by attaching the time scope. Existing temporal knowledge graph question answering (TKGQA) models solely approach simple questions, owing to the prior assumption that each question only contains a single temporal fact with explicit/implicit temporal constraints. Hence, they perform poorly on questions which own multiple temporal facts. In this paper, we propose \\textbf{\\underline{J}}oint \\textbf{\\underline{M}}ulti \\textbf{\\underline{F}}acts \\textbf{\\underline{R}}easoning \\textbf{\\underline{N}}etwork (JMFRN), to jointly reasoning multiple temporal facts for accurately answering \\emph{complex} temporal questions. Specifically, JMFRN first retrieves question-related temporal facts from TKG for each entity of the given complex question. For joint reasoning, we design two different attention (\\ie entity-aware and time-aware) modules, which are suitable for universal settings, to aggregate entities and timestamps information of retrieved facts. Moreover, to filter incorrect type answers, we introduce an additional answer type discrimination task. Extensive experiments demonstrate our proposed method significantly outperforms the state-of-art on the well-known complex temporal question benchmark TimeQuestions. ",
    "url": "https://arxiv.org/abs/2401.02212",
    "authors": [
      "Rikui Huang",
      "Wei Wei",
      "Xiaoye Qu",
      "Wenfeng Xie",
      "Xianling Mao",
      "Dangyang Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.02218",
    "title": "Optimizing Information Freshness in Uplink Multiuser MIMO Networks with  Partial Observations",
    "abstract": "This paper investigates a multiuser scheduling problem within an uplink multiple-input multi-output (MIMO) status update network, consisting of a multi-antenna base station (BS) and multiple single-antenna devices. The presence of multiple antennas at the BS introduces spatial degrees-of-freedom, enabling concurrent transmission of status updates from multiple devices in each time slot. Our objective is to optimize network-wide information freshness, quantified by the age of information (AoI) metric, by determining how the BS can best schedule device transmissions, while taking into account the random arrival of status updates at the device side.To address this decision-making problem, we model it as a partially observable Markov decision process (POMDP) and establish that the evolution of belief states for different devices is independent.We also prove that feasible belief states can be described by finite-dimensional vectors. Building on these observations, we develop a dynamic scheduling (DS) policy to solve the POMDP, and then derive an upper bound of its AoI performance, which is used to optimize the parameter configuration. To gain more design insights, we investigate a symmetric network, and put forth a fixed scheduling (FS) policy with lower computational complexity. An action space reduction strategy is applied to further reduce the computational complexity of both DS and FS policies. Our numerical results validate our analyses and indicate that the DS policy with the reduced action space performs almost identically to the original DS policy, and both outperform the baseline policies. ",
    "url": "https://arxiv.org/abs/2401.02218",
    "authors": [
      "Jingwei Liu",
      "Qian Wang",
      "He Chen"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2401.02258",
    "title": "Uncertainty-Aware Deep Attention Recurrent Neural Network for  Heterogeneous Time Series Imputation",
    "abstract": "Missingness is ubiquitous in multivariate time series and poses an obstacle to reliable downstream analysis. Although recurrent network imputation achieved the SOTA, existing models do not scale to deep architectures that can potentially alleviate issues arising in complex data. Moreover, imputation carries the risk of biased estimations of the ground truth. Yet, confidence in the imputed values is always unmeasured or computed post hoc from model output. We propose DEep Attention Recurrent Imputation (DEARI), which jointly estimates missing values and their associated uncertainty in heterogeneous multivariate time series. By jointly representing feature-wise correlations and temporal dynamics, we adopt a self attention mechanism, along with an effective residual component, to achieve a deep recurrent neural network with good imputation performance and stable convergence. We also leverage self-supervised metric learning to boost performance by optimizing sample similarity. Finally, we transform DEARI into a Bayesian neural network through a novel Bayesian marginalization strategy to produce stochastic DEARI, which outperforms its deterministic equivalent. Experiments show that DEARI surpasses the SOTA in diverse imputation tasks using real-world datasets, namely air quality control, healthcare and traffic. ",
    "url": "https://arxiv.org/abs/2401.02258",
    "authors": [
      "Linglong Qian",
      "Zina Ibrahim",
      "Richard Dobson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.02274",
    "title": "ShapeAug: Occlusion Augmentation for Event Camera Data",
    "abstract": "Recently, Dynamic Vision Sensors (DVSs) sparked a lot of interest due to their inherent advantages over conventional RGB cameras. These advantages include a low latency, a high dynamic range and a low energy consumption. Nevertheless, the processing of DVS data using Deep Learning (DL) methods remains a challenge, particularly since the availability of event training data is still limited. This leads to a need for event data augmentation techniques in order to improve accuracy as well as to avoid over-fitting on the training data. Another challenge especially in real world automotive applications is occlusion, meaning one object is hindering the view onto the object behind it. In this paper, we present a novel event data augmentation approach, which addresses this problem by introducing synthetic events for randomly moving objects in a scene. We test our method on multiple DVS classification datasets, resulting in an relative improvement of up to 6.5 % in top1-accuracy. Moreover, we apply our augmentation technique on the real world Gen1 Automotive Event Dataset for object detection, where we especially improve the detection of pedestrians by up to 5 %. ",
    "url": "https://arxiv.org/abs/2401.02274",
    "authors": [
      "Katharina Bendig",
      "René Schuster",
      "Didier Stricker"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02277",
    "title": "Universal Approximation Theorem for Vector- and Hypercomplex-Valued  Neural Networks",
    "abstract": "The universal approximation theorem states that a neural network with one hidden layer can approximate continuous functions on compact sets with any desired precision. This theorem supports using neural networks for various applications, including regression and classification tasks. Furthermore, it is valid for real-valued neural networks and some hypercomplex-valued neural networks such as complex-, quaternion-, tessarine-, and Clifford-valued neural networks. However, hypercomplex-valued neural networks are a type of vector-valued neural network defined on an algebra with additional algebraic or geometric properties. This paper extends the universal approximation theorem for a wide range of vector-valued neural networks, including hypercomplex-valued models as particular instances. Precisely, we introduce the concept of non-degenerate algebra and state the universal approximation theorem for neural networks defined on such algebras. ",
    "url": "https://arxiv.org/abs/2401.02277",
    "authors": [
      "Marcos Eduardo Valle",
      "Wington L. Vital",
      "Guilherme Vieira"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2401.02283",
    "title": "DEM: A Method for Certifying Deep Neural Network Classifier Outputs in  Aerospace",
    "abstract": "Software development in the aerospace domain requires adhering to strict, high-quality standards. While there exist regulatory guidelines for commercial software in this domain (e.g., ARP-4754 and DO-178), these do not apply to software with deep neural network (DNN) components. Consequently, it is unclear how to allow aerospace systems to benefit from the deep learning revolution. Our work here seeks to address this challenge with a novel, output-centric approach for DNN certification. Our method employs statistical verification techniques, and has the key advantage of being able to flag specific inputs for which the DNN's output may be unreliable - so that they may be later inspected by a human expert. To achieve this, our method conducts a statistical analysis of the DNN's predictions for other, nearby inputs, in order to detect inconsistencies. This is in contrast to existing techniques, which typically attempt to certify the entire DNN, as opposed to individual outputs. Our method uses the DNN as a black-box, and makes no assumptions about its topology. We hope that this work constitutes another step towards integrating DNNs in safety-critical applications - especially in the aerospace domain, where high standards of quality and reliability are crucial. ",
    "url": "https://arxiv.org/abs/2401.02283",
    "authors": [
      "Guy Katz",
      "Natan Levy",
      "Idan Refaeli",
      "Raz Yerushalmi"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02287",
    "title": "Distillation-based fabric anomaly detection",
    "abstract": "Unsupervised texture anomaly detection has been a concerning topic in a vast amount of industrial processes. Patterned textures inspection, particularly in the context of fabric defect detection, is indeed a widely encountered use case. This task involves handling a diverse spectrum of colors and textile types, encompassing a wide range of fabrics. Given the extensive variability in colors, textures, and defect types, fabric defect detection poses a complex and challenging problem in the field of patterned textures inspection. In this article, we propose a knowledge distillation-based approach tailored specifically for addressing the challenge of unsupervised anomaly detection in textures resembling fabrics. Our method aims to redefine the recently introduced reverse distillation approach, which advocates for an encoder-decoder design to mitigate classifier bias and to prevent the student from reconstructing anomalies. In this study, we present a new reverse distillation technique for the specific task of fabric defect detection. Our approach involves a meticulous design selection that strategically highlights high-level features. To demonstrate the capabilities of our approach both in terms of performance and inference speed, we conducted a series of experiments on multiple texture datasets, including MVTEC AD, AITEX, and TILDA, alongside conducting experiments on a dataset acquired from a textile manufacturing facility. The main contributions of this paper are the following: a robust texture anomaly detector utilizing a reverse knowledge-distillation technique suitable for both anomaly detection and domain generalization and a novel dataset encompassing a diverse range of fabrics and defects. ",
    "url": "https://arxiv.org/abs/2401.02287",
    "authors": [
      "Simon Thomine",
      "Hichem Snoussi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02290",
    "title": "Path-based Explanation for Knowledge Graph Completion",
    "abstract": "Graph Neural Networks (GNNs) have achieved great success in Knowledge Graph Completion (KGC) by modelling how entities and relations interact in recent years. However, the explanation of the predicted facts has not caught the necessary attention. Proper explanations for the results of GNN-based KGC models increase model transparency and help researchers develop more reliable models. Existing practices for explaining KGC tasks rely on instance/subgraph-based approaches, while in some scenarios, paths can provide more user-friendly and interpretable explanations. Nonetheless, the methods for generating path-based explanations for KGs have not been well-explored. To address this gap, we propose Power-Link, the first path-based KGC explainer that explores GNN-based models. We design a novel simplified graph-powering technique, which enables the generation of path-based explanations with a fully parallelisable and memory-efficient training scheme. We further introduce three new metrics for quantitative evaluation of the explanations, together with a qualitative human evaluation. Extensive experiments demonstrate that Power-Link outperforms the SOTA baselines in interpretability, efficiency, and scalability. ",
    "url": "https://arxiv.org/abs/2401.02290",
    "authors": [
      "Heng Chang",
      "Jiangnan Ye",
      "Alejo Lopez Avila",
      "Jinhua Du",
      "Jia Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.02297",
    "title": "Are LLMs Robust for Spoken Dialogues?",
    "abstract": "Large Pre-Trained Language Models have demonstrated state-of-the-art performance in different downstream tasks, including dialogue state tracking and end-to-end response generation. Nevertheless, most of the publicly available datasets and benchmarks on task-oriented dialogues focus on written conversations. Consequently, the robustness of the developed models to spoken interactions is unknown. In this work, we have evaluated the performance of LLMs for spoken task-oriented dialogues on the DSTC11 test sets. Due to the lack of proper spoken dialogue datasets, we have automatically transcribed a development set of spoken dialogues with a state-of-the-art ASR engine. We have characterized the ASR-error types and their distributions and simulated these errors in a large dataset of dialogues. We report the intrinsic (perplexity) and extrinsic (human evaluation) performance of fine-tuned GPT-2 and T5 models in two subtasks of response generation and dialogue state tracking, respectively. The results show that LLMs are not robust to spoken noise by default, however, fine-tuning/training such models on a proper dataset of spoken TODs can result in a more robust performance. ",
    "url": "https://arxiv.org/abs/2401.02297",
    "authors": [
      "Seyed Mahed Mousavi",
      "Gabriel Roccabruna",
      "Simone Alghisi",
      "Massimo Rizzoli",
      "Mirco Ravanelli",
      "Giuseppe Riccardi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.02300",
    "title": "Robust Physics Informed Neural Networks",
    "abstract": "We introduce a Robust version of the Physics-Informed Neural Networks (RPINNs) to approximate the Partial Differential Equations (PDEs) solution. Standard Physics Informed Neural Networks (PINN) takes into account the governing physical laws described by PDE during the learning process. The network is trained on a data set that consists of randomly selected points in the physical domain and its boundary. PINNs have been successfully applied to solve various problems described by PDEs with boundary conditions. The loss function in traditional PINNs is based on the strong residuals of the PDEs. This loss function in PINNs is generally not robust with respect to the true error. The loss function in PINNs can be far from the true error, which makes the training process more difficult. In particular, we do not know if the training process has already converged to the solution with the required accuracy. This is especially true if we do not know the exact solution, so we cannot estimate the true error during the training. This paper introduces a different way of defining the loss function. It incorporates the residual and the inverse of the Gram matrix, computed using the energy norm. We test our RPINN algorithm on two Laplace problems and one advection-diffusion problem in two spatial dimensions. We conclude that RPINN is a robust method. The proposed loss coincides well with the true error of the solution, as measured in the energy norm. Thus, we know if our training process goes well, and we know when to stop the training to obtain the neural network approximation of the solution of the PDE with the true error of required accuracy. ",
    "url": "https://arxiv.org/abs/2401.02300",
    "authors": [
      "Marcin Łoś",
      "Maciej Paszyński"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2401.02306",
    "title": "Secure Control of Connected and Automated Vehicles Using Trust-Aware  Robust Event-Triggered Control Barrier Functions",
    "abstract": "We address the security of a network of Connected and Automated Vehicles (CAVs) cooperating to safely navigate through a conflict area (e.g., traffic intersections, merging roadways, roundabouts). Previous studies have shown that such a network can be targeted by adversarial attacks causing traffic jams or safety violations ending in collisions. We focus on attacks targeting the V2X communication network used to share vehicle data and consider as well uncertainties due to noise in sensor measurements and communication channels. To combat these, motivated by recent work on the safe control of CAVs, we propose a trust-aware robust event-triggered decentralized control and coordination framework that can provably guarantee safety. We maintain a trust metric for each vehicle in the network computed based on their behavior and used to balance the tradeoff between conservativeness (when deeming every vehicle as untrustworthy) and guaranteed safety and security. It is important to highlight that our framework is invariant to the specific choice of the trust framework. Based on this framework, we propose an attack detection and mitigation scheme which has twofold benefits: (i) the trust framework is immune to false positives, and (ii) it provably guarantees safety against false positive cases. We use extensive simulations (in SUMO and CARLA) to validate the theoretical guarantees and demonstrate the efficacy of our proposed scheme to detect and mitigate adversarial attacks. ",
    "url": "https://arxiv.org/abs/2401.02306",
    "authors": [
      "H M Sabbir Ahmad",
      "Ehsan Sabouni",
      "Akua Dickson",
      "Wei Xiao",
      "Christos G. Cassandras",
      "Wenchao Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2401.02309",
    "title": "TR-DETR: Task-Reciprocal Transformer for Joint Moment Retrieval and  Highlight Detection",
    "abstract": "Video moment retrieval (MR) and highlight detection (HD) based on natural language queries are two highly related tasks, which aim to obtain relevant moments within videos and highlight scores of each video clip. Recently, several methods have been devoted to building DETR-based networks to solve both MR and HD jointly. These methods simply add two separate task heads after multi-modal feature extraction and feature interaction, achieving good performance. Nevertheless, these approaches underutilize the reciprocal relationship between two tasks. In this paper, we propose a task-reciprocal transformer based on DETR (TR-DETR) that focuses on exploring the inherent reciprocity between MR and HD. Specifically, a local-global multi-modal alignment module is first built to align features from diverse modalities into a shared latent space. Subsequently, a visual feature refinement is designed to eliminate query-irrelevant information from visual features for modal interaction. Finally, a task cooperation module is constructed to refine the retrieval pipeline and the highlight score prediction process by utilizing the reciprocity between MR and HD. Comprehensive experiments on QVHighlights, Charades-STA and TVSum datasets demonstrate that TR-DETR outperforms existing state-of-the-art methods. Codes are available at \\url{https://github.com/mingyao1120/TR-DETR}. ",
    "url": "https://arxiv.org/abs/2401.02309",
    "authors": [
      "Hao Sun",
      "Mingyao Zhou",
      "Wenjing Chen",
      "Wei Xie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2401.02313",
    "title": "SuperEdge: Towards a Generalization Model for Self-Supervised Edge  Detection",
    "abstract": "Edge detection is a fundamental technique in various computer vision tasks. Edges are indeed effectively delineated by pixel discontinuity and can offer reliable structural information even in textureless areas. State-of-the-art heavily relies on pixel-wise annotations, which are labor-intensive and subject to inconsistencies when acquired manually. In this work, we propose a novel self-supervised approach for edge detection that employs a multi-level, multi-homography technique to transfer annotations from synthetic to real-world datasets. To fully leverage the generated edge annotations, we developed SuperEdge, a streamlined yet efficient model capable of concurrently extracting edges at pixel-level and object-level granularity. Thanks to self-supervised training, our method eliminates the dependency on manual annotated edge labels, thereby enhancing its generalizability across diverse datasets. Comparative evaluations reveal that SuperEdge advances edge detection, demonstrating improvements of 4.9% in ODS and 3.3% in OIS over the existing STEdge method on BIPEDv2. ",
    "url": "https://arxiv.org/abs/2401.02313",
    "authors": [
      "Leng Kai",
      "Zhang Zhijie",
      "Liu Jie",
      "Zed Boukhers",
      "Sui Wei",
      "Cong Yang",
      "Li Zhijun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02325",
    "title": "A Robust Quantile Huber Loss With Interpretable Parameter Adjustment In  Distributional Reinforcement Learning",
    "abstract": "Distributional Reinforcement Learning (RL) estimates return distribution mainly by learning quantile values via minimizing the quantile Huber loss function, entailing a threshold parameter often selected heuristically or via hyperparameter search, which may not generalize well and can be suboptimal. This paper introduces a generalized quantile Huber loss function derived from Wasserstein distance (WD) calculation between Gaussian distributions, capturing noise in predicted (current) and target (Bellman-updated) quantile values. Compared to the classical quantile Huber loss, this innovative loss function enhances robustness against outliers. Notably, the classical Huber loss function can be seen as an approximation of our proposed loss, enabling parameter adjustment by approximating the amount of noise in the data during the learning process. Empirical tests on Atari games, a common application in distributional RL, and a recent hedging strategy using distributional RL, validate the effectiveness of our proposed loss function and its potential for parameter adjustments in distributional RL. ",
    "url": "https://arxiv.org/abs/2401.02325",
    "authors": [
      "Parvin Malekzadeh",
      "Konstantinos N. Plataniotis",
      "Zissis Poulos",
      "Zeyu Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.02329",
    "title": "Not all Minorities are Equal: Empty-Class-Aware Distillation for  Heterogeneous Federated Learning",
    "abstract": "Data heterogeneity, characterized by disparities in local data distribution across clients, poses a significant challenge in federated learning. Substantial efforts have been devoted to addressing the heterogeneity in local label distribution. As minority classes suffer from worse accuracy due to overfitting on local imbalanced data, prior methods often incorporate class-balanced learning techniques during local training. Despite the improved mean accuracy across all classes, we observe that empty classes-referring to categories absent from a client's data distribution-are still not well recognized. This paper introduces FedED, a novel approach in heterogeneous federated learning that integrates both empty-class distillation and logit suppression simultaneously. Specifically, empty-class distillation leverages knowledge distillation during local training on each client to retain essential information related to empty classes from the global model. Moreover, logit suppression directly penalizes network logits for non-label classes, effectively addressing misclassifications in minority classes that may be biased toward majority classes. Extensive experiments validate the efficacy of FedED, surpassing previous state-of-the-art methods across diverse datasets with varying degrees of label distribution shift. ",
    "url": "https://arxiv.org/abs/2401.02329",
    "authors": [
      "Kuangpu Guo",
      "Yuhe Ding",
      "Jian Liang",
      "Ran He",
      "Zilei Wang",
      "Tieniu Tan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02335",
    "title": "Linguistic Profiling of Deepfakes: An Open Database for Next-Generation  Deepfake Detection",
    "abstract": "The emergence of text-to-image generative models has revolutionized the field of deepfakes, enabling the creation of realistic and convincing visual content directly from textual descriptions. However, this advancement presents considerably greater challenges in detecting the authenticity of such content. Existing deepfake detection datasets and methods often fall short in effectively capturing the extensive range of emerging deepfakes and offering satisfactory explanatory information for detection. To address the significant issue, this paper introduces a deepfake database (DFLIP-3K) for the development of convincing and explainable deepfake detection. It encompasses about 300K diverse deepfake samples from approximately 3K generative models, which boasts the largest number of deepfake models in the literature. Moreover, it collects around 190K linguistic footprints of these deepfakes. The two distinguished features enable DFLIP-3K to develop a benchmark that promotes progress in linguistic profiling of deepfakes, which includes three sub-tasks namely deepfake detection, model identification, and prompt prediction. The deepfake model and prompt are two essential components of each deepfake, and thus dissecting them linguistically allows for an invaluable exploration of trustworthy and interpretable evidence in deepfake detection, which we believe is the key for the next-generation deepfake detection. Furthermore, DFLIP-3K is envisioned as an open database that fosters transparency and encourages collaborative efforts to further enhance its growth. Our extensive experiments on the developed benchmark verify that our DFLIP-3K database is capable of serving as a standardized resource for evaluating and comparing linguistic-based deepfake detection, identification, and prompt prediction techniques. ",
    "url": "https://arxiv.org/abs/2401.02335",
    "authors": [
      "Yabin Wang",
      "Zhiwu Huang",
      "Zhiheng Ma",
      "Xiaopeng Hong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02342",
    "title": "Evasive Hardware Trojan through Adversarial Power Trace",
    "abstract": "The globalization of the Integrated Circuit (IC) supply chain, driven by time-to-market and cost considerations, has made ICs vulnerable to hardware Trojans (HTs). Against this threat, a promising approach is to use Machine Learning (ML)-based side-channel analysis, which has the advantage of being a non-intrusive method, along with efficiently detecting HTs under golden chip-free settings. In this paper, we question the trustworthiness of ML-based HT detection via side-channel analysis. We introduce a HT obfuscation (HTO) approach to allow HTs to bypass this detection method. Rather than theoretically misleading the model by simulated adversarial traces, a key aspect of our approach is the design and implementation of adversarial noise as part of the circuitry, alongside the HT. We detail HTO methodologies for ASICs and FPGAs, and evaluate our approach using TrustHub benchmark. Interestingly, we found that HTO can be implemented with only a single transistor for ASIC designs to generate adversarial power traces that can fool the defense with 100% efficiency. We also efficiently implemented our approach on a Spartan 6 Xilinx FPGA using 2 different variants: (i) DSP slices-based, and (ii) ring-oscillator-based design. Additionally, we assess the efficiency of countermeasures like spectral domain analysis, and we show that an adaptive attacker can still design evasive HTOs by constraining the design with a spectral noise budget. In addition, while adversarial training (AT) offers higher protection against evasive HTs, AT models suffer from a considerable utility loss, potentially rendering them unsuitable for such security application. We believe this research represents a significant step in understanding and exploiting ML vulnerabilities in a hardware security context, and we make all resources and designs openly available online: https://dev.d18uu4lqwhbmka.amplifyapp.com ",
    "url": "https://arxiv.org/abs/2401.02342",
    "authors": [
      "Behnam Omidi",
      "Khaled N. Khasawneh",
      "Ihsen Alouani"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Hardware Architecture (cs.AR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02347",
    "title": "Mining Fine-Grained Image-Text Alignment for Zero-Shot Captioning via  Text-Only Training",
    "abstract": "Image captioning aims at generating descriptive and meaningful textual descriptions of images, enabling a broad range of vision-language applications. Prior works have demonstrated that harnessing the power of Contrastive Image Language Pre-training (CLIP) offers a promising approach to achieving zero-shot captioning, eliminating the need for expensive caption annotations. However, the widely observed modality gap in the latent space of CLIP harms the performance of zero-shot captioning by breaking the alignment between paired image-text features. To address this issue, we conduct an analysis on the CLIP latent space which leads to two findings. Firstly, we observe that the CLIP's visual feature of image subregions can achieve closer proximity to the paired caption due to the inherent information loss in text descriptions. In addition, we show that the modality gap between a paired image-text can be empirically modeled as a zero-mean Gaussian distribution. Motivated by the findings, we propose a novel zero-shot image captioning framework with text-only training to reduce the modality gap. In particular, we introduce a subregion feature aggregation to leverage local region information, which produces a compact visual representation for matching text representation. Moreover, we incorporate a noise injection and CLIP reranking strategy to boost captioning performance. We also extend our framework to build a zero-shot VQA pipeline, demonstrating its generality. Through extensive experiments on common captioning and VQA datasets such as MSCOCO, Flickr30k and VQAV2, we show that our method achieves remarkable performance improvements. Code is available at https://github.com/Artanic30/MacCap. ",
    "url": "https://arxiv.org/abs/2401.02347",
    "authors": [
      "Longtian Qiu",
      "Shan Ning",
      "Xuming He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.02357",
    "title": "Fit-NGP: Fitting Object Models to Neural Graphics Primitives",
    "abstract": "Accurate 3D object pose estimation is key to enabling many robotic applications that involve challenging object interactions. In this work, we show that the density field created by a state-of-the-art efficient radiance field reconstruction method is suitable for highly accurate and robust pose estimation for objects with known 3D models, even when they are very small and with challenging reflective surfaces. We present a fully automatic object pose estimation system based on a robot arm with a single wrist-mounted camera, which can scan a scene from scratch, detect and estimate the 6-Degrees of Freedom (DoF) poses of multiple objects within a couple of minutes of operation. Small objects such as bolts and nuts are estimated with accuracy on order of 1mm. ",
    "url": "https://arxiv.org/abs/2401.02357",
    "authors": [
      "Marwan Taher",
      "Ignacio Alzugaray",
      "Andrew J. Davison"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02361",
    "title": "An Open and Comprehensive Pipeline for Unified Object Grounding and  Detection",
    "abstract": "Grounding-DINO is a state-of-the-art open-set detection model that tackles multiple vision tasks including Open-Vocabulary Detection (OVD), Phrase Grounding (PG), and Referring Expression Comprehension (REC). Its effectiveness has led to its widespread adoption as a mainstream architecture for various downstream applications. However, despite its significance, the original Grounding-DINO model lacks comprehensive public technical details due to the unavailability of its training code. To bridge this gap, we present MM-Grounding-DINO, an open-source, comprehensive, and user-friendly baseline, which is built with the MMDetection toolbox. It adopts abundant vision datasets for pre-training and various detection and grounding datasets for fine-tuning. We give a comprehensive analysis of each reported result and detailed settings for reproduction. The extensive experiments on the benchmarks mentioned demonstrate that our MM-Grounding-DINO-Tiny outperforms the Grounding-DINO-Tiny baseline. We release all our models to the research community. Codes and trained models are released at https://github.com/open-mmlab/mmdetection/configs/mm_grounding_dino. ",
    "url": "https://arxiv.org/abs/2401.02361",
    "authors": [
      "Xiangyu Zhao",
      "Yicheng Chen",
      "Shilin Xu",
      "Xiangtai Li",
      "Xinjiang Wang",
      "Yining Li",
      "Haian Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02379",
    "title": "Detection and Discovery of Misinformation Sources using Attributed  Webgraphs",
    "abstract": "Website reliability labels underpin almost all research in misinformation detection. However, misinformation sources often exhibit transient behavior, which makes many such labeled lists obsolete over time. We demonstrate that Search Engine Optimization (SEO) attributes provide strong signals for predicting news site reliability. We introduce a novel attributed webgraph dataset with labeled news domains and their connections to outlinking and backlinking domains. We demonstrate the success of graph neural networks in detecting news site reliability using these attributed webgraphs, and show that our baseline news site reliability classifier outperforms current SoTA methods on the PoliticalNews dataset, achieving an F1 score of 0.96. Finally, we introduce and evaluate a novel graph-based algorithm for discovering previously unknown misinformation news sources. ",
    "url": "https://arxiv.org/abs/2401.02379",
    "authors": [
      "Peter Carragher",
      "Evan M. Williams",
      "Kathleen M. Carley"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2401.02398",
    "title": "Generating synthetic data for neural operators",
    "abstract": "Numerous developments in the recent literature show the promising potential of deep learning in obtaining numerical solutions to partial differential equations (PDEs) beyond the reach of current numerical solvers. However, data-driven neural operators all suffer from the same problem: the data needed to train a network depends on classical numerical solvers such as finite difference or finite element, among others. In this paper, we propose a new approach to generating synthetic functional training data that does not require solving a PDE numerically. The way we do this is simple: we draw a large number $N$ of independent and identically distributed `random functions' $u_j$ from the underlying solution space (e.g., $H_0^1(\\Omega)$) in which we know the solution lies according to classical theory. We then plug each such random candidate solution into the equation and get a corresponding right-hand side function $f_j$ for the equation, and consider $(f_j, u_j)_{j=1}^N$ as supervised training data for learning the underlying inverse problem $f \\rightarrow u$. This `backwards' approach to generating training data only requires derivative computations, in contrast to standard `forward' approaches, which require a numerical PDE solver, enabling us to generate a large number of such data points quickly and efficiently. While the idea is simple, we hope that this method will expand the potential for developing neural PDE solvers that do not depend on classical numerical solvers. ",
    "url": "https://arxiv.org/abs/2401.02398",
    "authors": [
      "Erisa Hasani",
      "Rachel A. Ward"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2401.02403",
    "title": "Real-Time 2D Temperature Field Prediction in Metal Additive  Manufacturing Using Physics-Informed Neural Networks",
    "abstract": "Accurately predicting the temperature field in metal additive manufacturing (AM) processes is critical to preventing overheating, adjusting process parameters, and ensuring process stability. While physics-based computational models offer precision, they are often time-consuming and unsuitable for real-time predictions and online control in iterative design scenarios. Conversely, machine learning models rely heavily on high-quality datasets, which can be costly and challenging to obtain within the metal AM domain. Our work addresses this by introducing a physics-informed neural network framework specifically designed for temperature field prediction in metal AM. This framework incorporates a physics-informed input, physics-informed loss function, and a Convolutional Long Short-Term Memory (ConvLSTM) architecture. Utilizing real-time temperature data from the process, our model predicts 2D temperature fields for future timestamps across diverse geometries, deposition patterns, and process parameters. We validate the proposed framework in two scenarios: full-field temperature prediction for a thin wall and 2D temperature field prediction for cylinder and cubic parts, demonstrating errors below 3% and 1%, respectively. Our proposed framework exhibits the flexibility to be applied across diverse scenarios with varying process parameters, geometries, and deposition patterns. ",
    "url": "https://arxiv.org/abs/2401.02403",
    "authors": [
      "Pouyan Sajadi",
      "Mostafa Rahmani Dehaghani",
      "Yifan Tang",
      "G. Gary Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.02192",
    "title": "Nodule detection and generation on chest X-rays: NODE21 Challenge",
    "abstract": "Pulmonary nodules may be an early manifestation of lung cancer, the leading cause of cancer-related deaths among both men and women. Numerous studies have established that deep learning methods can yield high-performance levels in the detection of lung nodules in chest X-rays. However, the lack of gold-standard public datasets slows down the progression of the research and prevents benchmarking of methods for this task. To address this, we organized a public research challenge, NODE21, aimed at the detection and generation of lung nodules in chest X-rays. While the detection track assesses state-of-the-art nodule detection systems, the generation track determines the utility of nodule generation algorithms to augment training data and hence improve the performance of the detection systems. This paper summarizes the results of the NODE21 challenge and performs extensive additional experiments to examine the impact of the synthetically generated nodule training images on the detection algorithm performance. ",
    "url": "https://arxiv.org/abs/2401.02192",
    "authors": [
      "Ecem Sogancioglu",
      "Bram van Ginneken",
      "Finn Behrendt",
      "Marcel Bengs",
      "Alexander Schlaefer",
      "Miron Radu",
      "Di Xu",
      "Ke Sheng",
      "Fabien Scalzo",
      "Eric Marcus",
      "Samuele Papa",
      "Jonas Teuwen",
      "Ernst Th. Scholten",
      "Steven Schalekamp",
      "Nils Hendrix",
      "Colin Jacobs",
      "Ward Hendrix",
      "Clara I Sánchez",
      "Keelin Murphy"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02194",
    "title": "Inherently robust suboptimal MPC for autonomous racing with anytime  feasible SQP",
    "abstract": "In recent years, the increasing need for high-performance controllers in applications like autonomous driving has motivated the development of optimization routines tailored to specific control problems. In this paper, we propose an efficient inexact model predictive control (MPC) strategy for autonomous miniature racing with inherent robustness properties. We rely on a feasible sequential quadratic programming (SQP) algorithm capable of generating feasible intermediate iterates such that the solver can be stopped after any number of iterations, without jeopardizing recursive feasibility. In this way, we provide a strategy that computes suboptimal and yet feasible solutions with a computational footprint that is much lower than state-of-the-art methods based on the computation of locally optimal solutions. Under suitable assumptions on the terminal set and on the controllability properties of the system, we can state that, for any sufficiently small disturbance affecting the system's dynamics, recursive feasibility can be guaranteed. We validate the effectiveness of the proposed strategy in simulation and by deploying it onto a physical experiment with autonomous miniature race cars. Both the simulation and experimental results demonstrate that, using the feasible SQP method, a feasible solution can be obtained with moderate additional computational effort compared to strategies that resort to early termination without providing a feasible solution. At the same time, the proposed method is significantly faster than the state-of-the-art solver Ipopt. ",
    "url": "https://arxiv.org/abs/2401.02194",
    "authors": [
      "Logan Numerow",
      "Andrea Zanelli",
      "Andrea Carron",
      "Melanie N. Zeilinger"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2401.02203",
    "title": "Robust bilinear factor analysis based on the matrix-variate $t$  distribution",
    "abstract": "Factor Analysis based on multivariate $t$ distribution ($t$fa) is a useful robust tool for extracting common factors on heavy-tailed or contaminated data. However, $t$fa is only applicable to vector data. When $t$fa is applied to matrix data, it is common to first vectorize the matrix observations. This introduces two challenges for $t$fa: (i) the inherent matrix structure of the data is broken, and (ii) robustness may be lost, as vectorized matrix data typically results in a high data dimension, which could easily lead to the breakdown of $t$fa. To address these issues, starting from the intrinsic matrix structure of matrix data, a novel robust factor analysis model, namely bilinear factor analysis built on the matrix-variate $t$ distribution ($t$bfa), is proposed in this paper. The novelty is that it is capable to simultaneously extract common factors for both row and column variables of interest on heavy-tailed or contaminated matrix data. Two efficient algorithms for maximum likelihood estimation of $t$bfa are developed. Closed-form expression for the Fisher information matrix to calculate the accuracy of parameter estimates are derived. Empirical studies are conducted to understand the proposed $t$bfa model and compare with related competitors. The results demonstrate the superiority and practicality of $t$bfa. Importantly, $t$bfa exhibits a significantly higher breakdown point than $t$fa, making it more suitable for matrix data. ",
    "url": "https://arxiv.org/abs/2401.02203",
    "authors": [
      "Xuan Ma",
      "Jianhua Zhao",
      "Changchun Shang",
      "Fen Jiang",
      "Philip L.H. Yu"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02358",
    "title": "A novel method to enhance pneumonia detection via a model-level  ensembling of CNN and vision transformer",
    "abstract": "Pneumonia remains a leading cause of morbidity and mortality worldwide. Chest X-ray (CXR) imaging is a fundamental diagnostic tool, but traditional analysis relies on time-intensive expert evaluation. Recently, deep learning has shown immense potential for automating pneumonia detection from CXRs. This paper explores applying neural networks to improve CXR-based pneumonia diagnosis. We developed a novel model fusing Convolution Neural networks (CNN) and Vision Transformer networks via model-level ensembling. Our fusion architecture combines a ResNet34 variant and a Multi-Axis Vision Transformer small model. Both base models are initialized with ImageNet pre-trained weights. The output layers are removed, and features are combined using a flattening layer before final classification. Experiments used the Kaggle pediatric pneumonia dataset containing 1,341 normal and 3,875 pneumonia CXR images. We compared our model against standalone ResNet34, Vision Transformer, and Swin Transformer Tiny baseline models using identical training procedures. Extensive data augmentation, Adam optimization, learning rate warmup, and decay were employed. The fusion model achieved a state-of-the-art accuracy of 94.87%, surpassing the baselines. We also attained excellent sensitivity, specificity, kappa score, and positive predictive value. Confusion matrix analysis confirms fewer misclassifications. The ResNet34 and Vision Transformer combination enables jointly learning robust features from CNNs and Transformer paradigms. This model-level ensemble technique effectively integrates their complementary strengths for enhanced pneumonia classification. ",
    "url": "https://arxiv.org/abs/2401.02358",
    "authors": [
      "Sandeep Angara",
      "Nishith Reddy Mannuru",
      "Aashrith Mannuru",
      "Sharath Thirunagaru"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02373",
    "title": "Mutual-visibility problems on graphs of diameter two",
    "abstract": "The mutual-visibility problem in a graph $G$ asks for the cardinality of a largest set of vertices $S\\subseteq V(G)$ so that for any two vertices $x,y\\in S$ there is a shortest $x,y$-path $P$ so that all internal vertices of $P$ are not in $S$. This is also said as $x,y$ are visible with respect to $S$, or $S$-visible for short. Variations of this problem are known, based on the extension of the visibility property of vertices that are in and/or outside $S$. Such variations are called total, outer and dual mutual-visibility problems. This work is focused on studying the corresponding four visibility parameters in graphs of diameter two, throughout showing bounds and/or closed formulae for these parameters. The mutual-visibility problem in the Cartesian product of two complete graphs is equivalent to (an instance of) the celebrated Zarankievicz's problem. Here we study the dual and outer mutual-visibility problem for the Cartesian product of two complete graphs and all the mutual-visibility problems for the direct product of such graphs as well. We also study all the mutual-visibility problems for the line graphs of complete and complete bipartite graphs. As a consequence of this study, we present several relationships between the mentioned problems and some instances of the classical Tur\\'an problem. Moreover, we study the visibility problems for cographs and several non-trivial diameter-two graphs of minimum size. ",
    "url": "https://arxiv.org/abs/2401.02373",
    "authors": [
      "Serafino Cicerone",
      "Gabriele Di Stefano",
      "Sandi Klavžar",
      "Ismael G. Yero"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2401.02378",
    "title": "Opinion formation in the world trade network",
    "abstract": "We extend the opinion formation approach to probe the world influence of economical organizations. Our opinion formation model mimics a battle between currencies within the international trade network. Based on the United Nations Comtrade database, we construct the world trade network for the years of the last decade from 2010 to 2020. We consider different core groups constituted by countries preferring to trade in a specific currency. We will consider principally two core groups, namely, 5 Anglo-Saxon countries which prefer to trade in US dollar and the 11 BRICS+ which prefer to trade in a hypothetical currency, hereafter called BRI, pegged to their economies. We determine the trade currency preference of the other countries via a Monte Carlo process depending on the direct transactions between the countries. The results obtained in the frame of this mathematical model show that starting from year 2014 the majority of the world countries would have preferred to trade in BRI than USD. The Monte Carlo process reaches a steady state with 3 distinct groups: two groups of countries preferring, whatever is the initial distribution of the trade currency preferences, to trade, one in BRI and the other in USD, and a third group of countries swinging as a whole between USD and BRI depending on the initial distribution of the trade currency preferences. We also analyze the battle between USD, EUR and BRI, and present the reduced Google matrix description of the trade relations between the Anglo-Saxon countries and the BRICS+. ",
    "url": "https://arxiv.org/abs/2401.02378",
    "authors": [
      "Célestin Coquidé",
      "José Lages",
      "Dima L. Shepelyansky"
    ],
    "subjectives": [
      "Trading and Market Microstructure (q-fin.TR)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2401.02417",
    "title": "Task Oriented Dialogue as a Catalyst for Self-Supervised Automatic  Speech Recognition",
    "abstract": "While word error rates of automatic speech recognition (ASR) systems have consistently fallen, natural language understanding (NLU) applications built on top of ASR systems still attribute significant numbers of failures to low-quality speech recognition results. Existing assistant systems collect large numbers of these unsuccessful interactions, but these systems usually fail to learn from these interactions, even in an offline fashion. In this work, we introduce CLC: Contrastive Learning for Conversations, a family of methods for contrastive fine-tuning of models in a self-supervised fashion, making use of easily detectable artifacts in unsuccessful conversations with assistants. We demonstrate that our CLC family of approaches can improve the performance of ASR models on OD3, a new public large-scale semi-synthetic meta-dataset of audio task-oriented dialogues, by up to 19.2%. These gains transfer to real-world systems as well, where we show that CLC can help to improve performance by up to 6.7% over baselines. We make OD3 publicly available at https://github.com/amazon-science/amazon-od3 . ",
    "url": "https://arxiv.org/abs/2401.02417",
    "authors": [
      "David M. Chan",
      "Shalini Ghosh",
      "Hitesh Tulsiani",
      "Ariya Rastrow",
      "Björn Hoffmeister"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2104.10561",
    "title": "Covert Channel Attack to Federated Learning Systems",
    "abstract": " Title: Covert Channel Attack to Federated Learning Systems ",
    "url": "https://arxiv.org/abs/2104.10561",
    "authors": [
      "Gabriele Costa",
      "Fabio Pinelli",
      "Simone Soderi",
      "Gabriele Tolomei"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.09941",
    "title": "The Theoretical Limit of Radar Target Detection",
    "abstract": " Comments: 19 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2109.09941",
    "authors": [
      "Dazhuan Xu",
      "Nan Wang",
      "Han Zhang",
      "Xiaolong Kong"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2211.13535",
    "title": "DeepTaster: Adversarial Perturbation-Based Fingerprinting to Identify  Proprietary Dataset Use in Deep Neural Networks",
    "abstract": " Title: DeepTaster: Adversarial Perturbation-Based Fingerprinting to Identify  Proprietary Dataset Use in Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2211.13535",
    "authors": [
      "Seonhye Park",
      "Alsharif Abuadbba",
      "Shuo Wang",
      "Kristen Moore",
      "Yansong Gao",
      "Hyoungshick Kim",
      "Surya Nepal"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.07991",
    "title": "Linearized Reed-Solomon Codes with Support-Constrained Generator Matrix  and Applications in Multi-Source Network Coding",
    "abstract": " Comments: 24 pages, 4 figures. Submitted to IEEE Transaction on Information Theory ",
    "url": "https://arxiv.org/abs/2212.07991",
    "authors": [
      "Hedongliang Liu",
      "Hengjia Wei",
      "Antonia Wachter-Zeh",
      "Moshe Schwartz"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2302.03390",
    "title": "Learning Discretized Neural Networks under Ricci Flow",
    "abstract": " Title: Learning Discretized Neural Networks under Ricci Flow ",
    "url": "https://arxiv.org/abs/2302.03390",
    "authors": [
      "Jun Chen",
      "Hanwen Chen",
      "Mengmeng Wang",
      "Guang Dai",
      "Ivor W. Tsang",
      "Yong Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2302.06114",
    "title": "A Comprehensive Survey on Graph Summarization with Graph Neural Networks",
    "abstract": " Comments: 21 pages, 4 figures, 9 tables, Journal of IEEE Transactions on Artificial Intelligence ",
    "url": "https://arxiv.org/abs/2302.06114",
    "authors": [
      "Nasrin Shabani",
      "Jia Wu",
      "Amin Beheshti",
      "Quan Z. Sheng",
      "Jin Foo",
      "Venus Haghighi",
      "Ambreen Hanif",
      "Maryam Shahabikargar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09267",
    "title": "Stochastic Approximation Approaches to Group Distributionally Robust  Optimization",
    "abstract": " Title: Stochastic Approximation Approaches to Group Distributionally Robust  Optimization ",
    "url": "https://arxiv.org/abs/2302.09267",
    "authors": [
      "Lijun Zhang",
      "Peng Zhao",
      "Zhen-Hua Zhuang",
      "Tianbao Yang",
      "Zhi-Hua Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09457",
    "title": "Attacks in Adversarial Machine Learning: A Systematic Survey from the  Life-cycle Perspective",
    "abstract": " Comments: 35 pages, 4 figures, 10 tables, 313 reference papers ",
    "url": "https://arxiv.org/abs/2302.09457",
    "authors": [
      "Baoyuan Wu",
      "Zihao Zhu",
      "Li Liu",
      "Qingshan Liu",
      "Zhaofeng He",
      "Siwei Lyu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.10975",
    "title": "Improved uncertainty quantification for neural networks with Bayesian  last layer",
    "abstract": " Comments: This work has been published at IEEE Access with Digital Object Identifier 10.1109/ACCESS.2023.3329685 under a Creative Commons Attribution 4.0 License ",
    "url": "https://arxiv.org/abs/2302.10975",
    "authors": [
      "Felix Fiedler",
      "Sergio Lucia"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.13991",
    "title": "Learning to Generalize towards Unseen Domains via a Content-Aware Style  Invariant Model for Disease Detection from Chest X-rays",
    "abstract": " Title: Learning to Generalize towards Unseen Domains via a Content-Aware Style  Invariant Model for Disease Detection from Chest X-rays ",
    "url": "https://arxiv.org/abs/2302.13991",
    "authors": [
      "Mohammad Zunaed",
      "Md. Aynal Haque",
      "Taufiq Hasan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2303.02468",
    "title": "Lon-ea at SemEval-2023 Task 11: A Comparison of Activation Functions for  Soft and Hard Label Prediction",
    "abstract": " Comments: Accepted in ACL 2023 SemEval Workshop as selected task paper ",
    "url": "https://arxiv.org/abs/2303.02468",
    "authors": [
      "Peyman Hosseini",
      "Mehran Hosseini",
      "Sana Sabah Al-Azzawi",
      "Marcus Liwicki",
      "Ignacio Castro",
      "Matthew Purver"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.06815",
    "title": "On Model Compression for Neural Networks: Framework, Algorithm, and  Convergence Guarantee",
    "abstract": " Comments: 43 pages ",
    "url": "https://arxiv.org/abs/2303.06815",
    "authors": [
      "Chenyang Li",
      "Jihoon Chung",
      "Biao Cai",
      "Haimin Wang",
      "Xianlian Zhou",
      "Bo Shen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.16594",
    "title": "A Hybrid Neural Coding Approach for Pattern Recognition with Spiking  Neural Networks",
    "abstract": " Title: A Hybrid Neural Coding Approach for Pattern Recognition with Spiking  Neural Networks ",
    "url": "https://arxiv.org/abs/2305.16594",
    "authors": [
      "Xinyi Chen",
      "Qu Yang",
      "Jibin Wu",
      "Haizhou Li",
      "Kay Chen Tan"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2306.00876",
    "title": "Quantifying Deep Learning Model Uncertainty in Conformal Prediction",
    "abstract": " Comments: Accepted in AAAI Second Symposium on Human Partnership with Medical AI: Design, Operationalization, and Ethics ",
    "url": "https://arxiv.org/abs/2306.00876",
    "authors": [
      "Hamed Karimi",
      "Reza Samavi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.07716",
    "title": "Dynamically Masked Discriminator for Generative Adversarial Networks",
    "abstract": " Comments: Updated v2 -- NeurIPS 2023 camera ready version ",
    "url": "https://arxiv.org/abs/2306.07716",
    "authors": [
      "Wentian Zhang",
      "Haozhe Liu",
      "Bing Li",
      "Jinheng Xie",
      "Yawen Huang",
      "Yuexiang Li",
      "Yefeng Zheng",
      "Bernard Ghanem"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.11586",
    "title": "Provably Powerful Graph Neural Networks for Directed Multigraphs",
    "abstract": " Comments: AAAI 2024 ",
    "url": "https://arxiv.org/abs/2306.11586",
    "authors": [
      "Béni Egressy",
      "Luc von Niederhäusern",
      "Jovan Blanusa",
      "Erik Altman",
      "Roger Wattenhofer",
      "Kubilay Atasu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.17358",
    "title": "Shadow Generation with Decomposed Mask Prediction and Attentive Shadow  Filling",
    "abstract": " Title: Shadow Generation with Decomposed Mask Prediction and Attentive Shadow  Filling ",
    "url": "https://arxiv.org/abs/2306.17358",
    "authors": [
      "Xinhao Tao",
      "Junyan Cao",
      "Yan Hong",
      "Li Niu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05936",
    "title": "Introducing Packet-Level Analysis in Programmable Data Planes to Advance  Network Intrusion Detection",
    "abstract": " Title: Introducing Packet-Level Analysis in Programmable Data Planes to Advance  Network Intrusion Detection ",
    "url": "https://arxiv.org/abs/2307.05936",
    "authors": [
      "Roberto Doriguzzi-Corin",
      "Luis Augusto Dias Knob",
      "Luca Mendozzi",
      "Domenico Siracusa",
      "Marco Savi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.14297",
    "title": "Robust Regret Optimal Control",
    "abstract": " Title: Robust Regret Optimal Control ",
    "url": "https://arxiv.org/abs/2307.14297",
    "authors": [
      "Jietian Liu",
      "Peter Seiler"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.02535",
    "title": "Learning to Generate Training Datasets for Robust Semantic Segmentation",
    "abstract": " Comments: Published as a conference paper at WACV 2024 ",
    "url": "https://arxiv.org/abs/2308.02535",
    "authors": [
      "Marwane Hariat",
      "Olivier Laurent",
      "Rémi Kazmierczak",
      "Shihao Zhang",
      "Andrei Bursuc",
      "Angela Yao",
      "Gianni Franchi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.09863",
    "title": "StROL: Stabilized and Robust Online Learning from Humans",
    "abstract": " Title: StROL: Stabilized and Robust Online Learning from Humans ",
    "url": "https://arxiv.org/abs/2308.09863",
    "authors": [
      "Shaunak A. Mehta",
      "Forrest Meng",
      "Andrea Bajcsy",
      "Dylan P. Losey"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.09431",
    "title": "FactoFormer: Factorized Hyperspectral Transformers with Self-Supervised  Pretraining",
    "abstract": " Comments: Accepted to IEEE Transactions on Geoscience and Remote Sensing in December 2023 ",
    "url": "https://arxiv.org/abs/2309.09431",
    "authors": [
      "Shaheer Mohamed",
      "Maryam Haghighat",
      "Tharindu Fernando",
      "Sridha Sridharan",
      "Clinton Fookes",
      "Peyman Moghadam"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.12081",
    "title": "DHOT-GM: Robust Graph Matching Using A Differentiable Hierarchical  Optimal Transport Framework",
    "abstract": " Title: DHOT-GM: Robust Graph Matching Using A Differentiable Hierarchical  Optimal Transport Framework ",
    "url": "https://arxiv.org/abs/2310.12081",
    "authors": [
      "Haoran Cheng",
      "Dixin Luo",
      "Hongteng Xu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.17498",
    "title": "CBD: A Certified Backdoor Detector Based on Local Dominant Probability",
    "abstract": " Comments: Accepted to NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2310.17498",
    "authors": [
      "Zhen Xiang",
      "Zidi Xiong",
      "Bo Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.19251",
    "title": "Pre-trained Recommender Systems: A Causal Debiasing Perspective",
    "abstract": " Comments: 8 pages, WSDM 24 ",
    "url": "https://arxiv.org/abs/2310.19251",
    "authors": [
      "Ziqian Lin",
      "Hao Ding",
      "Nghia Hoang",
      "Branislav Kveton",
      "Anoop Deoras",
      "Hao Wang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.09077",
    "title": "Spiking NeRF: Representing the Real-World Geometry by a Discontinuous  Representation",
    "abstract": " Title: Spiking NeRF: Representing the Real-World Geometry by a Discontinuous  Representation ",
    "url": "https://arxiv.org/abs/2311.09077",
    "authors": [
      "Zhanfeng Liao",
      "Qian Zheng",
      "Yan Liu",
      "Gang Pan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.16124",
    "title": "DiffAttack: Evasion Attacks Against Diffusion-Based Adversarial  Purification",
    "abstract": " Comments: Accepted to NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2311.16124",
    "authors": [
      "Mintong Kang",
      "Dawn Song",
      "Bo Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.16533",
    "title": "Motor State Prediction and Friction Compensation for Brushless DC Motor  Drives Using Data-Driven Techniques",
    "abstract": " Title: Motor State Prediction and Friction Compensation for Brushless DC Motor  Drives Using Data-Driven Techniques ",
    "url": "https://arxiv.org/abs/2311.16533",
    "authors": [
      "Nimantha Dasanayake",
      "Shehara Perera"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2312.01886",
    "title": "InstructTA: Instruction-Tuned Targeted Attack for Large Vision-Language  Models",
    "abstract": " Title: InstructTA: Instruction-Tuned Targeted Attack for Large Vision-Language  Models ",
    "url": "https://arxiv.org/abs/2312.01886",
    "authors": [
      "Xunguang Wang",
      "Zhenlan Ji",
      "Pingchuan Ma",
      "Zongjie Li",
      "Shuai Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.04367",
    "title": "Paraconsistent Existential Graphs Gamma Peirce System",
    "abstract": " Title: Paraconsistent Existential Graphs Gamma Peirce System ",
    "url": "https://arxiv.org/abs/2312.04367",
    "authors": [
      "Manuel Sierra-Aristizabal"
    ],
    "subjectives": [
      "Logic (math.LO)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2312.06374",
    "title": "UstanceBR: a multimodal language resource for stance prediction",
    "abstract": " Title: UstanceBR: a multimodal language resource for stance prediction ",
    "url": "https://arxiv.org/abs/2312.06374",
    "authors": [
      "Camila Pereira",
      "Matheus Pavan",
      "Sungwon Yoon",
      "Ricelli Ramos",
      "Pablo Costa",
      "Lais Cavalheiro",
      "Ivandre Paraboni"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2312.09015",
    "title": "Uncertainty in GNN Learning Evaluations: A Comparison Between Measures  for Quantifying Randomness in GNN Community Detection",
    "abstract": " Comments: 12 pages, 2 figures, contribution from COMPLEX NETWORKS 2023 selected for a possible publication in the special issue of the journal Entropy dedicated to the conference. arXiv admin note: substantial text overlap with arXiv:2305.06026 ",
    "url": "https://arxiv.org/abs/2312.09015",
    "authors": [
      "William Leeney",
      "Ryan McConville"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2312.10426",
    "title": "Branch Prediction in Hardcaml for a RISC-V 32im CPU",
    "abstract": " Title: Branch Prediction in Hardcaml for a RISC-V 32im CPU ",
    "url": "https://arxiv.org/abs/2312.10426",
    "authors": [
      "Alex Saveau"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2312.12789",
    "title": "SLP-Net:An efficient lightweight network for segmentation of skin  lesions",
    "abstract": " Title: SLP-Net:An efficient lightweight network for segmentation of skin  lesions ",
    "url": "https://arxiv.org/abs/2312.12789",
    "authors": [
      "Bo Yang",
      "Hong Peng",
      "Chenggang Guo",
      "Xiaohui Luo",
      "Jun Wang",
      "Xianzhong Long"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.12804",
    "title": "Multi-stages attention Breast cancer classification based on nonlinear  spiking neural P neurons with autapses",
    "abstract": " Title: Multi-stages attention Breast cancer classification based on nonlinear  spiking neural P neurons with autapses ",
    "url": "https://arxiv.org/abs/2312.12804",
    "authors": [
      "Bo Yang",
      "Hong Peng",
      "Xiaohui Luo",
      "Jun Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.15175",
    "title": "Physics-informed neural network for modeling dynamic linear elasticity",
    "abstract": " Title: Physics-informed neural network for modeling dynamic linear elasticity ",
    "url": "https://arxiv.org/abs/2312.15175",
    "authors": [
      "Vijay Kag",
      "Venkatesh Gopinath"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2312.15228",
    "title": "Adversarial Data Poisoning for Fake News Detection: How to Make a Model  Misclassify a Target News without Modifying It",
    "abstract": " Title: Adversarial Data Poisoning for Fake News Detection: How to Make a Model  Misclassify a Target News without Modifying It ",
    "url": "https://arxiv.org/abs/2312.15228",
    "authors": [
      "Federico Siciliano",
      "Luca Maiano",
      "Lorenzo Papa",
      "Federica Baccini",
      "Irene Amerini",
      "Fabrizio Silvestri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.00926",
    "title": "Accurate Leukocyte Detection Based on Deformable-DETR and Multi-Level  Feature Fusion for Aiding Diagnosis of Blood Diseases",
    "abstract": " Comments: 15 pages, 11 figures, accept Computers in Biology and Medicine 2024 ",
    "url": "https://arxiv.org/abs/2401.00926",
    "authors": [
      "Yifei Chen",
      "Chenyan Zhang",
      "Ben Chen",
      "Yiyu Huang",
      "Yifei Sun",
      "Changmiao Wang",
      "Xianjun Fu",
      "Yuxing Dai",
      "Feiwei Qin",
      "Yong Peng",
      "Yu Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.01636",
    "title": "Efficient UAVs Deployment and Resource Allocation in UAV-Relay Assisted  Public Safety Networks for Video Transmission",
    "abstract": " Comments: Accepted for IEEE Access. Corresponding author: Waqas Khalid ",
    "url": "https://arxiv.org/abs/2401.01636",
    "authors": [
      "Naveed Khan",
      "Ayaz Ahmad",
      "Abdul Wakeel",
      "Zeeshan Kaleem",
      "Bushra Rashid",
      "Waqas Khalid"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2401.01761",
    "title": "Cross-target Stance Detection by Exploiting Target Analytical  Perspectives",
    "abstract": " Title: Cross-target Stance Detection by Exploiting Target Analytical  Perspectives ",
    "url": "https://arxiv.org/abs/2401.01761",
    "authors": [
      "Daijun Ding",
      "Rong Chen",
      "Liwen Jing",
      "Bowen Zhang",
      "Xu Huang",
      "Li Dong",
      "Xiaowen Zhao",
      "Ge Song"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.01783",
    "title": "Approximating Numerical Flux by Fourier Neural Operators for the  Hyperbolic Conservation Laws",
    "abstract": " Comments: 23 pages, 28 figures ",
    "url": "https://arxiv.org/abs/2401.01783",
    "authors": [
      "Taeyoung Kim",
      "Myungjoo Kang"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  }
]