[
  {
    "id": "arXiv:2202.03423",
    "title": "Backdoor Defense via Decoupling the Training Process",
    "abstract": "Recent studies have revealed that deep neural networks (DNNs) are vulnerable to backdoor attacks, where attackers embed hidden backdoors in the DNN model by poisoning a few training samples. The attacked model behaves normally on benign samples, whereas its prediction will be maliciously changed when the backdoor is activated. We reveal that poisoned samples tend to cluster together in the feature space of the attacked DNN model, which is mostly due to the end-to-end supervised training paradigm. Inspired by this observation, we propose a novel backdoor defense via decoupling the original end-to-end training process into three stages. Specifically, we first learn the backbone of a DNN model via \\emph{self-supervised learning} based on training samples without their labels. The learned backbone will map samples with the same ground-truth label to similar locations in the feature space. Then, we freeze the parameters of the learned backbone and train the remaining fully connected layers via standard training with all (labeled) training samples. Lastly, to further alleviate side-effects of poisoned samples in the second stage, we remove labels of some `low-credible' samples determined based on the learned model and conduct a \\emph{semi-supervised fine-tuning} of the whole model. Extensive experiments on multiple benchmark datasets and DNN models verify that the proposed defense is effective in reducing backdoor threats while preserving high accuracy in predicting benign samples. Our code is available at \\url{https://github.com/SCLBD/DBD}. ",
    "url": "https://arxiv.org/abs/2202.03423",
    "authors": [
      "Kunzhe Huang",
      "Yiming Li",
      "Baoyuan Wu",
      "Zhan Qin",
      "Kui Ren"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03480",
    "title": "Universal Spam Detection using Transfer Learning of BERT Model",
    "abstract": "Deep learning transformer models become important by training on text data based on self-attention mechanisms. This manuscript demonstrated a novel universal spam detection model using pre-trained Google's Bidirectional Encoder Representations from Transformers (BERT) base uncased models with four datasets by efficiently classifying ham or spam emails in real-time scenarios. Different methods for Enron, Spamassain, Lingspam, and Spamtext message classification datasets, were used to train models individually in which a single model was obtained with acceptable performance on four datasets. The Universal Spam Detection Model (USDM) was trained with four datasets and leveraged hyperparameters from each model. The combined model was finetuned with the same hyperparameters from these four models separately. When each model using its corresponding dataset, an F1-score is at and above 0.9 in individual models. An overall accuracy reached 97%, with an F1 score of 0.96. Research results and implications were discussed. ",
    "url": "https://arxiv.org/abs/2202.03480",
    "authors": [
      "Vijay Srinivas Tida",
      "Sonya Hsu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03484",
    "title": "Self-supervised Speaker Recognition Training Using Human-Machine  Dialogues",
    "abstract": "Speaker recognition, recognizing speaker identities based on voice alone, enables important downstream applications, such as personalization and authentication. Learning speaker representations, in the context of supervised learning, heavily depends on both clean and sufficient labeled data, which is always difficult to acquire. Noisy unlabeled data, on the other hand, also provides valuable information that can be exploited using self-supervised training methods. In this work, we investigate how to pretrain speaker recognition models by leveraging dialogues between customers and smart-speaker devices. However, the supervisory information in such dialogues is inherently noisy, as multiple speakers may speak to a device in the course of the same dialogue. To address this issue, we propose an effective rejection mechanism that selectively learns from dialogues based on their acoustic homogeneity. Both reconstruction-based and contrastive-learning-based self-supervised methods are compared. Experiments demonstrate that the proposed method provides significant performance improvements, superior to earlier work. Dialogue pretraining when combined with the rejection mechanism yields 27.10% equal error rate (EER) reduction in speaker recognition, compared to a model without self-supervised pretraining. ",
    "url": "https://arxiv.org/abs/2202.03484",
    "authors": [
      "Metehan Cekic",
      "Ruirui Li",
      "Zeya Chen",
      "Yuguang Yang",
      "Andreas Stolcke",
      "Upamanyu Madhow"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03487",
    "title": "Targeted-BEHRT: Deep learning for observational causal inference on  longitudinal electronic health records",
    "abstract": "Observational causal inference is useful for decision making in medicine when randomized clinical trials (RCT) are infeasible or non generalizable. However, traditional approaches fail to deliver unconfounded causal conclusions in practice. The rise of \"doubly robust\" non-parametric tools coupled with the growth of deep learning for capturing rich representations of multimodal data, offers a unique opportunity to develop and test such models for causal inference on comprehensive electronic health records (EHR). In this paper, we investigate causal modelling of an RCT-established null causal association: the effect of antihypertensive use on incident cancer risk. We develop a dataset for our observational study and a Transformer-based model, Targeted BEHRT coupled with doubly robust estimation, we estimate average risk ratio (RR). We compare our model to benchmark statistical and deep learning models for causal inference in multiple experiments on semi-synthetic derivations of our dataset with various types and intensities of confounding. In order to further test the reliability of our approach, we test our model on situations of limited data. We find that our model provides more accurate estimates of RR (least sum absolute error from ground truth) compared to benchmarks for risk ratio estimation on high-dimensional EHR across experiments. Finally, we apply our model to investigate the original case study: antihypertensives' effect on cancer and demonstrate that our model generally captures the validated null association. ",
    "url": "https://arxiv.org/abs/2202.03487",
    "authors": [
      "Shishir Rao",
      "Mohammad Mamouei",
      "Gholamreza Salimi-Khorshidi",
      "Yikuan Li",
      "Rema Ramakrishnan",
      "Abdelaali Hassaine",
      "Dexter Canoy",
      "Kazem Rahimi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03488",
    "title": "IoV Scenario: Implementation of a Bandwidth Aware Algorithm in Wireless  Network Communication Mode",
    "abstract": "The wireless network communication mode represented by the Internet of vehicles (IoV) has been widely used. However, due to the limitations of traditional network architecture, resource scheduling in wireless network environment is still facing great challenges. This paper focuses on the allocation of bandwidth resources in the virtual network environment. This paper proposes a bandwidth aware multi domain virtual network embedding algorithm (BA-VNE). The algorithm is mainly aimed at the problem that users need a lot of bandwidth in wireless communication mode, and solves the problem of bandwidth resource allocation from the perspective of virtual network embedding (VNE). In order to improve the performance of the algorithm, we introduce particle swarm optimization (PSO) algorithm to optimize the performance of the algorithm. In order to verify the effectiveness of the algorithm, we have carried out simulation experiments from link bandwidth, mapping cost and virtual network request (VNR) acceptance rate. The final results show that the proposed algorithm is better than other representative algorithms in the above indicators. ",
    "url": "https://arxiv.org/abs/2202.03488",
    "authors": [
      "Peiying Zhang",
      "Chao Wang",
      "Gagangeet Singh Aujla",
      "Neeraj Kumar",
      "Mohsen Guizani"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03501",
    "title": "Scribble-based Boundary-aware Network for Weakly Supervised Salient  Object Detection in Remote Sensing Images",
    "abstract": "Existing CNNs-based salient object detection (SOD) heavily depends on the large-scale pixel-level annotations, which is labor-intensive, time-consuming, and expensive. By contrast, the sparse annotations become appealing to the salient object detection community. However, few efforts are devoted to learning salient object detection from sparse annotations, especially in the remote sensing field. In addition, the sparse annotation usually contains scanty information, which makes it challenging to train a well-performing model, resulting in its performance largely lagging behind the fully-supervised models. Although some SOD methods adopt some prior cues to improve the detection performance, they usually lack targeted discrimination of object boundaries and thus provide saliency maps with poor boundary localization. To this end, in this paper, we propose a novel weakly-supervised salient object detection framework to predict the saliency of remote sensing images from sparse scribble annotations. To implement it, we first construct the scribble-based remote sensing saliency dataset by relabelling an existing large-scale SOD dataset with scribbles, namely S-EOR dataset. After that, we present a novel scribble-based boundary-aware network (SBA-Net) for remote sensing salient object detection. Specifically, we design a boundary-aware module (BAM) to explore the object boundary semantics, which is explicitly supervised by the high-confidence object boundary (pseudo) labels generated by the boundary label generation (BLG) module, forcing the model to learn features that highlight the object structure and thus boosting the boundary localization of objects. Then, the boundary semantics are integrated with high-level features to guide the salient object detection under the supervision of scribble labels. ",
    "url": "https://arxiv.org/abs/2202.03501",
    "authors": [
      "Zhou Huang",
      "Tian-Zhu Xiang",
      "Huai-Xin Chen",
      "Hang Dai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03514",
    "title": "Maximizing Audio Event Detection Model Performance on Small Datasets  Through Knowledge Transfer, Data Augmentation, And Pretraining: An Ablation  Study",
    "abstract": "An Xception model reaches state-of-the-art (SOTA) accuracy on the ESC-50 dataset for audio event detection through knowledge transfer from ImageNet weights, pretraining on AudioSet, and an on-the-fly data augmentation pipeline. This paper presents an ablation study that analyzes which components contribute to the boost in performance and training time. A smaller Xception model is also presented which nears SOTA performance with almost a third of the parameters. ",
    "url": "https://arxiv.org/abs/2202.03514",
    "authors": [
      "Daniel Tompkins",
      "Kshitiz Kumar",
      "Jian Wu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2202.03532",
    "title": "MINER: Multiscale Implicit Neural Representations",
    "abstract": "We introduce a new neural signal representation designed for the efficient high-resolution representation of large-scale signals. The key innovation in our multiscale implicit neural representation (MINER) is an internal representation via a Laplacian pyramid, which provides a sparse multiscale representation of the signal that captures orthogonal parts of the signal across scales. We leverage the advantages of the Laplacian pyramid by representing small disjoint patches of the pyramid at each scale with a tiny MLP. This enables the capacity of the network to adaptively increase from coarse to fine scales, and only represent parts of the signal with strong signal energy. The parameters of each MLP are optimized from coarse-to-fine scale which results in faster approximations at coarser scales, thereby ultimately an extremely fast training process. We apply MINER to a range of large-scale signal representation tasks, including gigapixel images and very large point clouds, and demonstrate that it requires fewer than 25% of the parameters, 33% of the memory footprint, and 10% of the computation time of competing techniques such as ACORN to reach the same representation error. ",
    "url": "https://arxiv.org/abs/2202.03532",
    "authors": [
      "Vishwanath Saragadam",
      "Jasper Tan",
      "Guha Balakrishnan",
      "Richard G. Baraniuk",
      "Ashok Veeraraghavan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03539",
    "title": "Structured Time Series Prediction without Structural Prior",
    "abstract": "Time series prediction is a widespread and well studied problem with applications in many domains (medical, geoscience, network analysis, finance, econometry etc.). In the case of multivariate time series, the key to good performances is to properly capture the dependencies between the variates. Often, these variates are structured, i.e. they are localised in an abstract space, usually representing an aspect of the physical world, and prediction amounts to a form of diffusion of the information across that space over time. Several neural network models of diffusion have been proposed in the literature. However, most of the existing proposals rely on some a priori knowledge on the structure of the space, usually in the form of a graph weighing the pairwise diffusion capacity of its points. We argue that this piece of information can often be dispensed with, since data already contains the diffusion capacity information, and in a more reliable form than that obtained from the usually largely hand-crafted graphs. We propose instead a fully data-driven model which does not rely on such a graph, nor any other prior structural information. We conduct a first set of experiments to measure the impact on performance of a structural prior, as used in baseline models, and show that, except at very low data levels, it remains negligible, and beyond a threshold, it may even become detrimental. We then investigate, through a second set of experiments, the capacity of our model in two respects: treatment of missing data and domain adaptation. ",
    "url": "https://arxiv.org/abs/2202.03539",
    "authors": [
      "Darko Drakulic",
      "Jean-Marc Andreoli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03540",
    "title": "SliTraNet: Automatic Detection of Slide Transitions in Lecture Videos  using Convolutional Neural Networks",
    "abstract": "With the increasing number of online learning material in the web, search for specific content in lecture videos can be time consuming. Therefore, automatic slide extraction from the lecture videos can be helpful to give a brief overview of the main content and to support the students in their studies. For this task, we propose a deep learning method to detect slide transitions in lectures videos. We first process each frame of the video by a heuristic-based approach using a 2-D convolutional neural network to predict transition candidates. Then, we increase the complexity by employing two 3-D convolutional neural networks to refine the transition candidates. Evaluation results demonstrate the effectiveness of our method in finding slide transitions. ",
    "url": "https://arxiv.org/abs/2202.03540",
    "authors": [
      "Aline Sindel",
      "Abner Hernandez",
      "Seung Hee Yang",
      "Vincent Christlein",
      "Andreas Maier"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03555",
    "title": "data2vec: A General Framework for Self-supervised Learning in Speech,  Vision and Language",
    "abstract": "While the general idea of self-supervised learning is identical across modalities, the actual algorithms and objectives differ widely because they were developed with a single modality in mind. To get us closer to general self-supervised learning, we present data2vec, a framework that uses the same learning method for either speech, NLP or computer vision. The core idea is to predict latent representations of the full input data based on a masked view of the input in a self-distillation setup using a standard Transformer architecture. Instead of predicting modality-specific targets such as words, visual tokens or units of human speech which are local in nature, data2vec predicts contextualized latent representations that contain information from the entire input. Experiments on the major benchmarks of speech recognition, image classification, and natural language understanding demonstrate a new state of the art or competitive performance to predominant approaches. ",
    "url": "https://arxiv.org/abs/2202.03555",
    "authors": [
      "Alexei Baevski",
      "Wei-Ning Hsu",
      "Qiantong Xu",
      "Arun Babu",
      "Jiatao Gu",
      "Michael Auli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03558",
    "title": "Evaluating Robustness of Cooperative MARL: A Model-based Approach",
    "abstract": "In recent years, a proliferation of methods were developed for cooperative multi-agent reinforcement learning (c-MARL). However, the robustness of c-MARL agents against adversarial attacks has been rarely explored. In this paper, we propose to evaluate the robustness of c-MARL agents via a model-based approach. Our proposed formulation can craft stronger adversarial state perturbations of c-MARL agents(s) to lower total team rewards more than existing model-free approaches. In addition, we propose the first victim-agent selection strategy which allows us to develop even stronger adversarial attack. Numerical experiments on multi-agent MuJoCo benchmarks illustrate the advantage of our approach over other baselines. The proposed model-based attack consistently outperforms other baselines in all tested environments. ",
    "url": "https://arxiv.org/abs/2202.03558",
    "authors": [
      "Nhan H. Pham",
      "Lam M. Nguyen",
      "Jie Chen",
      "Hoang Thanh Lam",
      "Subhro Das",
      "Tsui-Wei Weng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03573",
    "title": "A Viral Marketing-Based Model For Opinion Dynamics in Online Social  Networks",
    "abstract": "Online social networks provide a medium for citizens to form opinions on different societal issues, and a forum for public discussion. They also expose users to viral content, such as breaking news articles. In this paper, we study the interplay between these two aspects: opinion formation and information cascades in online social networks. We present a new model that allows us to quantify how users change their opinion as they are exposed to viral content. Our model is a combination of the popular Friedkin--Johnsen model for opinion dynamics and the independent cascade model for information propagation. We present algorithms for simulating our model, and we provide approximation algorithms for optimizing certain network indices, such as the sum of user opinions or the disagreement--controversy index; our approach can be used to obtain insights into how much viral content can increase these indices in online social networks. Finally, we evaluate our model on real-world datasets. We show experimentally that marketing campaigns and polarizing contents have vastly different effects on the network: while the former have only limited effect on the polarization in the network, the latter can increase the polarization up to 59% even when only 0.5% of the users start sharing a polarizing content. We believe that this finding sheds some light into the growing segregation in today's online media. ",
    "url": "https://arxiv.org/abs/2202.03573",
    "authors": [
      "Sijing Tu",
      "Stefan Neumann"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2202.03574",
    "title": "Structured Prediction Problem Archive",
    "abstract": "Structured prediction problems are one of the fundamental tools in machine learning. In order to facilitate algorithm development for their numerical solution, we collect in one place a large number of datasets in easy to read formats for a diverse set of problem classes. We provide archival links to datasets, description of the considered problems and problem formats, and a short summary of problem characteristics including size, number of instances etc. For reference we also give a non-exhaustive selection of algorithms proposed in the literature for their solution. We hope that this central repository will make benchmarking and comparison to established works easier. We welcome submission of interesting new datasets and algorithms for inclusion in our archive. ",
    "url": "https://arxiv.org/abs/2202.03574",
    "authors": [
      "Paul Swoboda",
      "Andrea Hornakova",
      "Paul Roetzer",
      "Ahmed Abbas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03576",
    "title": "Learnability Lock: Authorized Learnability Control Through Adversarial  Invertible Transformations",
    "abstract": "Owing much to the revolution of information technology, the recent progress of deep learning benefits incredibly from the vastly enhanced access to data available in various digital formats. However, in certain scenarios, people may not want their data being used for training commercial models and thus studied how to attack the learnability of deep learning models. Previous works on learnability attack only consider the goal of preventing unauthorized exploitation on the specific dataset but not the process of restoring the learnability for authorized cases. To tackle this issue, this paper introduces and investigates a new concept called \"learnability lock\" for controlling the model's learnability on a specific dataset with a special key. In particular, we propose adversarial invertible transformation, that can be viewed as a mapping from image to image, to slightly modify data samples so that they become \"unlearnable\" by machine learning models with negligible loss of visual features. Meanwhile, one can unlock the learnability of the dataset and train models normally using the corresponding key. The proposed learnability lock leverages class-wise perturbation that applies a universal transformation function on data samples of the same label. This ensures that the learnability can be easily restored with a simple inverse transformation while remaining difficult to be detected or reverse-engineered. We empirically demonstrate the success and practicability of our method on visual classification tasks. ",
    "url": "https://arxiv.org/abs/2202.03576",
    "authors": [
      "Weiqi Peng",
      "Jinghui Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03580",
    "title": "Convolutional Neural Networks on Graphs with Chebyshev Approximation,  Revisited",
    "abstract": "Designing spectral convolutional networks is a challenging problem in graph learning. ChebNet, one of the early attempts, approximates the spectral convolution using Chebyshev polynomials. GCN simplifies ChebNet by utilizing only the first two Chebyshev polynomials while still outperforming it on real-world datasets. GPR-GNN and BernNet demonstrate that the Monomial and Bernstein bases also outperform the Chebyshev basis in terms of learning the spectral convolution. Such conclusions are counter-intuitive in the field of approximation theory, where it is established that the Chebyshev polynomial achieves the optimum convergent rate for approximating a function. In this paper, we revisit the problem of approximating the spectral convolution with Chebyshev polynomials. We show that ChebNet's inferior performance is primarily due to illegal coefficients learnt by ChebNet approximating analytic filter functions, which leads to over-fitting. We then propose ChebNetII, a new GNN model based on Chebyshev interpolation, which enhances the original Chebyshev polynomial approximation while reducing the Runge phenomena. We conducted an extensive experimental study to demonstrate that ChebNetII can learn arbitrary graph spectrum filters and achieve superior performance in both full- and semi-supervised node classification tasks. ",
    "url": "https://arxiv.org/abs/2202.03580",
    "authors": [
      "Mingguo He",
      "Zhewei Wei",
      "Ji-Rong Wen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03582",
    "title": "Simulators for Mobile Social Robots:State-of-the-Art and Challenges",
    "abstract": "The future robots are expected to work in a shared physical space with humans [1], however, the presence of humans leads to a dynamic environment that is challenging for mobile robots to navigate. The path planning algorithms designed to navigate a collision free path in complex human environments are often tested in real environments due to the lack of simulation frameworks. This paper identifies key requirements for an ideal simulator for this task, evaluates existing simulation frameworks and most importantly, it identifies the challenges and limitations of the existing simulation techniques. First and foremost, we recognize that the simulators needed for the purpose of testing mobile robots designed for human environments are unique as they must model realistic pedestrian behavior in addition to the modelling of mobile robots. Our study finds that Pedsim_ros [2] and a more recent SocNavBench framework [3] are the only two 3D simulation frameworks that meet most of the key requirements defined in our paper. In summary, we identify the need for developing more simulators that offer an ability to create realistic 3D pedestrian rich virtual environments along with the flexibility of designing complex robots and their sensor models from scratch. ",
    "url": "https://arxiv.org/abs/2202.03582",
    "authors": [
      "Prabhjot Kaur",
      "Zichuan Liu",
      "Weisong Shi"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2202.03590",
    "title": "Moral Emotions Shape the Virality of COVID-19 Misinformation on Social  Media",
    "abstract": "While false rumors pose a threat to the successful overcoming of the COVID-19 pandemic, an understanding of how rumors diffuse in online social networks is - even for non-crisis situations - still in its infancy. Here we analyze a large sample consisting of COVID-19 rumor cascades from Twitter that have been fact-checked by third-party organizations. The data comprises N=10,610 rumor cascades that have been retweeted more than 24 million times. We investigate whether COVID-19 misinformation spreads more viral than the truth and whether the differences in the diffusion of true vs. false rumors can be explained by the moral emotions they carry. We observe that, on average, COVID-19 misinformation is more likely to go viral than truthful information. However, the veracity effect is moderated by moral emotions: false rumors are more viral than the truth if the source tweets embed a high number of other-condemning emotion words, whereas a higher number of self-conscious emotion words is linked to a less viral spread. The effects are pronounced both for health misinformation and false political rumors. These findings offer insights into how true vs. false rumors spread and highlight the importance of considering emotions from the moral emotion families in social media content. ",
    "url": "https://arxiv.org/abs/2202.03590",
    "authors": [
      "Kirill Solovev",
      "Nicolas Pröllochs"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2202.03596",
    "title": "MOST-Net: A Memory Oriented Style Transfer Network for Face Sketch  Synthesis",
    "abstract": "Face sketch synthesis has been widely used in multi-media entertainment and law enforcement. Despite the recent developments in deep neural networks, accurate and realistic face sketch synthesis is still a challenging task due to the diversity and complexity of human faces. Current image-to-image translation-based face sketch synthesis frequently encounters over-fitting problems when it comes to small-scale datasets. To tackle this problem, we present an end-to-end Memory Oriented Style Transfer Network (MOST-Net) for face sketch synthesis which can produce high-fidelity sketches with limited data. Specifically, an external self-supervised dynamic memory module is introduced to capture the domain alignment knowledge in the long term. In this way, our proposed model could obtain the domain-transfer ability by establishing the durable relationship between faces and corresponding sketches on the feature level. Furthermore, we design a novel Memory Refinement Loss (MR Loss) for feature alignment in the memory module, which enhances the accuracy of memory slots in an unsupervised manner. Extensive experiments on the CUFS and the CUFSF datasets show that our MOST-Net achieves state-of-the-art performance, especially in terms of the Structural Similarity Index(SSIM). ",
    "url": "https://arxiv.org/abs/2202.03596",
    "authors": [
      "Fan Ji",
      "Muyi Sun",
      "Xingqun Qi",
      "Qi Li",
      "Zhenan Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03609",
    "title": "Backdoor Detection in Reinforcement Learning",
    "abstract": "While the real world application of reinforcement learning (RL) is becoming popular, the safety concern and the robustness of an RL system require more attention. A recent work reveals that, in a multi-agent RL environment, backdoor trigger actions can be injected into a victim agent (a.k.a. trojan agent), which can result in a catastrophic failure as soon as it sees the backdoor trigger action. We propose the problem of RL Backdoor Detection, aiming to address this safety vulnerability. An interesting observation we drew from extensive empirical studies is a trigger smoothness property where normal actions similar to the backdoor trigger actions can also trigger low performance of the trojan agent. Inspired by this observation, we propose a reinforcement learning solution TrojanSeeker to find approximate trigger actions for the trojan agents, and further propose an efficient approach to mitigate the trojan agents based on machine unlearning. Experiments show that our approach can correctly distinguish and mitigate all the trojan agents across various types of agents and environments. ",
    "url": "https://arxiv.org/abs/2202.03609",
    "authors": [
      "Junfeng Guo",
      "Ang Li",
      "Cong Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03613",
    "title": "Conformal prediction for the design problem",
    "abstract": "In many real-world deployments of machine learning, we use a prediction algorithm to choose what data to test next. For example, in the protein design problem, we have a regression model that predicts some real-valued property of a protein sequence, which we use to propose new sequences believed to exhibit higher property values than observed in the training data. Since validating designed sequences in the wet lab is typically costly, it is important to know how much we can trust the model's predictions. In such settings, however, there is a distinct type of distribution shift between the training and test data: one where the training and test data are statistically dependent, as the latter is chosen based on the former. Consequently, the model's error on the test data -- that is, the designed sequences -- has some non-trivial relationship with its error on the training data. Herein, we introduce a method to quantify predictive uncertainty in such settings. We do so by constructing confidence sets for predictions that account for the dependence between the training and test data. The confidence sets we construct have finite-sample guarantees that hold for any prediction algorithm, even when a trained model chooses the test-time input distribution. As a motivating use case, we demonstrate how our method quantifies uncertainty for the predicted fitness of designed protein using several real data sets. ",
    "url": "https://arxiv.org/abs/2202.03613",
    "authors": [
      "Clara Fannjiang",
      "Stephen Bates",
      "Anastasios Angelopoulos",
      "Jennifer Listgarten",
      "Michael I. Jordan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2202.03617",
    "title": "The role of Blockchain in DDoS attacks mitigation: techniques, open  challenges and future directions",
    "abstract": "With the proliferation of new technologies such as Internet of Things (IOT) and Software-Defined Networking(SDN) in the recent years, the distributed denial of service (DDoS)attack vector has broadened and opened new opportunities for more sophisticated DDoS attacks on the targeted victims. The new attack vector includes unsecured and vulnerable IoT devices connected to the internet, denial of service vulnerabilities like southbound channel saturation in the SDN architecture. Given the high-volume and pervasive nature of these attacks, it is beneficial for stakeholders to collaborate in detecting and mitigating the denial of service attacks in a timely manner. The blockchain technology is considered to improve the security aspects owing to the decentralized design, secured distributed storage and privacy. A thorough exploration and classification of blockchain techniques used for DDoS attack mitigation is not explored in the prior art. This paper reviews and categorizes the existed state-of-the-art DDoS mitigation solutions based on blockchain technology. The DDoS mitigation techniques are classified based on the solution deployment location i.e. network based, near attacker location, near victim location and hybrid solutions in the network architecture with emphasis on the IoT and SDN architectures. Additionally, based on our study, the research challenges and future directions to implement the blockchain based DDoS mitigation solutions are discussed. We believe that this paper could serve as a starting point and reference resource for future researchers working on denial of service attacks detection and mitigation using blockchain technology. ",
    "url": "https://arxiv.org/abs/2202.03617",
    "authors": [
      "Rajasekhar Chaganti",
      "Bharat Bhushan",
      "Vinayakumar Ravi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2202.03621",
    "title": "Bandit Sampling for Multiplex Networks",
    "abstract": "Graph neural networks have gained prominence due to their excellent performance in many classification and prediction tasks. In particular, they are used for node classification and link prediction which have a wide range of applications in social networks, biomedical data sets, and financial transaction graphs. Most of the existing work focuses primarily on the monoplex setting where we have access to a network with only a single type of connection between entities. However, in the multiplex setting, where there are multiple types of connections, or \\emph{layers}, between entities, performance on tasks such as link prediction has been shown to be stronger when information from other connection types is taken into account. We propose an algorithm for scalable learning on multiplex networks with a large number of layers. The efficiency of our method is enabled by an online learning algorithm that learns how to sample relevant neighboring layers so that only the layers with relevant information are aggregated during training. This sampling differs from prior work, such as MNE, which aggregates information across \\emph{all} layers and consequently leads to computational intractability on large networks. Our approach also improves on the recent layer sampling method of \\textsc{DeePlex} in that the unsampled layers do not need to be trained, enabling further increases in efficiency.We present experimental results on both synthetic and real-world scenarios that demonstrate the practical effectiveness of our proposed approach. ",
    "url": "https://arxiv.org/abs/2202.03621",
    "authors": [
      "Cenk Baykal",
      "Vamsi K. Potluru",
      "Sameena Shah",
      "Manuela M. Veloso"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03624",
    "title": "Understanding the Trustworthiness Management in the Social Internet of  Things: A Survey",
    "abstract": "The next generation of the Internet of Things (IoT) facilitates the integration of the notion of social networking into smart objects (i.e., things) in a bid to establish the social network of interconnected objects. This integration has led to the evolution of a promising and emerging paradigm of Social Internet of Things (SIoT), wherein the smart objects act as social objects and intelligently impersonate the social behaviour similar to that of humans. These social objects are capable of establishing social relationships with the other objects in the network and can utilize these relationships for service discovery. Trust plays a significant role to achieve the common goal of trustworthy collaboration and cooperation among the objects and provide systems' credibility and reliability. In SIoT, an untrustworthy object can disrupt the basic functionality of a service by delivering malicious messages and adversely affect the quality and reliability of the service. In this survey, we present a holistic view of trustworthiness management for SIoT. The essence of trust in various disciplines has been discussed along with the Trust in SIoT followed by a detailed study on trust management components in SIoT. Furthermore, we analyzed and compared the trust management schemes by primarily categorizing them into four groups in terms of their strengths, limitations, trust management components employed in each of the referred trust management schemes, and the performance of these studies vis-a-vis numerous trust evaluation dimensions. Finally, we have discussed the future research directions of the emerging paradigm of SIoT particularly for trustworthiness management in SIoT. ",
    "url": "https://arxiv.org/abs/2202.03624",
    "authors": [
      "Subhash Sagar",
      "Adnan Mahmood",
      "Quan Z. Sheng",
      "Jitander Kumar Pabani",
      "Wei Emma Zhang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2202.03630",
    "title": "Domain Adversarial Spatial-Temporal Network: A Transferable Framework  for Short-term Traffic Forecasting across Cities",
    "abstract": "Accurate real-time traffic forecast is critical for intelligent transportation systems (ITS) and it serves as the cornerstone of various smart mobility applications. Though this research area is dominated by deep learning, recent studies indicate that the accuracy improvement by developing new model structures is becoming marginal. Instead, we envision that the improvement can be achieved by transferring the \"forecasting-related knowledge\" across cities with different data distributions and network topologies. To this end, this paper aims to propose a novel transferable traffic forecasting framework: Domain Adversarial Spatial-Temporal Network (DASTNet). DASTNet is pre-trained on multiple source networks and fine-tuned with the target network's traffic data. Specifically, we leverage the graph representation learning and adversarial domain adaptation techniques to learn the domain-invariant node embeddings, which are further incorporated to model the temporal traffic data. To the best of our knowledge, we are the first to employ adversarial multi-domain adaptation for network-wide traffic forecasting problems. DASTNet consistently outperforms all state-of-the-art baseline methods on three benchmark datasets. The trained DASTNet is applied to Hong Kong's new traffic detectors, and accurate traffic predictions can be delivered immediately (within one day) when the detector is available. Overall, this study suggests an alternative to enhance the traffic forecasting methods and provides practical implications for cities lacking historical traffic data. ",
    "url": "https://arxiv.org/abs/2202.03630",
    "authors": [
      "Yihong Tang",
      "Ao Qu",
      "Andy H.F. Chow",
      "William H.K. Lam",
      "S.C. Wong",
      "Wei Ma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03639",
    "title": "Contrastive predictive coding for Anomaly Detection in Multi-variate  Time Series Data",
    "abstract": "Anomaly detection in multi-variate time series (MVTS) data is a huge challenge as it requires simultaneous representation of long term temporal dependencies and correlations across multiple variables. More often, this is solved by breaking the complexity through modeling one dependency at a time. In this paper, we propose a Time-series Representational Learning through Contrastive Predictive Coding (TRL-CPC) towards anomaly detection in MVTS data. First, we jointly optimize an encoder, an auto-regressor and a non-linear transformation function to effectively learn the representations of the MVTS data sets, for predicting future trends. It must be noted that the context vectors are representative of the observation window in the MTVS. Next, the latent representations for the succeeding instants obtained through non-linear transformations of these context vectors, are contrasted with the latent representations of the encoder for the multi-variables such that the density for the positive pair is maximized. Thus, the TRL-CPC helps to model the temporal dependencies and the correlations of the parameters for a healthy signal pattern. Finally, fitting the latent representations are fit into a Gaussian scoring function to detect anomalies. Evaluation of the proposed TRL-CPC on three MVTS data sets against SOTA anomaly detection methods shows the superiority of TRL-CPC. ",
    "url": "https://arxiv.org/abs/2202.03639",
    "authors": [
      "Theivendiram Pranavan",
      "Terence Sim",
      "Arulmurugan Ambikapathi",
      "Savitha Ramasamy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03643",
    "title": "SNPSFuzzer: A Fast Greybox Fuzzer for Stateful Network Protocols using  Snapshots",
    "abstract": "Greybox fuzzing has been widely used in stateless programs and has achieved great success. However, most state-of-the-art greybox fuzzers generally have the problems of slow speed and shallow state depth coverage in the process of fuzzing stateful network protocol programs which are able to remember and store details of the interactions. The existing greybox fuzzers for network protocol programs send a series of well-defined prefix sequences of input messages first and then send mutated messages to test the target state of a stateful network protocol. The process mentioned above causes a high time cost. In this paper, we propose SNPSFuzzer, a fast greybox fuzzer for stateful network protocol using snapshots. SNPSFuzzer dumps the context information when the network protocol program is under a specific state and restores it when the state needs to be fuzzed. Furthermore, we design a message chain analysis algorithm to explore more and deeper network protocol states. Our evaluation shows that, compared with the state-of-the-art network protocol greybox fuzzer AFLNET, SNPSFuzzer increases the speed of network protocol fuzzing by 112.0%-168.9% and improves path coverage by 21.4%-27.5% within 24 hours. Moreover, SNPSFuzzer exposes a previously unreported vulnerability in program Tinydtls. ",
    "url": "https://arxiv.org/abs/2202.03643",
    "authors": [
      "Junqiang Li",
      "Senyi Li",
      "Gang Sun",
      "Ting Chen",
      "Hongfang Yu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2202.03648",
    "title": "Energy Efficiency and Delay Tradeoff in an MEC-Enabled Mobile IoT  Network",
    "abstract": "Mobile Edge Computing (MEC) has recently emerged as a promising technology in the 5G era. It is deemed an effective paradigm to support computation-intensive and delay critical applications even at energy-constrained and computation-limited Internet of Things (IoT) devices. To effectively exploit the performance benefits enabled by MEC, it is imperative to jointly allocate radio and computational resources by considering non-stationary computation demands, user mobility, and wireless fading channels. This paper aims to study the tradeoff between energy efficiency (EE) and service delay for multi-user multi-server MEC-enabled IoT systems when provisioning offloading services in a user mobility scenario. Particularly, we formulate a stochastic optimization problem with the objective of minimizing the long-term average network EE with the constraints of the task queue stability, peak transmit power, maximum CPU-cycle frequency, and maximum user number. To tackle the problem, we propose an online offloading and resource allocation algorithm by transforming the original problem into several individual subproblems in each time slot based on Lyapunov optimization theory, which are then solved by convex decomposition and submodular methods. Theoretical analysis proves that the proposed algorithm can achieve a $[O(1/V), O(V)]$ tradeoff between EE and service delay. Simulation results verify the theoretical analysis and demonstrate our proposed algorithm can offer much better EE-delay performance in task offloading challenges, compared to several baselines. ",
    "url": "https://arxiv.org/abs/2202.03648",
    "authors": [
      "Han Hu",
      "Weiwei Song",
      "Qun Wang",
      "Rose Qingyang Hu",
      "Hongbo Zhu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2202.03651",
    "title": "Causal Scene BERT: Improving object detection by searching for  challenging groups of data",
    "abstract": "Modern computer vision applications rely on learning-based perception modules parameterized with neural networks for tasks like object detection. These modules frequently have low expected error overall but high error on atypical groups of data due to biases inherent in the training process. In building autonomous vehicles (AV), this problem is an especially important challenge because their perception modules are crucial to the overall system performance. After identifying failures in AV, a human team will comb through the associated data to group perception failures that share common causes. More data from these groups is then collected and annotated before retraining the model to fix the issue. In other words, error groups are found and addressed in hindsight. Our main contribution is a pseudo-automatic method to discover such groups in foresight by performing causal interventions on simulated scenes. To keep our interventions on the data manifold, we utilize masked language models. We verify that the prioritized groups found via intervention are challenging for the object detector and show that retraining with data collected from these groups helps inordinately compared to adding more IID data. We also plan to release software to run interventions in simulated scenes, which we hope will benefit the causality community. ",
    "url": "https://arxiv.org/abs/2202.03651",
    "authors": [
      "Cinjon Resnick",
      "Or Litany",
      "Amlan Kar",
      "Karsten Kreis",
      "James Lucas",
      "Kyunghyun Cho",
      "Sanja Fidler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03652",
    "title": "Real-time disease prediction with local differential privacy in Internet  of Medical Things",
    "abstract": "The rapid development in Internet of Medical Things (IoMT) boosts the opportunity for real-time health monitoring using various data types such as electroencephalography (EEG) and electrocardiography (ECG). Security issues have significantly impeded the e-healthcare system implementation. Three important challenges for privacy preserving system need to be addressed: accurate matching, privacy enhancement without compromising security, and computation efficiency. It is essential to guarantee prediction accuracy since disease diagnosis is strongly related to health and life. In this paper, we propose efficient disease prediction that guarantees security against malicious clients and honest-but-curious server using matrix encryption technique. A biomedical signal provided by the client is diagnosed such that the server does not get any information about the signal as well as the final result of the diagnosis while the client does not learn any information about the server's medical data. Thorough security analysis illustrates the disclosure resilience of the proposed scheme and the encryption algorithm satisfies local differential privacy. After result decryption performed by the client's device, performance is not degraded to perform prediction on encrypted data. The proposed scheme is efficient to implement real-time health monitoring. ",
    "url": "https://arxiv.org/abs/2202.03652",
    "authors": [
      "Guanhong Miao",
      "A. Adam Ding",
      "Samuel S. Wu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Other Statistics (stat.OT)"
    ]
  },
  {
    "id": "arXiv:2202.03677",
    "title": "A Novel Image Descriptor with Aggregated Semantic Skeleton  Representation for Long-term Visual Place Recognition",
    "abstract": "In a Simultaneous Localization and Mapping (SLAM) system, a loop-closure can eliminate accumulated errors, which is accomplished by Visual Place Recognition (VPR), a task that retrieves the current scene from a set of pre-stored sequential images through matching specific scene-descriptors. In urban scenes, the appearance variation caused by seasons and illumination has brought great challenges to the robustness of scene descriptors. Semantic segmentation images can not only deliver the shape information of objects but also their categories and spatial relations that will not be affected by the appearance variation of the scene. Innovated by the Vector of Locally Aggregated Descriptor (VLAD), in this paper, we propose a novel image descriptor with aggregated semantic skeleton representation (SSR), dubbed SSR-VLAD, for the VPR under drastic appearance-variation of environments. The SSR-VLAD of one image aggregates the semantic skeleton features of each category and encodes the spatial-temporal distribution information of the image semantic information. We conduct a series of experiments on three public datasets of challenging urban scenes. Compared with four state-of-the-art VPR methods- CoHOG, NetVLAD, LOST-X, and Region-VLAD, VPR by matching SSR-VLAD outperforms those methods and maintains competitive real-time performance at the same time. ",
    "url": "https://arxiv.org/abs/2202.03677",
    "authors": [
      "Nie Jiwei",
      "Feng Joe-Mei",
      "Xue Dingyu",
      "Pan Feng",
      "Liu Wei",
      "Hu Jun",
      "Cheng Shuai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03679",
    "title": "A Unified Prediction Framework for Signal Maps",
    "abstract": "Signal maps are essential for the planning and operation of cellular networks. However, the measurements needed to create such maps are expensive, often biased, not always reflecting the metrics of interest, and posing privacy risks. In this paper, we develop a unified framework for predicting cellular signal maps from limited measurements. We propose and combine three mechanisms that deal with the fact that not all measurements are equally important for a particular prediction task. First, we design \\emph{quality-of-service functions ($Q$)}, including signal strength (RSRP) but also other metrics of interest, such as coverage (improving recall by 76\\%-92\\%) and call drop probability (reducing error by as much as 32\\%). By implicitly altering the training loss function, quality functions can also improve prediction for RSRP itself where it matters (e.g. MSE reduction up to 27\\% in the low signal strength regime, where errors are critical). Second, we introduce \\emph{weight functions} ($W$) to specify the relative importance of prediction at different parts of the feature space. We propose re-weighting based on importance sampling to obtain unbiased estimators when the sampling and target distributions mismatch(yielding 20\\% improvement for targets on spatially uniform loss or on user population density). Third, we apply the {\\em Data Shapley} framework for the first time in this context: to assign values ($\\phi$) to individual measurement points, which capture the importance of their contribution to the prediction task. This can improve prediction (e.g. from 64\\% to 94\\% in recall for coverage loss) by removing points with negative values, and can also enable data minimization (i.e. we show that we can remove 70\\% of data w/o loss in performance). We evaluate our methods and demonstrate significant improvement in prediction performance, using several real-world datasets. ",
    "url": "https://arxiv.org/abs/2202.03679",
    "authors": [
      "Emmanouil Alimpertis",
      "Athina Markopoulou",
      "Carter T. Butts",
      "Evita Bakopoulou",
      "Konstantinos Psounis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2202.03695",
    "title": "Network Comparison Study of Deep Activation Feature Discriminability  with Novel Objects",
    "abstract": "Feature extraction has always been a critical component of the computer vision field. More recently, state-of-the-art computer visions algorithms have incorporated Deep Neural Networks (DNN) in feature extracting roles, creating Deep Convolutional Activation Features (DeCAF). The transferability of DNN knowledge domains has enabled the wide use of pretrained DNN feature extraction for applications with novel object classes, especially those with limited training data. This study analyzes the general discriminability of novel object visual appearances encoded into the DeCAF space of six of the leading visual recognition DNN architectures. The results of this study characterize the Mahalanobis distances and cosine similarities between DeCAF object manifolds across two visual object tracking benchmark data sets. The backgrounds surrounding each object are also included as an object classes in the manifold analysis, providing a wider range of novel classes. This study found that different network architectures led to different network feature focuses that must to be considered in the network selection process. These results are generated from the VOT2015 and UAV123 benchmark data sets; however, the proposed methods can be applied to efficiently compare estimated network performance characteristics for any labeled visual data set. ",
    "url": "https://arxiv.org/abs/2202.03695",
    "authors": [
      "Michael Karnes",
      "Alper Yilmaz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03705",
    "title": "A Survey on Sematic Communications for Intelligent Wireless Networks",
    "abstract": "With deployment of 6G technology, it is envisioned that competitive edge of wireless networks will be sustained and next decade's communication requirements will be stratified. Also 6G will aim to aid development of a human society which is ubiquitous and mobile, simultaneously providing solutions to key challenges such as, coverage, capacity, etc. In addition, 6G will focus on providing intelligent use-cases and applications using higher data-rates over mill-meter waves and Tera-Hertz frequency. However, at higher frequencies multiple non-desired phenomena such as atmospheric absorption, blocking, etc., occur which create a bottleneck owing to resource (spectrum and energy) scarcity. Hence, following same trend of making efforts towards reproducing at receiver, exact information which was sent by transmitter, will result in a never ending need for higher bandwidth. A possible solution to such a challenge lies in semantic communications which focuses on meaning (context) of received data as opposed to only reproducing correct transmitted data. This in turn will require less bandwidth, and will reduce bottleneck due to various undesired phenomenon. In this respect, current article presents a detailed survey on recent technological trends in regard to semantic communications for intelligent wireless networks. We focus on semantic communications architecture including model, and source and channel coding. Next, we detail cross-layer interaction, and various goal-oriented communication applications. We also present overall semantic communications trends in detail, and identify challenges which need timely solutions before practical implementation of semantic communications within 6G wireless technology. Our survey article is an attempt to significantly contribute towards initiating future research directions in area of semantic communications for intelligent 6G wireless networks. ",
    "url": "https://arxiv.org/abs/2202.03705",
    "authors": [
      "Sridhar Iyer",
      "Rajashri Khanai",
      "Dattaprasad Torse",
      "Rahul Jashvantbhai Pandya",
      "Khaled Rabie",
      "Krishna Pai",
      "Wali Ullah Khan",
      "Zubair Fadlullah"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2202.03706",
    "title": "Temporal Walk Centrality: Ranking Nodes in Evolving Networks",
    "abstract": "We propose the Temporal Walk Centrality, which quantifies the importance of a node by measuring its ability to obtain and distribute information in a temporal network. In contrast to the widely-used betweenness centrality, we assume that information does not necessarily spread on shortest paths but on temporal random walks that satisfy the time constraints of the network. We show that temporal walk centrality can identify nodes playing central roles in dissemination processes that might not be detected by related betweenness concepts and other common static and temporal centrality measures. We propose exact and approximation algorithms with different running times depending on the properties of the temporal network and parameters of our new centrality measure. A technical contribution is a general approach to lift existing algebraic methods for counting walks in static networks to temporal networks. Our experiments on real-world temporal networks show the efficiency and accuracy of our algorithms. Finally, we demonstrate that the rankings by temporal walk centrality often differ significantly from those of other state-of-the-art temporal centralities. ",
    "url": "https://arxiv.org/abs/2202.03706",
    "authors": [
      "Lutz Oettershagen",
      "Petra Mutzel",
      "Nils M. Kriege"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Data Structures and Algorithms (cs.DS)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2202.03714",
    "title": "What's Cracking? A Review and Analysis of Deep Learning Methods for  Structural Crack Segmentation, Detection and Quantification",
    "abstract": "Surface cracks are a very common indicator of potential structural faults. Their early detection and monitoring is an important factor in structural health monitoring. Left untreated, they can grow in size over time and require expensive repairs or maintenance. With recent advances in computer vision and deep learning algorithms, the automatic detection and segmentation of cracks for this monitoring process have become a major topic of interest. This review aims to give researchers an overview of the published work within the field of crack analysis algorithms that make use of deep learning. It outlines the various tasks that are solved through applying computer vision algorithms to surface cracks in a structural health monitoring setting and also provides in-depth reviews of recent fully, semi and unsupervised approaches that perform crack classification, detection, segmentation and quantification. Additionally, this review also highlights popular datasets used for cracks and the metrics that are used to evaluate the performance of those algorithms. Finally, potential research gaps are outlined and further research directions are provided. ",
    "url": "https://arxiv.org/abs/2202.03714",
    "authors": [
      "Jacob König",
      "Mark Jenkins",
      "Mike Mannion",
      "Peter Barrie",
      "Gordon Morison"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03716",
    "title": "Binary Neural Networks as a general-propose compute paradigm for  on-device computer vision",
    "abstract": "For binary neural networks (BNNs) to become the mainstream on-device computer vision algorithm, they must achieve a superior speed-vs-accuracy tradeoff than 8-bit quantization and establish a similar degree of general applicability in vision tasks. To this end, we propose a BNN framework comprising 1) a minimalistic inference scheme for hardware-friendliness, 2) an over-parameterized training scheme for high accuracy, and 3) a simple procedure to adapt to different vision tasks. The resultant framework overtakes 8-bit quantization in the speed-vs-accuracy tradeoff for classification, detection, segmentation, super-resolution and matching: our BNNs not only retain the accuracy levels of their 8-bit baselines but also showcase 1.3-2.4$\\times$ faster FPS on mobile CPUs. Similar conclusions can be drawn for prototypical systolic-array-based AI accelerators, where our BNNs promise 2.8-7$\\times$ fewer execution cycles than 8-bit and 2.1-2.7$\\times$ fewer cycles than alternative BNN designs. These results suggest that the time for large-scale BNN adoption could be upon us. ",
    "url": "https://arxiv.org/abs/2202.03716",
    "authors": [
      "Guhong Nie",
      "Lirui Xiao",
      "Menglong Zhu",
      "Dongliang Chu",
      "Yue Shen",
      "Peng Li",
      "Kang Yang",
      "Li Du",
      "Bo Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03735",
    "title": "Navigating to Objects in Unseen Environments by Distance Prediction",
    "abstract": "Object Goal Navigation (ObjectNav) task is to navigate an agent to an object instance in unseen environments. The traditional navigation paradigm plans the shortest path on a pre-built map. Inspired by this, we propose an object goal navigation framework, which could directly perform path planning based on an estimated distance map. Specifically, our model takes a birds-eye-view semantic map as input, and estimates the distance from the map cells to the target object based on the learned prior knowledge. With the estimated distance map, the agent could explore the environment and navigate to the target objects based on either human-designed or learned navigation policy. Empirical results in visually realistic simulation environments show that the proposed method outperforms a wide range of baselines on success rate and efficiency. ",
    "url": "https://arxiv.org/abs/2202.03735",
    "authors": [
      "Minzhao Zhu",
      "Binglei Zhao",
      "Tao Kong"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03740",
    "title": "Consistency-Regularized Region-Growing Network for Semantic Segmentation  of Urban Scenes with Point-Level Annotations",
    "abstract": "Deep learning algorithms have obtained great success in semantic segmentation of very high-resolution (VHR) images. Nevertheless, training these models generally requires a large amount of accurate pixel-wise annotations, which is very laborious and time-consuming to collect. To reduce the annotation burden, this paper proposes a consistency-regularized region-growing network (CRGNet) to achieve semantic segmentation of VHR images with point-level annotations. The key idea of CRGNet is to iteratively select unlabeled pixels with high confidence to expand the annotated area from the original sparse points. However, since there may exist some errors and noises in the expanded annotations, directly learning from them may mislead the training of the network. To this end, we further propose the consistency regularization strategy, where a base classifier and an expanded classifier are employed. Specifically, the base classifier is supervised by the original sparse annotations, while the expanded classifier aims to learn from the expanded annotations generated by the base classifier with the region-growing mechanism. The consistency regularization is thereby achieved by minimizing the discrepancy between the predictions from both the base and the expanded classifiers. We find such a simple regularization strategy is yet very useful to control the quality of the region-growing mechanism. Extensive experiments on two benchmark datasets demonstrate that the proposed CRGNet significantly outperforms the existing state-of-the-art methods. Codes and pre-trained models will be available online. ",
    "url": "https://arxiv.org/abs/2202.03740",
    "authors": [
      "Yonghao Xu",
      "Pedram Ghamisi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03760",
    "title": "Modeling Structure with Undirected Neural Networks",
    "abstract": "Neural networks are powerful function estimators, leading to their status as a paradigm of choice for modeling structured data. However, unlike other structured representations that emphasize the modularity of the problem -- e.g., factor graphs -- neural networks are usually monolithic mappings from inputs to outputs, with a fixed computation order. This limitation prevents them from capturing different directions of computation and interaction between the modeled variables. In this paper, we combine the representational strengths of factor graphs and of neural networks, proposing undirected neural networks (UNNs): a flexible framework for specifying computations that can be performed in any order. For particular choices, our proposed models subsume and extend many existing architectures: feed-forward, recurrent, self-attention networks, auto-encoders, and networks with implicit layers. We demonstrate the effectiveness of undirected neural architectures, both unstructured and structured, on a range of tasks: tree-constrained dependency parsing, convolutional image classification, and sequence completion with attention. By varying the computation order, we show how a single UNN can be used both as a classifier and a prototype generator, and how it can fill in missing parts of an input sequence, making them a promising field for further research. ",
    "url": "https://arxiv.org/abs/2202.03760",
    "authors": [
      "Tsvetomila Mihaylova",
      "Vlad Niculae",
      "André F. T. Martins"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2202.03762",
    "title": "Eliminating Sandwich Attacks with the Help of Game Theory",
    "abstract": "Predatory trading bots lurking in Ethereum's mempool present invisible taxation of traders on automated market makers (AMMs). AMM traders specify a slippage tolerance to indicate the maximum price movement they are willing to accept. This way, traders avoid automatic transaction failure in case of small price movements before their trade request executes. However, while a too-small slippage tolerance may lead to trade failures, a too-large tolerance allows predatory trading bots to profit from sandwich attacks. These bots can extract the difference between the slippage tolerance and the actual price movement as profit. In this work, we introduce the sandwich game to analyze sandwich attacks analytically from both the attacker and victim perspectives. Moreover, we provide a simple and highly effective algorithm that traders can use to set the slippage. We unveil that the vast majority of broadcast transactions can avoid sandwich attacks while simultaneously only experiencing a low risk of transaction failure. Thereby, we demonstrate that a constant auto-slippage cannot adjust to varying trade sizes and pool characteristics. Our algorithm outperforms the constant auto-slippage suggested by the biggest AMM, Uniswap, in all performed tests. Specifically, our algorithm repeatedly demonstrates a cost reduction exceeding a factor of 100. ",
    "url": "https://arxiv.org/abs/2202.03762",
    "authors": [
      "Lioba Heimbach",
      "Roger Wattenhofer"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2202.03808",
    "title": "NIMSA: Non-Interactive Multihoming Security Authentication Scheme for  vehicular communications in Mobile Heterogeneous Networks",
    "abstract": "In vehicular communications, in-vehicle devices' mobile and multihoming characteristics bring new requirements for devicevsecurity authentication. On the one hand, the existing network layer authentication methods rely on the PKI system; on the other hand, key negotiation needs interaction. These two points determine that the traditional security authentication method requires bandwidth consumption and additional delay. It is unsuitable for heterogeneous wireless scenarios with a high packet loss rate and limited bandwidth resources. In addition, the establishment of a security association state is contrary to the original design that the network layer only provides a forwarding function. We proposed a non-interactive multihoming security authentication (NIMSA) scheme, a stateless network layer security authentication scheme triggered by data forwarding. Our scheme adopts an identity-based non-interactive key agreement strategy to avoid the interaction of signaling information, which is lightweight and has good support for mobile and multipath parallel transmission scenarios. The comparison with IKEv2 and its mobility and multihoming extension scheme (MOBIKE) shows that the proposed scheme has shorter authentication and handover delay and data transmission delay and can bring better bandwidth aggregation effect in the scenario of multipath parallel transmission. ",
    "url": "https://arxiv.org/abs/2202.03808",
    "authors": [
      "Zongzheng Wang",
      "Ping Dong"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2202.03834",
    "title": "FSM: FBS Set Management, An energy efficient multi-drone 3D trajectory  approach in cellular networks",
    "abstract": "In this paper, we consider a cellular network demand in an urban area. We aim to cover users and serve their required data rate in a period of time using a 5G cellular network. The type of considered UAV in this scenario is The Scout B- 330 UAV helicopter which can fly up to 3 km height. In these scenarios, to find the most proper trajectory of UAVs, we first must find the best positions of UAVs in different snapshots. We consider orthogonal frequency reuse to avoid interference between UAVs in the network. We also consider the number of communication channels constraint in intra cellular network. To find the optimum position of UAVs in each snapshot. We consider Non-Line of Sight (NLoS) path loss in these scenarios and aim to cover all users in each snapshot. To find the optimum trajectory of UAVs, we propose a mathematical model based on transportation problem to minimize the total distance tracked by UAVs. In each step we solve the proposed mathematical model for transiting UAVs between two snapshots. We also consider that users can be placed in different altitudes an their positions follows the Poison Point Process distribution and their mobility follows the random way point. The UAVs battery and flight limitations are also considered. To tackle the energy problem we introduce the Drone Cell Off (DCO) approach to avoid losing energy in idle hover mode. ",
    "url": "https://arxiv.org/abs/2202.03834",
    "authors": [
      "Mehdi Sookhak",
      "Amir Hossein Mohajerzadeh"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2202.03841",
    "title": "Width is Less Important than Depth in ReLU Neural Networks",
    "abstract": "We solve an open question from Lu et al. (2017), by showing that any target network with inputs in $\\mathbb{R}^d$ can be approximated by a width $O(d)$ network (independent of the target network's architecture), whose number of parameters is essentially larger only by a linear factor. In light of previous depth separation theorems, which imply that a similar result cannot hold when the roles of width and depth are interchanged, it follows that depth plays a more significant role than width in the expressive power of neural networks. We extend our results to constructing networks with bounded weights, and to constructing networks with width at most $d+2$, which is close to the minimal possible width due to previous lower bounds. Both of these constructions cause an extra polynomial factor in the number of parameters over the target network. We also show an exact representation of wide and shallow networks using deep and narrow networks which, in certain cases, does not increase the number of parameters over the target network. ",
    "url": "https://arxiv.org/abs/2202.03841",
    "authors": [
      "Gal Vardi",
      "Gilad Yehudai",
      "Ohad Shamir"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2202.03844",
    "title": "EvoPruneDeepTL: An Evolutionary Pruning Model for Transfer Learning  based Deep Neural Networks",
    "abstract": "In recent years, Deep Learning models have shown a great performance in complex optimization problems. They generally require large training datasets, which is a limitation in most practical cases. Transfer learning allows importing the first layers of a pre-trained architecture and connecting them to fully-connected layers to adapt them to a new problem. Consequently, the configuration of the these layers becomes crucial for the performance of the model. Unfortunately, the optimization of these models is usually a computationally demanding task. One strategy to optimize Deep Learning models is the pruning scheme. Pruning methods are focused on reducing the complexity of the network, assuming an expected performance penalty of the model once pruned. However, the pruning could potentially be used to improve the performance, using an optimization algorithm to identify and eventually remove unnecessary connections among neurons. This work proposes EvoPruneDeepTL, an evolutionary pruning model for Transfer Learning based Deep Neural Networks which replaces the last fully-connected layers with sparse layers optimized by a genetic algorithm. Depending on its solution encoding strategy, our proposed model can either perform optimized pruning or feature selection over the densely connected part of the neural network. We carry out different experiments with several datasets to assess the benefits of our proposal. Results show the contribution of EvoPruneDeepTL and feature selection to the overall computational efficiency of the network as a result of the optimization process. In particular, the accuracy is improved reducing at the same time the number of active neurons in the final layers. ",
    "url": "https://arxiv.org/abs/2202.03844",
    "authors": [
      "Javier Poyatos",
      "Daniel Molina",
      "Aritz. D. Martinez",
      "Javier Del Ser",
      "Francisco Herrera"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2202.03851",
    "title": "MetaKG: Meta-learning on Knowledge Graph for Cold-start Recommendation",
    "abstract": "A knowledge graph (KG) consists of a set of interconnected typed entities and their attributes. Recently, KGs are popularly used as the auxiliary information to enable more accurate, explainable, and diverse user preference recommendations. Specifically, existing KG-based recommendation methods target modeling high-order relations/dependencies from long connectivity user-item interactions hidden in KG. However, most of them ignore the cold-start problems (i.e., user cold-start and item cold-start) of recommendation analytics, which restricts their performance in scenarios when involving new users or new items. Inspired by the success of meta-learning on scarce training samples, we propose a novel meta-learning based framework called MetaKG, which encompasses a collaborative-aware meta learner and a knowledge-aware meta learner, to capture meta users' preference and entities' knowledge for cold-start recommendations. The collaborative-aware meta learner aims to locally aggregate user preferences for each user preference learning task. In contrast, the knowledge-aware meta learner is to globally generalize knowledge representation across different user preference learning tasks. Guided by two meta learners, MetaKG can effectively capture the high-order collaborative relations and semantic representations, which could be easily adapted to cold-start scenarios. Besides, we devise a novel adaptive task scheduler which can adaptively select the informative tasks for meta learning in order to prevent the model from being corrupted by noisy tasks. Extensive experiments on various cold-start scenarios using three real data sets demonstrate that our presented MetaKG outperforms all the existing state-of-the-art competitors in terms of effectiveness, efficiency, and scalability. ",
    "url": "https://arxiv.org/abs/2202.03851",
    "authors": [
      "Yuntao Du",
      "Xinjun Zhu",
      "Lu Chen",
      "Ziquan Fang",
      "Yunjun Gao"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03857",
    "title": "Learning Optical Flow with Adaptive Graph Reasoning",
    "abstract": "Estimating per-pixel motion between video frames, known as optical flow, is a long-standing problem in video understanding and analysis. Most contemporary optical flow techniques largely focus on addressing the cross-image matching with feature similarity, with few methods considering how to explicitly reason over the given scene for achieving a holistic motion understanding. In this work, taking a fresh perspective, we introduce a novel graph-based approach, called adaptive graph reasoning for optical flow (AGFlow), to emphasize the value of scene/context information in optical flow. Our key idea is to decouple the context reasoning from the matching procedure, and exploit scene information to effectively assist motion estimation by learning to reason over the adaptive graph. The proposed AGFlow can effectively exploit the context information and incorporate it within the matching procedure, producing more robust and accurate results. On both Sintel clean and final passes, our AGFlow achieves the best accuracy with EPE of 1.43 and 2.47 pixels, outperforming state-of-the-art approaches by 11.2% and 13.6%, respectively. ",
    "url": "https://arxiv.org/abs/2202.03857",
    "authors": [
      "Ao Luo",
      "Fan Yang",
      "Kunming Luo",
      "Xin Li",
      "Haoqiang Fan",
      "Shuaicheng Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03859",
    "title": "The application of Evolutionary and Nature Inspired Algorithms in Data  Science and Data Analytics",
    "abstract": "In the past 30 years, scientists have searched nature, including animals and insects, and biology in order to discover, understand, and model solutions for solving large-scale science challenges. The study of bionics reveals that how the biological structures, functions found in nature have improved our modern technologies. In this study, we present our discovery of evolutionary and nature-inspired algorithms applications in Data Science and Data Analytics in three main topics of pre-processing, supervised algorithms, and unsupervised algorithms. Among all applications, in this study, we aim to investigate four optimization algorithms that have been performed using the evolutionary and nature-inspired algorithms within data science and analytics. Feature selection optimization in pre-processing section, Hyper-parameter tuning optimization, and knowledge discovery optimization in supervised algorithms, and clustering optimization in the unsupervised algorithms. ",
    "url": "https://arxiv.org/abs/2202.03859",
    "authors": [
      "Farid Ghareh Mohammadi",
      "Farzan Shenavarmasouleh",
      "Khaled Rasheed",
      "Thiab Taha",
      "M. Hadi Amini",
      "Hamid R. Arabnia"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03861",
    "title": "Targeted Trojan-Horse Attacks on Language-based Image Retrieval",
    "abstract": "When a retrieval system expands data, its database is at risk of being attacked. In this paper, we introduce the concept of targeted Trojan-horse (TTH) attacks for language-based image retrieval (LBIR), the first keyword-wise targeted attack against the database of the retrieval system. Specifically, given a specific keyword, TTH generates a QR-code patch that can be applied to a set of different images to gain the targeted Trojan-horse images, which closes to the target keyword in the common space of cross-modal matching of retrieval model. With Uploading the generated TTH images to the database, TTH images will rank high in a normal search, even though the images are completely irrelevant to the query. We evaluate the attacks on standard language-based image retrieval benchmarks (i.e. Flickr30k and MSCOCO) and compare the results retrieved with and without the Trojan-horse images. ",
    "url": "https://arxiv.org/abs/2202.03861",
    "authors": [
      "Fan Hu",
      "Aozhu Chen",
      "Xirong Li"
    ],
    "subjectives": [
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2202.03868",
    "title": "Mapping DNN Embedding Manifolds for Network Generalization Prediction",
    "abstract": "Understanding Deep Neural Network (DNN) performance in changing conditions is essential for deploying DNNs in safety critical applications with unconstrained environments, e.g., perception for self-driving vehicles or medical image analysis. Recently, the task of Network Generalization Prediction (NGP) has been proposed to predict how a DNN will generalize in a new operating domain. Previous NGP approaches have relied on labeled metadata and known distributions for the new operating domains. In this study, we propose the first NGP approach that predicts DNN performance based solely on how unlabeled images from an external operating domain map in the DNN embedding space. We demonstrate this technique for pedestrian, melanoma, and animal classification tasks and show state of the art NGP in 13 of 15 NGP tasks without requiring domain knowledge. Additionally, we show that our NGP embedding maps can be used to identify misclassified images when the DNN performance is poor. ",
    "url": "https://arxiv.org/abs/2202.03868",
    "authors": [
      "Molly O'Brien",
      "Julia Bukowski",
      "Mathias Unberath",
      "Aria Pezeshk",
      "Greg Hager"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03870",
    "title": "Maximum Likelihood Uncertainty Estimation: Robustness to Outliers",
    "abstract": "We benchmark the robustness of maximum likelihood based uncertainty estimation methods to outliers in training data for regression tasks. Outliers or noisy labels in training data results in degraded performances as well as incorrect estimation of uncertainty. We propose the use of a heavy-tailed distribution (Laplace distribution) to improve the robustness to outliers. This property is evaluated using standard regression benchmarks and on a high-dimensional regression task of monocular depth estimation, both containing outliers. In particular, heavy-tailed distribution based maximum likelihood provides better uncertainty estimates, better separation in uncertainty for out-of-distribution data, as well as better detection of adversarial attacks in the presence of outliers. ",
    "url": "https://arxiv.org/abs/2202.03870",
    "authors": [
      "Deebul S. Nair",
      "Nico Hochgeschwender",
      "Miguel A. Olivares-Mendez"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03881",
    "title": "Robust Hybrid Learning With Expert Augmentation",
    "abstract": "Hybrid modelling reduces the misspecification of expert models by combining them with machine learning (ML) components learned from data. Like for many ML algorithms, hybrid model performance guarantees are limited to the training distribution. Leveraging the insight that the expert model is usually valid even outside the training domain, we overcome this limitation by introducing a hybrid data augmentation strategy termed \\textit{expert augmentation}. Based on a probabilistic formalization of hybrid modelling, we show why expert augmentation improves generalization. Finally, we validate the practical benefits of augmented hybrid models on a set of controlled experiments, modelling dynamical systems described by ordinary and partial differential equations. ",
    "url": "https://arxiv.org/abs/2202.03881",
    "authors": [
      "Antoine Wehenkel",
      "Jens Behrmann",
      "Hsiang Hsu",
      "Guillermo Sapiro",
      "Gilles Louppe and",
      "Jörn-Henrik Jacobsen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2202.03884",
    "title": "GraphDCA -- a Framework for Node Distribution Comparison in Real and  Synthetic Graphs",
    "abstract": "We argue that when comparing two graphs, the distribution of node structural features is more informative than global graph statistics which are often used in practice, especially to evaluate graph generative models. Thus, we present GraphDCA - a framework for evaluating similarity between graphs based on the alignment of their respective node representation sets. The sets are compared using a recently proposed method for comparing representation spaces, called Delaunay Component Analysis (DCA), which we extend to graph data. To evaluate our framework, we generate a benchmark dataset of graphs exhibiting different structural patterns and show, using three node structure feature extractors, that GraphDCA recognizes graphs with both similar and dissimilar local structure. We then apply our framework to evaluate three publicly available real-world graph datasets and demonstrate, using gradual edge perturbations, that GraphDCA satisfyingly captures gradually decreasing similarity, unlike global statistics. Finally, we use GraphDCA to evaluate two state-of-the-art graph generative models, NetGAN and CELL, and conclude that further improvements are needed for these models to adequately reproduce local structural features. ",
    "url": "https://arxiv.org/abs/2202.03884",
    "authors": [
      "Ciwan Ceylan",
      "Petra Poklukar",
      "Hanna Hultin",
      "Alexander Kravchenko",
      "Anastasia Varava",
      "Danica Kragic"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03896",
    "title": "Speech Emotion Recognition using Self-Supervised Features",
    "abstract": "Self-supervised pre-trained features have consistently delivered state-of-art results in the field of natural language processing (NLP); however, their merits in the field of speech emotion recognition (SER) still need further investigation. In this paper we introduce a modular End-to- End (E2E) SER system based on an Upstream + Downstream architecture paradigm, which allows easy use/integration of a large variety of self-supervised features. Several SER experiments for predicting categorical emotion classes from the IEMOCAP dataset are performed. These experiments investigate interactions among fine-tuning of self-supervised feature models, aggregation of frame-level features into utterance-level features and back-end classification networks. The proposed monomodal speechonly based system not only achieves SOTA results, but also brings light to the possibility of powerful and well finetuned self-supervised acoustic features that reach results similar to the results achieved by SOTA multimodal systems using both Speech and Text modalities. ",
    "url": "https://arxiv.org/abs/2202.03896",
    "authors": [
      "Edmilson Morais",
      "Ron Hoory",
      "Weizhong Zhu",
      "Itai Gat",
      "Matheus Damasceno",
      "Hagai Aronowitz"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2202.03903",
    "title": "KENN: Enhancing Deep Neural Networks by Leveraging Knowledge for Time  Series Forecasting",
    "abstract": "End-to-end data-driven machine learning methods often have exuberant requirements in terms of quality and quantity of training data which are often impractical to fulfill in real-world applications. This is specifically true in time series domain where problems like disaster prediction, anomaly detection, and demand prediction often do not have a large amount of historical data. Moreover, relying purely on past examples for training can be sub-optimal since in doing so we ignore one very important domain i.e knowledge, which has its own distinct advantages. In this paper, we propose a novel knowledge fusion architecture, Knowledge Enhanced Neural Network (KENN), for time series forecasting that specifically aims towards combining strengths of both knowledge and data domains while mitigating their individual weaknesses. We show that KENN not only reduces data dependency of the overall framework but also improves performance by producing predictions that are better than the ones produced by purely knowledge and data driven domains. We also compare KENN with state-of-the-art forecasting methods and show that predictions produced by KENN are significantly better even when trained on only 50\\% of the data. ",
    "url": "https://arxiv.org/abs/2202.03903",
    "authors": [
      "Muhammad Ali Chattha",
      "Ludger van Elst",
      "Muhammad Imran Malik",
      "Andreas Dengel",
      "Sheraz Ahmed"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03907",
    "title": "Context-Aware Discrimination Detection in Job Vacancies using  Computational Language Models",
    "abstract": "Discriminatory job vacancies are disapproved worldwide, but remain persistent. Discrimination in job vacancies can be explicit by directly referring to demographic memberships of candidates. More implicit forms of discrimination are also present that may not always be illegal but still influence the diversity of applicants. Explicit written discrimination is still present in numerous job vacancies, as was recently observed in the Netherlands. Current efforts for the detection of explicit discrimination concern the identification of job vacancies containing potentially discriminating terms such as \"young\" or \"male\". However, automatic detection is inefficient due to low precision: e.g. \"we are a young company\" or \"working with mostly male patients\" are phrases that contain explicit terms, while the context shows that these do not reflect discriminatory content. In this paper, we show how machine learning based computational language models can raise precision in the detection of explicit discrimination by identifying when the potentially discriminating terms are used in a discriminatory context. We focus on gender discrimination, which indeed suffers from low precision when filtering explicit terms. First, we created a data set for gender discrimination in job vacancies. Second, we investigated a variety of computational language models for discriminatory context detection. Third, we evaluated the capability of these models to detect unforeseen discriminating terms in context. The results show that machine learning based methods can detect explicit gender discrimination with high precision and help in finding new forms of discrimination. Accordingly, the proposed methods can substantially increase the effectiveness of detecting job vacancies which are highly suspected to be discriminatory. In turn, this may lower the discrimination experienced at the start of the recruitment process. ",
    "url": "https://arxiv.org/abs/2202.03907",
    "authors": [
      "S. Vethman",
      "A. Adhikari",
      "M. H. T. de Boer",
      "J. A. G. M. van Genabeek",
      "C. J. Veenman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03918",
    "title": "Network Coding Multicast Key-Capacity",
    "abstract": "For a multi-source multi-terminal noiseless network, the key-dissemination problem involves the task of multicasting a secret key K from the network sources to its terminals. As in secure multicast network-coding, in the key-dissemination problem the source nodes have access to independent randomness and, as the network is noiseless, the resulting key K is a function of the sources' information. However, different from traditional forms of multicast, in key-dissemination the key K need not consist of source messages, but rather may be any function of the information generated at the sources, as long as it is shared by all terminals. Allowing the shared key K to be a mixture of source information grants a flexibility to the communication process which gives rise to the potential of increased key-rates when compared to traditional secure multicast. The multicast key-capacity is the supremum of achievable key-rates, subject to the security requirement that the shared key is not revealed to an eavesdropper with predefined eavesdropping capabilities. The key-dissemination problem (termed also, secret key-agreement) has seen significant studies over the past decades in memoryless network structures. In this work, we initiate the study of key-dissemination in the context of noiseless networks, i.e., network coding. In this context, we study similarities and differences between traditional secure-multicast and the more lenient task of key-dissemination. ",
    "url": "https://arxiv.org/abs/2202.03918",
    "authors": [
      "Michael Langberg",
      "Michelle Effros"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2202.03932",
    "title": "Robustness Verification for Attention Networks using Mixed Integer  Programming",
    "abstract": "Attention networks such as transformers have been shown powerful in many applications ranging from natural language processing to object recognition. This paper further considers their robustness properties from both theoretical and empirical perspectives. Theoretically, we formulate a variant of attention networks containing linearized layer normalization and sparsemax activation, and reduce its robustness verification to a Mixed Integer Programming problem. Apart from a na\\\"ive encoding, we derive tight intervals from admissible perturbation regions and examine several heuristics to speed up the verification process. More specifically, we find a novel bounding technique for sparsemax activation, which is also applicable to softmax activation in general neural networks. Empirically, we evaluate our proposed techniques with a case study on lane departure warning and demonstrate a performance gain of approximately an order of magnitude. Furthermore, although attention networks typically deliver higher accuracy than general neural networks, contrasting its robustness against a similar-sized multi-layer perceptron surprisingly shows that they are not necessarily more robust. ",
    "url": "https://arxiv.org/abs/2202.03932",
    "authors": [
      "Hsuan-Cheng Liao",
      "Chih-Hong Cheng",
      "Maximilian Kneissl",
      "Alois Knoll"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03936",
    "title": "Accelerometer-based Bed Occupancy Detection for Automatic, Non-invasive  Long-term Cough Monitoring",
    "abstract": "We present a machine learning based long-term cough monitoring system by detecting patient's bed occupancy from a bed-attached smartphone-inbuilt accelerometer automatically. Previously this system was used to detect cough events successfully and long-term cough monitoring requires bed occupancy detection, as the initial experiments show that patients leave their bed very often for long period of time and using video-monitoring or pressure sensors are not patient-favourite alternatives. We have compiled a 249-hour dataset of manually-labelled acceleration signals gathered from seven adult male patients undergoing treatment for tuberculosis (TB). The bed occupancy detection process consists of three detectors, among which the first one classifies occupancy-change with high sensitivity, low specificity and the second one classifies occupancy-interval with high specificity, low sensitivity. The final state detector corrects the miss-classified sections. After using a leave-one-patient-out cross-validation scheme to train and evaluate four classifiers such as LR, MLP, CNN and LSTM; LSTM produces the highest area under the curve (AUC) of 0.94 while comparing the predicted bed occupancy as the output from the final state detector with the actual bed occupancy sample by sample. We have also calculated colony forming unit and time to positivity of the sputum samples of TB positive patients who were monitored for 14 days and the proposed system was used to predict daily cough rates. The results show that patients who improve under TB treatment have decreasing daily cough rates, indicating the proposed automatic, quick, non-invasive, non-intrusive, cost-effective long-term cough monitoring system can be extremely useful in monitoring patients' recovery rate. ",
    "url": "https://arxiv.org/abs/2202.03936",
    "authors": [
      "Madhurananda Pahar",
      "Igor Miranda",
      "Andreas Diacon",
      "Thomas Niesler"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03944",
    "title": "Detecting Anomalies within Time Series using Local Neural  Transformations",
    "abstract": "We develop a new method to detect anomalies within time series, which is essential in many application domains, reaching from self-driving cars, finance, and marketing to medical diagnosis and epidemiology. The method is based on self-supervised deep learning that has played a key role in facilitating deep anomaly detection on images, where powerful image transformations are available. However, such transformations are widely unavailable for time series. Addressing this, we develop Local Neural Transformations(LNT), a method learning local transformations of time series from data. The method produces an anomaly score for each time step and thus can be used to detect anomalies within time series. We prove in a theoretical analysis that our novel training objective is more suitable for transformation learning than previous deep Anomaly detection(AD) methods. Our experiments demonstrate that LNT can find anomalies in speech segments from the LibriSpeech data set and better detect interruptions to cyber-physical systems than previous work. Visualization of the learned transformations gives insight into the type of transformations that LNT learns. ",
    "url": "https://arxiv.org/abs/2202.03944",
    "authors": [
      "Tim Schneider",
      "Chen Qiu",
      "Marius Kloft",
      "Decky Aspandi Latif",
      "Steffen Staab",
      "Stephan Mandt",
      "Maja Rudolph"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03954",
    "title": "Social-DualCVAE: Multimodal Trajectory Forecasting Based on Social  Interactions Pattern Aware and Dual Conditional Variational Auto-Encoder",
    "abstract": "Pedestrian trajectory forecasting is a fundamental task in multiple utility areas, such as self-driving, autonomous robots, and surveillance systems. The future trajectory forecasting is multi-modal, influenced by physical interaction with scene contexts and intricate social interactions among pedestrians. The mainly existing literature learns representations of social interactions by deep learning networks, while the explicit interaction patterns are not utilized. Different interaction patterns, such as following or collision avoiding, will generate different trends of next movement, thus, the awareness of social interaction patterns is important for trajectory forecasting. Moreover, the social interaction patterns are privacy concerned or lack of labels. To jointly address the above issues, we present a social-dual conditional variational auto-encoder (Social-DualCVAE) for multi-modal trajectory forecasting, which is based on a generative model conditioned not only on the past trajectories but also the unsupervised classification of interaction patterns. After generating the category distribution of the unlabeled social interaction patterns, DualCVAE, conditioned on the past trajectories and social interaction pattern, is proposed for multi-modal trajectory prediction by latent variables estimating. A variational bound is derived as the minimization objective during training. The proposed model is evaluated on widely used trajectory benchmarks and outperforms the prior state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2202.03954",
    "authors": [
      "Jiashi Gao",
      "Xinming Shi",
      "James J.Q. Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03967",
    "title": "Improving the Sample-Complexity of Deep Classification Networks with  Invariant Integration",
    "abstract": "Leveraging prior knowledge on intraclass variance due to transformations is a powerful method to improve the sample complexity of deep neural networks. This makes them applicable to practically important use-cases where training data is scarce. Rather than being learned, this knowledge can be embedded by enforcing invariance to those transformations. Invariance can be imposed using group-equivariant convolutions followed by a pooling operation. For rotation-invariance, previous work investigated replacing the spatial pooling operation with invariant integration which explicitly constructs invariant representations. Invariant integration uses monomials which are selected using an iterative approach requiring expensive pre-training. We propose a novel monomial selection algorithm based on pruning methods to allow an application to more complex problems. Additionally, we replace monomials with different functions such as weighted sums, multi-layer perceptrons and self-attention, thereby streamlining the training of invariant-integration-based architectures. We demonstrate the improved sample complexity on the Rotated-MNIST, SVHN and CIFAR-10 datasets where rotation-invariant-integration-based Wide-ResNet architectures using monomials and weighted sums outperform the respective baselines in the limited sample regime. We achieve state-of-the-art results using full data on Rotated-MNIST and SVHN where rotation is a main source of intraclass variation. On STL-10 we outperform a standard and a rotation-equivariant convolutional neural network using pooling. ",
    "url": "https://arxiv.org/abs/2202.03967",
    "authors": [
      "Matthias Rath",
      "Alexandru Paul Condurache"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03968",
    "title": "Self-supervised Contrastive Learning for Cross-domain Hyperspectral  Image Representation",
    "abstract": "Recently, self-supervised learning has attracted attention due to its remarkable ability to acquire meaningful representations for classification tasks without using semantic labels. This paper introduces a self-supervised learning framework suitable for hyperspectral images that are inherently challenging to annotate. The proposed framework architecture leverages cross-domain CNN, allowing for learning representations from different hyperspectral images with varying spectral characteristics and no pixel-level annotation. In the framework, cross-domain representations are learned via contrastive learning where neighboring spectral vectors in the same image are clustered together in a common representation space encompassing multiple hyperspectral images. In contrast, spectral vectors in different hyperspectral images are separated into distinct clusters in the space. To verify that the learned representation through contrastive learning is effectively transferred into a downstream task, we perform a classification task on hyperspectral images. The experimental results demonstrate the advantage of the proposed self-supervised representation over models trained from scratch or other transfer learning methods. ",
    "url": "https://arxiv.org/abs/2202.03968",
    "authors": [
      "Hyungtae Lee",
      "Heesung Kwon"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03971",
    "title": "Computing Rule-Based Explanations of Machine Learning Classifiers using  Knowledge Graphs",
    "abstract": "The use of symbolic knowledge representation and reasoning as a way to resolve the lack of transparency of machine learning classifiers is a research area that lately attracts many researchers. In this work, we use knowledge graphs as the underlying framework providing the terminology for representing explanations for the operation of a machine learning classifier. In particular, given a description of the application domain of the classifier in the form of a knowledge graph, we introduce a novel method for extracting and representing black-box explanations of its operation, in the form of first-order logic rules expressed in the terminology of the knowledge graph. ",
    "url": "https://arxiv.org/abs/2202.03971",
    "authors": [
      "Edmund Dervakos",
      "Orfeas Menis-Mastromichalakis",
      "Alexandros Chortaras",
      "Giorgos Stamou"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03973",
    "title": "Hearing Loss, Cognitive Load and Dementia: An Overview of Interrelation,  Detection and Monitoring Challenges with Wearable Non-invasive Microwave  Sensors",
    "abstract": "This paper provides an overview of hearing loss effects on neurological function and progressive diseases; and explores the role of cognitive load monitoring to detect dementia. It also investigates the prospects of utilizing hearing aid technology to reverse cognitive decline and delay the onset of dementia, for the old age population. The interrelation between hearing loss, cognitive load and dementia is discussed. Future considerations for improvement with respect to robust diagnosis, user centricity, device accuracy and privacy for wider clinical practice is also explored. The review concludes by discussing the future scope and potential of designing practical wearable microwave technologies and evaluating their use in smart care homes setting. ",
    "url": "https://arxiv.org/abs/2202.03973",
    "authors": [
      "Usman Anwar",
      "Tughrul Arslan",
      "Amir Hussain"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2202.03974",
    "title": "Rainbow Differential Privacy",
    "abstract": "We extend a previous framework for designing differentially private (DP) mechanisms via randomized graph colorings that was restricted to binary functions, corresponding to colorings in a graph, to multi-valued functions. As before, datasets are nodes in the graph and any two neighboring datasets are connected by an edge. In our setting, we assume each dataset has a preferential ordering for the possible outputs of the mechanism, which we refer to as a rainbow. Different rainbows partition the graph of datasets into different regions. We show that when the DP mechanism is pre-specified at the boundary of such regions, at most one optimal mechanism can exist. Moreover, if the mechanism is to behave identically for all same-rainbow boundary datasets, the problem can be greatly simplified and solved by means of a morphism to a line graph. We then show closed form expressions for the line graph in the case of ternary functions. Treatment of ternary queries in this paper displays enough richness to be extended to higher-dimensional query spaces with preferential query ordering, but the optimality proof does not seem to follow directly from the ternary proof. ",
    "url": "https://arxiv.org/abs/2202.03974",
    "authors": [
      "Ziqi Zhou",
      "Onur Günlü",
      "Rafael G. L. D'Oliveira",
      "Muriel Médard",
      "Parastoo Sadeghi",
      "Rafael F. Schaefer"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03984",
    "title": "CAUSPref: Causal Preference Learning for Out-of-Distribution  Recommendation",
    "abstract": "In spite of the tremendous development of recommender system owing to the progressive capability of machine learning recently, the current recommender system is still vulnerable to the distribution shift of users and items in realistic scenarios, leading to the sharp decline of performance in testing environments. It is even more severe in many common applications where only the implicit feedback from sparse data is available. Hence, it is crucial to promote the performance stability of recommendation method in different environments. In this work, we first make a thorough analysis of implicit recommendation problem from the viewpoint of out-of-distribution (OOD) generalization. Then under the guidance of our theoretical analysis, we propose to incorporate the recommendation-specific DAG learner into a novel causal preference-based recommendation framework named CAUSPref, mainly consisting of causal learning of invariant user preference and anti-preference negative sampling to deal with implicit feedback. Extensive experimental results from real-world datasets clearly demonstrate that our approach surpasses the benchmark models significantly under types of out-of-distribution settings, and show its impressive interpretability. ",
    "url": "https://arxiv.org/abs/2202.03984",
    "authors": [
      "Yue He",
      "Zimu Wang",
      "Peng Cui",
      "Hao Zou",
      "Yafeng Zhang",
      "Qiang Cui",
      "Yong Jiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03990",
    "title": "Equivariance versus Augmentation for Spherical Images",
    "abstract": "We analyze the role of rotational equivariance in convolutional neural networks (CNNs) applied to spherical images. We compare the performance of the group equivariant networks known as S2CNNs and standard non-equivariant CNNs trained with an increasing amount of data augmentation. The chosen architectures can be considered baseline references for the respective design paradigms. Our models are trained and evaluated on single or multiple items from the MNIST or FashionMNIST dataset projected onto the sphere. For the task of image classification, which is inherently rotationally invariant, we find that by considerably increasing the amount of data augmentation and the size of the networks, it is possible for the standard CNNs to reach at least the same performance as the equivariant network. In contrast, for the inherently equivariant task of semantic segmentation, the non-equivariant networks are consistently outperformed by the equivariant networks with significantly fewer parameters. We also analyze and compare the inference latency and training times of the different networks, enabling detailed tradeoff considerations between equivariant architectures and data augmentation for practical problems. The equivariant spherical networks used in the experiments will be made available at https://github.com/JanEGerken/sem_seg_s2cnn . ",
    "url": "https://arxiv.org/abs/2202.03990",
    "authors": [
      "Jan E. Gerken",
      "Oscar Carlsson",
      "Hampus Linander",
      "Fredrik Ohlsson",
      "Christoffer Petersson",
      "Daniel Persson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.04000",
    "title": "Learning Sinkhorn divergences for supervised change point detection",
    "abstract": "Many modern applications require detecting change points in complex sequential data. Most existing methods for change point detection are unsupervised and, as a consequence, lack any information regarding what kind of changes we want to detect or if some kinds of changes are safe to ignore. This often results in poor change detection performance. We present a novel change point detection framework that uses true change point instances as supervision for learning a ground metric such that Sinkhorn divergences can be then used in two-sample tests on sliding windows to detect change points in an online manner. Our method can be used to learn a sparse metric which can be useful for both feature selection and interpretation in high-dimensional change point detection settings. Experiments on simulated as well as real world sequences show that our proposed method can substantially improve change point detection performance over existing unsupervised change point detection methods using only few labeled change point instances. ",
    "url": "https://arxiv.org/abs/2202.04000",
    "authors": [
      "Nauman Ahad",
      "Eva L. Dyer",
      "Keith B. Hengen",
      "Yao Xie",
      "Mark A. Davenport"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04006",
    "title": "VC-density and abstract cell decomposition for edge relation in graphs  of bounded twin-width",
    "abstract": "We study set systems formed by neighborhoods in graphs of bounded twin-width. In particular, we prove that such classes of graphs admit linear neighborhood complexity, in analogy to previous results concerning classes with bounded expansion and classes of bounded clique-width. Additionally, we show how, for a given graph from a class of graphs of bounded twin-width, to efficiently encode the neighborhood of a vertex in a given set of vertices $A$ of the graph. For the encoding we use only a constant number of vertices from $A$. The obtained encoding can be decoded using FO formulas. This proves that the edge relation in graphs of bounded twin-width, seen as first-order structures, admits a definable distal cell decomposition. From this fact we derive that we can apply to such classes combinatorial tools based on the Distal cutting lemma and the Distal regularity lemma. ",
    "url": "https://arxiv.org/abs/2202.04006",
    "authors": [
      "Wojciech Przybyszewski"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2202.04016",
    "title": "Ontology-based Attack Graph Enrichment",
    "abstract": "Attack graphs provide a representation of possible actions that adversaries can perpetrate to attack a system. They are used by cybersecurity experts to make decisions, e.g., to decide remediation and recovery plans. Different approaches can be used to build such graphs. We focus on logical attack graphs, based on predicate logic, to define the causality of adversarial actions. Since networks and vulnerabilities are constantly changing (e.g., new applications get installed on system devices, updated services get publicly exposed, etc.), we propose to enrich the attack graph generation approach with a semantic augmentation post-processing of the predicates. Graphs are now mapped to monitoring alerts confirming successful attack actions and updated according to network and vulnerability changes. As a result, predicates get periodically updated, based on attack evidences and ontology enrichment. This allows to verify whether changes lead the attacker to the initial goals or to cause further damage to the system not anticipated in the initial graphs. We illustrate the approach under the specific domain of cyber-physical security affecting smart cities. We validate the approach using existing tools and ontologies. ",
    "url": "https://arxiv.org/abs/2202.04016",
    "authors": [
      "Kéren Saint-Hilaire",
      "Frédéric Cuppens",
      "Nora Cuppens",
      "Joaquin Garcia-Alfaro"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2202.04030",
    "title": "Self-supervised Contrastive Learning for Volcanic Unrest Detection",
    "abstract": "Ground deformation measured from Interferometric Synthetic Aperture Radar (InSAR) data is considered a sign of volcanic unrest, statistically linked to a volcanic eruption. Recent studies have shown the potential of using Sentinel-1 InSAR data and supervised deep learning (DL) methods for the detection of volcanic deformation signals, towards global volcanic hazard mitigation. However, detection accuracy is compromised from the lack of labelled data and class imbalance. To overcome this, synthetic data are typically used for finetuning DL models pre-trained on the ImageNet dataset. This approach suffers from poor generalisation on real InSAR data. This letter proposes the use of self-supervised contrastive learning to learn quality visual representations hidden in unlabeled InSAR data. Our approach, based on the SimCLR framework, provides a solution that does not require a specialized architecture nor a large labelled or synthetic dataset. We show that our self-supervised pipeline achieves higher accuracy with respect to the state-of-the-art methods, and shows excellent generalisation even for out-of-distribution test data. Finally, we showcase the effectiveness of our approach for detecting the unrest episodes preceding the recent Icelandic Fagradalsfjall volcanic eruption. ",
    "url": "https://arxiv.org/abs/2202.04030",
    "authors": [
      "Nikolaos Ioannis Bountos",
      "Ioannis Papoutsis",
      "Dimitrios Michail",
      "Nantheera Anantrasirichai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2202.04040",
    "title": "Self-Conditioned Generative Adversarial Networks for Image Editing",
    "abstract": "Generative Adversarial Networks (GANs) are susceptible to bias, learned from either the unbalanced data, or through mode collapse. The networks focus on the core of the data distribution, leaving the tails - or the edges of the distribution - behind. We argue that this bias is responsible not only for fairness concerns, but that it plays a key role in the collapse of latent-traversal editing methods when deviating away from the distribution's core. Building on this observation, we outline a method for mitigating generative bias through a self-conditioning process, where distances in the latent-space of a pre-trained generator are used to provide initial labels for the data. By fine-tuning the generator on a re-sampled distribution drawn from these self-labeled data, we force the generator to better contend with rare semantic attributes and enable more realistic generation of these properties. We compare our models to a wide range of latent editing methods, and show that by alleviating the bias they achieve finer semantic control and better identity preservation through a wider range of transformations. Our code and models will be available at https://github.com/yzliu567/sc-gan ",
    "url": "https://arxiv.org/abs/2202.04040",
    "authors": [
      "Yunzhe Liu",
      "Rinon Gal",
      "Amit H. Bermano",
      "Baoquan Chen",
      "Daniel Cohen-Or"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04041",
    "title": "Physics-informed neural networks for solving parametric magnetostatic  problems",
    "abstract": "The optimal design of magnetic devices becomes intractable using current computational methods when the number of design parameters is high. The emerging physics-informed deep learning framework has the potential to alleviate this curse of dimensionality. The objective of this paper is to investigate the ability of physics-informed neural networks to learn the magnetic field response as a function of design parameters in the context of a two-dimensional (2-D) magnetostatic problem. Our approach is as follows. We derive the variational principle for 2-D parametric magnetostatic problems, and prove the existence and uniqueness of the solution that satisfies the equations of the governing physics, i.e., Maxwell's equations. We use a deep neural network (DNN) to represent the magnetic field as a function of space and a total of ten parameters that describe geometric features and operating point conditions. We train the DNN by minimizing the physics-informed loss function using a variant of stochastic gradient descent. Subsequently, we conduct systematic numerical studies using a parametric EI-core electromagnet problem. In these studies, we vary the DNN architecture trying more than one hundred different possibilities. For each study, we evaluate the accuracy of the DNN by comparing its predictions to those of finite element analysis. In an exhaustive non-parametric study, we observe that sufficiently parameterized dense networks result in relative errors of less than 1%. Residual connections always improve relative errors for the same number of training iterations. Also, we observe that Fourier encoding features aligned with the device geometry do improve the rate of convergence, albeit higher-order harmonics are not necessary. Finally, we demonstrate our approach on a ten-dimensional problem with parameterized geometry. ",
    "url": "https://arxiv.org/abs/2202.04041",
    "authors": [
      "Andrés Beltrán-Pulido",
      "Ilias Bilionis",
      "Dionysios Aliprantis"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2202.04053",
    "title": "DALL-Eval: Probing the Reasoning Skills and Social Biases of  Text-to-Image Generative Transformers",
    "abstract": "Generating images from textual descriptions has gained a lot of attention. Recently, DALL-E, a multimodal transformer language model, and its variants have shown high-quality text-to-image generation capabilities with a simple architecture and training objective, powered by large-scale training data and computation. However, despite the interesting image generation results, there has not been a detailed analysis on how to evaluate such models. In this work, we investigate the reasoning capabilities and social biases of such text-to-image generative transformers in detail. First, we measure four visual reasoning skills: object recognition, object counting, color recognition, and spatial relation understanding. For this, we propose PaintSkills, a diagnostic dataset and evaluation toolkit that measures these four visual reasoning skills. Second, we measure the text alignment and quality of the generated images based on pretrained image captioning, image-text retrieval, and image classification models. Third, we assess social biases in the models. For this, we suggest evaluation of gender and racial biases of text-to-image generation models based on a pretrained image-text retrieval model and human evaluation. In our experiments, we show that recent text-to-image models perform better in recognizing and counting objects than recognizing colors and understanding spatial relations, while there exists a large gap between model performances and oracle accuracy on all skills. Next, we demonstrate that recent text-to-image models learn specific gender/racial biases from web image-text pairs. We also show that our automatic evaluations of visual reasoning skills and gender bias are highly correlated with human judgments. We hope our work will help guide future progress in improving text-to-image models on visual reasoning skills and social biases. Code and data at: https://github.com/j-min/DallEval ",
    "url": "https://arxiv.org/abs/2202.04053",
    "authors": [
      "Jaemin Cho",
      "Abhay Zala",
      "Mohit Bansal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2202.04067",
    "title": "Time Series Anomaly Detection by Cumulative Radon Features",
    "abstract": "Detecting anomalous time series is key for scientific, medical and industrial tasks, but is challenging due to its inherent unsupervised nature. In recent years, progress has been made on this task by learning increasingly more complex features, often using deep neural networks. In this work, we argue that shallow features suffice when combined with distribution distance measures. Our approach models each time series as a high dimensional empirical distribution of features, where each time-point constitutes a single sample. Modeling the distance between a test time series and the normal training set therefore requires efficiently measuring the distance between multivariate probability distributions. We show that by parameterizing each time series using cumulative Radon features, we are able to efficiently and effectively model the distribution of normal time series. Our theoretically grounded but simple-to-implement approach is evaluated on multiple datasets and shown to achieve better results than established, classical methods as well as complex, state-of-the-art deep learning methods. Code is provided. ",
    "url": "https://arxiv.org/abs/2202.04067",
    "authors": [
      "Yedid Hoshen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03430",
    "title": "A Topology-Attention ConvLSTM Network and Its Application to EM Images",
    "abstract": "Structural accuracy of segmentation is important for finescale structures in biomedical images. We propose a novel TopologyAttention ConvLSTM Network (TACNet) for 3D image segmentation in order to achieve high structural accuracy for 3D segmentation tasks. Specifically, we propose a Spatial Topology-Attention (STA) module to process a 3D image as a stack of 2D image slices and adopt ConvLSTM to leverage contextual structure information from adjacent slices. In order to effectively transfer topology-critical information across slices, we propose an Iterative-Topology Attention (ITA) module that provides a more stable topology-critical map for segmentation. Quantitative and qualitative results show that our proposed method outperforms various baselines in terms of topology-aware evaluation metrics. ",
    "url": "https://arxiv.org/abs/2202.03430",
    "authors": [
      "Jiaqi Yang",
      "Xiaoling Hu",
      "Chao Chen",
      "Chialing Tsai"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03543",
    "title": "Self-Supervised Representation Learning for Speech Using Visual  Grounding and Masked Language Modeling",
    "abstract": "In this paper, we describe our submissions to the ZeroSpeech 2021 Challenge and SUPERB benchmark. Our submissions are based on the recently proposed FaST-VGS model, which is a Transformer-based model that learns to associate raw speech waveforms with semantically related images, all without the use of any transcriptions of the speech. Additionally, we introduce a novel extension of this model, FaST-VGS+, which is learned in a multi-task fashion with a masked language modeling objective in addition to the visual grounding objective. On ZeroSpeech 2021, we show that our models perform competitively on the ABX task, outperform all other concurrent submissions on the Syntactic and Semantic tasks, and nearly match the best system on the Lexical task. On the SUPERB benchmark, we show that our models also achieve strong performance, in some cases even outperforming the popular wav2vec2.0 model. ",
    "url": "https://arxiv.org/abs/2202.03543",
    "authors": [
      "Puyuan Peng",
      "David Harwath"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2202.03583",
    "title": "Multi-Label Classification of Thoracic Diseases using Dense  Convolutional Network on Chest Radiographs",
    "abstract": "Chest X-ray images are one of the most common medical diagnosis techniques to identify different thoracic diseases. However, identification of pathologies in X-ray images requires skilled manpower and are often cited as a time-consuming task with varied level of interpretation, particularly in cases where the identification of disease only by images is difficult for human eyes. With recent achievements of deep learning in image classification, its application in disease diagnosis has been widely explored. This research project presents a multi-label disease diagnosis model of chest x-rays. Using Dense Convolutional Neural Network (DenseNet), the diagnosis system was able to obtain high classification predictions. The model obtained the highest AUC score of 0.896 for condition Cardiomegaly and the lowest AUC score for Nodule, 0.655. The model also localized the parts of the chest radiograph that indicated the presence of each pathology using GRADCAM, thus contributing to the model interpretability of a deep learning algorithm. ",
    "url": "https://arxiv.org/abs/2202.03583",
    "authors": [
      "Dipkamal Bhusal",
      "Dr. Sanjeeb Prasad Panday"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03653",
    "title": "Contribution of directedness in graph spectra",
    "abstract": "In graph analyses, directed edges are often approximated to undirected ones so that the adjacency matrices may be symmetric. However, such simplification has not been thoroughly verified. In this study, we investigate how directedness affects the graph spectra by introducing random directization, which is an opposite operation of neglecting edge directions. We analytically reveal that uniformly random directization typically conserves the relative spectral structure of the adjacency matrix in the perturbative regime. The result of random directization implies that the spectrum of the adjacency matrix can be conserved after the directedness is ignored. ",
    "url": "https://arxiv.org/abs/2202.03653",
    "authors": [
      "Masaki Ochi",
      "Tatsuro Kawamoto"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2202.03732",
    "title": "Defective incidence coloring of graphs",
    "abstract": "We define the $d$-defective incidence chromatic number of a graph, generalizing the notion of incidence chromatic number, and determine it for some classes of graphs including trees, complete bipartite graphs, complete graphs, and outerplanar graphs. Fast algorithms for constructing the optimal $d$-defective incidence colorings of those graphs are presented. ",
    "url": "https://arxiv.org/abs/2202.03732",
    "authors": [
      "Huimin Bi",
      "Xin Zhang"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2202.03738",
    "title": "Conflict-free incidence coloring and two-way radio networks",
    "abstract": "In this paper, we introduce the conflict-free incidence coloring of graphs to model a problem of designing two-way radio networks efficiently and economically. Specifically, we call the vertex-edge pair $(v,e)$ an incidence of a graph. A conflict-free incidence coloring of a graph is a coloring of the incidences in such a way that two incidences $(u,e)$ and $(v,f)$ get distinct colors if and only if they conflicts each other, i.e.,(i) $u=v$, (ii) $uv$ is $e$ or $f$, or (iii) there is a vertex $w$ such that $uw=e$ and $vw=f$. The minimum number of colors used among all conflict-free incidence colorings of a graph is the conflict-free incidence chromatic number. For a simple graph with maximum degree $\\Delta$, we claim that its conflict-free incidence chromatic number is either $2\\Delta$, $2\\Delta+1$, or $2\\Delta+2$, and each of them can be attained by infinite many graphs. We also show that the conflict-free incidence chromatic number of an outer-1-planar graph with maximum degree $\\Delta$ is either $2\\Delta$ or $2\\Delta+1$, and moreover, characterize all outer-1-planar graphs whose conflict-free incidence chromatic numbers are exactly $2\\Delta$ or $2\\Delta+1$. ",
    "url": "https://arxiv.org/abs/2202.03738",
    "authors": [
      "Mengke Qi",
      "Xin Zhang"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2202.03813",
    "title": "Learning to Predict Graphs with Fused Gromov-Wasserstein Barycenters",
    "abstract": "This paper introduces a novel and generic framework to solve the flagship task of supervised labeled graph prediction by leveraging Optimal Transport tools. We formulate the problem as regression with the Fused Gromov-Wasserstein (FGW) loss and propose a predictive model relying on a FGW barycenter whose weights depend on inputs. First we introduce a non-parametric estimator based on kernel ridge regression for which theoretical results such as consistency and excess risk bound are proved. Next we propose an interpretable parametric model where the barycenter weights are modeled with a neural network and the graphs on which the FGW barycenter is calculated are additionally learned. Numerical experiments show the strength of the method and its ability to interpolate in the labeled graph space on simulated data and on a difficult metabolic identification problem where it can reach very good performance with very little engineering. ",
    "url": "https://arxiv.org/abs/2202.03813",
    "authors": [
      "Luc Brogat-Motte",
      "Rémi Flamary",
      "Céline Brouard",
      "Juho Rousu",
      "Florence d'Alché-Buc"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03874",
    "title": "FisrEbp: Enterprise Bankruptcy Prediction via Fusing its Intra-risk and  Spillover-Risk",
    "abstract": "In this paper, we propose to model enterprise bankruptcy risk by fusing its intra-risk and spillover-risk. Under this framework, we propose a novel method that is equipped with an LSTM-based intra-risk encoder and GNNs-based spillover-risk encoder. Specifically, the intra-risk encoder is able to capture enterprise intra-risk using the statistic correlated indicators from the basic business information and litigation information. The spillover-risk encoder consists of hypergraph neural networks and heterogeneous graph neural networks, which aim to model spillover risk through two aspects, i.e. hyperedge and multiplex heterogeneous relations among enterprise knowledge graph, respectively. To evaluate the proposed model, we collect multi-sources SMEs data and build a new dataset SMEsD, on which the experimental results demonstrate the superiority of the proposed method. The dataset is expected to become a significant benchmark dataset for SMEs bankruptcy prediction and promote the development of financial risk study further. ",
    "url": "https://arxiv.org/abs/2202.03874",
    "authors": [
      "Yu Zhao",
      "Shaopeng Wei",
      "Yu Guo",
      "Qing Yang",
      "Gang Kou"
    ],
    "subjectives": [
      "Risk Management (q-fin.RM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03875",
    "title": "Unsupervised Source Separation via Self-Supervised Training",
    "abstract": "We introduce two novel unsupervised (blind) source separation methods, which involve self-supervised training from single-channel two-source speech mixtures without any access to the ground truth source signals. Our first method employs permutation invariant training (PIT) to separate artificially-generated mixtures of the original mixtures back into the original mixtures, which we named mixture permutation invariant training (MixPIT). We found this challenging objective to be a valid proxy task for learning to separate the underlying sources. We improve upon this first method by creating mixtures of source estimates and employing PIT to separate these new mixtures in a cyclic fashion. We named this second method cyclic mixture permutation invariant training (MixCycle), where cyclic refers to the fact that we use the same model to produce artificial mixtures and to learn from them continuously. We show that MixPIT outperforms a common baseline (MixIT) on our small dataset (SC09Mix), and they have comparable performance on a standard dataset (LibriMix). Strikingly, we also show that MixCycle surpasses the performance of supervised PIT by being data-efficient, thanks to its inherent data augmentation mechanism. To the best of our knowledge, no other purely unsupervised method is able to match or exceed the performance of supervised training. ",
    "url": "https://arxiv.org/abs/2202.03875",
    "authors": [
      "Ertuğ Karamatlı",
      "Serap Kırbız"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2202.03893",
    "title": "Influence maximization under limited network information: Seeding  high-degree neighbors",
    "abstract": "The diffusion of information, norms, and practices across a social network can be initiated by compelling a small number of seed individuals to adopt first. Strategies proposed in previous work either assume full network information or large degree of control over what information is collected. However, privacy settings on the Internet and high non-response in surveys often severely limit available connectivity information. Here we propose a seeding strategy for scenarios with limited network information: Only the degrees and connections of some random nodes are known. This new strategy is a modification of \"random neighbor sampling\" and seeds the highest-degree neighbors of randomly selected nodes. In simulations of a linear threshold model on a range of synthetic and real-world networks, we find that this new strategy outperforms other seeding strategies, including high-degree seeding and clustered seeding. ",
    "url": "https://arxiv.org/abs/2202.03893",
    "authors": [
      "Jiamin Ou",
      "Vincent Buskens",
      "Arnout Van De Rijt",
      "Debabrata Panja"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2202.03914",
    "title": "Impact of Network Centrality and Income on Slowing Infection Spread  after Outbreaks",
    "abstract": "The COVID-19 pandemic has shed light on how the spread of infectious diseases worldwide are importantly shaped by both human mobility networks and socio-economic factors. Few studies, however, have examined the interaction of mobility networks with socio-spatial inequalities to understand the spread of infection. We introduce a novel methodology, called the Infection Delay Model, to calculate how the arrival time of an infection varies geographically, considering both effective distance-based metrics and differences in regions' capacity to isolate -- a feature associated with socioeconomic inequalities. To illustrate an application of the Infection Delay Model, this paper integrates household travel survey data with cell phone mobility data from the S\\~ao Paulo metropolitan region to assess the effectiveness of lockdowns to slow the spread of COVID-19. Rather than operating under the assumption that the next pandemic will begin in the same region as the last, the model estimates infection delays under every possible outbreak scenario, allowing for generalizable insights into the effectiveness of interventions to delay a region's first case. The model sheds light on how the effectiveness of lockdowns to slow the spread of disease is influenced by the interaction of mobility networks and socio-economic levels. We find that a negative relationship emerges between network centrality and the infection delay after lockdown, irrespective of income. Furthermore, for regions across all income and centrality levels, outbreaks starting in less central locations were more effectively slowed by a lockdown. Using the Infection Delay Model, this paper identifies and quantifies a new dimension of disease risk faced by those most central in a mobility network. ",
    "url": "https://arxiv.org/abs/2202.03914",
    "authors": [
      "Shiv G. Yücel",
      "Rafael H. M. Pereira",
      "Pedro S. Peixoto",
      "Chico Q. Camargo"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2202.03972",
    "title": "Enabling Imitation-Based Cooperation in Dynamic Social Networks",
    "abstract": "The emergence of cooperation among self-interested agents has been a key concern of the multi-agent systems community for decades. With the increased importance of network-mediated interaction, researchers have shifted the attention on the impact of social networks and their dynamics in promoting or hindering cooperation, drawing various context-dependent conclusions. For example, some lines of research, theoretical and experimental, suggest the existence of a threshold effect in the ratio of timescales of network evolution, after which cooperation will emerge, whereas other lines dispute this, suggesting instead a Goldilocks zone. In this paper we provide an evolutionary game theory framework to understand coevolutionary processes from a bottom up perspective - in particular the emergence of a cooperator-core and defector-periphery - clarifying the impact of partner selection and imitation strategies in promoting cooperative behaviour, without assuming underlying communication or reputation mechanisms. In doing so we provide a unifying framework to study imitation-based cooperation in dynamic social networks and show that disputes in the literature can in fact coexist in so far as the results stem from different equally valid assumptions. ",
    "url": "https://arxiv.org/abs/2202.03972",
    "authors": [
      "Jacques Bara",
      "Paolo Turrini",
      "Giulia Andrighetto"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:1906.01296",
    "title": "Algebraic representation of dual scalar products and stabilization of  saddle point problems",
    "abstract": " Title: Algebraic representation of dual scalar products and stabilization of  saddle point problems ",
    "url": "https://arxiv.org/abs/1906.01296",
    "authors": [
      "Silvia Bertoluzza"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:1911.11132",
    "title": "Scaling Out-of-Distribution Detection for Real-World Settings",
    "abstract": " Comments: The Species dataset and code are available at this https URL ",
    "url": "https://arxiv.org/abs/1911.11132",
    "authors": [
      "Dan Hendrycks",
      "Steven Basart",
      "Mantas Mazeika",
      "Andy Zou",
      "Joe Kwon",
      "Mohammadreza Mostajabi",
      "Jacob Steinhardt",
      "Dawn Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2006.12834",
    "title": "Sparse-RS: a versatile framework for query-efficient sparse black-box  adversarial attacks",
    "abstract": " Comments: Accepted at AAAI 2022. This version contains considerably extended results in the L0 threat model ",
    "url": "https://arxiv.org/abs/2006.12834",
    "authors": [
      "Francesco Croce",
      "Maksym Andriushchenko",
      "Naman D. Singh",
      "Nicolas Flammarion",
      "Matthias Hein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2008.01701",
    "title": "Progressive Update Guided Interdependent Networks for Single Image  Dehazing",
    "abstract": " Comments: First two authors contributed equally. This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible. Project Website: this https URL ",
    "url": "https://arxiv.org/abs/2008.01701",
    "authors": [
      "Aupendu Kar",
      "Sobhan Kanti Dhara",
      "Debashis Sen",
      "Prabir Kumar Biswas"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2008.10583",
    "title": "Layered Drawing of Undirected Graphs with Generalized Port Constraints",
    "abstract": " Title: Layered Drawing of Undirected Graphs with Generalized Port Constraints ",
    "url": "https://arxiv.org/abs/2008.10583",
    "authors": [
      "Julian Walter",
      "Johannes Zink",
      "Joachim Baumeister",
      "Alexander Wolff"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2010.09343",
    "title": "SelfVoxeLO: Self-supervised LiDAR Odometry with Voxel-based Deep Neural  Networks",
    "abstract": " Comments: Accepted to CoRL 2020 ",
    "url": "https://arxiv.org/abs/2010.09343",
    "authors": [
      "Yan Xu",
      "Zhaoyang Huang",
      "Kwan-Yee Lin",
      "Xinge Zhu",
      "Jianping Shi",
      "Hujun Bao",
      "Guofeng Zhang",
      "Hongsheng Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2011.02256",
    "title": "Advantage of Deep Neural Networks for Estimating Functions with  Singularity on Hypersurfaces",
    "abstract": " Comments: Complete version of arXiv:1802.04474 ",
    "url": "https://arxiv.org/abs/2011.02256",
    "authors": [
      "Masaaki Imaizumi",
      "Kenji Fukumizu"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2011.08562",
    "title": "A Deep Neural Network for SSVEP-based Brain-Computer Interfaces",
    "abstract": " Comments: 12 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2011.08562",
    "authors": [
      "Osman Berke Guney",
      "Muhtasham Oblokulov",
      "Huseyin Ozkan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2103.05056",
    "title": "LCDNet: Deep Loop Closure Detection and Point Cloud Registration for  LiDAR SLAM",
    "abstract": " Comments: Accepted to IEEE Transactions on Robotics (T-RO), 2022 ",
    "url": "https://arxiv.org/abs/2103.05056",
    "authors": [
      "Daniele Cattaneo",
      "Matteo Vaghi",
      "Abhinav Valada"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.08673",
    "title": "\"Average\" Approximates \"First Principal Component\"? An Empirical  Analysis on Representations from Neural Language Models",
    "abstract": " Title: \"Average\" Approximates \"First Principal Component\"? An Empirical  Analysis on Representations from Neural Language Models ",
    "url": "https://arxiv.org/abs/2104.08673",
    "authors": [
      "Zihan Wang",
      "Chengyu Dong",
      "Jingbo Shang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.00651",
    "title": "Asymptotics of representation learning in finite Bayesian neural  networks",
    "abstract": " Comments: 13+28 pages, 4 figures; v3: extensive revision with improved exposition and new section on CNNs, accepted to NeurIPS 2021; v4: minor updates to supplement; v5: post-NeurIPS update, minor typos fixed ",
    "url": "https://arxiv.org/abs/2106.00651",
    "authors": [
      "Jacob A. Zavatone-Veth",
      "Abdulkadir Canatar",
      "Benjamin S. Ruben",
      "Cengiz Pehlevan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.02073",
    "title": "Neural Collapse Under MSE Loss: Proximity to and Dynamics on the Central  Path",
    "abstract": " Comments: ICLR 2022 Oral. Appendix contains [A] empirical experiments, [B-D] proofs of theoretical results, and [E] survey of related works examining Neural Collapse ",
    "url": "https://arxiv.org/abs/2106.02073",
    "authors": [
      "X.Y. Han",
      "Vardan Papyan",
      "David L. Donoho"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Differential Geometry (math.DG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.04908",
    "title": "Automatic Sexism Detection with Multilingual Transformer Models",
    "abstract": " Comments: Technical Report to the AIT_FHSTP EXIST 2021 Challenge contribution (under review) this http URL ",
    "url": "https://arxiv.org/abs/2106.04908",
    "authors": [
      "Mina Schütz",
      "Jaqueline Boeck",
      "Daria Liakhovets",
      "Djordje Slijepčević",
      "Armin Kirchknopf",
      "Manuel Hecht",
      "Johannes Bogensperger",
      "Sven Schlarb",
      "Alexander Schindler",
      "Matthias Zeppelzauer"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2106.06468",
    "title": "Locally Sparse Neural Networks for Tabular Biomedical Data",
    "abstract": " Title: Locally Sparse Neural Networks for Tabular Biomedical Data ",
    "url": "https://arxiv.org/abs/2106.06468",
    "authors": [
      "Junchen Yang",
      "Ofir Lindenbaum",
      "Yuval Kluger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.13695",
    "title": "CADDA: Class-wise Automatic Differentiable Data Augmentation for EEG  Signals",
    "abstract": " Title: CADDA: Class-wise Automatic Differentiable Data Augmentation for EEG  Signals ",
    "url": "https://arxiv.org/abs/2106.13695",
    "authors": [
      "Cédric Rommel",
      "Thomas Moreau",
      "Joseph Paillard",
      "Alexandre Gramfort"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.01581",
    "title": "Noise Tolerant Identification and Tuning Approach Using Deep Neural  Networks For Visual Servoing Applications",
    "abstract": " Title: Noise Tolerant Identification and Tuning Approach Using Deep Neural  Networks For Visual Servoing Applications ",
    "url": "https://arxiv.org/abs/2107.01581",
    "authors": [
      "Oussama Abdul Hay",
      "Mohamad Chehadeh",
      "Abdulla Ayyad",
      "Mohamad Wahbah",
      "Muhammad Humais",
      "Lakmal Seneviratne",
      "Yahya Zweiri"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2107.05434",
    "title": "Polynomial-time algorithm for Maximum Independent Set in bounded-degree  graphs with no long induced claws",
    "abstract": " Title: Polynomial-time algorithm for Maximum Independent Set in bounded-degree  graphs with no long induced claws ",
    "url": "https://arxiv.org/abs/2107.05434",
    "authors": [
      "Tara Abrishami",
      "Maria Chudnovsky",
      "Cemil Dibek",
      "Paweł Rzążewski"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2108.04729",
    "title": "Spectral Robustness for Correlation Clustering Reconstruction in  Semi-Adversarial Models",
    "abstract": " Title: Spectral Robustness for Correlation Clustering Reconstruction in  Semi-Adversarial Models ",
    "url": "https://arxiv.org/abs/2108.04729",
    "authors": [
      "Flavio Chierichetti",
      "Alessandro Panconesi",
      "Giuseppe Re",
      "Luca Trevisan"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.11887",
    "title": "Distributionally Robust Joint Chance-Constrained Optimization for  Networked Microgrids Considering Contingencies and Renewable Uncertainty",
    "abstract": " Comments: Accepted by IEEE Transactions on Smart Grid ",
    "url": "https://arxiv.org/abs/2109.11887",
    "authors": [
      "Yifu Ding",
      "Thomas Morstyn",
      "Malcolm D. McCulloch"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2110.03176",
    "title": "Emergence of Robust and Efficient Networks in a Family of Attachment  Models",
    "abstract": " Title: Emergence of Robust and Efficient Networks in a Family of Attachment  Models ",
    "url": "https://arxiv.org/abs/2110.03176",
    "authors": [
      "Fuxuan Liao",
      "Yukio Hayashi"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)",
      "Adaptation and Self-Organizing Systems (nlin.AO)"
    ]
  },
  {
    "id": "arXiv:2110.03922",
    "title": "A Theory of the Inductive Bias and Generalization of Kernel Regression  and Wide Neural Networks",
    "abstract": " Comments: 9 pages (main text), 23 pages (total), 9 figures ",
    "url": "https://arxiv.org/abs/2110.03922",
    "authors": [
      "James B. Simon",
      "Madeline Dickens",
      "Michael R. DeWeese"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.08058",
    "title": "Quantifying Local Specialization in Deep Neural Networks",
    "abstract": " Comments: 21 pages, 6 figures. Code is available at this https URL ",
    "url": "https://arxiv.org/abs/2110.08058",
    "authors": [
      "Shlomi Hod",
      "Daniel Filan",
      "Stephen Casper",
      "Andrew Critch",
      "Stuart Russell"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2110.14764",
    "title": "Generalized Funnelling: Ensemble Learning and Heterogeneous Document  Embeddings for Cross-Lingual Text Classification",
    "abstract": " Title: Generalized Funnelling: Ensemble Learning and Heterogeneous Document  Embeddings for Cross-Lingual Text Classification ",
    "url": "https://arxiv.org/abs/2110.14764",
    "authors": [
      "Alejandro Moreo",
      "Andrea Pedrotti",
      "Fabrizio Sebastiani"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.07355",
    "title": "Fracture Detection in Wrist X-ray Images Using Deep Learning-Based  Object Detection Models",
    "abstract": " Comments: This paper is accepted at Sensors, MDPI, 2022, 22, 1285. Section: \"Sensing and Imaging\" ",
    "url": "https://arxiv.org/abs/2111.07355",
    "authors": [
      "Fırat Hardalaç",
      "Fatih Uysal",
      "Ozan Peker",
      "Murat Çiçeklidağ",
      "Tolga Tolunay",
      "Nil Tokgöz",
      "Uğurhan Kutbay",
      "Boran Demirciler",
      "Fatih Mert"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2111.08410",
    "title": "Thoughts on the Consistency between Ricci Flow and Neural Network  Behavior",
    "abstract": " Title: Thoughts on the Consistency between Ricci Flow and Neural Network  Behavior ",
    "url": "https://arxiv.org/abs/2111.08410",
    "authors": [
      "Jun Chen",
      "Tianxin Huang",
      "Wenzhou Chen",
      "Yong Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2112.08102",
    "title": "Robust Neural Network Classification via Double Regularization",
    "abstract": " Comments: 26 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2112.08102",
    "authors": [
      "Olof Zetterqvist",
      "Rebecka Jörnsten",
      "Johan Jonasson"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2112.08830",
    "title": "Graph-wise Common Latent Factor Extraction for Unsupervised Graph  Representation Learning",
    "abstract": " Comments: Accepted to AAAI 2022 ",
    "url": "https://arxiv.org/abs/2112.08830",
    "authors": [
      "Thilini Cooray",
      "Ngai-Man Cheung"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.14608",
    "title": "HPRN: Holistic Prior-embedded Relation Network for Spectral  Super-Resolution",
    "abstract": " Title: HPRN: Holistic Prior-embedded Relation Network for Spectral  Super-Resolution ",
    "url": "https://arxiv.org/abs/2112.14608",
    "authors": [
      "Chaoxiong Wu",
      "Jiaojiao Li",
      "Rui Song",
      "Yunsong Li",
      "Qian Du"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.14624",
    "title": "Towards a Shapley Value Graph Framework for Medical peer-influence",
    "abstract": " Comments: Preliminary work - to be expanded and amended ",
    "url": "https://arxiv.org/abs/2112.14624",
    "authors": [
      "Jamie Duell",
      "Monika Seisenberger",
      "Gert Aarts",
      "Shangming Zhou",
      "Xiuyi Fan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.02351",
    "title": "Asymptotic Security using Bayesian Defense Mechanism with Application to  Cyber Deception",
    "abstract": " Comments: 16 pages ",
    "url": "https://arxiv.org/abs/2201.02351",
    "authors": [
      "Hampei Sasahara",
      "Henrik Sandberg"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Science and Game Theory (cs.GT)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2201.02441",
    "title": "Applications of Signature Methods to Market Anomaly Detection",
    "abstract": " Title: Applications of Signature Methods to Market Anomaly Detection ",
    "url": "https://arxiv.org/abs/2201.02441",
    "authors": [
      "Erdinc Akyildirim",
      "Matteo Gambara",
      "Josef Teichmann",
      "Syang Zhou"
    ],
    "subjectives": [
      "Computational Finance (q-fin.CP)",
      "Machine Learning (cs.LG)",
      "Mathematical Finance (q-fin.MF)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2201.04676",
    "title": "UniFormer: Unified Transformer for Efficient Spatiotemporal  Representation Learning",
    "abstract": " Comments: Published as a conference paper at ICLR 2022; 19pages, 7 figures ",
    "url": "https://arxiv.org/abs/2201.04676",
    "authors": [
      "Kunchang Li",
      "Yali Wang",
      "Peng Gao",
      "Guanglu Song",
      "Yu Liu",
      "Hongsheng Li",
      "Yu Qiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.06885",
    "title": "Evidence-aware Fake News Detection with Graph Neural Networks",
    "abstract": " Comments: Accepted by TheWebConf 2022 ",
    "url": "https://arxiv.org/abs/2201.06885",
    "authors": [
      "Weizhi Xu",
      "Junfei Wu",
      "Qiang Liu",
      "Shu Wu",
      "Liang Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.07284",
    "title": "TranAD: Deep Transformer Networks for Anomaly Detection in Multivariate  Time Series Data",
    "abstract": " Comments: Accepted in VLDB 2022 ",
    "url": "https://arxiv.org/abs/2201.07284",
    "authors": [
      "Shreshth Tuli",
      "Giuliano Casale",
      "Nicholas R. Jennings"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.07537",
    "title": "Graph Neural Network-based Android Malware Classification with Jumping  Knowledge",
    "abstract": " Comments: 9 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2201.07537",
    "authors": [
      "Wai Weng Lo",
      "Siamak Layeghy",
      "Mohanad Sarhan",
      "Marcus Gallagher",
      "Marius Portmann"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.09061",
    "title": "Explore the Expression: Facial Expression Generation using Auxiliary  Classifier Generative Adversarial Network",
    "abstract": " Title: Explore the Expression: Facial Expression Generation using Auxiliary  Classifier Generative Adversarial Network ",
    "url": "https://arxiv.org/abs/2201.09061",
    "authors": [
      "J. Rafid Siddiqui"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.10361",
    "title": "Reinforcement Learning-Based Deadline and Battery-Aware Offloading in  Smart Farm IoT-UAV Networks",
    "abstract": " Comments: Accepted Paper. Please check footnote in Page 1 for copyright ",
    "url": "https://arxiv.org/abs/2201.10361",
    "authors": [
      "Anne Catherine Nguyen",
      "Turgay Pamuklu",
      "Aisha Syed",
      "W. Sean Kennedy",
      "Melike Erol-Kantarci"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.12650",
    "title": "New results on the robust coloring problem",
    "abstract": " Title: New results on the robust coloring problem ",
    "url": "https://arxiv.org/abs/2201.12650",
    "authors": [
      "Delia Garijo",
      "Alberto Márquez",
      "Rafael Robles"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2202.00424",
    "title": "Improving Parametric Neural Networks for High-Energy Physics (and  Beyond)",
    "abstract": " Comments: 18 pages, 13 figures, 5 tables; new content ",
    "url": "https://arxiv.org/abs/2202.00424",
    "authors": [
      "Luca Anzalone",
      "Tommaso Diotalevi",
      "Daniele Bonacorsi"
    ],
    "subjectives": [
      "High Energy Physics - Experiment (hep-ex)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.01487",
    "title": "A benchmark of state-of-the-art sound event detection systems evaluated  on synthetic soundscapes",
    "abstract": " Title: A benchmark of state-of-the-art sound event detection systems evaluated  on synthetic soundscapes ",
    "url": "https://arxiv.org/abs/2202.01487",
    "authors": [
      "Francesca Ronchini",
      "Romain Serizel"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2202.01699",
    "title": "DistrEdge: Speeding up Convolutional Neural Network Inference on  Distributed Edge Devices",
    "abstract": " Title: DistrEdge: Speeding up Convolutional Neural Network Inference on  Distributed Edge Devices ",
    "url": "https://arxiv.org/abs/2202.01699",
    "authors": [
      "Xueyu Hou",
      "Yongjie Guan",
      "Tao Han",
      "Ning Zhang"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2202.01919",
    "title": "Theoretical Exploration of Solutions of Feedforward ReLU networks",
    "abstract": " Comments: v2: hyperlink overrun modified ",
    "url": "https://arxiv.org/abs/2202.01919",
    "authors": [
      "Changcun Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.02113",
    "title": "From Discrimination to Generation: Knowledge Graph Completion with  Generative Transformer",
    "abstract": " Comments: Work in progress ",
    "url": "https://arxiv.org/abs/2202.02113",
    "authors": [
      "Xin Xie",
      "Ningyu Zhang",
      "Zhoubo Li",
      "Shumin Deng",
      "Hui Chen",
      "Feiyu Xiong",
      "Mosha Chen",
      "Huajun Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2202.02142",
    "title": "Deep invariant networks with differentiable augmentation layers",
    "abstract": " Title: Deep invariant networks with differentiable augmentation layers ",
    "url": "https://arxiv.org/abs/2202.02142",
    "authors": [
      "Cédric Rommel",
      "Thomas Moreau",
      "Alexandre Gramfort"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.02510",
    "title": "A Survey on Poisoning Attacks Against Supervised Machine Learning",
    "abstract": " Title: A Survey on Poisoning Attacks Against Supervised Machine Learning ",
    "url": "https://arxiv.org/abs/2202.02510",
    "authors": [
      "Wenjun Qiu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.02575",
    "title": "Differentially Private Graph Classification with GNNs",
    "abstract": " Title: Differentially Private Graph Classification with GNNs ",
    "url": "https://arxiv.org/abs/2202.02575",
    "authors": [
      "Tamara T. Mueller",
      "Johannes C. Paetzold",
      "Chinmay Prabhakar",
      "Dmitrii Usynin",
      "Daniel Rueckert",
      "Georgios Kaissis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2202.02918",
    "title": "Soft Actor-Critic with Inhibitory Networks for Faster Retraining",
    "abstract": " Comments: 16 pages including Appendix ",
    "url": "https://arxiv.org/abs/2202.02918",
    "authors": [
      "Jaime S. Ide",
      "Daria Mićović",
      "Michael J. Guarino",
      "Kevin Alcedo",
      "David Rosenbluth",
      "Adrian P. Pope"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2202.02984",
    "title": "Deep Residual Shrinkage Networks for EMG-based Gesture Identification",
    "abstract": " Title: Deep Residual Shrinkage Networks for EMG-based Gesture Identification ",
    "url": "https://arxiv.org/abs/2202.02984",
    "authors": [
      "Yueying Ma",
      "Chengbo Wang",
      "Chengenze Jiang",
      "Zimo Li"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03233",
    "title": "A Variational Edge Partition Model for Supervised Graph Representation  Learning",
    "abstract": " Comments: 15 pages, 3 figures, 13 pages of appendix ",
    "url": "https://arxiv.org/abs/2202.03233",
    "authors": [
      "Yilin He",
      "Chaojie Wang",
      "Hao Zhang",
      "Bo Chen",
      "Mingyuan Zhou"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Computation (stat.CO)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2202.03390",
    "title": "GMC -- Geometric Multimodal Contrastive Representation Learning",
    "abstract": " Title: GMC -- Geometric Multimodal Contrastive Representation Learning ",
    "url": "https://arxiv.org/abs/2202.03390",
    "authors": [
      "Petra Poklukar",
      "Miguel Vasco",
      "Hang Yin",
      "Francisco S. Melo",
      "Ana Paiva",
      "Danica Kragic"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  }
]