[
  {
    "id": "arXiv:2112.09792",
    "title": "A data-centric weak supervised learning for highway traffic incident  detection",
    "abstract": "Using the data from loop detector sensors for near-real-time detection of traffic incidents in highways is crucial to averting major traffic congestion. While recent supervised machine learning methods offer solutions to incident detection by leveraging human-labeled incident data, the false alarm rate is often too high to be used in practice. Specifically, the inconsistency in the human labeling of the incidents significantly affects the performance of supervised learning models. To that end, we focus on a data-centric approach to improve the accuracy and reduce the false alarm rate of traffic incident detection on highways. We develop a weak supervised learning workflow to generate high-quality training labels for the incident data without the ground truth labels, and we use those generated labels in the supervised learning setup for final detection. This approach comprises three stages. First, we introduce a data preprocessing and curation pipeline that processes traffic sensor data to generate high-quality training data through leveraging labeling functions, which can be domain knowledge-related or simple heuristic rules. Second, we evaluate the training data generated by weak supervision using three supervised learning models -- random forest, k-nearest neighbors, and a support vector machine ensemble -- and long short-term memory classifiers. The results show that the accuracy of all of the models improves significantly after using the training data generated by weak supervision. Third, we develop an online real-time incident detection approach that leverages the model ensemble and the uncertainty quantification while detecting incidents. Overall, we show that our proposed weak supervised learning workflow achieves a high incident detection rate (0.90) and low false alarm rate (0.08). ",
    "url": "https://arxiv.org/abs/2112.09792",
    "authors": [
      "Yixuan Sun",
      "Tanwi Mallick",
      "Prasanna Balaprakash",
      "Jane Macfarlane"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.09842",
    "title": "Manifold embedding data-driven mechanics",
    "abstract": "This article introduces a new data-driven approach that leverages a manifold embedding generated by the invertible neural network to improve the robustness, efficiency, and accuracy of the constitutive-law-free simulations with limited data. We achieve this by training a deep neural network to globally map data from the constitutive manifold onto a lower-dimensional Euclidean vector space. As such, we establish the relation between the norm of the mapped Euclidean vector space and the metric of the manifold and lead to a more physically consistent notion of distance for the material data. This treatment in return allows us to bypass the expensive combinatorial optimization, which may significantly speed up the model-free simulations when data are abundant and of high dimensions. Meanwhile, the learning of embedding also improves the robustness of the algorithm when the data is sparse or distributed unevenly in the parametric space. Numerical experiments are provided to demonstrate and measure the performance of the manifold embedding technique under different circumstances. Results obtained from the proposed method and those obtained via the classical energy norms are compared. ",
    "url": "https://arxiv.org/abs/2112.09842",
    "authors": [
      "Bahador Bahmani",
      "WaiChing Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.09933",
    "title": "DegreEmbed: incorporating entity embedding into logic rule learning for  knowledge graph reasoning",
    "abstract": "Knowledge graphs (KGs), as structured representations of real world facts, are intelligent databases incorporating human knowledge that can help machine imitate the way of human problem solving. However, due to the nature of rapid iteration as well as incompleteness of data, KGs are usually huge and there are inevitably missing facts in KGs. Link prediction for knowledge graphs is the task aiming to complete missing facts by reasoning based on the existing knowledge. Two main streams of research are widely studied: one learns low-dimensional embeddings for entities and relations that can capture latent patterns, and the other gains good interpretability by mining logical rules. Unfortunately, previous studies rarely pay attention to heterogeneous KGs. In this paper, we propose DegreEmbed, a model that combines embedding-based learning and logic rule mining for inferring on KGs. Specifically, we study the problem of predicting missing links in heterogeneous KGs that involve entities and relations of various types from the perspective of the degrees of nodes. Experimentally, we demonstrate that our DegreEmbed model outperforms the state-of-the-art methods on real world datasets. Meanwhile, the rules mined by our model are of high quality and interpretability. ",
    "url": "https://arxiv.org/abs/2112.09933",
    "authors": [
      "Yuliang Wei",
      "Haotian Li",
      "Yao Wang",
      "Guodong Xin",
      "Hongri Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.09964",
    "title": "GOPHER: Categorical probabilistic forecasting with graph structure via  local continuous-time dynamics",
    "abstract": "We consider the problem of probabilistic forecasting over categories with graph structure, where the dynamics at a vertex depends on its local connectivity structure. We present GOPHER, a method that combines the inductive bias of graph neural networks with neural ODEs to capture the intrinsic local continuous-time dynamics of our probabilistic forecasts. We study the benefits of these two inductive biases by comparing against baseline models that help disentangle the benefits of each. We find that capturing the graph structure is crucial for accurate in-domain probabilistic predictions and more sample efficient models. Surprisingly, our experiments demonstrate that the continuous time evolution inductive bias brings little to no benefit despite reflecting the true probability dynamics. ",
    "url": "https://arxiv.org/abs/2112.09964",
    "authors": [
      "Ke Alexander Wang",
      "Danielle Maddix",
      "Yuyang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2112.10078",
    "title": "Managing dataset shift by adversarial validation for credit scoring",
    "abstract": "Dataset shift is common in credit scoring scenarios, and the inconsistency between the distribution of training data and the data that actually needs to be predicted is likely to cause poor model performance. However, most of the current studies do not take this into account, and they directly mix data from different time periods when training the models. This brings about two problems. Firstly, there is a risk of data leakage, i.e., using future data to predict the past. This can result in inflated results in offline validation, but unsatisfactory results in practical applications. Secondly, the macroeconomic environment and risk control strategies are likely to be different in different time periods, and the behavior patterns of borrowers may also change. The model trained with past data may not be applicable to the recent stage. Therefore, we propose a method based on adversarial validation to alleviate the dataset shift problem in credit scoring scenarios. In this method, partial training set samples with the closest distribution to the predicted data are selected for cross-validation by adversarial validation to ensure the generalization performance of the trained model on the predicted samples. In addition, through a simple splicing method, samples in the training data that are inconsistent with the test data distribution are also involved in the training process of cross-validation, which makes full use of all the data and further improves the model performance. To verify the effectiveness of the proposed method, comparative experiments with several other data split methods are conducted with the data provided by Lending Club. The experimental results demonstrate the importance of dataset shift in the field of credit scoring and the superiority of the proposed method. ",
    "url": "https://arxiv.org/abs/2112.10078",
    "authors": [
      "Hongyi Qian",
      "Baohui Wang",
      "Ping Ma",
      "Lei Peng",
      "Songfeng Gao",
      "You Song"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.10107",
    "title": "Expression is enough: Improving traffic signal control with advanced  traffic state representation",
    "abstract": "Recently, finding fundamental properties for traffic state representation is more critical than complex algorithms for traffic signal control (TSC).In this paper, we (1) present a novel, flexible and straightforward method advanced max pressure (Advanced-MP), taking both running and queueing vehicles into consideration to decide whether to change current phase; (2) novelty design the traffic movement representation with the efficient pressure and effective running vehicles from Advanced-MP, namely advanced traffic state (ATS); (3) develop an RL-based algorithm template Advanced-XLight, by combining ATS with current RL approaches and generate two RL algorithms, \"Advanced-MPLight\" and \"Advanced-CoLight\". Comprehensive experiments on multiple real-world datasets show that: (1) the Advanced-MP outperforms baseline methods, which is efficient and reliable for deployment; (2) Advanced-MPLight and Advanced-CoLight could achieve new state-of-the-art. Our code is released on Github. ",
    "url": "https://arxiv.org/abs/2112.10107",
    "authors": [
      "Liang Zhang",
      "Qiang Wu",
      "Jun Shen",
      "Linyuan Lü",
      "Jianqing Wu",
      "Bo Du"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2112.10305",
    "title": "Model-based gait recognition using graph network on very large  population database",
    "abstract": "At present, the existing gait recognition systems are focusing on developing methods to extract robust gait feature from silhouette images and they indeed achieved great success. However, gait can be sensitive to appearance features such as clothing and carried items. Compared with appearance-based method, model-based gait recognition is promising due to the robustness against these variations. In recent years, with the development of human pose estimation, the difficulty of model-based gait recognition methods has been mitigated. In this paper, to resist the increase of subjects and views variation, local features are built and a siamese network is proposed to maximize the distance of samples from the same subject. We leverage recent advances in action recognition to embed human pose sequence to a vector and introduce Spatial-Temporal Graph Convolution Blocks (STGCB) which has been commonly used in action recognition for gait recognition. Experiments on the very large population dataset named OUMVLP-Pose and the popular dataset, CASIA-B, show that our method archives some state-of-the-art (SOTA) performances in model-based gait recognition. The code and models of our method are available at https://github.com/timelessnaive/Gait-for-Large-Dataset after being accepted. ",
    "url": "https://arxiv.org/abs/2112.10305",
    "authors": [
      "Zhihao Wang",
      "Chaoying Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.10412",
    "title": "Long term behavior of dynamic equilibria in fluid queuing networks",
    "abstract": "A fluid queuing network constitutes one of the simplest models in which to study flow dynamics over a network. In this model we have a single source-sink pair and each link has a per-time-unit capacity and a transit time. A dynamic equilibrium (or equilibrium flow over time) is a flow pattern over time such that no flow particle has incentives to unilaterally change its path. Although the model has been around for almost fifty years, only recently results regarding existence and characterization of equilibria have been obtained. In particular the long term behavior remains poorly understood. Our main result in this paper is to show that, under a natural (and obviously necessary) condition on the queuing capacity, a dynamic equilibrium reaches a steady state (after which queue lengths remain constant) in finite time. Previously, it was not even known that queue lengths would remain bounded. The proof is based on the analysis of a rather non-obvious potential function that turns out to be monotone along the evolution of the equilibrium. Furthermore, we show that the steady state is characterized as an optimal solution of a certain linear program. When this program has a unique solution, which occurs generically, the long term behavior is completely predictable. On the contrary, if the linear program has multiple solutions the steady state is more difficult to identify as it depends on the whole temporal evolution of the equilibrium. ",
    "url": "https://arxiv.org/abs/2112.10412",
    "authors": [
      "Roberto Cominetti",
      "José Correa",
      "Neil Olver"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2112.10436",
    "title": "Community detection and reciprocity in networks by jointly modeling  pairs of edges",
    "abstract": "We present a probabilistic generative model and an efficient algorithm to both perform community detection and capture reciprocity in networks. Our approach jointly models pairs of edges with exact 2-edge joint distributions. In addition, it provides closed-form analytical expressions for both marginal and conditional distributions. We validate our model on synthetic data in recovering communities, edge prediction tasks, and generating synthetic networks that replicate the reciprocity values observed in real networks. We also highlight these findings on two real datasets that are relevant for social scientists and behavioral ecologists. Our method overcomes the limitations of both standard algorithms and recent models that incorporate reciprocity through a pseudo-likelihood approximation. We provide an open-source implementation of the code online. ",
    "url": "https://arxiv.org/abs/2112.10436",
    "authors": [
      "Martina Contisciani",
      "Hadiseh Safdari",
      "Caterina De Bacco"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2112.10481",
    "title": "a novel attention-based network for fast salient object detection",
    "abstract": "In the current salient object detection network, the most popular method is using U-shape structure. However, the massive number of parameters leads to more consumption of computing and storage resources which are not feasible to deploy on the limited memory device. Some others shallow layer network will not maintain the same accuracy compared with U-shape structure and the deep network structure with more parameters will not converge to a global minimum loss with great speed. To overcome all of these disadvantages, we proposed a new deep convolution network architecture with three contributions: (1) using smaller convolution neural networks (CNNs) to compress the model in our improved salient object features compression and reinforcement extraction module (ISFCREM) to reduce parameters of the model. (2) introducing channel attention mechanism in ISFCREM to weigh different channels for improving the ability of feature representation. (3) applying a new optimizer to accumulate the long-term gradient information during training to adaptively tune the learning rate. The results demonstrate that the proposed method can compress the model to 1/3 of the original size nearly without losing the accuracy and converging faster and more smoothly on six widely used datasets of salient object detection compared with the others models. Our code is published in https://gitee.com/binzhangbinzhangbin/code-a-novel-attention-based-network-for-fast-salient-object-detection.git ",
    "url": "https://arxiv.org/abs/2112.10481",
    "authors": [
      "Bin Zhang",
      "Yang Wu",
      "Xiaojing Zhang",
      "Ming Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.10498",
    "title": "Distributed pricing-based resource allocation for dense device-to-device  communications in beyond 5G networks",
    "abstract": "Considering the dramatic increase of data rate demand in beyond fifth generation (5G) networks due to the numerous transmitting nodes, dense device-to-device (D2D) communications where multiple D2D pairs can simultaneously reuse a cellular link can be considered as a communication paradigm for future wireless networks. Since distributed methods can be more practical compared to complex centralized schemes, we propose a low-complexity distributed pricing-based resource allocation algorithm to allocate power to cellular user equipments (CUEs) and D2D pairs constrained to the minimum quality-of-service (QoS) requirements of CUEs and D2D pairs in two phases. The price of each link is set by the base station (BS). CUEs and D2D pairs maximize their rate-and-interference-dependent utility function by adjusting their power in the first phase, while the price of each link is updated at the BS based on the minimum QoS requirements of CUEs and D2D pairs in the second phase. The proposed utility function controls D2D admission, hence it is suitable for dense scenarios. The proposed method is fast due to the closed-form solution for the first phase power allocation. Numerical results verify the effectiveness of the proposed method for practical dense beyond 5G scenarios by allocating resources to multiple D2D pairs and taking advantage of the spatial reuse gain of D2D pairs. Furthermore, the utility function definition is discussed to illustrate its effectiveness for SE maximization. Finally, the SE of the proposed method is compared to other centralized and distributed algorithms to demonstrate the higher sum-rate performance of the proposed algorithm. ",
    "url": "https://arxiv.org/abs/2112.10498",
    "authors": [
      "Mohammad Hossein Bahonar",
      "Mohammad Javad Omidi"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2112.10544",
    "title": "Wavenumber explicit convergence of a multiscale GFEM for heterogeneous  Helmholtz problems",
    "abstract": "In this paper, a generalized finite element method (GFEM) with optimal local approximation spaces for solving high-frequency heterogeneous Helmholtz problems is systematically studied. The local spaces are built from selected eigenvectors of local eigenvalue problems defined on generalized harmonic spaces. At both continuous and discrete levels, $(i)$ wavenumber explicit and nearly exponential decay rates for the local approximation errors are obtained without any assumption on the size of subdomains; $(ii)$ a quasi-optimal and nearly exponential global convergence of the method is established by assuming that the size of subdomains is $O(1/k)$ ($k$ is the wavenumber). A novel resonance effect between the wavenumber and the dimension of local spaces on the decay of error with respect to the oversampling size is implied by the analysis. Furthermore, for fixed dimensions of local spaces, the discrete local errors are proved to converge as $h\\rightarrow 0$ ($h$ denoting the mesh size) towards the continuous local errors. The method at the continuous level extends the plane wave partition of unity method [I. Babuska and J. M. Melenk, Int.\\;J.\\;Numer.\\;Methods Eng., 40 (1997), pp.~727--758] to the heterogeneous-coefficients case, and at the discrete level, it delivers an efficient non-iterative domain decomposition method for solving discrete Helmholtz problems resulting from standard FE discretizations. Numerical results are provided to confirm the theoretical analysis and to validate the proposed method. ",
    "url": "https://arxiv.org/abs/2112.10544",
    "authors": [
      "Chupeng Ma",
      "Christian Alber",
      "Robert Scheichl"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2112.10574",
    "title": "Hybrid Bayesian network discovery with latent variables by scoring  multiple interventions",
    "abstract": "In Bayesian Networks (BNs), the direction of edges is crucial for causal reasoning and inference. However, Markov equivalence class considerations mean it is not always possible to establish edge orientations, which is why many BN structure learning algorithms cannot orientate all edges from purely observational data. Moreover, latent confounders can lead to false positive edges. Relatively few methods have been proposed to address these issues. In this work, we present the hybrid mFGS-BS (majority rule and Fast Greedy equivalence Search with Bayesian Scoring) algorithm for structure learning from discrete data that involves an observational data set and one or more interventional data sets. The algorithm assumes causal insufficiency in the presence of latent variables and produces a Partial Ancestral Graph (PAG). Structure learning relies on a hybrid approach and a novel Bayesian scoring paradigm that calculates the posterior probability of each directed edge being added to the learnt graph. Experimental results based on well-known networks of up to 109 variables and 10k sample size show that mFGS-BS improves structure learning accuracy relative to the state-of-the-art and it is computationally efficient. ",
    "url": "https://arxiv.org/abs/2112.10574",
    "authors": [
      "Kiattikun Chobtham",
      "Anthony C. Constantinou",
      "Neville K. Kitson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.10609",
    "title": "An ensemble deep learning technique for detecting suicidal ideation from  posts in social media platforms",
    "abstract": "Suicidal ideation detection from social media is an evolving research with great challenges. Many of the people who have the tendency to suicide share their thoughts and opinions through social media platforms. As part of many researches it is observed that the publicly available posts from social media contain valuable criteria to effectively detect individuals with suicidal thoughts. The most difficult part to prevent suicide is to detect and understand the complex risk factors and warning signs that may lead to suicide. This can be achieved by identifying the sudden changes in a user behavior automatically. Natural language processing techniques can be used to collect behavioral and textual features from social media interactions and these features can be passed to a specially designed framework to detect anomalies in human interactions that are indicators of suicidal intentions. We can achieve fast detection of suicidal ideation using deep learning and/or machine learning based classification approaches. For such a purpose, we can employ the combination of LSTM and CNN models to detect such emotions from posts of the users. In order to improve the accuracy, some approaches like using more data for training, using attention model to improve the efficiency of existing models etc. could be done. This paper proposes a LSTM-Attention-CNN combined model to analyze social media submissions to detect any underlying suicidal intentions. During evaluations, the proposed model demonstrated an accuracy of 90.3 percent and an F1-score of 92.6 percent, which is greater than the baseline models. ",
    "url": "https://arxiv.org/abs/2112.10609",
    "authors": [
      "Shini Renjith",
      "Annie Abraham",
      "Surya B.Jyothi",
      "Lekshmi Chandran",
      "Jincy Thomson"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2112.10624",
    "title": "Learning to integrate vision data into road network data",
    "abstract": "Road networks are the core infrastructure for connected and autonomous vehicles, but creating meaningful representations for machine learning applications is a challenging task. In this work, we propose to integrate remote sensing vision data into road network data for improved embeddings with graph neural networks. We present a segmentation of road edges based on spatio-temporal road and traffic characteristics, which allows to enrich the attribute set of road networks with visual features of satellite imagery and digital surface models. We show that both, the segmentation and the integration of vision data can increase performance on a road type classification task, and we achieve state-of-the-art performance on the OSM+DiDi Chuxing dataset on Chengdu, China. ",
    "url": "https://arxiv.org/abs/2112.10624",
    "authors": [
      "Oliver Stromann",
      "Alireza Razavi",
      "Michael Felsberg"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.10663",
    "title": "Bayesian neural network priors for edge-preserving inversion",
    "abstract": "We consider Bayesian inverse problems wherein the unknown state is assumed to be a function with discontinuous structure a priori. A class of prior distributions based on the output of neural networks with heavy-tailed weights is introduced, motivated by existing results concerning the infinite-width limit of such networks. We show theoretically that samples from such priors have desirable discontinuous-like properties even when the network width is finite, making them appropriate for edge-preserving inversion. Numerically we consider deconvolution problems defined on one- and two-dimensional spatial domains to illustrate the effectiveness of these priors; MAP estimation, dimension-robust MCMC sampling and ensemble-based approximations are utilized to probe the posterior distribution. The accuracy of point estimates is shown to exceed those obtained from non-heavy tailed priors, and uncertainty estimates are shown to provide more useful qualitative information. ",
    "url": "https://arxiv.org/abs/2112.10663",
    "authors": [
      "Chen Li",
      "Matthew Dunlop",
      "Georg Stadler"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2112.09914",
    "title": "Distributed design of deterministic discrete-time privacy preserving  average consensus for multi-agent systems through network augmentation",
    "abstract": "Average consensus protocols emerge with a central role in distributed systems and decision-making such as distributed information fusion, distributed optimization, distributed estimation, and control. A key advantage of these protocols is that agents exchange and reveal their state information only to their neighbors. Yet, it can raise privacy concerns in situations where the agents' states contain sensitive information. In this paper, we propose a novel (noiseless) privacy preserving distributed algorithms for multi-agent systems to reach an average consensus. The main idea of the algorithms is that each agent runs a (small) network with a crafted structure and dynamics to form a network of networks (i.e., the connection between the newly created networks and their interconnections respecting the initial network connections). Together with a re-weighting of the dynamic parameters dictating the inter-agent dynamics and the initial states, we show that it is possible to ensure that the value of each node converges to the consensus value of the original network. Furthermore, we show that, under mild assumptions, it is possible to craft the dynamics such that the design can be achieved in a distributed fashion. Finally, we illustrate the proposed algorithm with examples. ",
    "url": "https://arxiv.org/abs/2112.09914",
    "authors": [
      "Guilherme Ramos",
      "A. Pedro Aguiar",
      "Soummya Kar",
      "Sérgio Pequito"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Cryptography and Security (cs.CR)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2112.10245",
    "title": "On the Erdős-Purdy problem and the Zarankiewitz problem for  semialgebraic graphs",
    "abstract": "Erd\\H{o}s and Purdy, and later Agarwal and Sharir, conjectured that any set of $n$ points in $\\mathbb R^{d}$ determine at most $Cn^{d/2}$ congruent $k$-simplices for even $d$. We obtain the first significant progress towards this conjecture, showing that this number is at most $C n^{3d/4}$ for $k<d$. As a consequence, we obtain an upper bound of $C n^{3d/4+2}$ for the number of similar $k$-simplices determined by $n$ points in $\\mathbb R^d$, which improves the results of Agarwal, Apfelbaum, Purdy and Sharir. This problem is motivated by the problem of exact pattern matching. We also address Zarankiewicz-type questions of finding the maximum number of edges in semi-algebraic graphs with no $K_{u,u}$. Here, we improve the previous result of Fox, Pach, Sheffer, Suk, and Zahl, and Do for $d\\le 4$, as well as for any $d$ and moderately large $u$. We get an improvement of their results for any $d$ and $u$ for unit-distance graphs, which was one of the main applications of their results. From a more general prospective, our results are proved using classical cutting techniques. In the recent years, we saw a great development of the polynomial partitioning method in incidence geometry that followed the breakthrough result by Guth and Katz. One consequence of that development is that the attention of the researchers in incidence geometry swayed in polynomial techniques. In this paper, we argue that there is a number of open problems where classical techniques work better. ",
    "url": "https://arxiv.org/abs/2112.10245",
    "authors": [
      "Nora Frankl",
      "Andrey Kupavskii"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2112.10524",
    "title": "Cascading behavior of an extended Watts model on networks",
    "abstract": "In this study, we propose an extended Watts model to examine the effect of initiators on information cascades. The extended Watts model assumes that nodes with connections to initiators have low adoption thresholds than other nodes, due to the significant influence of initiators. We develop a tree approximation to describe the active node fraction for the extended Watts model in random networks and derive the cascade condition for a global cascade to occur with a small fraction of initiators. By analyzing the active node fraction and the cascade window of the extended Watts model on the Erdos-Renyi random graph, we find that increasing the influence of initiators facilitates the possibility of global cascades, i.e., how many nodes eventually become active is significantly affected by the fraction of initiators and the threshold of nodes directly connected to initiators, which determine cascade dynamics at early stages. ",
    "url": "https://arxiv.org/abs/2112.10524",
    "authors": [
      "Shinji Nishioka",
      "Takehisa Hasegawa"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2112.10552",
    "title": "Relational hyperevent models for polyadic interaction networks",
    "abstract": "Polyadic (one-to-many) social interaction happens when one sender addresses multiple receivers simultaneously. Currently available relational event models (REM) are not well suited to the analysis of polyadic interaction networks because they specify event rates for sets of receivers as functions of dyadic covariates associated with the sender and one receiver at a time. Relational hyperevent models (RHEM) alleviate this problem by specifying event rates as functions of hyperedge covariates associated with the sender and the entire set of receivers. In this article we demonstrate the potential benefits of RHEMs for the analysis of polyadic social interaction. We define and implement practically relevant effects that are not available for REMs but may be incorporated in empirical specifications of RHEM. In a reanalysis of the canonical Enron email data, we illustrate how RHEMs effectively (i) reveal evidence of polyadic dependencies in empirical data, (ii) improve the fit over comparable dyadic specifications of REMs, and (iii) better identify the set of recipients actually receiving the same email message from sets of potential recipients who could have received the same email message, but did not. ",
    "url": "https://arxiv.org/abs/2112.10552",
    "authors": [
      "Jürgen Lerner",
      "Alessandro Lomi"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:1910.06358",
    "title": "Asymmetric Shapley values: incorporating causal knowledge into  model-agnostic explainability",
    "abstract": " Comments: To appear in NeurIPS 2020; 9 pages, 2 figures, 2 appendices ",
    "url": "https://arxiv.org/abs/1910.06358",
    "authors": [
      "Christopher Frye",
      "Colin Rowat",
      "Ilya Feige"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2007.00959",
    "title": "A deep primal-dual proximal network for image restoration",
    "abstract": " Title: A deep primal-dual proximal network for image restoration ",
    "url": "https://arxiv.org/abs/2007.00959",
    "authors": [
      "Mingyuan Jiu",
      "Nelly Pustelnik"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2008.10749",
    "title": "Breaking the Communities: Characterizing community changing users using  text mining and graph machine learning on Twitter",
    "abstract": " Title: Breaking the Communities: Characterizing community changing users using  text mining and graph machine learning on Twitter ",
    "url": "https://arxiv.org/abs/2008.10749",
    "authors": [
      "Federico Albanese",
      "Leandro Lombardi",
      "Esteban Feuerstein",
      "Pablo Balenzuela"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2011.09960",
    "title": "Mathematical comparison of classical and quantum mechanisms in  optimization under local differential privacy",
    "abstract": " Comments: 26 pages ",
    "url": "https://arxiv.org/abs/2011.09960",
    "authors": [
      "Yuuya Yoshida"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2105.08351",
    "title": "Solving the electronic Schrödinger equation for multiple nuclear  geometries with weight-sharing deep neural networks",
    "abstract": " Title: Solving the electronic Schrödinger equation for multiple nuclear  geometries with weight-sharing deep neural networks ",
    "url": "https://arxiv.org/abs/2105.08351",
    "authors": [
      "Michael Scherbela",
      "Rafael Reisenhofer",
      "Leon Gerard",
      "Philipp Marquetand",
      "Philipp Grohs"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Machine Learning (cs.LG)",
      "Chemical Physics (physics.chem-ph)"
    ]
  },
  {
    "id": "arXiv:2107.12395",
    "title": "Constraining dark matter annihilation with cosmic ray antiprotons using  neural networks",
    "abstract": " Title: Constraining dark matter annihilation with cosmic ray antiprotons using  neural networks ",
    "url": "https://arxiv.org/abs/2107.12395",
    "authors": [
      "Felix Kahlhoefer",
      "Michael Korsmeier",
      "Michael Krämer",
      "Silvia Manconi",
      "Kathrin Nippel"
    ],
    "subjectives": [
      "High Energy Astrophysical Phenomena (astro-ph.HE)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)"
    ]
  },
  {
    "id": "arXiv:2107.14344",
    "title": "Towards robust vision by multi-task learning on monkey visual cortex",
    "abstract": " Comments: NeurIPS 2021 camera ready (final) ",
    "url": "https://arxiv.org/abs/2107.14344",
    "authors": [
      "Shahd Safarani",
      "Arne Nix",
      "Konstantin Willeke",
      "Santiago A. Cadena",
      "Kelli Restivo",
      "George Denfield",
      "Andreas S. Tolias",
      "Fabian H. Sinz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.12434",
    "title": "Emergent behavior and neural dynamics in artificial agents tracking  turbulent plumes",
    "abstract": " Title: Emergent behavior and neural dynamics in artificial agents tracking  turbulent plumes ",
    "url": "https://arxiv.org/abs/2109.12434",
    "authors": [
      "Satpreet Harcharan Singh",
      "Floris van Breugel",
      "Rajesh P. N. Rao",
      "Bingni Wen Brunton"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2110.12919",
    "title": "WOLF: A modular estimation framework for robotics based on factor graphs",
    "abstract": " Comments: 8 pages, 12 figures. v1: removed repository link. v2: add TERRINET thanks ",
    "url": "https://arxiv.org/abs/2110.12919",
    "authors": [
      "Joan Sola",
      "Joan Vallve-Navarro",
      "Joaquim Casals",
      "Jeremie Deray",
      "Mederic Fourmy",
      "Dinesh Atchuthan",
      "Juan Andrade-Cetto"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2111.00903",
    "title": "Towards a theory of quantum gravity from neural networks",
    "abstract": " Comments: 20 pages, minor corrections, accepted for publication in Entropy ",
    "url": "https://arxiv.org/abs/2111.00903",
    "authors": [
      "Vitaly Vanchurin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "General Relativity and Quantum Cosmology (gr-qc)",
      "High Energy Physics - Theory (hep-th)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2111.01275",
    "title": "Recurrent neural network models for working memory of continuous  variables: activity manifolds, connectivity patterns, and dynamic codes",
    "abstract": " Title: Recurrent neural network models for working memory of continuous  variables: activity manifolds, connectivity patterns, and dynamic codes ",
    "url": "https://arxiv.org/abs/2111.01275",
    "authors": [
      "Christopher J. Cueva",
      "Adel Ardalan",
      "Misha Tsodyks",
      "Ning Qian"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2112.05640",
    "title": "Fast and scalable neuroevolution deep learning architecture search for  multivariate anomaly detection",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2108.03585 ",
    "url": "https://arxiv.org/abs/2112.05640",
    "authors": [
      "M.Pietroń",
      "D.Żurek",
      "K.Faber"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.06994",
    "title": "Isometric Hamming embeddings of weighted graphs",
    "abstract": " Comments: 14 pages, 2 figures; fixed author affiliations ",
    "url": "https://arxiv.org/abs/2112.06994",
    "authors": [
      "Joseph Berleant",
      "Kristin Sheridan",
      "Anne Condon",
      "Virginia Vassilevska Williams",
      "Mark Bathe"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  }
]