[
  {
    "id": "arXiv:2301.08248",
    "title": "Enabling Astronaut Self-Scheduling using a Robust Advanced Modelling and  Scheduling system: an assessment during a Mars analogue mission",
    "abstract": "Human long duration exploration missions (LDEMs) raise a number of technological challenges. This paper addresses the question of the crew autonomy: as the distances increase, the communication delays and constraints tend to prevent the astronauts from being monitored and supported by a real time ground control. Eventually, future planetary missions will necessarily require a form of astronaut self-scheduling. We study the usage of a computer decision-support tool by a crew of analog astronauts, during a Mars simulation mission conducted at the Mars Desert Research Station (MDRS, Mars Society) in Utah. The proposed tool, called Romie, belongs to the new category of Robust Advanced Modelling and Scheduling (RAMS) systems. It allows the crew members (i) to visually model their scientific objectives and constraints, (ii) to compute near-optimal operational schedules while taking uncertainty into account, (iii) to monitor the execution of past and current activities, and (iv) to modify scientific objectives/constraints w.r.t. unforeseen events and opportunistic science. In this study, we empirically measure how the astronauts, who are novice planners, perform at using such a tool when self-scheduling under the realistic assumptions of a simulated Martian planetary habitat. ",
    "url": "https://arxiv.org/abs/2301.08248",
    "authors": [
      "Michael Saint-Guillain",
      "Jean Vanderdonckt",
      "Nicolas Burny",
      "Vladimir Pletser",
      "Tiago Vaquero",
      "Steve Chien",
      "Alexander Karl",
      "Jessica Marquez",
      "John Karasinski",
      "Cyril Wain",
      "Audrey Comein",
      "Ignacio S. Casla",
      "Jean Jacobs",
      "Julien Meert",
      "Cheyenne Chamart",
      "Sirga Drouet",
      "Julie Manon"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Earth and Planetary Astrophysics (astro-ph.EP)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2301.08249",
    "title": "Causal conditional hidden Markov model for multimodal traffic prediction",
    "abstract": "Multimodal traffic flow can reflect the health of the transportation system, and its prediction is crucial to urban traffic management. Recent works overemphasize spatio-temporal correlations of traffic flow, ignoring the physical concepts that lead to the generation of observations and their causal relationship. Spatio-temporal correlations are considered unstable under the influence of different conditions, and spurious correlations may exist in observations. In this paper, we analyze the physical concepts affecting the generation of multimode traffic flow from the perspective of the observation generation principle and propose a Causal Conditional Hidden Markov Model (CCHMM) to predict multimodal traffic flow. In the latent variables inference stage, a posterior network disentangles the causal representations of the concepts of interest from conditional information and observations, and a causal propagation module mines their causal relationship. In the data generation stage, a prior network samples the causal latent variables from the prior distribution and feeds them into the generator to generate multimodal traffic flow. We use a mutually supervised training method for the prior and posterior to enhance the identifiability of the model. Experiments on real-world datasets show that CCHMM can effectively disentangle causal representations of concepts of interest and identify causality, and accurately predict multimodal traffic flow. ",
    "url": "https://arxiv.org/abs/2301.08249",
    "authors": [
      "Yu Zhao",
      "Pan Deng",
      "Junting Liu",
      "Xiaofeng Jia",
      "Mulan Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08284",
    "title": "The necessity of depth for artificial neural networks to approximate  certain classes of smooth and bounded functions without the curse of  dimensionality",
    "abstract": "In this article we study high-dimensional approximation capacities of shallow and deep artificial neural networks (ANNs) with the rectified linear unit (ReLU) activation. In particular, it is a key contribution of this work to reveal that for all $a,b\\in\\mathbb{R}$ with $b-a\\geq 7$ we have that the functions $[a,b]^d\\ni x=(x_1,\\dots,x_d)\\mapsto\\prod_{i=1}^d x_i\\in\\mathbb{R}$ for $d\\in\\mathbb{N}$ as well as the functions $[a,b]^d\\ni x =(x_1,\\dots, x_d)\\mapsto\\sin(\\prod_{i=1}^d x_i) \\in \\mathbb{R} $ for $ d \\in \\mathbb{N} $ can neither be approximated without the curse of dimensionality by means of shallow ANNs nor insufficiently deep ANNs with ReLU activation but can be approximated without the curse of dimensionality by sufficiently deep ANNs with ReLU activation. We show that the product functions and the sine of the product functions are polynomially tractable approximation problems among the approximating class of deep ReLU ANNs with the number of hidden layers being allowed to grow in the dimension $ d \\in \\mathbb{N} $. We establish the above outlined statements not only for the product functions and the sine of the product functions but also for other classes of target functions, in particular, for classes of uniformly globally bounded $ C^{ \\infty } $-functions with compact support on any $[a,b]^d$ with $a\\in\\mathbb{R}$, $b\\in(a,\\infty)$. Roughly speaking, in this work we lay open that simple approximation problems such as approximating the sine or cosine of products cannot be solved in standard implementation frameworks by shallow or insufficiently deep ANNs with ReLU activation in polynomial time, but can be approximated by sufficiently deep ReLU ANNs with the number of parameters growing at most polynomially. ",
    "url": "https://arxiv.org/abs/2301.08284",
    "authors": [
      "Lukas Gonon",
      "Robin Graeber",
      "Arnulf Jentzen"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.08295",
    "title": "Polar Coded Merkle Tree: Mitigating Data Availability Attacks in  Blockchain Systems Using Informed Polar Code Design",
    "abstract": "Data availability (DA) attack is a well-known problem in certain blockchains where users accept an invalid block with unavailable portions. Previous works have used LDPC and 2-D Reed Solomon (2DRS) codes with Merkle trees to mitigate DA attacks. These codes perform well across various metrics such as DA detection probability and communication cost. However, these codes are difficult to apply to blockchains with large blocks due to large decoding complexity and coding fraud proof size (2D-RS codes), and intractable code guarantees for large code lengths (LDPC codes). In this paper, we focus on large block size applications and address the above challenges by proposing the novel Polar Coded Merkle Tree (PCMT): a Merkle tree encoded using the encoding graph of polar codes. We provide a specialized polar code design algorithm called Sampling Efficient Freezing and an algorithm to prune the polar encoding graph. We demonstrate that the PCMT built using the above techniques results in a better DA detection probability and communication cost compared to LDPC codes, has a lower coding fraud proof size compared to LDPC and 2D-RS codes, provides tractable code guarantees at large code lengths (similar to 2D-RS codes), and has comparable decoding complexity to 2D-RS and LDPC codes. ",
    "url": "https://arxiv.org/abs/2301.08295",
    "authors": [
      "Debarnab Mitra",
      "Lev Tauz",
      "Lara Dolecek"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.08353",
    "title": "AdaEnsemble: Learning Adaptively Sparse Structured Ensemble Network for  Click-Through Rate Prediction",
    "abstract": "Learning feature interactions is crucial to success for large-scale CTR prediction in recommender systems and Ads ranking. Researchers and practitioners extensively proposed various neural network architectures for searching and modeling feature interactions. However, we observe that different datasets favor different neural network architectures and feature interaction types, suggesting that different feature interaction learning methods may have their own unique advantages. Inspired by this observation, we propose AdaEnsemble: a Sparsely-Gated Mixture-of-Experts (SparseMoE) architecture that can leverage the strengths of heterogeneous feature interaction experts and adaptively learns the routing to a sparse combination of experts for each example, allowing us to build a dynamic hierarchy of the feature interactions of different types and orders. To further improve the prediction accuracy and inference efficiency, we incorporate the dynamic early exiting mechanism for feature interaction depth selection. The AdaEnsemble can adaptively choose the feature interaction depth and find the corresponding SparseMoE stacking layer to exit and compute prediction from. Therefore, our proposed architecture inherits the advantages of the exponential combinations of sparsely gated experts within SparseMoE layers and further dynamically selects the optimal feature interaction depth without executing deeper layers. We implement the proposed AdaEnsemble and evaluate its performance on real-world datasets. Extensive experiment results demonstrate the efficiency and effectiveness of AdaEnsemble over state-of-the-art models. ",
    "url": "https://arxiv.org/abs/2301.08353",
    "authors": [
      "YaChen Yan",
      "Liubo Li"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.08364",
    "title": "Exploring ordered patterns in the adjacency matrix for improving machine  learning on complex networks",
    "abstract": "The use of complex networks as a modern approach to understanding the world and its dynamics is well-established in literature. The adjacency matrix, which provides a one-to-one representation of a complex network, can also yield several metrics of the graph. However, it is not always clear that this representation is unique, as the permutation of lines and rows in the matrix can represent the same graph. To address this issue, the proposed methodology employs a sorting algorithm to rearrange the elements of the adjacency matrix of a complex graph in a specific order. The resulting sorted adjacency matrix is then used as input for feature extraction and machine learning algorithms to classify the networks. The results indicate that the proposed methodology outperforms previous literature results on synthetic and real-world data. ",
    "url": "https://arxiv.org/abs/2301.08364",
    "authors": [
      "Mariane B. Neiva",
      "Odemir M. Bruno"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2301.08391",
    "title": "Brain Model State Space Reconstruction Using an LSTM Neural Network",
    "abstract": "Objective Kalman filtering has previously been applied to track neural model states and parameters, particularly at the scale relevant to EEG. However, this approach lacks a reliable method to determine the initial filter conditions and assumes that the distribution of states remains Gaussian. This study presents an alternative, data-driven method to track the states and parameters of neural mass models (NMMs) from EEG recordings using deep learning techniques, specifically an LSTM neural network. Approach An LSTM filter was trained on simulated EEG data generated by a neural mass model using a wide range of parameters. With an appropriately customised loss function, the LSTM filter can learn the behaviour of NMMs. As a result, it can output the state vector and parameters of NMMs given observation data as the input. Main Results Test results using simulated data yielded correlations with R squared of around 0.99 and verified that the method is robust to noise and can be more accurate than a nonlinear Kalman filter when the initial conditions of the Kalman filter are not accurate. As an example of real-world application, the LSTM filter was also applied to real EEG data that included epileptic seizures, and revealed changes in connectivity strength parameters at the beginnings of seizures. Significance Tracking the state vector and parameters of mathematical brain models is of great importance in the area of brain modelling, monitoring, imaging and control. This approach has no need to specify the initial state vector and parameters, which is very difficult to do in practice because many of the variables being estimated cannot be measured directly in physiological experiments. This method may be applied using any neural mass model and, therefore, provides a general, novel, efficient approach to estimate brain model variables that are often difficult to measure. ",
    "url": "https://arxiv.org/abs/2301.08391",
    "authors": [
      "Yueyang Liu",
      "Artemio Soto-Breceda",
      "Yun Zhao",
      "Phillipa Karoly",
      "Mark J. Cook",
      "David B. Grayden",
      "Daniel Schmidt",
      "Levin Kuhlmann1"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2301.08399",
    "title": "Who Should I Engage with At What Time? A Missing Event Aware Temporal  Graph Neural Network",
    "abstract": "Temporal graph neural network has recently received significant attention due to its wide application scenarios, such as bioinformatics, knowledge graphs, and social networks. There are some temporal graph neural networks that achieve remarkable results. However, these works focus on future event prediction and are performed under the assumption that all historical events are observable. In real-world applications, events are not always observable, and estimating event time is as important as predicting future events. In this paper, we propose MTGN, a missing event-aware temporal graph neural network, which uniformly models evolving graph structure and timing of events to support predicting what will happen in the future and when it will happen.MTGN models the dynamic of both observed and missing events as two coupled temporal point processes, thereby incorporating the effects of missing events into the network. Experimental results on several real-world temporal graphs demonstrate that MTGN significantly outperforms existing methods with up to 89% and 112% more accurate time and link prediction. Code can be found on https://github.com/HIT-ICES/TNNLS-MTGN. ",
    "url": "https://arxiv.org/abs/2301.08399",
    "authors": [
      "Mingyi Liu",
      "Zhiying Tu",
      "Xiaofei Xu",
      "Zhongjie Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08401",
    "title": "On the Relationship Between Information-Theoretic Privacy Metrics And  Probabilistic Information Privacy",
    "abstract": "Information-theoretic (IT) measures based on $f$-divergences have recently gained interest as a measure of privacy leakage as they allow for trading off privacy against utility using only a single-value characterization. However, their operational interpretations in the privacy context are unclear. In this paper, we relate the notion of probabilistic information privacy (IP) to several IT privacy metrics based on $f$-divergences. We interpret probabilistic IP under both the detection and estimation frameworks and link it to differential privacy, thus allowing a precise operational interpretation of these IT privacy metrics. We show that the $\\chi^2$-divergence privacy metric is stronger than those based on total variation distance and Kullback-Leibler divergence. Therefore, we further develop a data-driven empirical risk framework based on the $\\chi^2$-divergence privacy metric and realized using deep neural networks. This framework is agnostic to the adversarial attack model. Empirical experiments demonstrate the efficacy of our approach. ",
    "url": "https://arxiv.org/abs/2301.08401",
    "authors": [
      "Chong Xiao Wang",
      "Wee Peng Tay"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2301.08406",
    "title": "Real-Time High-Resolution Pedestrian Detection in Crowded Scenes via  Parallel Edge Offloading",
    "abstract": "To identify dense and small-size pedestrians in surveillance systems, high-resolution cameras are widely deployed, where high-resolution images are captured and delivered to off-the-shelf pedestrian detection models. However, given the highly computation-intensive workload brought by the high resolution, the resource-constrained cameras fail to afford accurate inference in real time. To address that, we propose Hode, an offloaded video analytic framework that utilizes multiple edge nodes in proximity to expedite pedestrian detection with high-resolution inputs. Specifically, Hode can intelligently split high-resolution images into respective regions and then offload them to distributed edge nodes to perform pedestrian detection in parallel. A spatio-temporal flow filtering method is designed to enable context-aware region partitioning, as well as a DRL-based scheduling algorithm to allow accuracy-aware load balance among heterogeneous edge nodes. Extensive evaluation results using realistic prototypes show that Hode can achieve up to 2.01% speedup with very mild accuracy loss. ",
    "url": "https://arxiv.org/abs/2301.08406",
    "authors": [
      "Hao Wang",
      "Hao Bao",
      "Liekang Zeng",
      "Ke Luo",
      "Xu Chen"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2301.08427",
    "title": "Which Features are Learned by CodeBert: An Empirical Study of the  BERT-based Source Code Representation Learning",
    "abstract": "The Bidirectional Encoder Representations from Transformers (BERT) were proposed in the natural language process (NLP) and shows promising results. Recently researchers applied the BERT to source-code representation learning and reported some good news on several downstream tasks. However, in this paper, we illustrated that current methods cannot effectively understand the logic of source codes. The representation of source code heavily relies on the programmer-defined variable and function names. We design and implement a set of experiments to demonstrate our conjecture and provide some insights for future works. ",
    "url": "https://arxiv.org/abs/2301.08427",
    "authors": [
      "Lan Zhang",
      "Chen Cao",
      "Zhilong Wang",
      "Peng Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2301.08428",
    "title": "Defending SDN against packet injection attacks using deep learning",
    "abstract": "The (logically) centralised architecture of the software-defined networks makes them an easy target for packet injection attacks. In these attacks, the attacker injects malicious packets into the SDN network to affect the services and performance of the SDN controller and overflow the capacity of the SDN switches. Such attacks have been shown to ultimately stop the network functioning in real-time, leading to network breakdowns. There have been significant works on detecting and defending against similar DoS attacks in non-SDN networks, but detection and protection techniques for SDN against packet injection attacks are still in their infancy. Furthermore, many of the proposed solutions have been shown to be easily by-passed by simple modifications to the attacking packets or by altering the attacking profile. In this paper, we develop novel Graph Convolutional Neural Network models and algorithms for grouping network nodes/users into security classes by learning from network data. We start with two simple classes - nodes that engage in suspicious packet injection attacks and nodes that are not. From these classes, we then partition the network into separate segments with different security policies using distributed Ryu controllers in an SDN network. We show in experiments on an emulated SDN that our detection solution outperforms alternative approaches with above 99\\% detection accuracy on various types (both old and new) of injection attacks. More importantly, our mitigation solution maintains continuous functions of non-compromised nodes while isolating compromised/suspicious nodes in real-time. All code and data are publicly available for reproducibility of our results. ",
    "url": "https://arxiv.org/abs/2301.08428",
    "authors": [
      "Anh Tuan Phu",
      "Bo Li",
      "Faheem Ullah",
      "Tanvir Ul Huque",
      "Ranesh Naha",
      "Ali Babar",
      "Hung Nguyen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.08429",
    "title": "On the Uplink SINR Meta Distribution of UAV-assisted Wireless Networks",
    "abstract": "This letter studies the signal-to-interference-plus-noise (SINR) meta distribution of uplink transmission of UAV-enabled wireless networks with inversion power control. Within a framework of stochastic geometry, the Matern cluster process (MCP) is used to model the locations of users and UAVs. Conditional success probability and moments are derived to compute the exact expression and moment matching approximation of SINR meta distribution (beta approximation). Specifically, the effect of the power control compensation factor and UAV altitude are studied. Our numerical results show that UAV altitude has a higher impact on the system reliability than transmit power at low values of SINR threshold since users benefit more from establishing line-of-sight (LoS) links with UAVs. ",
    "url": "https://arxiv.org/abs/2301.08429",
    "authors": [
      "Yujie Qin",
      "Mustafa A. Kishk",
      "Mohamed-Slim Alouini"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2301.08433",
    "title": "Unsupervised Light Field Depth Estimation via Multi-view Feature  Matching with Occlusion Prediction",
    "abstract": "Depth estimation from light field (LF) images is a fundamental step for some applications. Recently, learning-based methods have achieved higher accuracy and efficiency than the traditional methods. However, it is costly to obtain sufficient depth labels for supervised training. In this paper, we propose an unsupervised framework to estimate depth from LF images. First, we design a disparity estimation network (DispNet) with a coarse-to-fine structure to predict disparity maps from different view combinations by performing multi-view feature matching to learn the correspondences more effectively. As occlusions may cause the violation of photo-consistency, we design an occlusion prediction network (OccNet) to predict the occlusion maps, which are used as the element-wise weights of photometric loss to solve the occlusion issue and assist the disparity learning. With the disparity maps estimated by multiple input combinations, we propose a disparity fusion strategy based on the estimated errors with effective occlusion handling to obtain the final disparity map. Experimental results demonstrate that our method achieves superior performance on both the dense and sparse LF images, and also has better generalization ability to the real-world LF images. ",
    "url": "https://arxiv.org/abs/2301.08433",
    "authors": [
      "Shansi Zhang",
      "Nan Meng",
      "Edmund Y. Lam"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.08451",
    "title": "Accelerating Multi-Agent Planning Using Graph Transformers with Bounded  Suboptimality",
    "abstract": "Conflict-Based Search is one of the most popular methods for multi-agent path finding. Though it is complete and optimal, it does not scale well. Recent works have been proposed to accelerate it by introducing various heuristics. However, whether these heuristics can apply to non-grid-based problem settings while maintaining their effectiveness remains an open question. In this work, we find that the answer is prone to be no. To this end, we propose a learning-based component, i.e., the Graph Transformer, as a heuristic function to accelerate the planning. The proposed method is provably complete and bounded-suboptimal with any desired factor. We conduct extensive experiments on two environments with dense graphs. Results show that the proposed Graph Transformer can be trained in problem instances with relatively few agents and generalizes well to a larger number of agents, while achieving better performance than state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2301.08451",
    "authors": [
      "Chenning Yu",
      "Qingbiao Li",
      "Sicun Gao",
      "Amanda Prorok"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.08474",
    "title": "Trade Privacy for Utility: A Learning-Based Privacy Pricing Game in  Federated Learning",
    "abstract": "To prevent implicit privacy disclosure in sharing gradients among data owners (DOs) under federated learning (FL), differential privacy (DP) and its variants have become a common practice to offer formal privacy guarantees with low overheads. However, individual DOs generally tend to inject larger DP noises for stronger privacy provisions (which entails severe degradation of model utility), while the curator (i.e., aggregation server) aims to minimize the overall effect of added random noises for satisfactory model performance. To address this conflicting goal, we propose a novel dynamic privacy pricing (DyPP) game which allows DOs to sell individual privacy (by lowering the scale of locally added DP noise) for differentiated economic compensations (offered by the curator), thereby enhancing FL model utility. Considering multi-dimensional information asymmetry among players (e.g., DO's data distribution and privacy preference, and curator's maximum affordable payment) as well as their varying private information in distinct FL tasks, it is hard to directly attain the Nash equilibrium of the mixed-strategy DyPP game. Alternatively, we devise a fast reinforcement learning algorithm with two layers to quickly learn the optimal mixed noise-saving strategy of DOs and the optimal mixed pricing strategy of the curator without prior knowledge of players' private information. Experiments on real datasets validate the feasibility and effectiveness of the proposed scheme in terms of faster convergence speed and enhanced FL model utility with lower payment costs. ",
    "url": "https://arxiv.org/abs/2301.08474",
    "authors": [
      "Yuntao Wang",
      "Zhou Su",
      "Yanghe Pan",
      "Abderrahim Benslimane",
      "Yiliang Liu",
      "Tom H. Luan",
      "Ruidong Li"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2301.08481",
    "title": "Machine Learning for Relaying Topology: Optimization of IoT Network with  Energy Harvesting",
    "abstract": "In this paper, we examine the internet of things system which is dedicated for smart cities, smart factory, and connected cars, etc. To support such systems in wide area with low power consumption, energy harvesting technology without wired charging infrastructure is one of the important issues for longevity of networks. In consideration of the fact that the position and amount of energy charged for each device might be unbalanced according to the distribution of nodes and energy sources, the problem of maximizing the minimum throughput among all nodes becomes a NP-hard challenging issue. To overcome this complexity, we propose a machine learning based relaying topology algorithm with a novel backward-pass rate assessment method to present proper learning direction and an iterative balancing time slot allocation algorithm which can utilize the node with sufficient energy as the relay. To validate the proposed scheme, we conducted simulations on the system model we established, thus confirm that the proposed scheme is stable and superior to conventional schemes. ",
    "url": "https://arxiv.org/abs/2301.08481",
    "authors": [
      "Kiseop Chung",
      "Jin-Taek Lim"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.08489",
    "title": "Performance of Joint XR and Best Effort eMBB Traffic in 5G-Advanced  Networks",
    "abstract": "In this paper, we address the joint performance of eXtended reality (XR) and best effort enhanced mobile broadband (eMBB) traffic for a 5G-Advanced system. Although XR users require stringent throughput and latency performance, operators do not lose significant additional network capacity when adding XR users to an eMBB dominated network. For instance, adding an XR service at 45 Mbps with 10 ms packet delay budget, yields close to a 45 Mbps drop in eMBB capacity. In an XR only network layer, we show how the capacity in number of supported XR users depends significantly on the rate but also the latency budget. We show also how the XR service capacity is significantly reduced in the mixed service setting as the system goes into full load and other-cell interference becomes significant. The presented results can be used by cellular service providers to assess their networks performance of XR traffic based on their current eMBB performance, or as input to dimensioning to be able to serve certain XR traffic loads. ",
    "url": "https://arxiv.org/abs/2301.08489",
    "authors": [
      "Pouria Paymard",
      "Abolfazl Amiri",
      "Troels E. Kolding",
      "Klaus I. Pedersen"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.08490",
    "title": "causalgraph: A Python Package for Modeling, Persisting and Visualizing  Causal Graphs Embedded in Knowledge Graphs",
    "abstract": "This paper describes a novel Python package, named causalgraph, for modeling and saving causal graphs embedded in knowledge graphs. The package has been designed to provide an interface between causal disciplines such as causal discovery and causal inference. With this package, users can create and save causal graphs and export the generated graphs for use in other graph-based packages. The main advantage of the proposed package is its ability to facilitate the linking of additional information and metadata to causal structures. In addition, the package offers a variety of functions for graph modeling and plotting, such as editing, adding, and deleting nodes and edges. It is also compatible with widely used graph data science libraries such as NetworkX and Tigramite and incorporates a specially developed causalgraph ontology in the background. This paper provides an overview of the package's main features, functionality, and usage examples, enabling the reader to use the package effectively in practice. ",
    "url": "https://arxiv.org/abs/2301.08490",
    "authors": [
      "Sven Pieper",
      "Carl Willy Mehling",
      "Dominik Hirsch",
      "Tobias Lüke",
      "Steffen Ihlenfeldt"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.08491",
    "title": "Modeling Moral Choices in Social Dilemmas with Multi-Agent Reinforcement  Learning",
    "abstract": "Practical uses of Artificial Intelligence (AI) in the real world have demonstrated the importance of embedding moral choices into intelligent agents. They have also highlighted that defining top-down ethical constraints on AI according to any one type of morality is extremely challenging and can pose risks. A bottom-up learning approach may be more appropriate for studying and developing ethical behavior in AI agents. In particular, we believe that an interesting and insightful starting point is the analysis of emergent behavior of Reinforcement Learning (RL) agents that act according to a predefined set of moral rewards in social dilemmas. In this work, we present a systematic analysis of the choices made by intrinsically-motivated RL agents whose rewards are based on moral theories. We aim to design reward structures that are simplified yet representative of a set of key ethical systems. Therefore, we first define moral reward functions that distinguish between consequence- and norm-based agents, between morality based on societal norms or internal virtues, and between single- and mixed-virtue (e.g., multi-objective) methodologies. Then, we evaluate our approach by modeling repeated dyadic interactions between learning moral agents in three iterated social dilemma games (Prisoner's Dilemma, Volunteer's Dilemma and Stag Hunt). We analyze the impact of different types of morality on the emergence of cooperation, defection or exploitation, and the corresponding social outcomes. Finally, we discuss the implications of these findings for the development of moral agents in artificial and mixed human-AI societies. ",
    "url": "https://arxiv.org/abs/2301.08491",
    "authors": [
      "Elizaveta Tennant",
      "Stephen Hailes",
      "Mirco Musolesi"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08496",
    "title": "Introducing Expertise Logic into Graph Representation Learning from A  Causal Perspective",
    "abstract": "Benefiting from the injection of human prior knowledge, graphs, as derived discrete data, are semantically dense so that models can efficiently learn the semantic information from such data. Accordingly, graph neural networks (GNNs) indeed achieve impressive success in various fields. Revisiting the GNN learning paradigms, we discover that the relationship between human expertise and the knowledge modeled by GNNs still confuses researchers. To this end, we introduce motivating experiments and derive an empirical observation that the human expertise is gradually learned by the GNNs in general domains. By further observing the ramifications of introducing expertise logic into graph representation learning, we conclude that leading the GNNs to learn human expertise can improve the model performance. By exploring the intrinsic mechanism behind such observations, we elaborate the Structural Causal Model for the graph representation learning paradigm. Following the theoretical guidance, we innovatively introduce the auxiliary causal logic learning paradigm to improve the model to learn the expertise logic causally related to the graph representation learning task. In practice, the counterfactual technique is further performed to tackle the insufficient training issue during optimization. Plentiful experiments on the crafted and real-world domains support the consistent effectiveness of the proposed method. ",
    "url": "https://arxiv.org/abs/2301.08496",
    "authors": [
      "Hang Gao",
      "Jiangmeng Li",
      "Wenwen Qiang",
      "Lingyu Si",
      "Xingzhe Su",
      "Fengge Wu",
      "Changwen Zheng",
      "Fuchun Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08517",
    "title": "Cohere: Privacy Management in Large Scale Systems",
    "abstract": "The need for a privacy management layer in today's systems started to manifest with the emergence of new systems for privacy-preserving analytics and privacy compliance. As a result, we began to see many independent efforts emerge that try to provide system support for privacy. Recently, the scope of privacy solutions used in systems has expanded to encompass more complex techniques such as Differential Privacy (DP). The use of these solutions in large-scale systems imposes new challenges and requirements. Careful planning and coordination are necessary to ensure that privacy guarantees are maintained across a wide range of heterogeneous applications and data systems. This requires new solutions for managing shared application state and allocating scarce and non-replenishable privacy resources. In this paper, we introduce Cohere, a new data management system that simplifies the use of DP in large-scale systems. Cohere implements a unified interface that allows heterogeneous applications to operate on a unified view of users' data. Cohere further extends existing accounting systems with the ability to manage and optimally allocate shared privacy resources, i.e., budget, under complex preferences. We show that Cohere can effectively enable advanced privacy solutions in existing large-scale systems with minimal modifications to existing data management systems and with moderate overhead. ",
    "url": "https://arxiv.org/abs/2301.08517",
    "authors": [
      "Nicolas Küchler",
      "Emanuel Opel",
      "Hidde Lycklama",
      "Alexander Viand",
      "Anwar Hithnawi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.08523",
    "title": "Side Contract Commitment Attacks on Blockchains",
    "abstract": "We identify a subtle security issue that impacts the design of smart contracts, because agents may themselves deploy smart contracts (side contracts). Typically, equilibria of games are analyzed in vitro, under the assumption that players cannot arbitrarily commit to strategies. However, equilibria thus obtained do not hold in general in vivo, when games are deployed on a blockchain. Being able to deploy side contracts changes fundamental game-theoretic assumptions by inducing a meta-game wherein agents strategize to deploy the best contracts. Not taking side contracts into account thus fails to capture an important aspect of deploying smart contracts in practice. A game that remains secure when the players can deploy side contracts is said to be side contract resilient. We demonstrate the non-triviality of side contract resilience by analyzing two smart contracts for decentralized commerce. These contracts have the same intended functionality, but we show that only one is side contract resilient. We then demonstrate a side contract attack on first-price auctions, which are the transaction mechanisms used by most major blockchains. We show that an agent may deploy a contract ensuring their transaction is included in the next block at almost zero cost while forcing most other agents to enter into a lottery for the remaining block space. This benefits all the users, but is detrimental to the miners. This might be cause for re-evaluation of the use of auctions in transaction fee mechanisms. We show that the attack works under certain conditions that hold with high probability from natural distributions. The attack also works against the transaction mechanism EIP-1559. Our work highlights an issue that is necessary to address to ensure the secure deployment of smart contracts and suggests that other contracts already deployed on major blockchains may be susceptible to these attacks. ",
    "url": "https://arxiv.org/abs/2301.08523",
    "authors": [
      "Daji Landis",
      "Nikolaj I. Schwartzbach"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.08525",
    "title": "Promises and pitfalls of deep neural networks in neuroimaging-based  psychiatric research",
    "abstract": "By promising more accurate diagnostics and individual treatment recommendations, deep neural networks and in particular convolutional neural networks have advanced to a powerful tool in medical imaging. Here, we first give an introduction into methodological key concepts and resulting methodological promises including representation and transfer learning, as well as modelling domain-specific priors. After reviewing recent applications within neuroimaging-based psychiatric research, such as the diagnosis of psychiatric diseases, delineation of disease subtypes, normative modeling, and the development of neuroimaging biomarkers, we discuss current challenges. This includes for example the difficulty of training models on small, heterogeneous and biased data sets, the lack of validity of clinical labels, algorithmic bias, and the influence of confounding variables. ",
    "url": "https://arxiv.org/abs/2301.08525",
    "authors": [
      "Fabian Eitel",
      "Marc-André Schulz",
      "Moritz Seiler",
      "Henrik Walter",
      "Kerstin Ritter"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2301.08553",
    "title": "Optimality-preserving Reduction of Chemical Reaction Networks",
    "abstract": "Across many disciplines, chemical reaction networks (CRNs) are an established population model defined as a system of coupled nonlinear ordinary differential equations. In many applications, for example, in systems biology and epidemiology, CRN parameters such as the kinetic reaction rates can be used as control inputs to steer the system toward a given target. Unfortunately, the resulting optimal control problem is nonlinear, therefore, computationally very challenging. We address this issue by introducing an optimality-preserving reduction algorithm for CRNs. The algorithm partitions the original state variables into a reduced set of macro-variables for which one can define a reduced optimal control problem from which one can exactly recover the solution of the original control problem. Notably, the reduction algorithm runs with polynomial time complexity in the size of the CRN. We use this result to reduce reachability and control problems of large-scale protein-interaction networks and vaccination models with hundreds of thousands of state variables. ",
    "url": "https://arxiv.org/abs/2301.08553",
    "authors": [
      "Kim G. Larsen",
      "Daniele Toller",
      "Mirco Tribastone",
      "Max Tschaikowski",
      "Andrea Vandin"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2301.08556",
    "title": "NeRF in the Palm of Your Hand: Corrective Augmentation for Robotics via  Novel-View Synthesis",
    "abstract": "Expert demonstrations are a rich source of supervision for training visual robotic manipulation policies, but imitation learning methods often require either a large number of demonstrations or expensive online expert supervision to learn reactive closed-loop behaviors. In this work, we introduce SPARTN (Synthetic Perturbations for Augmenting Robot Trajectories via NeRF): a fully-offline data augmentation scheme for improving robot policies that use eye-in-hand cameras. Our approach leverages neural radiance fields (NeRFs) to synthetically inject corrective noise into visual demonstrations, using NeRFs to generate perturbed viewpoints while simultaneously calculating the corrective actions. This requires no additional expert supervision or environment interaction, and distills the geometric information in NeRFs into a real-time reactive RGB-only policy. In a simulated 6-DoF visual grasping benchmark, SPARTN improves success rates by 2.8$\\times$ over imitation learning without the corrective augmentations and even outperforms some methods that use online supervision. It additionally closes the gap between RGB-only and RGB-D success rates, eliminating the previous need for depth sensors. In real-world 6-DoF robotic grasping experiments from limited human demonstrations, our method improves absolute success rates by $22.5\\%$ on average, including objects that are traditionally challenging for depth-based methods. See video results at \\url{https://bland.website/spartn}. ",
    "url": "https://arxiv.org/abs/2301.08556",
    "authors": [
      "Allan Zhou",
      "Moo Jin Kim",
      "Lirui Wang",
      "Pete Florence",
      "Chelsea Finn"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.08564",
    "title": "An NDN-Enabled Fog Radio Access Network Architecture With Distributed  In-Network Caching",
    "abstract": "To meet the increasing demands of next-generation cellular networks (e.g., 6G), advanced networking technologies must be incorporated. On one hand, the Fog Radio Access Network (F-RAN), has been proposed as an enhancement to the Cloud Radio Access Network (C-RAN). On the other hand, efficient network architectures, such as Named Data Networking (NDN), have been recognized as prominent Future Internet candidates. Nevertheless, the interplay between F-RAN and NDN warrants further investigation. In this paper, we propose an NDN-enabled F-RAN architecture featuring a strategy for distributed in-network caching. Through a simulation study, we demonstrate the superiority of the proposed in-network caching strategy in comparison with baseline caching strategies in terms of network resource utilization, cache hits, and fronthaul channel usage. ",
    "url": "https://arxiv.org/abs/2301.08564",
    "authors": [
      "Sifat Ut Taki",
      "Spyridon Mastorakis"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2301.08568",
    "title": "Physics-guided neural networks for feedforward control with  input-to-state stability guarantees",
    "abstract": "Currently, there is an increasing interest in merging physics-based methods and artificial intelligence to push performance of feedforward controllers for high-precision mechatronics beyond what is achievable with linear feedforward control. In this paper, we develop a systematic design procedure for feedforward control using physics-guided neural networks (PGNNs) that can handle nonlinear and unknown dynamics. PGNNs effectively merge physics-based and NN-based models, and thereby result in nonlinear feedforward controllers with higher performance and the same reliability as classical, linear feedforward controllers. In particular, conditions are presented to validate (after training) and impose (before training) input-to-state stability (ISS) of PGNN feedforward controllers. The developed PGNN feedforward control framework is validated on a real-life, high-precision industrial linear motor used in lithography machines, where it reaches a factor 2 improvement with respect to conventional mass-friction feedforward. ",
    "url": "https://arxiv.org/abs/2301.08568",
    "authors": [
      "Max Bolderman",
      "Hans Butler",
      "Sjirk Koekebakker",
      "Eelco van Horssen",
      "Ramidin Kamidi",
      "Theresa Spaan-Burke",
      "Nard Strijbosch",
      "Mircea Lazar"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2301.08577",
    "title": "Ontology Pre-training for Poison Prediction",
    "abstract": "Integrating human knowledge into neural networks has the potential to improve their robustness and interpretability. We have developed a novel approach to integrate knowledge from ontologies into the structure of a Transformer network which we call ontology pre-training: we train the network to predict membership in ontology classes as a way to embed the structure of the ontology into the network, and subsequently fine-tune the network for the particular prediction task. We apply this approach to a case study in predicting the potential toxicity of a small molecule based on its molecular structure, a challenging task for machine learning in life sciences chemistry. Our approach improves on the state of the art, and moreover has several additional benefits. First, we are able to show that the model learns to focus attention on more meaningful chemical groups when making predictions with ontology pre-training than without, paving a path towards greater robustness and interpretability. Second, the training time is reduced after ontology pre-training, indicating that the model is better placed to learn what matters for toxicity prediction with the ontology pre-training than without. This strategy has general applicability as a neuro-symbolic approach to embed meaningful semantics into neural networks. ",
    "url": "https://arxiv.org/abs/2301.08577",
    "authors": [
      "Martin Glauer",
      "Fabian Neuhaus",
      "Till Mossakowski",
      "Janna Hastings"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2301.08590",
    "title": "Improving Sketch Colorization using Adversarial Segmentation Consistency",
    "abstract": "We propose a new method for producing color images from sketches. Current solutions in sketch colorization either necessitate additional user instruction or are restricted to the \"paired\" translation strategy. We leverage semantic image segmentation from a general-purpose panoptic segmentation network to generate an additional adversarial loss function. The proposed loss function is compatible with any GAN model. Our method is not restricted to datasets with segmentation labels and can be applied to unpaired translation tasks as well. Using qualitative, and quantitative analysis, and based on a user study, we demonstrate the efficacy of our method on four distinct image datasets. On the FID metric, our model improves the baseline by up to 35 points. Our code, pretrained models, scripts to produce newly introduced datasets and corresponding sketch images are available at https://github.com/giddyyupp/AdvSegLoss. ",
    "url": "https://arxiv.org/abs/2301.08590",
    "authors": [
      "Samet Hicsonmez",
      "Nermin Samet",
      "Emre Akbas",
      "Pinar Duygulu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.08606",
    "title": "Data Augmentation for Modeling Human Personality: The Dexter Machine",
    "abstract": "Modeling human personality is important for several AI challenges, from the engineering of artificial psychotherapists to the design of persona bots. However, the field of computational personality analysis heavily relies on labeled data, which may be expensive, difficult or impossible to get. This problem is amplified when dealing with rare personality types or disorders (e.g., the anti-social psychopathic personality disorder). In this context, we developed a text-based data augmentation approach for human personality (PEDANT). PEDANT doesn't rely on the common type of labeled data but on the generative pre-trained model (GPT) combined with domain expertise. Testing the methodology on three different datasets, provides results that support the quality of the generated data. ",
    "url": "https://arxiv.org/abs/2301.08606",
    "authors": [
      "Yair Neuman",
      "Vladyslav Kozhukhov",
      "Dan Vilenchik"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.08608",
    "title": "On the Foundations of Cycles in Bayesian Networks",
    "abstract": "Bayesian networks (BNs) are a probabilistic graphical model widely used for representing expert knowledge and reasoning under uncertainty. Traditionally, they are based on directed acyclic graphs that capture dependencies between random variables. However, directed cycles can naturally arise when cross-dependencies between random variables exist, e.g., for modeling feedback loops. Existing methods to deal with such cross-dependencies usually rely on reductions to BNs without cycles. These approaches are fragile to generalize, since their justifications are intermingled with additional knowledge about the application context. In this paper, we present a foundational study regarding semantics for cyclic BNs that are generic and conservatively extend the cycle-free setting. First, we propose constraint-based semantics that specify requirements for full joint distributions over a BN to be consistent with the local conditional probabilities and independencies. Second, two kinds of limit semantics that formalize infinite unfolding approaches are introduced and shown to be computable by a Markov chain construction. ",
    "url": "https://arxiv.org/abs/2301.08608",
    "authors": [
      "Christel Baier",
      "Clemens Dubslaff",
      "Holger Hermanns",
      "Nikolai Käfer"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.08618",
    "title": "Coupled Physics-informed Neural Networks for Inferring Solutions of  Partial Differential Equations with Unknown Source Terms",
    "abstract": "Physics-informed neural networks (PINNs) provide a transformative development for approximating the solutions to partial differential equations (PDEs). This work proposes a coupled physics-informed neural network (C-PINN) for the nonhomogeneous PDEs with unknown dynamical source terms, which is used to describe the systems with external forces and cannot be well approximated by the existing PINNs. In our method, two neural networks, NetU and NetG, are proposed. NetU is constructed to generate a quasi-solution satisfying PDEs under study. NetG is used to regularize the training of NetU. Then, the two networks are integrated into a data-physics-hybrid cost function. Finally, we propose a hierarchical training strategy to optimize and couple the two networks. The performance of C-PINN is proved by approximating several classical PDEs. ",
    "url": "https://arxiv.org/abs/2301.08618",
    "authors": [
      "Aina Wang",
      "Pan Qin",
      "Xi-Ming Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2301.08647",
    "title": "Image Memorability Prediction with Vision Transformers",
    "abstract": "Behavioral studies have shown that the memorability of images is similar across groups of people, suggesting that memorability is a function of the intrinsic properties of images, and is unrelated to people's individual experiences and traits. Deep learning networks can be trained on such properties and be used to predict memorability in new data sets. Convolutional neural networks (CNN) have pioneered image memorability prediction, but more recently developed vision transformer (ViT) models may have the potential to yield even better predictions. In this paper, we present the ViTMem, a new memorability model based on ViT, and evaluate memorability predictions obtained by it with state-of-the-art CNN-derived models. Results showed that ViTMem performed equal to or better than state-of-the-art models on all data sets. Additional semantic level analyses revealed that ViTMem is particularly sensitive to the semantic content that drives memorability in images. We conclude that ViTMem provides a new step forward, and propose that ViT-derived models can replace CNNs for computational prediction of image memorability. Researchers, educators, advertisers, visual designers and other interested parties can leverage the model to improve the memorability of their image material. ",
    "url": "https://arxiv.org/abs/2301.08647",
    "authors": [
      "Thomas Hagen",
      "Thomas Espeseth"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.08693",
    "title": "Self-supervised learning for a nonlinear inverse problem with forward  operator involving an unknown function arising in Photoacoustic Tomography",
    "abstract": "In this article, we concern with a nonlinear inverse problem with forward operator involving an unknown function. The problem arises in diverse applications and is challenging by the presence of the unknown function, which makes it ill-posed. Additionally, the nonlinear nature of the problem makes it difficult to use traditional methods and thus the study has addressed a simplified version of the problem by either linearizing it or assuming knowledge of the unknown function. Here, we propose a self-supervised learning to directly tackle a nonlinear inverse problem involving an unknown function. In particular, we focus on an inverse problem derived in Photoacoustic Tomograpy (PAT) which is a hybrid medical imaging with high resolution and contrast. PAT can be modelled based on the wave equation. The measured data is the solution of the equation restricted to the surface and the initial pressure of the equation contains the biological information on the object of interest. The speed of sound wave in the equation is unknown. Our goal is to determine the initial pressure and the speed of sound wave simultaneously. Under a simple assumption that the sound speed is a function of the initial pressure, the problem becomes a nonlinear inverse problem involving an unknown function. The experimental results demonstrate that the proposed algorithm performs successfully. ",
    "url": "https://arxiv.org/abs/2301.08693",
    "authors": [
      "Gyeongha Hwang",
      "Gihyeon Jeon",
      "Sunghwan Moon"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2301.08695",
    "title": "Baechi: Fast Device Placement of Machine Learning Graphs",
    "abstract": "Machine Learning graphs (or models) can be challenging or impossible to train when either devices have limited memory, or models are large. To split the model across devices, learning-based approaches are still popular. While these result in model placements that train fast on data (i.e., low step times), learning-based model-parallelism is time-consuming, taking many hours or days to create a placement plan of operators on devices. We present the Baechi system, the first to adopt an algorithmic approach to the placement problem for running machine learning training graphs on small clusters of memory-constrained devices. We integrate our implementation of Baechi into two popular open-source learning frameworks: TensorFlow and PyTorch. Our experimental results using GPUs show that: (i) Baechi generates placement plans 654 X - 206K X faster than state-of-the-art learning-based approaches, and (ii) Baechi-placed model's step (training) time is comparable to expert placements in PyTorch, and only up to 6.2% worse than expert placements in TensorFlow. We prove mathematically that our two algorithms are within a constant factor of the optimal. Our work shows that compared to learning-based approaches, algorithmic approaches can face different challenges for adaptation to Machine learning systems, but also they offer proven bounds, and significant performance benefits. ",
    "url": "https://arxiv.org/abs/2301.08695",
    "authors": [
      "Beomyeol Jeon",
      "Linda Cai",
      "Chirag Shetty",
      "Pallavi Srivastava",
      "Jintao Jiang",
      "Xiaolan Ke",
      "Yitao Meng",
      "Cong Xie",
      "Indranil Gupta"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08727",
    "title": "Neural Architecture Search: Insights from 1000 Papers",
    "abstract": "In the past decade, advances in deep learning have resulted in breakthroughs in a variety of areas, including computer vision, natural language understanding, speech recognition, and reinforcement learning. Specialized, high-performing neural architectures are crucial to the success of deep learning in these areas. Neural architecture search (NAS), the process of automating the design of neural architectures for a given task, is an inevitable next step in automating machine learning and has already outpaced the best human-designed architectures on many tasks. In the past few years, research in NAS has been progressing rapidly, with over 1000 papers released since 2020. In this survey, we provide an organized and comprehensive guide to neural architecture search. We give a taxonomy of search spaces, algorithms, and speedup techniques, and we discuss resources such as benchmarks, best practices, other surveys, and open-source libraries. ",
    "url": "https://arxiv.org/abs/2301.08727",
    "authors": [
      "Colin White",
      "Mahmoud Safari",
      "Rhea Sukthanker",
      "Binxin Ru",
      "Thomas Elsken",
      "Arber Zela",
      "Debadeepta Dey",
      "Frank Hutter"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.08290",
    "title": "Forecasting subcritical cylinder wakes with Fourier Neural Operators",
    "abstract": "We apply Fourier neural operators (FNOs), a state-of-the-art operator learning technique, to forecast the temporal evolution of experimentally measured velocity fields. FNOs are a recently developed machine learning method capable of approximating solution operators to systems of partial differential equations through data alone. The learned FNO solution operator can be evaluated in milliseconds, potentially enabling faster-than-real-time modeling for predictive flow control in physical systems. Here we use FNOs to predict how physical fluid flows evolve in time, training with particle image velocimetry measurements depicting cylinder wakes in the subcritical vortex shedding regime. We train separate FNOs at Reynolds numbers ranging from Re = 240 to Re = 3060 and study how increasingly turbulent flow phenomena impact prediction accuracy. We focus here on a short prediction horizon of ten non-dimensionalized time-steps, as would be relevant for problems of predictive flow control. We find that FNOs are capable of accurately predicting the evolution of experimental velocity fields throughout the range of Reynolds numbers tested (L2 norm error < 0.1) despite being provided with limited and imperfect flow observations. Given these results, we conclude that this method holds significant potential for real-time predictive flow control of physical systems. ",
    "url": "https://arxiv.org/abs/2301.08290",
    "authors": [
      "Peter I Renn",
      "Cong Wang",
      "Sahin Lale",
      "Zongyi Li",
      "Anima Anandkumar",
      "Morteza Gharib"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08292",
    "title": "Quantum HyperNetworks: Training Binary Neural Networks in Quantum  Superposition",
    "abstract": "Binary neural networks, i.e., neural networks whose parameters and activations are constrained to only two possible values, offer a compelling avenue for the deployment of deep learning models on energy- and memory-limited devices. However, their training, architectural design, and hyperparameter tuning remain challenging as these involve multiple computationally expensive combinatorial optimization problems. Here we introduce quantum hypernetworks as a mechanism to train binary neural networks on quantum computers, which unify the search over parameters, hyperparameters, and architectures in a single optimization loop. Through classical simulations, we demonstrate that of our approach effectively finds optimal parameters, hyperparameters and architectural choices with high probability on classification problems including a two-dimensional Gaussian dataset and a scaled-down version of the MNIST handwritten digits. We represent our quantum hypernetworks as variational quantum circuits, and find that an optimal circuit depth maximizes the probability of finding performant binary neural networks. Our unified approach provides an immense scope for other applications in the field of machine learning. ",
    "url": "https://arxiv.org/abs/2301.08292",
    "authors": [
      "Juan Carrasquilla",
      "Mohamed Hibat-Allah",
      "Estelle Inack",
      "Alireza Makhzani",
      "Kirill Neklyudov",
      "Graham W. Taylor",
      "Giacomo Torlai"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08330",
    "title": "The role of noise in denoising models for anomaly detection in medical  images",
    "abstract": "Pathological brain lesions exhibit diverse appearance in brain images, in terms of intensity, texture, shape, size, and location. Comprehensive sets of data and annotations are difficult to acquire. Therefore, unsupervised anomaly detection approaches have been proposed using only normal data for training, with the aim of detecting outlier anomalous voxels at test time. Denoising methods, for instance classical denoising autoencoders (DAEs) and more recently emerging diffusion models, are a promising approach, however naive application of pixelwise noise leads to poor anomaly detection performance. We show that optimization of the spatial resolution and magnitude of the noise improves the performance of different model training regimes, with similar noise parameter adjustments giving good performance for both DAEs and diffusion models. Visual inspection of the reconstructions suggests that the training noise influences the trade-off between the extent of the detail that is reconstructed and the extent of erasure of anomalies, both of which contribute to better anomaly detection performance. We validate our findings on two real-world datasets (tumor detection in brain MRI and hemorrhage/ischemia/tumor detection in brain CT), showing good detection on diverse anomaly appearances. Overall, we find that a DAE trained with coarse noise is a fast and simple method that gives state-of-the-art accuracy. Diffusion models applied to anomaly detection are as yet in their infancy and provide a promising avenue for further research. ",
    "url": "https://arxiv.org/abs/2301.08330",
    "authors": [
      "Antanas Kascenas",
      "Pedro Sanchez",
      "Patrick Schrempf",
      "Chaoyang Wang",
      "William Clackett",
      "Shadia S. Mikhael",
      "Jeremy P. Voisey",
      "Keith Goatman",
      "Alexander Weir",
      "Nicolas Pugeault",
      "Sotirios A. Tsaftaris",
      "Alison Q. O'Neil"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.08441",
    "title": "Self-Supervised Learning for Data Scarcity in a Fatigue Damage  Prognostic Problem",
    "abstract": "With the increasing availability of data for Prognostics and Health Management (PHM), Deep Learning (DL) techniques are now the subject of considerable attention for this application, often achieving more accurate Remaining Useful Life (RUL) predictions. However, one of the major challenges for DL techniques resides in the difficulty of obtaining large amounts of labelled data on industrial systems. To overcome this lack of labelled data, an emerging learning technique is considered in our work: Self-Supervised Learning, a sub-category of unsupervised learning approaches. This paper aims to investigate whether pre-training DL models in a self-supervised way on unlabelled sensors data can be useful for RUL estimation with only Few-Shots Learning, i.e. with scarce labelled data. In this research, a fatigue damage prognostics problem is addressed, through the estimation of the RUL of aluminum alloy panels (typical of aerospace structures) subject to fatigue cracks from strain gauge data. Synthetic datasets composed of strain data are used allowing to extensively investigate the influence of the dataset size on the predictive performance. Results show that the self-supervised pre-trained models are able to significantly outperform the non-pre-trained models in downstream RUL prediction task, and with less computational expense, showing promising results in prognostic tasks when only limited labelled data is available. ",
    "url": "https://arxiv.org/abs/2301.08441",
    "authors": [
      "Anass Akrim",
      "Christian Gogu",
      "Rob Vingerhoeds",
      "Michel Salaün"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08479",
    "title": "Pneumonia Detection in Chest X-Ray Images : Handling Class Imbalance",
    "abstract": "People all over the globe are affected by pneumonia but deaths due to it are highest in Sub-Saharan Asia and South Asia. In recent years, the overall incidence and mortality rate of pneumonia regardless of the utilization of effective vaccines and compelling antibiotics has escalated. Thus, pneumonia remains a disease that needs spry prevention and treatment. The widespread prevalence of pneumonia has caused the research community to come up with a framework that helps detect, diagnose and analyze diseases accurately and promptly. One of the major hurdles faced by the Artificial Intelligence (AI) research community is the lack of publicly available datasets for chest diseases, including pneumonia . Secondly, few of the available datasets are highly imbalanced (normal examples are over sampled, while samples with ailment are in severe minority) making the problem even more challenging. In this article we present a novel framework for the detection of pneumonia. The novelty of the proposed methodology lies in the tackling of class imbalance problem. The Generative Adversarial Network (GAN), specifically a combination of Deep Convolutional Generative Adversarial Network (DCGAN) and Wasserstein GAN gradient penalty (WGAN-GP) was applied on the minority class ``Pneumonia'' for augmentation, whereas Random Under-Sampling (RUS) was done on the majority class ``No Findings'' to deal with the imbalance problem. The ChestX-Ray8 dataset, one of the biggest datasets, is used to validate the performance of the proposed framework. The learning phase is completed using transfer learning on state-of-the-art deep learning models i.e. ResNet-50, Xception, and VGG-16. Results obtained exceed state-of-the-art. ",
    "url": "https://arxiv.org/abs/2301.08479",
    "authors": [
      "Wardah Ali",
      "Eesha Qureshi",
      "Omama Ahmed Farooqi",
      "Rizwan Ahmed Khan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08499",
    "title": "A triangle process on graphs with given degree sequence",
    "abstract": "The triangle switch Markov chain is designed to generate random graphs with given degree sequence, but having more triangles than would appear under the uniform distribution. Transition probabilities of the chain depends on a parameter, called the activity, which is used to assign higher stationary probability to graphs with more triangles. In previous work we proved ergodicity of the triangle switch chain for regular graphs. Here we prove ergodicity for all sequences with minimum degree at least 3, and show rapid mixing of the chain when the activity and the maximum degree are not too large. As far as we are aware, this is the first rigorous analysis of a Markov chain algorithm for generating graphs from a a known non-uniform distribution. ",
    "url": "https://arxiv.org/abs/2301.08499",
    "authors": [
      "Colin Cooper",
      "Martin Dyer",
      "Catherine Greenhill"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2301.08530",
    "title": "Self-Organization Towards $1/f$ Noise in Deep Neural Networks",
    "abstract": "Despite $1/f$ noise being ubiquitous in both natural and artificial systems, no general explanations for the phenomenon have received widespread acceptance. One well-known system where $1/f$ noise has been observed in is the human brain, with this 'noise' proposed by some to be important to the healthy function of the brain. As deep neural networks (DNNs) are loosely modelled after the human brain, and as they start to achieve human-level performance in specific tasks, it might be worth investigating if the same $1/f$ noise is present in these artificial networks as well. Indeed, we find the existence of $1/f$ noise in DNNs - specifically Long Short-Term Memory (LSTM) networks modelled on real world dataset - by measuring the Power Spectral Density (PSD) of different activations within the network in response to a sequential input of natural language. This was done in analogy to the measurement of $1/f$ noise in human brains with techniques such as electroencephalography (EEG) and functional Magnetic Resonance Imaging (fMRI). We further examine the exponent values in the $1/f$ noise in \"inner\" and \"outer\" activations in the LSTM cell, finding some resemblance in the variations of the exponents in the fMRI signal. In addition, comparing the values of the exponent at \"rest\" compared to when performing \"tasks\" of the LSTM network, we find a similar trend to that of the human brain where the exponent while performing tasks is less negative. ",
    "url": "https://arxiv.org/abs/2301.08530",
    "authors": [
      "Nicholas Chong Jia Le",
      "Ling Feng"
    ],
    "subjectives": [
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Artificial Intelligence (cs.AI)",
      "Adaptation and Self-Organizing Systems (nlin.AO)"
    ]
  },
  {
    "id": "arXiv:2301.08707",
    "title": "Separating the edges of a graph by a linear number of paths",
    "abstract": "Recently, Letzter proved that any graph of order $n$ contains a collection $\\mathcal{P}$ of $O(n\\log^\\star n)$ paths with the following property: for all distinct edges $e$ and $f$ there exists a path in $\\mathcal{P}$ which contains $e$ but not $f$. We improve this upper bound to $19 n$, thus answering a question of Katona and confirming a conjecture independently posed by Balogh, Csaba, Martin, and Pluh\\'ar and by Falgas-Ravry, Kittipassorn, Kor\\'andi, Letzter, and Narayanan. Our proof is elementary and self-contained. ",
    "url": "https://arxiv.org/abs/2301.08707",
    "authors": [
      "Marthe Bonamy",
      "Fábio Botler",
      "François Dross",
      "Tássio Naia",
      "Jozef Skokan"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:1910.05534",
    "title": "Spectral embedding of weighted graphs",
    "abstract": " Comments: 27 pages, 5 figures ",
    "url": "https://arxiv.org/abs/1910.05534",
    "authors": [
      "Ian Gallagher",
      "Andrew Jones",
      "Anna Bertiger",
      "Carey Priebe",
      "Patrick Rubin-Delanchy"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2007.12140",
    "title": "HITNet: Hierarchical Iterative Tile Refinement Network for Real-time  Stereo Matching",
    "abstract": " Comments: The pretrained models used for submission to benchmarks and sample evaluation scripts can be found at this https URL ",
    "url": "https://arxiv.org/abs/2007.12140",
    "authors": [
      "Vladimir Tankovich",
      "Christian Häne",
      "Yinda Zhang",
      "Adarsh Kowdle",
      "Sean Fanello",
      "Sofien Bouaziz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2009.01742",
    "title": "Online Estimation of Network Point Processes for Event Streams",
    "abstract": " Comments: 45 pages ",
    "url": "https://arxiv.org/abs/2009.01742",
    "authors": [
      "Guanhua Fang",
      "Owen G. Ward",
      "Tian Zheng"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2011.00136",
    "title": "Improving Dialogue Breakdown Detection with Semi-Supervised Learning",
    "abstract": " Comments: 6 pages, 1 figure, accepted at the NeurIPS Workshop on Human in the Loop Dialogue Systems ",
    "url": "https://arxiv.org/abs/2011.00136",
    "authors": [
      "Nathan Ng",
      "Marzyeh Ghassemi",
      "Narendran Thangarajan",
      "Jiacheng Pan",
      "Qi Guo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.02972",
    "title": "Weisfeiler--Leman and Graph Spectra",
    "abstract": " Title: Weisfeiler--Leman and Graph Spectra ",
    "url": "https://arxiv.org/abs/2103.02972",
    "authors": [
      "Gaurav Rattan",
      "Tim Seppelt"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2110.13361",
    "title": "A Metalearning Approach for Physics-Informed Neural Networks (PINNs):  Application to Parameterized PDEs",
    "abstract": " Title: A Metalearning Approach for Physics-Informed Neural Networks (PINNs):  Application to Parameterized PDEs ",
    "url": "https://arxiv.org/abs/2110.13361",
    "authors": [
      "Michael Penwarden",
      "Shandian Zhe",
      "Akil Narayan",
      "Robert M. Kirby"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.07793",
    "title": "Analysis of Data Augmentation Methods for Low-Resource Maltese ASR",
    "abstract": " Comments: 12 pages ",
    "url": "https://arxiv.org/abs/2111.07793",
    "authors": [
      "Andrea DeMarco",
      "Carlos Mena",
      "Albert Gatt",
      "Claudia Borg",
      "Aiden Williams",
      "Lonneke van der Plas"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2111.10095",
    "title": "An Index for Single Source All Destinations Distance Queries in Temporal  Graphs",
    "abstract": " Title: An Index for Single Source All Destinations Distance Queries in Temporal  Graphs ",
    "url": "https://arxiv.org/abs/2111.10095",
    "authors": [
      "Lutz Oettershagen",
      "Petra Mutzel"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2111.15319",
    "title": "A framework to measure the robustness of programs in the unpredictable  environment",
    "abstract": " Title: A framework to measure the robustness of programs in the unpredictable  environment ",
    "url": "https://arxiv.org/abs/2111.15319",
    "authors": [
      "Valentina Castiglioni",
      "Michele Loreti",
      "Simone Tini"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2201.09169",
    "title": "Rich Action-semantic Consistent Knowledge for Early Action Prediction",
    "abstract": " Comments: 12 pages ",
    "url": "https://arxiv.org/abs/2201.09169",
    "authors": [
      "Xiaoli Liu",
      "Jianqin Yin",
      "Di Guo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.07568",
    "title": "StratDef: Strategic Defense Against Adversarial Attacks in ML-based  Malware Detection",
    "abstract": " Title: StratDef: Strategic Defense Against Adversarial Attacks in ML-based  Malware Detection ",
    "url": "https://arxiv.org/abs/2202.07568",
    "authors": [
      "Aqib Rashid",
      "Jose Such"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2202.12119",
    "title": "Optimal Convergence Rates of Deep Convolutional Neural Networks:  Additive Ridge Functions",
    "abstract": " Title: Optimal Convergence Rates of Deep Convolutional Neural Networks:  Additive Ridge Functions ",
    "url": "https://arxiv.org/abs/2202.12119",
    "authors": [
      "Zhiying Fang",
      "Guang Cheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2203.01581",
    "title": "A shallow physics-informed neural network for solving partial  differential equations on surfaces",
    "abstract": " Title: A shallow physics-informed neural network for solving partial  differential equations on surfaces ",
    "url": "https://arxiv.org/abs/2203.01581",
    "authors": [
      "Wei-Fan Hu",
      "Yi-Jun Shih",
      "Te-Sheng Lin",
      "Ming-Chih Lai"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.03805",
    "title": "Discrete Robust Control of Robot Manipulators using an Uncertainty and  Disturbance Estimator",
    "abstract": " Comments: 20 pages, 7 figures, 1 table ",
    "url": "https://arxiv.org/abs/2203.03805",
    "authors": [
      "Ram Padmanabhan",
      "Maithili Shetty",
      "T. S. Chandar"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.03994",
    "title": "LaF: Labeling-Free Model Selection for Automated Deep Neural Network  Reusing",
    "abstract": " Comments: 22 pages ",
    "url": "https://arxiv.org/abs/2204.03994",
    "authors": [
      "Qiang Hu",
      "Yuejun Guo",
      "Maxime Cordy",
      "Xiaofei Xie",
      "Mike Papadakis",
      "Yves Le Traon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.07821",
    "title": "Detection of Small Holes by the Scale-Invariant Robust Density-Aware  Distance (RDAD) Filtration",
    "abstract": " Comments: 39 pages, 38 figures, GitHub repo: this https URL; changes: more theorems, more discussion on conformal approaches, more succinct discussion on numerical examples ",
    "url": "https://arxiv.org/abs/2204.07821",
    "authors": [
      "Chunyin Siu",
      "Gennady Samorodnitsky",
      "Christina Lee Yu",
      "Andrey Yao"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Computational Geometry (cs.CG)",
      "Algebraic Topology (math.AT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.14030",
    "title": "Neural Implicit Representations for Physical Parameter Inference from a  Single Video",
    "abstract": " Comments: Published in IEEE/CVF Winter Conference on Applications of Computer Vision (WACV) 2023 ",
    "url": "https://arxiv.org/abs/2204.14030",
    "authors": [
      "Florian Hofherr",
      "Lukas Koestler",
      "Florian Bernard",
      "Daniel Cremers"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.13268",
    "title": "MemeTector: Enforcing deep focus for meme detection",
    "abstract": " Title: MemeTector: Enforcing deep focus for meme detection ",
    "url": "https://arxiv.org/abs/2205.13268",
    "authors": [
      "Christos Koutlis",
      "Manos Schinas",
      "Symeon Papadopoulos"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.08401",
    "title": "Is decentralized finance actually decentralized? A social network  analysis of the Aave protocol on the Ethereum blockchain",
    "abstract": " Comments: Accepted at 29th Annual Global Finance Conference featuring Professor Robert Engle, The 2003 Nobel Laureate in Economic Sciences ",
    "url": "https://arxiv.org/abs/2206.08401",
    "authors": [
      "Ziqiao Ao",
      "Gergely Horvath",
      "Luyao Zhang"
    ],
    "subjectives": [
      "General Economics (econ.GN)",
      "Cryptography and Security (cs.CR)",
      "Statistical Finance (q-fin.ST)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:2207.03997",
    "title": "A Tutorial on Event Detection using Social Media Data Analysis:  Applications, Challenges, and Open Problems",
    "abstract": " Title: A Tutorial on Event Detection using Social Media Data Analysis:  Applications, Challenges, and Open Problems ",
    "url": "https://arxiv.org/abs/2207.03997",
    "authors": [
      "Mohammadsepehr Karimiziarani"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2207.13398",
    "title": "Emergent social NPC interactions in the Social NPCs Skyrim mod and  beyond",
    "abstract": " Comments: Originally a chapter for Game AI Pro, contains 14 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2207.13398",
    "authors": [
      "Manuel Guimarães",
      "Pedro A. Santos",
      "Arnav Jhala"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2208.02194",
    "title": "Interpretable bilinear attention network with domain adaptation improves  drug-target prediction",
    "abstract": " Comments: 19 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2208.02194",
    "authors": [
      "Peizhen Bai",
      "Filip Miljković",
      "Bino John",
      "Haiping Lu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2208.04955",
    "title": "Explainable prediction of Qcodes for NOTAMs using column generation",
    "abstract": " Title: Explainable prediction of Qcodes for NOTAMs using column generation ",
    "url": "https://arxiv.org/abs/2208.04955",
    "authors": [
      "Krunal Kishor Patel",
      "Guy Desaulniers",
      "Andrea Lodi",
      "Freddy Lecue"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2208.05834",
    "title": "Joint reconstruction-segmentation on graphs",
    "abstract": " Comments: 33 pages, 20 figures ",
    "url": "https://arxiv.org/abs/2208.05834",
    "authors": [
      "Jeremy Budd",
      "Yves van Gennip",
      "Jonas Latz",
      "Simone Parisotto",
      "Carola-Bibiane Schönlieb"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.08133",
    "title": "Metric Residual Networks for Sample Efficient Goal-Conditioned  Reinforcement Learning",
    "abstract": " Comments: Goal-conditioned reinforcement learning, neural architecture design ",
    "url": "https://arxiv.org/abs/2208.08133",
    "authors": [
      "Bo Liu",
      "Yihao Feng",
      "Qiang Liu",
      "Peter Stone"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2208.08655",
    "title": "Generating Synthetic Clinical Data that Capture Class Imbalanced  Distributions with Generative Adversarial Networks: Example using  Antiretroviral Therapy for HIV",
    "abstract": " Comments: In the near future, we will make our codes and synthetic datasets publicly available to facilitate future research. Follow us on this https URL ",
    "url": "https://arxiv.org/abs/2208.08655",
    "authors": [
      "Nicholas I-Hsien Kuo",
      "Federico Garcia",
      "Anders Sönnerborg",
      "Maurizio Zazzi",
      "Michael Böhm",
      "Rolf Kaiser",
      "Mark Polizzotto",
      "Louisa Jorm",
      "Sebastiano Barbieri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.09011",
    "title": "Verifiable Differential Privacy",
    "abstract": " Title: Verifiable Differential Privacy ",
    "url": "https://arxiv.org/abs/2208.09011",
    "authors": [
      "Ari Biswas",
      "Graham Cormode"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2208.09344",
    "title": "Positive dependence in qualitative probabilistic networks",
    "abstract": " Comments: 10 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2208.09344",
    "authors": [
      "Jack Storror Carter"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Statistics Theory (math.ST)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2208.09538",
    "title": "Predicting the Masses of Exotic Hadrons with Data Augmentation Using  Multilayer Perceptron",
    "abstract": " Comments: 8 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2208.09538",
    "authors": [
      "Huseyin Bahtiyar"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Lattice (hep-lat)"
    ]
  },
  {
    "id": "arXiv:2209.08162",
    "title": "Uncertainty Quantification of Collaborative Detection for Self-Driving",
    "abstract": " Comments: This paper has been accepted by the 2023 IEEE International Conference on Robotics and Automation (ICRA 2023) ",
    "url": "https://arxiv.org/abs/2209.08162",
    "authors": [
      "Sanbao Su",
      "Yiming Li",
      "Sihong He",
      "Songyang Han",
      "Chen Feng",
      "Caiwen Ding",
      "Fei Miao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.15773",
    "title": "Data-Driven Thermal Anomaly Detection in Large Battery Packs",
    "abstract": " Title: Data-Driven Thermal Anomaly Detection in Large Battery Packs ",
    "url": "https://arxiv.org/abs/2210.15773",
    "authors": [
      "Kiran Bhaskar",
      "Ajith Kumar",
      "James Bunce",
      "Jacob Pressman",
      "Neil Burkell",
      "Christopher D. Rahn"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2211.08327",
    "title": "Weighted Sum-Rate Maximization With Causal Inference for Latent  Interference Estimation",
    "abstract": " Comments: 7 pages ",
    "url": "https://arxiv.org/abs/2211.08327",
    "authors": [
      "Lei You"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2211.10247",
    "title": "GoSum: Extractive Summarization of Long Documents by Reinforcement  Learning and Graph Organized discourse state",
    "abstract": " Title: GoSum: Extractive Summarization of Long Documents by Reinforcement  Learning and Graph Organized discourse state ",
    "url": "https://arxiv.org/abs/2211.10247",
    "authors": [
      "Junyi Bian",
      "Xiaodi Huang",
      "Hong Zhou",
      "Shanfeng Zhu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2211.14523",
    "title": "VR-GNN: Variational Relation Vector Graph Neural Network for Modeling  both Homophily and Heterophily",
    "abstract": " Title: VR-GNN: Variational Relation Vector Graph Neural Network for Modeling  both Homophily and Heterophily ",
    "url": "https://arxiv.org/abs/2211.14523",
    "authors": [
      "Fengzhao Shi",
      "Ren Li",
      "Yanan Cao",
      "Yanmin Shang",
      "Lanxue Zhang",
      "Chuan Zhou",
      "Jia Wu",
      "Shirui Pan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2212.01282",
    "title": "CHAPTER: Exploiting Convolutional Neural Network Adapters for  Self-supervised Speech Models",
    "abstract": " Comments: Submitted to ICASSP 2023. Under review ",
    "url": "https://arxiv.org/abs/2212.01282",
    "authors": [
      "Zih-Ching Chen",
      "Yu-Shun Sung",
      "Hung-yi Lee"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2212.05357",
    "title": "On Blockchain We Cooperate: An Evolutionary Game Perspective",
    "abstract": " Title: On Blockchain We Cooperate: An Evolutionary Game Perspective ",
    "url": "https://arxiv.org/abs/2212.05357",
    "authors": [
      "Luyao Zhang",
      "Xinyu Tian"
    ],
    "subjectives": [
      "General Economics (econ.GN)",
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2212.11614",
    "title": "Hybrid Quantum-Classical Generative Adversarial Network for High  Resolution Image Generation",
    "abstract": " Title: Hybrid Quantum-Classical Generative Adversarial Network for High  Resolution Image Generation ",
    "url": "https://arxiv.org/abs/2212.11614",
    "authors": [
      "Shu Lok Tsang",
      "Maxwell T. West",
      "Sarah M. Erfani",
      "Muhammad Usman"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14784",
    "title": "Neural Volumetric Blendshapes: Computationally Efficient Physics-Based  Facial Blendshapes",
    "abstract": " Title: Neural Volumetric Blendshapes: Computationally Efficient Physics-Based  Facial Blendshapes ",
    "url": "https://arxiv.org/abs/2212.14784",
    "authors": [
      "Nicolas Wagner",
      "Ulrich Schwanecke",
      "Mario Botsch"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2301.00986",
    "title": "Look, Listen, and Attack: Backdoor Attacks Against Video Action  Recognition",
    "abstract": " Title: Look, Listen, and Attack: Backdoor Attacks Against Video Action  Recognition ",
    "url": "https://arxiv.org/abs/2301.00986",
    "authors": [
      "Hasan Abed Al Kader Hammoud",
      "Shuming Liu",
      "Mohammed Alkhrashi",
      "Fahad AlBalawi",
      "Bernard Ghanem"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.06957",
    "title": "FewSOME: Few Shot Anomaly Detection",
    "abstract": " Title: FewSOME: Few Shot Anomaly Detection ",
    "url": "https://arxiv.org/abs/2301.06957",
    "authors": [
      "Niamh Belton",
      "Misgina Tsighe Hagos",
      "Aonghus Lawlor",
      "Kathleen M. Curran"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08173",
    "title": "Time-Warping Invariant Quantum Recurrent Neural Networks via  Quantum-Classical Adaptive Gating",
    "abstract": " Comments: Submitted for publication ",
    "url": "https://arxiv.org/abs/2301.08173",
    "authors": [
      "Ivana Nikoloska",
      "Osvaldo Simeone",
      "Leonardo Banchi",
      "Petar Veličković"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  }
]