[
  {
    "id": "arXiv:2110.04402",
    "title": "Walking into the complex plane to 'order' better time integrators",
    "abstract": "Most numerical methods for time integration use real time steps. Complex time steps provide an additional degree of freedom, as we can select the magnitude of the step in both the real and imaginary directions. By time stepping along specific paths in the complex plane, integrators can gain higher orders of accuracy or achieve expanded stability regions. Complex time stepping also allows us to break the Runge-Kutta order barrier, enabling 5th order accuracy using only five function evaluations. We show how to derive these paths for explicit and implicit methods, discuss computational costs and storage benefits, and demonstrate clear advantages for complex-valued systems like the Schrodinger equation. ",
    "url": "https://arxiv.org/abs/2110.04402",
    "authors": [
      "Jithin D. George",
      "Samuel Y. Jung",
      "Niall M. Mangan"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Complex Variables (math.CV)"
    ]
  },
  {
    "id": "arXiv:2110.04414",
    "title": "Gated recurrent units and temporal convolutional network for multilabel  classification",
    "abstract": "Multilabel learning tackles the problem of associating a sample with multiple class labels. This work proposes a new ensemble method for managing multilabel classification: the core of the proposed approach combines a set of gated recurrent units and temporal convolutional neural networks trained with variants of the Adam optimization approach. Multiple Adam variants, including novel one proposed here, are compared and tested; these variants are based on the difference between present and past gradients, with step size adjusted for each parameter. The proposed neural network approach is also combined with Incorporating Multiple Clustering Centers (IMCC), which further boosts classification performance. Multiple experiments on nine data sets representing a wide variety of multilabel tasks demonstrate the robustness of our best ensemble, which is shown to outperform the state-of-the-art. The MATLAB code for generating the best ensembles in the experimental section will be available at https://github.com/LorisNanni. ",
    "url": "https://arxiv.org/abs/2110.04414",
    "authors": [
      "Loris Nanni",
      "Alessandra Lumini",
      "Alessandro Manfe",
      "Sheryl Brahnam",
      "Giorgio Venturin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2110.04421",
    "title": "DeepABM: Scalable, efficient and differentiable agent-based simulations  via graph neural networks",
    "abstract": "We introduce DeepABM, a framework for agent-based modeling that leverages geometric message passing of graph neural networks for simulating action and interactions over large agent populations. Using DeepABM allows scaling simulations to large agent populations in real-time and running them efficiently on GPU architectures. To demonstrate the effectiveness of DeepABM, we build DeepABM-COVID simulator to provide support for various non-pharmaceutical interventions (quarantine, exposure notification, vaccination, testing) for the COVID-19 pandemic, and can scale to populations of representative size in real-time on a GPU. Specifically, DeepABM-COVID can model 200 million interactions (over 100,000 agents across 180 time-steps) in 90 seconds, and is made available online to help researchers with modeling and analysis of various interventions. We explain various components of the framework and discuss results from one research study to evaluate the impact of delaying the second dose of the COVID-19 vaccine in collaboration with clinical and public health experts. While we simulate COVID-19 spread, the ideas introduced in the paper are generic and can be easily extend to other forms of agent-based simulations. Furthermore, while beyond scope of this document, DeepABM enables inverse agent-based simulations which can be used to learn physical parameters in the (micro) simulations using gradient-based optimization with large-scale real-world (macro) data. We are optimistic that the current work can have interesting implications for bringing ABM and AI communities closer. ",
    "url": "https://arxiv.org/abs/2110.04421",
    "authors": [
      "Ayush Chopra",
      "Esma Gel",
      "Jayakumar Subramanian",
      "Balaji Krishnamurthy",
      "Santiago Romero-Brufau",
      "Kalyan S. Pasupathy",
      "Thomas C. Kingsley",
      "Ramesh Raskar"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.04451",
    "title": "Using multiple reference audios and style embedding constraints for  speech synthesis",
    "abstract": "The end-to-end speech synthesis model can directly take an utterance as reference audio, and generate speech from the text with prosody and speaker characteristics similar to the reference audio. However, an appropriate acoustic embedding must be manually selected during inference. Due to the fact that only the matched text and speech are used in the training process, using unmatched text and speech for inference would cause the model to synthesize speech with low content quality. In this study, we propose to mitigate these two problems by using multiple reference audios and style embedding constraints rather than using only the target audio. Multiple reference audios are automatically selected using the sentence similarity determined by Bidirectional Encoder Representations from Transformers (BERT). In addition, we use ''target'' style embedding from a Pre-trained encoder as a constraint by considering the mutual information between the predicted and ''target'' style embedding. The experimental results show that the proposed model can improve the speech naturalness and content quality with multiple reference audios and can also outperform the baseline model in ABX preference tests of style similarity. ",
    "url": "https://arxiv.org/abs/2110.04451",
    "authors": [
      "Cheng Gong",
      "Longbiao Wang",
      "Zhenhua Ling",
      "Ju Zhang",
      "Jianwu Dang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2110.04483",
    "title": "Visualizing the embedding space to explain the effect of knowledge  distillation",
    "abstract": "Recent research has found that knowledge distillation can be effective in reducing the size of a network and in increasing generalization. A pre-trained, large teacher network, for example, was shown to be able to bootstrap a student model that eventually outperforms the teacher in a limited label environment. Despite these advances, it still is relatively unclear \\emph{why} this method works, that is, what the resulting student model does 'better'. To address this issue, here, we utilize two non-linear, low-dimensional embedding methods (t-SNE and IVIS) to visualize representation spaces of different layers in a network. We perform a set of extensive experiments with different architecture parameters and distillation methods. The resulting visualizations and metrics clearly show that distillation guides the network to find a more compact representation space for higher accuracy already in earlier layers compared to its non-distilled version. ",
    "url": "https://arxiv.org/abs/2110.04483",
    "authors": [
      "Hyun Seung Lee",
      "Christian Wallraven"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.04487",
    "title": "Colour augmentation for improved semi-supervised semantic segmentation",
    "abstract": "Consistency regularization describes a class of approaches that have yielded state-of-the-art results for semi-supervised classification. While semi-supervised semantic segmentation proved to be more challenging, a number of successful approaches have been recently proposed. Recent work explored the challenges involved in using consistency regularization for segmentation problems. In their self-supervised work Chen et al. found that colour augmentation prevents a classification network from using image colour statistics as a short-cut for self-supervised learning via instance discrimination. Drawing inspiration from this we find that a similar problem impedes semi-supervised semantic segmentation and offer colour augmentation as a solution, improving semi-supervised semantic segmentation performance on challenging photographic imagery. ",
    "url": "https://arxiv.org/abs/2110.04487",
    "authors": [
      "Geoff French",
      "Michal Mackiewicz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.04606",
    "title": "Linear-time algorithm for vertex 2-coloring without monochromatic  triangles on planar graphs",
    "abstract": "In the problem of 2-coloring without monochromatic triangles (or triangle-tree 2-coloring), vertices of the simple, connected, undirected graph are colored with either 'black' or 'white' such that there are no 3 mutually adjacent vertices of the same color. In this paper we are positively answering the question posed in our previous work, namely, if there exists an algorithm solving 2-coloring without monochromatic triangles on planar graphs with linear-time complexity. ",
    "url": "https://arxiv.org/abs/2110.04606",
    "authors": [
      "Michał Karpiński",
      "Krzysztof Piecuch"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2110.04656",
    "title": "Streaming on-device detection of device directed speech from voice and  touch-based invocation",
    "abstract": "When interacting with smart devices such as mobile phones or wearables, the user typically invokes a virtual assistant (VA) by saying a keyword or by pressing a button on the device. However, in many cases, the VA can accidentally be invoked by the keyword-like speech or accidental button press, which may have implications on user experience and privacy. To this end, we propose an acoustic false-trigger-mitigation (FTM) approach for on-device device-directed speech detection that simultaneously handles the voice-trigger and touch-based invocation. To facilitate the model deployment on-device, we introduce a new streaming decision layer, derived using the notion of temporal convolutional networks (TCN) [1], known for their computational efficiency. To the best of our knowledge, this is the first approach that can detect device-directed speech from more than one invocation type in a streaming fashion. We compare this approach with streaming alternatives based on vanilla Average layer, and canonical LSTMs, and show: (i) that all the models show only a small degradation in accuracy compared with the invocation-specific models, and (ii) that the newly introduced streaming TCN consistently performs better or comparable with the alternatives, while mitigating device undirected speech faster in time, and with (relative) reduction in runtime peak-memory over the LSTM-based approach of 33% vs. 7%, when compared to a non-streaming counterpart. ",
    "url": "https://arxiv.org/abs/2110.04656",
    "authors": [
      "Ognjen Rudovic",
      "Akanksha Bindal",
      "Vineet Garg",
      "Pramod Simha",
      "Pranay Dighe",
      "Sachin Kajarekar"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2110.04777",
    "title": "On snapshot-based model reduction under compatibility conditions for a  nonlinear flow problem on networks",
    "abstract": "This paper is on the construction of structure-preserving, online-efficient reduced models for the barotropic Euler equations with a friction term on networks. The nonlinear flow problem finds broad application in the context of gas distribution networks. We propose a snapshot-based reduction approach that consists of a mixed variational Galerkin approximation combined with quadrature-type complexity reduction. Its main feature is that certain compatibility conditions are assured during the training phase, which make our approach structure-preserving. The resulting reduced models are locally mass conservative and inherit an energy-bound and port-Hamiltonian structure. We also derive a well-posedness result for them. In the training phase, the compatibility conditions pose challenges, we face constrained data approximation problems as opposed to the unconstrained training problems in the conventional reduction methods. The training of our model order reduction consists of a principal component analysis under a compatibility constraint and, notably, yields reduced models that fulfill an optimality condition for the snapshot data. The training of our quadrature-type complexity reduction involves a semi-definite program with combinatorial aspects, which we approach by a greedy procedure. ",
    "url": "https://arxiv.org/abs/2110.04777",
    "authors": [
      "Björn Liljegren-Sailer",
      "Nicole Marheineke"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2110.04923",
    "title": "Crack detection using tap-testing and machine learning techniques to  prevent potential rockfall incidents",
    "abstract": "Rockfalls are a hazard for the safety of infrastructure as well as people. Identifying loose rocks by inspection of slopes adjacent to roadways and other infrastructure and removing them in advance can be an effective way to prevent unexpected rockfall incidents. This paper proposes a system towards an automated inspection for potential rockfalls. A robot is used to repeatedly strike or tap on the rock surface. The sound from the tapping is collected by the robot and subsequently classified with the intent of identifying rocks that are broken and prone to fall. Principal Component Analysis (PCA) of the collected acoustic data is used to recognize patterns associated with rocks of various conditions, including intact as well as rock with different types and locations of cracks. The PCA classification was first demonstrated simulating sounds of different characteristics that were automatically trained and tested. Secondly, a laboratory test was conducted tapping rock specimens with three different levels of discontinuity in depth and shape. A real microphone mounted on the robot recorded the sound and the data were classified in three clusters within 2D space. A model was created using the training data to classify the reminder of the data (the test data). The performance of the method is evaluated with a confusion matrix. ",
    "url": "https://arxiv.org/abs/2110.04923",
    "authors": [
      "Roya Nasimi",
      "Fernando Moreu",
      "John Stormont"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2110.05020",
    "title": "MELONS: generating melody with long-term structure using transformers  and structure graph",
    "abstract": "The creation of long melody sequences requires effective expression of coherent musical structure. However, there is no clear representation of musical structure. Recent works on music generation have suggested various approaches to deal with the structural information of music, but generating a full-song melody with clear long-term structure remains a challenge. In this paper, we propose MELONS, a melody generation framework based on a graph representation of music structure which consists of eight types of bar-level relations. MELONS adopts a multi-step generation method with transformer-based networks by factoring melody generation into two sub-problems: structure generation and structure conditional melody generation. Experimental results show that MELONS can produce structured melodies with high quality and rich contents. ",
    "url": "https://arxiv.org/abs/2110.05020",
    "authors": [
      "Yi Zou",
      "Pei Zou",
      "Yi Zhao",
      "Kaixiang Zhang",
      "Ran Zhang",
      "Xiaorui Wang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2110.05240",
    "title": "Evaluating generative networks using Gaussian mixtures of image features",
    "abstract": "We develop a measure for evaluating the performance of generative networks given two sets of images. A popular performance measure currently used to do this is the Fr\\'echet Inception Distance (FID). However, FID assumes that images featurized using the penultimate layer of Inception-v3 follow a Gaussian distribution. This assumption allows FID to be easily computed, since FID uses the 2-Wasserstein distance of two Gaussian distributions fitted to the featurized images. However, we show that Inception-v3 features of the ImageNet dataset are not Gaussian; in particular, each marginal is not Gaussian. To remedy this problem, we model the featurized images using Gaussian mixture models (GMMs) and compute the 2-Wasserstein distance restricted to GMMs. We define a performance measure, which we call WaM, on two sets of images by using Inception-v3 (or another classifier) to featurize the images, estimate two GMMs, and use the restricted 2-Wasserstein distance to compare the GMMs. We experimentally show the advantages of WaM over FID, including how FID is more sensitive than WaM to image perturbations. By modelling the non-Gaussian features obtained from Inception-v3 as GMMs and using a GMM metric, we can more accurately evaluate generative network performance. ",
    "url": "https://arxiv.org/abs/2110.05240",
    "authors": [
      "Lorenzo Luzi",
      "Carlos Ortiz Marrero",
      "Nile Wynar",
      "Richard G. Baraniuk",
      "Michael J. Henry"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.05330",
    "title": "Edge-wise funnel output synchronization of heterogeneous agents with  relative degree one",
    "abstract": "In a recent work by three of the authors, in order to enforce synchronization for scalar heterogeneous multi-agent systems with some useful characteristics, a node-wise funnel coupling law was proposed. The emergent dynamics, to which each of the agents synchronizes, was characterized and it was studied how networks can be synthesized which exhibit these emergent dynamics. The advantage of this synthesis is its suitability for plug-and-play operation. However, the aforementioned emergent dynamics under node-wise funnel coupling are determined by an algebraic equation which does not admit an explicit solution in general, and even its pointwise solution proves rather difficult. Furthermore, the contractivity assumption on the emergent dynamics, required to establish the synchronization, is hard to be checked without solving the algebraic equation. To resolve these drawbacks, in the present paper we present a new funnel coupling law that uses edge-wise output differences. Under this novel coupling the benign properties of node-wise funnel coupling are retained, but the emergent dynamics are given explicitly by the blended dynamics of the multi-agent system, which already proved an advantageous tool in the analysis and design of such networks. Additionally, our results are not restricted to scalar systems and treat the case that neighboring agents only communicate their output information, and not their complete state. ",
    "url": "https://arxiv.org/abs/2110.05330",
    "authors": [
      "Jin Gyu Lee",
      "Thomas Berger",
      "Stephan Trenn",
      "Hyungbo Shim"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2110.05424",
    "title": "Nonlocal diffusion of variable order on graphs",
    "abstract": "Some aspects of nonlocal dynamics on directed and undirected networks for an initial value problem whose Jacobian matrix is a variable-order fractional power of a Laplacian matrix are discussed here. Both directed and undirected graphs are considered. Under appropriate assumptions, the existence, uniqueness, and uniform asymptotic stability of the solutions of the underlying initial value problem are proved. Some examples giving a sample of the behavior of the dynamics are also included. ",
    "url": "https://arxiv.org/abs/2110.05424",
    "authors": [
      "Daniele Bertaccini",
      "Fabio Durastante"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2110.04391",
    "title": "Aura: Privacy-preserving augmentation to improve test set diversity in  noise suppression applications",
    "abstract": "Noise suppression models running in production environments are commonly trained on publicly available datasets. However, this approach leads to regressions in production environments due to the lack of training/testing on representative customer data. Moreover, due to privacy reasons, developers cannot listen to customer content. This `ears-off' situation motivates augmenting existing datasets in a privacy-preserving manner. In this paper, we present Aura, a solution to make existing noise suppression test sets more challenging and diverse while limiting the sampling budget. Aura is `ears-off' because it relies on a feature extractor and a metric of speech quality, DNSMOS P.835, both pre-trained on data obtained from public sources. As an application of \\aura, we augment a current benchmark test set in noise suppression by sampling audio files from a new batch of data of 20K clean speech clips from Librivox mixed with noise clips obtained from AudioSet. Aura makes the existing benchmark test set harder by 100% in DNSMOS P.835, a 26 improvement in Spearman's rank correlation coefficient (SRCC) compared to random sampling and, identifies 73% out-of-distribution samples to augment the test set. ",
    "url": "https://arxiv.org/abs/2110.04391",
    "authors": [
      "Xavier Gitiaux",
      "Aditya Khant",
      "Chandan Reddy",
      "Jayant Gupchup",
      "Ross Cutler"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Cryptography and Security (cs.CR)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2110.04410",
    "title": "TitaNet: Neural Model for speaker representation with 1D Depth-wise  separable convolutions and global context",
    "abstract": "In this paper, we propose TitaNet, a novel neural network architecture for extracting speaker representations. We employ 1D depth-wise separable convolutions with Squeeze-and-Excitation (SE) layers with global context followed by channel attention based statistics pooling layer to map variable-length utterances to a fixed-length embedding (t-vector). TitaNet is a scalable architecture and achieves state-of-the-art performance on speaker verification task with an equal error rate (EER) of 0.68% on the VoxCeleb1 trial file and also on speaker diarization tasks with diarization error rate (DER) of 1.73% on AMI-MixHeadset, 1.99% on AMI-Lapel and 1.11% on CH109. Furthermore, we investigate various sizes of TitaNet and present a light TitaNet-S model with only 6M parameters that achieve near state-of-the-art results in diarization tasks. ",
    "url": "https://arxiv.org/abs/2110.04410",
    "authors": [
      "Nithin Rao Koluguri",
      "Taejin Park",
      "Boris Ginsburg"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2110.04585",
    "title": "An evaluation of data augmentation methods for sound scene geotagging",
    "abstract": "Sound scene geotagging is a new topic of research which has evolved from acoustic scene classification. It is motivated by the idea of audio surveillance. Not content with only describing a scene in a recording, a machine which can locate where the recording was captured would be of use to many. In this paper we explore a series of common audio data augmentation methods to evaluate which best improves the accuracy of audio geotagging classifiers. Our work improves on the state-of-the-art city geotagging method by 23% in terms of classification accuracy. ",
    "url": "https://arxiv.org/abs/2110.04585",
    "authors": [
      "Helen L. Bear",
      "Veronica Morfi",
      "Emmanouil Benetos"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2110.04850",
    "title": "Direct source and early reflections localization using deep  deconvolution network under reverbrate environment",
    "abstract": "This paper proposes a deconvolution-based network (DCNN) model for DOA estimation of direct source and early reflections under reverberate scenarios. Considering that the first-order reflections of the sound source also contain spatial directivity like the direct source, we treat both of them as the sources in the learning process. We use the covariance matrix of high order Ambisonics (HOA) signals in time domain as the input feature of the network, which is concise while contains precise spatial information under reverberate scenarios. Besides, we use the deconvolution-based network for the spatial pseudo-spectrum (SPS) reconstruction in the 2D polar space, based on which the spatial relationship between elevation and azimuth can be depicted. We have carried out a series of experiments based on simulated and measured data under different reverberate scenarios, which prove the robustness and accuracy of the proposed DCNN model. ",
    "url": "https://arxiv.org/abs/2110.04850",
    "authors": [
      "Shan Gao",
      "Xihong Wu",
      "Tianshu Qu"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2110.04862",
    "title": "Re-entry prediction and demisability analysis for the atmospheric  disposal of geosynchronous satellites",
    "abstract": "The paper presents a re-entry analysis of Geosynchronous Orbit (GSO) satellites on disposal trajectories that enhance the effects of the Earth oblateness and lunisolar perturbations. These types of trajectories can lead to a natural re-entry of the spacecraft within 20 years. An analysis was performed to characterise the entry conditions for these satellites and the risk they can pose for people on the ground if disposal via re-entry is used. The paper first proposes a methodology to interface the long-term propagation used to study the evolution of the disposal trajectories and the destructive re-entry simulations used to assess the spacecraft casualty risk. This is achieved by revisiting the concept of overshoot boundary. The paper also presents the demisability and casualty risk analysis for a representative spacecraft configuration, showing that the casualty risk is greater than the 10$^{-4}$ threshold and that further actions should be taken to improve the compliance of these satellites in case of disposal via re-entry is used. ",
    "url": "https://arxiv.org/abs/2110.04862",
    "authors": [
      "Mirko Trisolini",
      "Camilla Colombo"
    ],
    "subjectives": [
      "Earth and Planetary Astrophysics (astro-ph.EP)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2110.05068",
    "title": "A weighted graph zeta function involved in the Szegedy walk",
    "abstract": "We define a new weighted zeta function for a finite graph and obtain its determinant expression. This result gives the characteristic polynomial of the transition matrix of the Szegedy walk on a graph. ",
    "url": "https://arxiv.org/abs/2110.05068",
    "authors": [
      "Ayaka Ishikawa",
      "Norio Konno"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2110.05431",
    "title": "On the invertibility of a voice privacy system using embedding  alignement",
    "abstract": "This paper explores various attack scenarios on a voice anonymization system using embeddings alignment techniques. We use Wasserstein-Procrustes (an algorithm initially designed for unsupervised translation) or Procrustes analysis to match two sets of x-vectors, before and after voice anonymization, to mimic this transformation as a rotation function. We compute the optimal rotation and compare the results of this approximation to the official Voice Privacy Challenge results. We show that a complex system like the baseline of the Voice Privacy Challenge can be approximated by a rotation, estimated using a limited set of x-vectors. This paper studies the space of solutions for voice anonymization within the specific scope of rotations. Rotations being reversible, the proposed method can recover up to 62% of the speaker identities from anonymized embeddings. ",
    "url": "https://arxiv.org/abs/2110.05431",
    "authors": [
      "Pierre Champion",
      "Thomas Thebaud",
      "Gaël Le Lan",
      "Anthony Larcher",
      "Denis Jouvet"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:1905.00531",
    "title": "Recombinator-k-means: An evolutionary algorithm that exploits k-means++  for recombination",
    "abstract": " Comments: 15 pages, 3 figures (1 in main text), 5 tables ",
    "url": "https://arxiv.org/abs/1905.00531",
    "authors": [
      "Carlo Baldassi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:1912.01398",
    "title": "TeaNet: universal neural network interatomic potential inspired by  iterative electronic relaxations",
    "abstract": " Comments: Revision: Add detailed network description ",
    "url": "https://arxiv.org/abs/1912.01398",
    "authors": [
      "So Takamoto",
      "Satoshi Izumi",
      "Ju Li"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2003.09198",
    "title": "A unified framework for spectral clustering in sparse graphs",
    "abstract": " Title: A unified framework for spectral clustering in sparse graphs ",
    "url": "https://arxiv.org/abs/2003.09198",
    "authors": [
      "Lorenzo Dall'Amico",
      "Romain Couillet",
      "Nicolas Tremblay"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.14686",
    "title": "Generalization capabilities of translationally equivariant neural  networks",
    "abstract": " Comments: 28 pages, 20 figures, v3: equivalent to the version published in PRD ",
    "url": "https://arxiv.org/abs/2103.14686",
    "authors": [
      "Srinath Bulusu",
      "Matteo Favoni",
      "Andreas Ipp",
      "David I. Müller",
      "Daniel Schuh"
    ],
    "subjectives": [
      "High Energy Physics - Lattice (hep-lat)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2104.12657",
    "title": "tsrobprep - an R package for robust preprocessing of time series data",
    "abstract": " Title: tsrobprep - an R package for robust preprocessing of time series data ",
    "url": "https://arxiv.org/abs/2104.12657",
    "authors": [
      "Michał Narajewski",
      "Jens Kley-Holsteg",
      "Florian Ziel"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Mathematical Software (cs.MS)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:2106.02927",
    "title": "A Generalized Framework for Joint Dynamic Optimal RF Interface Setting  and Next-Hop Selection in IoT networks with Same Source Requests",
    "abstract": " Title: A Generalized Framework for Joint Dynamic Optimal RF Interface Setting  and Next-Hop Selection in IoT networks with Same Source Requests ",
    "url": "https://arxiv.org/abs/2106.02927",
    "authors": [
      "Monireh Allah Gholi Ghasri",
      "Ali Mohammad Afshin Hemmatyar"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2106.09408",
    "title": "Predicting cognitive scores with graph neural networks through sample  selection learning",
    "abstract": " Comments: Extended discussions in particular of the sample selection method ",
    "url": "https://arxiv.org/abs/2106.09408",
    "authors": [
      "Martin Hanik",
      "Mehmet Arif Demirtaş",
      "Mohammed Amine Gharsallaoui",
      "Islem Rekik"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2106.10180",
    "title": "Determining when a truncated generalised Reed-Solomon code is Hermitian  self-orthogonal",
    "abstract": " Title: Determining when a truncated generalised Reed-Solomon code is Hermitian  self-orthogonal ",
    "url": "https://arxiv.org/abs/2106.10180",
    "authors": [
      "Simeon Ball",
      "Ricard Vilar"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Combinatorics (math.CO)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2107.14758",
    "title": "A scalable and robust vertex-star relaxation for high-order FEM",
    "abstract": " Title: A scalable and robust vertex-star relaxation for high-order FEM ",
    "url": "https://arxiv.org/abs/2107.14758",
    "authors": [
      "Pablo D. Brubeck",
      "Patrick E. Farrell"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2108.09795",
    "title": "On a Tverberg graph",
    "abstract": " Comments: v2: 11 pages, 3 figures. Key words: Tverberg's Theorem, perfect matching, blue-red matching, Hamiltonian cycle, alternating cycle, infinite descent, halving lines ",
    "url": "https://arxiv.org/abs/2108.09795",
    "authors": [
      "Olimjoni Pirahmad",
      "Alexandr Polyanskii",
      "Alexey Vasilevskii"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Geometry (cs.CG)",
      "Metric Geometry (math.MG)"
    ]
  },
  {
    "id": "arXiv:2109.11128",
    "title": "Peg solitaire and Conway's soldiers on infinite graphs",
    "abstract": " Comments: 12 pages, 5 figures; simplified the proof of Theorem 3.1 ",
    "url": "https://arxiv.org/abs/2109.11128",
    "authors": [
      "Valentino Vito"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2110.01096",
    "title": "Fast algorithm to identify cluster synchrony through fibration  symmetries in large information-processing networks",
    "abstract": " Comments: 13 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2110.01096",
    "authors": [
      "Higor S. Monteiro",
      "Ian Leifer",
      "Saulo D. S. Reis",
      "José S. Andrade, Jr.",
      "Hernan A. Makse"
    ],
    "subjectives": [
      "Molecular Networks (q-bio.MN)",
      "Computational Complexity (cs.CC)"
    ]
  }
]