[
  {
    "id": "arXiv:2202.04075",
    "title": "Joint-bone Fusion Graph Convolutional Network for Semi-supervised  Skeleton Action Recognition",
    "abstract": "In recent years, graph convolutional networks (GCNs) play an increasingly critical role in skeleton-based human action recognition. However, most GCN-based methods still have two main limitations: 1) They only consider the motion information of the joints or process the joints and bones separately, which are unable to fully explore the latent functional correlation between joints and bones for action recognition. 2) Most of these works are performed in the supervised learning way, which heavily relies on massive labeled training data. To address these issues, we propose a semi-supervised skeleton-based action recognition method which has been rarely exploited before. We design a novel correlation-driven joint-bone fusion graph convolutional network (CD-JBF-GCN) as an encoder and use a pose prediction head as a decoder to achieve semi-supervised learning. Specifically, the CD-JBF-GC can explore the motion transmission between the joint stream and the bone stream, so that promoting both streams to learn more discriminative feature representations. The pose prediction based auto-encoder in the self-supervised training stage allows the network to learn motion representation from unlabeled data, which is essential for action recognition. Extensive experiments on two popular datasets, i.e. NTU-RGB+D and Kinetics-Skeleton, demonstrate that our model achieves the state-of-the-art performance for semi-supervised skeleton-based action recognition and is also useful for fully-supervised methods. ",
    "url": "https://arxiv.org/abs/2202.04075",
    "authors": [
      "Zhigang Tu",
      "Jiaxu Zhang",
      "Hongyan Li",
      "Yujin Chen",
      "Junsong Yuan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.04104",
    "title": "Teaching Networks to Solve Optimization Problems",
    "abstract": "Leveraging machine learning to optimize the optimization process is an emerging field which holds the promise to bypass the fundamental computational bottleneck caused by traditional iterative solvers in critical applications requiring near-real-time optimization. The majority of existing approaches focus on learning data-driven optimizers that lead to fewer iterations in solving an optimization. In this paper, we take a different approach and propose to replace the iterative solvers altogether with a trainable parametric set function that outputs the optimal arguments/parameters of an optimization problem in a single feed-forward. We denote our method as, Learning to Optimize the Optimization Process (LOOP). We show the feasibility of learning such parametric (set) functions to solve various classic optimization problems, including linear/nonlinear regression, principal component analysis, transport-based core-set, and quadratic programming in supply management applications. In addition, we propose two alternative approaches for learning such parametric functions, with and without a solver in the-LOOP. Finally, we demonstrate the effectiveness of our proposed approach through various numerical experiments. ",
    "url": "https://arxiv.org/abs/2202.04104",
    "authors": [
      "Xinran Liu",
      "Yuzhe Lu",
      "Ali Abbasi",
      "Meiyi Li",
      "Javad Mohammadi",
      "Soheil Kolouri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04110",
    "title": "PGMax: Factor Graphs for Discrete Probabilistic Graphical Models and  Loopy Belief Propagation in JAX",
    "abstract": "PGMax is an open-source Python package for easy specification of discrete Probabilistic Graphical Models (PGMs) as factor graphs, and automatic derivation of efficient and scalable loopy belief propagation (LBP) implementation in JAX. It supports general factor graphs, and can effectively leverage modern accelerators like GPUs for inference. Compared with existing alternatives, PGMax obtains higher-quality inference results with orders-of-magnitude inference speedups. PGMax additionally interacts seamlessly with the rapidly growing JAX ecosystem, opening up exciting new possibilities. Our source code, examples and documentation are available at https://github.com/vicariousinc/PGMax. ",
    "url": "https://arxiv.org/abs/2202.04110",
    "authors": [
      "Guangyao Zhou",
      "Nishanth Kumar",
      "Miguel Lázaro-Gredilla",
      "Shrinu Kushagra",
      "Dileep George"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2202.04112",
    "title": "Disentangle Saliency Detection into Cascaded Detail Modeling and Body  Filling",
    "abstract": "Salient object detection has been long studied to identify the most visually attractive objects in images/videos. Recently, a growing amount of approaches have been proposed all of which rely on the contour/edge information to improve detection performance. The edge labels are either put into the loss directly or used as extra supervision. The edge and body can also be learned separately and then fused afterward. Both methods either lead to high prediction errors near the edge or cannot be trained in an end-to-end manner. Another problem is that existing methods may fail to detect objects of various sizes due to the lack of efficient and effective feature fusion mechanisms. In this work, we propose to decompose the saliency detection task into two cascaded sub-tasks, \\emph{i.e.}, detail modeling and body filling. Specifically, the detail modeling focuses on capturing the object edges by supervision of explicitly decomposed detail label that consists of the pixels that are nested on the edge and near the edge. Then the body filling learns the body part which will be filled into the detail map to generate more accurate saliency map. To effectively fuse the features and handle objects at different scales, we have also proposed two novel multi-scale detail attention and body attention blocks for precise detail and body modeling. Experimental results show that our method achieves state-of-the-art performances on six public datasets. ",
    "url": "https://arxiv.org/abs/2202.04112",
    "authors": [
      "Yue Song",
      "Hao Tang",
      "Nicu Sebe",
      "Wei Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.04121",
    "title": "IoT Malware Detection Architecture using a Novel Channel Boosted and  Squeezed CNN",
    "abstract": "Interaction between devices, people, and the Internet has given birth to a new digital communication model, the Internet of Things (IoT). The seamless network of these smart devices is the core of this IoT model. However, on the other hand, integrating smart devices to constitute a network introduces many security challenges. These connected devices have created a security blind spot, where cybercriminals can easily launch an attack to compromise the devices using malware proliferation techniques. Therefore, malware detection is considered a lifeline for the survival of IoT devices against cyberattacks. This study proposes a novel IoT Malware Detection Architecture (iMDA) using squeezing and boosting dilated convolutional neural network (CNN). The proposed architecture exploits the concepts of edge and smoothing, multi-path dilated convolutional operations, channel squeezing, and boosting in CNN. Edge and smoothing operations are employed with split-transform-merge (STM) blocks to extract local structure and minor contrast variation in the malware images. STM blocks performed multi-path dilated convolutional operations, which helped recognize the global structure of malware patterns. Additionally, channel squeezing and merging helped to get the prominent reduced and diverse feature maps, respectively. Channel squeezing and boosting are applied with the help of STM block at the initial, middle and final levels to capture the texture variation along with the depth for the sake of malware pattern hunting. The proposed architecture has shown substantial performance compared with the customized CNN models. The proposed iMDA has achieved Accuracy: 97.93%, F1-Score: 0.9394, Precision: 0.9864, MCC: 0. 8796, Recall: 0.8873, AUC-PR: 0.9689 and AUC-ROC: 0.9938. ",
    "url": "https://arxiv.org/abs/2202.04121",
    "authors": [
      "Muhammad Asam",
      "Saddam Hussain Khan",
      "Tauseef Jamal",
      "Asifullah Khan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.04123",
    "title": "Random Linear Network Coding in NOMA Optical Wireless Networks",
    "abstract": "Optical wireless communication (OWC) has the potential to provide high communication speeds that support the massive use of the Internet that is expected in the near future. In OWC, optical access points (APs) are deployed on the celling to serve multiple users. In this context, efficient multiple access schemes are required to share the resources among the users and align multi-user interference. Recently, non-orthogonal multiple access (NOMA) has been studied to serve multiple users simultaneously using the same resources, while a different power level is allocated to each user. Despite the acceptable performance of NOMA, users might experience a high packet loss due to high noise, which results from the use of successive interference cancelation (SIC). In this work, random linear network coding (RLNC) is proposed to enhance the performance of NOMA in an optical wireless network where users are divided into multicast groups, and each group contains users that slightly differ in their channel gains. Moreover, a fixed power allocation (FPA) strategy is considered among these groups to avoid complexity. The performance of the proposed scheme is evaluated in terms of total packet success probability. The results show that the proposed scheme is more suitable for the network considered compared to other benchmark schemes such as traditional NOMA and orthogonal transmission schemes. Moreover, the total packet success probability is highly affected by the level of power allocated to each group in all the scenarios. ",
    "url": "https://arxiv.org/abs/2202.04123",
    "authors": [
      "Ahmed A. M. Hassan",
      "Ahmad Adnan Qidan",
      "Mansourah K. Aljohani",
      "Taisir E. H. El-Gorashi",
      "Jaafar M. H. Elmirghani"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2202.04124",
    "title": "A Mini-Block Natural Gradient Method for Deep Neural Networks",
    "abstract": "The training of deep neural networks (DNNs) is currently predominantly done using first-order methods. Some of these methods (e.g., Adam, AdaGrad, and RMSprop, and their variants) incorporate a small amount of curvature information by using a diagonal matrix to precondition the stochastic gradient. Recently, effective second-order methods, such as KFAC, K-BFGS, Shampoo, and TNT, have been developed for training DNNs, by preconditioning the stochastic gradient by layer-wise block-diagonal matrices. Here we propose and analyze the convergence of an approximate natural gradient method, mini-block Fisher (MBF), that lies in between these two classes of methods. Specifically, our method uses a block-diagonal approximation to the Fisher matrix, where for each layer in the DNN, whether it is convolutional or feed-forward and fully connected, the associated diagonal block is also block-diagonal and is composed of a large number of mini-blocks of modest size. Our novel approach utilizes the parallelism of GPUs to efficiently perform computations on the large number of matrices in each layer. Consequently, MBF's per-iteration computational cost is only slightly higher than it is for first-order methods. Finally, the performance of our proposed method is compared to that of several baseline methods, on both Auto-encoder and CNN problems, to validate its effectiveness both in terms of time efficiency and generalization power. ",
    "url": "https://arxiv.org/abs/2202.04124",
    "authors": [
      "Achraf Bahamou",
      "Donald Goldfarb",
      "Yi Ren"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.04134",
    "title": "A Novel Ontology-guided Attribute Partitioning Ensemble Learning Model  for Early Prediction of Cognitive Deficits using Quantitative Structural MRI  in Very Preterm Infants",
    "abstract": "Structural magnetic resonance imaging studies have shown that brain anatomical abnormalities are associated with cognitive deficits in preterm infants. Brain maturation and geometric features can be used with machine learning models for predicting later neurodevelopmental deficits. However, traditional machine learning models would suffer from a large feature-to-instance ratio (i.e., a large number of features but a small number of instances/samples). Ensemble learning is a paradigm that strategically generates and integrates a library of machine learning classifiers and has been successfully used on a wide variety of predictive modeling problems to boost model performance. Attribute (i.e., feature) bagging method is the most commonly used feature partitioning scheme, which randomly and repeatedly draws feature subsets from the entire feature set. Although attribute bagging method can effectively reduce feature dimensionality to handle the large feature-to-instance ratio, it lacks consideration of domain knowledge and latent relationship among features. In this study, we proposed a novel Ontology-guided Attribute Partitioning (OAP) method to better draw feature subsets by considering domain-specific relationship among features. With the better partitioned feature subsets, we developed an ensemble learning framework, which is referred to as OAP Ensemble Learning (OAP-EL). We applied the OAP-EL to predict cognitive deficits at 2 year of age using quantitative brain maturation and geometric features obtained at term equivalent age in very preterm infants. We demonstrated that the proposed OAP-EL approach significantly outperformed the peer ensemble learning and traditional machine learning approaches. ",
    "url": "https://arxiv.org/abs/2202.04134",
    "authors": [
      "Zhiyuan Li",
      "Hailong Li",
      "Adebayo Braimah",
      "Jonathan R. Dillman",
      "Nehal A.Parikh",
      "Lili He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04137",
    "title": "Machine Learning in Heterogeneous Porous Materials",
    "abstract": "The \"Workshop on Machine learning in heterogeneous porous materials\" brought together international scientific communities of applied mathematics, porous media, and material sciences with experts in the areas of heterogeneous materials, machine learning (ML) and applied mathematics to identify how ML can advance materials research. Within the scope of ML and materials research, the goal of the workshop was to discuss the state-of-the-art in each community, promote crosstalk and accelerate multi-disciplinary collaborative research, and identify challenges and opportunities. As the end result, four topic areas were identified: ML in predicting materials properties, and discovery and design of novel materials, ML in porous and fractured media and time-dependent phenomena, Multi-scale modeling in heterogeneous porous materials via ML, and Discovery of materials constitutive laws and new governing equations. This workshop was part of the AmeriMech Symposium series sponsored by the National Academies of Sciences, Engineering and Medicine and the U.S. National Committee on Theoretical and Applied Mechanics. ",
    "url": "https://arxiv.org/abs/2202.04137",
    "authors": [
      "Martha D'Eli",
      "Hang Deng",
      "Cedric Fraces",
      "Krishna Garikipati",
      "Lori Graham-Brady",
      "Amanda Howard",
      "Geoerge Karniadakid",
      "Vahid Keshavarzzadeh",
      "Robert M. Kirby",
      "Nathan Kutz",
      "Chunhui Li",
      "Xing Liu",
      "Hannah Lu",
      "Pania Newell",
      "Daniel O'Malley",
      "Masa Prodanovic",
      "Gowri Srinivasan",
      "Alexandre Tartakovsky",
      "Daniel M. Tartakovsky",
      "Hamdi Tchelepi",
      "Bozo Vazic",
      "Hari Viswanathan",
      "Hongkyu Yoon",
      "Piotr Zarzycki"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Materials Science (cond-mat.mtrl-sci)"
    ]
  },
  {
    "id": "arXiv:2202.04139",
    "title": "Simplified Graph Convolution with Heterophily",
    "abstract": "Graph convolutional networks (GCNs) (Kipf & Welling, 2017) attempt to extend the success of deep learning in modeling image and text data to graphs. However, like other deep models, GCNs comprise repeated nonlinear transformations of inputs and are therefore time and memory intensive to train. Recent work has shown that a much simpler and faster model, Simple Graph Convolution (SGC) (Wu et al., 2019), is competitive with GCNs in common graph machine learning benchmarks. The use of graph data in SGC implicitly assumes the common but not universal graph characteristic of homophily, wherein nodes link to nodes which are similar. Here we show that SGC is indeed ineffective for heterophilous (i.e., non-homophilous) graphs via experiments on synthetic and real-world datasets. We propose Adaptive Simple Graph Convolution (ASGC), which we show can adapt to both homophilous and heterophilous graph structure. Like SGC, ASGC is not a deep model, and hence is fast, scalable, and interpretable. We find that our non-deep method often outperforms state-of-the-art deep models at node classification on a benchmark of real-world datasets. The SGC paper questioned whether the complexity of graph neural networks is warranted for common graph problems involving homophilous networks; our results suggest that this question is still open even for more complicated problems involving heterophilous networks. ",
    "url": "https://arxiv.org/abs/2202.04139",
    "authors": [
      "Sudhanshu Chanpuriya",
      "Cameron Musco"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2202.04165",
    "title": "Instantaneous and limiting behavior of an n-node blockchain under cyber  attacks from a single hacker",
    "abstract": "We investigate the instantaneous and limiting behavior of an n-node blockchain which is under continuous monitoring of the IT department of a company but faces non-stop cyber attacks from a single hacker. The blockchain is functional as far as no data stored on it has been changed, deleted, or locked. Once the IT department detects the attack from the hacker, it will immediately re-set the blockchain, rendering all previous efforts of the hacker in vain. The hacker will not stop until the blockchain is dysfunctional. For arbitrary distributions of the hacking times and detecting times, we derive the limiting functional probability, instantaneous functional probability, and mean functional time of the blockchain. We also show that all these quantities are increasing functions of the number of nodes, substantiating the intuition that the more nodes a blockchain has, the harder it is for a hacker to succeed in a cyber attack. ",
    "url": "https://arxiv.org/abs/2202.04165",
    "authors": [
      "Xiufeng Xu",
      "Liang Hong"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Optimization and Control (math.OC)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2202.04181",
    "title": "TransformNet: Self-supervised representation learning through predicting  geometric transformations",
    "abstract": "Deep neural networks need a big amount of training data, while in the real world there is a scarcity of data available for training purposes. To resolve this issue unsupervised methods are used for training with limited data. In this report, we describe the unsupervised semantic feature learning approach for recognition of the geometric transformation applied to the input data. The basic concept of our approach is that if someone is unaware of the objects in the images, he/she would not be able to quantitatively predict the geometric transformation that was applied to them. This self supervised scheme is based on pretext task and the downstream task. The pretext classification task to quantify the geometric transformations should force the CNN to learn high-level salient features of objects useful for image classification. In our baseline model, we define image rotations by multiples of 90 degrees. The CNN trained on this pretext task will be used for the classification of images in the CIFAR-10 dataset as a downstream task. we run the baseline method using various models, including ResNet, DenseNet, VGG-16, and NIN with a varied number of rotations in feature extracting and fine-tuning settings. In extension of this baseline model we experiment with transformations other than rotation in pretext task. We compare performance of selected models in various settings with different transformations applied to images,various data augmentation techniques as well as using different optimizers. This series of different type of experiments will help us demonstrate the recognition accuracy of our self-supervised model when applied to a downstream task of classification. ",
    "url": "https://arxiv.org/abs/2202.04181",
    "authors": [
      "Sayed Hashim",
      "Muhammad Ali"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04187",
    "title": "FMP: Toward Fair Graph Message Passing against Topology Bias",
    "abstract": "Despite recent advances in achieving fair representations and predictions through regularization, adversarial debiasing, and contrastive learning in graph neural networks (GNNs), the working mechanism (i.e., message passing) behind GNNs inducing unfairness issue remains unknown. In this work, we theoretically and experimentally demonstrate that representative aggregation in message-passing schemes accumulates bias in node representation due to topology bias induced by graph topology. Thus, a \\textsf{F}air \\textsf{M}essage \\textsf{P}assing (FMP) scheme is proposed to aggregate useful information from neighbors but minimize the effect of topology bias in a unified framework considering graph smoothness and fairness objectives. The proposed FMP is effective, transparent, and compatible with back-propagation training. An acceleration approach on gradient calculation is also adopted to improve algorithm efficiency. Experiments on node classification tasks demonstrate that the proposed FMP outperforms the state-of-the-art baselines in effectively and efficiently mitigating bias on three real-world datasets. ",
    "url": "https://arxiv.org/abs/2202.04187",
    "authors": [
      "Zhimeng Jiang",
      "Xiaotian Han",
      "Chao Fan",
      "Zirui Liu",
      "Na Zou",
      "Ali Mostafavi",
      "Xia Hu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04191",
    "title": "Robust preconditioning for a mixed formulation of phase-field fracture  problems",
    "abstract": "In this work, we consider fracture propagation in nearly incompressible and (fully) incompressible materials using a phase-field formulation. We use a mixed form of the elasticity equation to overcome volume locking effects and develop a robust, nonlinear and linear solver scheme and preconditioner for the resulting system. The coupled variational inequality system, which is solved monolithically, consists of three unknowns: displacements, pressure, and phase-field. Nonlinearities due to coupling, constitutive laws, and crack irreversibility are solved using a combined Newton algorithm for the nonlinearities in the partial differential equation and employing a primal-dual active set strategy for the crack irreverrsibility constraint. The linear system in each Newton step is solved iteratively with a flexible generalized minimal residual method (GMRES). The key contribution of this work is the development of a problem-specific preconditioner that leverages the saddle-point structure of the displacement and pressure variable. Four numerical examples in pure solids and pressure-driven fractures are conducted on uniformly and locally refined meshes to investigate the robustness of the solver concerning the Poisson ratio as well as the discretization and regularization parameters. ",
    "url": "https://arxiv.org/abs/2202.04191",
    "authors": [
      "Timo Heister",
      "Katrin Mang",
      "Thomas Wick"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2202.04212",
    "title": "Fault Detection and Diagnosis with Imbalanced and Noisy Data: A Hybrid  Framework for Rotating Machinery",
    "abstract": "Fault diagnosis plays an essential role in reducing the maintenance costs of rotating machinery manufacturing systems. In many real applications of fault detection and diagnosis, data tend to be imbalanced, meaning that the number of samples for some fault classes is much less than the normal data samples. At the same time, in an industrial condition, accelerometers encounter high levels of disruptive signals and the collected samples turn out to be heavily noisy. As a consequence, many traditional Fault Detection and Diagnosis (FDD) frameworks get poor classification performances when dealing with real-world circumstances. Three main solutions have been proposed in the literature to cope with this problem: (1) the implementation of generative algorithms to increase the amount of under-represented input samples, (2) the employment of a classifier being powerful to learn from imbalanced and noisy data, (3) the development of an efficient data pre-processing including feature extraction and data augmentation. This paper proposes a hybrid framework which uses the three aforementioned components to achieve an effective signal-based FDD system for imbalanced conditions. Specifically, it first extracts the fault features, using Fourier and wavelet transforms to make full use of the signals. Then, it employs Wasserstein Generative Adversarial Networks (WGAN) to generate synthetic samples to populate the rare fault class and enhance the training set. Moreover, to achieve a higher performance a novel combination of Convolutional Long Short-term Memory (CLSTM) and Weighted Extreme Learning Machine (WELM) is proposed. To verify the effectiveness of the developed framework, different datasets settings on different imbalance severities and noise degrees were used. The comparative results demonstrate that in different scenarios GAN-CLSTM-ELM outperforms the other state-of-the-art FDD frameworks. ",
    "url": "https://arxiv.org/abs/2202.04212",
    "authors": [
      "Masoud Jalayer",
      "Amin Kaboli",
      "Carlotta Orsenigo",
      "Carlo Vercellis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04231",
    "title": "Real-Time Event-Based Tracking and Detection for Maritime Environments",
    "abstract": "Event cameras are ideal for object tracking applications due to their ability to capture fast-moving objects while mitigating latency and data redundancy. Existing event-based clustering and feature tracking approaches for surveillance and object detection work well in the majority of cases, but fall short in a maritime environment. Our application of maritime vessel detection and tracking requires a process that can identify features and output a confidence score representing the likelihood that the feature was produced by a vessel, which may trigger a subsequent alert or activate a classification system. However, the maritime environment presents unique challenges such as the tendency of waves to produce the majority of events, demanding the majority of computational processing and producing false positive detections. By filtering redundant events and analyzing the movement of each event cluster, we can identify and track vessels while ignoring shorter lived and erratic features such as those produced by waves. ",
    "url": "https://arxiv.org/abs/2202.04231",
    "authors": [
      "Stephanie Aelmore",
      "Richard C. Ordonez",
      "Shibin Parameswaran",
      "Justin Mauger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2202.04235",
    "title": "Towards Compositional Adversarial Robustness: Generalizing Adversarial  Training to Composite Semantic Perturbations",
    "abstract": "Model robustness against adversarial examples of single perturbation type such as the $\\ell_{p}$-norm has been widely studied, yet its generalization to more realistic scenarios involving multiple semantic perturbations and their composition remains largely unexplored. In this paper, we firstly propose a novel method for generating composite adversarial examples. By utilizing component-wise projected gradient descent and automatic attack-order scheduling, our method can find the optimal attack composition. We then propose \\textbf{generalized adversarial training} (\\textbf{GAT}) to extend model robustness from $\\ell_{p}$-norm to composite semantic perturbations, such as the combination of Hue, Saturation, Brightness, Contrast, and Rotation. The results on ImageNet and CIFAR-10 datasets show that GAT can be robust not only to any single attack but also to any combination of multiple attacks. GAT also outperforms baseline $\\ell_{\\infty}$-norm bounded adversarial training approaches by a significant margin. ",
    "url": "https://arxiv.org/abs/2202.04235",
    "authors": [
      "Yun-Yun Tsai",
      "Lei Hsiung",
      "Pin-Yu Chen",
      "Tsung-Yi Ho"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.04237",
    "title": "Learning Robust Convolutional Neural Networks with Relevant Feature  Focusing via Explanations",
    "abstract": "Existing image recognition techniques based on convolutional neural networks (CNNs) basically assume that the training and test datasets are sampled from i.i.d distributions. However, this assumption is easily broken in the real world because of the distribution shift that occurs when the co-occurrence relations between objects and backgrounds in input images change. Under this type of distribution shift, CNNs learn to focus on features that are not task-relevant, such as backgrounds from the training data, and degrade their accuracy on the test data. To tackle this problem, we propose relevant feature focusing (ReFF). ReFF detects task-relevant features and regularizes CNNs via explanation outputs (e.g., Grad-CAM). Since ReFF is composed of post-hoc explanation modules, it can be easily applied to off-the-shelf CNNs. Furthermore, ReFF requires no additional inference cost at test time because it is only used for regularization while training. We demonstrate that CNNs trained with ReFF focus on features relevant to the target task and that ReFF improves the test-time accuracy. ",
    "url": "https://arxiv.org/abs/2202.04237",
    "authors": [
      "Kazuki Adachi",
      "Shin'ya Yamaguchi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04239",
    "title": "A multiscale spatiotemporal approach for smallholder irrigation  detection",
    "abstract": "In presenting an irrigation detection methodology that leverages multiscale satellite imagery of vegetation abundance, this paper introduces a process to supplement limited ground-collected labels and ensure classifier applicability in an area of interest. Spatiotemporal analysis of MODIS 250m Enhanced Vegetation Index (EVI) timeseries characterizes native vegetation phenologies at regional scale to provide the basis for a continuous phenology map that guides supplementary label collection over irrigated and non-irrigated agriculture. Subsequently, validated dry season greening and senescence cycles observed in 10m Sentinel-2 imagery are used to train a suite of classifiers for automated detection of potential smallholder irrigation. Strategies to improve model robustness are demonstrated, including a method of data augmentation that randomly shifts training samples; and an assessment of classifier types that produce the best performance in withheld target regions. The methodology is applied to detect smallholder irrigation in two states in the Ethiopian highlands, Tigray and Amhara. Results show that a transformer-based neural network architecture allows for the most robust prediction performance in withheld regions, followed closely by a CatBoost random forest model. Over withheld ground-collection survey labels, the transformer-based model achieves 96.7% accuracy over non-irrigated samples and 95.9% accuracy over irrigated samples. Over a larger set of samples independently collected via the introduced method of label supplementation, non-irrigated and irrigated labels are predicted with 98.3% and 95.5% accuracy, respectively. The detection model is then deployed over Tigray and Amhara, revealing crop rotation patterns and year-over-year irrigated area change. Predictions suggest that irrigated area in these two states has decreased by approximately 40% from 2020 to 2021. ",
    "url": "https://arxiv.org/abs/2202.04239",
    "authors": [
      "Terence Conlon",
      "Christopher Small",
      "Vijay Modi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04241",
    "title": "Distillation with Contrast is All You Need for Self-Supervised Point  Cloud Representation Learning",
    "abstract": "In this paper, we propose a simple and general framework for self-supervised point cloud representation learning. Human beings understand the 3D world by extracting two levels of information and establishing the relationship between them. One is the global shape of an object, and the other is the local structures of it. However, few existing studies in point cloud representation learning explored how to learn both global shapes and local-to-global relationships without a specified network architecture. Inspired by how human beings understand the world, we utilize knowledge distillation to learn both global shape information and the relationship between global shape and local structures. At the same time, we combine contrastive learning with knowledge distillation to make the teacher network be better updated. Our method achieves the state-of-the-art performance on linear classification and multiple other downstream tasks. Especially, we develop a variant of ViT for 3D point cloud feature extraction, which also achieves comparable results with existing backbones when combined with our framework, and visualization of the attention maps show that our model does understand the point cloud by combining the global shape information and multiple local structural information, which is consistent with the inspiration of our representation learning method. Our code will be released soon. ",
    "url": "https://arxiv.org/abs/2202.04241",
    "authors": [
      "Kexue Fu",
      "Peng Gao",
      "Renrui Zhang",
      "Hongsheng Li",
      "Yu Qiao",
      "Manning Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.04250",
    "title": "GenAD: General Representations of Multivariate Time Seriesfor Anomaly  Detection",
    "abstract": "The reliability of wireless base stations in China Mobile is of vital importance, because the cell phone users are connected to the stations and the behaviors of the stations are directly related to user experience. Although the monitoring of the station behaviors can be realized by anomaly detection on multivariate time series, due to complex correlations and various temporal patterns of multivariate series in large-scale stations, building a general unsupervised anomaly detection model with a higher F1-score remains a challenging task. In this paper, we propose a General representation of multivariate time series for Anomaly Detection(GenAD). First, we pre-train a general model on large-scale wireless base stations with self-supervision, which can be easily transferred to a specific station anomaly detection with a small amount of training data. Second, we employ Multi-Correlation Attention and Time-Series Attention to represent the correlations and temporal patterns of the stations. With the above innovations, GenAD increases F1-score by total 9% on real-world datasets in China Mobile, while the performance does not significantly degrade on public datasets with only 10% of the training data. ",
    "url": "https://arxiv.org/abs/2202.04250",
    "authors": [
      "Xiaolei Hua",
      "Lin Zhu",
      "Shenglin Zhang",
      "Zeyan Li",
      "Su Wang",
      "Dong Zhou",
      "Shuo Wang",
      "Chao Deng"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2202.04256",
    "title": "GiraffeDet: A Heavy-Neck Paradigm for Object Detection",
    "abstract": "In conventional object detection frameworks, a backbone body inherited from image recognition models extracts deep latent features and then a neck module fuses these latent features to capture information at different scales. As the resolution in object detection is much larger than in image recognition, the computational cost of the backbone often dominates the total inference cost. This heavy-backbone design paradigm is mostly due to the historical legacy when transferring image recognition models to object detection rather than an end-to-end optimized design for object detection. In this work, we show that such paradigm indeed leads to sub-optimal object detection models. To this end, we propose a novel heavy-neck paradigm, GiraffeDet, a giraffe-like network for efficient object detection. The GiraffeDet uses an extremely lightweight backbone and a very deep and large neck module which encourages dense information exchange among different spatial scales as well as different levels of latent semantics simultaneously. This design paradigm allows detectors to process the high-level semantic information and low-level spatial information at the same priority even in the early stage of the network, making it more effective in detection tasks. Numerical evaluations on multiple popular object detection benchmarks show that GiraffeDet consistently outperforms previous SOTA models across a wide spectrum of resource constraints. ",
    "url": "https://arxiv.org/abs/2202.04256",
    "authors": [
      "Yiqi Jiang",
      "Zhiyu Tan",
      "Junyan Wang",
      "Xiuyu Sun",
      "Ming Lin",
      "Hao Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.04271",
    "title": "Adversarial Detection without Model Information",
    "abstract": "Most prior state-of-the-art adversarial detection works assume that the underlying vulnerable model is accessible, i,e., the model can be trained or its outputs are visible. However, this is not a practical assumption due to factors like model encryption, model information leakage and so on. In this work, we propose a model independent adversarial detection method using a simple energy function to distinguish between adversarial and natural inputs. We train a standalone detector independent of the underlying model, with sequential layer-wise training to increase the energy separation corresponding to natural and adversarial inputs. With this, we perform energy distribution-based adversarial detection. Our method achieves state-of-the-art detection performance (ROC-AUC > 0.9) across a wide range of gradient, score and decision-based adversarial attacks on CIFAR10, CIFAR100 and TinyImagenet datasets. Compared to prior approaches, our method requires ~10-100x less number of operations and parameters for adversarial detection. Further, we show that our detection method is transferable across different datasets and adversarial attacks. For reproducibility, we provide code in the supplementary material. ",
    "url": "https://arxiv.org/abs/2202.04271",
    "authors": [
      "Abhishek Moitra",
      "Youngeun Kim",
      "Priyadarshini Panda"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.04301",
    "title": "Log-based Anomaly Detection with Deep Learning: How Far Are We?",
    "abstract": "Software-intensive systems produce logs for troubleshooting purposes. Recently, many deep learning models have been proposed to automatically detect system anomalies based on log data. These models typically claim very high detection accuracy. For example, most models report an F-measure greater than 0.9 on the commonly-used HDFS dataset. To achieve a profound understanding of how far we are from solving the problem of log-based anomaly detection, in this paper, we conduct an in-depth analysis of five state-of-the-art deep learning-based models for detecting system anomalies on four public log datasets. Our experiments focus on several aspects of model evaluation, including training data selection, data grouping, class distribution, data noise, and early detection ability. Our results point out that all these aspects have significant impact on the evaluation, and that all the studied models do not always work well. The problem of log-based anomaly detection has not been solved yet. Based on our findings, we also suggest possible future work. ",
    "url": "https://arxiv.org/abs/2202.04301",
    "authors": [
      "Van Hoang Le",
      "Hongyu Zhang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04311",
    "title": "ARIBA: Towards Accurate and Robust Identification of Backdoor Attacks in  Federated Learning",
    "abstract": "The distributed nature and privacy-preserving characteristics of federated learning make it prone to the threat of poisoning attacks, especially backdoor attacks, where the adversary implants backdoors to misguide the model on certain attacker-chosen sub-tasks. In this paper, we present a novel method ARIBA to accurately and robustly identify backdoor attacks in federated learning. By empirical study, we observe that backdoor attacks are discernible by the filters of CNN layers. Based on this finding, we employ unsupervised anomaly detection to evaluate the pre-processed filters and calculate an anomaly score for each client. We then identify the most suspicious clients according to their anomaly scores. Extensive experiments are conducted, which show that our method ARIBA can effectively and robustly defend against multiple state-of-the-art attacks without degrading model performance. ",
    "url": "https://arxiv.org/abs/2202.04311",
    "authors": [
      "Yuxi Mi",
      "Jihong Guan",
      "Shuigeng Zhou"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.04313",
    "title": "Privacy Concerns Raised by Pervasive User Data Collection From  Cyberspace and Their Countermeasures",
    "abstract": "The virtual dimension called `Cyberspace' built on internet technologies has served people's daily lives for decades. Now it offers advanced services and connected experiences with the developing pervasive computing technologies that digitise, collect, and analyse users' activity data. This changes how user information gets collected and impacts user privacy at traditional cyberspace gateways, including the devices carried by users for daily use. This work investigates the impacts and surveys privacy concerns caused by this data collection, namely identity tracking from browsing activities, user input data disclosure, data accessibility in mobile devices, security of delicate data transmission, privacy in participating sensing, and identity privacy in opportunistic networks. Each of the surveyed privacy concerns is discussed in a well-defined scope according to the impacts mentioned above. Existing countermeasures are also surveyed and discussed, which identifies corresponding research gaps. To complete the perspectives, three complex open problems, namely trajectory privacy, privacy in smart metering, and involuntary privacy leakage with ambient intelligence, are briefly discussed for future research directions before a succinct conclusion to our survey at the end. ",
    "url": "https://arxiv.org/abs/2202.04313",
    "authors": [
      "Yinhao Jiang",
      "Ba Dung Le",
      "Tanveer Zia",
      "Praveen Gauravaram"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2202.04327",
    "title": "Anchor Graph Structure Fusion Hashing for Cross-Modal Similarity Search",
    "abstract": "Cross-modal hashing still has some challenges needed to address: (1) most existing CMH methods take graphs as input to model data distribution. These methods omit to consider the correlation of graph structure among multiple modalities; (2) most existing CMH methods ignores considering the fusion affinity among multi-modalities data; (3) most existing CMH methods relax the discrete constraints to solve the optimization objective, significantly degrading the retrieval performance. To solve the above limitations, we propose a novel Anchor Graph Structure Fusion Hashing (AGSFH). AGSFH constructs the anchor graph structure fusion matrix from different anchor graphs of multiple modalities with the Hadamard product, which can fully exploit the geometric property of underlying data structure. Based on the anchor graph structure fusion matrix, AGSFH attempts to directly learn an intrinsic anchor graph, where the structure of the intrinsic anchor graph is adaptively tuned so that the number of components of the intrinsic graph is exactly equal to the number of clusters. Besides, AGSFH preserves the anchor fusion affinity into the common binary Hamming space. Furthermore, a discrete optimization framework is designed to learn the unified binary codes. Extensive experimental results on three public social datasets demonstrate the superiority of AGSFH. ",
    "url": "https://arxiv.org/abs/2202.04327",
    "authors": [
      "Lu Wang",
      "Jie Yang",
      "Masoumeh Zareapoor",
      "Zhonglong Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2202.04328",
    "title": "CAU_KU team's submission to ADD 2022 Challenge task 1: Low-quality fake  audio detection through frequency feature masking",
    "abstract": "This technical report describes Chung-Ang University and Korea University (CAU_KU) team's model participating in the Audio Deep Synthesis Detection (ADD) 2022 Challenge, track 1: Low-quality fake audio detection. For track 1, we propose a frequency feature masking (FFM) augmentation technique to deal with a low-quality audio environment. %detection that spectrogram-based models can be applied. We applied FFM and mixup augmentation on five spectrogram-based deep neural network architectures that performed well for spoofing detection using mel-spectrogram and constant Q transform (CQT) features. Our best submission achieved 23.8% of EER ranked 3rd on track 1. ",
    "url": "https://arxiv.org/abs/2202.04328",
    "authors": [
      "Il-Youp Kwak",
      "Sunmook Choi",
      "Jonghoon Yang",
      "Yerin Lee",
      "Seungsang Oh"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2202.04333",
    "title": "Who to Watch Next: Two-side Interactive Networks for Live Broadcast  Recommendation",
    "abstract": "With the prevalence of live broadcast business nowadays, a new type of recommendation service, called live broadcast recommendation, is widely used in many mobile e-commerce Apps. Different from classical item recommendation, live broadcast recommendation is to automatically recommend user anchors instead of items considering the interactions among triple-objects (i.e., users, anchors, items) rather than binary interactions between users and items. Existing methods based on binary objects, ranging from early matrix factorization to recently emerged deep learning, obtain objects' embeddings by mapping from pre-existing features. Directly applying these techniques would lead to limited performance, as they are failing to encode collaborative signals among triple-objects. In this paper, we propose a novel TWo-side Interactive NetworkS (TWINS) for live broadcast recommendation. In order to fully use both static and dynamic information on user and anchor sides, we combine a product-based neural network with a recurrent neural network to learn the embedding of each object. In addition, instead of directly measuring the similarity, TWINS effectively injects the collaborative effects into the embedding process in an explicit manner by modeling interactive patterns between the user's browsing history and the anchor's broadcast history in both item and anchor aspects. Furthermore, we design a novel co-retrieval technique to select key items among massive historic records efficiently. Offline experiments on real large-scale data show the superior performance of the proposed TWINS, compared to representative methods; and further results of online experiments on Diantao App show that TWINS gains average performance improvement of around 8% on ACTR metric, 3% on UCTR metric, 3.5% on UCVR metric. ",
    "url": "https://arxiv.org/abs/2202.04333",
    "authors": [
      "Jiarui Jin",
      "Xianyu Chen",
      "Yuanbo Chen",
      "Weinan Zhang",
      "Renting Rui",
      "Zaifan Jiang",
      "Zhewen Su",
      "Yong Yu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2202.04347",
    "title": "Gradient Methods Provably Converge to Non-Robust Networks",
    "abstract": "Despite a great deal of research, it is still unclear why neural networks are so susceptible to adversarial examples. In this work, we identify natural settings where depth-$2$ ReLU networks trained with gradient flow are provably non-robust (susceptible to small adversarial $\\ell_2$-perturbations), even when robust networks that classify the training dataset correctly exist. Perhaps surprisingly, we show that the well-known implicit bias towards margin maximization induces bias towards non-robust networks, by proving that every network which satisfies the KKT conditions of the max-margin problem is non-robust. ",
    "url": "https://arxiv.org/abs/2202.04347",
    "authors": [
      "Gal Vardi",
      "Gilad Yehudai",
      "Ohad Shamir"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04375",
    "title": "Temporal Logic Guided Motion Primitives for Complex Manipulation Tasks  with User Preferences",
    "abstract": "Dynamic movement primitives (DMPs) are a flexible trajectory learning scheme widely used in motion generation of robotic systems. However, existing DMP-based methods mainly focus on simple go-to-goal tasks. Motivated to handle tasks beyond point-to-point motion planning, this work presents temporal logic guided optimization of motion primitives, namely PIBB-TL algorithm, for complex manipulation tasks with user preferences. In particular, weighted truncated linear temporal logic (wTLTL) is incorporated in the PIBB-TL algorithm, which not only enables the encoding of complex tasks that involve a sequence of logically organized action plans with user preferences, but also provides a convenient and efficient means to design the cost function. The black-box optimization is then adapted to identify optimal shape parameters of DMPs to enable motion planning of robotic systems. The effectiveness of the PIBB-TL algorithm is demonstrated via simulation and experime ",
    "url": "https://arxiv.org/abs/2202.04375",
    "authors": [
      "Hao Wang",
      "Haoyuan He",
      "Weiwei Shang",
      "Zhen Kan"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2202.04376",
    "title": "Improving short-term bike sharing demand forecast through an irregular  convolutional neural network",
    "abstract": "As an important task for the management of bike sharing systems, accurate forecast of travel demand could facilitate dispatch and relocation of bicycles to improve user satisfaction. In recent years, many deep learning algorithms have been introduced to improve bicycle usage forecast. A typical practice is to integrate convolutional (CNN) and recurrent neural network (RNN) to capture spatial-temporal dependency in historical travel demand. For typical CNN, the convolution operation is conducted through a kernel that moves across a \"matrix-format\" city to extract features over spatially adjacent urban areas. This practice assumes that areas close to each other could provide useful information that improves prediction accuracy. However, bicycle usage in neighboring areas might not always be similar, given spatial variations in built environment characteristics and travel behavior that affect cycling activities. Yet, areas that are far apart can be relatively more similar in temporal usage patterns. To utilize the hidden linkage among these distant urban areas, the study proposes an irregular convolutional Long-Short Term Memory model (IrConv+LSTM) to improve short-term bike sharing demand forecast. The model modifies traditional CNN with irregular convolutional architecture to extract dependency among \"semantic neighbors\". The proposed model is evaluated with a set of benchmark models in five study sites, which include one dockless bike sharing system in Singapore, and four station-based systems in Chicago, Washington, D.C., New York, and London. We find that IrConv+LSTM outperforms other benchmark models in the five cities. The model also achieves superior performance in areas with varying levels of bicycle usage and during peak periods. The findings suggest that \"thinking beyond spatial neighbors\" can further improve short-term travel demand prediction of urban bike sharing systems. ",
    "url": "https://arxiv.org/abs/2202.04376",
    "authors": [
      "Xinyu Li",
      "Yang Xu",
      "Xiaohu Zhang",
      "Wenzhong Shi",
      "Yang Yue",
      "Qingquan Li"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.04392",
    "title": "Model Architecture Adaption for Bayesian Neural Networks",
    "abstract": "Bayesian Neural Networks (BNNs) offer a mathematically grounded framework to quantify the uncertainty of model predictions but come with a prohibitive computation cost for both training and inference. In this work, we show a novel network architecture search (NAS) that optimizes BNNs for both accuracy and uncertainty while having a reduced inference latency. Different from canonical NAS that optimizes solely for in-distribution likelihood, the proposed scheme searches for the uncertainty performance using both in- and out-of-distribution data. Our method is able to search for the correct placement of Bayesian layer(s) in a network. In our experiments, the searched models show comparable uncertainty quantification ability and accuracy compared to the state-of-the-art (deep ensemble). In addition, the searched models use only a fraction of the runtime compared to many popular BNN baselines, reducing the inference runtime cost by $2.98 \\times$ and $2.92 \\times$ respectively on the CIFAR10 dataset when compared to MCDropout and deep ensemble. ",
    "url": "https://arxiv.org/abs/2202.04392",
    "authors": [
      "Duo Wang",
      "Yiren Zhao",
      "Ilia Shumailov",
      "Robert Mullins"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.04454",
    "title": "Adjacent-Bits-Swapped Polar codes: A new code construction to speed up  polarization",
    "abstract": "The construction of polar codes with code length $n=2^m$ involves $m$ layers of polar transforms. In this paper, we observe that after each layer of polar transforms, one can swap certain pairs of adjacent bits to accelerate the polarization process. More precisely, if the previous bit is more reliable than its next bit under the successive decoder, then switching the decoding order of these two adjacent bits will make the reliable bit even more reliable and the noisy bit even noisier. Based on this observation, we propose a new family of codes called the Adjacent-Bits-Swapped (ABS) polar codes. We add a permutation layer after each polar transform layer in the construction of the ABS polar codes. In order to choose which pairs of adjacent bits to swap in the permutation layers, we rely on a new polar transform that combines two independent channels with $4$-ary inputs. This new polar transform allows us to track the evolution of every pair of adjacent bits through different layers of polar transforms, and it also plays an essential role in the Successive Cancellation List (SCL) decoder for the ABS polar codes. Extensive simulation results show that ABS polar codes consistently outperform standard polar codes by 0.15dB -- 0.6dB when we use CRC-aided SCL decoder with list size $32$ for both codes. The implementations of all the algorithms in this paper are available at https://github.com/PlumJelly/ABS-Polar ",
    "url": "https://arxiv.org/abs/2202.04454",
    "authors": [
      "Guodong Li",
      "Min Ye",
      "Sihuang Hu"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2202.04461",
    "title": "A Multi-Task Recurrent Neural Network for End-to-End Dynamic Occupancy  Grid Mapping",
    "abstract": "A common approach for modeling the environment of an autonomous vehicle are dynamic occupancy grid maps, in which the surrounding is divided into cells, each containing the occupancy and velocity state of its location. Despite the advantage of modeling arbitrary shaped objects, the used algorithms rely on hand-designed inverse sensor models and semantic information is missing. Therefore, we introduce a multi-task recurrent neural network to predict grid maps providing occupancies, velocity estimates, semantic information and the driveable area. During training, our network architecture, which is a combination of convolutional and recurrent layers, processes sequences of raw lidar data, that is represented as bird's eye view images with several height channels. The multi-task network is trained in an end-to-end fashion to predict occupancy grid maps without the usual preprocessing steps consisting of removing ground points and applying an inverse sensor model. In our evaluations, we show that our learned inverse sensor model is able to overcome some limitations of a geometric inverse sensor model in terms of representing object shapes and modeling freespace. Moreover, we report a better runtime performance and more accurate semantic predictions for our end-to-end approach, compared to our network relying on measurement grid maps as input data. ",
    "url": "https://arxiv.org/abs/2202.04461",
    "authors": [
      "Marcel Schreiber",
      "Vasileios Belagiannis",
      "Claudius Gläser",
      "Klaus Dietmayer"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2202.04465",
    "title": "Allocation of Indivisible Items with Individual Preference Graphs",
    "abstract": "This paper studies the allocation of indivisible items to agents, when each agent's preferences are expressed by means of a directed acyclic graph. The vertices of each preference graph represent the subset of items approved of by the respective agent. An arc $(a,b)$ in such a graph means that the respective agent prefers item $a$ over item $b$. We introduce a new measure of dissatisfaction of an agent by counting the number of non-assigned items which are approved of by the agent and for which no more preferred item is allocated to the agent. Considering two problem variants, we seek an allocation of the items to the agents in a way that minimizes (i) the total dissatisfaction over all agents or (ii) the maximum dissatisfaction among the agents. For both optimization problems we study the status of computational complexity and obtain NP-hardness results as well as polynomial algorithms with respect to natural underlying graph structures, such as stars, trees, paths, and matchings. We also analyze the parameterized complexity of the two problems with respect to various parameters related to the number of agents, the dissatisfaction threshold, the vertex degrees of the preference graphs, and the treewidth. ",
    "url": "https://arxiv.org/abs/2202.04465",
    "authors": [
      "Nina Chiarelli",
      "Clément Dallard",
      "Andreas Darmann",
      "Stefan Lendl",
      "Martin Milanič",
      "Peter Muršič",
      "Ulrich Pferschy",
      "Nevena Pivač"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2202.04476",
    "title": "Counting Kernels in Directed Graphs with Arbitrary Orientations",
    "abstract": "A kernel of a directed graph is a subset of vertices that is both independent and absorbing (every vertex not in the kernel has an out-neighbour in the kernel). Not all directed graphs contain kernels, and computing a kernel or deciding that none exist is NP-complete even on low-degree planar digraphs. The existing polynomial-time algorithms for this problem all restrict both the undirected structure and the edge orientations of the input: for example, to chordal graphs without bidirectional edges (Pass-Lanneau, Igarashi and Meunier, Discrete Appl Math 2020) or to permutation graphs where each clique has a sink (Abbas and Saoula, 4OR 2005). By contrast, we count the kernels of a fuzzy circular interval graph in polynomial time, regardless of its edge orientations, and return a kernel when one exists. (Fuzzy circular graphs were introduced by Chudnovsky and Seymour in their structure theorem for claw-free graphs.) We also consider kernels on cographs, where we establish NP-hardness in general but linear running times on the subclass of threshold graphs. ",
    "url": "https://arxiv.org/abs/2202.04476",
    "authors": [
      "Bruno Jartoux"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2202.04479",
    "title": "False Memory Formation in Continual Learners Through Imperceptible  Backdoor Trigger",
    "abstract": "In this brief, we show that sequentially learning new information presented to a continual (incremental) learning model introduces new security risks: an intelligent adversary can introduce small amount of misinformation to the model during training to cause deliberate forgetting of a specific task or class at test time, thus creating \"false memory\" about that task. We demonstrate such an adversary's ability to assume control of the model by injecting \"backdoor\" attack samples to commonly used generative replay and regularization based continual learning approaches using continual learning benchmark variants of MNIST, as well as the more challenging SVHN and CIFAR 10 datasets. Perhaps most damaging, we show this vulnerability to be very acute and exceptionally effective: the backdoor pattern in our attack model can be imperceptible to human eye, can be provided at any point in time, can be added into the training data of even a single possibly unrelated task and can be achieved with as few as just 1\\% of total training dataset of a single task. ",
    "url": "https://arxiv.org/abs/2202.04479",
    "authors": [
      "Muhammad Umer",
      "Robi Polikar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2202.04488",
    "title": "CRAT-Pred: Vehicle Trajectory Prediction with Crystal Graph  Convolutional Neural Networks and Multi-Head Self-Attention",
    "abstract": "Predicting the motion of surrounding vehicles is essential for autonomous vehicles, as it governs their own motion plan. Current state-of-the-art vehicle prediction models heavily rely on map information. In reality, however, this information is not always available. We therefore propose CRAT-Pred, a multi-modal and non-rasterization-based trajectory prediction model, specifically designed to effectively model social interactions between vehicles, without relying on map information. CRAT-Pred applies a graph convolution method originating from the field of material science to vehicle prediction, allowing to efficiently leverage edge features, and combines it with multi-head self-attention. Compared to other map-free approaches, the model achieves state-of-the-art performance with a significantly lower number of model parameters. In addition to that, we quantitatively show that the self-attention mechanism is able to learn social interactions between vehicles, with the weights representing a measurable interaction score. The source code is publicly available. ",
    "url": "https://arxiv.org/abs/2202.04488",
    "authors": [
      "Julian Schmidt",
      "Julian Jordan",
      "Franz Gritschneder",
      "Klaus Dietmayer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2202.04504",
    "title": "Prediction Sensitivity: Continual Audit of Counterfactual Fairness in  Deployed Classifiers",
    "abstract": "As AI-based systems increasingly impact many areas of our lives, auditing these systems for fairness is an increasingly high-stakes problem. Traditional group fairness metrics can miss discrimination against individuals and are difficult to apply after deployment. Counterfactual fairness describes an individualized notion of fairness but is even more challenging to evaluate after deployment. We present prediction sensitivity, an approach for continual audit of counterfactual fairness in deployed classifiers. Prediction sensitivity helps answer the question: would this prediction have been different, if this individual had belonged to a different demographic group -- for every prediction made by the deployed model. Prediction sensitivity can leverage correlations between protected status and other features and does not require protected status information at prediction time. Our empirical results demonstrate that prediction sensitivity is effective for detecting violations of counterfactual fairness. ",
    "url": "https://arxiv.org/abs/2202.04504",
    "authors": [
      "Krystal Maughan",
      "Ivoline C. Ngong",
      "Joseph P. Near"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2202.04514",
    "title": "A Model-Agnostic Causal Learning Framework for Recommendation using  Search Data",
    "abstract": "Machine-learning based recommender systems(RSs) has become an effective means to help people automatically discover their interests. Existing models often represent the rich information for recommendation, such as items, users, and contexts, as embedding vectors and leverage them to predict users' feedback. In the view of causal analysis, the associations between these embedding vectors and users' feedback are a mixture of the causal part that describes why an item is preferred by a user, and the non-causal part that merely reflects the statistical dependencies between users and items, for example, the exposure mechanism, public opinions, display position, etc. However, existing RSs mostly ignored the striking differences between the causal parts and non-causal parts when using these embedding vectors. In this paper, we propose a model-agnostic framework named IV4Rec that can effectively decompose the embedding vectors into these two parts, hence enhancing recommendation results. Specifically, we jointly consider users' behaviors in search scenarios and recommendation scenarios. Adopting the concepts in causal analysis, we embed users' search behaviors as instrumental variables (IVs), to help decompose original embedding vectors in recommendation, i.e., treatments. IV4Rec then combines the two parts through deep neural networks and uses the combined results for recommendation. IV4Rec is model-agnostic and can be applied to a number of existing RSs such as DIN and NRHUB. Experimental results on both public and proprietary industrial datasets demonstrate that IV4Rec consistently enhances RSs and outperforms a framework that jointly considers search and recommendation. ",
    "url": "https://arxiv.org/abs/2202.04514",
    "authors": [
      "Zihua Si",
      "Xueran Han",
      "Xiao Zhang",
      "Jun Xu",
      "Yue Yin",
      "Yang Song",
      "Ji-Rong Wen"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2202.04528",
    "title": "A Multimodal Canonical-Correlated Graph Neural Network for  Energy-Efficient Speech Enhancement",
    "abstract": "This paper proposes a novel multimodal self-supervised architecture for energy-efficient AV speech enhancement by integrating graph neural networks with canonical correlation analysis (CCA-GNN). This builds on a state-of-the-art CCA-GNN that aims to learn representative embeddings by maximizing the correlation between pairs of augmented views of the same input while decorrelating disconnected features. The key idea of the conventional CCA-GNN involves discarding augmentation-variant information and preserving augmentation-invariant information whilst preventing capturing of redundant information. Our proposed AV CCA-GNN model is designed to deal with the challenging multimodal representation learning context. Specifically, our model improves contextual AV speech processing by maximizing canonical correlation from augmented views of the same channel, as well as canonical correlation from audio and visual embeddings. In addition, we propose a positional encoding of the nodes that considers a prior-frame sequence distance instead of a feature-space representation while computing the node's nearest neighbors. This serves to introduce temporal information in the embeddings through the neighborhood's connectivity. Experiments conducted with the benchmark ChiME3 dataset show that our proposed prior frame-based AV CCA-GNN reinforces better feature learning in the temporal context, leading to more energy-efficient speech reconstruction compared to state-of-the-art CCA-GNN and multi-layer perceptron models. The results demonstrate the potential of our proposed approach for exploitation in future assistive technology and energy-efficient multimodal devices. ",
    "url": "https://arxiv.org/abs/2202.04528",
    "authors": [
      "Leandro Aparecido Passos",
      "João Paulo Papa",
      "Amir Hussain",
      "Ahsan Adeel"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2202.04567",
    "title": "Optimal Hyperparameters and Structure Setting of Multi-Objective Robust  CNN Systems via Generalized Taguchi Method and Objective Vector Norm",
    "abstract": "Recently, Machine Learning (ML), Artificial Intelligence (AI), and Convolutional Neural Network (CNN) have made huge progress with broad applications, where their systems have deep learning structures and a large number of hyperparameters that determine the quality and performance of the CNNs and AI systems. These systems may have multi-objective ML and AI performance needs. There is a key requirement to find the optimal hyperparameters and structures for multi-objective robust optimal CNN systems. This paper proposes a generalized Taguchi approach to effectively determine the optimal hyperparameters and structure for the multi-objective robust optimal CNN systems via their objective performance vector norm. The proposed approach and methods are applied to a CNN classification system with the original ResNet for CIFAR-10 dataset as a demonstration and validation, which shows the proposed methods are highly effective to achieve an optimal accuracy rate of the original ResNet on CIFAR-10. ",
    "url": "https://arxiv.org/abs/2202.04567",
    "authors": [
      "Sheng-Guo Wang",
      "Shanshan Jiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2202.04579",
    "title": "Neural Sheaf Diffusion: A Topological Perspective on Heterophily and  Oversmoothing in GNNs",
    "abstract": "Cellular sheaves equip graphs with \"geometrical\" structure by assigning vector spaces and linear maps to nodes and edges. Graph Neural Networks (GNNs) implicitly assume a graph with a trivial underlying sheaf. This choice is reflected in the structure of the graph Laplacian operator, the properties of the associated diffusion equation, and the characteristics of the convolutional models that discretise this equation. In this paper, we use cellular sheaf theory to show that the underlying geometry of the graph is deeply linked with the performance of GNNs in heterophilic settings and their oversmoothing behaviour. By considering a hierarchy of increasingly general sheaves, we study how the ability of the sheaf diffusion process to achieve linear separation of the classes in the infinite time limit expands. At the same time, we prove that when the sheaf is non-trivial, discretised parametric diffusion processes have greater control than GNNs over their asymptotic behaviour. On the practical side, we study how sheaves can be learned from data. The resulting sheaf diffusion models have many desirable properties that address the limitations of classical graph diffusion equations (and corresponding GNN models) and obtain state-of-the-art results in heterophilic settings. Overall, our work provides new connections between GNNs and algebraic topology and would be of interest to both fields. ",
    "url": "https://arxiv.org/abs/2202.04579",
    "authors": [
      "Cristian Bodnar",
      "Francesco Di Giovanni",
      "Benjamin Paul Chamberlain",
      "Pietro Liò",
      "Michael M. Bronstein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Algebraic Topology (math.AT)"
    ]
  },
  {
    "id": "arXiv:2202.04586",
    "title": "Supporting Developers in Vulnerability Detection during Code Review:  Mental Attitude and Security Checklists",
    "abstract": "Reviewing source code from a security perspective has proven to be a difficult task. Indeed, previous research has shown that developers often miss even popular and easy-to-detect vulnerabilities during code review. Initial evidence suggests that a significant cause may lie in the reviewers' mental attitude and common practices. In this study, we investigate whether and how explicitly asking developers to focus on security during a code review affects the detection of vulnerabilities. Furthermore, we evaluate the effect of providing a security checklist to guide the security review. To this aim, we conduct an online experiment with 150 participants, of which 71% report to have three or more years of professional development experience. Our results show that simply asking reviewers to focus on security during the code review increases eight times the probability of vulnerability detection. The presence of a security checklist does not significantly improve the outcome further, even when the checklist is tailored to the change under review and the existing vulnerabilities in the change. These results provide evidence supporting the mental attitude hypothesis and call for further work on security checklists' effectiveness and design. Data and materials: https://doi.org/10.5281/zenodo.6026291 ",
    "url": "https://arxiv.org/abs/2202.04586",
    "authors": [
      "Larissa Braz",
      "Christian Aeberhard",
      "Gül Çalikli",
      "Alberto Bacchelli"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2202.04620",
    "title": "IoTMonitor: A Hidden Markov Model-based Security System to Identify  Crucial Attack Nodes in Trigger-action IoT Platforms",
    "abstract": "With the emergence and fast development of trigger-action platforms in IoT settings, security vulnerabilities caused by the interactions among IoT devices become more prevalent. The event occurrence at one device triggers an action in another device, which may eventually contribute to the creation of a chain of events in a network. Adversaries exploit the chain effect to compromise IoT devices and trigger actions of interest remotely just by injecting malicious events into the chain. To address security vulnerabilities caused by trigger-action scenarios, existing research efforts focus on the validation of the security properties of devices or verification of the occurrence of certain events based on their physical fingerprints on a device. We propose IoTMonitor, a security analysis system that discerns the underlying chain of event occurrences with the highest probability by observing a chain of physical evidence collected by sensors. We use the Baum-Welch algorithm to estimate transition and emission probabilities and the Viterbi algorithm to discern the event sequence. We can then identify the crucial nodes in the trigger-action sequence whose compromise allows attackers to reach their final goals. The experiment results of our designed system upon the PEEVES datasets show that we can rebuild the event occurrence sequence with high accuracy from the observations and identify the crucial nodes on the attack paths. ",
    "url": "https://arxiv.org/abs/2202.04620",
    "authors": [
      "Md Morshed Alam",
      "Md Sajidul Islam Sajid",
      "Weichao Wang",
      "Jinpeng Wei"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2202.04623",
    "title": "Graph Spectrum Based Seismic Survey Design",
    "abstract": "Randomized sampling techniques have become increasingly useful in seismic data acquisition and processing, allowing practitioners to achieve dense wavefield reconstruction from a substantially reduced number of field samples. However, typical designs studied in the low-rank matrix recovery and compressive sensing literature are difficult to achieve by standard industry hardware. For practical purposes, a compromise between stochastic and realizable samples is needed. In this paper, we propose a deterministic and computationally cheap tool to alleviate randomized acquisition design, prior to survey deployment and large-scale optimization. We consider universal and deterministic matrix completion results in the context of seismology, where a bipartite graph representation of the source-receiver layout allows for the respective spectral gap to act as a quality metric for wavefield reconstruction. We provide realistic survey design scenarios to demonstrate the utility of the spectral gap for successful seismic data acquisition via low-rank and sparse signal recovery. ",
    "url": "https://arxiv.org/abs/2202.04623",
    "authors": [
      "Oscar López",
      "Rajiv Kumar",
      "Nick Moldoveanu",
      "Felix Herrmann"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2202.04629",
    "title": "Reducing Redundancy in the Bottleneck Representation of the Autoencoders",
    "abstract": "Autoencoders are a type of unsupervised neural networks, which can be used to solve various tasks, e.g., dimensionality reduction, image compression, and image denoising. An AE has two goals: (i) compress the original input to a low-dimensional space at the bottleneck of the network topology using an encoder, (ii) reconstruct the input from the representation at the bottleneck using a decoder. Both encoder and decoder are optimized jointly by minimizing a distortion-based loss which implicitly forces the model to keep only those variations of input data that are required to reconstruct the and to reduce redundancies. In this paper, we propose a scheme to explicitly penalize feature redundancies in the bottleneck representation. To this end, we propose an additional loss term, based on the pair-wise correlation of the neurons, which complements the standard reconstruction loss forcing the encoder to learn a more diverse and richer representation of the input. We tested our approach across different tasks: dimensionality reduction using three different dataset, image compression using the MNIST dataset, and image denoising using fashion MNIST. The experimental results show that the proposed loss leads consistently to superior performance compared to the standard AE loss. ",
    "url": "https://arxiv.org/abs/2202.04629",
    "authors": [
      "Firas Laakom",
      "Jenni Raitoharju",
      "Alexandros Iosifidis",
      "Moncef Gabbouj"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2202.04632",
    "title": "A Local Geometric Interpretation of Feature Extraction in Deep  Feedforward Neural Networks",
    "abstract": "In this paper, we present a local geometric analysis to interpret how deep feedforward neural networks extract low-dimensional features from high-dimensional data. Our study shows that, in a local geometric region, the optimal weight in one layer of the neural network and the optimal feature generated by the previous layer comprise a low-rank approximation of a matrix that is determined by the Bayes action of this layer. This result holds (i) for analyzing both the output layer and the hidden layers of the neural network, and (ii) for neuron activation functions that are locally strictly increasing and continuously differentiable. We use two supervised learning problems to illustrate our results: neural network based maximum likelihood classification (i.e., logistic regression) and neural network based minimum mean square estimation. Experimental validation of these theoretical results will be conducted in our future work. ",
    "url": "https://arxiv.org/abs/2202.04632",
    "authors": [
      "Md Kamran Chowdhury Shisher",
      "Tasmeen Zaman Ornee",
      "Yin Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2202.04639",
    "title": "Point-Level Region Contrast for Object Detection Pre-Training",
    "abstract": "In this work we present point-level region contrast, a self-supervised pre-training approach for the task of object detection. This approach is motivated by the two key factors in detection: localization and recognition. While accurate localization favors models that operate at the pixel- or point-level, correct recognition typically relies on a more holistic, region-level view of objects. Incorporating this perspective in pre-training, our approach performs contrastive learning by directly sampling individual point pairs from different regions. Compared to an aggregated representation per region, our approach is more robust to the change in input region quality, and further enables us to implicitly improve initial region assignments via online knowledge distillation during training. Both advantages are important when dealing with imperfect regions encountered in the unsupervised setting. Experiments show point-level region contrast improves on state-of-the-art pre-training methods for object detection and segmentation across multiple tasks and datasets, and we provide extensive ablation studies and visualizations to aid understanding. Code will be made available. ",
    "url": "https://arxiv.org/abs/2202.04639",
    "authors": [
      "Yutong Bai",
      "Xinlei Chen",
      "Alexander Kirillov",
      "Alan Yuille",
      "Alexander C. Berg"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.05623",
    "title": "Existence, Stability and Scalability of Orthogonal Convolutional Neural  Networks",
    "abstract": "Imposing orthogonality on the layers of neural networks is known to facilitate the learning by limiting the exploding/vanishing of the gradient; decorrelate the features; improve the robustness. This paper studies theoretical properties of orthogonal convolutional layers. We establish necessary and sufficient conditions on the layer architecture guaranteeing the existence of an orthogonal convolutional transform. The conditions prove that orthogonal convolutional transforms exist for almost all architectures used in practice for 'circular' padding.We also exhibit limitations with 'valid' boundary condition and 'same' boundary condition with zero padding. Recently, a regularization term imposing the orthogonality of convolutional layers has been proposed, and impressive empirical results have been obtained in different applications (Wang et al. 2020).The second motivation of the present paper is to specify the theory behind this.We make the link between this regularization term and orthogonality measures. In doing so, we show that this regularization strategy is stable with respect to numerical and optimization errors and that, in the presence of small errors and when the size of the signal/image is large, the convolutional layers remain close to isometric.The theoretical results are confirmed with experiments, the landscape of the regularization term is studied and the regularization strategy is validated on real datasets. Altogether, the study guarantees that the regularization with L_{orth} (Wang et al. 2020) is an efficient, flexible and stable numerical strategy to learn orthogonal convolutional layers. ",
    "url": "https://arxiv.org/abs/2108.05623",
    "authors": [
      "El Mehdi Achour",
      "François Malgouyres",
      "Franck Mamalet"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.04206",
    "title": "Covariate-informed Representation Learning with Samplewise Optimal  Identifiable Variational Autoencoders",
    "abstract": "Recently proposed identifiable variational autoencoder (iVAE, Khemakhem et al. (2020)) framework provides a promising approach for learning latent independent components of the data. Although the identifiability is appealing, the objective function of iVAE does not enforce the inverse relation between encoders and decoders. Without the inverse relation, representations from the encoder in iVAE may not reconstruct observations,i.e., representations lose information in observations. To overcome this limitation, we develop a new approach, covariate-informed identifiable VAE (CI-iVAE). Different from previous iVAE implementations, our method critically leverages the posterior distribution of latent variables conditioned only on observations. In doing so, the objective function enforces the inverse relation, and learned representation contains more information of observations. Furthermore, CI-iVAE extends the original iVAE objective function to a larger class and finds the optimal one among them, thus providing a better fit to the data. Theoretically, our method has tighter evidence lower bounds (ELBOs) than the original iVAE. We demonstrate that our approach can more reliably learn features of various synthetic datasets, two benchmark image datasets (EMNIST and Fashion MNIST), and a large-scale brain imaging dataset for adolescent mental health research. ",
    "url": "https://arxiv.org/abs/2202.04206",
    "authors": [
      "Young-geun Kim",
      "Ying Liu",
      "Xuexin Wei"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04208",
    "title": "Evaluating Causal Inference Methods",
    "abstract": "The fundamental challenge of drawing causal inference is that counterfactual outcomes are not fully observed for any unit. Furthermore, in observational studies, treatment assignment is likely to be confounded. Many statistical methods have emerged for causal inference under unconfoundedness conditions given pre-treatment covariates, including propensity score-based methods, prognostic score-based methods, and doubly robust methods. Unfortunately for applied researchers, there is no `one-size-fits-all' causal method that can perform optimally universally. In practice, causal methods are primarily evaluated quantitatively on handcrafted simulated data. Such data-generative procedures can be of limited value because they are typically stylized models of reality. They are simplified for tractability and lack the complexities of real-world data. For applied researchers, it is critical to understand how well a method performs for the data at hand. Our work introduces a deep generative model-based framework, Credence, to validate causal inference methods. The framework's novelty stems from its ability to generate synthetic data anchored at the empirical distribution for the observed sample, and therefore virtually indistinguishable from the latter. The approach allows the user to specify ground truth for the form and magnitude of causal effects and confounding bias as functions of covariates. Thus simulated data sets are used to evaluate the potential performance of various causal estimation methods when applied to data similar to the observed sample. We demonstrate Credence's ability to accurately assess the relative performance of causal estimation techniques in an extensive simulation study and two real-world data applications from Lalonde and Project STAR studies. ",
    "url": "https://arxiv.org/abs/2202.04208",
    "authors": [
      "Harsh Parikh",
      "Carlos Varjao",
      "Louise Xu",
      "Eric Tchetgen Tchetgen"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Econometrics (econ.EM)"
    ]
  },
  {
    "id": "arXiv:2202.04233",
    "title": "Deep Neural Networks to Correct Sub-Precision Errors in CFD",
    "abstract": "Loss of information in numerical simulations can arise from various sources while solving discretized partial differential equations. In particular, precision-related errors can accumulate in the quantities of interest when the simulations are performed using low-precision 16-bit floating-point arithmetic compared to an equivalent 64-bit simulation. Here, low-precision computation requires much lower resources than high-precision computation. Several machine learning (ML) techniques proposed recently have been successful in correcting the errors arising from spatial discretization. In this work, we extend these techniques to improve Computational Fluid Dynamics (CFD) simulations performed using low numerical precision. We first quantify the precision related errors accumulated in a Kolmogorov forced turbulence test case. Subsequently, we employ a Convolutional Neural Network together with a fully differentiable numerical solver performing 16-bit arithmetic to learn a tightly-coupled ML-CFD hybrid solver. Compared to the 16-bit solver, we demonstrate the efficacy of the ML-CFD hybrid solver towards reducing the error accumulation in the velocity field and improving the kinetic energy spectrum at higher frequencies. ",
    "url": "https://arxiv.org/abs/2202.04233",
    "authors": [
      "Akash Haridas",
      "Nagabhushana Rao Vadlamani",
      "Yuki Minamoto"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2202.04238",
    "title": "Parametric t-Stochastic Neighbor Embedding With Quantum Neural Network",
    "abstract": "t-Stochastic Neighbor Embedding (t-SNE) is a non-parametric data visualization method in classical machine learning. It maps the data from the high-dimensional space into a low-dimensional space, especially a two-dimensional plane, while maintaining the relationship, or similarities, between the surrounding points. In t-SNE, the initial position of the low-dimensional data is randomly determined, and the visualization is achieved by moving the low-dimensional data to minimize a cost function. Its variant called parametric t-SNE uses neural networks for this mapping. In this paper, we propose to use quantum neural networks for parametric t-SNE to reflect the characteristics of high-dimensional quantum data on low-dimensional data. We use fidelity-based metrics instead of Euclidean distance in calculating high-dimensional data similarity. We visualize both classical (Iris dataset) and quantum (time-depending Hamiltonian dynamics) data for classification tasks. Since this method allows us to represent a quantum dataset in a higher dimensional Hilbert space by a quantum dataset in a lower dimension while keeping their similarity, the proposed method can also be used to compress quantum data for further quantum machine learning. ",
    "url": "https://arxiv.org/abs/2202.04238",
    "authors": [
      "Yoshiaki Kawase",
      "Kosuke Mitarai",
      "Keisuke Fujii"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04258",
    "title": "A Data-Driven Approach to Robust Hypothesis Testing Using Sinkhorn  Uncertainty Sets",
    "abstract": "This paper is eligible for the Jack Keil Wolf ISIT Student Paper Award. Hypothesis testing for small-sample scenarios is a practically important problem. In this paper, we investigate the robust hypothesis testing problem in a data-driven manner, where we seek the worst-case detector over distributional uncertainty sets centered around the empirical distribution from samples using Sinkhorn distance. Compared with the Wasserstein robust test, the corresponding least favorable distributions are supported beyond the training samples, which provides a more flexible detector. Various numerical experiments are conducted on both synthetic and real datasets to validate the competitive performances of our proposed method. ",
    "url": "https://arxiv.org/abs/2202.04258",
    "authors": [
      "Jie Wang",
      "Yao Xie"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04358",
    "title": "House Price Valuation Model Based on Geographically Neural Network  Weighted Regression: The Case Study of Shenzhen, China",
    "abstract": "Confronted with the spatial heterogeneity of real estate market, some traditional research utilized Geographically Weighted Regression (GWR) to estimate the house price. However, its kernel function is non-linear, elusive, and complex to opt bandwidth, the predictive power could also be improved. Consequently, a novel technique, Geographical Neural Network Weighted Regression (GNNWR), has been applied to improve the accuracy of real estate appraisal with the help of neural networks. Based on Shenzhen house price dataset, this work conspicuously captures the weight distribution of different variants at Shenzhen real estate market, which GWR is difficult to materialize. Moreover, we focus on the performance of GNNWR, verify its robustness and superiority, refine the experiment process with 10-fold cross-validation, extend its application area from natural to socioeconomic geospatial data. It's a practical and trenchant way to assess house price, and we demonstrate the effectiveness of GNNWR on a complex socioeconomic dataset. ",
    "url": "https://arxiv.org/abs/2202.04358",
    "authors": [
      "Zimo Wang",
      "Yicheng Wang",
      "Sensen Wu"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04378",
    "title": "A Measurement-Based Robust Non-Gaussian Process Emulator Applied to  Data-Driven Stochastic Power Flow",
    "abstract": "In this paper, we propose a robust non-Gaussian process emulator based on the Schweppe-type generalized maximum likelihood estimator, which is trained on metered time series of voltage phasors and power injections to perform stochastic power flow. Power system data are often corrupted with outliers caused by fault conditions, power outages, and extreme weather, to name a few. The proposed emulator bounds the influence of the outliers using weights calculated based on projection statistics, which are robust distances of the data points associated with the rows vectors of the factor space. Specifically, the developed estimator is robust to vertical outliers and bad leverage points while retaining good leverage points in the measurements of the training dataset. The proposed method is demonstrated on an unbalanced radial IEEE 33-Bus system heavily integrated with renewable energy sources. ",
    "url": "https://arxiv.org/abs/2202.04378",
    "authors": [
      "Pooja Algikar",
      "Yijun Xu",
      "Lamine Mili"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2202.04497",
    "title": "Recurrent Spectral Network (RSN): shaping the basin of attraction of a  discrete map to reach automated classification",
    "abstract": "A novel strategy to automated classification is introduced which exploits a fully trained dynamical system to steer items belonging to different categories toward distinct asymptotic attractors. These latter are incorporated into the model by taking advantage of the spectral decomposition of the operator that rules the linear evolution across the processing network. Non-linear terms act for a transient and allow to disentangle the data supplied as initial condition to the discrete dynamical system, shaping the boundaries of different attractors. The network can be equipped with several memory kernels which can be sequentially activated for serial datasets handling. Our novel approach to classification, that we here term Recurrent Spectral Network (RSN), is successfully challenged against a simple test-bed model, created for illustrative purposes, as well as a standard dataset for image processing training. ",
    "url": "https://arxiv.org/abs/2202.04497",
    "authors": [
      "Lorenzo Chicchi",
      "Duccio Fanelli",
      "Lorenzo Giambagli",
      "Lorenzo Buffoni",
      "Timoteo Carletti"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04499",
    "title": "Lightweight Jet Reconstruction and Identification as an Object Detection  Task",
    "abstract": "We apply object detection techniques based on deep convolutional blocks to end-to-end jet identification and reconstruction tasks encountered at the CERN Large Hadron Collider (LHC). Collision events produced at the LHC and represented as an image composed of calorimeter and tracker cells are given as an input to a Single Shot Detection network. The algorithm, named PFJet-SSD performs simultaneous localization, classification and regression tasks to cluster jets and reconstruct their features. This all-in-one single feed-forward pass gives advantages in terms of execution time and an improved accuracy w.r.t. traditional rule-based methods. A further gain is obtained from network slimming, homogeneous quantization, and optimized runtime for meeting memory and latency constraints of a typical real-time processing environment. We experiment with 8-bit and ternary quantization, benchmarking their accuracy and inference latency against a single-precision floating-point. We show that the ternary network closely matches the performance of its full-precision equivalent and outperforms the state-of-the-art rule-based algorithm. Finally, we report the inference latency on different hardware platforms and discuss future applications. ",
    "url": "https://arxiv.org/abs/2202.04499",
    "authors": [
      "Adrian Alan Pol",
      "Thea Aarrestad",
      "Ekaterina Govorkova",
      "Roi Halily",
      "Anat Klempner",
      "Tal Kopetz",
      "Vladimir Loncar",
      "Jennifer Ngadiuba",
      "Maurizio Pierini",
      "Olya Sirkin",
      "Sioni Summers"
    ],
    "subjectives": [
      "High Energy Physics - Experiment (hep-ex)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04506",
    "title": "Optimising hadronic collider simulations using amplitude neural networks",
    "abstract": "Precision phenomenological studies of high-multiplicity scattering processes at collider experiments present a substantial theoretical challenge and are vitally important ingredients in experimental measurements. Machine learning technology has the potential to dramatically optimise simulations for complicated final states. We investigate the use of neural networks to approximate matrix elements, studying the case of loop-induced diphoton production through gluon fusion. We train neural network models on one-loop amplitudes from the NJet C++ library and interface them with the Sherpa Monte Carlo event generator to provide the matrix element within a realistic hadronic collider simulation. Computing some standard observables with the models and comparing to conventional techniques, we find excellent agreement in the distributions and a reduced total simulation time by a factor of thirty. ",
    "url": "https://arxiv.org/abs/2202.04506",
    "authors": [
      "Ryan Moodie"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04517",
    "title": "End-to-End Blind Quality Assessment for Laparoscopic Videos using Neural  Networks",
    "abstract": "Video quality assessment is a challenging problem having a critical significance in the context of medical imaging. For instance, in laparoscopic surgery, the acquired video data suffers from different kinds of distortion that not only hinder surgery performance but also affect the execution of subsequent tasks in surgical navigation and robotic surgeries. For this reason, we propose in this paper neural network-based approaches for distortion classification as well as quality prediction. More precisely, a Residual Network (ResNet) based approach is firstly developed for simultaneous ranking and classification task. Then, this architecture is extended to make it appropriate for the quality prediction task by using an additional Fully Connected Neural Network (FCNN). To train the overall architecture (ResNet and FCNN models), transfer learning and end-to-end learning approaches are investigated. Experimental results, carried out on a new laparoscopic video quality database, have shown the efficiency of the proposed methods compared to recent conventional and deep learning based approaches. ",
    "url": "https://arxiv.org/abs/2202.04517",
    "authors": [
      "Zohaib Amjad Khan",
      "Azeddine Beghdadi",
      "Mounir Kaaniche",
      "Faouzi Alaya Cheikh",
      "Osama Gharbi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04592",
    "title": "Stability Analysis of Recurrent Neural Networks by IQC with Copositive  Mutipliers",
    "abstract": "This paper is concerned with the stability analysis of the recurrent neural networks (RNNs) by means of the integral quadratic constraint (IQC) framework. The rectified linear unit (ReLU) is typically employed as the activation function of the RNN, and the ReLU has specific nonnegativity properties regarding its input and output signals. Therefore, it is effective if we can derive IQC-based stability conditions with multipliers taking care of such nonnegativity properties. However, such nonnegativity (linear) properties are hardly captured by the existing multipliers defined on the positive semidefinite cone. To get around this difficulty, we loosen the standard positive semidefinite cone to the copositive cone, and employ copositive multipliers to capture the nonnegativity properties. We show that, within the framework of the IQC, we can employ copositive multipliers (or their inner approximation) together with existing multipliers such as Zames-Falb multipliers and polytopic bounding multipliers, and this directly enables us to ensure that the introduction of the copositive multipliers leads to better (no more conservative) results. We finally illustrate the effectiveness of the IQC-based stability conditions with the copositive multipliers by numerical examples. ",
    "url": "https://arxiv.org/abs/2202.04592",
    "authors": [
      "Yoshio Ebihara",
      "Hayato Waki",
      "Victor Magron",
      "Ngoc Hoang Anh Mai",
      "Dimitri Peaucelle",
      "Sophie Tarbouriech"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04595",
    "title": "Exploring Structural Sparsity in Neural Image Compression",
    "abstract": "Neural image compression have reached or out-performed traditional methods (such as JPEG, BPG, WebP). However,their sophisticated network structures with cascaded convolution layers bring heavy computational burden for practical deployment. In this paper, we explore the structural sparsity in neural image compression network to obtain real-time acceleration without any specialized hardware design or algorithm. We propose a simple plug-in adaptive binary channel masking(ABCM) to judge the importance of each convolution channel and introduce sparsity during training. During inference, the unimportant channels are pruned to obtain slimmer network and less computation. We implement our method into three neural image compression networks with different entropy models to verify its effectiveness and generalization, the experiment results show that up to 7x computation reduction and 3x acceleration can be achieved with negligible performance drop. ",
    "url": "https://arxiv.org/abs/2202.04595",
    "authors": [
      "Shanzhi Yin",
      "Fanyang Meng",
      "Wen Tan",
      "Chao Li",
      "Youneng Bao",
      "Yongsheng Liang",
      "Wei Liu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04641",
    "title": "Unconditionally secure digital signatures implemented in an 8-user  quantum network",
    "abstract": "The ability to know and verifiably demonstrate the origins of messages can often be as important as encrypting the message itself. Here we present an experimental demonstration of an unconditionally secure digital signature (USS) protocol implemented for the first time, to the best of our knowledge, on a fully connected quantum network without trusted nodes. Our USS protocol is secure against forging, repudiation and messages are transferrable. We show the feasibility of unconditionally secure signatures using only bi-partite entangled states distributed throughout the network and experimentally evaluate the performance of the protocol in real world scenarios with varying message lengths. ",
    "url": "https://arxiv.org/abs/2202.04641",
    "authors": [
      "Yoann Pelet",
      "Ittoop Vergheese Puthoor",
      "Natarajan Venkatachalam",
      "Sören Wengerowsky",
      "Martin Lončarić",
      "Sebastian Philipp Neumann",
      "Bo Liu",
      "Željko Samec",
      "Mario Stipčević",
      "Rupert Ursin",
      "Erika Andersson",
      "John G. Rarity",
      "Djeylan Aktas",
      "Siddarth Koduru Joshi"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:1908.11230",
    "title": "Defeating Misclassification Attacks Against Transfer Learning",
    "abstract": " Comments: This paper has been published in IEEE Transactions on Dependable and Secure Computing. this https URL ",
    "url": "https://arxiv.org/abs/1908.11230",
    "authors": [
      "Bang Wu",
      "Shuo Wang",
      "Xingliang Yuan",
      "Cong Wang",
      "Carsten Rudolph",
      "Xiangwen Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:1911.06226",
    "title": "Beyond Pairwise Comparisons in Social Choice: A Setwise Kemeny  Aggregation Problem",
    "abstract": " Comments: 36 pages, extends a work published at AAAI 2020. Compared to the previous version on arXiv, some notations have been changed, and section 5 has been added ",
    "url": "https://arxiv.org/abs/1911.06226",
    "authors": [
      "Hugo Gilbert",
      "Tom Portoleau",
      "Olivier Spanjaard"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2001.02658",
    "title": "Distributionally Robust Deep Learning using Hardness Weighted Sampling",
    "abstract": " Title: Distributionally Robust Deep Learning using Hardness Weighted Sampling ",
    "url": "https://arxiv.org/abs/2001.02658",
    "authors": [
      "Lucas Fidon",
      "Michael Aertsen",
      "Thomas Deprest",
      "Doaa Emam",
      "Frédéric Guffens",
      "Nada Mufti",
      "Esther Van Elslander",
      "Ernst Schwartz",
      "Michael Ebner",
      "Daniela Prayer",
      "Gregor Kasprian",
      "Anna L. David",
      "Andrew Melbourne",
      "Sébastien Ourselin",
      "Jan Deprest",
      "Georg Langs",
      "Tom Vercauteren"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2010.09343",
    "title": "SelfVoxeLO: Self-supervised LiDAR Odometry with Voxel-based Deep Neural  Networks",
    "abstract": " Comments: Accepted to CoRL 2020 ",
    "url": "https://arxiv.org/abs/2010.09343",
    "authors": [
      "Yan Xu",
      "Zhaoyang Huang",
      "Kwan-Yee Lin",
      "Xinge Zhu",
      "Jianping Shi",
      "Hujun Bao",
      "Guofeng Zhang",
      "Hongsheng Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2011.14195",
    "title": "A Recursive Algorithm for Mining Association Rules",
    "abstract": " Title: A Recursive Algorithm for Mining Association Rules ",
    "url": "https://arxiv.org/abs/2011.14195",
    "authors": [
      "Abdelkader Mokkadem",
      "Mariane Pelletier",
      "Louis Raimbault"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2012.02513",
    "title": "Complexity of fixed point counting problems in Boolean Networks",
    "abstract": " Comments: 47 pages ",
    "url": "https://arxiv.org/abs/2012.02513",
    "authors": [
      "Florian Bridoux",
      "Amélia Durbec",
      "Kévin Perrot",
      "Adrien Richard"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)",
      "Molecular Networks (q-bio.MN)"
    ]
  },
  {
    "id": "arXiv:2012.05473",
    "title": "Tensor Composition Net for Visual Relationship Prediction",
    "abstract": " Title: Tensor Composition Net for Visual Relationship Prediction ",
    "url": "https://arxiv.org/abs/2012.05473",
    "authors": [
      "Yuting Qiang",
      "Yongxin Yang",
      "Xueting Zhang",
      "Yanwen Guo",
      "Timothy M. Hospedales"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2101.00078",
    "title": "Controlled Analyses of Social Biases in Wikipedia Bios",
    "abstract": " Comments: Accepted to the Web Conference 2022 (WWW '22) ",
    "url": "https://arxiv.org/abs/2101.00078",
    "authors": [
      "Anjalie Field",
      "Chan Young Park",
      "Kevin Z. Lin",
      "Yulia Tsvetkov"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2103.05244",
    "title": "ModelingToolkit: A Composable Graph Transformation System For  Equation-Based Modeling",
    "abstract": " Comments: 10 pages, 3 figures, 1 table ",
    "url": "https://arxiv.org/abs/2103.05244",
    "authors": [
      "Yingbo Ma",
      "Shashi Gowda",
      "Ranjan Anantharaman",
      "Chris Laughman",
      "Viral Shah",
      "Chris Rackauckas"
    ],
    "subjectives": [
      "Mathematical Software (cs.MS)",
      "Symbolic Computation (cs.SC)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2105.02359",
    "title": "MODS -- A USV-oriented object detection and obstacle segmentation  benchmark",
    "abstract": " Comments: 16 pages, 15 figures. The dataset, as well as the proposed evaluation protocols, are published on our website: this https URL ",
    "url": "https://arxiv.org/abs/2105.02359",
    "authors": [
      "Borja Bovcon",
      "Jon Muhovič",
      "Duško Vranac",
      "Dean Mozetič",
      "Janez Perš",
      "Matej Kristan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.11166",
    "title": "AirNet: Neural Network Transmission over the Air",
    "abstract": " Title: AirNet: Neural Network Transmission over the Air ",
    "url": "https://arxiv.org/abs/2105.11166",
    "authors": [
      "Mikolaj Jankowski",
      "Deniz Gunduz",
      "Krystian Mikolajczyk"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.05824",
    "title": "Rare event estimation using stochastic spectral embedding",
    "abstract": " Title: Rare event estimation using stochastic spectral embedding ",
    "url": "https://arxiv.org/abs/2106.05824",
    "authors": [
      "P.-R. Wagner",
      "S. Marelli",
      "I. Papaioannou",
      "D. Straub",
      "B. Sudret"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation (stat.CO)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.06042",
    "title": "FedBABU: Towards Enhanced Representation for Federated Image  Classification",
    "abstract": " Comments: Published at ICLR 2022 ",
    "url": "https://arxiv.org/abs/2106.06042",
    "authors": [
      "Jaehoon Oh",
      "Sangmook Kim",
      "Se-Young Yun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.06733",
    "title": "LENAS: Learning-based Neural Architecture Search and Ensemble for 3D  Radiotherapy Dose Prediction",
    "abstract": " Title: LENAS: Learning-based Neural Architecture Search and Ensemble for 3D  Radiotherapy Dose Prediction ",
    "url": "https://arxiv.org/abs/2106.06733",
    "authors": [
      "Yi Lin",
      "Yanfei Liu",
      "Hao Chen",
      "Xin Yang",
      "Kai Ma",
      "Yefeng Zheng",
      "Kwang-Ting Cheng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.01700",
    "title": "End-to-end Neural Coreference Resolution Revisited: A Simple yet  Effective Baseline",
    "abstract": " Comments: Accepted by ICASSP 2022 ",
    "url": "https://arxiv.org/abs/2107.01700",
    "authors": [
      "Tuan Manh Lai",
      "Trung Bui",
      "Doo Soon Kim"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2108.01434",
    "title": "Wavelet-Based Network For High Dynamic Range Imaging",
    "abstract": " Title: Wavelet-Based Network For High Dynamic Range Imaging ",
    "url": "https://arxiv.org/abs/2108.01434",
    "authors": [
      "Tianhong Dai",
      "Wei Li",
      "Xilei Cao",
      "Jianzhuang Liu",
      "Xu Jia",
      "Ales Leonardis",
      "Youliang Yan",
      "Shanxin Yuan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.06975",
    "title": "Successful New-entry Prediction for Multi-Party Online Conversations via  Latent Topics and Discourse Modeling",
    "abstract": " Comments: Accepted by WWW 2022 ",
    "url": "https://arxiv.org/abs/2108.06975",
    "authors": [
      "Lingzhi Wang",
      "Jing Li",
      "Xingshan Zeng",
      "Kam-Fai Wong"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2109.00699",
    "title": "FBSNet: A Fast Bilateral Symmetrical Network for Real-Time Semantic  Segmentation",
    "abstract": " Comments: 11 pages, 7 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2109.00699",
    "authors": [
      "Guangwei Gao",
      "Guoan Xu",
      "Juncheng Li",
      "Yi Yu",
      "Huimin Lu",
      "Jian Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.02732",
    "title": "On Margin Maximization in Linear and ReLU Networks",
    "abstract": " Comments: This version includes: Some updates to the introduction; Focuses only on homogeneous networks ",
    "url": "https://arxiv.org/abs/2110.02732",
    "authors": [
      "Gal Vardi",
      "Ohad Shamir",
      "Nathan Srebro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.03442",
    "title": "A Comparison of Neural Network Architectures for Data-Driven  Reduced-Order Modeling",
    "abstract": " Title: A Comparison of Neural Network Architectures for Data-Driven  Reduced-Order Modeling ",
    "url": "https://arxiv.org/abs/2110.03442",
    "authors": [
      "Anthony Gruber",
      "Max Gunzburger",
      "Lili Ju",
      "Zhu Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2110.04004",
    "title": "Trident Pyramid Networks: The importance of processing at the feature  pyramid level for better object detection",
    "abstract": " Title: Trident Pyramid Networks: The importance of processing at the feature  pyramid level for better object detection ",
    "url": "https://arxiv.org/abs/2110.04004",
    "authors": [
      "Cédric Picron",
      "Tinne Tuytelaars"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.05428",
    "title": "Learning Temporally Causal Latent Processes from General Temporal Data",
    "abstract": " Comments: ICLR 2022: this https URL ",
    "url": "https://arxiv.org/abs/2110.05428",
    "authors": [
      "Weiran Yao",
      "Yuewen Sun",
      "Alex Ho",
      "Changyin Sun",
      "Kun Zhang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.06986",
    "title": "ADMM-DAD net: a deep unfolding network for analysis compressed sensing",
    "abstract": " Comments: to appear in 2022 International Conference on Acoustics, Speech and Signal Processing (ICASSP) ",
    "url": "https://arxiv.org/abs/2110.06986",
    "authors": [
      "Vasiliki Kouni",
      "Georgios Paraskevopoulos",
      "Holger Rauhut",
      "George C. Alexandropoulos"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.15777",
    "title": "GBK-GNN: Gated Bi-Kernel Graph Neural Networks for Modeling Both  Homophily and Heterophily",
    "abstract": " Comments: 9 pages, accepted by WWW'22 ",
    "url": "https://arxiv.org/abs/2110.15777",
    "authors": [
      "Lun Du",
      "Xiaozhou Shi",
      "Qiang Fu",
      "Xiaojun Ma",
      "Hengyu Liu",
      "Shi Han",
      "Dongmei Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.00108",
    "title": "High-dimensional multi-trait GWAS by reverse prediction of genotypes",
    "abstract": " Title: High-dimensional multi-trait GWAS by reverse prediction of genotypes ",
    "url": "https://arxiv.org/abs/2111.00108",
    "authors": [
      "Muhammad Ammar Malik",
      "Adriaan-Alexander Ludl",
      "Tom Michoel"
    ],
    "subjectives": [
      "Genomics (q-bio.GN)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2111.02671",
    "title": "GraphSearchNet: Enhancing GNNs via Capturing Global Dependency for  Semantic Code Search",
    "abstract": " Title: GraphSearchNet: Enhancing GNNs via Capturing Global Dependency for  Semantic Code Search ",
    "url": "https://arxiv.org/abs/2111.02671",
    "authors": [
      "Shangqing Liu",
      "Xiaofei Xie",
      "Jingkai Siow",
      "Lei Ma",
      "Guozhu Meng",
      "Yang Liu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.10639",
    "title": "Implicit Acoustic Echo Cancellation for Keyword Spotting and  Device-Directed Speech Detection",
    "abstract": " Comments: Submitted to INTERSPEECH 2022 ",
    "url": "https://arxiv.org/abs/2111.10639",
    "authors": [
      "Samuele Cornell",
      "Thomas Balestri",
      "Thibaud Sénéchal"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2111.13207",
    "title": "Characteristic Neural Ordinary Differential Equations",
    "abstract": " Title: Characteristic Neural Ordinary Differential Equations ",
    "url": "https://arxiv.org/abs/2111.13207",
    "authors": [
      "Xingzi Xu",
      "Ali Hasan",
      "Khalil Elkhalil",
      "Jie Ding",
      "Vahid Tarokh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.09071",
    "title": "Multitask Network for Respiration Rate Estimation -- A Practical  Perspective",
    "abstract": " Comments: Preprint ",
    "url": "https://arxiv.org/abs/2112.09071",
    "authors": [
      "Kapil Singh Rathore",
      "Sricharan Vijayarangan",
      "Preejith SP",
      "Mohanasankar Sivaprakasam"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03981",
    "title": "Demystifying the Vulnerability Propagation and Its Evolution via  Dependency Trees in the NPM Ecosystem",
    "abstract": " Title: Demystifying the Vulnerability Propagation and Its Evolution via  Dependency Trees in the NPM Ecosystem ",
    "url": "https://arxiv.org/abs/2201.03981",
    "authors": [
      "Chengwei Liu",
      "Sen Chen",
      "Lingling Fan",
      "Bihuan Chen",
      "Yang Liu",
      "Xin Peng"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2201.04584",
    "title": "ECONet: Efficient Convolutional Online Likelihood Network for  Scribble-based Interactive Segmentation",
    "abstract": " Comments: Under review at MIDL 2022 ",
    "url": "https://arxiv.org/abs/2201.04584",
    "authors": [
      "Muhammad Asad",
      "Lucas Fidon",
      "Tom Vercauteren"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.07076",
    "title": "Mitigating Misinformation Spread on Blockchain Enabled Social Media  Networks",
    "abstract": " Title: Mitigating Misinformation Spread on Blockchain Enabled Social Media  Networks ",
    "url": "https://arxiv.org/abs/2201.07076",
    "authors": [
      "Rui Luo",
      "Vikram Krishnamurthy",
      "Erik Blasch"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2201.08954",
    "title": "Change Detection from Synthetic Aperture Radar Images via Graph-Based  Knowledge Supplement Network",
    "abstract": " Comments: Accepted by IEEE JSTARS ",
    "url": "https://arxiv.org/abs/2201.08954",
    "authors": [
      "Junjie Wang",
      "Feng Gao",
      "Junyu Dong",
      "Shan Zhang",
      "Qian Du"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2201.11619",
    "title": "Positive First-order Logic on Words and Graphs",
    "abstract": " Comments: LMCS, extended version of LICS 2021. arXiv admin note: substantial text overlap with arXiv:2101.01968 ",
    "url": "https://arxiv.org/abs/2201.11619",
    "authors": [
      "Denis Kuperberg"
    ],
    "subjectives": [
      "Formal Languages and Automata Theory (cs.FL)",
      "Logic in Computer Science (cs.LO)",
      "Logic (math.LO)"
    ]
  },
  {
    "id": "arXiv:2201.11803",
    "title": "On the Convergence of Heterogeneous Federated Learning with Arbitrary  Adaptive Online Model Pruning",
    "abstract": " Title: On the Convergence of Heterogeneous Federated Learning with Arbitrary  Adaptive Online Model Pruning ",
    "url": "https://arxiv.org/abs/2201.11803",
    "authors": [
      "Hanhan Zhou",
      "Tian Lan",
      "Guru Venkataramani",
      "Wenbo Ding"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2201.12328",
    "title": "Toward Training at ImageNet Scale with Differential Privacy",
    "abstract": " Comments: 25 pages, 7 figures. Code available at this https URL ",
    "url": "https://arxiv.org/abs/2201.12328",
    "authors": [
      "Alexey Kurakin",
      "Shuang Song",
      "Steve Chien",
      "Roxana Geambasu",
      "Andreas Terzis",
      "Abhradeep Thakurta"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.01919",
    "title": "Theoretical Exploration of Solutions of Feedforward ReLU networks",
    "abstract": " Comments: v2,v3: hyperlink mode modified ",
    "url": "https://arxiv.org/abs/2202.01919",
    "authors": [
      "Changcun Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.02832",
    "title": "Detecting Melanoma Fairly: Skin Tone Detection and Debiasing for Skin  Lesion Classification",
    "abstract": " Comments: 8 pages ",
    "url": "https://arxiv.org/abs/2202.02832",
    "authors": [
      "Peter J. Bevan",
      "Amir Atapour-Abarghouei"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03126",
    "title": "Reasoning for Complex Data through Ensemble-based Self-Supervised  Learning",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2202.03126",
    "authors": [
      "Gabriel Bertocco",
      "Antônio Theófilo",
      "Fernanda Andaló",
      "Anderson Rocha"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03140",
    "title": "OPP-Miner: Order-preserving sequential pattern mining",
    "abstract": " Title: OPP-Miner: Order-preserving sequential pattern mining ",
    "url": "https://arxiv.org/abs/2202.03140",
    "authors": [
      "Youxi Wu",
      "Qian Hu",
      "Yan Li",
      "Lei Guo",
      "Xingquan Zhu",
      "Xindong Wu"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03289",
    "title": "Approximation error of single hidden layer neural networks with fixed  weights",
    "abstract": " Comments: 13 pages, main theorem's proof shortened, content improved ",
    "url": "https://arxiv.org/abs/2202.03289",
    "authors": [
      "Vugar Ismailov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Classical Analysis and ODEs (math.CA)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2202.03881",
    "title": "Robust Hybrid Learning With Expert Augmentation",
    "abstract": " Title: Robust Hybrid Learning With Expert Augmentation ",
    "url": "https://arxiv.org/abs/2202.03881",
    "authors": [
      "Antoine Wehenkel",
      "Jens Behrmann",
      "Hsiang Hsu",
      "Guillermo Sapiro",
      "Gilles Louppe",
      "Jörn-Henrik Jacobsen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2202.03884",
    "title": "GraphDCA -- a Framework for Node Distribution Comparison in Real and  Synthetic Graphs",
    "abstract": " Title: GraphDCA -- a Framework for Node Distribution Comparison in Real and  Synthetic Graphs ",
    "url": "https://arxiv.org/abs/2202.03884",
    "authors": [
      "Ciwan Ceylan",
      "Petra Poklukar",
      "Hanna Hultin",
      "Alexander Kravchenko",
      "Anastasia Varava",
      "Danica Kragic"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03903",
    "title": "KENN: Enhancing Deep Neural Networks by Leveraging Knowledge for Time  Series Forecasting",
    "abstract": " Title: KENN: Enhancing Deep Neural Networks by Leveraging Knowledge for Time  Series Forecasting ",
    "url": "https://arxiv.org/abs/2202.03903",
    "authors": [
      "Muhammad Ali Chattha",
      "Ludger van Elst",
      "Muhammad Imran Malik",
      "Andreas Dengel",
      "Sheraz Ahmed"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.03984",
    "title": "CausPref: Causal Preference Learning for Out-of-Distribution  Recommendation",
    "abstract": " Comments: WWW '22: The ACM Web Conference Proceedings ",
    "url": "https://arxiv.org/abs/2202.03984",
    "authors": [
      "Yue He",
      "Zimu Wang",
      "Peng Cui",
      "Hao Zou",
      "Yafeng Zhang",
      "Qiang Cui",
      "Yong Jiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04000",
    "title": "Learning Sinkhorn divergences for supervised change point detection",
    "abstract": " Comments: 19 pages, 13 figures ",
    "url": "https://arxiv.org/abs/2202.04000",
    "authors": [
      "Nauman Ahad",
      "Eva L. Dyer",
      "Keith B. Hengen",
      "Yao Xie",
      "Mark A. Davenport"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  }
]