[
  {
    "id": "arXiv:2204.09675",
    "title": "Optimize_Prime@DravidianLangTech-ACL2022: Abusive Comment Detection in  Tamil",
    "abstract": "This paper tries to address the problem of abusive comment detection in low-resource indic languages. Abusive comments are statements that are offensive to a person or a group of people. These comments are targeted toward individuals belonging to specific ethnicities, genders, caste, race, sexuality, etc. Abusive Comment Detection is a significant problem, especially with the recent rise in social media users. This paper presents the approach used by our team - Optimize_Prime, in the ACL 2022 shared task \"Abusive Comment Detection in Tamil.\" This task detects and classifies YouTube comments in Tamil and Tamil- English Codemixed format into multiple categories. We have used three methods to optimize our results: Ensemble models, Recurrent Neural Networks, and Transformers. In the Tamil data, MuRIL and XLM-RoBERTA were our best performing models with a macro-averaged f1 score of 0.43. Furthermore, for the Code-mixed data, MuRIL and M-BERT provided sub-lime results, with a macro-averaged f1 score of 0.45. ",
    "url": "https://arxiv.org/abs/2204.09675",
    "authors": [
      "Shantanu Patankar",
      "Omkar Gokhale",
      "Onkar Litake",
      "Aditya Mandke",
      "Dipali Kadam"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.09722",
    "title": "When Does Syntax Mediate Neural Language Model Performance? Evidence  from Dropout Probes",
    "abstract": "Recent causal probing literature reveals when language models and syntactic probes use similar representations. Such techniques may yield \"false negative\" causality results: models may use representations of syntax, but probes may have learned to use redundant encodings of the same syntactic information. We demonstrate that models do encode syntactic information redundantly and introduce a new probe design that guides probes to consider all syntactic information present in embeddings. Using these probes, we find evidence for the use of syntax in models where prior methods did not, allowing us to boost model performance by injecting syntactic information into representations. ",
    "url": "https://arxiv.org/abs/2204.09722",
    "authors": [
      "Mycal Tucker",
      "Tiwalayo Eisape",
      "Peng Qian",
      "Roger Levy",
      "Julie Shah"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.09726",
    "title": "Coverage Control for a Multi-robot Team with Heterogeneous Capabilities  using Block Coordinate Descent (BCD) Method",
    "abstract": "In this paper, we propose a coverage control system for a multi-robot team with heterogeneous capabilities to patrol or monitor a bounded environment. The capability could be defined as any criterion of robots like remaining power or mobile speed, depending on the purpose. The proposed control system aims to allocate different portions of the environment to the robots according to their capabilities, i.e., the robot with higher capability takes a larger portion of the environment while the robot with lower capability takes a smaller one. We use the block coordinate descent (BCD) method to optimize the location of portions and the partitioning method alternately. A centralized machine is used to synchronize the robots and the gradient of each robot can be computed in a distributed manner. Simulation results are provided to illustrate the performance of the proposed control system. ",
    "url": "https://arxiv.org/abs/2204.09726",
    "authors": [
      "Yung Yu Andy Yiu",
      "Ying Hing Yim",
      "Yan Ning",
      "Zikai Wang",
      "Ling Shi"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.09737",
    "title": "ARLIF-IDS -- Attention augmented Real-Time Isolation Forest Intrusion  Detection System",
    "abstract": "Distributed Denial of Service (DDoS) attack is a malicious attempt to disrupt the normal traffic of a targeted server, service or network by overwhelming the target or its surrounding infrastructure with a flood of Internet traffic. Emerging technologies such as the Internet of Things and Software Defined Networking leverage lightweight strategies for the early detection of DDoS attacks. Previous literature demonstrates the utility of lower number of significant features for intrusion detection. Thus, it is essential to have a fast and effective security identification model based on low number of features. In this work, a novel Attention-based Isolation Forest Intrusion Detection System is proposed. The model considerably reduces training time and memory consumption of the generated model. For performance assessment, the model is assessed over two benchmark datasets, the NSL-KDD dataset & the KDDCUP'99 dataset. Experimental results demonstrate that the proposed attention augmented model achieves a significant reduction in execution time, by 91.78%, and an average detection F1-Score of 0.93 on the NSL-KDD and KDDCUP'99 dataset. The results of performance evaluation show that the proposed methodology has low complexity and requires less processing time and computational resources, outperforming other current IDS based on machine learning algorithms. ",
    "url": "https://arxiv.org/abs/2204.09737",
    "authors": [
      "Aman Priyanshu",
      "Sarthak Shastri",
      "Sai Sravan Medicherla"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.09738",
    "title": "Res-CNN-BiLSTM Network for overcoming Mental Health Disturbances caused  due to Cyberbullying through Social Media",
    "abstract": "Mental Health Disturbance has many reasons and cyberbullying is one of the major causes that does exploitation using social media as an instrument. The cyberbullying is done on the basis of Religion, Ethnicity, Age and Gender which is a sensitive psychological issue. This can be addressed using Natural Language Processing with Deep Learning, since social media is the medium and it generates massive form of data in textual form. Such data can be leveraged to find the semantics and derive what type of cyberbullying is done and who are the people involved for early measures. Since deriving semantics is essential we proposed a Hybrid Deep Learning Model named 1-Dimensional CNN-Bidirectional-LSTMs with Residuals shortly known as Res-CNN-BiLSTM. In this paper we have proposed the architecture and compared its performance with different approaches of Embedding Deep Learning Algorithms. ",
    "url": "https://arxiv.org/abs/2204.09738",
    "authors": [
      "Raunak Joshi",
      "Abhishek Gupta",
      "Nandan Kanvinde"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.09754",
    "title": "Closed form optimized transmission conditions for complex diffusion with  many subdomains",
    "abstract": "Optimized transmission conditions in domain decomposition methods have been the focus of intensive research efforts over the past decade. Traditionally, transmission conditions are optimized for two subdomain model configurations, and then used in practice for many subdomains. We optimize here transmission conditions for the first time directly for many subdomains for a class of complex diffusion problems. Our asymptotic analysis leads to closed form optimized transmission conditions for many subdomains, and shows that the asymptotic best choice in the mesh size only differs from the two subdomain best choice in the constants, for which we derive the dependence on the number of subdomains explicitly, including the limiting case of an infinite number of subdomains, leading to new insight into scalability. Our results include both Robin and Ventcell transmission conditions, and we also optimize for the first time a two-sided Ventcell condition. We illustrate our results with numerical experiments, both for situations covered by our analysis and situations that go beyond. ",
    "url": "https://arxiv.org/abs/2204.09754",
    "authors": [
      "Victorita Dolean",
      "Martin J. Gander",
      "Alexandros Kyriakis"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2204.09773",
    "title": "Time-based Self-supervised Learning for Wireless Capsule Endoscopy",
    "abstract": "State-of-the-art machine learning models, and especially deep learning ones, are significantly data-hungry; they require vast amounts of manually labeled samples to function correctly. However, in most medical imaging fields, obtaining said data can be challenging. Not only the volume of data is a problem, but also the imbalances within its classes; it is common to have many more images of healthy patients than of those with pathology. Computer-aided diagnostic systems suffer from these issues, usually over-designing their models to perform accurately. This work proposes using self-supervised learning for wireless endoscopy videos by introducing a custom-tailored method that does not initially need labels or appropriate balance. We prove that using the inferred inherent structure learned by our method, extracted from the temporal axis, improves the detection rate on several domain-specific applications even under severe imbalance. ",
    "url": "https://arxiv.org/abs/2204.09773",
    "authors": [
      "Guillem Pascual",
      "Pablo Laiz",
      "Albert García",
      "Hagen Wenzek",
      "Jordi Vitrià",
      "Santi Seguí"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.09786",
    "title": "Evaluation of Robust Point Set Registration Applied to Automotive  Doppler Radar",
    "abstract": "Point set registration is the process of finding the best alignment between two point sets, and it is a common task in different domains, especially in the automotive and mobile robotics domains. Lots of approaches are proposed in the literature, where the iterative closest point ICP is a well-known approach in this vein, which builds an explicit correspondence between both point sets to achieve the registration task. However, this work is interested in achieving the registration without building any explicit correspondence between both point sets, following a probabilistic framework. The most critical task in point set registration is how to elaborate the cost function, which measures the distance between both point sets. The probabilistic framework includes two possible ways to build the cost function: The summing and the likelihood. The main focus of this work is to analyze and compare the behavior of both approaches. Therefore, a 1D synthetic scenario is used to build the cost function step by step, besides the estimation error. Finally, this work uses two data sets for evaluation: A 2D synthetic data set and a real data set. The evaluation process compares and analyzes the estimation error and estimated uncertainty. Thus, two different methods are used in the evaluation process: The normalized estimation error squared NEES and noncredibility index NCI. A 77 GHz automotive Doppler radar provides the real data set, and in the real evaluation, we evaluate the ego-motion estimation of a robot as an application for the registration. ",
    "url": "https://arxiv.org/abs/2204.09786",
    "authors": [
      "Karim Haggag"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.09797",
    "title": "Multiply-and-Fire (MNF): An Event-driven Sparse Neural Network  Accelerator",
    "abstract": "Machine learning, particularly deep neural network inference, has become a vital workload for many computing systems, from data centers and HPC systems to edge-based computing. As advances in sparsity have helped improve the efficiency of AI acceleration, there is a continued need for improved system efficiency for both high-performance and system-level acceleration. This work takes a unique look at sparsity with an event (or activation-driven) approach to ANN acceleration that aims to minimize useless work, improve utilization, and increase performance and energy efficiency. Our analytical and experimental results show that this event-driven solution presents a new direction to enable highly efficient AI inference for both CNN and MLP workloads. This work demonstrates state-of-the-art energy efficiency and performance centring on activation-based sparsity and a highly-parallel dataflow method that improves the overall functional unit utilization (at 30 fps). This work enhances energy efficiency over a state-of-the-art solution by 1.46$\\times$. Taken together, this methodology presents a novel, new direction to achieve high-efficiency, high-performance designs for next-generation AI acceleration platforms. ",
    "url": "https://arxiv.org/abs/2204.09797",
    "authors": [
      "Miao Yu",
      "Tingting Xiang",
      "Venkata Pavan Kumar Miriyala",
      "Trevor E. Carlson"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.09803",
    "title": "GUARD: Graph Universal Adversarial Defense",
    "abstract": "Recently, graph convolutional networks (GCNs) have shown to be vulnerable to small adversarial perturbations, which becomes a severe threat and largely limits their applications in security-critical scenarios. To mitigate such a threat, considerable research efforts have been devoted to increasing the robustness of GCNs against adversarial attacks. However, current approaches for defense are typically designed for the whole graph and consider the global performance, posing challenges in protecting important local nodes from stronger adversarial targeted attacks. In this work, we present a simple yet effective method, named \\textbf{\\underline{G}}raph \\textbf{\\underline{U}}niversal \\textbf{\\underline{A}}dve\\textbf{\\underline{R}}sarial \\textbf{\\underline{D}}efense (GUARD). Unlike previous works, GUARD protects each individual node from attacks with a universal defensive patch, which is generated once and can be applied to any node (node-agnostic) in a graph. Extensive experiments on four benchmark datasets demonstrate that our method significantly improves robustness for several established GCNs against multiple adversarial attacks and outperforms existing adversarial defense methods by large margins. Our code is publicly available at https://github.com/EdisonLeeeee/GUARD. ",
    "url": "https://arxiv.org/abs/2204.09803",
    "authors": [
      "Jintang Li",
      "Jie Liao",
      "Ruofan Wu",
      "Liang Chen",
      "Changhua Meng",
      "Zibin Zheng",
      "Weiqiang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.09804",
    "title": "Multimodal Gaussian Mixture Model for Realtime Roadside LiDAR Object  Detection",
    "abstract": "Background modeling is widely used for intelligent surveillance systems to detect the moving targets by subtracting the static background components. Most roadside LiDAR object detection methods filter out foreground points by comparing new points to pre-trained background references based on descriptive statistics over many frames (e.g., voxel density, slopes, maximum distance). These solutions are not efficient under heavy traffic, and parameter values are hard to transfer from one scenario to another. In early studies, the video-based background modeling methods were considered not suitable for roadside LiDAR surveillance systems due to the sparse and unstructured point clouds data. In this paper, the raw LiDAR data were transformed into a multi-dimensional tensor structure based on the elevation and azimuth value of each LiDAR point. With this high-order data representation, we break the barrier to allow the efficient Gaussian Mixture Model (GMM) method for roadside LiDAR background modeling. The probabilistic GMM is built with superior agility and real-time capability. The proposed Method was compared against two state-of-the-art roadside LiDAR background models and evaluated based on point level, object level, and path level, demonstrating better robustness under heavy traffic and challenging weather. This multimodal GMM method is capable of handling dynamic backgrounds with noisy measurements and substantially enhances the infrastructure-based LiDAR object detection, whereby various 3D modeling for smart city applications could be created ",
    "url": "https://arxiv.org/abs/2204.09804",
    "authors": [
      "Tianya Zhang",
      "Peter J. Jin",
      "Yi Ge"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.09821",
    "title": "Understanding AR Activism: An Interview Study with Creators of Augmented  Reality Experiences for Social Change",
    "abstract": "The rise of consumer augmented reality (AR) technology has opened up new possibilities for interventions intended to disrupt and subvert cultural conventions. From defacing corporate logos to erecting geofenced digital monuments, more and more people are creating AR experiences for social causes. We sought to understand this new form of activism, including why people use AR for these purposes, opportunities and challenges in using it, and how well it can support activist goals. We conducted semi-structured interviews with twenty people involved in projects that used AR for a social cause across six different countries. We found that AR can overcome physical world limitations of activism to convey immersive, multilayered narratives that aim to reveal invisible histories and perspectives. At the same time, people experienced challenges in creating, maintaining, and distributing their AR experiences to audiences. We discuss open questions and opportunities for creating AR tools and experiences for social change. ",
    "url": "https://arxiv.org/abs/2204.09821",
    "authors": [
      "Rafael M.L. Silva",
      "Erica Principe Cruz",
      "Daniela K. Rosner",
      "Dayton Kelly",
      "Andrés Monroy-Hernández",
      "Fannie Liu"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2204.09825",
    "title": "A Revealing Large-Scale Evaluation of Unsupervised Anomaly Detection  Algorithms",
    "abstract": "Anomaly detection has many applications ranging from bank-fraud detection and cyber-threat detection to equipment maintenance and health monitoring. However, choosing a suitable algorithm for a given application remains a challenging design decision, often informed by the literature on anomaly detection algorithms. We extensively reviewed twelve of the most popular unsupervised anomaly detection methods. We observed that, so far, they have been compared using inconsistent protocols - the choice of the class of interest or the positive class, the split of training and test data, and the choice of hyperparameters - leading to ambiguous evaluations. This observation led us to define a coherent evaluation protocol which we then used to produce an updated and more precise picture of the relative performance of the twelve methods on five widely used tabular datasets. While our evaluation cannot pinpoint a method that outperforms all the others on all datasets, it identifies those that stand out and revise misconceived knowledge about their relative performances. ",
    "url": "https://arxiv.org/abs/2204.09825",
    "authors": [
      "Maxime Alvarez",
      "Jean-Charles Verdier",
      "D'Jeff K. Nkashama",
      "Marc Frappier",
      "Pierre-Martin Tardif",
      "Froduald Kabanza"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.09829",
    "title": "Block Hunter: Federated Learning for Cyber Threat Hunting in  Blockchain-based IIoT Networks",
    "abstract": "Nowadays, blockchain-based technologies are being developed in various industries to improve data security. In the context of the Industrial Internet of Things (IIoT), a chain-based network is one of the most notable applications of blockchain technology. IIoT devices have become increasingly prevalent in our digital world, especially in support of developing smart factories. Although blockchain is a powerful tool, it is vulnerable to cyber attacks. Detecting anomalies in blockchain-based IIoT networks in smart factories is crucial in protecting networks and systems from unexpected attacks. In this paper, we use Federated Learning (FL) to build a threat hunting framework called Block Hunter to automatically hunt for attacks in blockchain-based IIoT networks. Block Hunter utilizes a cluster-based architecture for anomaly detection combined with several machine learning models in a federated environment. To the best of our knowledge, Block Hunter is the first federated threat hunting model in IIoT networks that identifies anomalous behavior while preserving privacy. Our results prove the efficiency of the Block Hunter in detecting anomalous activities with high accuracy and minimum required bandwidth. ",
    "url": "https://arxiv.org/abs/2204.09829",
    "authors": [
      "Abbas Yazdinejad",
      "Ali Dehghantanha",
      "Reza M. Parizi",
      "Mohammad Hammoudeh",
      "Hadis Karimipour",
      "Gautam Srivastava"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2204.09839",
    "title": "6GAN: IPv6 Multi-Pattern Target Generation via Generative Adversarial  Nets with Reinforcement Learning",
    "abstract": "Global IPv6 scanning has always been a challenge for researchers because of the limited network speed and computational power. Target generation algorithms are recently proposed to overcome the problem for Internet assessments by predicting a candidate set to scan. However, IPv6 custom address configuration emerges diverse addressing patterns discouraging algorithmic inference. Widespread IPv6 alias could also mislead the algorithm to discover aliased regions rather than valid host targets. In this paper, we introduce 6GAN, a novel architecture built with Generative Adversarial Net (GAN) and reinforcement learning for multi-pattern target generation. 6GAN forces multiple generators to train with a multi-class discriminator and an alias detector to generate non-aliased active targets with different addressing pattern types. The rewards from the discriminator and the alias detector help supervise the address sequence decision-making process. After adversarial training, 6GAN's generators could keep a strong imitating ability for each pattern and 6GAN's discriminator obtains outstanding pattern discrimination ability with a 0.966 accuracy. Experiments indicate that our work outperformed the state-of-the-art target generation algorithms by reaching a higher-quality candidate set. ",
    "url": "https://arxiv.org/abs/2204.09839",
    "authors": [
      "Tianyu Cui",
      "Gaopeng Gou",
      "Gang Xiong",
      "Chang Liu",
      "Peipei Fu",
      "Zhen Li"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.09848",
    "title": "Weakly Aligned Feature Fusion for Multimodal Object Detection",
    "abstract": "To achieve accurate and robust object detection in the real-world scenario, various forms of images are incorporated, such as color, thermal, and depth. However, multimodal data often suffer from the position shift problem, i.e., the image pair is not strictly aligned, making one object has different positions in different modalities. For the deep learning method, this problem makes it difficult to fuse multimodal features and puzzles the convolutional neural network (CNN) training. In this article, we propose a general multimodal detector named aligned region CNN (AR-CNN) to tackle the position shift problem. First, a region feature (RF) alignment module with adjacent similarity constraint is designed to consistently predict the position shift between two modalities and adaptively align the cross-modal RFs. Second, we propose a novel region of interest (RoI) jitter strategy to improve the robustness to unexpected shift patterns. Third, we present a new multimodal feature fusion method that selects the more reliable feature and suppresses the less useful one via feature reweighting. In addition, by locating bounding boxes in both modalities and building their relationships, we provide novel multimodal labeling named KAIST-Paired. Extensive experiments on 2-D and 3-D object detection, RGB-T, and RGB-D datasets demonstrate the effectiveness and robustness of our method. ",
    "url": "https://arxiv.org/abs/2204.09848",
    "authors": [
      "Lu Zhang",
      "Zhiyong Liu",
      "Xiangyu Zhu",
      "Zhan Song",
      "Xu Yang",
      "Zhen Lei",
      "Hong Qiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.09851",
    "title": "A Masked Image Reconstruction Network for Document-level Relation  Extraction",
    "abstract": "Document-level relation extraction aims to extract relations among entities within a document. Compared with its sentence-level counterpart, Document-level relation extraction requires inference over multiple sentences to extract complex relational triples. Previous research normally complete reasoning through information propagation on the mention-level or entity-level document-graphs, regardless of the correlations between the relationships. In this paper, we propose a novel Document-level Relation Extraction model based on a Masked Image Reconstruction network (DRE-MIR), which models inference as a masked image reconstruction problem to capture the correlations between relationships. Specifically, we first leverage an encoder module to get the features of entities and construct the entity-pair matrix based on the features. After that, we look on the entity-pair matrix as an image and then randomly mask it and restore it through an inference module to capture the correlations between the relationships. We evaluate our model on three public document-level relation extraction datasets, i.e. DocRED, CDR, and GDA. Experimental results demonstrate that our model achieves state-of-the-art performance on these three datasets and has excellent robustness against the noises during the inference process. ",
    "url": "https://arxiv.org/abs/2204.09851",
    "authors": [
      "Liang Zhang",
      "Yidong Cheng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.09854",
    "title": "Self-Supervised Learning to Guide Scientifically Relevant Categorization  of Martian Terrain Images",
    "abstract": "Automatic terrain recognition in Mars rover images is an important problem not just for navigation, but for scientists interested in studying rock types, and by extension, conditions of the ancient Martian paleoclimate and habitability. Existing approaches to label Martian terrain either involve the use of non-expert annotators producing taxonomies of limited granularity (e.g. soil, sand, bedrock, float rock, etc.), or rely on generic class discovery approaches that tend to produce perceptual classes such as rover parts and landscape, which are irrelevant to geologic analysis. Expert-labeled datasets containing granular geological/geomorphological terrain categories are rare or inaccessible to public, and sometimes require the extraction of relevant categorical information from complex annotations. In order to facilitate the creation of a dataset with detailed terrain categories, we present a self-supervised method that can cluster sedimentary textures in images captured from the Mast camera onboard the Curiosity rover (Mars Science Laboratory). We then present a qualitative analysis of these clusters and describe their geologic significance via the creation of a set of granular terrain categories. The precision and geologic validation of these automatically discovered clusters suggest that our methods are promising for the rapid classification of important geologic features and will therefore facilitate our long-term goal of producing a large, granular, and publicly available dataset for Mars terrain recognition. ",
    "url": "https://arxiv.org/abs/2204.09854",
    "authors": [
      "Tejas Panambur",
      "Deep Chakraborty",
      "Melissa Meyer",
      "Ralph Milliken",
      "Erik Learned-Miller",
      "Mario Parente"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.09874",
    "title": "Is Neural Topic Modelling Better than Clustering? An Empirical Study on  Clustering with Contextual Embeddings for Topics",
    "abstract": "Recent work incorporates pre-trained word embeddings such as BERT embeddings into Neural Topic Models (NTMs), generating highly coherent topics. However, with high-quality contextualized document representations, do we really need sophisticated neural models to obtain coherent and interpretable topics? In this paper, we conduct thorough experiments showing that directly clustering high-quality sentence embeddings with an appropriate word selecting method can generate more coherent and diverse topics than NTMs, achieving also higher efficiency and simplicity. ",
    "url": "https://arxiv.org/abs/2204.09874",
    "authors": [
      "Zihan Zhang",
      "Meng Fang",
      "Ling Chen",
      "Mohammad-Reza Namazi-Rad"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.09877",
    "title": "Non-autoregressive Model for Full-line Code Completion",
    "abstract": "Code completion tools are frequently used by software developers to accelerate software development by suggesting the following code elements. Completing a sequence of code tokens (e.g., a full line of code) has been proved more efficient than predicting a single token at a time. To complete the code sequence, researchers are employing AutoRegressive (AR) decoders to generate tokens in a left-to-right, token-by-token fashion. Consequently, the prediction of the next token depends on all previously generated tokens, which leads to high latency in inference. To improve the efficiency and accuracy of full-line code completion, in this paper, we propose a Non-AutoRegressive (NAR) model for code completion boosted by a syntax-aware sampling strategy. Our experimental results on two widely used datasets suggest that our model outperforms both AR and NAR baselines on full-line code completion, and it is faster than the AR model with up to 9 times speed-up. ",
    "url": "https://arxiv.org/abs/2204.09877",
    "authors": [
      "Fang Liu",
      "Zhiyi Fu",
      "Ge Li",
      "Zhi Jin",
      "Hui Liu",
      "Yiyang Hao"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.09888",
    "title": "Fairness in Graph Mining: A Survey",
    "abstract": "Graph mining algorithms have been playing a significant role in myriad fields over the years. However, despite their promising performance on various graph analytical tasks, most of these algorithms lack fairness considerations. As a consequence, they could lead to discrimination towards certain populations when exploited in human-centered applications. Recently, algorithmic fairness has been extensively studied in graph-based applications. In contrast to algorithmic fairness on independent and identically distributed (i.i.d.) data, fairness in graph mining has exclusive backgrounds, taxonomies, and fulfilling techniques. In this survey, we provide a comprehensive and up-to-date introduction of existing literature under the context of fair graph mining. Specifically, we propose a novel taxonomy of fairness notions on graphs, which sheds light on their connections and differences. We further present an organized summary of existing techniques that promote fairness in graph mining. Finally, we summarize the widely used datasets in this emerging research field and provide insights on current research challenges and open questions, aiming at encouraging cross-breeding ideas and further advances. ",
    "url": "https://arxiv.org/abs/2204.09888",
    "authors": [
      "Yushun Dong",
      "Jing Ma",
      "Chen Chen",
      "Jundong Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2204.09889",
    "title": "Inducing Gaussian Process Networks",
    "abstract": "Gaussian processes (GPs) are powerful but computationally expensive machine learning models, requiring an estimate of the kernel covariance matrix for every prediction. In large and complex domains, such as graphs, sets, or images, the choice of suitable kernel can also be non-trivial to determine, providing an additional obstacle to the learning task. Over the last decade, these challenges have resulted in significant advances being made in terms of scalability and expressivity, exemplified by, e.g., the use of inducing points and neural network kernel approximations. In this paper, we propose inducing Gaussian process networks (IGN), a simple framework for simultaneously learning the feature space as well as the inducing points. The inducing points, in particular, are learned directly in the feature space, enabling a seamless representation of complex structured domains while also facilitating scalable gradient-based learning methods. We consider both regression and (binary) classification tasks and report on experimental results for real-world data sets showing that IGNs provide significant advances over state-of-the-art methods. We also demonstrate how IGNs can be used to effectively model complex domains using neural network architectures. ",
    "url": "https://arxiv.org/abs/2204.09889",
    "authors": [
      "Alessandro Tibo",
      "Thomas Dyhre Nielsen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.09893",
    "title": "MAP-SNN: Mapping Spike Activities with Multiplicity, Adaptability, and  Plasticity into Bio-Plausible Spiking Neural Networks",
    "abstract": "Spiking Neural Network (SNN) is considered more biologically realistic and power-efficient as it imitates the fundamental mechanism of the human brain. Recently, backpropagation (BP) based SNN learning algorithms that utilize deep learning frameworks have achieved good performance. However, bio-interpretability is partially neglected in those BP-based algorithms. Toward bio-plausible BP-based SNNs, we consider three properties in modeling spike activities: Multiplicity, Adaptability, and Plasticity (MAP). In terms of multiplicity, we propose a Multiple-Spike Pattern (MSP) with multiple spike transmission to strengthen model robustness in discrete time-iteration. To realize adaptability, we adopt Spike Frequency Adaption (SFA) under MSP to decrease spike activities for improved efficiency. For plasticity, we propose a trainable convolutional synapse that models spike response current to enhance the diversity of spiking neurons for temporal feature extraction. The proposed SNN model achieves competitive performances on neuromorphic datasets: N-MNIST and SHD. Furthermore, experimental results demonstrate that the proposed three aspects are significant to iterative robustness, spike efficiency, and temporal feature extraction capability of spike activities. In summary, this work proposes a feasible scheme for bio-inspired spike activities with MAP, offering a new neuromorphic perspective to embed biological characteristics into spiking neural networks. ",
    "url": "https://arxiv.org/abs/2204.09893",
    "authors": [
      "Chengting Yu",
      "Yangkai Du",
      "Mufeng Chen",
      "Aili Wang",
      "Gaoang Wang",
      "Erping Li"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2204.09901",
    "title": "Joint Trajectory Design and User Scheduling of Aerial Cognitive Radio  Networks",
    "abstract": "Unmanned aerial vehicles (UAVs) have been widely employed to enhance the end-to-end performance of wireless communications since the links between UAVs and terrestrial nodes are line-of-sight (LoS) with high probability. However, the broadcast characteristics of signal propagation in LoS links make it vulnerable to being wiretapped by malicious eavesdroppers, which poses a considerable challenge to the security of wireless communications. This paper investigates the security of aerial cognitive radio networks (CRNs). An airborne base station transmits confidential messages to secondary users utilizing the same spectrum as the primary network. An aerial base station transmits jamming signals to suppress the eavesdropper to enhance secrecy performance. The uncertainty of eavesdropping node locations is considered, and the average secrecy rate of the cognitive user is maximized by optimizing multiple users' scheduling, the UAVs' trajectory, and transmit power. To solve the non-convex optimization problem with mixed multiple integers variable problem, we propose an iterative algorithm based on block coordinate descent and successive convex approximation. Numerical results verify the effectiveness of our proposed algorithm and demonstrate that our scheme is beneficial to improving the secrecy performance of aerial CRNs. ",
    "url": "https://arxiv.org/abs/2204.09901",
    "authors": [
      "Hongjiang Lei",
      "Haosi Yang",
      "Ki-Hong Park",
      "Imran Shafique Ansari",
      "Jing Jiang",
      "Mohamed-Slim Alouini"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.09911",
    "title": "STFT-Domain Neural Speech Enhancement with Very Low Algorithmic Latency",
    "abstract": "Deep learning based speech enhancement in the short-term Fourier transform (STFT) domain typically uses a large window length such as 32 ms. A larger window contains more samples and the frequency resolution can be higher for potentially better enhancement. This however incurs an algorithmic latency of 32 ms in an online setup, because the overlap-add algorithm used in the inverse STFT (iSTFT) is also performed based on the same 32 ms window size. To reduce this inherent latency, we adapt a conventional dual window size approach, where a regular input window size is used for STFT but a shorter output window is used for the overlap-add in the iSTFT, for STFT-domain deep learning based frame-online speech enhancement. Based on this STFT and iSTFT configuration, we employ single- or multi-microphone complex spectral mapping for frame-online enhancement, where a deep neural network (DNN) is trained to predict the real and imaginary (RI) components of target speech from the mixture RI components. In addition, we use the RI components predicted by the DNN to conduct frame-online beamforming, the results of which are then used as extra features for a second DNN to perform frame-online post-filtering. The frequency-domain beamforming in between the two DNNs can be easily integrated with complex spectral mapping and is designed to not incur any algorithmic latency. Additionally, we propose a future-frame prediction technique to further reduce the algorithmic latency. Evaluation results on a noisy-reverberant speech enhancement task demonstrate the effectiveness of the proposed algorithms. Compared with Conv-TasNet, our STFT-domain system can achieve better enhancement performance for a comparable amount of computation, or comparable performance with less computation, maintaining strong performance at an algorithmic latency as low as 2 ms. ",
    "url": "https://arxiv.org/abs/2204.09911",
    "authors": [
      "Zhong-Qiu Wang",
      "Gordon Wichern",
      "Shinji Watanabe",
      "Jonathan Le Roux"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.09914",
    "title": "CPGNet: Cascade Point-Grid Fusion Network for Real-Time LiDAR Semantic  Segmentation",
    "abstract": "LiDAR semantic segmentation essential for advanced autonomous driving is required to be accurate, fast, and easy-deployed on mobile platforms. Previous point-based or sparse voxel-based methods are far away from real-time applications since time-consuming neighbor searching or sparse 3D convolution are employed. Recent 2D projection-based methods, including range view and multi-view fusion, can run in real time, but suffer from lower accuracy due to information loss during the 2D projection. Besides, to improve the performance, previous methods usually adopt test time augmentation (TTA), which further slows down the inference process. To achieve a better speed-accuracy trade-off, we propose Cascade Point-Grid Fusion Network (CPGNet), which ensures both effectiveness and efficiency mainly by the following two techniques: 1) the novel Point-Grid (PG) fusion block extracts semantic features mainly on the 2D projected grid for efficiency, while summarizes both 2D and 3D features on 3D point for minimal information loss; 2) the proposed transformation consistency loss narrows the gap between the single-time model inference and TTA. The experiments on the SemanticKITTI and nuScenes benchmarks demonstrate that the CPGNet without ensemble models or TTA is comparable with the state-of-the-art RPVNet, while it runs 4.7 times faster. ",
    "url": "https://arxiv.org/abs/2204.09914",
    "authors": [
      "Xiaoyan Li",
      "Gang Zhang",
      "Hongyu Pan",
      "Zhenhua Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.09915",
    "title": "Do Human Mobility Network Analyses Produced from Different  Location-based Data Sources Yield Similar Results across Scales?",
    "abstract": "The burgeoning availability of sensing technology and location-based data is driving the expansion of analysis of human mobility networks in science and engineering research, as well as in epidemic forecasting and mitigation, urban planning, traffic engineering, emergency response, and business development. However, studies employ datasets provided by different location-based data providers, and the extent to which the human mobility measures and results obtained from different datasets are comparable is not known. To address this gap, in this study, we examined three prominent location-based data sources: Spectus, X-Mode, and Veraset to analyze human mobility networks across metropolitan areas at different scales: global, sub-structure, and microscopic. Dissimilar results were obtained from the three datasets, suggesting the sensitivity of network models and measures to datasets. This finding has important implications for building generalized theories of human mobility and urban dynamics based on different datasets. The findings also highlighted the need for ground-truthed human movement datasets to serve as the benchmark for testing the representativeness of human mobility datasets. Researchers and decision-makers across different fields of science and technology should recognize the sensitivity of human mobility results to dataset choice and develop procedures for ground-truthing the selected datasets in terms of representativeness of data points and transferability of results. ",
    "url": "https://arxiv.org/abs/2204.09915",
    "authors": [
      "Chia-Wei Hsu",
      "Chenyue Liu",
      "Kiet Minh Nguyen",
      "Yu-Heng Chien",
      "Ali Mostafavi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2204.09930",
    "title": "Multi-task recommendation system for scientific papers with high-way  networks",
    "abstract": "Finding and selecting the most relevant scientific papers from a large number of papers written in a research community is one of the key challenges for researchers these days. As we know, much information around research interest for scholars and academicians belongs to papers they read. Analysis and extracting contextual features from these papers could help us to suggest the most related paper to them. In this paper, we present a multi-task recommendation system (RS) that predicts a paper recommendation and generates its meta-data such as keywords. The system is implemented as a three-stage deep neural network encoder that tries to maps longer sequences of text to an embedding vector and learns simultaneously to predict the recommendation rate for a particular user and the paper's keywords. The motivation behind this approach is that the paper's topics expressed as keywords are a useful predictor of preferences of researchers. To achieve this goal, we use a system combination of RNNs, Highway and Convolutional Neural Networks to train end-to-end a context-aware collaborative matrix. Our application uses Highway networks to train the system very deep, combine the benefits of RNN and CNN to find the most important factor and make latent representation. Highway Networks allow us to enhance the traditional RNN and CNN pipeline by learning more sophisticated semantic structural representations. Using this method we can also overcome the cold start problem and learn latent features over large sequences of text. ",
    "url": "https://arxiv.org/abs/2204.09930",
    "authors": [
      "Aram Karimi",
      "Simon Dobnik"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.09942",
    "title": "Hybrid Cloud-Edge Collaborative Data Anomaly Detection in Industrial  Sensor Networks",
    "abstract": "Industrial control systems (ICSs) are facing increasing cyber-physical attacks that can cause catastrophes in the physical system. Efficient anomaly detection models in the industrial sensor networks are essential for enhancing ICS reliability and security, due to the sensor data is related to the operational state of the ICS. Considering the limited availability of computing resources, this paper proposes a hybrid anomaly detection approach in cloud-edge collaboration industrial sensor networks. The hybrid approach consists of sensor data detection models deployed at the edges and a sensor data analysis model deployed in the cloud. The sensor data detection model based on Gaussian and Bayesian algorithms can detect the anomalous sensor data in real-time and upload them to the cloud for further analysis, filtering the normal sensor data and reducing traffic load. The sensor data analysis model based on Graph convolutional network, Residual algorithm and Long short-term memory network (GCRL) can effectively extract the spatial and temporal features and then identify the attack precisely. The proposed hybrid anomaly detection approach is evaluated using a benchmark dataset and baseline anomaly detection models. The experimental results show that the proposed approach can achieve an overall 11.19% increase in Recall and an impressive 14.29% improvement in F1-score, compared with the existing models. ",
    "url": "https://arxiv.org/abs/2204.09942",
    "authors": [
      "Tao Yang",
      "Jinming Wang",
      "Weijie Hao",
      "Qiang Yang",
      "Wenhai Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.09945",
    "title": "Active Learning of Discriminative Subgraph Patterns for API Misuse  Detection",
    "abstract": "A common cause of bugs and vulnerabilities are the violations of usage constraints associated with Application Programming Interfaces (APIs). API misuses are common in software projects, and while there have been techniques proposed to detect such misuses, studies have shown that they fail to reliably detect misuses while reporting many false positives. One limitation of prior work is the inability to reliably identify correct patterns of usage. Many approaches confuse a usage pattern's frequency for correctness. Due to the variety of alternative usage patterns that may be uncommon but correct, anomaly detection-based techniques have limited success in identifying misuses. We address these challenges and propose ALP (Actively Learned Patterns), reformulating API misuse detection as a classification problem. After representing programs as graphs, ALP mines discriminative subgraphs. While still incorporating frequency information, through limited human supervision, we reduce the reliance on the assumption relating frequency and correctness. The principles of active learning are incorporated to shift human attention away from the most frequent patterns. Instead, ALP samples informative and representative examples while minimizing labeling effort. In our empirical evaluation, ALP substantially outperforms prior approaches on both MUBench, an API Misuse benchmark, and a new dataset that we constructed from real-world software projects. ",
    "url": "https://arxiv.org/abs/2204.09945",
    "authors": [
      "Hong Jin Kang",
      "David Lo"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.09954",
    "title": "Domain Invariant Model with Graph Convolutional Network for Mammogram  Classification",
    "abstract": "Due to its safety-critical property, the image-based diagnosis is desired to achieve robustness on out-of-distribution (OOD) samples. A natural way towards this goal is capturing only clinically disease-related features, which is composed of macroscopic attributes (e.g., margins, shapes) and microscopic image-based features (e.g., textures) of lesion-related areas. However, such disease-related features are often interweaved with data-dependent (but disease irrelevant) biases during learning, disabling the OOD generalization. To resolve this problem, we propose a novel framework, namely Domain Invariant Model with Graph Convolutional Network (DIM-GCN), which only exploits invariant disease-related features from multiple domains. Specifically, we first propose a Bayesian network, which explicitly decomposes the latent variables into disease-related and other disease-irrelevant parts that are provable to be disentangled from each other. Guided by this, we reformulate the objective function based on Variational Auto-Encoder, in which the encoder in each domain has two branches: the domain-independent and -dependent ones, which respectively encode disease-related and -irrelevant features. To better capture the macroscopic features, we leverage the observed clinical attributes as a goal for reconstruction, via Graph Convolutional Network (GCN). Finally, we only implement the disease-related features for prediction. The effectiveness and utility of our method are demonstrated by the superior OOD generalization performance over others on mammogram benign/malignant diagnosis. ",
    "url": "https://arxiv.org/abs/2204.09954",
    "authors": [
      "Churan Wang",
      "Jing Li",
      "Xinwei Sun",
      "Fandong Zhang",
      "Yizhou Yu",
      "Yizhou Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.09958",
    "title": "RIS-Assisted Vehicular Network with Direct Transmission over  Double-Generalized Gamma Fading Channels",
    "abstract": "Reconfigurable intelligent surface (RIS) can provide stable connectivity for vehicular communications when direct transmission becomes significantly weaker with dynamic channel conditions between an access point and a moving vehicle. In this paper, we analyze the performance of a RIS-assisted vehicular network by coherently combining received signals reflected by RIS elements and direct transmissions from the source terminal over double generalized Gamma (dGG) fading channels. We present analytical expressions on the outage probability and average bit-error rate (BER) performance of the considered system by deriving exact density and distribution functions for the end-to-end signal-to-noise ratio (SNR) resulted from the finite sum of the direct link and product of channel coefficients each distributed according to the dGG. We also develop asymptotic analysis on the outage probability and average BER to derive diversity order for a better insight into the system performance at high SNR. We validate the derived analytical expressions through numerical and simulation results and demonstrate scaling of the system performance with RIS elements and a comparison to the conventional relaying techniques and direct transmissions considering various practically relevant scenarios. ",
    "url": "https://arxiv.org/abs/2204.09958",
    "authors": [
      "Vinay Kumar Chapala",
      "Arsalan Malik",
      "S.M.Zafaruddin"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.09962",
    "title": "ChildPredictor: A Child Face Prediction Framework with Disentangled  Learning",
    "abstract": "The appearances of children are inherited from their parents, which makes it feasible to predict them. Predicting realistic children's faces may help settle many social problems, such as age-invariant face recognition, kinship verification, and missing child identification. It can be regarded as an image-to-image translation task. Existing approaches usually assume domain information in the image-to-image translation can be interpreted by \"style\", i.e., the separation of image content and style. However, such separation is improper for the child face prediction, because the facial contours between children and parents are not the same. To address this issue, we propose a new disentangled learning strategy for children's face prediction. We assume that children's faces are determined by genetic factors (compact family features, e.g., face contour), external factors (facial attributes irrelevant to prediction, such as moustaches and glasses), and variety factors (individual properties for each child). On this basis, we formulate predictions as a mapping from parents' genetic factors to children's genetic factors, and disentangle them from external and variety factors. In order to obtain accurate genetic factors and perform the mapping, we propose a ChildPredictor framework. It transfers human faces to genetic factors by encoders and back by generators. Then, it learns the relationship between the genetic factors of parents and children through a mapping function. To ensure the generated faces are realistic, we collect a large Family Face Database to train ChildPredictor and evaluate it on the FF-Database validation set. Experimental results demonstrate that ChildPredictor is superior to other well-known image-to-image translation methods in predicting realistic and diverse child faces. Implementation codes can be found at https://github.com/zhaoyuzhi/ChildPredictor. ",
    "url": "https://arxiv.org/abs/2204.09962",
    "authors": [
      "Yuzhi Zhao",
      "Lai-Man Po",
      "Xuehui Wang",
      "Qiong Yan",
      "Wei Shen",
      "Yujia Zhang",
      "Wei Liu",
      "Chun-Kit Wong",
      "Chiu-Sing Pang",
      "Weifeng Ou",
      "Wing-Yin Yu",
      "Buhua Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.09964",
    "title": "TEAM-Atreides at SemEval-2022 Task 11: On leveraging data augmentation  and ensemble to recognize complex Named Entities in Bangla",
    "abstract": "Many areas, such as the biological and healthcare domain, artistic works, and organization names, have nested, overlapping, discontinuous entity mentions that may even be syntactically or semantically ambiguous in practice. Traditional sequence tagging algorithms are unable to recognize these complex mentions because they may violate the assumptions upon which sequence tagging schemes are founded. In this paper, we describe our contribution to SemEval 2022 Task 11 on identifying such complex Named Entities. We have leveraged the ensemble of multiple ELECTRA-based models that were exclusively pretrained on the Bangla language with the performance of ELECTRA-based models pretrained on English to achieve competitive performance on the Track-11. Besides providing a system description, we will also present the outcomes of our experiments on architectural decisions, dataset augmentations, and post-competition findings. ",
    "url": "https://arxiv.org/abs/2204.09964",
    "authors": [
      "Nazia Tasnim",
      "Md. Istiak Hossain Shihab",
      "Asif Shahriyar Sushmit",
      "Steven Bethard",
      "Farig Sadeque"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.09967",
    "title": "Transformer-Guided Convolutional Neural Network for Cross-View  Geolocalization",
    "abstract": "Ground-to-aerial geolocalization refers to localizing a ground-level query image by matching it to a reference database of geo-tagged aerial imagery. This is very challenging due to the huge perspective differences in visual appearances and geometric configurations between these two views. In this work, we propose a novel Transformer-guided convolutional neural network (TransGCNN) architecture, which couples CNN-based local features with Transformer-based global representations for enhanced representation learning. Specifically, our TransGCNN consists of a CNN backbone extracting feature map from an input image and a Transformer head modeling global context from the CNN map. In particular, our Transformer head acts as a spatial-aware importance generator to select salient CNN features as the final feature representation. Such a coupling procedure allows us to leverage a lightweight Transformer network to greatly enhance the discriminative capability of the embedded features. Furthermore, we design a dual-branch Transformer head network to combine image features from multi-scale windows in order to improve details of the global feature representation. Extensive experiments on popular benchmark datasets demonstrate that our model achieves top-1 accuracy of 94.12\\% and 84.92\\% on CVUSA and CVACT_val, respectively, which outperforms the second-performing baseline with less than 50% parameters and almost 2x higher frame rate, therefore achieving a preferable accuracy-efficiency tradeoff. ",
    "url": "https://arxiv.org/abs/2204.09967",
    "authors": [
      "Teng Wang",
      "Shujuan Fan",
      "Daikun Liu",
      "Changyin Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.09973",
    "title": "Merging of neural networks",
    "abstract": "We propose a simple scheme for merging two neural networks trained with different starting initialization into a single one with the same size as the original ones. We do this by carefully selecting channels from each input network. Our procedure might be used as a finalization step after one tries multiple starting seeds to avoid an unlucky one. We also show that training two networks and merging them leads to better performance than training a single network for an extended period of time. Availability: https://github.com/fmfi-compbio/neural-network-merging ",
    "url": "https://arxiv.org/abs/2204.09973",
    "authors": [
      "Martin Pašen",
      "Vladimír Boža"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.09975",
    "title": "Eliminating Backdoor Triggers for Deep Neural Networks Using Attention  Relation Graph Distillation",
    "abstract": "Due to the prosperity of Artificial Intelligence (AI) techniques, more and more backdoors are designed by adversaries to attack Deep Neural Networks (DNNs).Although the state-of-the-art method Neural Attention Distillation (NAD) can effectively erase backdoor triggers from DNNs, it still suffers from non-negligible Attack Success Rate (ASR) together with lowered classification ACCuracy (ACC), since NAD focuses on backdoor defense using attention features (i.e., attention maps) of the same order. In this paper, we introduce a novel backdoor defense framework named Attention Relation Graph Distillation (ARGD), which fully explores the correlation among attention features with different orders using our proposed Attention Relation Graphs (ARGs). Based on the alignment of ARGs between both teacher and student models during knowledge distillation, ARGD can eradicate more backdoor triggers than NAD. Comprehensive experimental results show that, against six latest backdoor attacks, ARGD outperforms NAD by up to 94.85% reduction in ASR, while ACC can be improved by up to 3.23%. ",
    "url": "https://arxiv.org/abs/2204.09975",
    "authors": [
      "Jun Xia",
      "Ting Wang",
      "Jieping Ding",
      "Xian Wei",
      "Mingsong Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.09976",
    "title": "Baseline Systems for the First Spoofing-Aware Speaker Verification  Challenge: Score and Embedding Fusion",
    "abstract": "Deep learning has brought impressive progress in the study of both automatic speaker verification (ASV) and spoofing countermeasures (CM). Although solutions are mutually dependent, they have typically evolved as standalone sub-systems whereby CM solutions are usually designed for a fixed ASV system. The work reported in this paper aims to gauge the improvements in reliability that can be gained from their closer integration. Results derived using the popular ASVspoof2019 dataset indicate that the equal error rate (EER) of a state-of-the-art ASV system degrades from 1.63% to 23.83% when the evaluation protocol is extended with spoofed trials.%subjected to spoofing attacks. However, even the straightforward integration of ASV and CM systems in the form of score-sum and deep neural network-based fusion strategies reduce the EER to 1.71% and 6.37%, respectively. The new Spoofing-Aware Speaker Verification (SASV) challenge has been formed to encourage greater attention to the integration of ASV and CM systems as well as to provide a means to benchmark different solutions. ",
    "url": "https://arxiv.org/abs/2204.09976",
    "authors": [
      "Hye-jin Shim",
      "Hemlata Tak",
      "Xuechen Liu",
      "Hee-Soo Heo",
      "Jee-weon Jung",
      "Joon Son Chung",
      "Soo-Whan Chung",
      "Ha-Jin Yu",
      "Bong-Jin Lee",
      "Massimiliano Todisco",
      "Héctor Delgado",
      "Kong Aik Lee",
      "Md Sahidullah",
      "Tomi Kinnunen",
      "Nicholas Evans"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.09983",
    "title": "DGECN: A Depth-Guided Edge Convolutional Network for End-to-End 6D Pose  Estimation",
    "abstract": "Monocular 6D pose estimation is a fundamental task in computer vision. Existing works often adopt a two-stage pipeline by establishing correspondences and utilizing a RANSAC algorithm to calculate 6 degrees-of-freedom (6DoF) pose. Recent works try to integrate differentiable RANSAC algorithms to achieve an end-to-end 6D pose estimation. However, most of them hardly consider the geometric features in 3D space, and ignore the topology cues when performing differentiable RANSAC algorithms. To this end, we proposed a Depth-Guided Edge Convolutional Network (DGECN) for 6D pose estimation task. We have made efforts from the following three aspects: 1) We take advantages ofestimated depth information to guide both the correspondences-extraction process and the cascaded differentiable RANSAC algorithm with geometric information. 2)We leverage the uncertainty ofthe estimated depth map to improve accuracy and robustness ofthe output 6D pose. 3) We propose a differentiable Perspective-n-Point(PnP) algorithm via edge convolution to explore the topology relations between 2D-3D correspondences. Experiments demonstrate that our proposed network outperforms current works on both effectiveness and efficiency. ",
    "url": "https://arxiv.org/abs/2204.09983",
    "authors": [
      "Tuo Cao",
      "Fei Luo",
      "Yanping Fu",
      "Wenxiao Zhang",
      "Shengjie Zheng",
      "Chunxia Xiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.09989",
    "title": "NAND-SPIN-Based Processing-in-MRAM Architecture for Convolutional Neural  Network Acceleration",
    "abstract": "The performance and efficiency of running large-scale datasets on traditional computing systems exhibit critical bottlenecks due to the existing \"power wall\" and \"memory wall\" problems. To resolve those problems, processing-in-memory (PIM) architectures are developed to bring computation logic in or near memory to alleviate the bandwidth limitations during data transmission. NAND-like spintronics memory (NAND-SPIN) is one kind of promising magnetoresistive random-access memory (MRAM) with low write energy and high integration density, and it can be employed to perform efficient in-memory computation operations. In this work, we propose a NAND-SPIN-based PIM architecture for efficient convolutional neural network (CNN) acceleration. A straightforward data mapping scheme is exploited to improve the parallelism while reducing data movements. Benefiting from the excellent characteristics of NAND-SPIN and in-memory processing architecture, experimental results show that the proposed approach can achieve $\\sim$2.6$\\times$ speedup and $\\sim$1.4$\\times$ improvement in energy efficiency over state-of-the-art PIM solutions. ",
    "url": "https://arxiv.org/abs/2204.09989",
    "authors": [
      "Yinglin Zhao",
      "Jianlei Yang",
      "Bing Li",
      "Xingzhou Cheng",
      "Xucheng Ye",
      "Xueyan Wang",
      "Xiaotao Jia",
      "Zhaohao Wang",
      "Youguang Zhang",
      "Weisheng Zhao"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2204.09994",
    "title": "A data filling methodology for time series based on CNN and (Bi)LSTM  neural networks",
    "abstract": "In the process of collecting data from sensors, several circumstances can affect their continuity and validity, resulting in alterations of the data or loss of information. Although classical methods of statistics, such as interpolation-like techniques, can be used to approximate the missing data in a time series, the recent developments in Deep Learning (DL) have given impetus to innovative and much more accurate forecasting techniques. In the present paper, we develop two DL models aimed at filling data gaps, for the specific case of internal temperature time series obtained from monitored apartments located in Bolzano, Italy. The DL models developed in the present work are based on the combination of Convolutional Neural Networks (CNNs), Long Short-Term Memory Neural Networks (LSTMs), and Bidirectional LSTMs (BiLSTMs). Two key features of our models are the use of both pre- and post-gap data, and the exploitation of a correlated time series (the external temperature) in order to predict the target one (the internal temperature). Our approach manages to capture the fluctuating nature of the data and shows good accuracy in reconstructing the target time series. In addition, our models significantly improve the already good results from another DL architecture that is used as a baseline for the present work. ",
    "url": "https://arxiv.org/abs/2204.09994",
    "authors": [
      "Kostas Tzoumpas",
      "Aaron Estrada",
      "Pietro Miraglio",
      "Pietro Zambelli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10007",
    "title": "Fluctuation-based Outlier Detection",
    "abstract": "Outlier detection is an important topic in machine learning and has been used in a wide range of applications. Outliers are objects that are few in number and deviate from the majority of objects. As a result of these two properties, we show that outliers are susceptible to a mechanism called fluctuation. This article proposes a method called fluctuation-based outlier detection (FBOD) that achieves a low linear time complexity and detects outliers purely based on the concept of fluctuation without employing any distance, density or isolation measure. Fundamentally different from all existing methods. FBOD first converts the Euclidean structure datasets into graphs by using random links, then propagates the feature value according to the connection of the graph. Finally, by comparing the difference between the fluctuation of an object and its neighbors, FBOD determines the object with a larger difference as an outlier. The results of experiments comparing FBOD with seven state-of-the-art algorithms on eight real-world tabular datasets and three video datasets show that FBOD outperforms its competitors in the majority of cases and that FBOD has only 5% of the execution time of the fastest algorithm. The experiment codes are available at: https://github.com/FluctuationOD/Fluctuation-based-Outlier-Detection. ",
    "url": "https://arxiv.org/abs/2204.10007",
    "authors": [
      "Xusheng Du",
      "Enguang Zuo",
      "Zhenzhen He",
      "Jiong Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10011",
    "title": "MedFACT: Modeling Medical Feature Correlations in Patient Health  Representation Learning via Feature Clustering",
    "abstract": "In healthcare prediction tasks, it is essential to exploit the correlations between medical features and learn better patient health representations. Existing methods try to estimate feature correlations only from data, or increase the quality of estimation by introducing task-specific medical knowledge. However, such methods either are difficult to estimate the feature correlations due to insufficient training samples, or cannot be generalized to other tasks due to reliance on specific knowledge. There are medical research revealing that not all the medical features are strongly correlated. Thus, to address the issues, we expect to group up strongly correlated features and learn feature correlations in a group-wise manner to reduce the learning complexity without losing generality. In this paper, we propose a general patient health representation learning framework MedFACT. We estimate correlations via measuring similarity between temporal patterns of medical features with kernel methods, and cluster features with strong correlations into groups. The feature group is further formulated as a correlation graph, and we employ graph convolutional networks to conduct group-wise feature interactions for better representation learning. Experiments on two real-world datasets demonstrate the superiority of MedFACT. The discovered medical findings are also confirmed by literature, providing valuable medical insights and explanations. ",
    "url": "https://arxiv.org/abs/2204.10011",
    "authors": [
      "Xinyu Ma",
      "Xu Chu",
      "Yasha Wang",
      "Hailong Yu",
      "Liantao Ma",
      "Wen Tang",
      "Junfeng Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10024",
    "title": "Understanding the Domain Gap in LiDAR Object Detection Networks",
    "abstract": "In order to make autonomous driving a reality, artificial neural networks have to work reliably in the open-world. However, the open-world is vast and continuously changing, so it is not technically feasible to collect and annotate training datasets which accurately represent this domain. Therefore, there are always domain gaps between training datasets and the open-world which must be understood. In this work, we investigate the domain gaps between high-resolution and low-resolution LiDAR sensors in object detection networks. Using a unique dataset, which enables us to study sensor resolution domain gaps independent of other effects, we show two distinct domain gaps - an inference domain gap and a training domain gap. The inference domain gap is characterised by a strong dependence on the number of LiDAR points per object, while the training gap shows no such dependence. These fndings show that different approaches are required to close these inference and training domain gaps. ",
    "url": "https://arxiv.org/abs/2204.10024",
    "authors": [
      "Jasmine Richter",
      "Florian Faion",
      "Di Feng",
      "Paul Benedikt Becker",
      "Piotr Sielecki",
      "Claudius Glaeser"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10027",
    "title": "Is Neuron Coverage Needed to Make Person Detection More Robust?",
    "abstract": "The growing use of deep neural networks (DNNs) in safety- and security-critical areas like autonomous driving raises the need for their systematic testing. Coverage-guided testing (CGT) is an approach that applies mutation or fuzzing according to a predefined coverage metric to find inputs that cause misbehavior. With the introduction of a neuron coverage metric, CGT has also recently been applied to DNNs. In this work, we apply CGT to the task of person detection in crowded scenes. The proposed pipeline uses YOLOv3 for person detection and includes finding DNN bugs via sampling and mutation, and subsequent DNN retraining on the updated training set. To be a bug, we require a mutated image to cause a significant performance drop compared to a clean input. In accordance with the CGT, we also consider an additional requirement of increased coverage in the bug definition. In order to explore several types of robustness, our approach includes natural image transformations, corruptions, and adversarial examples generated with the Daedalus attack. The proposed framework has uncovered several thousand cases of incorrect DNN behavior. The relative change in mAP performance of the retrained models reached on average between 26.21\\% and 64.24\\% for different robustness types. However, we have found no evidence that the investigated coverage metrics can be advantageously used to improve robustness. ",
    "url": "https://arxiv.org/abs/2204.10027",
    "authors": [
      "Svetlana Pavlitskaya",
      "Şiyar Yıkmış",
      "J. Marius Zöllner"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10037",
    "title": "DropMessage: Unifying Random Dropping for Graph Neural Networks",
    "abstract": "Graph Neural Networks (GNNs) are powerful tools for graph representation learning. Despite their rapid development, GNNs also faces some challenges, such as over-fitting, over-smoothing, and non-robustness. Previous works indicate that these problems can be alleviated by random dropping methods, which integrate noises into models by randomly masking parts of the input. However, some open-ended problems of random dropping on GNNs remain to solve. First, it is challenging to find a universal method that are suitable for all cases considering the divergence of different datasets and models. Second, random noises introduced to GNNs cause the incomplete coverage of parameters and unstable training process. In this paper, we propose a novel random dropping method called DropMessage, which performs dropping operations directly on the message matrix and can be applied to any message-passing GNNs. Furthermore, we elaborate the superiority of DropMessage: it stabilizes the training process by reducing sample variance; it keeps information diversity from the perspective of information theory, which makes it a theoretical upper bound of other methods. Also, we unify existing random dropping methods into our framework and analyze their effects on GNNs. To evaluate our proposed method, we conduct experiments that aims for multiple tasks on five public datasets and two industrial datasets with various backbone models. The experimental results show that DropMessage has both advantages of effectiveness and generalization. ",
    "url": "https://arxiv.org/abs/2204.10037",
    "authors": [
      "Taoran Fang",
      "Zhiqing Xiao",
      "Chunping Wang",
      "Jiarong Xu",
      "Xuan Yang",
      "Yang Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10046",
    "title": "Robustness of Machine Learning Models Beyond Adversarial Attacks",
    "abstract": "Correctly quantifying the robustness of machine learning models is a central aspect in judging their suitability for specific tasks, and thus, ultimately, for generating trust in the models. We show that the widely used concept of adversarial robustness and closely related metrics based on counterfactuals are not necessarily valid metrics for determining the robustness of ML models against perturbations that occur \"naturally\", outside specific adversarial attack scenarios. Additionally, we argue that generic robustness metrics in principle are insufficient for determining real-world-robustness. Instead we propose a flexible approach that models possible perturbations in input data individually for each application. This is then combined with a probabilistic approach that computes the likelihood that a real-world perturbation will change a prediction, thus giving quantitative information of the robustness of the trained machine learning model. The method does not require access to the internals of the classifier and thus in principle works for any black-box model. It is, however, based on Monte-Carlo sampling and thus only suited for input spaces with small dimensions. We illustrate our approach on two dataset, as well as on analytically solvable cases. Finally, we discuss ideas on how real-world robustness could be computed or estimated in high-dimensional input spaces. ",
    "url": "https://arxiv.org/abs/2204.10046",
    "authors": [
      "Sebastian Scher",
      "Andreas Trügler"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10050",
    "title": "SemEval-2022 Task 2: Multilingual Idiomaticity Detection and Sentence  Embedding",
    "abstract": "This paper presents the shared task on Multilingual Idiomaticity Detection and Sentence Embedding, which consists of two subtasks: (a) a binary classification one aimed at identifying whether a sentence contains an idiomatic expression, and (b) a task based on semantic text similarity which requires the model to adequately represent potentially idiomatic expressions in context. Each subtask includes different settings regarding the amount of training data. Besides the task description, this paper introduces the datasets in English, Portuguese, and Galician and their annotation procedure, the evaluation metrics, and a summary of the participant systems and their results. The task had close to 100 registered participants organised into twenty five teams making over 650 and 150 submissions in the practice and evaluation phases respectively. ",
    "url": "https://arxiv.org/abs/2204.10050",
    "authors": [
      "Harish Tayyar Madabushi",
      "Edward Gow-Smith",
      "Marcos Garcia",
      "Carolina Scarton",
      "Marco Idiart",
      "Aline Villavicencio"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.10060",
    "title": "Implicit Shape Completion via Adversarial Shape Priors",
    "abstract": "We present a novel neural implicit shape method for partial point cloud completion. To that end, we combine a conditional Deep-SDF architecture with learned, adversarial shape priors. More specifically, our network converts partial inputs into a global latent code and then recovers the full geometry via an implicit, signed distance generator. Additionally, we train a PointNet++ discriminator that impels the generator to produce plausible, globally consistent reconstructions. In that way, we effectively decouple the challenges of predicting shapes that are both realistic, i.e. imitate the training set's pose distribution, and accurate in the sense that they replicate the partial input observations. In our experiments, we demonstrate state-of-the-art performance for completing partial shapes, considering both man-made objects (e.g. airplanes, chairs, ...) and deformable shape categories (human bodies). Finally, we show that our adversarial training approach leads to visually plausible reconstructions that are highly consistent in recovering missing parts of a given object. ",
    "url": "https://arxiv.org/abs/2204.10060",
    "authors": [
      "Abhishek Saroha",
      "Marvin Eisenberger",
      "Tarun Yenamandra",
      "Daniel Cremers"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10068",
    "title": "Absolute Wrong Makes Better: Boosting Weakly Supervised Object Detection  via Negative Deterministic Information",
    "abstract": "Weakly supervised object detection (WSOD) is a challenging task, in which image-level labels (e.g., categories of the instances in the whole image) are used to train an object detector. Many existing methods follow the standard multiple instance learning (MIL) paradigm and have achieved promising performance. However, the lack of deterministic information leads to part domination and missing instances. To address these issues, this paper focuses on identifying and fully exploiting the deterministic information in WSOD. We discover that negative instances (i.e. absolutely wrong instances), ignored in most of the previous studies, normally contain valuable deterministic information. Based on this observation, we here propose a negative deterministic information (NDI) based method for improving WSOD, namely NDI-WSOD. Specifically, our method consists of two stages: NDI collecting and exploiting. In the collecting stage, we design several processes to identify and distill the NDI from negative instances online. In the exploiting stage, we utilize the extracted NDI to construct a novel negative contrastive learning mechanism and a negative guided instance selection strategy for dealing with the issues of part domination and missing instances, respectively. Experimental results on several public benchmarks including VOC 2007, VOC 2012 and MS COCO show that our method achieves satisfactory performance. ",
    "url": "https://arxiv.org/abs/2204.10068",
    "authors": [
      "Guanchun Wang",
      "Xiangrong Zhang",
      "Zelin Peng",
      "Xu Tang",
      "Huiyu Zhou",
      "Licheng Jiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10072",
    "title": "Detecting Topology Attacks against Graph Neural Networks",
    "abstract": "Graph neural networks (GNNs) have been widely used in many real applications, and recent studies have revealed their vulnerabilities against topology attacks. To address this issue, existing efforts have mainly been dedicated to improving the robustness of GNNs, while little attention has been paid to the detection of such attacks. In this work, we study the victim node detection problem under topology attacks against GNNs. Our approach is built upon the key observation rooted in the intrinsic message passing nature of GNNs. That is, the neighborhood of a victim node tends to have two competing group forces, pushing the node classification results towards the original label and the targeted label, respectively. Based on this observation, we propose to detect victim nodes by deliberately designing an effective measurement of the neighborhood variance for each node. Extensive experimental results on four real-world datasets and five existing topology attacks show the effectiveness and efficiency of the proposed detection approach. ",
    "url": "https://arxiv.org/abs/2204.10072",
    "authors": [
      "Senrong Xu",
      "Yuan Yao",
      "Liangyue Li",
      "Wei Yang",
      "Feng Xu",
      "Hanghang Tong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2204.10080",
    "title": "Identifying and Characterizing Active Citizens who Refute Misinformation  in Social Media",
    "abstract": "The phenomenon of misinformation spreading in social media has developed a new form of active citizens who focus on tackling the problem by refuting posts that might contain misinformation. Automatically identifying and characterizing the behavior of such active citizens in social media is an important task in computational social science for complementing studies in misinformation analysis. In this paper, we study this task across different social media platforms (i.e., Twitter and Weibo) and languages (i.e., English and Chinese) for the first time. To this end, (1) we develop and make publicly available a new dataset of Weibo users mapped into one of the two categories (i.e., misinformation posters or active citizens); (2) we evaluate a battery of supervised models on our new Weibo dataset and an existing Twitter dataset which we repurpose for the task; and (3) we present an extensive analysis of the differences in language use between the two user categories. ",
    "url": "https://arxiv.org/abs/2204.10080",
    "authors": [
      "Yida Mu",
      "Pu Niu",
      "Nikolaos Aletras"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.10085",
    "title": "Forgetting Prevention for Cross-regional Fraud Detection with  Heterogeneous Trade Graph",
    "abstract": "With the booming growth of e-commerce, detecting financial fraud has become an urgent task to avoid transaction risks. Despite the successful application of graph neural networks in fraud detection, the existing solutions are only suitable for a narrow scope due to the limitation of data collection. Especially when expanding a business into new territory, e.g., new cities or new countries, developing a totally new model will bring the cost issue and result in forgetting previous knowledge. Besides, most existing GNNs-based solutions concentrate on either homogeneous graphs or decomposing heterogeneous interactions into several homogeneous connections for convenience. To this end, this study proposes a novel solution based on heterogeneous trade graphs, namely HTG-CFD, to prevent knowledge forgetting of cross-regional fraud detection. In particular, the heterogeneous trade graph (HTG) is constructed from initial transaction records to explore the complex semantics among different types of entities and relationships. Extensive experiments demonstrate that the proposed HTG-CFD not only promotes the performance in cross-regional scenarios but also significantly contributes to the single-regional fraud detection. The code of the paper can be accessed at https://github.com/YujieLi42/HTG-CFD. ",
    "url": "https://arxiv.org/abs/2204.10085",
    "authors": [
      "Yujie Li",
      "Yuxuan Yang",
      "Xin Yang",
      "Qiang Gao",
      "Fan Zhou"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2204.10125",
    "title": "Physical Modeling using Recurrent Neural Networks with Fast  Convolutional Layers",
    "abstract": "Discrete-time modeling of acoustic, mechanical and electrical systems is a prominent topic in the musical signal processing literature. Such models are mostly derived by discretizing a mathematical model, given in terms of ordinary or partial differential equations, using established techniques. Recent work has applied the techniques of machine-learning to construct such models automatically from data for the case of systems which have lumped states described by scalar values, such as electrical circuits. In this work, we examine how similar techniques are able to construct models of systems which have spatially distributed rather than lumped states. We describe several novel recurrent neural network structures, and show how they can be thought of as an extension of modal techniques. As a proof of concept, we generate synthetic data for three physical systems and show that the proposed network structures can be trained with this data to reproduce the behavior of these systems. ",
    "url": "https://arxiv.org/abs/2204.10125",
    "authors": [
      "Julian D. Parker",
      "Sebastian J. Schlecht",
      "Rudolf Rabenstein",
      "Maximilian Schäfer"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2204.10128",
    "title": "Learnable Model Augmentation Self-Supervised Learning for Sequential  Recommendation",
    "abstract": "Sequential Recommendation aims to predict the next item based on user behaviour. Recently, Self-Supervised Learning (SSL) has been proposed to improve recommendation performance. However, most of existing SSL methods use a uniform data augmentation scheme, which loses the sequence correlation of an original sequence. To this end, in this paper, we propose a Learnable Model Augmentation self-supervised learning for sequential Recommendation (LMA4Rec). Specifically, LMA4Rec first takes model augmentation as a supplementary method for data augmentation to generate views. Then, LMA4Rec uses learnable Bernoulli dropout to implement model augmentation learnable operations. Next, self-supervised learning is used between the contrastive views to extract self-supervised signals from an original sequence. Finally, experiments on three public datasets show that the LMA4Rec method effectively improves sequential recommendation performance compared with baseline methods. ",
    "url": "https://arxiv.org/abs/2204.10128",
    "authors": [
      "Yongjing Hao",
      "Pengpeng Zhao",
      "Xuefeng Xian",
      "Guanfeng Liu",
      "Deqing Wang",
      "Lei Zhao",
      "Yanchi Liu",
      "Victor S. Sheng"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10137",
    "title": "Toward Fast, Flexible, and Robust Low-Light Image Enhancement",
    "abstract": "Existing low-light image enhancement techniques are mostly not only difficult to deal with both visual quality and computational efficiency but also commonly invalid in unknown complex scenarios. In this paper, we develop a new Self-Calibrated Illumination (SCI) learning framework for fast, flexible, and robust brightening images in real-world low-light scenarios. To be specific, we establish a cascaded illumination learning process with weight sharing to handle this task. Considering the computational burden of the cascaded pattern, we construct the self-calibrated module which realizes the convergence between results of each stage, producing the gains that only use the single basic block for inference (yet has not been exploited in previous works), which drastically diminishes computation cost. We then define the unsupervised training loss to elevate the model capability that can adapt to general scenes. Further, we make comprehensive explorations to excavate SCI's inherent properties (lacking in existing works) including operation-insensitive adaptability (acquiring stable performance under the settings of different simple operations) and model-irrelevant generality (can be applied to illumination-based existing works to improve performance). Finally, plenty of experiments and ablation studies fully indicate our superiority in both quality and efficiency. Applications on low-light face detection and nighttime semantic segmentation fully reveal the latent practical values for SCI. The source code is available at https://github.com/vis-opt-group/SCI. ",
    "url": "https://arxiv.org/abs/2204.10137",
    "authors": [
      "Long Ma",
      "Tengyu Ma",
      "Risheng Liu",
      "Xin Fan",
      "Zhongxuan Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10152",
    "title": "Features of Explainability: How users understand counterfactual and  causal explanations for categorical and continuous features in XAI",
    "abstract": "Counterfactual explanations are increasingly used to address interpretability, recourse, and bias in AI decisions. However, we do not know how well counterfactual explanations help users to understand a systems decisions, since no large scale user studies have compared their efficacy to other sorts of explanations such as causal explanations (which have a longer track record of use in rule based and decision tree models). It is also unknown whether counterfactual explanations are equally effective for categorical as for continuous features, although current methods assume they do. Hence, in a controlled user study with 127 volunteer participants, we tested the effects of counterfactual and causal explanations on the objective accuracy of users predictions of the decisions made by a simple AI system, and participants subjective judgments of satisfaction and trust in the explanations. We discovered a dissociation between objective and subjective measures: counterfactual explanations elicit higher accuracy of predictions than no-explanation control descriptions but no higher accuracy than causal explanations, yet counterfactual explanations elicit greater satisfaction and trust than causal explanations. We also found that users understand explanations referring to categorical features more readily than those referring to continuous features. We discuss the implications of these findings for current and future counterfactual methods in XAI. ",
    "url": "https://arxiv.org/abs/2204.10152",
    "authors": [
      "Greta Warren",
      "Mark T Keane",
      "Ruth M J Byrne"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10185",
    "title": "Social Media Sentiment Analysis for Cryptocurrency Market Prediction",
    "abstract": "In this paper, we explore the usability of different natural language processing models for the sentiment analysis of social media applied to financial market prediction, using the cryptocurrency domain as a reference. We study how the different sentiment metrics are correlated with the price movements of Bitcoin. For this purpose, we explore different methods to calculate the sentiment metrics from a text finding most of them not very accurate for this prediction task. We find that one of the models outperforms more than 20 other public ones and makes it possible to fine-tune it efficiently given its interpretable nature. Thus we confirm that interpretable artificial intelligence and natural language processing methods might be more valuable practically than non-explainable and non-interpretable ones. In the end, we analyse potential causal connections between the different sentiment metrics and the price movements. ",
    "url": "https://arxiv.org/abs/2204.10185",
    "authors": [
      "Ali Raheman",
      "Anton Kolonin",
      "Igors Fridkins",
      "Ikram Ansari",
      "Mukul Vishwas"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.10189",
    "title": "Neural Topic Modeling of Psychotherapy Sessions",
    "abstract": "In this work, we compare different neural topic modeling methods in learning the topical propensities of different psychiatric conditions from the psychotherapy session transcripts parsed from speech recordings. We also incorporate temporal modeling to put this additional interpretability to action by parsing out topic similarities as a time series in a turn-level resolution. We believe this topic modeling framework can offer interpretable insights for the therapist to optimally decide his or her strategy and improve the psychotherapy effectiveness. ",
    "url": "https://arxiv.org/abs/2204.10189",
    "authors": [
      "Baihan Lin",
      "Djallel Bouneffouf",
      "Guillermo Cecchi",
      "Ravi Tejwani"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10192",
    "title": "Residue-Based Natural Language Adversarial Attack Detection",
    "abstract": "Deep learning based systems are susceptible to adversarial attacks, where a small, imperceptible change at the input alters the model prediction. However, to date the majority of the approaches to detect these attacks have been designed for image processing systems. Many popular image adversarial detection approaches are able to identify adversarial examples from embedding feature spaces, whilst in the NLP domain existing state of the art detection approaches solely focus on input text features, without consideration of model embedding spaces. This work examines what differences result when porting these image designed strategies to Natural Language Processing (NLP) tasks - these detectors are found to not port over well. This is expected as NLP systems have a very different form of input: discrete and sequential in nature, rather than the continuous and fixed size inputs for images. As an equivalent model-focused NLP detection approach, this work proposes a simple sentence-embedding \"residue\" based detector to identify adversarial examples. On many tasks, it out-performs ported image domain detectors and recent state of the art NLP specific detectors. ",
    "url": "https://arxiv.org/abs/2204.10192",
    "authors": [
      "Vyas Raina",
      "Mark Gales"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10194",
    "title": "Semantic Structure based Query Graph Prediction for Question Answering  over Knowledge Graph",
    "abstract": "Building query graphs from natural language questions is an important step in complex question answering over knowledge graph (Complex KGQA). In general, a question can be correctly answered if its query graph is built correctly and the right answer is then retrieved by issuing the query graph against the KG. Therefore, this paper focuses on query graph generation from natural language questions. Existing approaches for query graph generation ignore the semantic structure of a question, resulting in a large number of noisy query graph candidates that undermine prediction accuracies. In this paper, we define six semantic structures from common questions in KGQA and develop a novel Structure-BERT to predict the semantic structure of a question. By doing so, we can first filter out noisy candidate query graphs by the predicted semantic structures, and then rank the remaining candidates with a BERT-based ranking model. Extensive experiments on two popular benchmarks MetaQA and WebQuestionsSP (WSP) demonstrate the effectiveness of our method as compared to state-of-the-arts. ",
    "url": "https://arxiv.org/abs/2204.10194",
    "authors": [
      "Mingchen Li",
      "Jonathan Shihao Ji"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10196",
    "title": "Multimodal Hate Speech Detection from Bengali Memes and Texts",
    "abstract": "Numerous works have been proposed to employ machine learning (ML) and deep learning (DL) techniques to utilize textual data from social media for anti-social behavior analysis such as cyberbullying, fake news propagation, and hate speech mainly for highly resourced languages like English. However, despite having a lot of diversity and millions of native speakers, some languages such as Bengali are under-resourced, which is due to a lack of computational resources for natural language processing (NLP). Like English, Bengali social media content also includes images along with texts (e.g., multimodal contents are posted by embedding short texts into images on Facebook), only the textual data is not enough to judge them (e.g., to determine they are hate speech). In those cases, images might give extra context to properly judge. This paper is about hate speech detection from multimodal Bengali memes and texts. We prepared the only multimodal hate speech detection dataset1 for a kind of problem for Bengali. We train several neural architectures (i.e., neural networks like Bi-LSTM/Conv-LSTM with word embeddings, EfficientNet + transformer architectures such as monolingual Bangla BERT, multilingual BERT-cased/uncased, and XLM-RoBERTa) jointly analyze textual and visual information for hate speech detection. The Conv-LSTM and XLM-RoBERTa models performed best for texts, yielding F1 scores of 0.78 and 0.82, respectively. As of memes, ResNet152 and DenseNet201 models yield F1 scores of 0.78 and 0.7, respectively. The multimodal fusion of mBERT-uncased + EfficientNet-B1 performed the best, yielding an F1 score of 0.80. Our study suggests that memes are moderately useful for hate speech detection in Bengali, but none of the multimodal models outperform unimodal models analyzing only textual data. ",
    "url": "https://arxiv.org/abs/2204.10196",
    "authors": [
      "Md. Rezaul Karim",
      "Sumon Kanti Dey",
      "Tanhim Islam",
      "Bharathi Raja Chakravarthi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10200",
    "title": "An Exploratory Study on Code Attention in BERT",
    "abstract": "Many recent models in software engineering introduced deep neural models based on the Transformer architecture or use transformer-based Pre-trained Language Models (PLM) trained on code. Although these models achieve the state of the arts results in many downstream tasks such as code summarization and bug detection, they are based on Transformer and PLM, which are mainly studied in the Natural Language Processing (NLP) field. The current studies rely on the reasoning and practices from NLP for these models in code, despite the differences between natural languages and programming languages. There is also limited literature on explaining how code is modeled. Here, we investigate the attention behavior of PLM on code and compare it with natural language. We pre-trained BERT, a Transformer based PLM, on code and explored what kind of information it learns, both semantic and syntactic. We run several experiments to analyze the attention values of code constructs on each other and what BERT learns in each layer. Our analyses show that BERT pays more attention to syntactic entities, specifically identifiers and separators, in contrast to the most attended token [CLS] in NLP. This observation motivated us to leverage identifiers to represent the code sequence instead of the [CLS] token when used for code clone detection. Our results show that employing embeddings from identifiers increases the performance of BERT by 605% and 4% F1-score in its lower layers and the upper layers, respectively. When identifiers' embeddings are used in CodeBERT, a code-based PLM, the performance is improved by 21-24% in the F1-score of clone detection. The findings can benefit the research community by using code-specific representations instead of applying the common embeddings used in NLP, and open new directions for developing smaller models with similar performance. ",
    "url": "https://arxiv.org/abs/2204.10200",
    "authors": [
      "Rishab Sharma",
      "Fuxiang Chen",
      "Fatemeh Fard",
      "David Lo"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2204.10203",
    "title": "Maximizing the Influence of Bichromatic Reverse k Nearest Neighbors in  Geo-Social Networks",
    "abstract": "Geo-social networks offer opportunities for the marketing and promotion of geo-located services. In this setting,we explore a new problem, called Maximizing the Influence of Bichromatic Reverse k Nearest Neighbors (MaxInfBRkNN). The objective is to find a set of points of interest (POIs), which are geo-textually and socially attractive to social influencers who are expected to largely promote the POIs through online influence propagation. In other words, the problem is to detect an optimal set of POIs with the largest word-of-mouth (WOM) marketing potential. This functionality is useful in various real-life applications, including social advertising, location-based viral marketing, and personalized POI recommendation. However,solving MaxInfBRkNN with theoretical guarantees is challenging, because of the prohibitive overheads on BRkNN retrieval ingeo-social networks, and the NP and #P-hardness in searching the optimal POI set. To achieve practical solutions, we present a framework with carefully designed indexes, efficient batch BRkNN processing algorithms, and alternative POI selection policies that support both approximate and heuristic solutions. Extensive experiments on real and synthetic datasets demonstrate the good performance of our proposed methods. ",
    "url": "https://arxiv.org/abs/2204.10203",
    "authors": [
      "Pengfei Jin",
      "Lu Chen",
      "Yunjun Gao",
      "Xueqin Chang",
      "Zhanyu Liu",
      "Christian S. Jensen"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.10208",
    "title": "Message Flow Analysis with Complex Causal Links for Distributed ROS 2  Systems",
    "abstract": "Distributed robotic systems rely heavily on publish-subscribe frameworks, such as ROS, to efficiently implement modular computation graphs. The ROS 2 executor, a high-level task scheduler which handles messages internally, is a performance bottleneck. In previous work, we presented ros2_tracing, a framework with instrumentation and tools for real-time tracing of ROS 2. We now extend on that instrumentation and leverage the tracing tools to propose an analysis and visualization of the flow of messages across distributed ROS 2 systems. Our proposed method detects one-to-many and many-to-many causal links between input and output messages, including indirect causal links through simple user-level annotations. We validate our method on both synthetic and real robotic systems, and demonstrate its low runtime overhead. Moreover, the underlying intermediate execution representation database can be further leveraged to extract additional metrics and high-level results. This can provide valuable timing and scheduling information to further study and improve the ROS 2 executor as well as optimize any ROS 2 system. The source code is available at: https://github.com/christophebedard/ros2-message-flow-analysis. ",
    "url": "https://arxiv.org/abs/2204.10208",
    "authors": [
      "Christophe Bédard",
      "Pierre-Yves Lajoie",
      "Giovanni Beltrame",
      "Michel Dagenais"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.10209",
    "title": "BTranspose: Bottleneck Transformers for Human Pose Estimation with  Self-Supervised Pre-Training",
    "abstract": "The task of 2D human pose estimation is challenging as the number of keypoints is typically large (~ 17) and this necessitates the use of robust neural network architectures and training pipelines that can capture the relevant features from the input image. These features are then aggregated to make accurate heatmap predictions from which the final keypoints of human body parts can be inferred. Many papers in literature use CNN-based architectures for the backbone, and/or combine it with a transformer, after which the features are aggregated to make the final keypoint predictions [1]. In this paper, we consider the recently proposed Bottleneck Transformers [2], which combine CNN and multi-head self attention (MHSA) layers effectively, and we integrate it with a Transformer encoder and apply it to the task of 2D human pose estimation. We consider different backbone architectures and pre-train them using the DINO self-supervised learning method [3], this pre-training is found to improve the overall prediction accuracy. We call our model BTranspose, and experiments show that on the COCO validation set, our model achieves an AP of 76.4, which is competitive with other methods such as [1] and has fewer network parameters. Furthermore, we also present the dependencies of the final predicted keypoints on both the MHSA block and the Transformer encoder layers, providing clues on the image sub-regions the network attends to at the mid and high levels. ",
    "url": "https://arxiv.org/abs/2204.10209",
    "authors": [
      "Kaushik Balakrishnan",
      "Devesh Upadhyay"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10222",
    "title": "Learning spatiotemporal features from incomplete data for traffic flow  prediction using hybrid deep neural networks",
    "abstract": "Urban traffic flow prediction using data-driven models can play an important role in route planning and preventing congestion on highways. These methods utilize data collected from traffic recording stations at different timestamps to predict the future status of traffic. Hence, data collection, transmission, storage, and extraction techniques can have a significant impact on the performance of the traffic flow model. On the other hand, a comprehensive database can provide the opportunity for using complex, yet reliable predictive models such as deep learning methods. However, most of these methods have difficulties in handling missing values and outliers. This study focuses on hybrid deep neural networks to predict traffic flow in the California Freeway Performance Measurement System (PeMS) with missing values. The proposed networks are based on a combination of recurrent neural networks (RNNs) to consider the temporal dependencies in the data recorded in each station and convolutional neural networks (CNNs) to take the spatial correlations in the adjacent stations into account. Various architecture configurations with series and parallel connections are considered based on RNNs and CNNs, and several prevalent data imputation techniques are used to examine the robustness of the hybrid networks to missing values. A comprehensive analysis performed on two different datasets from PeMS indicates that the proposed series-parallel hybrid network with the mean imputation technique achieves the lowest error in predicting the traffic flow and is robust to missing values up until 21% missing ratio in both complete and incomplete training data scenarios when applied to an incomplete test data. ",
    "url": "https://arxiv.org/abs/2204.10222",
    "authors": [
      "Mehdi Mehdipour Ghazi",
      "Amin Ramezani",
      "Mehdi Siahi",
      "Mostafa Mehdipour Ghazi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10230",
    "title": "Cross-Lingual Query-Based Summarization of Crisis-Related Social Media:  An Abstractive Approach Using Transformers",
    "abstract": "Relevant and timely information collected from social media during crises can be an invaluable resource for emergency management. However, extracting this information remains a challenging task, particularly when dealing with social media postings in multiple languages. This work proposes a cross-lingual method for retrieving and summarizing crisis-relevant information from social media postings. We describe a uniform way of expressing various information needs through structured queries and a way of creating summaries answering those information needs. The method is based on multilingual transformers embeddings. Queries are written in one of the languages supported by the embeddings, and the extracted sentences can be in any of the other languages supported. Abstractive summaries are created by transformers. The evaluation, done by crowdsourcing evaluators and emergency management experts, and carried out on collections extracted from Twitter during five large-scale disasters spanning ten languages, shows the flexibility of our approach. The generated summaries are regarded as more focused, structured, and coherent than existing state-of-the-art methods, and experts compare them favorably against summaries created by existing, state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2204.10230",
    "authors": [
      "Fedor Vitiugin",
      "Carlos Castillo"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2204.10231",
    "title": "Handling Imbalanced Classification Problems With Support Vector Machines  via Evolutionary Bilevel Optimization",
    "abstract": "Support vector machines (SVMs) are popular learning algorithms to deal with binary classification problems. They traditionally assume equal misclassification costs for each class; however, real-world problems may have an uneven class distribution. This article introduces EBCS-SVM: evolutionary bilevel cost-sensitive SVMs. EBCS-SVM handles imbalanced classification problems by simultaneously learning the support vectors and optimizing the SVM hyperparameters, which comprise the kernel parameter and misclassification costs. The resulting optimization problem is a bilevel problem, where the lower level determines the support vectors and the upper level the hyperparameters. This optimization problem is solved using an evolutionary algorithm (EA) at the upper level and sequential minimal optimization (SMO) at the lower level. These two methods work in a nested fashion, that is, the optimal support vectors help guide the search of the hyperparameters, and the lower level is initialized based on previous successful solutions. The proposed method is assessed using 70 datasets of imbalanced classification and compared with several state-of-the-art methods. The experimental results, supported by a Bayesian test, provided evidence of the effectiveness of EBCS-SVM when working with highly imbalanced datasets. ",
    "url": "https://arxiv.org/abs/2204.10231",
    "authors": [
      "Alejandro Rosales-Pérez",
      "Salvador García",
      "Francisco Herrera"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.10238",
    "title": "HEATGait: Hop-Extracted Adjacency Technique in Graph Convolution based  Gait Recognition",
    "abstract": "Biometric authentication using gait has become a promising field due to its unobtrusive nature. Recent approaches in model-based gait recognition techniques utilize spatio-temporal graphs for the elegant extraction of gait features. However, existing methods often rely on multi-scale operators for extracting long-range relationships among joints resulting in biased weighting. In this paper, we present HEATGait, a gait recognition system that improves the existing multi-scale graph convolution by efficient hop-extraction technique to alleviate the issue. Combined with preprocessing and augmentation techniques, we propose a powerful feature extractor that utilizes ResGCN to achieve state-of-the-art performance in model-based gait recognition on the CASIA-B gait dataset. ",
    "url": "https://arxiv.org/abs/2204.10238",
    "authors": [
      "Md. Bakhtiar Hasan",
      "Tasnim Ahmed",
      "Md. Hasanul Kabir"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10245",
    "title": "SpaceE: Knowledge Graph Embedding by Relational Linear Transformation in  the Entity Space",
    "abstract": "Translation distance based knowledge graph embedding (KGE) methods, such as TransE and RotatE, model the relation in knowledge graphs as translation or rotation in the vector space. Both translation and rotation are injective; that is, the translation or rotation of different vectors results in different results. In knowledge graphs, different entities may have a relation with the same entity; for example, many actors starred in one movie. Such a non-injective relation pattern cannot be well modeled by the translation or rotation operations in existing translation distance based KGE methods. To tackle the challenge, we propose a translation distance-based KGE method called SpaceE to model relations as linear transformations. The proposed SpaceE embeds both entities and relations in knowledge graphs as matrices and SpaceE naturally models non-injective relations with singular linear transformations. We theoretically demonstrate that SpaceE is a fully expressive model with the ability to infer multiple desired relation patterns, including symmetry, skew-symmetry, inversion, Abelian composition, and non-Abelian composition. Experimental results on link prediction datasets illustrate that SpaceE substantially outperforms many previous translation distance based knowledge graph embedding methods, especially on datasets with many non-injective relations. The code is available based on the PaddlePaddle deep learning platform https://www.paddlepaddle.org.cn. ",
    "url": "https://arxiv.org/abs/2204.10245",
    "authors": [
      "Jinxing Yu",
      "Yunfeng Cai",
      "Mingming Sun",
      "Ping Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.10254",
    "title": "From Who You Know to What You Read: Augmenting Scientific  Recommendations with Implicit Social Networks",
    "abstract": "The ever-increasing pace of scientific publication necessitates methods for quickly identifying relevant papers. While neural recommenders trained on user interests can help, they still result in long, monotonous lists of suggested papers. To improve the discovery experience we introduce multiple new methods for \\em augmenting recommendations with textual relevance messages that highlight knowledge-graph connections between recommended papers and a user's publication and interaction history. We explore associations mediated by author entities and those using citations alone. In a large-scale, real-world study, we show how our approach significantly increases engagement -- and future engagement when mediated by authors -- without introducing bias towards highly-cited authors. To expand message coverage for users with less publication or interaction history, we develop a novel method that highlights connections with proxy authors of interest to users and evaluate it in a controlled lab study. Finally, we synthesize design implications for future graph-based messages. ",
    "url": "https://arxiv.org/abs/2204.10254",
    "authors": [
      "Hyeonsu B. Kang",
      "Rafal Kocielnik",
      "Andrew Head",
      "Jiangjiang Yang",
      "Matt Latzke",
      "Aniket Kittur",
      "Daniel S. Weld",
      "Doug Downey",
      "Jonathan Bragg"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Human-Computer Interaction (cs.HC)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.10262",
    "title": "An Examination of Bias of Facial Analysis based BMI Prediction Models",
    "abstract": "Obesity is one of the most important public health problems that the world is facing today. A recent trend is in the development of intervention tools that predict BMI using facial images for weight monitoring and management to combat obesity. Most of these studies used BMI annotated facial image datasets that mainly consisted of Caucasian subjects. Research on bias evaluation of face-based gender-, age-classification, and face recognition systems suggest that these technologies perform poorly for women, dark-skinned people, and older adults. The bias of facial analysis-based BMI prediction tools has not been studied until now. This paper evaluates the bias of facial-analysis-based BMI prediction models across Caucasian and African-American Males and Females. Experimental investigations on the gender, race, and BMI balanced version of the modified MORPH-II dataset suggested that the error rate in BMI prediction was least for Black Males and highest for White Females. Further, the psychology-related facial features correlated with weight suggested that as the BMI increases, the changes in the facial region are more prominent for Black Males and the least for White Females. This is the reason for the least error rate of the facial analysis-based BMI prediction tool for Black Males and highest for White Females. ",
    "url": "https://arxiv.org/abs/2204.10262",
    "authors": [
      "Hera Siddiqui",
      "Ajita Rattani",
      "Karl Ricanek",
      "Twyla Hill"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10282",
    "title": "AI-Empowered Data Offloading in MEC-Enabled IoV Networks",
    "abstract": "Advancements in smart vehicle design have enabled the creation of Internet of Vehicle (IoV) technologies that can utilize the information provided by various sensors and wireless communication to perform complex functionality. Many of these functionalities rely on high computational power and low latency. Mobile Edge Computing (MEC) technologies have been proposed as a way to meet these requirements, as their proximity and decentralization provide unique benefits for networks like real-time communication, higher throughput, and flexibility. Diverse challenges to the process of offloading data in a MEC-enabled IoV network have emerged, such as offloading reliability in highly mobile environments, security for users within the same network, and energy management to keep users from being disincentivized to participate in the network. This article surveys research studies that use AI as part of the data offloading process, categorized based on four main issues: reliability, security, energy management, and service seller profit. Afterward, this article discusses challenges and future perspectives for IoV technologies. ",
    "url": "https://arxiv.org/abs/2204.10282",
    "authors": [
      "Afonso Fontes",
      "Igor de L. Ribeiro",
      "Khan Muhammad",
      "Amir H. Gandomi",
      "Gregory Gay",
      "Victor Hugo C. de Albuquerque"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2204.10293",
    "title": "A Hierarchical N-Gram Framework for Zero-Shot Link Prediction",
    "abstract": "Due to the incompleteness of knowledge graphs (KGs), zero-shot link prediction (ZSLP) which aims to predict unobserved relations in KGs has attracted recent interest from researchers. A common solution is to use textual features of relations (e.g., surface name or textual descriptions) as auxiliary information to bridge the gap between seen and unseen relations. Current approaches learn an embedding for each word token in the text. These methods lack robustness as they suffer from the out-of-vocabulary (OOV) problem. Meanwhile, models built on character n-grams have the capability of generating expressive representations for OOV words. Thus, in this paper, we propose a Hierarchical N-Gram framework for Zero-Shot Link Prediction (HNZSLP), which considers the dependencies among character n-grams of the relation surface name for ZSLP. Our approach works by first constructing a hierarchical n-gram graph on the surface name to model the organizational structure of n-grams that leads to the surface name. A GramTransformer, based on the Transformer is then presented to model the hierarchical n-gram graph to construct the relation embedding for ZSLP. Experimental results show the proposed HNZSLP achieved state-of-the-art performance on two ZSLP datasets. ",
    "url": "https://arxiv.org/abs/2204.10293",
    "authors": [
      "Mingchen Li",
      "Junfan Chen",
      "Samuel Mensah",
      "Nikolaos Aletras",
      "Xiulong Yang",
      "Yang Ye"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10308",
    "title": "Addressing Tactic Volatility in Self-Adaptive Systems Using Evolved  Recurrent Neural Networks and Uncertainty Reduction Tactics",
    "abstract": "Self-adaptive systems frequently use tactics to perform adaptations. Tactic examples include the implementation of additional security measures when an intrusion is detected, or activating a cooling mechanism when temperature thresholds are surpassed. Tactic volatility occurs in real-world systems and is defined as variable behavior in the attributes of a tactic, such as its latency or cost. A system's inability to effectively account for tactic volatility adversely impacts its efficiency and resiliency against the dynamics of real-world environments. To enable systems' efficiency against tactic volatility, we propose a Tactic Volatility Aware (TVA-E) process utilizing evolved Recurrent Neural Networks (eRNN) to provide accurate tactic predictions. TVA-E is also the first known process to take advantage of uncertainty reduction tactics to provide additional information to the decision-making process and reduce uncertainty. TVA-E easily integrates into popular adaptation processes enabling it to immediately benefit a large number of existing self-adaptive systems. Simulations using 52,106 tactic records demonstrate that: I) eRNN is an effective prediction mechanism, II) TVA-E represents an improvement over existing state-of-the-art processes in accounting for tactic volatility, and III) Uncertainty reduction tactics are beneficial in accounting for tactic volatility. The developed dataset and tool can be found at https://tacticvolatility.github.io/ ",
    "url": "https://arxiv.org/abs/2204.10308",
    "authors": [
      "Aizaz Ul Haq",
      "Niranjana Deshpande",
      "AbdElRahman ElSaid",
      "Travis Desell",
      "Daniel E. Krutz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.10312",
    "title": "Unsupervised Human Action Recognition with Skeletal Graph Laplacian and  Self-Supervised Viewpoints Invariance",
    "abstract": "This paper presents a novel end-to-end method for the problem of skeleton-based unsupervised human action recognition. We propose a new architecture with a convolutional autoencoder that uses graph Laplacian regularization to model the skeletal geometry across the temporal dynamics of actions. Our approach is robust towards viewpoint variations by including a self-supervised gradient reverse layer that ensures generalization across camera views. The proposed method is validated on NTU-60 and NTU-120 large-scale datasets in which it outperforms all prior unsupervised skeleton-based approaches on the cross-subject, cross-view, and cross-setup protocols. Although unsupervised, our learnable representation allows our method even to surpass a few supervised skeleton-based action recognition methods. The code is available in: www.github.com/IIT-PAVIS/UHAR_Skeletal_Laplacian ",
    "url": "https://arxiv.org/abs/2204.10312",
    "authors": [
      "Giancarlo Paoletti",
      "Jacopo Cavazza",
      "Cigdem Beyan",
      "Alessio Del Bue"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10314",
    "title": "Adversarial Contrastive Learning by Permuting Cluster Assignments",
    "abstract": "Contrastive learning has gained popularity as an effective self-supervised representation learning technique. Several research directions improve traditional contrastive approaches, e.g., prototypical contrastive methods better capture the semantic similarity among instances and reduce the computational burden by considering cluster prototypes or cluster assignments, while adversarial instance-wise contrastive methods improve robustness against a variety of attacks. To the best of our knowledge, no prior work jointly considers robustness, cluster-wise semantic similarity and computational efficiency. In this work, we propose SwARo, an adversarial contrastive framework that incorporates cluster assignment permutations to generate representative adversarial samples. We evaluate SwARo on multiple benchmark datasets and against various white-box and black-box attacks, obtaining consistent improvements over state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2204.10314",
    "authors": [
      "Muntasir Wahed",
      "Afrina Tabassum",
      "Ismini Lourentzou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10318",
    "title": "Feature anomaly detection system (FADS) for intelligent manufacturing",
    "abstract": "Anomaly detection is important for industrial automation and part quality assurance, and while humans can easily detect anomalies in components given a few examples, designing a generic automated system that can perform at human or above human capabilities remains a challenge. In this work, we present a simple new anomaly detection algorithm called FADS (feature-based anomaly detection system) which leverages pretrained convolutional neural networks (CNN) to generate a statistical model of nominal inputs by observing the activation of the convolutional filters. During inference the system compares the convolutional filter activation of the new input to the statistical model and flags activations that are outside the expected range of values and therefore likely an anomaly. By using a pretrained network, FADS demonstrates excellent performance similar to or better than other machine learning approaches to anomaly detection while at the same time FADS requires no tuning of the CNN weights. We demonstrate FADS ability by detecting process parameter changes on a custom dataset of additively manufactured lattices. The FADS localization algorithm shows that textural differences that are visible on the surface can be used to detect process parameter changes. In addition, we test FADS on benchmark datasets, such as the MVTec Anomaly Detection dataset, and report good results. ",
    "url": "https://arxiv.org/abs/2204.10318",
    "authors": [
      "Anthony Garland",
      "Kevin Potter",
      "Matt Smith"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10321",
    "title": "Learning Future Object Prediction with a Spatiotemporal Detection  Transformer",
    "abstract": "We explore future object prediction -- a challenging problem where all objects visible in a future video frame are to be predicted. We propose to tackle this problem end-to-end by training a detection transformer to directly output future objects. In order to make accurate predictions about the future, it is necessary to capture the dynamics in the scene, both of other objects and of the ego-camera. We extend existing detection transformers in two ways to capture the scene dynamics. First, we experiment with three different mechanisms that enable the model to spatiotemporally process multiple frames. Second, we feed ego-motion information to the model via cross-attention. We show that both of these cues substantially improve future object prediction performance. Our final approach learns to capture the dynamics and make predictions on par with an oracle for 100 ms prediction horizons, and outperform baselines for longer prediction horizons. ",
    "url": "https://arxiv.org/abs/2204.10321",
    "authors": [
      "Adam Tonderski",
      "Joakim Johnander",
      "Christoffer Petersson",
      "Kalle Åström"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.09710",
    "title": "Complete identification of complex salt-geometries from inaccurate  migrated images using Deep Learning",
    "abstract": "Delimiting salt inclusions from migrated images is a time-consuming activity that relies on highly human-curated analysis and is subject to interpretation errors or limitations of the methods available. We propose to use migrated images produced from an inaccurate velocity model (with a reasonable approximation of sediment velocity, but without salt inclusions) to predict the correct salt inclusions shape using a Convolutional Neural Network (CNN). Our approach relies on subsurface Common Image Gathers to focus the sediments' reflections around the zero offset and to spread the energy of salt reflections over large offsets. Using synthetic data, we trained a U-Net to use common-offset subsurface images as input channels for the CNN and the correct salt-masks as network output. The network learned to predict the salt inclusions masks with high accuracy; moreover, it also performed well when applied to synthetic benchmark data sets that were not previously introduced. Our training process tuned the U-Net to successfully learn the shape of complex salt bodies from partially focused subsurface offset images. ",
    "url": "https://arxiv.org/abs/2204.09710",
    "authors": [
      "Ana Paula O.Muller",
      "Jessé C. Costa",
      "Clecio R. Bom",
      "Elisangela L. Faria",
      "Matheus Klatt",
      "Gabriel Teixeira",
      "Marcelo P. de Albuquerque",
      "Marcio P. de Albuquerque"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.09782",
    "title": "MultiPathGAN: Structure Preserving Stain Normalization using  Unsupervised Multi-domain Adversarial Network with Perception Loss",
    "abstract": "Histopathology relies on the analysis of microscopic tissue images to diagnose disease. A crucial part of tissue preparation is staining whereby a dye is used to make the salient tissue components more distinguishable. However, differences in laboratory protocols and scanning devices result in significant confounding appearance variation in the corresponding images. This variation increases both human error and the inter-rater variability, as well as hinders the performance of automatic or semi-automatic methods. In the present paper we introduce an unsupervised adversarial network to translate (and hence normalize) whole slide images across multiple data acquisition domains. Our key contributions are: (i) an adversarial architecture which learns across multiple domains with a single generator-discriminator network using an information flow branch which optimizes for perceptual loss, and (ii) the inclusion of an additional feature extraction network during training which guides the transformation network to keep all the structural features in the tissue image intact. We: (i) demonstrate the effectiveness of the proposed method firstly on H\\&E slides of 120 cases of kidney cancer, as well as (ii) show the benefits of the approach on more general problems, such as flexible illumination based natural image enhancement and light source adaptation. ",
    "url": "https://arxiv.org/abs/2204.09782",
    "authors": [
      "Haseeb Nazki",
      "Ognjen Arandjelović",
      "InHwa Um",
      "David Harrison"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.09792",
    "title": "Assessing Machine Learning Algorithms for Near-Real Time Bus Ridership  Prediction During Extreme Weather",
    "abstract": "Given an increasingly volatile climate, the relationship between weather and transit ridership has drawn increasing interest. However, challenges stemming from spatio-temporal dependency and non-stationarity have not been fully addressed in modelling and predicting transit ridership under the influence of weather conditions especially with the traditional statistical approaches. Drawing on three-month smart card data in Brisbane, Australia, this research adopts and assesses a suite of machine-learning algorithms, i.e., random forest, eXtreme Gradient Boosting (XGBoost) and Tweedie XGBoost, to model and predict near real-time bus ridership in relation to sudden change of weather conditions. The study confirms that there indeed exists a significant level of spatio-temporal variability of weather-ridership relationship, which produces equally dynamic patterns of prediction errors. Further comparison of model performance suggests that Tweedie XGBoost outperforms the other two machine-learning algorithms in generating overall more accurate prediction outcomes in space and time. Future research may advance the current study by drawing on larger data sets and applying more advanced machine and deep-learning approaches to provide more enhanced evidence for real-time operation of transit systems. ",
    "url": "https://arxiv.org/abs/2204.09792",
    "authors": [
      "Francisco Rowe",
      "Michael Mahony",
      "Sui Tao"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.09832",
    "title": "An Information-theoretical Secured Byzantine-fault Tolerance Consensus  in Quantum Key Distribution Network",
    "abstract": "Quantum key distribution (QKD) networks is expected to provide information-theoretical secured (ITS) communication over long distances. QKD networks based trusted relay architecture are now the most widely used scheme in practice. However, it is an unrealistic assumption that all relays are fully trustable in complex networks. In the past, only a few studies have theoretically analyzed the case of passive eavesdropping attack by dishonest relays and corresponding defense method. However, we have found that active attacks by dishonest relays can be more threatening. With the consideration of passive and active attacks, we treat dishonest relays as Byzantine nodes and analyzes the upper limit of Byzantine nodes that the QKD network can accommodate. In this paper, we propose an ITS Byzantine-fault tolerance (BFT) QKD network scheme to achieve end-to-end key distribution based on point-to-point QKD links. To ensure consistency and provide BFT ability in the QKD network, we design an ITSBFT-consensus protocol for this network scheme. To ensure the information-theoretic security of consensus, we design a temporary signature scheme based on point-to-point QKD link keys. To prevent Byzantine nodes from disrupting the execution process of key distribution, we design an end-to-end key distribution scheme combined with consensus. We theoretically analyze proposed ITSBFT-QKD network scheme from four aspects: QKD key distribution security, temporary signature security, consensus security, and leader election fairness. The simulation result proved the feasibility and demonstrate the performance. ",
    "url": "https://arxiv.org/abs/2204.09832",
    "authors": [
      "Yi Luo",
      "Hao-Kun Mao",
      "Qiong Li"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2204.09909",
    "title": "An Efficient End-to-End Deep Neural Network for Interstitial Lung  Disease Recognition and Classification",
    "abstract": "The automated Interstitial Lung Diseases (ILDs) classification technique is essential for assisting clinicians during the diagnosis process. Detecting and classifying ILDs patterns is a challenging problem. This paper introduces an end-to-end deep convolution neural network (CNN) for classifying ILDs patterns. The proposed model comprises four convolutional layers with different kernel sizes and Rectified Linear Unit (ReLU) activation function, followed by batch normalization and max-pooling with a size equal to the final feature map size well as four dense layers. We used the ADAM optimizer to minimize categorical cross-entropy. A dataset consisting of 21328 image patches of 128 CT scans with five classes is taken to train and assess the proposed model. A comparison study showed that the presented model outperformed pre-trained CNNs and five-fold cross-validation on the same dataset. For ILDs pattern classification, the proposed approach achieved the accuracy scores of 99.09% and the average F score of 97.9%, outperforming three pre-trained CNNs. These outcomes show that the proposed model is relatively state-of-the-art in precision, recall, f score, and accuracy. ",
    "url": "https://arxiv.org/abs/2204.09909",
    "authors": [
      "Masum Shah Junayed",
      "Afsana Ahsan Jeny",
      "Md Baharul Islam",
      "Ikhtiar Ahmed",
      "A F M Shahen Shah"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.09947",
    "title": "Towards Reliable Neural Generative Modeling of Detectors",
    "abstract": "The increasing luminosities of future data taking at Large Hadron Collider and next generation collider experiments require an unprecedented amount of simulated events to be produced. Such large scale productions demand a significant amount of valuable computing resources. This brings a demand to use new approaches to event generation and simulation of detector responses. In this paper, we discuss the application of generative adversarial networks (GANs) to the simulation of the LHCb experiment events. We emphasize main pitfalls in the application of GANs and study the systematic effects in detail. The presented results are based on the Geant4 simulation of the LHCb Cherenkov detector. ",
    "url": "https://arxiv.org/abs/2204.09947",
    "authors": [
      "Lucio Anderlini",
      "Matteo Barbetti",
      "Denis Derkach",
      "Nikita Kazeev",
      "Artem Maevskiy",
      "Sergei Mokhnenko"
    ],
    "subjectives": [
      "Instrumentation and Detectors (physics.ins-det)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Experiment (hep-ex)"
    ]
  },
  {
    "id": "arXiv:2204.09948",
    "title": "Reliable event detection for Taylor methods in astrodynamics",
    "abstract": "We present a novel approach for the detection of events in systems of ordinary differential equations. The new method combines the unique features of Taylor integrators with state-of-the-art polynomial root finding techniques to yield a novel algorithm ensuring strong event detection guarantees at a modest computational overhead. Detailed tests and benchmarks focused on problems in astrodynamics and celestial mechanics (such as collisional N-body systems, spacecraft dynamics around irregular bodies accounting for eclipses, computation of Poincare' sections, etc.) show how our approach is superior in both performance and detection accuracy to strategies commonly employed in modern numerical integration works. The new algorithm is available in our open source Taylor integration package heyoka. ",
    "url": "https://arxiv.org/abs/2204.09948",
    "authors": [
      "Francesco Biscani",
      "Dario Izzo"
    ],
    "subjectives": [
      "Earth and Planetary Astrophysics (astro-ph.EP)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2204.10020",
    "title": "Cross-Speaker Emotion Transfer for Low-Resource Text-to-Speech Using  Non-Parallel Voice Conversion with Pitch-Shift Data Augmentation",
    "abstract": "Data augmentation via voice conversion (VC) has been successfully applied to low-resource expressive text-to-speech (TTS) when only neutral data for the target speaker are available. Although the quality of VC is crucial for this approach, it is challenging to learn a stable VC model because the amount of data is limited in low-resource scenarios, and highly expressive speech has large acoustic variety. To address this issue, we propose a novel data augmentation method that combines pitch-shifting and VC techniques. Because pitch-shift data augmentation enables the coverage of a variety of pitch dynamics, it greatly stabilizes training for both VC and TTS models, even when only 1,000 utterances of the target speaker's neutral data are available. Subjective test results showed that a FastSpeech 2-based emotional TTS system with the proposed method improved naturalness and emotional similarity compared with conventional methods. ",
    "url": "https://arxiv.org/abs/2204.10020",
    "authors": [
      "Ryo Terashima",
      "Ryuichi Yamamoto",
      "Eunwoo Song",
      "Yuma Shirahata",
      "Hyun-Wook Yoon",
      "Jae-Min Kim",
      "Kentaro Tachibana"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.10030",
    "title": "Stability, Linear Convergence, and Robustness of the Wang-Elia Algorithm  for Distributed Consensus Optimization",
    "abstract": "We revisit an algorithm for distributed consensus optimization proposed in 2010 by J. Wang and N. Elia. By means of a Lyapunov-based analysis, we prove input-to-state stability of the algorithm relative to a closed invariant set composed of optimal equilibria and with respect to perturbations affecting the algorithm's dynamics. In the absence of perturbations, this result implies linear convergence of the local estimates and Lyapunov stability of the optimal steady state. Moreover, we unveil fundamental connections with the well-known Gradient Tracking and with distributed integral control. Overall, our results suggest that a control theoretic approach can have a considerable impact on (distributed) optimization, especially when robustness is considered. ",
    "url": "https://arxiv.org/abs/2204.10030",
    "authors": [
      "Michelangelo Bin",
      "Ivano Notarnicola",
      "Thomas Parisini"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.10038",
    "title": "On the location of chromatic zeros of series-parallel graphs",
    "abstract": "In this paper we consider the zeros of the chromatic polynomial of series-parallel graphs. Complementing a result of Sokal, showing density outside the disk $\\{z\\in\\mathbb{C} \\mid |z-1| \\leq 1\\}$, we show density of these zeros in the half plane $\\Re(q)>3/2$ and we show there exists an open region $U$ containing the interval $(0,32/27)$ such that $U\\setminus\\{1\\}$ does not contain zeros of the chromatic polynomial of series-parallel graphs. We also disprove a conjecture of Sokal by showing that for each large enough integer $\\Delta$ there exists a series-parallel graph for which all vertices but one have degree at most $\\Delta$ and whose chromatic polynomial has a zero with real part exceeding $\\Delta$. ",
    "url": "https://arxiv.org/abs/2204.10038",
    "authors": [
      "Ferenc Bencs",
      "Jeroen Huijben",
      "Guus Regts"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2204.10070",
    "title": "Multi-UAV trajectory planning for 3D visual inspection of complex  structures",
    "abstract": "This paper presents a new trajectory planning algorithm for 3D autonomous UAV volume coverage and visual inspection. The algorithm is an extension of a state-of-the-art Heat Equation Driven Area Coverage (HEDAC) multi-agent area coverage algorithm for 3D domains. With a given target exploration density field, the algorithm designs a potential field and directs UAVs to the regions of higher potential, i.e., higher values of remaining density. Collisions between the agents and agents with domain boundaries are prevented by implementing the distance field and correcting the agent's directional vector when the distance threshold is reached. A unit cube test case is considered to evaluate this trajectory planning strategy for volume coverage. For visual inspection applications, the algorithm is supplemented with camera direction control. A field containing the nearest distance from any point in the domain to the structure surface is designed. The gradient of this field is calculated to obtain the camera orientation throughout the trajectory. Three different test cases of varying complexities are considered to validate the proposed method for visual inspection. The simplest scenario is a synthetic portal-like structure inspected using three UAVs. The other two inspection scenarios are based on realistic structures where UAVs are commonly utilized: a wind turbine and a bridge. When deployed to a wind turbine inspection, two simulated UAVs traversing smooth spiral trajectories have successfully explored the entire turbine structure while cameras are directed to the curved surfaces of the turbine's blades. In the bridge test case an efficacious visual inspection of a complex structure is demonstrated by employing a single UAV and five UAVs. The proposed methodology is successful, flexible and applicable in real-world UAV inspection tasks. ",
    "url": "https://arxiv.org/abs/2204.10070",
    "authors": [
      "Stefan Ivić",
      "Bojan Crnković",
      "Luka Grbčić",
      "Lea Matleković"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Multiagent Systems (cs.MA)",
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.10172",
    "title": "Gated Multimodal Fusion with Contrastive Learning for Turn-taking  Prediction in Human-robot Dialogue",
    "abstract": "Turn-taking, aiming to decide when the next speaker can start talking, is an essential component in building human-robot spoken dialogue systems. Previous studies indicate that multimodal cues can facilitate this challenging task. However, due to the paucity of public multimodal datasets, current methods are mostly limited to either utilizing unimodal features or simplistic multimodal ensemble models. Besides, the inherent class imbalance in real scenario, e.g. sentence ending with short pause will be mostly regarded as the end of turn, also poses great challenge to the turn-taking decision. In this paper, we first collect a large-scale annotated corpus for turn-taking with over 5,000 real human-robot dialogues in speech and text modalities. Then, a novel gated multimodal fusion mechanism is devised to utilize various information seamlessly for turn-taking prediction. More importantly, to tackle the data imbalance issue, we design a simple yet effective data augmentation method to construct negative instances without supervision and apply contrastive learning to obtain better feature representations. Extensive experiments are conducted and the results demonstrate the superiority and competitiveness of our model over several state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2204.10172",
    "authors": [
      "Jiudong Yang",
      "Peiying Wang",
      "Yi Zhu",
      "Mingchao Feng",
      "Meng Chen",
      "Xiaodong He"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.10236",
    "title": "The average size of maximal matchings in graphs",
    "abstract": "We investigate the ratio $I(G)$ of the average size of a maximal matching to the size of a maximum matching in a graph $G$. If many maximal matchings have a size close to $\\mu(G)$, this graph invariant has a value close to 1. Conversely, if many maximal matchings have a small size, $I(G)$ approaches $\\frac{1}{2}$. We propose a general technique to determine the asymptotic behavior of $\\avM(G)$ for various classes of graphs. To illustrate the use of this technique, we first show how it makes it possible to find known asymptotic values of $I(G)$ which were typically obtained using generating functions, and we then determine the asymptotic value of $I(G)$ for other families of graphs, highlighting the spectrum of possible values of this graph invariant between $\\frac{1}{2}$ and $1$. ",
    "url": "https://arxiv.org/abs/2204.10236",
    "authors": [
      "Alain Hertz",
      "Sébastien Bonte",
      "Gauvain Devillez",
      "Hadrien Mélot"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:1811.02129",
    "title": "Modeling and Predicting Citation Count via Recurrent Neural Network with  Long Short-Term Memory",
    "abstract": " Comments: There is another new version of this paper. Please see arXiv:2005.14256 ",
    "url": "https://arxiv.org/abs/1811.02129",
    "authors": [
      "Sha Yuan",
      "Jie Tang",
      "Yu Zhang",
      "Yifan Wang",
      "Tong Xiao"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:1904.10278",
    "title": "Improving Differentiable Neural Computers Through Memory Masking,  De-allocation, and Link Distribution Sharpness Control",
    "abstract": " Title: Improving Differentiable Neural Computers Through Memory Masking,  De-allocation, and Link Distribution Sharpness Control ",
    "url": "https://arxiv.org/abs/1904.10278",
    "authors": [
      "Róbert Csordás",
      "Jürgen Schmidhuber"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:1905.09449",
    "title": "Exploring Structural Sparsity of Deep Networks via Inverse Scale Spaces",
    "abstract": " Comments: This is the journal extension version of the ICML conference paper, \"DessiLBI: Exploring Structural Sparsity of Deep Networks via Differential Inclusion Paths\" ",
    "url": "https://arxiv.org/abs/1905.09449",
    "authors": [
      "Yanwei Fu",
      "Chen Liu",
      "Donghao Li",
      "Zuyuan Zhong",
      "Xinwei Sun",
      "Jinshan Zeng",
      "Yuan Yao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2008.08349",
    "title": "The Neighborhood Polynomial of Chordal Graphs",
    "abstract": " Title: The Neighborhood Polynomial of Chordal Graphs ",
    "url": "https://arxiv.org/abs/2008.08349",
    "authors": [
      "Helena Bergold",
      "Winfried Hochstättler",
      "Uwe Mayer"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2010.03622",
    "title": "Theoretical Analysis of Self-Training with Deep Networks on Unlabeled  Data",
    "abstract": " Comments: Published at ICLR 2021 ",
    "url": "https://arxiv.org/abs/2010.03622",
    "authors": [
      "Colin Wei",
      "Kendrick Shen",
      "Yining Chen",
      "Tengyu Ma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2012.02383",
    "title": "SAM: Self-supervised Learning of Pixel-wise Anatomical Embeddings in  Radiological Images",
    "abstract": " Comments: 16 pages including appendix, accepted by IEEE Trans on Medical Imaging: this https URL ",
    "url": "https://arxiv.org/abs/2012.02383",
    "authors": [
      "Ke Yan",
      "Jinzheng Cai",
      "Dakai Jin",
      "Shun Miao",
      "Dazhou Guo",
      "Adam P. Harrison",
      "Youbao Tang",
      "Jing Xiao",
      "Jingjing Lu",
      "Le Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2102.03360",
    "title": "Scenario Generation for Cooling, Heating, and Power Loads Using  Generative Moment Matching Networks",
    "abstract": " Comments: This paper was accepted by CSEE Journal of Power and Energy Systems in June 2021 ",
    "url": "https://arxiv.org/abs/2102.03360",
    "authors": [
      "Wenlong Liao",
      "Yusen Wang",
      "Yuelong Wang",
      "Kody Powell",
      "Qi Liu",
      "Zhe Yang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2103.03113",
    "title": "Towards Deepening Graph Neural Networks: A GNTK-based Optimization  Perspective",
    "abstract": " Comments: 26 pages ",
    "url": "https://arxiv.org/abs/2103.03113",
    "authors": [
      "Wei Huang",
      "Yayong Li",
      "Weitao Du",
      "Jie Yin",
      "Richard Yi Da Xu",
      "Ling Chen",
      "Miao Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2104.06977",
    "title": "Discrete Cosine Transform Network for Guided Depth Map Super-Resolution",
    "abstract": " Comments: Accepted by CVPR 2022 (Oral) ",
    "url": "https://arxiv.org/abs/2104.06977",
    "authors": [
      "Zixiang Zhao",
      "Jiangshe Zhang",
      "Shuang Xu",
      "Zudi Lin",
      "Hanspeter Pfister"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.14291",
    "title": "Deep Learning on Monocular Object Pose Detection and Tracking: A  Comprehensive Overview",
    "abstract": " Comments: Accepted to ACM Computing Surveys (CSUR) ",
    "url": "https://arxiv.org/abs/2105.14291",
    "authors": [
      "Zhaoxin Fan",
      "Yazhi Zhu",
      "Yulin He",
      "Qi Sun",
      "Hongyan Liu",
      "Jun He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.10873",
    "title": "On the Certified Robustness for Ensemble Models and Beyond",
    "abstract": " Comments: ICLR 2022. 51 pages, 10 pages for main text. Forum and code: this https URL ",
    "url": "https://arxiv.org/abs/2107.10873",
    "authors": [
      "Zhuolin Yang",
      "Linyi Li",
      "Xiaojun Xu",
      "Bhavya Kailkhura",
      "Tao Xie",
      "Bo Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.12719",
    "title": "The CORSMAL benchmark for the prediction of the properties of containers",
    "abstract": " Comments: Authors' post-print accepted for publication in IEEE Access, see this https URL . 14 pages, 6 tables, 7 figures ",
    "url": "https://arxiv.org/abs/2107.12719",
    "authors": [
      "Alessio Xompero",
      "Santiago Donaher",
      "Vladimir Iashin",
      "Francesca Palermo",
      "Gökhan Solak",
      "Claudio Coppola",
      "Reina Ishikawa",
      "Yuichi Nagao",
      "Ryo Hachiuma",
      "Qi Liu",
      "Fan Feng",
      "Chuanlin Lan",
      "Rosa H. M. Chan",
      "Guilherme Christmann",
      "Jyun-Ting Song",
      "Gonuguntla Neeharika",
      "Chinnakotla Krishna Teja Reddy",
      "Dinesh Jain",
      "Bakhtawar Ur Rehman",
      "Andrea Cavallaro"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2108.02156",
    "title": "STBPU: A Reasonably Secure Branch Prediction Unit",
    "abstract": " Comments: 14 pages ",
    "url": "https://arxiv.org/abs/2108.02156",
    "authors": [
      "Tao Zhang",
      "Timothy Lesch",
      "Kenneth Koltermann",
      "Dmitry Evtyushkin"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2109.03554",
    "title": "Do What Nature Did To Us: Evolving Plastic Recurrent Neural Networks For  Task Generalization",
    "abstract": " Comments: Will Update, Rewrite, and Publish a new paper ",
    "url": "https://arxiv.org/abs/2109.03554",
    "authors": [
      "Fan Wang",
      "Hao Tian",
      "Haoyi Xiong",
      "Hua Wu",
      "Yang Cao",
      "Yu Kang",
      "Haifeng Wang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.09262",
    "title": "TOGA: A Neural Method for Test Oracle Generation",
    "abstract": " Comments: To appear in ICSE 2022 ",
    "url": "https://arxiv.org/abs/2109.09262",
    "authors": [
      "Elizabeth Dinella",
      "Gabriel Ryan",
      "Todd Mytkowicz",
      "Shuvendu K. Lahiri"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2110.03753",
    "title": "From Stars to Subgraphs: Uplifting Any GNN with Local Structure  Awareness",
    "abstract": " Comments: Expressive GNN framework ",
    "url": "https://arxiv.org/abs/2110.03753",
    "authors": [
      "Lingxiao Zhao",
      "Wei Jin",
      "Leman Akoglu",
      "Neil Shah"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.05424",
    "title": "Nonlocal diffusion of variable order on graphs",
    "abstract": " Title: Nonlocal diffusion of variable order on graphs ",
    "url": "https://arxiv.org/abs/2110.05424",
    "authors": [
      "Daniele Bertaccini",
      "Fabio Durastante"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2110.07732",
    "title": "The Neural Data Router: Adaptive Control Flow in Transformers Improves  Systematic Generalization",
    "abstract": " Comments: Accepted to ICLR 2022 ",
    "url": "https://arxiv.org/abs/2110.07732",
    "authors": [
      "Róbert Csordás",
      "Kazuki Irie",
      "Jürgen Schmidhuber"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2111.03892",
    "title": "TND-NAS: Towards Non-Differentiable Objectives in Differentiable Neural  Architecture Search",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2111.03892",
    "authors": [
      "Bo Lyu",
      "Shiping Wen",
      "Zheng Yan",
      "Kaibo Shi",
      "Ke Li",
      "Tingwen Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.05329",
    "title": "Self-Supervised Audio-Visual Representation Learning with Relaxed  Cross-Modal Synchronicity",
    "abstract": " Title: Self-Supervised Audio-Visual Representation Learning with Relaxed  Cross-Modal Synchronicity ",
    "url": "https://arxiv.org/abs/2111.05329",
    "authors": [
      "Pritam Sarkar",
      "Ali Etemad"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.10101",
    "title": "Deep Domain Adaptation for Pavement Crack Detection",
    "abstract": " Comments: 13 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2111.10101",
    "authors": [
      "Huijun Liu",
      "Chunhua Yang",
      "Ao Li",
      "Yongxin Ge",
      "Sheng Huang",
      "Xin Feng",
      "Zhimin Ruan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.11178",
    "title": "Anti-Jamming Games in Multi-Band Wireless Ad Hoc Networks",
    "abstract": " Comments: This manuscript was submitted to IEEE Transactions on Information Forensics and Security and a short version was submitted to IEEE GLOBECOM 2022 ",
    "url": "https://arxiv.org/abs/2111.11178",
    "authors": [
      "Hyeon-Seong Im",
      "Si-Hyeon Lee"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Computer Science and Game Theory (cs.GT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.14616",
    "title": "DeepGate: Learning Neural Representations of Logic Gates",
    "abstract": " Comments: Accepted by DAC2022 ",
    "url": "https://arxiv.org/abs/2111.14616",
    "authors": [
      "Min Li",
      "Sadaf Khan",
      "Zhengyuan Shi",
      "Naixing Wang",
      "Yu Huang",
      "Qiang Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.09298",
    "title": "Human-vehicle Cooperative Visual Perception for Autonomous Driving under  Complex Road and Traffic Scenarios",
    "abstract": " Title: Human-vehicle Cooperative Visual Perception for Autonomous Driving under  Complex Road and Traffic Scenarios ",
    "url": "https://arxiv.org/abs/2112.09298",
    "authors": [
      "Yiyue Zhao",
      "Cailin Lei",
      "Yu Shen",
      "Yuchuan Du",
      "Qijun Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.12130",
    "title": "NICE-SLAM: Neural Implicit Scalable Encoding for SLAM",
    "abstract": " Comments: CVPR 2022, first two authors contributed equally. Project page: this https URL ",
    "url": "https://arxiv.org/abs/2112.12130",
    "authors": [
      "Zihan Zhu",
      "Songyou Peng",
      "Viktor Larsson",
      "Weiwei Xu",
      "Hujun Bao",
      "Zhaopeng Cui",
      "Martin R. Oswald",
      "Marc Pollefeys"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.04678",
    "title": "Polynomial Turing Compressions for Some Graph Problems Parameterized by  Modular-Width",
    "abstract": " Comments: 25 pages ",
    "url": "https://arxiv.org/abs/2201.04678",
    "authors": [
      "Weidong Luo"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2201.05386",
    "title": "SRVIO: Super Robust Visual Inertial Odometry for dynamic environments  and challenging Loop-closure conditions",
    "abstract": " Comments: 11 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2201.05386",
    "authors": [
      "Ali Samadzadeh",
      "Ahmad Nickabadi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.06493",
    "title": "AutoAlign: Pixel-Instance Feature Aggregation for Multi-Modal 3D Object  Detection",
    "abstract": " Comments: Accepted to IJCAI2022 ",
    "url": "https://arxiv.org/abs/2201.06493",
    "authors": [
      "Zehui Chen",
      "Zhenyu Li",
      "Shiquan Zhang",
      "Liangji Fang",
      "Qinghong Jiang",
      "Feng Zhao",
      "Bolei Zhou",
      "Hang Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.06794",
    "title": "Resistance Training using Prior Bias: toward Unbiased Scene Graph  Generation",
    "abstract": " Comments: Accepted by AAAI 2022 ",
    "url": "https://arxiv.org/abs/2201.06794",
    "authors": [
      "Chao Chen",
      "Yibing Zhan",
      "Baosheng Yu",
      "Liu Liu",
      "Yong Luo",
      "Bo Du"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.07989",
    "title": "Self-supervised Video Representation Learning with Cascade Positive  Retrieval",
    "abstract": " Comments: To appear in CVPR 2022 L3D-IVU Workshop ",
    "url": "https://arxiv.org/abs/2201.07989",
    "authors": [
      "Cheng-En Wu",
      "Farley Lai",
      "Yu Hen Hu",
      "Asim Kadav"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.10460",
    "title": "Conditional entropy minimization principle for learning domain invariant  representation features",
    "abstract": " Comments: 7 pages ",
    "url": "https://arxiv.org/abs/2201.10460",
    "authors": [
      "Thuan Nguyen",
      "Boyang Lyu",
      "Prakash Ishwar",
      "Matthias Scheutz",
      "Shuchin Aeron"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.12895",
    "title": "Road User Position Prediction in Urban Environments via Locally Weighted  Learning",
    "abstract": " Title: Road User Position Prediction in Urban Environments via Locally Weighted  Learning ",
    "url": "https://arxiv.org/abs/2201.12895",
    "authors": [
      "Angelos Toytziaridis",
      "Paolo Falcone",
      "Jonas Sjöberg"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2202.03651",
    "title": "Causal Scene BERT: Improving object detection by searching for  challenging groups of data",
    "abstract": " Comments: In submission at JMLR; 0xe5110eA3B5014cd9a585Dc76c74Ee509F504Be14 ",
    "url": "https://arxiv.org/abs/2202.03651",
    "authors": [
      "Cinjon Resnick",
      "Or Litany",
      "Amlan Kar",
      "Karsten Kreis",
      "James Lucas",
      "Kyunghyun Cho",
      "Sanja Fidler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.06483",
    "title": "BiFSMN: Binary Neural Network for Keyword Spotting",
    "abstract": " Title: BiFSMN: Binary Neural Network for Keyword Spotting ",
    "url": "https://arxiv.org/abs/2202.06483",
    "authors": [
      "Haotong Qin",
      "Xudong Ma",
      "Yifu Ding",
      "Xiaoyang Li",
      "Yang Zhang",
      "Yao Tian",
      "Zejun Ma",
      "Jie Luo",
      "Xianglong Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2202.08916",
    "title": "Graph Convolutional Networks for Multi-modality Medical Imaging:  Methods, Architectures, and Clinical Applications",
    "abstract": " Title: Graph Convolutional Networks for Multi-modality Medical Imaging:  Methods, Architectures, and Clinical Applications ",
    "url": "https://arxiv.org/abs/2202.08916",
    "authors": [
      "Kexin Ding",
      "Mu Zhou",
      "Zichen Wang",
      "Qiao Liu",
      "Corey W. Arnold",
      "Shaoting Zhang",
      "Dimitri N. Metaxas"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.09873",
    "title": "NetSentry: A Deep Learning Approach to Detecting Incipient Large-scale  Network Attacks",
    "abstract": " Title: NetSentry: A Deep Learning Approach to Detecting Incipient Large-scale  Network Attacks ",
    "url": "https://arxiv.org/abs/2202.09873",
    "authors": [
      "Haoyu Liu",
      "Paul Patras"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2202.13799",
    "title": "OUR-GAN: One-shot Ultra-high-Resolution Generative Adversarial Networks",
    "abstract": " Comments: 28 pages, 23 figures ",
    "url": "https://arxiv.org/abs/2202.13799",
    "authors": [
      "Donghwee Yoon",
      "Junseok Oh",
      "Hayeong Choi",
      "Minjae Yi",
      "Injung Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2203.00597",
    "title": "Path sampling of recurrent neural networks by incorporating known  physics",
    "abstract": " Comments: Added results for open quantum system with dissipative photon dynamics ",
    "url": "https://arxiv.org/abs/2203.00597",
    "authors": [
      "Sun-Ting Tsai",
      "Eric Fields",
      "Yijia Xu",
      "En-Jui Kuo",
      "Pratyush Tiwary"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Soft Condensed Matter (cond-mat.soft)",
      "Machine Learning (cs.LG)",
      "Biological Physics (physics.bio-ph)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2203.00953",
    "title": "Computationally Efficient and Statistically Optimal Robust Low-rank  Matrix and Tensor Estimation",
    "abstract": " Title: Computationally Efficient and Statistically Optimal Robust Low-rank  Matrix and Tensor Estimation ",
    "url": "https://arxiv.org/abs/2203.00953",
    "authors": [
      "Yinan Shen",
      "Jingyang Li",
      "Jian-Feng Cai",
      "Dong Xia"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Information Theory (cs.IT)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.04516",
    "title": "Update Compression for Deep Neural Networks on the Edge",
    "abstract": " Comments: CVPR 2022 Mobile AI Workshop ",
    "url": "https://arxiv.org/abs/2203.04516",
    "authors": [
      "Bo Chen",
      "Ali Bakhshi",
      "Gustavo Batista",
      "Brian Ng",
      "Tat-Jun Chin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.12122",
    "title": "On Adversarial Robustness of Large-scale Audio Visual Learning",
    "abstract": " Title: On Adversarial Robustness of Large-scale Audio Visual Learning ",
    "url": "https://arxiv.org/abs/2203.12122",
    "authors": [
      "Juncheng B Li",
      "Shuhui Qu",
      "Xinjian Li",
      "Po-Yao Huang",
      "Florian Metze"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.12235",
    "title": "Geometry-Aware Supertagging with Heterogeneous Dynamic Convolutions",
    "abstract": " Comments: 8 pages plus references, unpublished preprint v2: fixed small typos, added appendix with a visualization of the decoding process ",
    "url": "https://arxiv.org/abs/2203.12235",
    "authors": [
      "Konstantinos Kogkalidis",
      "Michael Moortgat"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16263",
    "title": "Does Audio Deepfake Detection Generalize?",
    "abstract": " Comments: Submitted to Interspeech 2022 ",
    "url": "https://arxiv.org/abs/2203.16263",
    "authors": [
      "Nicolas M. Müller",
      "Pavel Czempin",
      "Franziska Dieckmann",
      "Adam Froghyar",
      "Konstantin Böttinger"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.02057",
    "title": "Large-Scale Shill Bidder Detection in E-commerce",
    "abstract": " Title: Large-Scale Shill Bidder Detection in E-commerce ",
    "url": "https://arxiv.org/abs/2204.02057",
    "authors": [
      "Michael Fire",
      "Rami Puzis",
      "Dima Kagan",
      "Yuval Elovici"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.07657",
    "title": "Accurate detection of sepsis at ED triage using machine learning with  clinical natural language processing",
    "abstract": " Comments: 35 pages, 1 figure, 6 tables, 7 supplementary tables ",
    "url": "https://arxiv.org/abs/2204.07657",
    "authors": [
      "Oleksandr Ivanov",
      "Karin Molander",
      "Robert Dunne",
      "Stephen Liu",
      "Kevin Masek",
      "Erica Lewis",
      "Lisa Wolf",
      "Debbie Travers",
      "Deena Brecher",
      "Deb Delaney",
      "Kyla Montgomery",
      "Christian Reilly"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.07887",
    "title": "Mapping LiDAR and Camera Measurements in a Dual Top-View Grid  Representation Tailored for Automated Vehicles",
    "abstract": " Title: Mapping LiDAR and Camera Measurements in a Dual Top-View Grid  Representation Tailored for Automated Vehicles ",
    "url": "https://arxiv.org/abs/2204.07887",
    "authors": [
      "Sven Richter",
      "Frank Bieder",
      "Sascha Wirges",
      "Christoph Stiller"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08414",
    "title": "STONet: A Neural-Operator-Driven Spatio-temporal Network",
    "abstract": " Comments: 9 pages ",
    "url": "https://arxiv.org/abs/2204.08414",
    "authors": [
      "Haitao Lin",
      "Guojiang Zhao",
      "Lirong Wu",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.08454",
    "title": "Revisiting Consistency Regularization for Semi-supervised Change  Detection in Remote Sensing Images",
    "abstract": " Comments: Code available at this https URL 36 pages ",
    "url": "https://arxiv.org/abs/2204.08454",
    "authors": [
      "Wele Gedara Chaminda Bandara",
      "Vishal M. Patel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.08743",
    "title": "On the Use of Causal Graphical Models for Designing Experiments in the  Automotive Domain",
    "abstract": " Title: On the Use of Causal Graphical Models for Designing Experiments in the  Automotive Domain ",
    "url": "https://arxiv.org/abs/2204.08743",
    "authors": [
      "David Issa Mattos",
      "Yuchu Liu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.08766",
    "title": "Modeling Missing Annotations for Incremental Learning in Object  Detection",
    "abstract": " Comments: Accepted in CVPR-Workshop (CLVISION) 2022 ",
    "url": "https://arxiv.org/abs/2204.08766",
    "authors": [
      "Fabio Cermelli",
      "Antonino Geraci",
      "Dario Fontanel",
      "Barbara Caputo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08958",
    "title": "MANIQA: Multi-dimension Attention Network for No-Reference Image Quality  Assessment",
    "abstract": " Title: MANIQA: Multi-dimension Attention Network for No-Reference Image Quality  Assessment ",
    "url": "https://arxiv.org/abs/2204.08958",
    "authors": [
      "Sidi Yang",
      "Tianhe Wu",
      "Shuwei Shi",
      "Shanshan Lao",
      "Yuan Gong",
      "Mingdeng Cao",
      "Jiahao Wang",
      "Yujiu Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  }
]