[
  {
    "id": "arXiv:2302.01374",
    "title": "Neural Network Architecture for Database Augmentation Using Shared  Features",
    "abstract": "The popularity of learning from data with machine learning and neural networks has lead to the creation of many new datasets for almost every problem domain. However, even within a single domain, these datasets are often collected with disparate features, sampled from different sub-populations, and recorded at different time points. Even with the plethora of individual datasets, large data science projects can be difficult as it is often not trivial to merge these smaller datasets. Inherent challenges in some domains such as medicine also makes it very difficult to create large single source datasets or multi-source datasets with identical features. Instead of trying to merge these non-matching datasets directly, we propose a neural network architecture that can provide data augmentation using features common between these datasets. Our results show that this style of data augmentation can work for both image and tabular data. ",
    "url": "https://arxiv.org/abs/2302.01374",
    "authors": [
      "William C. Sleeman IV",
      "Rishabh Kapoor",
      "Preetam Ghosh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01375",
    "title": "On the Robustness of Randomized Ensembles to Adversarial Perturbations",
    "abstract": "Randomized ensemble classifiers (RECs), where one classifier is randomly selected during inference, have emerged as an attractive alternative to traditional ensembling methods for realizing adversarially robust classifiers with limited compute requirements. However, recent works have shown that existing methods for constructing RECs are more vulnerable than initially claimed, casting major doubts on their efficacy and prompting fundamental questions such as: \"When are RECs useful?\", \"What are their limits?\", and \"How do we train them?\". In this work, we first demystify RECs as we derive fundamental results regarding their theoretical limits, necessary and sufficient conditions for them to be useful, and more. Leveraging this new understanding, we propose a new boosting algorithm (BARRE) for training robust RECs, and empirically demonstrate its effectiveness at defending against strong $\\ell_\\infty$ norm-bounded adversaries across various network architectures and datasets. ",
    "url": "https://arxiv.org/abs/2302.01375",
    "authors": [
      "Hassan Dbouk",
      "Naresh R. Shanbhag"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.01381",
    "title": "Effective Robustness against Natural Distribution Shifts for Models with  Different Training Data",
    "abstract": "``Effective robustness'' measures the extra out-of-distribution (OOD) robustness beyond what can be predicted from the in-distribution (ID) performance. Existing effective robustness evaluations typically use a single test set such as ImageNet to evaluate ID accuracy. This becomes problematic when evaluating models trained on different data distributions, e.g., comparing models trained on ImageNet vs. zero-shot language-image pre-trained models trained on LAION. In this paper, we propose a new effective robustness evaluation metric to compare the effective robustness of models trained on different data distributions. To do this we control for the accuracy on multiple ID test sets that cover the training distributions for all the evaluated models. Our new evaluation metric provides a better estimate of the effectiveness robustness and explains the surprising effective robustness gains of zero-shot CLIP-like models exhibited when considering only one ID dataset, while the gains diminish under our evaluation. ",
    "url": "https://arxiv.org/abs/2302.01381",
    "authors": [
      "Zhouxing Shi",
      "Nicholas Carlini",
      "Ananth Balashankar",
      "Ludwig Schmidt",
      "Cho-Jui Hsieh",
      "Alex Beutel",
      "Yao Qin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.01382",
    "title": "Mixed Precision Post Training Quantization of Neural Networks with  Sensitivity Guided Search",
    "abstract": "Serving large-scale machine learning (ML) models efficiently and with low latency has become challenging owing to increasing model size and complexity. Quantizing models can simultaneously reduce memory and compute requirements, facilitating their widespread access. However, for large models not all layers are equally amenable to the same numerical precision and aggressive quantization can lead to unacceptable loss in model accuracy. One approach to prevent this accuracy degradation is mixed-precision quantization, which allows different tensors to be quantized to varying levels of numerical precision, leveraging the capabilities of modern hardware. Such mixed-precision quantiztaion can more effectively allocate numerical precision to different tensors `as needed' to preserve model accuracy while reducing footprint and compute latency. In this paper, we propose a method to efficiently determine quantization configurations of different tensors in ML models using post-training mixed precision quantization. We analyze three sensitivity metrics and evaluate them for guiding configuration search of two algorithms. We evaluate our method for computer vision and natural language processing and demonstrate latency reductions of up to 27.59% and 34.31% compared to the baseline 16-bit floating point model while guaranteeing no more than 1% accuracy degradation. ",
    "url": "https://arxiv.org/abs/2302.01382",
    "authors": [
      "Clemens JS Schaefer",
      "Elfie Guo",
      "Caitlin Stanton",
      "Xiaofan Zhang",
      "Tom Jablin",
      "Navid Lambert-Shirzad",
      "Jian Li",
      "Chiachen Chou",
      "Yu Emma Wang",
      "Siddharth Joshi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01384",
    "title": "Energy-Inspired Self-Supervised Pretraining for Vision Models",
    "abstract": "Motivated by the fact that forward and backward passes of a deep network naturally form symmetric mappings between input and output representations, we introduce a simple yet effective self-supervised vision model pretraining framework inspired by energy-based models (EBMs). In the proposed framework, we model energy estimation and data restoration as the forward and backward passes of a single network without any auxiliary components, e.g., an extra decoder. For the forward pass, we fit a network to an energy function that assigns low energy scores to samples that belong to an unlabeled dataset, and high energy otherwise. For the backward pass, we restore data from corrupted versions iteratively using gradient-based optimization along the direction of energy minimization. In this way, we naturally fold the encoder-decoder architecture widely used in masked image modeling into the forward and backward passes of a single vision model. Thus, our framework now accepts a wide range of pretext tasks with different data corruption methods, and permits models to be pretrained from masked image modeling, patch sorting, and image restoration, including super-resolution, denoising, and colorization. We support our findings with extensive experiments, and show the proposed method delivers comparable and even better performance with remarkably fewer epochs of training compared to the state-of-the-art self-supervised vision model pretraining methods. Our findings shed light on further exploring self-supervised vision model pretraining and pretext tasks beyond masked image modeling. ",
    "url": "https://arxiv.org/abs/2302.01384",
    "authors": [
      "Ze Wang",
      "Jiang Wang",
      "Zicheng Liu",
      "Qiang Qiu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.01388",
    "title": "Statistical Verification of Traffic Systems with Expected Differential  Privacy",
    "abstract": "Traffic systems are multi-agent cyber-physical systems whose performance is closely related to human welfare. They work in open environments and are subject to uncertainties from various sources, making their performance hard to verify by traditional model-based approaches. Alternatively, statistical model checking (SMC) can verify their performance by sequentially drawing sample data until the correctness of a performance specification can be inferred with desired statistical accuracy. This work aims to verify traffic systems with privacy, motivated by the fact that the data used may include personal information (e.g., daily itinerary) and get leaked unintendedly by observing the execution of the SMC algorithm. To formally capture data privacy in SMC, we introduce the concept of expected differential privacy (EDP), which constrains how much the algorithm execution can change in the expectation sense when data change. Accordingly, we introduce an exponential randomization mechanism for the SMC algorithm to achieve the EDP. Our case study on traffic intersections by Vissim simulation shows the high accuracy of SMC in traffic model verification without significantly sacrificing computing efficiency. The case study also shows EDP successfully bounding the algorithm outputs to guarantee privacy. ",
    "url": "https://arxiv.org/abs/2302.01388",
    "authors": [
      "Mark Yen",
      "Geir E. Dullerud",
      "Yu Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Systems and Control (eess.SY)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:2302.01403",
    "title": "Self-Supervised Relation Alignment for Scene Graph Generation",
    "abstract": "The goal of scene graph generation is to predict a graph from an input image, where nodes correspond to identified and localized objects and edges to their corresponding interaction predicates. Existing methods are trained in a fully supervised manner and focus on message passing mechanisms, loss functions, and/or bias mitigation. In this work we introduce a simple-yet-effective self-supervised relational alignment regularization designed to improve the scene graph generation performance. The proposed alignment is general and can be combined with any existing scene graph generation framework, where it is trained alongside the original model's objective. The alignment is achieved through distillation, where an auxiliary relation prediction branch, that mirrors and shares parameters with the supervised counterpart, is designed. In the auxiliary branch, relational input features are partially masked prior to message passing and predicate prediction. The predictions for masked relations are then aligned with the supervised counterparts after the message passing. We illustrate the effectiveness of this self-supervised relational alignment in conjunction with two scene graph generation architectures, SGTR and Neural Motifs, and show that in both cases we achieve significantly improved performance. ",
    "url": "https://arxiv.org/abs/2302.01403",
    "authors": [
      "Bicheng Xu",
      "Renjie Liao",
      "Leonid Sigal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.01404",
    "title": "Provably Bounding Neural Network Preimages",
    "abstract": "Most work on the formal verification of neural networks has focused on bounding forward images of neural networks, i.e., the set of outputs of a neural network that correspond to a given set of inputs (for example, bounded perturbations of a nominal input). However, many use cases of neural network verification require solving the inverse problem, i.e, over-approximating the set of inputs that lead to certain outputs. In this work, we present the first efficient bound propagation algorithm, INVPROP, for verifying properties over the preimage of a linearly constrained output set of a neural network, which can be combined with branch-and-bound to achieve completeness. Our efficient algorithm allows multiple passes of intermediate bound refinements, which are crucial for tight inverse verification because the bounds of an intermediate layer depend on relaxations both before and after this layer. We demonstrate our algorithm on applications related to quantifying safe control regions for a dynamical system and detecting out-of-distribution inputs to a neural network. Our results show that in certain settings, we can find over-approximations that are over 2500 times tighter than prior work while being 2.5 times faster on the same hardware. ",
    "url": "https://arxiv.org/abs/2302.01404",
    "authors": [
      "Suhas Kotha",
      "Christopher Brix",
      "Zico Kolter",
      "Krishnamurthy",
      "Dvijotham",
      "Huan Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.01416",
    "title": "Neural Insights for Digital Marketing Content Design",
    "abstract": "In digital marketing, experimenting with new website content is one of the key levers to improve customer engagement. However, creating successful marketing content is a manual and time-consuming process that lacks clear guiding principles. This paper seeks to close the loop between content creation and online experimentation by offering marketers AI-driven actionable insights based on historical data to improve their creative process. We present a neural-network-based system that scores and extracts insights from a marketing content design, namely, a multimodal neural network predicts the attractiveness of marketing contents, and a post-hoc attribution method generates actionable insights for marketers to improve their content in specific marketing locations. Our insights not only point out the advantages and drawbacks of a given current content, but also provide design recommendations based on historical data. We show that our scoring model and insights work well both quantitatively and qualitatively. ",
    "url": "https://arxiv.org/abs/2302.01416",
    "authors": [
      "Fanjie Kong",
      "Yuan Li",
      "Houssam Nassif",
      "Tanner Fiez",
      "Shreya Chakrabarti",
      "Ricardo Henao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.01417",
    "title": "A Convolutional-based Model for Early Prediction of Alzheimer's based on  the Dementia Stage in the MRI Brain Images",
    "abstract": "Alzheimer's disease is a degenerative brain disease. Being the primary cause of Dementia in adults and progressively destroys brain memory. Though Alzheimer's disease does not have a cure currently, diagnosing it at an earlier stage will help reduce the severity of the disease. Thus, early diagnosis of Alzheimer's could help to reduce or stop the disease from progressing. In this paper, we proposed a deep convolutional neural network-based model for learning model using to determine the stage of Dementia in adults based on the Magnetic Resonance Imaging (MRI) images to detect the early onset of Alzheimer's. ",
    "url": "https://arxiv.org/abs/2302.01417",
    "authors": [
      "Shrish Pellakur",
      "Nelly Elsayed",
      "Zag ElSayed",
      "Murat Ozer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.01428",
    "title": "Dataset Distillation Fixes Dataset Reconstruction Attacks",
    "abstract": "Modern deep learning requires large volumes of data, which could contain sensitive or private information which cannot be leaked. Recent work has shown for homogeneous neural networks a large portion of this training data could be reconstructed with only access to the trained network parameters. While the attack was shown to work empirically, there exists little formal understanding of its effectiveness regime, and ways to defend against it. In this work, we first build a stronger version of the dataset reconstruction attack and show how it can provably recover its entire training set in the infinite width regime. We then empirically study the characteristics of this attack on two-layer networks and reveal that its success heavily depends on deviations from the frozen infinite-width Neural Tangent Kernel limit. More importantly, we formally show for the first time that dataset reconstruction attacks are a variation of dataset distillation. This key theoretical result on the unification of dataset reconstruction and distillation not only sheds more light on the characteristics of the attack but enables us to design defense mechanisms against them via distillation algorithms. ",
    "url": "https://arxiv.org/abs/2302.01428",
    "authors": [
      "Noel Loo",
      "Ramin Hasani",
      "Mathias Lechner",
      "Daniela Rus"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.01440",
    "title": "Generalized Uncertainty of Deep Neural Networks: Taxonomy and  Applications",
    "abstract": "Deep neural networks have seen enormous success in various real-world applications. Beyond their predictions as point estimates, increasing attention has been focused on quantifying the uncertainty of their predictions. In this review, we show that the uncertainty of deep neural networks is not only important in a sense of interpretability and transparency, but also crucial in further advancing their performance, particularly in learning systems seeking robustness and efficiency. We will generalize the definition of the uncertainty of deep neural networks to any number or vector that is associated with an input or an input-label pair, and catalog existing methods on ``mining'' such uncertainty from a deep model. We will include those methods from the classic field of uncertainty quantification as well as those methods that are specific to deep neural networks. We then show a wide spectrum of applications of such generalized uncertainty in realistic learning tasks including robust learning such as noisy learning, adversarially robust learning; data-efficient learning such as semi-supervised and weakly-supervised learning; and model-efficient learning such as model compression and knowledge distillation. ",
    "url": "https://arxiv.org/abs/2302.01440",
    "authors": [
      "Chengyu Dong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.01459",
    "title": "A sliced-Wasserstein distance-based approach for  out-of-class-distribution detection",
    "abstract": "There exist growing interests in intelligent systems for numerous medical imaging, image processing, and computer vision applications, such as face recognition, medical diagnosis, character recognition, and self-driving cars, among others. These applications usually require solving complex classification problems involving complex images with unknown data generative processes. In addition to recent successes of the current classification approaches relying on feature engineering and deep learning, several shortcomings of them, such as the lack of robustness, generalizability, and interpretability, have also been observed. These methods often require extensive training data, are computationally expensive, and are vulnerable to out-of-distribution samples, e.g., adversarial attacks. Recently, an accurate, data-efficient, computationally efficient, and robust transport-based classification approach has been proposed, which describes a generative model-based problem formulation and closed-form solution for a specific category of classification problems. However, all these approaches lack mechanisms to detect test samples outside the class distributions used during training. In real-world settings, where the collected training samples are unable to exhaust or cover all classes, the traditional classification schemes are unable to handle the unseen classes effectively, which is especially an important issue for safety-critical systems, such as self-driving and medical imaging diagnosis. In this work, we propose a method for detecting out-of-class distributions based on the distribution of sliced-Wasserstein distance from the Radon Cumulative Distribution Transform (R-CDT) subspace. We tested our method on the MNIST and two medical image datasets and reported better accuracy than the state-of-the-art methods without an out-of-class distribution detection procedure. ",
    "url": "https://arxiv.org/abs/2302.01459",
    "authors": [
      "Mohammad Shifat E Rabbi",
      "Abu Hasnat Mohammad Rubaiyat",
      "Yan Zhuang",
      "Gustavo K Rohde"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.01471",
    "title": "User-centric Heterogeneous-action Deep Reinforcement Learning for  Virtual Reality in the Metaverse over Wireless Networks",
    "abstract": "The Metaverse is emerging as maturing technologies are empowering the different facets. Virtual Reality (VR) technologies serve as the backbone of the virtual universe within the Metaverse to offer a highly immersive user experience. As mobility is emphasized in the Metaverse context, VR devices reduce their weights at the sacrifice of local computation abilities. In this paper, for a system consisting of a Metaverse server and multiple VR users, we consider two cases of (i) the server generating frames and transmitting them to users, and (ii) users generating frames locally and thus consuming device energy. Moreover, in our multi-user VR scenario for the Metaverse, users have different characteristics and demands for Frames Per Second (FPS). Then the channel access arrangement (including the decisions on frame generation location), and transmission powers for the downlink communications from the server to the users are jointly optimized to improve the utilities of users. This joint optimization is addressed by deep reinforcement learning (DRL) with heterogeneous actions. Our proposed user-centric DRL algorithm is called User-centric Critic with Heterogenous Actors (UCHA). Extensive experiments demonstrate that our UCHA algorithm leads to remarkable results under various requirements and constraints. ",
    "url": "https://arxiv.org/abs/2302.01471",
    "authors": [
      "Wenhan Yu",
      "Terence Jie Chua",
      "Jun Zhao"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01474",
    "title": "Defensive ML: Defending Architectural Side-channels with Adversarial  Obfuscation",
    "abstract": "Side-channel attacks that use machine learning (ML) for signal analysis have become prominent threats to computer security, as ML models easily find patterns in signals. To address this problem, this paper explores using Adversarial Machine Learning (AML) methods as a defense at the computer architecture layer to obfuscate side channels. We call this approach Defensive ML, and the generator to obfuscate signals, defender. Defensive ML is a workflow to design, implement, train, and deploy defenders for different environments. First, we design a defender architecture given the physical characteristics and hardware constraints of the side-channel. Next, we use our DefenderGAN structure to train the defender. Finally, we apply defensive ML to thwart two side-channel attacks: one based on memory contention and the other on application power. The former uses a hardware defender with ns-level response time that attains a high level of security with half the performance impact of a traditional scheme; the latter uses a software defender with ms-level response time that provides better security than a traditional scheme with only 70% of its power overhead. ",
    "url": "https://arxiv.org/abs/2302.01474",
    "authors": [
      "Hyoungwook Nam",
      "Raghavendra Pradyumna Pothukuchi",
      "Bo Li",
      "Nam Sung Kim",
      "Josep Torrellas"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Hardware Architecture (cs.AR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01478",
    "title": "Clustered Embedding Learning for Recommender Systems",
    "abstract": "In recent years, recommender systems have advanced rapidly, where embedding learning for users and items plays a critical role. A standard method learns a unique embedding vector for each user and item. However, such a method has two important limitations in real-world applications: 1) it is hard to learn embeddings that generalize well for users and items with rare interactions on their own; and 2) it may incur unbearably high memory costs when the number of users and items scales up. Existing approaches either can only address one of the limitations or have flawed overall performances. In this paper, we propose Clustered Embedding Learning (CEL) as an integrated solution to these two problems. CEL is a plug-and-play embedding learning framework that can be combined with any differentiable feature interaction model. It is capable of achieving improved performance, especially for cold users and items, with reduced memory cost. CEL enables automatic and dynamic clustering of users and items in a top-down fashion, where clustered entities jointly learn a shared embedding. The accelerated version of CEL has an optimal time complexity, which supports efficient online updates. Theoretically, we prove the identifiability and the existence of a unique optimal number of clusters for CEL in the context of nonnegative matrix factorization. Empirically, we validate the effectiveness of CEL on three public datasets and one business dataset, showing its consistently superior performance against current state-of-the-art methods. In particular, when incorporating CEL into the business model, it brings an improvement of $+0.6\\%$ in AUC, which translates into a significant revenue gain; meanwhile, the size of the embedding table gets $2650$ times smaller. ",
    "url": "https://arxiv.org/abs/2302.01478",
    "authors": [
      "Yizhou Chen",
      "Guangda Huzhang",
      "Anxiang Zeng",
      "Qingtao Yu",
      "Hui Sun",
      "Hengyi Li",
      "Jingyi Li",
      "Yabo Ni",
      "Han Yu",
      "Zhiming Zhou"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01483",
    "title": "SPADE: Self-supervised Pretraining for Acoustic DisEntanglement",
    "abstract": "Self-supervised representation learning approaches have grown in popularity due to the ability to train models on large amounts of unlabeled data and have demonstrated success in diverse fields such as natural language processing, computer vision, and speech. Previous self-supervised work in the speech domain has disentangled multiple attributes of speech such as linguistic content, speaker identity, and rhythm. In this work, we introduce a self-supervised approach to disentangle room acoustics from speech and use the acoustic representation on the downstream task of device arbitration. Our results demonstrate that our proposed approach significantly improves performance over a baseline when labeled training data is scarce, indicating that our pretraining scheme learns to encode room acoustic information while remaining invariant to other attributes of the speech signal. ",
    "url": "https://arxiv.org/abs/2302.01483",
    "authors": [
      "John Harvill",
      "Jarred Barber",
      "Arun Nair",
      "Ramin Pishehvar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2302.01486",
    "title": "Xtal2DoS: Attention-based Crystal to Sequence Learning for Density of  States Prediction",
    "abstract": "Modern machine learning techniques have been extensively applied to materials science, especially for property prediction tasks. A majority of these methods address scalar property predictions, while more challenging spectral properties remain less emphasized. We formulate a crystal-to-sequence learning task and propose a novel attention-based learning method, Xtal2DoS, which decodes the sequential representation of the material density of states (DoS) properties by incorporating the learned atomic embeddings through attention networks. Experiments show Xtal2DoS is faster than the existing models, and consistently outperforms other state-of-the-art methods on four metrics for two fundamental spectral properties, phonon and electronic DoS. ",
    "url": "https://arxiv.org/abs/2302.01486",
    "authors": [
      "Junwen Bai",
      "Yuanqi Du",
      "Yingheng Wang",
      "Shufeng Kong",
      "John Gregoire",
      "Carla Gomes"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01500",
    "title": "Spiking Synaptic Penalty: Appropriate Penalty Term for Energy-Efficient  Spiking Neural Networks",
    "abstract": "Spiking neural networks (SNNs) are energy-efficient neural networks because of their spiking nature. However, as the spike firing rate of SNNs increases, the energy consumption does as well, and thus, the advantage of SNNs diminishes. Here, we tackle this problem by introducing a novel penalty term for the spiking activity into the objective function in the training phase. Our method is designed so as to optimize the energy consumption metric directly without modifying the network architecture. Therefore, the proposed method can reduce the energy consumption more than other methods while maintaining the accuracy. We conducted experiments for image classification tasks, and the results indicate the effectiveness of the proposed method, which mitigates the dilemma of the energy--accuracy trade-off. ",
    "url": "https://arxiv.org/abs/2302.01500",
    "authors": [
      "Kazuma Suetake",
      "Takuya Ushimaru",
      "Ryuji Saiin",
      "Yoshihide Sawada"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2302.01501",
    "title": "ANTM: An Aligned Neural Topic Model for Exploring Evolving Topics",
    "abstract": "As the amount of text data generated by humans and machines increases, the necessity of understanding large corpora and finding a way to extract insights from them is becoming more crucial than ever. Dynamic topic models are effective methods that primarily focus on studying the evolution of topics present in a collection of documents. These models are widely used for understanding trends, exploring public opinion in social networks, or tracking research progress and discoveries in scientific archives. Since topics are defined as clusters of semantically similar documents, it is necessary to observe the changes in the content or themes of these clusters in order to understand how topics evolve as new knowledge is discovered over time. In this paper, we introduce the Aligned Neural Topic Model (ANTM), a dynamic neural topic model that uses document embeddings to compute clusters of semantically similar documents at different periods and to align document clusters to represent their evolution. This alignment procedure preserves the temporal similarity of document clusters over time and captures the semantic change of words characterized by their context within different periods. Experiments on four different datasets show that ANTM outperforms probabilistic dynamic topic models (e.g. DTM, DETM) and significantly improves topic coherence and diversity over other existing dynamic neural topic models (e.g. BERTopic). ",
    "url": "https://arxiv.org/abs/2302.01501",
    "authors": [
      "Hamed Rahimi",
      "Hubert Naacke",
      "Camelia Constantin",
      "Bernd Amann"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2302.01503",
    "title": "LazyGNN: Large-Scale Graph Neural Networks via Lazy Propagation",
    "abstract": "Recent works have demonstrated the benefits of capturing long-distance dependency in graphs by deeper graph neural networks (GNNs). But deeper GNNs suffer from the long-lasting scalability challenge due to the neighborhood explosion problem in large-scale graphs. In this work, we propose to capture long-distance dependency in graphs by shallower models instead of deeper models, which leads to a much more efficient model, LazyGNN, for graph representation learning. Moreover, we demonstrate that LazyGNN is compatible with existing scalable approaches (such as sampling methods) for further accelerations through the development of mini-batch LazyGNN. Comprehensive experiments demonstrate its superior prediction performance and scalability on large-scale benchmarks. LazyGNN also achieves state-of-art performance on the OGB leaderboard. ",
    "url": "https://arxiv.org/abs/2302.01503",
    "authors": [
      "Rui Xue",
      "Haoyu Han",
      "MohamadAli Torkamani",
      "Jian Pei",
      "Xiaorui Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01518",
    "title": "LSA-PINN: Linear Boundary Connectivity Loss for Solving PDEs on Complex  Geometry",
    "abstract": "We present a novel loss formulation for efficient learning of complex dynamics from governing physics, typically described by partial differential equations (PDEs), using physics-informed neural networks (PINNs). In our experiments, existing versions of PINNs are seen to learn poorly in many problems, especially for complex geometries, as it becomes increasingly difficult to establish appropriate sampling strategy at the near boundary region. Overly dense sampling can adversely impede training convergence if the local gradient behaviors are too complex to be adequately modelled by PINNs. On the other hand, if the samples are too sparse, existing PINNs tend to overfit the near boundary region, leading to incorrect solution. To prevent such issues, we propose a new Boundary Connectivity (BCXN) loss function which provides linear local structure approximation (LSA) to the gradient behaviors at the boundary for PINN. Our BCXN-loss implicitly imposes local structure during training, thus facilitating fast physics-informed learning across entire problem domains with order of magnitude sparser training samples. This LSA-PINN method shows a few orders of magnitude smaller errors than existing methods in terms of the standard L2-norm metric, while using dramatically fewer training samples and iterations. Our proposed LSA-PINN does not pose any requirement on the differentiable property of the networks, and we demonstrate its benefits and ease of implementation on both multi-layer perceptron and convolutional neural network versions as commonly used in current PINN literature. ",
    "url": "https://arxiv.org/abs/2302.01518",
    "authors": [
      "Jian Cheng Wong",
      "Pao-Hsiung Chiu",
      "Chinchun Ooi",
      "My Ha Dao",
      "Yew-Soon Ong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2302.01524",
    "title": "Ordered GNN: Ordering Message Passing to Deal with Heterophily and  Over-smoothing",
    "abstract": "Most graph neural networks follow the message passing mechanism. However, it faces the over-smoothing problem when multiple times of message passing is applied to a graph, causing indistinguishable node representations and prevents the model to effectively learn dependencies between farther-away nodes. On the other hand, features of neighboring nodes with different labels are likely to be falsely mixed, resulting in the heterophily problem. In this work, we propose to order the messages passing into the node representation, with specific blocks of neurons targeted for message passing within specific hops. This is achieved by aligning the hierarchy of the rooted-tree of a central node with the ordered neurons in its node representation. Experimental results on an extensive set of datasets show that our model can simultaneously achieve the state-of-the-art in both homophily and heterophily settings, without any targeted design. Moreover, its performance maintains pretty well while the model becomes really deep, effectively preventing the over-smoothing problem. Finally, visualizing the gating vectors shows that our model learns to behave differently between homophily and heterophily settings, providing an explainable graph neural model. ",
    "url": "https://arxiv.org/abs/2302.01524",
    "authors": [
      "Yunchong Song",
      "Chenghu Zhou",
      "Xinbing Wang",
      "Zhouhan Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01532",
    "title": "INV: Towards Streaming Incremental Neural Videos",
    "abstract": "Recent works in spatiotemporal radiance fields can produce photorealistic free-viewpoint videos. However, they are inherently unsuitable for interactive streaming scenarios (e.g. video conferencing, telepresence) because have an inevitable lag even if the training is instantaneous. This is because these approaches consume videos and thus have to buffer chunks of frames (often seconds) before processing. In this work, we take a step towards interactive streaming via a frame-by-frame approach naturally free of lag. Conventional wisdom believes that per-frame NeRFs are impractical due to prohibitive training costs and storage. We break this belief by introducing Incremental Neural Videos (INV), a per-frame NeRF that is efficiently trained and streamable. We designed INV based on two insights: (1) Our main finding is that MLPs naturally partition themselves into Structure and Color Layers, which store structural and color/texture information respectively. (2) We leverage this property to retain and improve upon knowledge from previous frames, thus amortizing training across frames and reducing redundant learning. As a result, with negligible changes to NeRF, INV can achieve good qualities (>28.6db) in 8min/frame. It can also outperform prior SOTA in 19% less training time. Additionally, our Temporal Weight Compression reduces the per-frame size to 0.3MB/frame (6.6% of NeRF). More importantly, INV is free from buffer lag and is naturally fit for streaming. While this work does not achieve real-time training, it shows that incremental approaches like INV present new possibilities in interactive 3D streaming. Moreover, our discovery of natural information partition leads to a better understanding and manipulation of MLPs. Code and dataset will be released soon. ",
    "url": "https://arxiv.org/abs/2302.01532",
    "authors": [
      "Shengze Wang",
      "Alexey Supikov",
      "Joshua Ratcliff",
      "Henry Fuchs",
      "Ronald Azuma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2302.01556",
    "title": "Machine Learning for UAV Propeller Fault Detection based on a Hybrid  Data Generation Model",
    "abstract": "This paper describes the development of an on-board data-driven system that can monitor and localize the fault in a quadrotor unmanned aerial vehicle (UAV) and at the same time, evaluate the degree of damage of the fault under real scenarios. To achieve offline training data generation, a hybrid approach is proposed for the development of a virtual data-generative model using a combination of data-driven models as well as well-established dynamic models that describe the kinematics of the UAV. To effectively represent the drop in performance of a faulty propeller, a variation of the deep neural network, a LSTM network is proposed. With the RPM of the propeller as input and based on the fault condition of the propeller, the proposed propeller model estimates the resultant torque and thrust. Then, flight datasets of the UAV under various fault scenarios are generated via simulation using the developed data-generative model. Lastly, a fault classifier using a CNN model is proposed to identify as well as evaluate the degree of damage to the damaged propeller. The scope of this paper focuses on the identification of faulty propellers and classification of the fault level for quadrotor UAVs using RPM as well as flight data. Doing so allows for early minor fault detection to prevent serious faults from occurring if the fault is left unrepaired. To further validate the workability of this approach outside of simulation, a real-flight test is conducted indoors. The real flight data is collected and a simulation to real sim-real test is conducted. Due to the imperfections in the build of our experimental UAV, a slight calibration approach to our simulation model is further proposed and the experimental results obtained show that our trained model can identify the location of propeller fault as well as the degree/type of damage. Currently, the diagnosis accuracy on the testing set is over 80%. ",
    "url": "https://arxiv.org/abs/2302.01556",
    "authors": [
      "J.J. Tong",
      "W. Zhang",
      "F. Liao",
      "C.F. Li",
      "Y.F. Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01561",
    "title": "Hierarchically Composing Level Generators for the Creation of Complex  Structures",
    "abstract": "Procedural content generation (PCG) is a growing field, with numerous applications in the video game industry, and great potential to help create better games at a fraction of the cost of manual creation. However, much of the work in PCG is focused on generating relatively straightforward levels in simple games, as it is challenging to design an optimisable objective function for complex settings. This limits the applicability of PCG to more complex and modern titles, hindering its adoption in industry. Our work aims to address this limitation by introducing a compositional level generation method, which recursively composes simple, low-level generators together to construct large and complex creations. This approach allows for easily-optimisable objectives and the ability to design a complex structure in an interpretable way by referencing lower-level components. We empirically demonstrate that our method outperforms a non-compositional baseline by more accurately satisfying a designer's functional requirements in several tasks. Finally, we provide a qualitative showcase (in Minecraft) illustrating the large and complex, but still coherent, structures that were generated using simple base generators. ",
    "url": "https://arxiv.org/abs/2302.01561",
    "authors": [
      "Michael Beukman",
      "Manuel Fokam",
      "Marcel Kruger",
      "Guy Axelrod",
      "Muhammad Nasir",
      "Branden Ingram",
      "Benjamin Rosman",
      "Steven James"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.01563",
    "title": "Causal Inference Based Single-branch Ensemble Trees For Uplift Modeling",
    "abstract": "In this manuscript (ms), we propose causal inference based single-branch ensemble trees for uplift modeling, namely CIET. Different from standard classification methods for predictive probability modeling, CIET aims to achieve the change in the predictive probability of outcome caused by an action or a treatment. According to our CIET, two partition criteria are specifically designed to maximize the difference in outcome distribution between the treatment and control groups. Next, a novel single-branch tree is built by taking a top-down node partition approach, and the remaining samples are censored since they are not covered by the upper node partition logic. Repeating the tree-building process on the censored data, single-branch ensemble trees with a set of inference rules are thus formed. Moreover, CIET is experimentally demonstrated to outperform previous approaches for uplift modeling in terms of both area under uplift curve (AUUC) and Qini coefficient significantly. At present, CIET has already been applied to online personal loans in a national financial holdings group in China. CIET will also be of use to analysts applying machine learning techniques to causal inference in broader business domains such as web advertising, medicine and economics. ",
    "url": "https://arxiv.org/abs/2302.01563",
    "authors": [
      "Fanglan Zheng",
      "Menghan Wang",
      "Kun Li",
      "Jiang Tian",
      "Xiaojia Xiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01567",
    "title": "Deep Reinforcement Learning for Online Error Detection in Cyber-Physical  Systems",
    "abstract": "Reliability is one of the major design criteria in Cyber-Physical Systems (CPSs). This is because of the existence of some critical applications in CPSs and their failure is catastrophic. Therefore, employing strong error detection and correction mechanisms in CPSs is inevitable. CPSs are composed of a variety of units, including sensors, networks, and microcontrollers. Each of these units is probable to be in a faulty state at any time and the occurred fault can result in erroneous output. The fault may cause the units of CPS to malfunction and eventually crash. Traditional fault-tolerant approaches include redundancy time, hardware, information, and/or software. However, these approaches impose significant overheads besides their low error coverage, which limits their applicability. In addition, the interval between error occurrence and detection is too long in these approaches. In this paper, based on Deep Reinforcement Learning (DRL), a new error detection approach is proposed that not only detects errors with high accuracy but also can perform error detection at the moment due to very low inference time. The proposed approach can categorize different types of errors from normal data and predict whether the system will fail. The evaluation results illustrate that the proposed approach has improved more than 2x in terms of accuracy and more than 5x in terms of inference time compared to other approaches. ",
    "url": "https://arxiv.org/abs/2302.01567",
    "authors": [
      "Seyyedamirhossein Saeidi",
      "Forouzan Fallah",
      "Saeed Samieezafarghandi",
      "Hamed Farbeh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.01571",
    "title": "Robust Camera Pose Refinement for Multi-Resolution Hash Encoding",
    "abstract": "Multi-resolution hash encoding has recently been proposed to reduce the computational cost of neural renderings, such as NeRF. This method requires accurate camera poses for the neural renderings of given scenes. However, contrary to previous methods jointly optimizing camera poses and 3D scenes, the naive gradient-based camera pose refinement method using multi-resolution hash encoding severely deteriorates performance. We propose a joint optimization algorithm to calibrate the camera pose and learn a geometric representation using efficient multi-resolution hash encoding. Showing that the oscillating gradient flows of hash encoding interfere with the registration of camera poses, our method addresses the issue by utilizing smooth interpolation weighting to stabilize the gradient oscillation for the ray samplings across hash grids. Moreover, the curriculum training procedure helps to learn the level-wise hash encoding, further increasing the pose refinement. Experiments on the novel-view synthesis datasets validate that our learning frameworks achieve state-of-the-art performance and rapid convergence of neural rendering, even when initial camera poses are unknown. ",
    "url": "https://arxiv.org/abs/2302.01571",
    "authors": [
      "Hwan Heo",
      "Taekyung Kim",
      "Jiyoung Lee",
      "Jaewon Lee",
      "Soohyun Kim",
      "Hyunwoo J. Kim",
      "Jin-Hwa Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01579",
    "title": "Semantic 3D-aware Portrait Synthesis and Manipulation Based on  Compositional Neural Radiance Field",
    "abstract": "Recently 3D-aware GAN methods with neural radiance field have developed rapidly. However, current methods model the whole image as an overall neural radiance field, which limits the partial semantic editability of synthetic results. Since NeRF renders an image pixel by pixel, it is possible to split NeRF in the spatial dimension. We propose a Compositional Neural Radiance Field (CNeRF) for semantic 3D-aware portrait synthesis and manipulation. CNeRF divides the image by semantic regions and learns an independent neural radiance field for each region, and finally fuses them and renders the complete image. Thus we can manipulate the synthesized semantic regions independently, while fixing the other parts unchanged. Furthermore, CNeRF is also designed to decouple shape and texture within each semantic region. Compared to state-of-the-art 3D-aware GAN methods, our approach enables fine-grained semantic region manipulation, while maintaining high-quality 3D-consistent synthesis. The ablation studies show the effectiveness of the structure and loss function used by our method. In addition real image inversion and cartoon portrait 3D editing experiments demonstrate the application potential of our method. ",
    "url": "https://arxiv.org/abs/2302.01579",
    "authors": [
      "Tianxiang Ma",
      "Bingchuan Li",
      "Qian He",
      "Jing Dong",
      "Tieniu Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.01581",
    "title": "Learning to Decouple Complex Systems",
    "abstract": "A complex system with cluttered observations may be a coupled mixture of multiple simple sub-systems corresponding to latent entities. Such sub-systems may hold distinct dynamics in the continuous-time domain; therein, complicated interactions between sub-systems also evolve over time. This setting is fairly common in the real world but has been less considered. In this paper, we propose a sequential learning approach under this setting by decoupling a complex system for handling irregularly sampled and cluttered sequential observations. Such decoupling brings about not only subsystems describing the dynamics of each latent entity but also a meta-system capturing the interaction between entities over time. Specifically, we argue that the meta-system evolving within a simplex is governed by projected differential equations (ProjDEs). We further analyze and provide neural-friendly projection operators in the context of Bregman divergence. Experimental results on synthetic and real-world datasets show the advantages of our approach when facing complex and cluttered sequential data compared to the state-of-the-art. ",
    "url": "https://arxiv.org/abs/2302.01581",
    "authors": [
      "Zihan Zhou",
      "Tianshu Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01584",
    "title": "TT-TFHE: a Torus Fully Homomorphic Encryption-Friendly Neural Network  Architecture",
    "abstract": "This paper presents TT-TFHE, a deep neural network Fully Homomorphic Encryption (FHE) framework that effectively scales Torus FHE (TFHE) usage to tabular and image datasets using a recent family of convolutional neural networks called Truth-Table Neural Networks (TTnet). The proposed framework provides an easy-to-implement, automated TTnet-based design toolbox with an underlying (python-based) open-source Concrete implementation (CPU-based and implementing lookup tables) for inference over encrypted data. Experimental evaluation shows that TT-TFHE greatly outperforms in terms of time and accuracy all Homomorphic Encryption (HE) set-ups on three tabular datasets, all other features being equal. On image datasets such as MNIST and CIFAR-10, we show that TT-TFHE consistently and largely outperforms other TFHE set-ups and is competitive against other HE variants such as BFV or CKKS (while maintaining the same level of 128-bit encryption security guarantees). In addition, our solutions present a very low memory footprint (down to dozens of MBs for MNIST), which is in sharp contrast with other HE set-ups that typically require tens to hundreds of GBs of memory per user (in addition to their communication overheads). This is the first work presenting a fully practical solution of private inference (i.e. a few seconds for inference time and a few dozens MBs of memory) on both tabular datasets and MNIST, that can easily scale to multiple threads and users on server side. ",
    "url": "https://arxiv.org/abs/2302.01584",
    "authors": [
      "Adrien Benamira",
      "Tristan Guérand",
      "Thomas Peyrin",
      "Sayandeep Saha"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.01588",
    "title": "Bioformer: an efficient transformer language model for biomedical text  mining",
    "abstract": "Pretrained language models such as Bidirectional Encoder Representations from Transformers (BERT) have achieved state-of-the-art performance in natural language processing (NLP) tasks. Recently, BERT has been adapted to the biomedical domain. Despite the effectiveness, these models have hundreds of millions of parameters and are computationally expensive when applied to large-scale NLP applications. We hypothesized that the number of parameters of the original BERT can be dramatically reduced with minor impact on performance. In this study, we present Bioformer, a compact BERT model for biomedical text mining. We pretrained two Bioformer models (named Bioformer8L and Bioformer16L) which reduced the model size by 60% compared to BERTBase. Bioformer uses a biomedical vocabulary and was pre-trained from scratch on PubMed abstracts and PubMed Central full-text articles. We thoroughly evaluated the performance of Bioformer as well as existing biomedical BERT models including BioBERT and PubMedBERT on 15 benchmark datasets of four different biomedical NLP tasks: named entity recognition, relation extraction, question answering and document classification. The results show that with 60% fewer parameters, Bioformer16L is only 0.1% less accurate than PubMedBERT while Bioformer8L is 0.9% less accurate than PubMedBERT. Both Bioformer16L and Bioformer8L outperformed BioBERTBase-v1.1. In addition, Bioformer16L and Bioformer8L are 2-3 fold as fast as PubMedBERT/BioBERTBase-v1.1. Bioformer has been successfully deployed to PubTator Central providing gene annotations over 35 million PubMed abstracts and 5 million PubMed Central full-text articles. We make Bioformer publicly available via https://github.com/WGLab/bioformer, including pre-trained models, datasets, and instructions for downstream use. ",
    "url": "https://arxiv.org/abs/2302.01588",
    "authors": [
      "Li Fang",
      "Qingyu Chen",
      "Chih-Hsuan Wei",
      "Zhiyong Lu",
      "Kai Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.01593",
    "title": "Explicit Box Detection Unifies End-to-End Multi-Person Pose Estimation",
    "abstract": "This paper presents a novel end-to-end framework with Explicit box Detection for multi-person Pose estimation, called ED-Pose, where it unifies the contextual learning between human-level (global) and keypoint-level (local) information. Different from previous one-stage methods, ED-Pose re-considers this task as two explicit box detection processes with a unified representation and regression supervision. First, we introduce a human detection decoder from encoded tokens to extract global features. It can provide a good initialization for the latter keypoint detection, making the training process converge fast. Second, to bring in contextual information near keypoints, we regard pose estimation as a keypoint box detection problem to learn both box positions and contents for each keypoint. A human-to-keypoint detection decoder adopts an interactive learning strategy between human and keypoint features to further enhance global and local feature aggregation. In general, ED-Pose is conceptually simple without post-processing and dense heatmap supervision. It demonstrates its effectiveness and efficiency compared with both two-stage and one-stage methods. Notably, explicit box detection boosts the pose estimation performance by 4.5 AP on COCO and 9.9 AP on CrowdPose. For the first time, as a fully end-to-end framework with a L1 regression loss, ED-Pose surpasses heatmap-based Top-down methods under the same backbone by 1.2 AP on COCO and achieves the state-of-the-art with 76.6 AP on CrowdPose without bells and whistles. Code is available at https://github.com/IDEA-Research/ED-Pose. ",
    "url": "https://arxiv.org/abs/2302.01593",
    "authors": [
      "Jie Yang",
      "Ailing Zeng",
      "Shilong Liu",
      "Feng Li",
      "Ruimao Zhang",
      "Lei Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.01595",
    "title": "Deep Reinforcement Learning for Cyber System Defense under Dynamic  Adversarial Uncertainties",
    "abstract": "Development of autonomous cyber system defense strategies and action recommendations in the real-world is challenging, and includes characterizing system state uncertainties and attack-defense dynamics. We propose a data-driven deep reinforcement learning (DRL) framework to learn proactive, context-aware, defense countermeasures that dynamically adapt to evolving adversarial behaviors while minimizing loss of cyber system operations. A dynamic defense optimization problem is formulated with multiple protective postures against different types of adversaries with varying levels of skill and persistence. A custom simulation environment was developed and experiments were devised to systematically evaluate the performance of four model-free DRL algorithms against realistic, multi-stage attack sequences. Our results suggest the efficacy of DRL algorithms for proactive cyber defense under multi-stage attack profiles and system uncertainties. ",
    "url": "https://arxiv.org/abs/2302.01595",
    "authors": [
      "Ashutosh Dutta",
      "Samrat Chatterjee",
      "Arnab Bhattacharya",
      "Mahantesh Halappanavar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2302.01599",
    "title": "SCCAM: Supervised Contrastive Convolutional Attention Mechanism for  Ante-hoc Interpretable Fault Diagnosis with Limited Fault Samples",
    "abstract": "In real industrial processes, fault diagnosis methods are required to learn from limited fault samples since the procedures are mainly under normal conditions and the faults rarely occur. Although attention mechanisms have become popular in the field of fault diagnosis, the existing attention-based methods are still unsatisfying for the above practical applications. First, pure attention-based architectures like transformers need a large number of fault samples to offset the lack of inductive biases thus performing poorly under limited fault samples. Moreover, the poor fault classification dilemma further leads to the failure of the existing attention-based methods to identify the root causes. To address the aforementioned issues, we innovatively propose a supervised contrastive convolutional attention mechanism (SCCAM) with ante-hoc interpretability, which solves the root cause analysis problem under limited fault samples for the first time. The proposed SCCAM method is tested on a continuous stirred tank heater and the Tennessee Eastman industrial process benchmark. Three common fault diagnosis scenarios are covered, including a balanced scenario for additional verification and two scenarios with limited fault samples (i.e., imbalanced scenario and long-tail scenario). The comprehensive results demonstrate that the proposed SCCAM method can achieve better performance compared with the state-of-the-art methods on fault classification and root cause analysis. ",
    "url": "https://arxiv.org/abs/2302.01599",
    "authors": [
      "Mengxuan Li",
      "Peng Peng",
      "Jingxin Zhang",
      "Hongwei Wang",
      "Weiming Shen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01602",
    "title": "A Feature Selection Method for Driver Stress Detection Using Heart Rate  Variability and Breathing Rate",
    "abstract": "Driver stress is a major cause of car accidents and death worldwide. Furthermore, persistent stress is a health problem, contributing to hypertension and other diseases of the cardiovascular system. Stress has a measurable impact on heart and breathing rates and stress levels can be inferred from such measurements. Galvanic skin response is a common test to measure the perspiration caused by both physiological and psychological stress, as well as extreme emotions. In this paper, galvanic skin response is used to estimate the ground truth stress levels. A feature selection technique based on the minimal redundancy-maximal relevance method is then applied to multiple heart rate variability and breathing rate metrics to identify a novel and optimal combination for use in detecting stress. The support vector machine algorithm with a radial basis function kernel was used along with these features to reliably predict stress. The proposed method has achieved a high level of accuracy on the target dataset. ",
    "url": "https://arxiv.org/abs/2302.01602",
    "authors": [
      "Ashkan Parsi",
      "David O'Callaghan",
      "Joseph Lemley"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2302.01636",
    "title": "Symbiosis of an artificial neural network and models of biological  neurons: training and testing",
    "abstract": "In this paper we show the possibility of creating and identifying the features of an artificial neural network (ANN) which consists of mathematical models of biological neurons. The FitzHugh--Nagumo (FHN) system is used as an example of model demonstrating simplified neuron activity. First, in order to reveal how biological neurons can be embedded within an ANN, we train the ANN with nonlinear neurons to solve a a basic image recognition problem with MNIST database; and next, we describe how FHN systems can be introduced into this trained ANN. After all, we show that an ANN with FHN systems inside can be successfully trained and its accuracy becomes larger. What has been done above opens up great opportunities in terms of the direction of analog neural networks, in which artificial neurons can be replaced by biological ones. \\end{abstract} ",
    "url": "https://arxiv.org/abs/2302.01636",
    "authors": [
      "Tatyana Bogatenko",
      "Konstantin Sergeev",
      "Andrei Slepnev",
      "Jürgen Kurths",
      "Nadezhda Semenova"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Adaptation and Self-Organizing Systems (nlin.AO)"
    ]
  },
  {
    "id": "arXiv:2302.01647",
    "title": "Blockwise Self-Supervised Learning at Scale",
    "abstract": "Current state-of-the-art deep networks are all powered by backpropagation. In this paper, we explore alternatives to full backpropagation in the form of blockwise learning rules, leveraging the latest developments in self-supervised learning. We show that a blockwise pretraining procedure consisting of training independently the 4 main blocks of layers of a ResNet-50 with Barlow Twins' loss function at each block performs almost as well as end-to-end backpropagation on ImageNet: a linear probe trained on top of our blockwise pretrained model obtains a top-1 classification accuracy of 70.48%, only 1.1% below the accuracy of an end-to-end pretrained network (71.57% accuracy). We perform extensive experiments to understand the impact of different components within our method and explore a variety of adaptations of self-supervised learning to the blockwise paradigm, building an exhaustive understanding of the critical avenues for scaling local learning rules to large networks, with implications ranging from hardware design to neuroscience. ",
    "url": "https://arxiv.org/abs/2302.01647",
    "authors": [
      "Shoaib Ahmed Siddiqui",
      "David Krueger",
      "Yann LeCun",
      "Stéphane Deny"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01665",
    "title": "CVTNet: A Cross-View Transformer Network for Place Recognition Using  LiDAR Data",
    "abstract": "LiDAR-based place recognition (LPR) is one of the most crucial components of autonomous vehicles to identify previously visited places in GPS-denied environments. Most existing LPR methods use mundane representations of the input point cloud without considering different views, which may not fully exploit the information from LiDAR sensors. In this paper, we propose a cross-view transformer-based network, dubbed CVTNet, to fuse the range image views (RIVs) and bird's eye views (BEVs) generated from the LiDAR data. It extracts correlations within the views themselves using intra-transformers and between the two different views using inter-transformers. Based on that, our proposed CVTNet generates a yaw-angle-invariant global descriptor for each laser scan end-to-end online and retrieves previously seen places by descriptor matching between the current query scan and the pre-built database. We evaluate our approach on three datasets collected with different sensor setups and environmental conditions. The experimental results show that our method outperforms the state-of-the-art LPR methods with strong robustness to viewpoint changes and long-time spans. Furthermore, our approach has a good real-time performance that can run faster than the typical LiDAR frame rate. The implementation of our method is released as open source at: https://github.com/BIT-MJY/CVTNet. ",
    "url": "https://arxiv.org/abs/2302.01665",
    "authors": [
      "Junyi Ma",
      "Guangming Xiong",
      "Jingyi Xu",
      "Xieyuanli Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.01676",
    "title": "Show me your NFT and I tell you how it will perform: Multimodal  representation learning for NFT selling price prediction",
    "abstract": "Non-Fungible Tokens (NFTs) represent deeds of ownership, based on blockchain technologies and smart contracts, of unique crypto assets on digital art forms (e.g., artworks or collectibles). In the spotlight after skyrocketing in 2021, NFTs have attracted the attention of crypto enthusiasts and investors intent on placing promising investments in this profitable market. However, the NFT financial performance prediction has not been widely explored to date. In this work, we address the above problem based on the hypothesis that NFT images and their textual descriptions are essential proxies to predict the NFT selling prices. To this purpose, we propose MERLIN, a novel multimodal deep learning framework designed to train Transformer-based language and visual models, along with graph neural network models, on collections of NFTs' images and texts. A key aspect in MERLIN is its independence on financial features, as it exploits only the primary data a user interested in NFT trading would like to deal with, i.e., NFT images and textual descriptions. By learning dense representations of such data, a price-category classification task is performed by MERLIN models, which can also be tuned according to user preferences in the inference phase to mimic different risk-return investment profiles. Experimental evaluation on a publicly available dataset has shown that MERLIN models achieve significant performances according to several financial assessment criteria, fostering profitable investments, and also beating baseline machine-learning classifiers based on financial features. ",
    "url": "https://arxiv.org/abs/2302.01676",
    "authors": [
      "Davide Costa",
      "Lucio La Cava",
      "Andrea Tagarelli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2302.01677",
    "title": "Revisiting Personalized Federated Learning: Robustness Against Backdoor  Attacks",
    "abstract": "In this work, besides improving prediction accuracy, we study whether personalization could bring robustness benefits to backdoor attacks. We conduct the first study of backdoor attacks in the pFL framework, testing 4 widely used backdoor attacks against 6 pFL methods on benchmark datasets FEMNIST and CIFAR-10, a total of 600 experiments. The study shows that pFL methods with partial model-sharing can significantly boost robustness against backdoor attacks. In contrast, pFL methods with full model-sharing do not show robustness. To analyze the reasons for varying robustness performances, we provide comprehensive ablation studies on different pFL methods. Based on our findings, we further propose a lightweight defense method, Simple-Tuning, which empirically improves defense performance against backdoor attacks. We believe that our work could provide both guidance for pFL application in terms of its robustness and offer valuable insights to design more robust FL methods in the future. ",
    "url": "https://arxiv.org/abs/2302.01677",
    "authors": [
      "Zeyu Qin",
      "Liuyi Yao",
      "Daoyuan Chen",
      "Yaliang Li",
      "Bolin Ding",
      "Minhao Cheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.01704",
    "title": "Domain Adaptation via Alignment of Operation Profile for Remaining  Useful Lifetime Prediction",
    "abstract": "Effective Prognostics and Health Management (PHM) relies on accurate prediction of the Remaining Useful Life (RUL). Data-driven RUL prediction techniques rely heavily on the representativeness of the available time-to-failure trajectories. Therefore, these methods may not perform well when applied to data from new units of a fleet that follow different operating conditions than those they were trained on. This is also known as domain shifts. Domain adaptation (DA) methods aim to address the domain shift problem by extracting domain invariant features. However, DA methods do not distinguish between the different phases of operation, such as steady states or transient phases. This can result in misalignment due to under- or over-representation of different operation phases. This paper proposes two novel DA approaches for RUL prediction based on an adversarial domain adaptation framework that considers the different phases of the operation profiles separately. The proposed methodologies align the marginal distributions of each phase of the operation profile in the source domain with its counterpart in the target domain. The effectiveness of the proposed methods is evaluated using the New Commercial Modular Aero-Propulsion System (N-CMAPSS) dataset, where sub-fleets of turbofan engines operating in one of the three different flight classes (short, medium, and long) are treated as separate domains. The experimental results show that the proposed methods improve the accuracy of RUL predictions compared to current state-of-the-art DA methods. ",
    "url": "https://arxiv.org/abs/2302.01704",
    "authors": [
      "Ismail Nejjar",
      "Fabian Geissmann",
      "Mengjie Zhao",
      "Cees Taal",
      "Olga Fink"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.01707",
    "title": "Parfum: Detection and Automatic Repair of Dockerfile Smells",
    "abstract": "Docker is a popular tool for developers and organizations to package, deploy, and run applications in a lightweight, portable container. One key component of Docker is the Dockerfile, a simple text file that specifies the steps needed to build a Docker image. While Dockerfiles are easy to create and use, creating an optimal image is complex in particular since it is easy to not follow the best practices, when it happens we call it Docker smell. To improve the quality of Dockerfiles, previous works have focused on detecting Docker smells, but they do not offer suggestions or repair the smells. In this paper, we propose, Parfum, a tool that detects and automatically repairs Docker smells while producing minimal patches. Parfum is based on a new Dockerfile AST parser called Dinghy. We evaluate the effectiveness of Parfum by analyzing and repairing a large set of Dockerfiles and comparing it against existing tools. We also measure the impact of the repair on the Docker image in terms of build failure and image size. Finally, we opened 35 pull requests to collect developers' feedback and ensure that the repairs and the smells are meaningful. Our results show that Parfum is able to repair 806 245 Docker smells and have a significant impact on the Docker image size, and finally, developers are welcoming the patches generated by Parfum while merging 20 pull requests. ",
    "url": "https://arxiv.org/abs/2302.01707",
    "authors": [
      "Thomas Durieux"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2302.01708",
    "title": "Crucial Semantic Classifier-based Adversarial Learning for Unsupervised  Domain Adaptation",
    "abstract": "Unsupervised Domain Adaptation (UDA), which aims to explore the transferrable features from a well-labeled source domain to a related unlabeled target domain, has been widely progressed. Nevertheless, as one of the mainstream, existing adversarial-based methods neglect to filter the irrelevant semantic knowledge, hindering adaptation performance improvement. Besides, they require an additional domain discriminator that strives extractor to generate confused representations, but discrete designing may cause model collapse. To tackle the above issues, we propose Crucial Semantic Classifier-based Adversarial Learning (CSCAL), which pays more attention to crucial semantic knowledge transferring and leverages the classifier to implicitly play the role of domain discriminator without extra network designing. Specifically, in intra-class-wise alignment, a Paired-Level Discrepancy (PLD) is designed to transfer crucial semantic knowledge. Additionally, based on classifier predictions, a Nuclear Norm-based Discrepancy (NND) is formed that considers inter-class-wise information and improves the adaptation performance. Moreover, CSCAL can be effortlessly merged into different UDA methods as a regularizer and dramatically promote their performance. ",
    "url": "https://arxiv.org/abs/2302.01708",
    "authors": [
      "Yumin Zhang",
      "Yajun Gao",
      "Hongliu Li",
      "Ating Yin",
      "Duzhen Zhang",
      "Xiuyi Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.01722",
    "title": "Leveraging Contaminated Datasets to Learn Clean-Data Distribution with  Purified Generative Adversarial Networks",
    "abstract": "Generative adversarial networks (GANs) are known for their strong abilities on capturing the underlying distribution of training instances. Since the seminal work of GAN, many variants of GAN have been proposed. However, existing GANs are almost established on the assumption that the training dataset is clean. But in many real-world applications, this may not hold, that is, the training dataset may be contaminated by a proportion of undesired instances. When training on such datasets, existing GANs will learn a mixture distribution of desired and contaminated instances, rather than the desired distribution of desired data only (target distribution). To learn the target distribution from contaminated datasets, two purified generative adversarial networks (PuriGAN) are developed, in which the discriminators are augmented with the capability to distinguish between target and contaminated instances by leveraging an extra dataset solely composed of contamination instances. We prove that under some mild conditions, the proposed PuriGANs are guaranteed to converge to the distribution of desired instances. Experimental results on several datasets demonstrate that the proposed PuriGANs are able to generate much better images from the desired distribution than comparable baselines when trained on contaminated datasets. In addition, we also demonstrate the usefulness of PuriGAN on downstream applications by applying it to the tasks of semi-supervised anomaly detection on contaminated datasets and PU-learning. Experimental results show that PuriGAN is able to deliver the best performance over comparable baselines on both tasks. ",
    "url": "https://arxiv.org/abs/2302.01722",
    "authors": [
      "Bowen Tian",
      "Qinliang Su",
      "Jianxing Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01732",
    "title": "A Robust Time-Delay Approach to Extremum Seeking via ISS Analysis of the  Averaged System",
    "abstract": "For N-dimensional (ND) static quadratic map, we present a time-delay approach to gradient-based extremum seeking (ES) both, in the continuous and, for the first time, the discrete domains. As in the recently introduced (for 2D maps in the continuous domain), we transform the system to the time-delay one (neutral type system in the form of Hale in the continuous case). This system is O($\\varepsilon$)-perturbation of the averaged linear ODE system, where $\\varepsilon$ is a period of averaging. We further explicitly present the neutral system as the linear ODE, where O($\\varepsilon$)-terms are considered as disturbances with distributed delays of the length of the small parameter $\\varepsilon$. Regional input-to-state stability (ISS) analysis is provided by employing a variation of constants formula that greatly simplifies the previously used analysis via Lyapunov-Krasovskii (L-K) method, simplifies the conditions and improves the results. Examples from the literature illustrate the efficiency of the new approach, allowing essentially large uncertainty of the Hessian matrix with bounds on $\\varepsilon$ that are not too small. ",
    "url": "https://arxiv.org/abs/2302.01732",
    "authors": [
      "Xuefei Yang",
      "Emilia Fridman"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.01740",
    "title": "A Systematic Evaluation of Backdoor Trigger Characteristics in Image  Classification",
    "abstract": "Deep learning achieves outstanding results in many machine learning tasks. Nevertheless, it is vulnerable to backdoor attacks that modify the training set to embed a secret functionality in the trained model. The modified training samples have a secret property, i.e., a trigger. At inference time, the secret functionality is activated when the input contains the trigger, while the model functions correctly in other cases. While there are many known backdoor attacks (and defenses), deploying a stealthy attack is still far from trivial. Successfully creating backdoor triggers heavily depends on numerous parameters. Unfortunately, research has not yet determined which parameters contribute most to the attack performance. This paper systematically analyzes the most relevant parameters for the backdoor attacks, i.e., trigger size, position, color, and poisoning rate. Using transfer learning, which is very common in computer vision, we evaluate the attack on numerous state-of-the-art models (ResNet, VGG, AlexNet, and GoogLeNet) and datasets (MNIST, CIFAR10, and TinyImageNet). Our attacks cover the majority of backdoor settings in research, providing concrete directions for future works. Our code is publicly available to facilitate the reproducibility of our results. ",
    "url": "https://arxiv.org/abs/2302.01740",
    "authors": [
      "Gorka Abad",
      "Jing Xu",
      "Stefanos Koffas",
      "Behrad Tajalli",
      "Stjepan Picek"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01748",
    "title": "Chaining of Maximal Exact Matches in Graphs",
    "abstract": "We study the problem of finding maximal exact matches (MEMs) between a query string $Q$ and a labeled directed acyclic graph (DAG) $G=(V,E,\\ell)$ and subsequently co-linearly chaining these matches. We show that it suffices to compute MEMs between node labels and $Q$ (node MEMs) to encode full MEMs. Node MEMs can be computed in linear time and we show how to co-linearly chain them to solve the Longest Common Subsequence (LCS) problem between $Q$ and $G$. Our chaining algorithm is the first to consider a symmetric formulation of the chaining problem in graphs and runs in $O(k^2|V| + |E| + kN\\log N)$ time, where $k$ is the width (minimum number of paths covering the nodes) of $G$, and $N$ is the number of node MEMs. We then consider the problem of finding MEMs when the input graph is an indexable elastic founder graph (subclass of labeled DAGs studied by Equi et al., Algorithmica 2022). For arbitrary input graphs, the problem cannot be solved in truly sub-quadratic time under SETH (Equi et al., ICALP 2019). We show that we can report all MEMs between $Q$ and an indexable elastic founder graph in time $O(nH^2 + m + M_\\kappa)$, where $n$ is the total length of node labels, $H$ is the maximum number of nodes in a block of the graph, $m = |Q|$, and $M_\\kappa$ is the number of MEMs of length at least $\\kappa$. ",
    "url": "https://arxiv.org/abs/2302.01748",
    "authors": [
      "Nicola Rizzo",
      "Manuel Cáceres",
      "Veli Mäkinen"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2302.01756",
    "title": "DANES: Deep Neural Network Ensemble Architecture for Social and Textual  Context-aware Fake News Detection",
    "abstract": "The growing popularity of social media platforms has simplified the creation and distribution of news articles but also creates a conduit for spreading fake news. In consequence, the need arises for effective context-aware fake news detection mechanisms, where the contextual information can be built either from the textual content of posts or from available social data (e.g., information about the users, reactions to posts, or the social network). In this paper, we propose DANES, a Deep Neural Network Ensemble Architecture for Social and Textual Context-aware Fake News Detection. DANES comprises a Text Branch for a textual content-based context and a Social Branch for the social context. These two branches are used to create a novel Network Embedding. Preliminary ablation results on 3 real-world datasets, i.e., BuzzFace, Twitter15, and Twitter16, are promising, with an accuracy that outperforms state-of-the-art solutions when employing both social and textual content features. ",
    "url": "https://arxiv.org/abs/2302.01756",
    "authors": [
      "Ciprian-Octavian Truică",
      "Elena-Simona Apostol",
      "Panagiotis Karras"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2302.01757",
    "title": "Certified Robustness of Learning-based Static Malware Detectors",
    "abstract": "Certified defenses are a recent development in adversarial machine learning (ML), which aim to rigorously guarantee the robustness of ML models to adversarial perturbations. A large body of work studies certified defenses in computer vision, where $\\ell_p$ norm-bounded evasion attacks are adopted as a tractable threat model. However, this threat model has known limitations in vision, and is not applicable to other domains -- e.g., where inputs may be discrete or subject to complex constraints. Motivated by this gap, we study certified defenses for malware detection, a domain where attacks against ML-based systems are a real and current threat. We consider static malware detection systems that operate on byte-level data. Our certified defense is based on the approach of randomized smoothing which we adapt by: (1) replacing the standard Gaussian randomization scheme with a novel deletion randomization scheme that operates on bytes or chunks of an executable; and (2) deriving a certificate that measures robustness to evasion attacks in terms of generalized edit distance. To assess the size of robustness certificates that are achievable while maintaining high accuracy, we conduct experiments on malware datasets using a popular convolutional malware detection model, MalConv. We are able to accurately classify 91% of the inputs while being certifiably robust to any adversarial perturbations of edit distance 128 bytes or less. By comparison, an existing certification of up to 128 bytes of substitutions (without insertions or deletions) achieves an accuracy of 78%. In addition, given that robustness certificates are conservative, we evaluate practical robustness to several recently published evasion attacks and, in some cases, find robustness beyond certified guarantees. ",
    "url": "https://arxiv.org/abs/2302.01757",
    "authors": [
      "Zhuoqun Huang",
      "Neil G. Marchant",
      "Keane Lucas",
      "Lujo Bauer",
      "Olga Ohrimenko",
      "Benjamin I. P. Rubinstein"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.01762",
    "title": "BackdoorBox: A Python Toolbox for Backdoor Learning",
    "abstract": "Third-party resources ($e.g.$, samples, backbones, and pre-trained models) are usually involved in the training of deep neural networks (DNNs), which brings backdoor attacks as a new training-phase threat. In general, backdoor attackers intend to implant hidden backdoor in DNNs, so that the attacked DNNs behave normally on benign samples whereas their predictions will be maliciously changed to a pre-defined target label if hidden backdoors are activated by attacker-specified trigger patterns. To facilitate the research and development of more secure training schemes and defenses, we design an open-sourced Python toolbox that implements representative and advanced backdoor attacks and defenses under a unified and flexible framework. Our toolbox has four important and promising characteristics, including consistency, simplicity, flexibility, and co-development. It allows researchers and developers to easily implement and compare different methods on benchmark or their local datasets. This Python toolbox, namely \\texttt{BackdoorBox}, is available at \\url{https://github.com/THUYimingLi/BackdoorBox}. ",
    "url": "https://arxiv.org/abs/2302.01762",
    "authors": [
      "Yiming Li",
      "Mengxi Ya",
      "Yang Bai",
      "Yong Jiang",
      "Shu-Tao Xia"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01763",
    "title": "Enabling Trade-offs in Privacy and Utility in Genomic Data Beacons and  Summary Statistics",
    "abstract": "The collection and sharing of genomic data are becoming increasingly commonplace in research, clinical, and direct-to-consumer settings. The computational protocols typically adopted to protect individual privacy include sharing summary statistics, such as allele frequencies, or limiting query responses to the presence/absence of alleles of interest using web-services called Beacons. However, even such limited releases are susceptible to likelihood-ratio-based membership-inference attacks. Several approaches have been proposed to preserve privacy, which either suppress a subset of genomic variants or modify query responses for specific variants (e.g., adding noise, as in differential privacy). However, many of these approaches result in a significant utility loss, either suppressing many variants or adding a substantial amount of noise. In this paper, we introduce optimization-based approaches to explicitly trade off the utility of summary data or Beacon responses and privacy with respect to membership-inference attacks based on likelihood-ratios, combining variant suppression and modification. We consider two attack models. In the first, an attacker applies a likelihood-ratio test to make membership-inference claims. In the second model, an attacker uses a threshold that accounts for the effect of the data release on the separation in scores between individuals in the dataset and those who are not. We further introduce highly scalable approaches for approximately solving the privacy-utility tradeoff problem when information is either in the form of summary statistics or presence/absence queries. Finally, we show that the proposed approaches outperform the state of the art in both utility and privacy through an extensive evaluation with public datasets. ",
    "url": "https://arxiv.org/abs/2302.01763",
    "authors": [
      "Rajagopal Venkatesaramani",
      "Zhiyu Wan",
      "Bradley A. Malin",
      "Yevgeniy Vorobeychik"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.01769",
    "title": "GraphAGILE: An FPGA-based Overlay Accelerator for Low-latency GNN  Inference",
    "abstract": "This paper presents GraphAGILE, a domain-specific FPGA-based overlay accelerator for graph neural network (GNN) inference. GraphAGILE consists of (1) \\emph{a novel unified architecture design} with an \\emph{instruction set}, and (2) \\emph{a compiler} built upon the instruction set that can quickly generate optimized code. Due to the proposed instruction set architecture (ISA) and the compiler, GraphAGILE does not require any FPGA reconfiguration when performing inference on various GNN models and input graphs. For the architecture design, we propose a novel hardware module named Adaptive Computation Kernel (ACK), that can execute various computation kernels of GNNs, including general matrix multiplication (GEMM), sparse-dense matrix multiplication (SpDMM) and sampled dense-dense matrix multiplication (SDDMM). The compiler takes the specifications of a GNN model and the graph meta data (e.g., the number of vertices and edges) as input, and generates a sequence of instructions for inference execution. We develop the following compiler optimizations to reduce inference latency: (1) computation order optimization that automatically reorders the computation graph to reduce the total computation complexity, (2) layer fusion that merges adjacent layers to reduce data communication volume, (3) data partitioning with a partition-centric execution scheme that partitions the input graph to fit the available on-chip memory of FPGA, (4) kernel mapping that automatically selects execution mode for ACK, and performs task scheduling to overlap computation with data communication and achieves dynamic load balance. We implement GraphAGILE on a state-of-the-art FPGA platform, Xilinx Alveo U250. GraphAGILE can execute widely used GNN models, including GCN, GAT, GIN, GraphSAGE, SGC and other GNN models supported by GraphGym. ",
    "url": "https://arxiv.org/abs/2302.01769",
    "authors": [
      "Bingyi Zhang",
      "Hanqing Zeng",
      "Viktor Prasanna"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2302.01786",
    "title": "Customer Profiling, Segmentation, and Sales Prediction using AI in  Direct Marketing",
    "abstract": "In an increasingly customer-centric business environment, effective communication between marketing and senior management is crucial for success. With the rise of globalization and increased competition, utilizing new data mining techniques to identify potential customers is essential for direct marketing efforts. This paper proposes a data mining preprocessing method for developing a customer profiling system to improve sales performance, including customer equity estimation and customer action prediction. The RFM-analysis methodology is used to evaluate client capital and a boosting tree for prediction. The study highlights the importance of customer segmentation methods and algorithms to increase the accuracy of the prediction. The main result of this study is the creation of a customer profile and forecast for the sale of goods. ",
    "url": "https://arxiv.org/abs/2302.01786",
    "authors": [
      "Mahmoud SalahEldin Kasem",
      "Mohamed Hamada",
      "Islam Taj-Eddin"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.01793",
    "title": "Self-Supervised In-Domain Representation Learning for Remote Sensing  Image Scene Classification",
    "abstract": "Transferring the ImageNet pre-trained weights to the various remote sensing tasks has produced acceptable results and reduced the need for labeled samples. However, the domain differences between ground imageries and remote sensing images cause the performance of such transfer learning to be limited. Recent research has demonstrated that self-supervised learning methods capture visual features that are more discriminative and transferable than the supervised ImageNet weights. We are motivated by these facts to pre-train the in-domain representations of remote sensing imagery using contrastive self-supervised learning and transfer the learned features to other related remote sensing datasets. Specifically, we used the SimSiam algorithm to pre-train the in-domain knowledge of remote sensing datasets and then transferred the obtained weights to the other scene classification datasets. Thus, we have obtained state-of-the-art results on five land cover classification datasets with varying numbers of classes and spatial resolutions. In addition, By conducting appropriate experiments, including feature pre-training using datasets with different attributes, we have identified the most influential factors that make a dataset a good choice for obtaining in-domain features. We have transferred the features obtained by pre-training SimSiam on remote sensing datasets to various downstream tasks and used them as initial weights for fine-tuning. Moreover, we have linearly evaluated the obtained representations in cases where the number of samples per class is limited. Our experiments have demonstrated that using a higher-resolution dataset during the self-supervised pre-training stage results in learning more discriminative and general representations. ",
    "url": "https://arxiv.org/abs/2302.01793",
    "authors": [
      "Ali Ghanbarzade",
      "Hossein Soleimani"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.01800",
    "title": "Creating Probabilistic Forecasts from Arbitrary Deterministic Forecasts  using Conditional Invertible Neural Networks",
    "abstract": "In various applications, probabilistic forecasts are required to quantify the inherent uncertainty associated with the forecast. However, numerous modern forecasting methods are still designed to create deterministic forecasts. Transforming these deterministic forecasts into probabilistic forecasts is often challenging and based on numerous assumptions that may not hold in real-world situations. Therefore, the present article proposes a novel approach for creating probabilistic forecasts from arbitrary deterministic forecasts. In order to implement this approach, we use a conditional Invertible Neural Network (cINN). More specifically, we apply a cINN to learn the underlying distribution of the data and then combine the uncertainty from this distribution with an arbitrary deterministic forecast to generate accurate probabilistic forecasts. Our approach enables the simple creation of probabilistic forecasts without complicated statistical loss functions or further assumptions. Besides showing the mathematical validity of our approach, we empirically show that our approach noticeably outperforms traditional methods for including uncertainty in deterministic forecasts and generally outperforms state-of-the-art probabilistic forecasting benchmarks. ",
    "url": "https://arxiv.org/abs/2302.01800",
    "authors": [
      "Kaleb Phipps",
      "Benedikt Heidrich",
      "Marian Turowski",
      "Moritz Wittig",
      "Ralf Mikut",
      "Veit Hagenmeyer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01819",
    "title": "A Hybrid Training Algorithm for Continuum Deep Learning Neuro-Skin  Neural Network",
    "abstract": "In this brief paper, a learning algorithm is developed for Deep Learning NeuroSkin Neural Network to improve their learning properties. Neuroskin is a new type of neural network presented recently by the authors. It is comprised of a cellular membrane which has a neuron attached to each cell. The neuron is the cells nucleus. A neuroskin is modelled using finite elements. Each element of the finite element represents a cell. Each cells neuron has dendritic fibers which connects it to the nodes of the cell. On the other hand, its axon is connected to the nodes of a number of different neurons. The neuroskin is trained to contract upon receiving an input. The learning takes place during updating iterations using sensitivity analysis. It is shown that while the neuroskin cannot present the desirable response, it improves gradually to the desired level. ",
    "url": "https://arxiv.org/abs/2302.01819",
    "authors": [
      "Mehrdad Shafiei Dizaji"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2302.01826",
    "title": "Graph Embedding for Mapping Interdisciplinary Research Networks",
    "abstract": "Representation learning is the first step in automating tasks such as research paper recommendation, classification, and retrieval. Due to the accelerating rate of research publication, together with the recognised benefits of interdisciplinary research, systems that facilitate researchers in discovering and understanding relevant works from beyond their immediate school of knowledge are vital. This work explores different methods of research paper representation (or document embedding), to identify those methods that are capable of preserving the interdisciplinary implications of research papers in their embeddings. In addition to evaluating state of the art methods of document embedding in a interdisciplinary citation prediction task, we propose a novel Graph Neural Network architecture designed to preserve the key interdisciplinary implications of research articles in citation network node embeddings. Our proposed method outperforms other GNN-based methods in interdisciplinary citation prediction, without compromising overall citation prediction performance. ",
    "url": "https://arxiv.org/abs/2302.01826",
    "authors": [
      "Eoghan Cunningham",
      "Derek Greene"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)"
    ]
  },
  {
    "id": "arXiv:2302.01833",
    "title": "SphereMap: Dynamic Multi-Layer Graph Structure for Rapid Safety-Aware  UAV Planning",
    "abstract": "A flexible topological representation consisting of a two-layer graph structure built on-board an Unmanned Aerial Vehicle (UAV) by continuously filling the free space of an occupancy map with intersecting spheres is proposed in this \\paper{}. Most state-of-the-art planning methods find the shortest paths while keeping the UAV at a pre-defined distance from obstacles. Planning over the proposed structure reaches this pre-defined distance only when necessary, maintaining a safer distance otherwise, while also being orders of magnitude faster than other state-of-the-art methods. Furthermore, we demonstrate how this graph representation can be converted into a lightweight shareable topological-volumetric map of the environment, which enables decentralized multi-robot cooperation. The proposed approach was successfully validated in several kilometers of real subterranean environments, such as caves, devastated industrial buildings, and in the harsh and complex setting of the final event of the DARPA SubT Challenge, which aims to mimic the conditions of real search and rescue missions as closely as possible, and where our approach achieved the \\nth{2} place in the virtual track. ",
    "url": "https://arxiv.org/abs/2302.01833",
    "authors": [
      "Tomáš Musil",
      "Matěj Petrlík",
      "Martin Saska"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.01838",
    "title": "vMAP: Vectorised Object Mapping for Neural Field SLAM",
    "abstract": "We present vMAP, an object-level dense SLAM system using neural field representations. Each object is represented by a small MLP, enabling efficient, watertight object modelling without the need for 3D priors. As an RGB-D camera browses a scene with no prior information, vMAP detects object instances on-the-fly, and dynamically adds them to its map. Specifically, thanks to the power of vectorised training, vMAP can optimise as many as 50 individual objects in a single scene, with an extremely efficient training speed of 5Hz map update. We experimentally demonstrate significantly improved scene-level and object-level reconstruction quality compared to prior neural field SLAM systems. ",
    "url": "https://arxiv.org/abs/2302.01838",
    "authors": [
      "Xin Kong",
      "Shikun Liu",
      "Marwan Taher",
      "Andrew J. Davison"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.01842",
    "title": "A Case Study for Compliance as Code with Graphs and Language Models:  Public release of the Regulatory Knowledge Graph",
    "abstract": "The paper presents a study on using language models to automate the construction of executable Knowledge Graph (KG) for compliance. The paper focuses on Abu Dhabi Global Market regulations and taxonomy, involves manual tagging a portion of the regulations, training BERT-based models, which are then applied to the rest of the corpus. Coreference resolution and syntax analysis were used to parse the relationships between the tagged entities and to form KG stored in a Neo4j database. The paper states that the use of machine learning models released by regulators to automate the interpretation of rules is a vital step towards compliance automation, demonstrates the concept querying with Cypher, and states that the produced sub-graphs combined with Graph Neural Networks (GNN) will achieve expandability in judgment automation systems. The graph is open sourced on GitHub to provide structured data for future advancements in the field. ",
    "url": "https://arxiv.org/abs/2302.01842",
    "authors": [
      "Vladimir Ershov"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01843",
    "title": "MorDIFF: Recognition Vulnerability and Attack Detectability of Face  Morphing Attacks Created by Diffusion Autoencoders",
    "abstract": "Investigating new methods of creating face morphing attacks is essential to foresee novel attacks and help mitigate them. Creating morphing attacks is commonly either performed on the image-level or on the representation-level. The representation-level morphing has been performed so far based on generative adversarial networks (GAN) where the encoded images are interpolated in the latent space to produce a morphed image based on the interpolated vector. Such a process was constrained by the limited reconstruction fidelity of GAN architectures. Recent advances in the diffusion autoencoder models have overcome the GAN limitations, leading to high reconstruction fidelity. This theoretically makes them a perfect candidate to perform representation-level face morphing. This work investigates using diffusion autoencoders to create face morphing attacks by comparing them to a wide range of image-level and representation-level morphs. Our vulnerability analyses on four state-of-the-art face recognition models have shown that such models are highly vulnerable to the created attacks, the MorDIFF, especially when compared to existing representation-level morphs. Detailed detectability analyses are also performed on the MorDIFF, showing that they are as challenging to detect as other morphing attacks created on the image- or representation-level. Data and morphing script are made public. ",
    "url": "https://arxiv.org/abs/2302.01843",
    "authors": [
      "Naser Damer",
      "Meiling Fang",
      "Patrick Siebke",
      "Jan Niklas Kolf",
      "Marco Huber",
      "Fadi Boutros"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.01849",
    "title": "Entity-Agnostic Representation Learning for Parameter-Efficient  Knowledge Graph Embedding",
    "abstract": "We propose an entity-agnostic representation learning method for handling the problem of inefficient parameter storage costs brought by embedding knowledge graphs. Conventional knowledge graph embedding methods map elements in a knowledge graph, including entities and relations, into continuous vector spaces by assigning them one or multiple specific embeddings (i.e., vector representations). Thus the number of embedding parameters increases linearly as the growth of knowledge graphs. In our proposed model, Entity-Agnostic Representation Learning (EARL), we only learn the embeddings for a small set of entities and refer to them as reserved entities. To obtain the embeddings for the full set of entities, we encode their distinguishable information from their connected relations, k-nearest reserved entities, and multi-hop neighbors. We learn universal and entity-agnostic encoders for transforming distinguishable information into entity embeddings. This approach allows our proposed EARL to have a static, efficient, and lower parameter count than conventional knowledge graph embedding methods. Experimental results show that EARL uses fewer parameters and performs better on link prediction tasks than baselines, reflecting its parameter efficiency. ",
    "url": "https://arxiv.org/abs/2302.01849",
    "authors": [
      "Mingyang Chen",
      "Wen Zhang",
      "Zhen Yao",
      "Yushan Zhu",
      "Yang Gao",
      "Jeff Z. Pan",
      "Huajun Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.01855",
    "title": "From Robustness to Privacy and Back",
    "abstract": "We study the relationship between two desiderata of algorithms in statistical inference and machine learning: differential privacy and robustness to adversarial data corruptions. Their conceptual similarity was first observed by Dwork and Lei (STOC 2009), who observed that private algorithms satisfy robustness, and gave a general method for converting robust algorithms to private ones. However, all general methods for transforming robust algorithms into private ones lead to suboptimal error rates. Our work gives the first black-box transformation that converts any adversarially robust algorithm into one that satisfies pure differential privacy. Moreover, we show that for any low-dimensional estimation task, applying our transformation to an optimal robust estimator results in an optimal private estimator. Thus, we conclude that for any low-dimensional task, the optimal error rate for $\\varepsilon$-differentially private estimators is essentially the same as the optimal error rate for estimators that are robust to adversarially corrupting $1/\\varepsilon$ training samples. We apply our transformation to obtain new optimal private estimators for several high-dimensional tasks, including Gaussian (sparse) linear regression and PCA. Finally, we present an extension of our transformation that leads to approximate differentially private algorithms whose error does not depend on the range of the output space, which is impossible under pure differential privacy. ",
    "url": "https://arxiv.org/abs/2302.01855",
    "authors": [
      "Hilal Asi",
      "Jonathan Ullman",
      "Lydia Zakynthinou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.01856",
    "title": "On the Entropy of an Exchangeable Graph",
    "abstract": "Model complexity remains a key feature of any proposed data generating mechanism. Measures of complexity can be extended to complex patterns such as signals in time and graphs. In this paper, we are concerned with the well-studied class of exchangeable graphs. Exchangeability for graphs implies a distributional invariance under node permutation and is a suitable default model that can widely be used for network data. For this well-studied class of graphs, we make a choice to quantify model complexity based on the (Shannon) entropy, resulting in graphon entropy. We estimate the entropy of the generating mechanism of a given graph, instead of choosing a specific graph descriptor suitable only for one graph generating mechanism. In this manner, we naturally consider the global properties of a graph and capture its important graph-theoretic and topological properties. Under an increasingly complex set of generating mechanisms, we propose a set of estimators of graphon entropy as measures of complexity for real-world graphs. We determine the large--sample properties of such estimators and discuss their usage for characterizing evolving real-world graphs. ",
    "url": "https://arxiv.org/abs/2302.01856",
    "authors": [
      "Anda Skeja",
      "Sofia C. Olhede"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Combinatorics (math.CO)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2302.01859",
    "title": "Generalizing to Unseen Elements: A Survey on Knowledge Extrapolation for  Knowledge Graphs",
    "abstract": "Knowledge graphs (KGs) have become effective knowledge resources in diverse applications, and knowledge graph embedding (KGE) methods have attracted increasing attention in recent years. However, it's still challenging for conventional KGE methods to handle unseen entities or relations during the model test. Much effort has been made in various fields of KGs to address this problem. In this paper, we use a set of general terminologies to unify these methods and refer to them as Knowledge Extrapolation. We comprehensively summarize these methods classified by our proposed taxonomy and describe their correlations. Next, we introduce the benchmarks and provide comparisons of these methods from aspects that are not reflected by the taxonomy. Finally, we suggest some potential directions for future research. ",
    "url": "https://arxiv.org/abs/2302.01859",
    "authors": [
      "Mingyang Chen",
      "Wen Zhang",
      "Yuxia Geng",
      "Zezhong Xu",
      "Jeff Z. Pan",
      "Huajun Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.01864",
    "title": "Machine Learning-based Early Attack Detection Using Open RAN Intelligent  Controller",
    "abstract": "We design and demonstrate a method for early detection of Denial-of-Service attacks. The proposed approach takes advantage of the OpenRAN framework to collect measurements from the air interface (for attack detection) and to dynamically control the operation of the Radio Access Network (RAN). For that purpose, we developed our near-Real Time (RT) RAN Intelligent Controller (RIC) interface. We apply and analyze a wide range of Machine Learning algorithms to data traffic analysis that satisfy the accuracy and latency requirements set by the near-RT RIC. Our results show that the proposed framework is able to correctly classify genuine vs. malicious traffic with high accuracy (i.e., 95%) in a realistic testbed environment, allowing us to detect attacks already at the Distributed Unit (DU), before malicious traffic even enters the Centralized Unit (CU). ",
    "url": "https://arxiv.org/abs/2302.01864",
    "authors": [
      "Bruno Missi Xavier",
      "Merim Dzaferagic",
      "Diarmuid Collins",
      "Giovanni Comarela",
      "Magnos Martinello",
      "Marco Ruffini"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2302.01872",
    "title": "MOSE: A New Dataset for Video Object Segmentation in Complex Scenes",
    "abstract": "Video object segmentation (VOS) aims at segmenting a particular object throughout the entire video clip sequence. The state-of-the-art VOS methods have achieved excellent performance (e.g., 90+% J&F) on existing datasets. However, since the target objects in these existing datasets are usually relatively salient, dominant, and isolated, VOS under complex scenes has rarely been studied. To revisit VOS and make it more applicable in the real world, we collect a new VOS dataset called coMplex video Object SEgmentation (MOSE) to study the tracking and segmenting objects in complex environments. MOSE contains 2,149 video clips and 5,200 objects from 36 categories, with 431,725 high-quality object segmentation masks. The most notable feature of MOSE dataset is complex scenes with crowded and occluded objects. The target objects in the videos are commonly occluded by others and disappear in some frames. To analyze the proposed MOSE dataset, we benchmark 18 existing VOS methods under 4 different settings on the proposed MOSE dataset and conduct comprehensive comparisons. The experiments show that current VOS algorithms cannot well perceive objects in complex scenes. For example, under the semi-supervised VOS setting, the highest J&F by existing state-of-the-art VOS methods is only 59.4% on MOSE, much lower than their ~90% J&F performance on DAVIS. The results reveal that although excellent performance has been achieved on existing benchmarks, there are unresolved challenges under complex scenes and more efforts are desired to explore these challenges in the future. The proposed MOSE dataset has been released at https://henghuiding.github.io/MOSE. ",
    "url": "https://arxiv.org/abs/2302.01872",
    "authors": [
      "Henghui Ding",
      "Chang Liu",
      "Shuting He",
      "Xudong Jiang",
      "Philip H.S. Torr",
      "Song Bai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.01880",
    "title": "Towards Inclusive Avatars: Disability Representation in Avatar Platforms",
    "abstract": "Digital avatars are an important part of identity representation, but there is little work on understanding how to represent disability. We interviewed 18 people with disabilities and related identities about their experiences and preferences in representing their identities with avatars. Participants generally preferred to represent their disability identity if the context felt safe and platforms supported their expression, as it was important for feeling authentically represented. They also utilized avatars in strategic ways: as a means to signal and disclose current abilities, access needs, and to raise awareness. Some participants even found avatars to be a more accessible way to communicate than alternatives. We discuss how avatars can support disability identity representation because of their easily customizable format that is not strictly tied to reality. We conclude with design recommendations for creating platforms that better support people in representing their disability and other minoritized identities. ",
    "url": "https://arxiv.org/abs/2302.01880",
    "authors": [
      "Kelly Mack",
      "Rai Ching Ling Hsu",
      "Andrés Monroy-Hernández",
      "Brian A. Smith",
      "Fannie Liu"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2302.01890",
    "title": "Android OS Privacy Under the Loupe -- A Tale from the East",
    "abstract": "China is currently the country with the largest number of Android smartphone users. We use a combination of static and dynamic code analysis techniques to study the data transmitted by the preinstalled system apps on Android smartphones from three of the most popular vendors in China. We find that an alarming number of preinstalled system, vendor and third-party apps are granted dangerous privileges. Through traffic analysis, we find these packages transmit to many third-party domains privacy sensitive information related to the user's device (persistent identifiers), geolocation (GPS coordinates, network-related identifiers), user profile (phone number, app usage) and social relationships (e.g., call history), without consent or even notification. This poses serious deanonymization and tracking risks that extend outside China when the user leaves the country, and calls for a more rigorous enforcement of the recently adopted data privacy legislation. ",
    "url": "https://arxiv.org/abs/2302.01890",
    "authors": [
      "Haoyu Liu",
      "Douglas J. Leith",
      "Paul Patras"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.01918",
    "title": "PyGlove: Efficiently Exchanging ML Ideas as Code",
    "abstract": "The increasing complexity and scale of machine learning (ML) has led to the need for more efficient collaboration among multiple teams. For example, when a research team invents a new architecture like \"ResNet,\" it is desirable for multiple engineering teams to adopt it. However, the effort required for each team to study and understand the invention does not scale well with the number of teams or inventions. In this paper, we present an extension of our PyGlove library to easily and scalably share ML ideas. PyGlove represents ideas as symbolic rule-based patches, enabling researchers to write down the rules for models they have not seen. For example, an inventor can write rules that will \"add skip-connections.\" This permits a network effect among teams: at once, any team can issue patches to all other teams. Such a network effect allows users to quickly surmount the cost of adopting PyGlove by writing less code quicker, providing a benefit that scales with time. We describe the new paradigm of organizing ML through symbolic patches and compare it to existing approaches. We also perform a case study of a large codebase where PyGlove led to an 80% reduction in the number of lines of code. ",
    "url": "https://arxiv.org/abs/2302.01918",
    "authors": [
      "Daiyi Peng",
      "Xuanyi Dong",
      "Esteban Real",
      "Yifeng Lu",
      "Quoc V. Le"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Symbolic Computation (cs.SC)"
    ]
  },
  {
    "id": "arXiv:2302.01923",
    "title": "Real-Time Traffic End-of-Queue Detection and Tracking in UAV Video",
    "abstract": "Highway work zones are susceptible to undue accumulation of motorized vehicles which calls for dynamic work zone warning signs to prevent accidents. The work zone signs are placed according to the location of the end-of-queue of vehicles which usually changes rapidly. The detection of moving objects in video captured by Unmanned Aerial Vehicles (UAV) has been extensively researched so far, and is used in a wide array of applications including traffic monitoring. Unlike the fixed traffic cameras, UAVs can be used to monitor the traffic at work zones in real-time and also in a more cost-effective way. This study presents a method as a proof of concept for detecting End-of-Queue (EOQ) of traffic by processing the real-time video footage of a highway work zone captured by UAV. EOQ is detected in the video by image processing which includes background subtraction and blob detection methods. This dynamic localization of EOQ of vehicles will enable faster and more accurate relocation of work zone warning signs for drivers and thus will reduce work zone fatalities. The method can be applied to detect EOQ of vehicles and notify drivers in any other roads or intersections too where vehicles are rapidly accumulating due to special events, traffic jams, construction, or accidents. ",
    "url": "https://arxiv.org/abs/2302.01923",
    "authors": [
      "Russ Messenger",
      "Md Zobaer Islam",
      "Matthew Whitlock",
      "Erik Spong",
      "Nate Morton",
      "Layne Claggett",
      "Chris Matthews",
      "Jordan Fox",
      "Leland Palmer",
      "Dane C. Johnson",
      "John F. O'Hara",
      "Christopher J. Crick",
      "Jamey D. Jacob",
      "Sabit Ekin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2302.01367",
    "title": "Augmented Learning of Heterogeneous Treatment Effects via Gradient  Boosting Trees",
    "abstract": "Heterogeneous treatment effects (HTE) based on patients' genetic or clinical factors are of significant interest to precision medicine. Simultaneously modeling HTE and corresponding main effects for randomized clinical trials with high-dimensional predictive markers is challenging. Motivated by the modified covariates approach, we propose a two-stage statistical learning procedure for estimating HTE with optimal efficiency augmentation, generalizing to arbitrary interaction model and exploiting powerful extreme gradient boosting trees (XGBoost). Target estimands for HTE are defined in the scale of mean difference for quantitative outcomes, or risk ratio for binary outcomes, which are the minimizers of specialized loss functions. The first stage is to estimate the main-effect equivalency of the baseline markers on the outcome, which is then used as an augmentation term in the second stage estimation for HTE. The proposed two-stage procedure is robust to model mis-specification of main effects and improves efficiency for estimating HTE through nonparametric function estimation, e.g., XGBoost. A permutation test is proposed for global assessment of evidence for HTE. An analysis of a genetic study in Prostate Cancer Prevention Trial led by the SWOG Cancer Research Network, is conducted to showcase the properties and the utilities of the two-stage method. ",
    "url": "https://arxiv.org/abs/2302.01367",
    "authors": [
      "Heng Chen",
      "Michael L. LeBlanc",
      "James Y. Dai"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2302.01407",
    "title": "Hypothesis Testing and Machine Learning: Interpreting Variable Effects  in Deep Artificial Neural Networks using Cohen's f2",
    "abstract": "Deep artificial neural networks show high predictive performance in many fields, but they do not afford statistical inferences and their black-box operations are too complicated for humans to comprehend. Because positing that a relationship exists is often more important than prediction in scientific experiments and research models, machine learning is far less frequently used than inferential statistics. Additionally, statistics calls for improving the test of theory by showing the magnitude of the phenomena being studied. This article extends current XAI methods and develops a model agnostic hypothesis testing framework for machine learning. First, Fisher's variable permutation algorithm is tweaked to compute an effect size measure equivalent to Cohen's f2 for OLS regression models. Second, the Mann-Kendall test of monotonicity and the Theil-Sen estimator is applied to Apley's accumulated local effect plots to specify a variable's direction of influence and statistical significance. The usefulness of this approach is demonstrated on an artificial data set and a social survey with a Python sandbox implementation. ",
    "url": "https://arxiv.org/abs/2302.01407",
    "authors": [
      "Wolfgang Messner"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.01527",
    "title": "Quantum Data-Syndrome Codes: Subsystem and Impure Code Constructions",
    "abstract": "Quantum error correction requires the use of error syndromes derived from measurements that may be unreliable. Recently, quantum data-syndrome (QDS) codes have been proposed as a possible approach to protect against both data and syndrome errors, in which a set of linearly dependent stabilizer measurements are performed to increase redundancy. Motivated by wanting to reduce the total number of measurements performed, we introduce QDS subsystem codes, and show that they can outperform similar QDS stabilizer codes derived from them. We also give a construction of single-error-correcting QDS stabilizer codes from impure stabilizer codes, and show that any such code must satisfy a variant of the quantum Hamming bound for QDS codes. Finally, we use this bound to prove a new bound that applies to impure, but not pure, stabilizer codes that may be of independent interest. ",
    "url": "https://arxiv.org/abs/2302.01527",
    "authors": [
      "Andrew Nemec"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2302.01629",
    "title": "Beyond the Universal Law of Robustness: Sharper Laws for Random Features  and Neural Tangent Kernels",
    "abstract": "Machine learning models are vulnerable to adversarial perturbations, and a thought-provoking paper by Bubeck and Sellke has analyzed this phenomenon through the lens of over-parameterization: interpolating smoothly the data requires significantly more parameters than simply memorizing it. However, this \"universal\" law provides only a necessary condition for robustness, and it is unable to discriminate between models. In this paper, we address these gaps by focusing on empirical risk minimization in two prototypical settings, namely, random features and the neural tangent kernel (NTK). We prove that, for random features, the model is not robust for any degree of over-parameterization, even when the necessary condition coming from the universal law of robustness is satisfied. In contrast, for even activations, the NTK model meets the universal lower bound, and it is robust as soon as the necessary condition on over-parameterization is fulfilled. This also addresses a conjecture in prior work by Bubeck, Li and Nagaraj. Our analysis decouples the effect of the kernel of the model from an \"interaction matrix\", which describes the interaction with the test data and captures the effect of the activation. Our theoretical results are corroborated by numerical evidence on both synthetic and standard datasets (MNIST, CIFAR-10). ",
    "url": "https://arxiv.org/abs/2302.01629",
    "authors": [
      "Simone Bombari",
      "Shayan Kiyani",
      "Marco Mondelli"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01638",
    "title": "Acyclic Chromatic Index of Chordless Graphs",
    "abstract": "An acyclic edge coloring of a graph is a proper edge coloring in which there are no bichromatic cycles. The acyclic chromatic index of a graph $G$ denoted by $a'(G)$, is the minimum positive integer $k$ such that $G$ has an acyclic edge coloring with $k$ colors. It has been conjectured by Fiam\\v{c}\\'{\\i}k that $a'(G) \\le \\Delta+2$ for any graph $G$ with maximum degree $\\Delta$. Linear arboricity of a graph $G$, denoted by $la(G)$, is the minimum number of linear forests into which the edges of $G$ can be partitioned. A graph is said to be chordless if no cycle in the graph contains a chord. Every $2$-connected chordless graph is a minimally $2$-connected graph. It was shown by Basavaraju and Chandran that if $G$ is $2$-degenerate, then $a'(G) \\le \\Delta+1$. Since chordless graphs are also $2$-degenerate, we have $a'(G) \\le \\Delta+1$ for any chordless graph $G$. Machado, de Figueiredo and Trotignon proved that the chromatic index of a chordless graph is $\\Delta$ when $\\Delta \\ge 3$. They also obtained a polynomial time algorithm to color a chordless graph optimally. We improve this result by proving that the acyclic chromatic index of a chordless graph is $\\Delta$, except when $\\Delta=2$ and the graph has a cycle, in which case it is $\\Delta+1$. We also provide the sketch of a polynomial time algorithm for an optimal acyclic edge coloring of a chordless graph. As a byproduct, we also prove that $la(G) = \\lceil \\frac{\\Delta }{2} \\rceil$, unless $G$ has a cycle with $\\Delta=2$, in which case $la(G) = \\lceil \\frac{\\Delta+1}{2} \\rceil = 2$. To obtain the result on acyclic chromatic index, we prove a structural result on chordless graphs which is a refinement of the structure given by Machado, de Figueiredo and Trotignon for this class of graphs. This might be of independent interest. ",
    "url": "https://arxiv.org/abs/2302.01638",
    "authors": [
      "Manu Basavaraju",
      "Suresh Manjanath Hegde",
      "Shashanka Kulamarva"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2302.01663",
    "title": "Adversarial queues and trading on a CFMM",
    "abstract": "We describe a plausible probabilistic model for a blockchain queueing environment in which rational, profit-maximising schedulers impose adversarial disciplines on incoming messages containing a payload that encodes a state transition in a machine. The model can be specialised to apply to chains with fixed or variable block times, traditional priority queue disciplines with `honest' schedulers, or adversarial public mempools. We find conditions under which the model behaves as a bulk-service queue with priority discipline and derive practical expressions for the relative block and message number of a transaction. We study this setup in the context of orders to a CFMM DEX where the execution price a user receives may be quite sensitive to its positioning in the chain -- in particular, to a string of transactions scheduled for prior execution which is not knowable at the time of order creation. We derive statistical models for the price impact of this order flow both in the presence and absence of MEV extraction activity. ",
    "url": "https://arxiv.org/abs/2302.01663",
    "authors": [
      "Andrew W. Macpherson"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Computer Science and Game Theory (cs.GT)",
      "Trading and Market Microstructure (q-fin.TR)"
    ]
  },
  {
    "id": "arXiv:2302.01694",
    "title": "Coevolving Boolean and Multi-Valued Regulatory Networks",
    "abstract": "Random Boolean networks have been used widely to explore aspects of gene regulatory networks. A modified form of the model through which to systematically explore the effects of increasing the number of gene states has previously been introduced. In this paper, these discrete dynamical networks are coevolved within coupled, rugged fitness landscapes to explore their behaviour. Results suggest the general properties of the Boolean model remain with higher valued logic regardless of the update scheme or fitness sampling method. Introducing topological asymmetry in the coevolving networks is seen to alter behaviour. ",
    "url": "https://arxiv.org/abs/2302.01694",
    "authors": [
      "Larry Bull"
    ],
    "subjectives": [
      "Molecular Networks (q-bio.MN)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2302.01736",
    "title": "Relating EEG to continuous speech using deep neural networks: a review",
    "abstract": "Objective. When a person listens to continuous speech, a corresponding response is elicited in the brain and can be recorded using electroencephalography (EEG). Linear models are presently used to relate the EEG recording to the corresponding speech signal. The ability of linear models to find a mapping between these two signals is used as a measure of neural tracking of speech. Such models are limited as they assume linearity in the EEG-speech relationship, which omits the nonlinear dynamics of the brain. As an alternative, deep learning models have recently been used to relate EEG to continuous speech, especially in auditory attention decoding (AAD) and single-speech-source paradigms. Approach. This paper reviews and comments on deep-learning-based studies that relate EEG to continuous speech in AAD and single-speech-source paradigms. We point out recurrent methodological pitfalls and the need for a standard benchmark of model analysis. Main results. We gathered 28 studies. The main methodological issues we found are biased cross-validations, data leakage leading to over-fitted models, or disproportionate data size compared to the model's complexity. In addition, we address requirements for a standard benchmark model analysis, such as public datasets, common evaluation metrics, and good practices for the match-mismatch task. Significance. We are the first to present a review paper summarizing the main deep-learning-based studies that relate EEG to speech while addressing methodological pitfalls and important considerations for this newly expanding field. Our study is particularly relevant given the growing application of deep learning in EEG-speech decoding. ",
    "url": "https://arxiv.org/abs/2302.01736",
    "authors": [
      "Corentin Puffay",
      "Bernd Accou",
      "Lies Bollens",
      "Mohammad Jalilpour Monesi",
      "Jonas Vanthornhout",
      "Hugo Van hamme",
      "Tom Francart"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2302.01738",
    "title": "AIROGS: Artificial Intelligence for RObust Glaucoma Screening Challenge",
    "abstract": "The early detection of glaucoma is essential in preventing visual impairment. Artificial intelligence (AI) can be used to analyze color fundus photographs (CFPs) in a cost-effective manner, making glaucoma screening more accessible. While AI models for glaucoma screening from CFPs have shown promising results in laboratory settings, their performance decreases significantly in real-world scenarios due to the presence of out-of-distribution and low-quality images. To address this issue, we propose the Artificial Intelligence for Robust Glaucoma Screening (AIROGS) challenge. This challenge includes a large dataset of around 113,000 images from about 60,000 patients and 500 different screening centers, and encourages the development of algorithms that are robust to ungradable and unexpected input data. We evaluated solutions from 14 teams in this paper, and found that the best teams performed similarly to a set of 20 expert ophthalmologists and optometrists. The highest-scoring team achieved an area under the receiver operating characteristic curve of 0.99 (95% CI: 0.98-0.99) for detecting ungradable images on-the-fly. Additionally, many of the algorithms showed robust performance when tested on three other publicly available datasets. These results demonstrate the feasibility of robust AI-enabled glaucoma screening. ",
    "url": "https://arxiv.org/abs/2302.01738",
    "authors": [
      "Coen de Vente",
      "Koenraad A. Vermeer",
      "Nicolas Jaccard",
      "He Wang",
      "Hongyi Sun",
      "Firas Khader",
      "Daniel Truhn",
      "Temirgali Aimyshev",
      "Yerkebulan Zhanibekuly",
      "Tien-Dung Le",
      "Adrian Galdran",
      "Miguel Ángel González Ballester",
      "Gustavo Carneiro",
      "Devika R G",
      "Hrishikesh P S",
      "Densen Puthussery",
      "Hong Liu",
      "Zekang Yang",
      "Satoshi Kondo",
      "Satoshi Kasai",
      "Edward Wang",
      "Ashritha Durvasula",
      "Jónathan Heras",
      "Miguel Ángel Zapata",
      "Teresa Araújo",
      "Guilherme Aresta",
      "Hrvoje Bogunović",
      "Mustafa Arikan",
      "Yeong Chan Lee",
      "Hyun Bin Cho",
      "Yoon Ho Choi",
      "Abdul Qayyum",
      "Imran Razzak",
      "Bram van Ginneken",
      "Hans G. Lemij",
      "Clara I. Sánchez"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01759",
    "title": "Leveraging a Probabilistic PCA Model to Understand the Multivariate  Statistical Network Monitoring Framework for Network Security Anomaly  Detection",
    "abstract": "Network anomaly detection is a very relevant research area nowadays, especially due to its multiple applications in the field of network security. The boost of new models based on variational autoencoders and generative adversarial networks has motivated a reevaluation of traditional techniques for anomaly detection. It is, however, essential to be able to understand these new models from the perspective of the experience attained from years of evaluating network security data for anomaly detection. In this paper, we revisit anomaly detection techniques based on PCA from a probabilistic generative model point of view, and contribute a mathematical model that relates them. Specifically, we start with the probabilistic PCA model and explain its connection to the Multivariate Statistical Network Monitoring (MSNM) framework. MSNM was recently successfully proposed as a means of incorporating industrial process anomaly detection experience into the field of networking. We have evaluated the mathematical model using two different datasets. The first, a synthetic dataset created to better understand the analysis proposed, and the second, UGR'16, is a specifically designed real-traffic dataset for network security anomaly detection. We have drawn conclusions that we consider to be useful when applying generative models to network security detection. ",
    "url": "https://arxiv.org/abs/2302.01759",
    "authors": [
      "Fernando Pérez-Bueno",
      "Luz García",
      "Gabriel Maciá-Fernández",
      "Rafael Molina"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01788",
    "title": "IMPORTANT-Net: Integrated MRI Multi-Parameter Reinforcement Fusion  Generator with Attention Network for Synthesizing Absent Data",
    "abstract": "Magnetic resonance imaging (MRI) is highly sensitive for lesion detection in the breasts. Sequences obtained with different settings can capture the specific characteristics of lesions. Such multi-parameter MRI information has been shown to improve radiologist performance in lesion classification, as well as improving the performance of artificial intelligence models in various tasks. However, obtaining multi-parameter MRI makes the examination costly in both financial and time perspectives, and there may be safety concerns for special populations, thus making acquisition of the full spectrum of MRI sequences less durable. In this study, different than naive input fusion or feature concatenation from existing MRI parameters, a novel $\\textbf{I}$ntegrated MRI $\\textbf{M}$ulti-$\\textbf{P}$arameter reinf$\\textbf{O}$rcement fusion generato$\\textbf{R}$ wi$\\textbf{T}$h $\\textbf{A}$tte$\\textbf{NT}$ion Network (IMPORTANT-Net) is developed to generate missing parameters. First, the parameter reconstruction module is used to encode and restore the existing MRI parameters to obtain the corresponding latent representation information at any scale level. Then the multi-parameter fusion with attention module enables the interaction of the encoded information from different parameters through a set of algorithmic strategies, and applies different weights to the information through the attention mechanism after information fusion to obtain refined representation information. Finally, a reinforcement fusion scheme embedded in a $V^{-}$-shape generation module is used to combine the hierarchical representations to generate the missing MRI parameter. Results showed that our IMPORTANT-Net is capable of generating missing MRI parameters and outperforms comparable state-of-the-art networks. Our code is available at https://github.com/Netherlands-Cancer-Institute/MRI_IMPORTANT_NET. ",
    "url": "https://arxiv.org/abs/2302.01788",
    "authors": [
      "Tianyu Zhang",
      "Tao Tan",
      "Luyi Han",
      "Xin Wang",
      "Yuan Gao",
      "Jonas Teuwen",
      "Regina Beets-Tan",
      "Ritse Mann"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.01802",
    "title": "FR3D: Three-dimensional Flow Reconstruction and Force Estimation for  Unsteady Flows Around Arbitrary Bluff Bodies via Conformal Mapping Aided  Convolutional Autoencoders",
    "abstract": "In many practical fluid dynamics experiments, measuring variables such as velocity and pressure is possible only at a limited number of sensor locations, or for a few two-dimensional planes in the flow. However, knowledge of the full fields is necessary to understand the dynamics of many flows. Deep learning reconstruction of full flow fields from sparse measurements has recently garnered significant research interest, as a way of overcoming this limitation. This task is referred to as the flow reconstruction (FR) task. In the present study, we propose a convolutional autoencoder based neural network model, dubbed FR3D, which enables FR to be carried out for three-dimensional flows around extruded 3D objects with arbitrary cross-sections. An innovative mapping approach, whereby multiple fluid domains are mapped to an annulus, enables FR3D to generalize its performance to objects not encountered during training. We conclusively demonstrate this generalization capability using a dataset composed of 80 training and 20 testing geometries, all randomly generated. We show that the FR3D model reconstructs pressure and velocity components with a few percentage points of error. Additionally, using these predictions, we accurately estimate the Q-criterion fields as well lift and drag forces on the geometries. ",
    "url": "https://arxiv.org/abs/2302.01802",
    "authors": [
      "Ali Girayhan Özbay",
      "Sylvain Laizet"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Artificial Intelligence (cs.AI)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2101.09306",
    "title": "Towards Optimal Branching of Linear and Semidefinite Relaxations for  Neural Network Robustness Certification",
    "abstract": " Comments: This is an extension of our IEEE CDC 2020 conference paper arXiv:2004.00570 ",
    "url": "https://arxiv.org/abs/2101.09306",
    "authors": [
      "Brendon G. Anderson",
      "Ziye Ma",
      "Jingqi Li",
      "Somayeh Sojoudi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2102.08501",
    "title": "DEUP: Direct Epistemic Uncertainty Prediction",
    "abstract": " Title: DEUP: Direct Epistemic Uncertainty Prediction ",
    "url": "https://arxiv.org/abs/2102.08501",
    "authors": [
      "Salem Lahlou",
      "Moksh Jain",
      "Hadi Nekoei",
      "Victor Ion Butoi",
      "Paul Bertin",
      "Jarrid Rector-Brooks",
      "Maksym Korablyov",
      "Yoshua Bengio"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2104.14046",
    "title": "Ten-tier and multi-scale supplychain network analysis of medical  equipment: Random failure and intelligent attack analysis",
    "abstract": " Comments: 47 pages ",
    "url": "https://arxiv.org/abs/2104.14046",
    "authors": [
      "Kayvan Miri Lavassani",
      "Zachary M. Boyd",
      "Bahar Movahedi",
      "Jason Vasquez"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2106.12732",
    "title": "Online Verification of Deep Neural Networks under Domain Shift or  Network Updates",
    "abstract": " Title: Online Verification of Deep Neural Networks under Domain Shift or  Network Updates ",
    "url": "https://arxiv.org/abs/2106.12732",
    "authors": [
      "Tianhao Wei",
      "Changliu Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.03011",
    "title": "LEAF: Navigating Concept Drift in Cellular Networks",
    "abstract": " Title: LEAF: Navigating Concept Drift in Cellular Networks ",
    "url": "https://arxiv.org/abs/2109.03011",
    "authors": [
      "Shinan Liu",
      "Francesco Bronzino",
      "Paul Schmitt",
      "Arjun Nitin Bhagoji",
      "Nick Feamster",
      "Hector Garcia Crespo",
      "Timothy Coyle",
      "Brian Ward"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2111.06813",
    "title": "Local algorithms for Maximum Cut and Minimum Bisection on locally  treelike regular graphs of large degree",
    "abstract": " Comments: Improved presentation. To appear in Random Structures and Algorithms ",
    "url": "https://arxiv.org/abs/2111.06813",
    "authors": [
      "Ahmed El Alaoui",
      "Andrea Montanari",
      "Mark Sellke"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Discrete Mathematics (cs.DM)",
      "Mathematical Physics (math-ph)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2111.07911",
    "title": "On the Tradeoff between Energy, Precision, and Accuracy in Federated  Quantized Neural Networks",
    "abstract": " Comments: This paper is accepted by IEEE International Conference on Communications 2022 ",
    "url": "https://arxiv.org/abs/2111.07911",
    "authors": [
      "Minsu Kim",
      "Walid Saad",
      "Mohammad Mozaffari",
      "Merouane Debbah"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.10879",
    "title": "S$^3$NN: Time Step Reduction of Spiking Surrogate Gradients for Training  Energy Efficient Single-Step Spiking Neural Networks",
    "abstract": " Comments: 23 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2201.10879",
    "authors": [
      "Kazuma Suetake",
      "Shin-ichi Ikegawa",
      "Ryuji Saiin",
      "Yoshihide Sawada"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2202.02385",
    "title": "Using Large-scale Heterogeneous Graph Representation Learning for Code  Review Recommendations at Microsoft",
    "abstract": " Comments: ICSE 2023 Software Engineering in Practice (camera ready) ",
    "url": "https://arxiv.org/abs/2202.02385",
    "authors": [
      "Jiyang Zhang",
      "Chandra Maddila",
      "Ram Bairi",
      "Christian Bird",
      "Ujjwal Raizada",
      "Apoorva Agrawal",
      "Yamini Jhawar",
      "Kim Herzig",
      "Arie van Deursen"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.01032",
    "title": "Graph Rewriting and Relabeling with PBPO+: A Unifying Theory for  Quasitoposes",
    "abstract": " Comments: This article significantly extends and improves arXiv:2010.08230. 36 pages ",
    "url": "https://arxiv.org/abs/2203.01032",
    "authors": [
      "Roy Overbeek",
      "Jörg Endrullis",
      "Aloïs Rosset"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2203.11624",
    "title": "High-resolution Iterative Feedback Network for Camouflaged Object  Detection",
    "abstract": " Title: High-resolution Iterative Feedback Network for Camouflaged Object  Detection ",
    "url": "https://arxiv.org/abs/2203.11624",
    "authors": [
      "Xiaobin Hu",
      "Shuo Wang",
      "Xuebin Qin",
      "Hang Dai",
      "Wenqi Ren",
      "Ying Tai",
      "Chengjie Wang",
      "Ling Shao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07731",
    "title": "Transfer learning based physics-informed neural networks for solving  inverse problems in engineering structures under different loading scenarios",
    "abstract": " Comments: final version ",
    "url": "https://arxiv.org/abs/2205.07731",
    "authors": [
      "Chen Xu",
      "Ba Trung Cao",
      "Yong Yuan",
      "Günther Meschke"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2205.10159",
    "title": "Getting a-Round Guarantees: Floating-Point Attacks on Certified  Robustness",
    "abstract": " Title: Getting a-Round Guarantees: Floating-Point Attacks on Certified  Robustness ",
    "url": "https://arxiv.org/abs/2205.10159",
    "authors": [
      "Jiankai Jin",
      "Olga Ohrimenko",
      "Benjamin I. P. Rubinstein"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.14690",
    "title": "CoNT: Contrastive Neural Text Generation",
    "abstract": " Comments: Accepted by NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2205.14690",
    "authors": [
      "Chenxin An",
      "Jiangtao Feng",
      "Kai Lv",
      "Lingpeng Kong",
      "Xipeng Qiu",
      "Xuanjing Huang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.15357",
    "title": "Searching for the Essence of Adversarial Perturbations",
    "abstract": " Title: Searching for the Essence of Adversarial Perturbations ",
    "url": "https://arxiv.org/abs/2205.15357",
    "authors": [
      "Dennis Y. Menn",
      "Tzu-hsun Feng",
      "Hung-yi Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2206.04798",
    "title": "A*Net: A Scalable Path-based Reasoning Approach for Knowledge Graphs",
    "abstract": " Title: A*Net: A Scalable Path-based Reasoning Approach for Knowledge Graphs ",
    "url": "https://arxiv.org/abs/2206.04798",
    "authors": [
      "Zhaocheng Zhu",
      "Xinyu Yuan",
      "Michael Galkin",
      "Sophie Xhonneux",
      "Ming Zhang",
      "Maxime Gazeau",
      "Jian Tang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.12447",
    "title": "XMD: An Expansive Hardware-telemetry based Mobile Malware Detector to  enhance Endpoint Detection",
    "abstract": " Title: XMD: An Expansive Hardware-telemetry based Mobile Malware Detector to  enhance Endpoint Detection ",
    "url": "https://arxiv.org/abs/2206.12447",
    "authors": [
      "Harshit Kumar",
      "Biswadeep Chakraborty",
      "Sudarshan Sharma",
      "Saibal Mukhopadhyay"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2207.00450",
    "title": "Packing cycles in planar and bounded-genus graphs",
    "abstract": " Comments: 38 pages ",
    "url": "https://arxiv.org/abs/2207.00450",
    "authors": [
      "Niklas Schlomberg",
      "Hanjo Thiele",
      "Jens Vygen"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)",
      "Geometric Topology (math.GT)"
    ]
  },
  {
    "id": "arXiv:2207.10942",
    "title": "Aries: Efficient Testing of Deep Neural Networks via Labeling-Free  Accuracy Estimation",
    "abstract": " Comments: accepted to ICSE'23, preprint version ",
    "url": "https://arxiv.org/abs/2207.10942",
    "authors": [
      "Qiang Hu",
      "Yuejun Guo",
      "Xiaofei Xie",
      "Maxime Cordy",
      "Lei Ma",
      "Mike Papadakis",
      "Yves Le Traon"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.06073",
    "title": "Conditional Antibody Design as 3D Equivariant Graph Translation",
    "abstract": " Comments: Accepted to ICLR 2023 as oral presentation ",
    "url": "https://arxiv.org/abs/2208.06073",
    "authors": [
      "Xiangzhe Kong",
      "Wenbing Huang",
      "Yang Liu"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.06980",
    "title": "Faster Attention Is What You Need: A Fast Self-Attention Neural Network  Backbone Architecture for the Edge via Double-Condensing Attention Condensers",
    "abstract": " Title: Faster Attention Is What You Need: A Fast Self-Attention Neural Network  Backbone Architecture for the Edge via Double-Condensing Attention Condensers ",
    "url": "https://arxiv.org/abs/2208.06980",
    "authors": [
      "Alexander Wong",
      "Mohammad Javad Shafiee",
      "Saad Abbasi",
      "Saeejith Nair",
      "Mahmoud Famouri"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2208.11881",
    "title": "CMOS-based area-and-power-efficient neuron and synapse circuits for  time-domain analog spiking neural networks",
    "abstract": " Title: CMOS-based area-and-power-efficient neuron and synapse circuits for  time-domain analog spiking neural networks ",
    "url": "https://arxiv.org/abs/2208.11881",
    "authors": [
      "Xiangyu Chen",
      "Zolboo Byambadorj",
      "Takeaki Yajima",
      "Hisashi Inoue",
      "Isao H. Inoue",
      "Tetsuya Iizuka"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2209.04142",
    "title": "Causal Modeling of Policy Interventions From Sequences of Treatments and  Outcomes using Gaussian Processes",
    "abstract": " Title: Causal Modeling of Policy Interventions From Sequences of Treatments and  Outcomes using Gaussian Processes ",
    "url": "https://arxiv.org/abs/2209.04142",
    "authors": [
      "Çağlar Hızlı",
      "ST John",
      "Anne Juuti",
      "Tuure Saarinen",
      "Kirsi Pietiläinen",
      "Pekka Marttinen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2209.13507",
    "title": "CrossDTR: Cross-view and Depth-guided Transformers for 3D Object  Detection",
    "abstract": " Comments: Accepted by IEEE International Conference on Robotics and Automation (ICRA) 2023. The code is available at this https URL ",
    "url": "https://arxiv.org/abs/2209.13507",
    "authors": [
      "Ching-Yu Tseng",
      "Yi-Rong Chen",
      "Hsin-Ying Lee",
      "Tsung-Han Wu",
      "Wen-Chin Chen",
      "Winston H. Hsu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2210.08326",
    "title": "Distributionally Robust Causal Inference with Observational Data",
    "abstract": " Title: Distributionally Robust Causal Inference with Observational Data ",
    "url": "https://arxiv.org/abs/2210.08326",
    "authors": [
      "Dimitris Bertsimas",
      "Kosuke Imai",
      "Michael Lingzhi Li"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2210.09789",
    "title": "Anti-Symmetric DGN: a stable architecture for Deep Graph Networks",
    "abstract": " Comments: Accepted at ICLR 2023 (this https URL) ",
    "url": "https://arxiv.org/abs/2210.09789",
    "authors": [
      "Alessio Gravina",
      "Davide Bacciu",
      "Claudio Gallicchio"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.13148",
    "title": "Transformers over Directed Acyclic Graphs",
    "abstract": " Title: Transformers over Directed Acyclic Graphs ",
    "url": "https://arxiv.org/abs/2210.13148",
    "authors": [
      "Yuankai Luo",
      "Veronika Thost",
      "Yicheng Pan",
      "Lei Shi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.13206",
    "title": "Post-Selection Confidence Bounds for Prediction Performance",
    "abstract": " Comments: 17 pages, 13 figures, 3 tables. Submitted to the Springer Machine Learning Journal. Changes to version 2: made figures easier to read; corrected a minor typo ",
    "url": "https://arxiv.org/abs/2210.13206",
    "authors": [
      "Pascal Rink",
      "Werner Brannath"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.08597",
    "title": "SketchySGD: Reliable Stochastic Optimization via Robust Curvature  Estimates",
    "abstract": " Comments: 20 pages, 10 figures, 4 tables ",
    "url": "https://arxiv.org/abs/2211.08597",
    "authors": [
      "Zachary Frangella",
      "Pratik Rathore",
      "Shipu Zhao",
      "Madeleine Udell"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.12219",
    "title": "Adaptive Sparse Structure Development with Pruning and Regeneration for  Spiking Neural Networks",
    "abstract": " Title: Adaptive Sparse Structure Development with Pruning and Regeneration for  Spiking Neural Networks ",
    "url": "https://arxiv.org/abs/2211.12219",
    "authors": [
      "Bing Han",
      "Feifei Zhao",
      "Yi Zeng",
      "Wenxuan Pan"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.16708",
    "title": "Statistical treatment of convolutional neural network super-resolution  of inland surface wind for subgrid-scale variability quantification",
    "abstract": " Title: Statistical treatment of convolutional neural network super-resolution  of inland surface wind for subgrid-scale variability quantification ",
    "url": "https://arxiv.org/abs/2211.16708",
    "authors": [
      "Daniel Getter",
      "Julie Bessac",
      "Johann Rudi",
      "Yan Feng"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.01551",
    "title": "Cause of Causal Emergence: Redistribution of Uncertainty and Its  Critical Condition",
    "abstract": " Comments: 18 pages, 14 figures ",
    "url": "https://arxiv.org/abs/2212.01551",
    "authors": [
      "Liye Jia",
      "Cong Zhou",
      "Ka Lok Man",
      "Sheng-Uei Guan",
      "Jeremy Smith",
      "Yutao Yue"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Artificial Intelligence (cs.AI)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2301.09771",
    "title": "Automation and AI Technology in Surface Mining With a Brief Introduction  to Open-Pit Operations in the Pilbara",
    "abstract": " Comments: Keywords: Mining automation, robotics, intelligent systems, machine learning, remote sensing, geostatistics, planning, scheduling, optimization, modelling, geology, complex systems. Document: 11 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2301.09771",
    "authors": [
      "Raymond Leung",
      "Andrew J Hill",
      "Arman Melkumyan"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "General Literature (cs.GL)"
    ]
  },
  {
    "id": "arXiv:2301.11351",
    "title": "Estimating Causal Effects using a Multi-task Deep Ensemble",
    "abstract": " Comments: 17 pages, 6 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2301.11351",
    "authors": [
      "Ziyang Jiang",
      "Zhuoran Hou",
      "Yiling Liu",
      "Yiman Ren",
      "Keyu Li",
      "David Carlson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.12351",
    "title": "On the Opportunity of Causal Deep Generative Models: A Survey and Future  Directions",
    "abstract": " Title: On the Opportunity of Causal Deep Generative Models: A Survey and Future  Directions ",
    "url": "https://arxiv.org/abs/2301.12351",
    "authors": [
      "Guanglin Zhou",
      "Lina Yao",
      "Xiwei Xu",
      "Chen Wang",
      "Liming Zhu",
      "Kun Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.12831",
    "title": "M3FAS: An Accurate and Robust MultiModal Mobile Face Anti-Spoofing  System",
    "abstract": " Title: M3FAS: An Accurate and Robust MultiModal Mobile Face Anti-Spoofing  System ",
    "url": "https://arxiv.org/abs/2301.12831",
    "authors": [
      "Chenqi Kong",
      "Kexin Zheng",
      "Yibing Liu",
      "Shiqi Wang",
      "Anderson Rocha",
      "Haoliang Li"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.00506",
    "title": "Decentralized Stream Runtime Verification for Timed Asynchronous  Networks",
    "abstract": " Title: Decentralized Stream Runtime Verification for Timed Asynchronous  Networks ",
    "url": "https://arxiv.org/abs/2302.00506",
    "authors": [
      "Luis Miguel Danielsson",
      "César Sánchez"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2302.00609",
    "title": "Zero Shot Transfer of Legal Judgement Prediction as Article-aware  Entailment for the European Court of Human Rights",
    "abstract": " Comments: Accepted to EACL Findings 2023 ",
    "url": "https://arxiv.org/abs/2302.00609",
    "authors": [
      "T.Y.S.S Santosh",
      "Oana Ichim",
      "Matthias Grabmair"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.00768",
    "title": "Leveraging task dependency and contrastive learning for Legal Judgement  Prediction on the European Court of Human Rights",
    "abstract": " Comments: Accepted to EACL 2023 ",
    "url": "https://arxiv.org/abs/2302.00768",
    "authors": [
      "T.Y.S.S Santosh",
      "Marcel Perez San Blas",
      "Phillip Kemper",
      "Matthias Grabmair"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.00981",
    "title": "Predicting Molecule-Target Interaction by Learning Biomedical Network  and Molecule Representations",
    "abstract": " Comments: 9 pages, 6 figures. arXiv admin note: substantial text overlap with arXiv:2102.01649 ",
    "url": "https://arxiv.org/abs/2302.00981",
    "authors": [
      "Jinjiang Guo",
      "Jie Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.01018",
    "title": "Graph Neural Networks for temporal graphs: State of the art, open  challenges, and opportunities",
    "abstract": " Title: Graph Neural Networks for temporal graphs: State of the art, open  challenges, and opportunities ",
    "url": "https://arxiv.org/abs/2302.01018",
    "authors": [
      "Antonio Longa",
      "Veronica Lachi",
      "Gabriele Santin",
      "Monica Bianchini",
      "Bruno Lepri",
      "Pietro Lio",
      "Franco Scarselli",
      "Andrea Passerini"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.01278",
    "title": "Convolutional Autoencoders, Clustering and POD for Low-dimensional  Parametrization of Navier-Stokes Equations",
    "abstract": " Comments: 16 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2302.01278",
    "authors": [
      "Yongho Kim",
      "Jan Heiland"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Machine Learning (cs.LG)"
    ]
  }
]