[
  {
    "id": "arXiv:2401.02425",
    "title": "UAV Trajectory Planning for AoI-Minimal Data Collection in UAV-Aided IoT  Networks by Transformer",
    "abstract": "Maintaining freshness of data collection in Internet-of-Things (IoT) networks has attracted increasing attention. By taking into account age-of-information (AoI), we investigate the trajectory planning problem of an unmanned aerial vehicle (UAV) that is used to aid a cluster-based IoT network. An optimization problem is formulated to minimize the total AoI of the collected data by the UAV from the ground IoT network. Since the total AoI of the IoT network depends on the flight time of the UAV and the data collection time at hovering points, we jointly optimize the selection of hovering points and the visiting order to these points. We exploit the state-of-the-art transformer and the weighted A*, which is a path search algorithm, to design a machine learning algorithm to solve the formulated problem. The whole UAV-IoT system is fed into the encoder network of the proposed algorithm, and the algorithm's decoder network outputs the visiting order to ground clusters. Then, the weighted A* is used to find the hovering point for each cluster in the ground IoT network. Simulation results show that the trained model by the proposed algorithm has a good generalization ability to generate solutions for IoT networks with different numbers of ground clusters, without the need to retrain the model. Furthermore, results show that our proposed algorithm can find better UAV trajectories with the minimum total AoI when compared to other algorithms. ",
    "url": "https://arxiv.org/abs/2401.02425",
    "authors": [
      "Botao Zhu",
      "Ebrahim Bedeer",
      "Ha H. Nguyen",
      "Robert Barton",
      "Zhen Gao"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.02429",
    "title": "Brain-Inspired Spiking Neural Networks for Industrial Fault Diagnosis: A  Survey, Challenges, and Opportunities",
    "abstract": "In recent decades, Industrial Fault Diagnosis (IFD) has emerged as a crucial discipline concerned with detecting and gathering vital information about industrial equipment's health condition, thereby facilitating the identification of failure types and severities. The pursuit of precise and effective fault recognition has garnered substantial attention, culminating in a focus on automating equipment monitoring to preclude safety accidents and reduce reliance on human labor. The advent of artificial neural networks (ANNs) has been instrumental in augmenting intelligent IFD algorithms, particularly in the context of big data. Despite these advancements, ANNs, being a simplified biomimetic neural network model, exhibit inherent limitations such as resource and data dependencies and restricted cognitive capabilities. To address these limitations, the third-generation Spiking Neural Network (SNN), founded on principles of Brain-inspired computing, has surfaced as a promising alternative. The SNN, characterized by its biological neuron dynamics and spiking information encoding, demonstrates exceptional potential in representing spatiotemporal features. Consequently, developing SNN-based IFD models has gained momentum, displaying encouraging performance. Nevertheless, this field lacks systematic surveys to illustrate the current situation, challenges, and future directions. Therefore, this paper systematically reviews the theoretical progress of SNN-based models to answer the question of what SNN is. Subsequently, it reviews and analyzes existing SNN-based IFD models to explain why SNN needs to be used and how to use it. More importantly, this paper systematically answers the challenges, solutions, and opportunities of SNN in IFD. ",
    "url": "https://arxiv.org/abs/2401.02429",
    "authors": [
      "Huan Wang",
      "Yan-Fu Li",
      "Konstantinos Gryllias"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02437",
    "title": "Randomly Weighted Neuromodulation in Neural Networks Facilitates  Learning of Manifolds Common Across Tasks",
    "abstract": "Geometric Sensitive Hashing functions, a family of Local Sensitive Hashing functions, are neural network models that learn class-specific manifold geometry in supervised learning. However, given a set of supervised learning tasks, understanding the manifold geometries that can represent each task and the kinds of relationships between the tasks based on them has received little attention. We explore a formalization of this question by considering a generative process where each task is associated with a high-dimensional manifold, which can be done in brain-like models with neuromodulatory systems. Following this formulation, we define \\emph{Task-specific Geometric Sensitive Hashing~(T-GSH)} and show that a randomly weighted neural network with a neuromodulation system can realize this function. ",
    "url": "https://arxiv.org/abs/2401.02437",
    "authors": [
      "Jinyung Hong",
      "Theodore P. Pavlic"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02445",
    "title": "Social and Economic Impact Analysis of Solar Mini-Grids in Rural Africa:  A Cohort Study from Kenya and Nigeria",
    "abstract": "This study presents the first comprehensive analysis of the social and economic effects of solar mini-grids in rural African settings, specifically in Kenya and Nigeria. A group of 2,658 household heads and business owners connected to mini-grids over the last five years were interviewed both before and one year after their connection. These interviews focused on changes in gender equality, productivity, health, safety, and economic activity. The results show notable improvements in all areas. Economic activities and productivity increased significantly among the connected households and businesses. The median income of rural Kenyan community members quadrupled. Gender equality also improved, with women gaining more opportunities in decision making and business. Health and safety enhancements were linked to reduced use of hazardous energy sources like kerosene lamps. The introduction of solar mini-grids not only transformed the energy landscape but also led to broad socioeconomic benefits in these rural areas. The research highlights the substantial impact of decentralized renewable energy on the social and economic development of rural African communities. Its findings are crucial for policymakers, development agencies, and stakeholders focused on promoting sustainable energy and development in Africa. ",
    "url": "https://arxiv.org/abs/2401.02445",
    "authors": [
      "Amy Town Carabajal",
      "Akoua Orsot",
      "Marie Pelagie Elimbi Moudio",
      "Tracy Haggai",
      "Chioma Joy Okonkwo",
      "George Truett Jarrard III",
      "Nicholas Stearns Selby"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2401.02450",
    "title": "Locally Differentially Private Embedding Models in Distributed Fraud  Prevention Systems",
    "abstract": "Global financial crime activity is driving demand for machine learning solutions in fraud prevention. However, prevention systems are commonly serviced to financial institutions in isolation, and few provisions exist for data sharing due to fears of unintentional leaks and adversarial attacks. Collaborative learning advances in finance are rare, and it is hard to find real-world insights derived from privacy-preserving data processing systems. In this paper, we present a collaborative deep learning framework for fraud prevention, designed from a privacy standpoint, and awarded at the recent PETs Prize Challenges. We leverage latent embedded representations of varied-length transaction sequences, along with local differential privacy, in order to construct a data release mechanism which can securely inform externally hosted fraud and anomaly detection models. We assess our contribution on two distributed data sets donated by large payment networks, and demonstrate robustness to popular inference-time attacks, along with utility-privacy trade-offs analogous to published work in alternative application domains. ",
    "url": "https://arxiv.org/abs/2401.02450",
    "authors": [
      "Iker Perez",
      "Jason Wong",
      "Piotr Skalski",
      "Stuart Burrell",
      "Richard Mortier",
      "Derek McAuley",
      "David Sutton"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02453",
    "title": "Adaptive Differential Privacy in Federated Learning: A Priority-Based  Approach",
    "abstract": "Federated learning (FL) as one of the novel branches of distributed machine learning (ML), develops global models through a private procedure without direct access to local datasets. However, access to model updates (e.g. gradient updates in deep neural networks) transferred between clients and servers can reveal sensitive information to adversaries. Differential privacy (DP) offers a framework that gives a privacy guarantee by adding certain amounts of noise to parameters. This approach, although being effective in terms of privacy, adversely affects model performance due to noise involvement. Hence, it is always needed to find a balance between noise injection and the sacrificed accuracy. To address this challenge, we propose adaptive noise addition in FL which decides the value of injected noise based on features' relative importance. Here, we first propose two effective methods for prioritizing features in deep neural network models and then perturb models' weights based on this information. Specifically, we try to figure out whether the idea of adding more noise to less important parameters and less noise to more important parameters can effectively save the model accuracy while preserving privacy. Our experiments confirm this statement under some conditions. The amount of noise injected, the proportion of parameters involved, and the number of global iterations can significantly change the output. While a careful choice of parameters by considering the properties of datasets can improve privacy without intense loss of accuracy, a bad choice can make the model performance worse. ",
    "url": "https://arxiv.org/abs/2401.02453",
    "authors": [
      "Mahtab Talaei",
      "Iman Izadi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02457",
    "title": "eCIL-MU: Embedding based Class Incremental Learning and Machine  Unlearning",
    "abstract": "New categories may be introduced over time, or existing categories may need to be reclassified. Class incremental learning (CIL) is employed for the gradual acquisition of knowledge about new categories while preserving information about previously learned ones in such dynamic environments. It might also be necessary to also eliminate the influence of related categories on the model to adapt to reclassification. We thus introduce class-level machine unlearning (MU) within CIL. Typically, MU methods tend to be time-consuming and can potentially harm the model's performance. A continuous stream of unlearning requests could lead to catastrophic forgetting. To address these issues, we propose a non-destructive eCIL-MU framework based on embedding techniques to map data into vectors and then be stored in vector databases. Our approach exploits the overlap between CIL and MU tasks for acceleration. Experiments demonstrate the capability of achieving unlearning effectiveness and orders of magnitude (upto $\\sim 278\\times$) of acceleration. ",
    "url": "https://arxiv.org/abs/2401.02457",
    "authors": [
      "Zhiwei Zuo",
      "Zhuo Tang",
      "Bin Wang",
      "Kenli Li",
      "Anwitaman Datta"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.02472",
    "title": "Code Generation for a Variety of Accelerators for a Graph DSL",
    "abstract": "Sparse graphs are ubiquitous in real and virtual worlds. With the phenomenal growth in semi-structured and unstructured data, sizes of the underlying graphs have witnessed a rapid growth over the years. Analyzing such large structures necessitates parallel processing, which is challenged by the intrinsic irregularity of sparse computation, memory access, and communication. It would be ideal if programmers and domain-experts get to focus only on the sequential computation and a compiler takes care of auto-generating the parallel code. On the other side, there is a variety in the number of target hardware devices, and achieving optimal performance often demands coding in specific languages or frameworks. Our goal in this work is to focus on a graph DSL which allows the domain-experts to write almost-sequential code, and generate parallel code for different accelerators from the same algorithmic specification. In particular, we illustrate code generation from the StarPlat graph DSL for NVIDIA, AMD, and Intel GPUs using CUDA, OpenCL, SYCL, and OpenACC programming languages. Using a suite of ten large graphs and four popular algorithms, we present the efficacy of StarPlat's versatile code generator. ",
    "url": "https://arxiv.org/abs/2401.02472",
    "authors": [
      "Ashwina Kumar",
      "M. Venkata Krishna",
      "Prasanna Bartakke",
      "Rahul Kumar",
      "Rajesh Pandian M",
      "Nibedita Behera",
      "Rupesh Nasre"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2401.02511",
    "title": "Gain Scheduling with a Neural Operator for a Transport PDE with  Nonlinear Recirculation",
    "abstract": "To stabilize PDE models, control laws require space-dependent functional gains mapped by nonlinear operators from the PDE functional coefficients. When a PDE is nonlinear and its \"pseudo-coefficient\" functions are state-dependent, a gain-scheduling (GS) nonlinear design is the simplest approach to the design of nonlinear feedback. The GS version of PDE backstepping employs gains obtained by solving a PDE at each value of the state. Performing such PDE computations in real time may be prohibitive. The recently introduced neural operators (NO) can be trained to produce the gain functions, rapidly in real time, for each state value, without requiring a PDE solution. In this paper we introduce NOs for GS-PDE backstepping. GS controllers act on the premise that the state change is slow and, as a result, guarantee only local stability, even for ODEs. We establish local stabilization of hyperbolic PDEs with nonlinear recirculation using both a \"full-kernel\" approach and the \"gain-only\" approach to gain operator approximation. Numerical simulations illustrate stabilization and demonstrate speedup by three orders of magnitude over traditional PDE gain-scheduling. Code (Github) for the numerical implementation is published to enable exploration. ",
    "url": "https://arxiv.org/abs/2401.02511",
    "authors": [
      "Maxence Lamarque",
      "Luke Bhan",
      "Rafael Vazquez",
      "Miroslav Krstic"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2401.02542",
    "title": "A Community Detection and Graph Neural Network Based Link Prediction  Approach for Scientific Literature",
    "abstract": "This study introduces an innovative approach that integrates community detection algorithms with Graph Neural Network (GNN) models to enhance link prediction in scientific literature networks. We specifically focus on the utilization of the Louvain community detection algorithm to uncover latent community structures within these networks, which are then incorporated into GNN architectures to predict potential links. Our methodology demonstrates the importance of understanding community dynamics in complex networks and leverages the strengths of both community detection and GNNs to improve predictive accuracy. Through extensive experiments on bipartite graphs representing scientific collaborations and citations, our approach not only highlights the synergy between community detection and GNNs but also addresses some of the prevalent challenges in link prediction, such as scalability and resolution limits. The results suggest that incorporating community-level information can significantly enhance the performance of GNNs in link prediction tasks. This work contributes to the evolving field of network science by offering a novel perspective on integrating advanced machine learning techniques with traditional network analysis methods to better understand and predict the intricate patterns of scientific collaborations. ",
    "url": "https://arxiv.org/abs/2401.02542",
    "authors": [
      "Chunjiang Liu",
      "Yikun Han",
      "Haiyun Xu",
      "Shihan Yang",
      "Kaidi Wang",
      "Yongye Su"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.02563",
    "title": "Kairos: Efficient Temporal Graph Analytics on a Single Machine",
    "abstract": "Many important societal problems are naturally modeled as algorithms over temporal graphs. To date, however, most graph processing systems remain inefficient as they rely on distributed processing even for graphs that fit well within a commodity server's available storage. In this paper, we introduce Kairos, a temporal graph analytics system that provides application developers a framework for efficiently implementing and executing algorithms over temporal graphs on a single machine. Specifically, Kairos relies on fork-join parallelism and a highly optimized parallel data structure as core primitives to maximize performance of graph processing tasks needed for temporal graph analytics. Furthermore, we introduce the notion of selective indexing and show how it can be used with an efficient index to speedup temporal queries. Our experiments on a 24-core server show that our algorithms obtain good parallel speedups, and are significantly faster than equivalent algorithms in existing temporal graph processing systems: up to 60x against a shared-memory approach, and several orders of magnitude when compared with distributed processing of graphs that fit within a single server. ",
    "url": "https://arxiv.org/abs/2401.02563",
    "authors": [
      "Joana M. F. da Trindade",
      "Julian Shun",
      "Samuel Madden",
      "Nesime Tatbul"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2401.02566",
    "title": "Siamese Residual Neural Network for Musical Shape Evaluation in Piano  Performance Assessment",
    "abstract": "Understanding and identifying musical shape plays an important role in music education and performance assessment. To simplify the otherwise time- and cost-intensive musical shape evaluation, in this paper we explore how artificial intelligence (AI) driven models can be applied. Considering musical shape evaluation as a classification problem, a light-weight Siamese residual neural network (S-ResNN) is proposed to automatically identify musical shapes. To assess the proposed approach in the context of piano musical shape evaluation, we have generated a new dataset, containing 4116 music pieces derived by 147 piano preparatory exercises and performed in 28 categories of musical shapes. The experimental results show that the S-ResNN significantly outperforms a number of benchmark methods in terms of the precision, recall and F1 score. ",
    "url": "https://arxiv.org/abs/2401.02566",
    "authors": [
      "Xiaoquan Li",
      "Stephan Weiss",
      "Yijun Yan",
      "Yinhe Li",
      "Jinchang Ren",
      "John Soraghan",
      "Ming Gong"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2401.02575",
    "title": "Large Language Models for Social Networks: Applications, Challenges, and  Solutions",
    "abstract": "Large Language Models (LLMs) are transforming the way people generate, explore, and engage with content. We study how we can develop LLM applications for online social networks. Despite LLMs' successes in other domains, it is challenging to develop LLM-based products for social networks for numerous reasons, and it has been relatively under-reported in the research community. We categorize LLM applications for social networks into three categories. First is knowledge tasks where users want to find new knowledge and information, such as search and question-answering. Second is entertainment tasks where users want to consume interesting content, such as getting entertaining notification content. Third is foundational tasks that need to be done to moderate and operate the social networks, such as content annotation and LLM monitoring. For each task, we share the challenges we found, solutions we developed, and lessons we learned. To the best of our knowledge, this is the first comprehensive paper about developing LLM applications for social networks. ",
    "url": "https://arxiv.org/abs/2401.02575",
    "authors": [
      "Jingying Zeng",
      "Richard Huang",
      "Waleed Malik",
      "Langxuan Yin",
      "Bojan Babic",
      "Danny Shacham",
      "Xiao Yan",
      "Jaewon Yang",
      "Qi He"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02594",
    "title": "Unsupervised hard Negative Augmentation for contrastive learning",
    "abstract": "We present Unsupervised hard Negative Augmentation (UNA), a method that generates synthetic negative instances based on the term frequency-inverse document frequency (TF-IDF) retrieval model. UNA uses TF-IDF scores to ascertain the perceived importance of terms in a sentence and then produces negative samples by replacing terms with respect to that. Our experiments demonstrate that models trained with UNA improve the overall performance in semantic textual similarity tasks. Additional performance gains are obtained when combining UNA with the paraphrasing augmentation. Further results show that our method is compatible with different backbone models. Ablation studies also support the choice of having a TF-IDF-driven control on negative augmentation. ",
    "url": "https://arxiv.org/abs/2401.02594",
    "authors": [
      "Yuxuan Shu",
      "Vasileios Lampos"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.02600",
    "title": "Object-oriented backdoor attack against image captioning",
    "abstract": "Backdoor attack against image classification task has been widely studied and proven to be successful, while there exist little research on the backdoor attack against vision-language models. In this paper, we explore backdoor attack towards image captioning models by poisoning training data. Assuming the attacker has total access to the training dataset, and cannot intervene in model construction or training process. Specifically, a portion of benign training samples is randomly selected to be poisoned. Afterwards, considering that the captions are usually unfolded around objects in an image, we design an object-oriented method to craft poisons, which aims to modify pixel values by a slight range with the modification number proportional to the scale of the current detected object region. After training with the poisoned data, the attacked model behaves normally on benign images, but for poisoned images, the model will generate some sentences irrelevant to the given image. The attack controls the model behavior on specific test images without sacrificing the generation performance on benign test images. Our method proves the weakness of image captioning models to backdoor attack and we hope this work can raise the awareness of defending against backdoor attack in the image captioning field. ",
    "url": "https://arxiv.org/abs/2401.02600",
    "authors": [
      "Meiling Li",
      "Nan Zhong",
      "Xinpeng Zhang",
      "Zhenxing Qian",
      "Sheng Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.02602",
    "title": "Neural Causal Abstractions",
    "abstract": "The abilities of humans to understand the world in terms of cause and effect relationships, as well as to compress information into abstract concepts, are two hallmark features of human intelligence. These two topics have been studied in tandem in the literature under the rubric of causal abstractions theory. In practice, it remains an open problem how to best leverage abstraction theory in real-world causal inference tasks, where the true mechanisms are unknown and only limited data is available. In this paper, we develop a new family of causal abstractions by clustering variables and their domains. This approach refines and generalizes previous notions of abstractions to better accommodate individual causal distributions that are spawned by Pearl's causal hierarchy. We show that such abstractions are learnable in practical settings through Neural Causal Models (Xia et al., 2021), enabling the use of the deep learning toolkit to solve various challenging causal inference tasks -- identification, estimation, sampling -- at different levels of granularity. Finally, we integrate these results with representation learning to create more flexible abstractions, moving these results closer to practical applications. Our experiments support the theory and illustrate how to scale causal inferences to high-dimensional settings involving image data. ",
    "url": "https://arxiv.org/abs/2401.02602",
    "authors": [
      "Kevin Xia",
      "Elias Bareinboim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.02606",
    "title": "Exploiting Polarized Material Cues for Robust Car Detection",
    "abstract": "Car detection is an important task that serves as a crucial prerequisite for many automated driving functions. The large variations in lighting/weather conditions and vehicle densities of the scenes pose significant challenges to existing car detection algorithms to meet the highly accurate perception demand for safety, due to the unstable/limited color information, which impedes the extraction of meaningful/discriminative features of cars. In this work, we present a novel learning-based car detection method that leverages trichromatic linear polarization as an additional cue to disambiguate such challenging cases. A key observation is that polarization, characteristic of the light wave, can robustly describe intrinsic physical properties of the scene objects in various imaging conditions and is strongly linked to the nature of materials for cars (e.g., metal and glass) and their surrounding environment (e.g., soil and trees), thereby providing reliable and discriminative features for robust car detection in challenging scenes. To exploit polarization cues, we first construct a pixel-aligned RGB-Polarization car detection dataset, which we subsequently employ to train a novel multimodal fusion network. Our car detection network dynamically integrates RGB and polarization features in a request-and-complement manner and can explore the intrinsic material properties of cars across all learning samples. We extensively validate our method and demonstrate that it outperforms state-of-the-art detection methods. Experimental results show that polarization is a powerful cue for car detection. ",
    "url": "https://arxiv.org/abs/2401.02606",
    "authors": [
      "Wen Dong",
      "Haiyang Mei",
      "Ziqi Wei",
      "Ao Jin",
      "Sen Qiu",
      "Qiang Zhang",
      "Xin Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02610",
    "title": "DHGCN: Dynamic Hop Graph Convolution Network for Self-supervised Point  Cloud Learning",
    "abstract": "Recent works attempt to extend Graph Convolution Networks (GCNs) to point clouds for classification and segmentation tasks. These works tend to sample and group points to create smaller point sets locally and mainly focus on extracting local features through GCNs, while ignoring the relationship between point sets. In this paper, we propose the Dynamic Hop Graph Convolution Network (DHGCN) for explicitly learning the contextual relationships between the voxelized point parts, which are treated as graph nodes. Motivated by the intuition that the contextual information between point parts lies in the pairwise adjacent relationship, which can be depicted by the hop distance of the graph quantitatively, we devise a novel self-supervised part-level hop distance reconstruction task and design a novel loss function accordingly to facilitate training. In addition, we propose the Hop Graph Attention (HGA), which takes the learned hop distance as input for producing attention weights to allow edge features to contribute distinctively in aggregation. Eventually, the proposed DHGCN is a plug-and-play module that is compatible with point-based backbone networks. Comprehensive experiments on different backbones and tasks demonstrate that our self-supervised method achieves state-of-the-art performance. Our source code is available at: https://github.com/Jinec98/DHGCN. ",
    "url": "https://arxiv.org/abs/2401.02610",
    "authors": [
      "Jincen Jiang",
      "Lizhi Zhao",
      "Xuequan Lu",
      "Wei Hu",
      "Imran Razzak",
      "Meili Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02611",
    "title": "MOODv2: Masked Image Modeling for Out-of-Distribution Detection",
    "abstract": "The crux of effective out-of-distribution (OOD) detection lies in acquiring a robust in-distribution (ID) representation, distinct from OOD samples. While previous methods predominantly leaned on recognition-based techniques for this purpose, they often resulted in shortcut learning, lacking comprehensive representations. In our study, we conducted a comprehensive analysis, exploring distinct pretraining tasks and employing various OOD score functions. The results highlight that the feature representations pre-trained through reconstruction yield a notable enhancement and narrow the performance gap among various score functions. This suggests that even simple score functions can rival complex ones when leveraging reconstruction-based pretext tasks. Reconstruction-based pretext tasks adapt well to various score functions. As such, it holds promising potential for further expansion. Our OOD detection framework, MOODv2, employs the masked image modeling pretext task. Without bells and whistles, MOODv2 impressively enhances 14.30% AUROC to 95.68% on ImageNet and achieves 99.98% on CIFAR-10. ",
    "url": "https://arxiv.org/abs/2401.02611",
    "authors": [
      "Jingyao Li",
      "Pengguang Chen",
      "Shaozuo Yu",
      "Shu Liu",
      "Jiaya Jia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02615",
    "title": "AdvSQLi: Generating Adversarial SQL Injections against Real-world  WAF-as-a-service",
    "abstract": "As the first defensive layer that attacks would hit, the web application firewall (WAF) plays an indispensable role in defending against malicious web attacks like SQL injection (SQLi). With the development of cloud computing, WAF-as-a-service, as one kind of Security-as-a-service, has been proposed to facilitate the deployment, configuration, and update of WAFs in the cloud. Despite its tremendous popularity, the security vulnerabilities of WAF-as-a-service are still largely unknown, which is highly concerning given its massive usage. In this paper, we propose a general and extendable attack framework, namely AdvSQLi, in which a minimal series of transformations are performed on the hierarchical tree representation of the original SQLi payload, such that the generated SQLi payloads can not only bypass WAF-as-a-service under black-box settings but also keep the same functionality and maliciousness as the original payload. With AdvSQLi, we make it feasible to inspect and understand the security vulnerabilities of WAFs automatically, helping vendors make products more secure. To evaluate the attack effectiveness and efficiency of AdvSQLi, we first employ two public datasets to generate adversarial SQLi payloads, leading to a maximum attack success rate of 100% against state-of-the-art ML-based SQLi detectors. Furthermore, to demonstrate the immediate security threats caused by AdvSQLi, we evaluate the attack effectiveness against 7 WAF-as-a-service solutions from mainstream vendors and find all of them are vulnerable to AdvSQLi. For instance, AdvSQLi achieves an attack success rate of over 79% against the F5 WAF. Through in-depth analysis of the evaluation results, we further condense out several general yet severe flaws of these vendors that cannot be easily patched. ",
    "url": "https://arxiv.org/abs/2401.02615",
    "authors": [
      "Zhenqing Qu",
      "Xiang Ling",
      "Ting Wang",
      "Xiang Chen",
      "Shouling Ji",
      "Chunming Wu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.02627",
    "title": "Characteristics and prevalence of fake social media profiles with  AI-generated faces",
    "abstract": "Recent advancements in generative artificial intelligence (AI) have raised concerns about their potential to create convincing fake social media accounts, but empirical evidence is lacking. In this paper, we present a systematic analysis of Twitter(X) accounts using human faces generated by Generative Adversarial Networks (GANs) for their profile pictures. We present a dataset of 1,353 such accounts and show that they are used to spread scams, spam, and amplify coordinated messages, among other inauthentic activities. Leveraging a feature of GAN-generated faces -- consistent eye placement -- and supplementing it with human annotation, we devise an effective method for identifying GAN-generated profiles in the wild. Applying this method to a random sample of active Twitter users, we estimate a lower bound for the prevalence of profiles using GAN-generated faces between 0.021% and 0.044% -- around 10K daily active accounts. These findings underscore the emerging threats posed by multimodal generative AI. We release the source code of our detection method and the data we collect to facilitate further investigation. Additionally, we provide practical heuristics to assist social media users in recognizing such accounts. ",
    "url": "https://arxiv.org/abs/2401.02627",
    "authors": [
      "Kai-Cheng Yang",
      "Danishjeet Singh",
      "Filippo Menczer"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.02633",
    "title": "A Random Ensemble of Encrypted models for Enhancing Robustness against  Adversarial Examples",
    "abstract": "Deep neural networks (DNNs) are well known to be vulnerable to adversarial examples (AEs). In addition, AEs have adversarial transferability, which means AEs generated for a source model can fool another black-box model (target model) with a non-trivial probability. In previous studies, it was confirmed that the vision transformer (ViT) is more robust against the property of adversarial transferability than convolutional neural network (CNN) models such as ConvMixer, and moreover encrypted ViT is more robust than ViT without any encryption. In this article, we propose a random ensemble of encrypted ViT models to achieve much more robust models. In experiments, the proposed scheme is verified to be more robust against not only black-box attacks but also white-box ones than convention methods. ",
    "url": "https://arxiv.org/abs/2401.02633",
    "authors": [
      "Ryota Iijima",
      "Sayaka Shiota",
      "Hitoshi Kiya"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02652",
    "title": "Adaptive Discounting of Training Time Attacks",
    "abstract": "Among the most insidious attacks on Reinforcement Learning (RL) solutions are training-time attacks (TTAs) that create loopholes and backdoors in the learned behaviour. Not limited to a simple disruption, constructive TTAs (C-TTAs) are now available, where the attacker forces a specific, target behaviour upon a training RL agent (victim). However, even state-of-the-art C-TTAs focus on target behaviours that could be naturally adopted by the victim if not for a particular feature of the environment dynamics, which C-TTAs exploit. In this work, we show that a C-TTA is possible even when the target behaviour is un-adoptable due to both environment dynamics as well as non-optimality with respect to the victim objective(s). To find efficient attacks in this context, we develop a specialised flavour of the DDPG algorithm, which we term gammaDDPG, that learns this stronger version of C-TTA. gammaDDPG dynamically alters the attack policy planning horizon based on the victim's current behaviour. This improves effort distribution throughout the attack timeline and reduces the effect of uncertainty the attacker has about the victim. To demonstrate the features of our method and better relate the results to prior research, we borrow a 3D grid domain from a state-of-the-art C-TTA for our experiments. Code is available at \"bit.ly/github-rb-gDDPG\". ",
    "url": "https://arxiv.org/abs/2401.02652",
    "authors": [
      "Ridhima Bector",
      "Abhay Aradhya",
      "Chai Quek",
      "Zinovi Rabinovich"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.02659",
    "title": "MalModel: Hiding Malicious Payload in Mobile Deep Learning Models with  Black-box Backdoor Attack",
    "abstract": "Mobile malware has become one of the most critical security threats in the era of ubiquitous mobile computing. Despite the intensive efforts from security experts to counteract it, recent years have still witnessed a rapid growth of identified malware samples. This could be partly attributed to the newly-emerged technologies that may constantly open up under-studied attack surfaces for the adversaries. One typical example is the recently-developed mobile machine learning (ML) framework that enables storing and running deep learning (DL) models on mobile devices. Despite obvious advantages, this new feature also inadvertently introduces potential vulnerabilities (e.g., on-device models may be modified for malicious purposes). In this work, we propose a method to generate or transform mobile malware by hiding the malicious payloads inside the parameters of deep learning models, based on a strategy that considers four factors (layer type, layer number, layer coverage and the number of bytes to replace). Utilizing the proposed method, we can run malware in DL mobile applications covertly with little impact on the model performance (i.e., as little as 0.4% drop in accuracy and at most 39ms latency overhead). ",
    "url": "https://arxiv.org/abs/2401.02659",
    "authors": [
      "Jiayi Hua",
      "Kailong Wang",
      "Meizhen Wang",
      "Guangdong Bai",
      "Xiapu Luo",
      "Haoyu Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.02662",
    "title": "GainNet: Coordinates the Odd Couple of Generative AI and 6G Networks",
    "abstract": "The rapid expansion of AI-generated content (AIGC) reflects the iteration from assistive AI towards generative AI (GAI) with creativity. Meanwhile, the 6G networks will also evolve from the Internet-of-everything to the Internet-of-intelligence with hybrid heterogeneous network architectures. In the future, the interplay between GAI and the 6G will lead to new opportunities, where GAI can learn the knowledge of personalized data from the massive connected 6G end devices, while GAI's powerful generation ability can provide advanced network solutions for 6G network and provide 6G end devices with various AIGC services. However, they seem to be an odd couple, due to the contradiction of data and resources. To achieve a better-coordinated interplay between GAI and 6G, the GAI-native networks (GainNet), a GAI-oriented collaborative cloud-edge-end intelligence framework, is proposed in this paper. By deeply integrating GAI with 6G network design, GainNet realizes the positive closed-loop knowledge flow and sustainable-evolution GAI model optimization. On this basis, the GAI-oriented generic resource orchestration mechanism with integrated sensing, communication, and computing (GaiRom-ISCC) is proposed to guarantee the efficient operation of GainNet. Two simple case studies demonstrate the effectiveness and robustness of the proposed schemes. Finally, we envision the key challenges and future directions concerning the interplay between GAI models and 6G networks. ",
    "url": "https://arxiv.org/abs/2401.02662",
    "authors": [
      "Ning Chen",
      "Jie Yang",
      "Zhipeng Cheng",
      "Xuwei Fan",
      "Zhang Liu",
      "Bangzhen Huang",
      "Yifeng Zhao",
      "Lianfen Huang",
      "Xiaojiang Du",
      "Mohsen Guizani"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2401.02663",
    "title": "A backdoor attack against link prediction tasks with graph neural  networks",
    "abstract": "Graph Neural Networks (GNNs) are a class of deep learning models capable of processing graph-structured data, and they have demonstrated significant performance in a variety of real-world applications. Recent studies have found that GNN models are vulnerable to backdoor attacks. When specific patterns (called backdoor triggers, e.g., subgraphs, nodes, etc.) appear in the input data, the backdoor embedded in the GNN models is activated, which misclassifies the input data into the target class label specified by the attacker, whereas when there are no backdoor triggers in the input, the backdoor embedded in the GNN models is not activated, and the models work normally. Backdoor attacks are highly stealthy and expose GNN models to serious security risks. Currently, research on backdoor attacks against GNNs mainly focus on tasks such as graph classification and node classification, and backdoor attacks against link prediction tasks are rarely studied. In this paper, we propose a backdoor attack against the link prediction tasks based on GNNs and reveal the existence of such security vulnerability in GNN models, which make the backdoored GNN models to incorrectly predict unlinked two nodes as having a link relationship when a trigger appear. The method uses a single node as the trigger and poison selected node pairs in the training graph, and then the backdoor will be embedded in the GNN models through the training process. In the inference stage, the backdoor in the GNN models can be activated by simply linking the trigger node to the two end nodes of the unlinked node pairs in the input data, causing the GNN models to produce incorrect link prediction results for the target node pairs. ",
    "url": "https://arxiv.org/abs/2401.02663",
    "authors": [
      "Jiazhu Dai",
      "Haoyu Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.02665",
    "title": "Zero-shot Microclimate Prediction with Deep Learning",
    "abstract": "Weather station data is a valuable resource for climate prediction, however, its reliability can be limited in remote locations. To compound the issue, making local predictions often relies on sensor data that may not be accessible for a new, previously unmonitored location. In response to these challenges, we propose a novel zero-shot learning approach designed to forecast various climate measurements at new and unmonitored locations. Our method surpasses conventional weather forecasting techniques in predicting microclimate variables by leveraging knowledge extracted from other geographic locations. ",
    "url": "https://arxiv.org/abs/2401.02665",
    "authors": [
      "Iman Deznabi",
      "Peeyush Kumar",
      "Madalina Fiterau"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)"
    ]
  },
  {
    "id": "arXiv:2401.02678",
    "title": "MusicAOG: an Energy-Based Model for Learning and Sampling a Hierarchical  Representation of Symbolic Music",
    "abstract": "In addressing the challenge of interpretability and generalizability of artificial music intelligence, this paper introduces a novel symbolic representation that amalgamates both explicit and implicit musical information across diverse traditions and granularities. Utilizing a hierarchical and-or graph representation, the model employs nodes and edges to encapsulate a broad spectrum of musical elements, including structures, textures, rhythms, and harmonies. This hierarchical approach expands the representability across various scales of music. This representation serves as the foundation for an energy-based model, uniquely tailored to learn musical concepts through a flexible algorithm framework relying on the minimax entropy principle. Utilizing an adapted Metropolis-Hastings sampling technique, the model enables fine-grained control over music generation. A comprehensive empirical evaluation, contrasting this novel approach with existing methodologies, manifests considerable advancements in interpretability and controllability. This study marks a substantial contribution to the fields of music analysis, composition, and computational musicology. ",
    "url": "https://arxiv.org/abs/2401.02678",
    "authors": [
      "Yikai Qian",
      "Tianle Wang",
      "Xinyi Tong",
      "Xin Jin",
      "Duo Xu",
      "Bo Zheng",
      "Tiezheng Ge",
      "Feng Yu",
      "Song-Chun Zhu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2401.02682",
    "title": "Homophily-Related: Adaptive Hybrid Graph Filter for Multi-View Graph  Clustering",
    "abstract": "Recently there is a growing focus on graph data, and multi-view graph clustering has become a popular area of research interest. Most of the existing methods are only applicable to homophilous graphs, yet the extensive real-world graph data can hardly fulfill the homophily assumption, where the connected nodes tend to belong to the same class. Several studies have pointed out that the poor performance on heterophilous graphs is actually due to the fact that conventional graph neural networks (GNNs), which are essentially low-pass filters, discard information other than the low-frequency information on the graph. Nevertheless, on certain graphs, particularly heterophilous ones, neglecting high-frequency information and focusing solely on low-frequency information impedes the learning of node representations. To break this limitation, our motivation is to perform graph filtering that is closely related to the homophily degree of the given graph, with the aim of fully leveraging both low-frequency and high-frequency signals to learn distinguishable node embedding. In this work, we propose Adaptive Hybrid Graph Filter for Multi-View Graph Clustering (AHGFC). Specifically, a graph joint process and graph joint aggregation matrix are first designed by using the intrinsic node features and adjacency relationship, which makes the low and high-frequency signals on the graph more distinguishable. Then we design an adaptive hybrid graph filter that is related to the homophily degree, which learns the node embedding based on the graph joint aggregation matrix. After that, the node embedding of each view is weighted and fused into a consensus embedding for the downstream task. Experimental results show that our proposed model performs well on six datasets containing homophilous and heterophilous graphs. ",
    "url": "https://arxiv.org/abs/2401.02682",
    "authors": [
      "Zichen Wen",
      "Yawen Ling",
      "Yazhou Ren",
      "Tianyi Wu",
      "Jianpeng Chen",
      "Xiaorong Pu",
      "Zhifeng Hao",
      "Lifang He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.02684",
    "title": "Robot Vulnerability and the Elicitation of User Empathy",
    "abstract": "This paper describes a between-subjects Amazon Mechanical Turk study (n = 220) that investigated how a robot's affective narrative influences its ability to elicit empathy in human observers. We first conducted a pilot study to develop and validate the robot's affective narratives. Then, in the full study, the robot used one of three different affective narrative strategies (funny, sad, neutral) while becoming less functional at its shopping task over the course of the interaction. As the functionality of the robot degraded, participants were repeatedly asked if they were willing to help the robot. The results showed that conveying a sad narrative significantly influenced the participants' willingness to help the robot throughout the interaction and determined whether participants felt empathetic toward the robot throughout the interaction. Furthermore, a higher amount of past experience with robots also increased the participants' willingness to help the robot. This work suggests that affective narratives can be useful in short-term interactions that benefit from emotional connections between humans and robots. ",
    "url": "https://arxiv.org/abs/2401.02684",
    "authors": [
      "Morten Roed Frederiksen",
      "Katrin Fischer",
      "Maja Matarić"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2401.02686",
    "title": "Beyond Fidelity: Explaining Vulnerability Localization of Learning-based  Detectors",
    "abstract": "Vulnerability detectors based on deep learning (DL) models have proven their effectiveness in recent years. However, the shroud of opacity surrounding the decision-making process of these detectors makes it difficult for security analysts to comprehend. To address this, various explanation approaches have been proposed to explain the predictions by highlighting important features, which have been demonstrated effective in other domains such as computer vision and natural language processing. Unfortunately, an in-depth evaluation of vulnerability-critical features, such as fine-grained vulnerability-related code lines, learned and understood by these explanation approaches remains lacking. In this study, we first evaluate the performance of ten explanation approaches for vulnerability detectors based on graph and sequence representations, measured by two quantitative metrics including fidelity and vulnerability line coverage rate. Our results show that fidelity alone is not sufficient for evaluating these approaches, as fidelity incurs significant fluctuations across different datasets and detectors. We subsequently check the precision of the vulnerability-related code lines reported by the explanation approaches, and find poor accuracy in this task among all of them. This can be attributed to the inefficiency of explainers in selecting important features and the presence of irrelevant artifacts learned by DL-based detectors. ",
    "url": "https://arxiv.org/abs/2401.02686",
    "authors": [
      "Baijun Cheng",
      "Shengming Zhao",
      "Kailong Wang",
      "Meizhen Wang",
      "Guangdong Bai",
      "Ruitao Feng",
      "Yao Guo",
      "Lei Ma",
      "Haoyu Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2401.02687",
    "title": "PAHD: Perception-Action based Human Decision Making using Explainable  Graph Neural Networks on SAR Images",
    "abstract": "Synthetic Aperture Radar (SAR) images are commonly utilized in military applications for automatic target recognition (ATR). Machine learning (ML) methods, such as Convolutional Neural Networks (CNN) and Graph Neural Networks (GNN), are frequently used to identify ground-based objects, including battle tanks, personnel carriers, and missile launchers. Determining the vehicle class, such as the BRDM2 tank, BMP2 tank, BTR60 tank, and BTR70 tank, is crucial, as it can help determine whether the target object is an ally or an enemy. While the ML algorithm provides feedback on the recognized target, the final decision is left to the commanding officers. Therefore, providing detailed information alongside the identified target can significantly impact their actions. This detailed information includes the SAR image features that contributed to the classification, the classification confidence, and the probability of the identified object being classified as a different object type or class. We propose a GNN-based ATR framework that provides the final classified class and outputs the detailed information mentioned above. This is the first study to provide a detailed analysis of the classification class, making final decisions more straightforward. Moreover, our GNN framework achieves an overall accuracy of 99.2\\% when evaluated on the MSTAR dataset, improving over previous state-of-the-art GNN methods. ",
    "url": "https://arxiv.org/abs/2401.02687",
    "authors": [
      "Sasindu Wijeratne",
      "Bingyi Zhang",
      "Rajgopal Kannan",
      "Viktor Prasanna",
      "Carl Busart"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2401.02702",
    "title": "VoxelNextFusion: A Simple, Unified and Effective Voxel Fusion Framework  for Multi-Modal 3D Object Detection",
    "abstract": "LiDAR-camera fusion can enhance the performance of 3D object detection by utilizing complementary information between depth-aware LiDAR points and semantically rich images. Existing voxel-based methods face significant challenges when fusing sparse voxel features with dense image features in a one-to-one manner, resulting in the loss of the advantages of images, including semantic and continuity information, leading to sub-optimal detection performance, especially at long distances. In this paper, we present VoxelNextFusion, a multi-modal 3D object detection framework specifically designed for voxel-based methods, which effectively bridges the gap between sparse point clouds and dense images. In particular, we propose a voxel-based image pipeline that involves projecting point clouds onto images to obtain both pixel- and patch-level features. These features are then fused using a self-attention to obtain a combined representation. Moreover, to address the issue of background features present in patches, we propose a feature importance module that effectively distinguishes between foreground and background features, thus minimizing the impact of the background features. Extensive experiments were conducted on the widely used KITTI and nuScenes 3D object detection benchmarks. Notably, our VoxelNextFusion achieved around +3.20% in AP@0.7 improvement for car detection in hard level compared to the Voxel R-CNN baseline on the KITTI test dataset ",
    "url": "https://arxiv.org/abs/2401.02702",
    "authors": [
      "Ziying Song",
      "Guoxin Zhang",
      "Jun Xie",
      "Lin Liu",
      "Caiyan Jia",
      "Shaoqing Xu",
      "Zhepeng Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02709",
    "title": "German Text Embedding Clustering Benchmark",
    "abstract": "This work introduces a benchmark assessing the performance of clustering German text embeddings in different domains. This benchmark is driven by the increasing use of clustering neural text embeddings in tasks that require the grouping of texts (such as topic modeling) and the need for German resources in existing benchmarks. We provide an initial analysis for a range of pre-trained mono- and multilingual models evaluated on the outcome of different clustering algorithms. Results include strong performing mono- and multilingual models. Reducing the dimensions of embeddings can further improve clustering. Additionally, we conduct experiments with continued pre-training for German BERT models to estimate the benefits of this additional training. Our experiments suggest that significant performance improvements are possible for short text. All code and datasets are publicly available. ",
    "url": "https://arxiv.org/abs/2401.02709",
    "authors": [
      "Silvan Wehrli",
      "Bert Arnrich",
      "Christopher Irrgang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.02713",
    "title": "Graph-level Protein Representation Learning by Structure Knowledge  Refinement",
    "abstract": "This paper focuses on learning representation on the whole graph level in an unsupervised manner. Learning graph-level representation plays an important role in a variety of real-world issues such as molecule property prediction, protein structure feature extraction, and social network analysis. The mainstream method is utilizing contrastive learning to facilitate graph feature extraction, known as Graph Contrastive Learning (GCL). GCL, although effective, suffers from some complications in contrastive learning, such as the effect of false negative pairs. Moreover, augmentation strategies in GCL are weakly adaptive to diverse graph datasets. Motivated by these problems, we propose a novel framework called Structure Knowledge Refinement (SKR) which uses data structure to determine the probability of whether a pair is positive or negative. Meanwhile, we propose an augmentation strategy that naturally preserves the semantic meaning of the original data and is compatible with our SKR framework. Furthermore, we illustrate the effectiveness of our SKR framework through intuition and experiments. The experimental results on the tasks of graph-level classification demonstrate that our SKR framework is superior to most state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2401.02713",
    "authors": [
      "Ge Wang",
      "Zelin Zang",
      "Jiangbin Zheng",
      "Jun Xia",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2401.02718",
    "title": "Calibration Attack: A Framework For Adversarial Attacks Targeting  Calibration",
    "abstract": "We introduce a new framework of adversarial attacks, named calibration attacks, in which the attacks are generated and organized to trap victim models to be miscalibrated without altering their original accuracy, hence seriously endangering the trustworthiness of the models and any decision-making based on their confidence scores. Specifically, we identify four novel forms of calibration attacks: underconfidence attacks, overconfidence attacks, maximum miscalibration attacks, and random confidence attacks, in both the black-box and white-box setups. We then test these new attacks on typical victim models with comprehensive datasets, demonstrating that even with a relatively low number of queries, the attacks can create significant calibration mistakes. We further provide detailed analyses to understand different aspects of calibration attacks. Building on that, we investigate the effectiveness of widely used adversarial defences and calibration methods against these types of attacks, which then inspires us to devise two novel defences against such calibration attacks. ",
    "url": "https://arxiv.org/abs/2401.02718",
    "authors": [
      "Stephen Obadinma",
      "Xiaodan Zhu",
      "Hongyu Guo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.02721",
    "title": "A Cost-Efficient FPGA Implementation of Tiny Transformer Model using  Neural ODE",
    "abstract": "Transformer is an emerging neural network model with attention mechanism. It has been adopted to various tasks and achieved a favorable accuracy compared to CNNs and RNNs. While the attention mechanism is recognized as a general-purpose component, many of the Transformer models require a significant number of parameters compared to the CNN-based ones. To mitigate the computational complexity, recently, a hybrid approach has been proposed, which uses ResNet as a backbone architecture and replaces a part of its convolution layers with an MHSA (Multi-Head Self-Attention) mechanism. In this paper, we significantly reduce the parameter size of such models by using Neural ODE (Ordinary Differential Equation) as a backbone architecture instead of ResNet. The proposed hybrid model reduces the parameter size by 94.6% compared to the CNN-based ones without degrading the accuracy. We then deploy the proposed model on a modest-sized FPGA device for edge computing. To further reduce FPGA resource utilization, we quantize the model following QAT (Quantization Aware Training) scheme instead of PTQ (Post Training Quantization) to suppress the accuracy loss. As a result, an extremely lightweight Transformer-based model can be implemented on resource-limited FPGAs. The weights of the feature extraction network are stored on-chip to minimize the memory transfer overhead, allowing faster inference. By eliminating the overhead of memory transfers, inference can be executed seamlessly, leading to accelerated inference. The proposed FPGA implementation achieves 12.8x speedup and 9.21x energy efficiency compared to ARM Cortex-A53 CPU. ",
    "url": "https://arxiv.org/abs/2401.02721",
    "authors": [
      "Ikumi Okubo",
      "Keisuke Sugiura",
      "Hiroki Matsutani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2401.02723",
    "title": "Predicting Traffic Flow with Federated Learning and Graph Neural with  Asynchronous Computations Network",
    "abstract": "Real-time traffic flow prediction holds significant importance within the domain of Intelligent Transportation Systems (ITS). The task of achieving a balance between prediction precision and computational efficiency presents a significant challenge. In this article, we present a novel deep-learning method called Federated Learning and Asynchronous Graph Convolutional Network (FLAGCN). Our framework incorporates the principles of asynchronous graph convolutional networks with federated learning to enhance the accuracy and efficiency of real-time traffic flow prediction. The FLAGCN model employs a spatial-temporal graph convolution technique to asynchronously address spatio-temporal dependencies within traffic data effectively. To efficiently handle the computational requirements associated with this deep learning model, this study used a graph federated learning technique known as GraphFL. This approach is designed to facilitate the training process. The experimental results obtained from conducting tests on two distinct traffic datasets demonstrate that the utilization of FLAGCN leads to the optimization of both training and inference durations while maintaining a high level of prediction accuracy. FLAGCN outperforms existing models with significant improvements by achieving up to approximately 6.85% reduction in RMSE, 20.45% reduction in MAPE, compared to the best-performing existing models. ",
    "url": "https://arxiv.org/abs/2401.02723",
    "authors": [
      "Muhammad Yaqub",
      "Shahzad Ahmad",
      "Malik Abdul Manan",
      "Imran Shabir Chuhan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02737",
    "title": "The Vulnerability Is in the Details: Locating Fine-grained Information  of Vulnerable Code Identified by Graph-based Detectors",
    "abstract": "Vulnerability detection is a crucial component in the software development lifecycle. Existing vulnerability detectors, especially those based on deep learning (DL) models, have achieved high effectiveness. Despite their capability of detecting vulnerable code snippets from given code fragments, the detectors are typically unable to further locate the fine-grained information pertaining to the vulnerability, such as the precise vulnerability triggering locations.In this paper, we propose VULEXPLAINER, a tool for automatically locating vulnerability-critical code lines from coarse-level vulnerable code snippets reported by DL-based detectors.Our approach takes advantage of the code structure and the semantics of the vulnerabilities. Specifically, we leverage program slicing to get a set of critical program paths containing vulnerability-triggering and vulnerability-dependent statements and rank them to pinpoint the most important one (i.e., sub-graph) as the data flow associated with the vulnerability. We demonstrate that VULEXPLAINER performs consistently well on four state-of-the-art graph-representation(GP)-based vulnerability detectors, i.e., it can flag the vulnerability-triggering code statements with an accuracy of around 90% against eight common C/C++ vulnerabilities, outperforming five widely used GNN-based explanation approaches. The experimental results demonstrate the effectiveness of VULEXPLAINER, which provides insights into a promising research line: integrating program slicing and deep learning for the interpretation of vulnerable code fragments. ",
    "url": "https://arxiv.org/abs/2401.02737",
    "authors": [
      "Baijun Cheng",
      "Kailong Wang",
      "Cuiyun Gao",
      "Xiapu Luo",
      "Yulei Sui",
      "Li Li",
      "Yao Guo",
      "Xiangqun Chen",
      "Haoyu Wang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2401.02746",
    "title": "Reading Between the Frames: Multi-Modal Depression Detection in Videos  from Non-Verbal Cues",
    "abstract": "Depression, a prominent contributor to global disability, affects a substantial portion of the population. Efforts to detect depression from social media texts have been prevalent, yet only a few works explored depression detection from user-generated video content. In this work, we address this research gap by proposing a simple and flexible multi-modal temporal model capable of discerning non-verbal depression cues from diverse modalities in noisy, real-world videos. We show that, for in-the-wild videos, using additional high-level non-verbal cues is crucial to achieving good performance, and we extracted and processed audio speech embeddings, face emotion embeddings, face, body and hand landmarks, and gaze and blinking information. Through extensive experiments, we show that our model achieves state-of-the-art results on three key benchmark datasets for depression detection from video by a substantial margin. Our code is publicly available on GitHub. ",
    "url": "https://arxiv.org/abs/2401.02746",
    "authors": [
      "David Gimeno-Gómez",
      "Ana-Maria Bucur",
      "Adrian Cosma",
      "Carlos-David Martínez-Hinarejos",
      "Paolo Rosso"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02756",
    "title": "Lock-free de Bruijn graph",
    "abstract": "De Bruijn graph is one of the most important data structures used in de-novo genome assembly algorithms, especially for NGS data. There is a growing need for parallel data structures and algorithms due to the increasing number of cores in modern computers. The assembly task is an indispensable step in sequencing genomes of new organisms and studying structural genomic changes. In recent years, the dynamic development of next-generation sequencing (NGS) methods raises hopes for making whole-genome sequencing a fast and reliable tool used, for example, in medical diagnostics. However, this is hampered by the slowness and computational requirements of the current processing algorithms, which raises the need to develop more efficient algorithms. One possible approach, still little explored, is the use of quantum computing. We created the lock-free version of the de Bruijn graph, as well as a lock-free algorithm to build such graph from reads. Our algorithm and data structures are developed to use parallel threads of execution and do not use mutexes or other locking mechanisms, instead, we used only compare-and-swap instruction and other atomic operations. It makes our algorithm very fast and efficiently scaling. The presented article depicts the new lock-free de Bruijn graph data structure with a graph build algorithm. We developed a C++ library and tested its performance to depict its high speed and scalability compared to other available tools. ",
    "url": "https://arxiv.org/abs/2401.02756",
    "authors": [
      "Daniel Górniak",
      "Robert Nowak"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Genomics (q-bio.GN)"
    ]
  },
  {
    "id": "arXiv:2401.02758",
    "title": "Systematic review of image segmentation using complex networks",
    "abstract": "This review presents various image segmentation methods using complex networks. Image segmentation is one of the important steps in image analysis as it helps analyze and understand complex images. At first, it has been tried to classify complex networks based on how it being used in image segmentation. In computer vision and image processing applications, image segmentation is essential for analyzing complex images with irregular shapes, textures, or overlapping boundaries. Advanced algorithms make use of machine learning, clustering, edge detection, and region-growing techniques. Graph theory principles combined with community detection-based methods allow for more precise analysis and interpretation of complex images. Hybrid approaches combine multiple techniques for comprehensive, robust segmentation, improving results in computer vision and image processing tasks. ",
    "url": "https://arxiv.org/abs/2401.02758",
    "authors": [
      "Amin Rezaei",
      "Fatemeh Asadi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02791",
    "title": "Weakly Semi-supervised Tool Detection in Minimally Invasive Surgery  Videos",
    "abstract": "Surgical tool detection is essential for analyzing and evaluating minimally invasive surgery videos. Current approaches are mostly based on supervised methods that require large, fully instance-level labels (i.e., bounding boxes). However, large image datasets with instance-level labels are often limited because of the burden of annotation. Thus, surgical tool detection is important when providing image-level labels instead of instance-level labels since image-level annotations are considerably more time-efficient than instance-level annotations. In this work, we propose to strike a balance between the extremely costly annotation burden and detection performance. We further propose a co-occurrence loss, which considers a characteristic that some tool pairs often co-occur together in an image to leverage image-level labels. Encapsulating the knowledge of co-occurrence using the co-occurrence loss helps to overcome the difficulty in classification that originates from the fact that some tools have similar shapes and textures. Extensive experiments conducted on the Endovis2018 dataset in various data settings show the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2401.02791",
    "authors": [
      "Ryo Fujii",
      "Ryo Hachiuma",
      "Hideo Saito"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02810",
    "title": "Physics-Informed Neural Networks for High-Frequency and Multi-Scale  Problems using Transfer Learning",
    "abstract": "Physics-informed neural network (PINN) is a data-driven solver for partial and ordinary differential equations(ODEs/PDEs). It provides a unified framework to address both forward and inverse problems. However, the complexity of the objective function often leads to training failures. This issue is particularly prominent when solving high-frequency and multi-scale problems. We proposed using transfer learning to boost the robustness and convergence of training PINN, starting training from low-frequency problems and gradually approaching high-frequency problems. Through two case studies, we discovered that transfer learning can effectively train PINN to approximate solutions from low-frequency problems to high-frequency problems without increasing network parameters. Furthermore, it requires fewer data points and less training time. We elaborately described our training strategy, including optimizer selection, and suggested guidelines for using transfer learning to train neural networks for solving more complex problems. ",
    "url": "https://arxiv.org/abs/2401.02810",
    "authors": [
      "Abdul Hannan Mustajab",
      "Hao Lyu",
      "Zarghaam Rizvi",
      "Frank Wuttke"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2401.02814",
    "title": "Object-Centric Instruction Augmentation for Robotic Manipulation",
    "abstract": "Humans interpret scenes by recognizing both the identities and positions of objects in their observations. For a robot to perform tasks such as \\enquote{pick and place}, understanding both what the objects are and where they are located is crucial. While the former has been extensively discussed in the literature that uses the large language model to enrich the text descriptions, the latter remains underexplored. In this work, we introduce the \\textit{Object-Centric Instruction Augmentation (OCI)} framework to augment highly semantic and information-dense language instruction with position cues. We utilize a Multi-modal Large Language Model (MLLM) to weave knowledge of object locations into natural language instruction, thus aiding the policy network in mastering actions for versatile manipulation. Additionally, we present a feature reuse mechanism to integrate the vision-language features from off-the-shelf pre-trained MLLM into policy networks. Through a series of simulated and real-world robotic tasks, we demonstrate that robotic manipulator imitation policies trained with our enhanced instructions outperform those relying solely on traditional language instructions. ",
    "url": "https://arxiv.org/abs/2401.02814",
    "authors": [
      "Junjie Wen",
      "Yichen Zhu",
      "Minjie Zhu",
      "Jinming Li",
      "Zhiyuan Xu",
      "Zhengping Che",
      "Chaomin Shen",
      "Yaxin Peng",
      "Dong Liu",
      "Feifei Feng",
      "Jian Tang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02823",
    "title": "DocGraphLM: Documental Graph Language Model for Information Extraction",
    "abstract": "Advances in Visually Rich Document Understanding (VrDU) have enabled information extraction and question answering over documents with complex layouts. Two tropes of architectures have emerged -- transformer-based models inspired by LLMs, and Graph Neural Networks. In this paper, we introduce DocGraphLM, a novel framework that combines pre-trained language models with graph semantics. To achieve this, we propose 1) a joint encoder architecture to represent documents, and 2) a novel link prediction approach to reconstruct document graphs. DocGraphLM predicts both directions and distances between nodes using a convergent joint loss function that prioritizes neighborhood restoration and downweighs distant node detection. Our experiments on three SotA datasets show consistent improvement on IE and QA tasks with the adoption of graph features. Moreover, we report that adopting the graph features accelerates convergence in the learning process during training, despite being solely constructed through link prediction. ",
    "url": "https://arxiv.org/abs/2401.02823",
    "authors": [
      "Dongsheng Wang",
      "Zhiqiang Ma",
      "Armineh Nourbakhsh",
      "Kang Gu",
      "Sameena Shah"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2401.02831",
    "title": "Two-stage Progressive Residual Dense Attention Network for Image  Denoising",
    "abstract": "Deep convolutional neural networks (CNNs) for image denoising can effectively exploit rich hierarchical features and have achieved great success. However, many deep CNN-based denoising models equally utilize the hierarchical features of noisy images without paying attention to the more important and useful features, leading to relatively low performance. To address the issue, we design a new Two-stage Progressive Residual Dense Attention Network (TSP-RDANet) for image denoising, which divides the whole process of denoising into two sub-tasks to remove noise progressively. Two different attention mechanism-based denoising networks are designed for the two sequential sub-tasks: the residual dense attention module (RDAM) is designed for the first stage, and the hybrid dilated residual dense attention module (HDRDAM) is proposed for the second stage. The proposed attention modules are able to learn appropriate local features through dense connection between different convolutional layers, and the irrelevant features can also be suppressed. The two sub-networks are then connected by a long skip connection to retain the shallow feature to enhance the denoising performance. The experiments on seven benchmark datasets have verified that compared with many state-of-the-art methods, the proposed TSP-RDANet can obtain favorable results both on synthetic and real noisy image denoising. The code of our TSP-RDANet is available at https://github.com/WenCongWu/TSP-RDANet. ",
    "url": "https://arxiv.org/abs/2401.02831",
    "authors": [
      "Wencong Wu",
      "An Ge",
      "Guannan Lv",
      "Yuelong Xia",
      "Yungang Zhang",
      "Wen Xiong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2401.02838",
    "title": "CrisisViT: A Robust Vision Transformer for Crisis Image Classification",
    "abstract": "In times of emergency, crisis response agencies need to quickly and accurately assess the situation on the ground in order to deploy relevant services and resources. However, authorities often have to make decisions based on limited information, as data on affected regions can be scarce until local response services can provide first-hand reports. Fortunately, the widespread availability of smartphones with high-quality cameras has made citizen journalism through social media a valuable source of information for crisis responders. However, analyzing the large volume of images posted by citizens requires more time and effort than is typically available. To address this issue, this paper proposes the use of state-of-the-art deep neural models for automatic image classification/tagging, specifically by adapting transformer-based architectures for crisis image classification (CrisisViT). We leverage the new Incidents1M crisis image dataset to develop a range of new transformer-based image classification models. Through experimentation over the standard Crisis image benchmark dataset, we demonstrate that the CrisisViT models significantly outperform previous approaches in emergency type, image relevance, humanitarian category, and damage severity classification. Additionally, we show that the new Incidents1M dataset can further augment the CrisisViT models resulting in an additional 1.25% absolute accuracy gain. ",
    "url": "https://arxiv.org/abs/2401.02838",
    "authors": [
      "Zijun Long",
      "Richard McCreadie",
      "Muhammad Imran"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.02880",
    "title": "Lotto: Secure Participant Selection against Adversarial Servers in  Federated Learning",
    "abstract": "In Federated Learning (FL), common privacy-preserving technologies, such as secure aggregation and distributed differential privacy, rely on the critical assumption of an honest majority among participants to withstand various attacks. In practice, however, servers are not always trusted, and an adversarial server can strategically select compromised clients to create a dishonest majority, thereby undermining the system's security guarantees. In this paper, we present Lotto, an FL system that addresses this fundamental, yet underexplored issue by providing secure participant selection against an adversarial server. Lotto supports two selection algorithms: random and informed. To ensure random selection without a trusted server, Lotto enables each client to autonomously determine their participation using verifiable randomness. For informed selection, which is more vulnerable to manipulation, Lotto approximates the algorithm by employing random selection within a refined client pool. Our theoretical analysis shows that Lotto effectively restricts the number of server-selected compromised clients, thus ensuring an honest majority among participants. Large-scale experiments further reveal that Lotto achieves time-to-accuracy performance comparable to that of insecure selection methods, indicating a low computational overhead for secure selection. ",
    "url": "https://arxiv.org/abs/2401.02880",
    "authors": [
      "Zhifeng Jiang",
      "Peng Ye",
      "Shiqi He",
      "Wei Wang",
      "Ruichuan Chen",
      "Bo Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.02897",
    "title": "Robust Bichromatic Classification using Two Lines",
    "abstract": "Given two sets $\\mathit{R}$ and $\\mathit{B}$ of at most $\\mathit{n}$ points in the plane, we present efficient algorithms to find a two-line linear classifier that best separates the ``red'' points in $\\mathit{R}$ from the ``blue'' points in $B$ and is robust to outliers. More precisely, we find a region $\\mathit{W}_\\mathit{B}$ bounded by two lines, so either a halfplane, strip, wedge, or double wedge, containing (most of) the blue points $\\mathit{B}$, and few red points. Our running times vary between optimal $O(n\\log n)$ and $O(n^4)$, depending on the type of region $\\mathit{W}_\\mathit{B}$ and whether we wish to minimize only red outliers, only blue outliers, or both. ",
    "url": "https://arxiv.org/abs/2401.02897",
    "authors": [
      "Erwin Glazenburg",
      "Thijs van der Horst",
      "Tom Peters",
      "Bettina Speckmann",
      "Frank Staals"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2401.02902",
    "title": "State Derivative Normalization for Continuous-Time Deep Neural Networks",
    "abstract": "The importance of proper data normalization for deep neural networks is well known. However, in continuous-time state-space model estimation, it has been observed that improper normalization of either the hidden state or hidden state derivative of the model estimate, or even of the time interval can lead to numerical and optimization challenges with deep learning based methods. This results in a reduced model quality. In this contribution, we show that these three normalization tasks are inherently coupled. Due to the existence of this coupling, we propose a solution to all three normalization challenges by introducing a normalization constant at the state derivative level. We show that the appropriate choice of the normalization constant is related to the dynamics of the to-be-identified system and we derive multiple methods of obtaining an effective normalization constant. We compare and discuss all the normalization strategies on a benchmark problem based on experimental data from a cascaded tanks system and compare our results with other methods of the identification literature. ",
    "url": "https://arxiv.org/abs/2401.02902",
    "authors": [
      "Jonas Weigand",
      "Gerben I. Beintema",
      "Jonas Ulmen",
      "Daniel Görges",
      "Roland Tóth",
      "Maarten Schoukens",
      "Martin Ruskowski"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02905",
    "title": "H2G2-Net: A Hierarchical Heterogeneous Graph Generative Network  Framework for Discovery of Multi-Modal Physiological Responses",
    "abstract": "Discovering human cognitive and emotional states using multi-modal physiological signals draws attention across various research applications. Physiological responses of the human body are influenced by human cognition and commonly used to analyze cognitive states. From a network science perspective, the interactions of these heterogeneous physiological modalities in a graph structure may provide insightful information to support prediction of cognitive states. However, there is no clue to derive exact connectivity between heterogeneous modalities and there exists a hierarchical structure of sub-modalities. Existing graph neural networks are designed to learn on non-hierarchical homogeneous graphs with pre-defined graph structures; they failed to learn from hierarchical, multi-modal physiological data without a pre-defined graph structure. To this end, we propose a hierarchical heterogeneous graph generative network (H2G2-Net) that automatically learns a graph structure without domain knowledge, as well as a powerful representation on the hierarchical heterogeneous graph in an end-to-end fashion. We validate the proposed method on the CogPilot dataset that consists of multi-modal physiological signals. Extensive experiments demonstrate that our proposed method outperforms the state-of-the-art GNNs by 5%-20% in prediction accuracy. ",
    "url": "https://arxiv.org/abs/2401.02905",
    "authors": [
      "Haidong Gu",
      "Nathan Gaw",
      "Yinan Wang",
      "Chancellor Johnstone",
      "Christine Beauchene",
      "Sophia Yuditskaya",
      "Hrishikesh Rao",
      "Chun-An Chou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2401.02916",
    "title": "Uncovering the human motion pattern: Pattern Memory-based Diffusion  Model for Trajectory Prediction",
    "abstract": "Human trajectory forecasting is a critical challenge in fields such as robotics and autonomous driving. Due to the inherent uncertainty of human actions and intentions in real-world scenarios, various unexpected occurrences may arise. To uncover latent motion patterns in human behavior, we introduce a novel memory-based method, named Motion Pattern Priors Memory Network. Our method involves constructing a memory bank derived from clustered prior knowledge of motion patterns observed in the training set trajectories. We introduce an addressing mechanism to retrieve the matched pattern and the potential target distributions for each prediction from the memory bank, which enables the identification and retrieval of natural motion patterns exhibited by agents, subsequently using the target priors memory token to guide the diffusion model to generate predictions. Extensive experiments validate the effectiveness of our approach, achieving state-of-the-art trajectory prediction accuracy. The code will be made publicly available. ",
    "url": "https://arxiv.org/abs/2401.02916",
    "authors": [
      "Yuxin Yang",
      "Pengfei Zhu",
      "Mengshi Qi",
      "Huadong Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02918",
    "title": "Approximation Algorithms for the Weighted Nash Social Welfare via Convex  and Non-Convex Programs",
    "abstract": "In an instance of the weighted Nash Social Welfare problem, we are given a set of $m$ indivisible items, $\\mathscr{G}$, and $n$ agents, $\\mathscr{A}$, where each agent $i \\in \\mathscr{A}$ has a valuation $v_{ij}\\geq 0$ for each item $j\\in \\mathscr{G}$. In addition, every agent $i$ has a non-negative weight $w_i$ such that the weights collectively sum up to $1$. The goal is to find an assignment $\\sigma:\\mathscr{G}\\rightarrow \\mathscr{A}$ that maximizes $\\prod_{i\\in \\mathscr{A}} \\left(\\sum_{j\\in \\sigma^{-1}(i)} v_{ij}\\right)^{w_i}$, the product of the weighted valuations of the players. When all the weights equal $\\frac1n$, the problem reduces to the classical Nash Social Welfare problem, which has recently received much attention. In this work, we present a $5\\cdot\\exp\\left(2\\cdot D_{\\text{KL}}(\\mathbf{w}\\, ||\\, \\frac{\\vec{\\mathbf{1}}}{n})\\right) = 5\\cdot\\exp\\left(2\\log{n} + 2\\sum_{i=1}^n w_i \\log{w_i}\\right)$-approximation algorithm for the weighted Nash Social Welfare problem, where $D_{\\text{KL}}(\\mathbf{w}\\, ||\\, \\frac{\\vec{\\mathbf{1}}}{n})$ denotes the KL-divergence between the distribution induced by $\\mathbf{w}$ and the uniform distribution on $[n]$. We show a novel connection between the convex programming relaxations for the unweighted variant of Nash Social Welfare presented in \\cite{cole2017convex, anari2017nash}, and generalize the programs to two different mathematical programs for the weighted case. The first program is convex and is necessary for computational efficiency, while the second program is a non-convex relaxation that can be rounded efficiently. The approximation factor derives from the difference in the objective values of the convex and non-convex relaxation. ",
    "url": "https://arxiv.org/abs/2401.02918",
    "authors": [
      "Adam Brown",
      "Aditi Laddha",
      "Madhusudhan Reddy Pittu",
      "Mohit Singh"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2401.02921",
    "title": "Towards ASR Robust Spoken Language Understanding Through In-Context  Learning With Word Confusion Networks",
    "abstract": "In the realm of spoken language understanding (SLU), numerous natural language understanding (NLU) methodologies have been adapted by supplying large language models (LLMs) with transcribed speech instead of conventional written text. In real-world scenarios, prior to input into an LLM, an automated speech recognition (ASR) system generates an output transcript hypothesis, where inherent errors can degrade subsequent SLU tasks. Here we introduce a method that utilizes the ASR system's lattice output instead of relying solely on the top hypothesis, aiming to encapsulate speech ambiguities and enhance SLU outcomes. Our in-context learning experiments, covering spoken question answering and intent classification, underline the LLM's resilience to noisy speech transcripts with the help of word confusion networks from lattices, bridging the SLU performance gap between using the top ASR hypothesis and an oracle upper bound. Additionally, we delve into the LLM's robustness to varying ASR performance conditions and scrutinize the aspects of in-context learning which prove the most influential. ",
    "url": "https://arxiv.org/abs/2401.02921",
    "authors": [
      "Kevin Everson",
      "Yile Gu",
      "Huck Yang",
      "Prashanth Gurunath Shivakumar",
      "Guan-Ting Lin",
      "Jari Kolehmainen",
      "Ivan Bulyko",
      "Ankur Gandhe",
      "Shalini Ghosh",
      "Wael Hamza",
      "Hung-yi Lee",
      "Ariya Rastrow",
      "Andreas Stolcke"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2401.02930",
    "title": "Dagma-DCE: Interpretable, Non-Parametric Differentiable Causal Discovery",
    "abstract": "We introduce Dagma-DCE, an interpretable and model-agnostic scheme for differentiable causal discovery. Current non- or over-parametric methods in differentiable causal discovery use opaque proxies of ``independence'' to justify the inclusion or exclusion of a causal relationship. We show theoretically and empirically that these proxies may be arbitrarily different than the actual causal strength. Juxtaposed to existing differentiable causal discovery algorithms, \\textsc{Dagma-DCE} uses an interpretable measure of causal strength to define weighted adjacency matrices. In a number of simulated datasets, we show our method achieves state-of-the-art level performance. We additionally show that \\textsc{Dagma-DCE} allows for principled thresholding and sparsity penalties by domain-experts. The code for our method is available open-source at https://github.com/DanWaxman/DAGMA-DCE, and can easily be adapted to arbitrary differentiable models. ",
    "url": "https://arxiv.org/abs/2401.02930",
    "authors": [
      "Daniel Waxman",
      "Kurt Butler",
      "Petar M. Djuric"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.02931",
    "title": "SPFormer: Enhancing Vision Transformer with Superpixel Representation",
    "abstract": "In this work, we introduce SPFormer, a novel Vision Transformer enhanced by superpixel representation. Addressing the limitations of traditional Vision Transformers' fixed-size, non-adaptive patch partitioning, SPFormer employs superpixels that adapt to the image's content. This approach divides the image into irregular, semantically coherent regions, effectively capturing intricate details and applicable at both initial and intermediate feature levels. SPFormer, trainable end-to-end, exhibits superior performance across various benchmarks. Notably, it exhibits significant improvements on the challenging ImageNet benchmark, achieving a 1.4% increase over DeiT-T and 1.1% over DeiT-S respectively. A standout feature of SPFormer is its inherent explainability. The superpixel structure offers a window into the model's internal processes, providing valuable insights that enhance the model's interpretability. This level of clarity significantly improves SPFormer's robustness, particularly in challenging scenarios such as image rotations and occlusions, demonstrating its adaptability and resilience. ",
    "url": "https://arxiv.org/abs/2401.02931",
    "authors": [
      "Jieru Mei",
      "Liang-Chieh Chen",
      "Alan Yuille",
      "Cihang Xie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02937",
    "title": "Locally Adaptive Neural 3D Morphable Models",
    "abstract": "We present the Locally Adaptive Morphable Model (LAMM), a highly flexible Auto-Encoder (AE) framework for learning to generate and manipulate 3D meshes. We train our architecture following a simple self-supervised training scheme in which input displacements over a set of sparse control vertices are used to overwrite the encoded geometry in order to transform one training sample into another. During inference, our model produces a dense output that adheres locally to the specified sparse geometry while maintaining the overall appearance of the encoded object. This approach results in state-of-the-art performance in both disentangling manipulated geometry and 3D mesh reconstruction. To the best of our knowledge LAMM is the first end-to-end framework that enables direct local control of 3D vertex geometry in a single forward pass. A very efficient computational graph allows our network to train with only a fraction of the memory required by previous methods and run faster during inference, generating 12k vertex meshes at $>$60fps on a single CPU thread. We further leverage local geometry control as a primitive for higher level editing operations and present a set of derivative capabilities such as swapping and sampling object parts. Code and pretrained models can be found at https://github.com/michaeltrs/LAMM. ",
    "url": "https://arxiv.org/abs/2401.02937",
    "authors": [
      "Michail Tarasiou",
      "Rolandos Alexandros Potamias",
      "Eimear O'Sullivan",
      "Stylianos Ploumpis",
      "Stefanos Zafeiriou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02438",
    "title": "Sensor Placement for Learning in Flow Networks",
    "abstract": "Large infrastructure networks (e.g. for transportation and power distribution) require constant monitoring for failures, congestion, and other adversarial events. However, assigning a sensor to every link in the network is often infeasible due to placement and maintenance costs. Instead, sensors can be placed only on a few key links, and machine learning algorithms can be leveraged for the inference of missing measurements (e.g. traffic counts, power flows) across the network. This paper investigates the sensor placement problem for networks. We first formalize the problem under a flow conservation assumption and show that it is NP-hard to place a fixed set of sensors optimally. Next, we propose an efficient and adaptive greedy heuristic for sensor placement that scales to large networks. Our experiments, using datasets from real-world application domains, show that the proposed approach enables more accurate inference than existing alternatives from the literature. We demonstrate that considering even imperfect or incomplete ground-truth estimates can vastly improve the prediction error, especially when a small number of sensors is available. ",
    "url": "https://arxiv.org/abs/2401.02438",
    "authors": [
      "Arnav Burudgunte",
      "Arlei Silva"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2401.02471",
    "title": "Global solution to sensor network localization: A non-convex potential  game approach and its distributed implementation",
    "abstract": "Consider a sensor network consisting of both anchor and non-anchor nodes. We address the following sensor network localization (SNL) problem: given the physical locations of anchor nodes and relative measurements among all nodes, determine the locations of all non-anchor nodes. The solution to the SNL problem is challenging due to its inherent non-convexity. In this paper, the problem takes on the form of a multi-player non-convex potential game in which canonical duality theory is used to define a complementary dual potential function. After showing the Nash equilibrium (NE) correspondent to the SNL solution, we provide a necessary and sufficient condition for a stationary point to coincide with the NE. An algorithm is proposed to reach the NE and shown to have convergence rate $\\mathcal{O}(1/\\sqrt{k})$. With the aim of reducing the information exchange within a network, a distributed algorithm for NE seeking is implemented and its global convergence analysis is provided. Extensive simulations show the validity and effectiveness of the proposed approach to solve the SNL problem. ",
    "url": "https://arxiv.org/abs/2401.02471",
    "authors": [
      "Gehui Xu",
      "Guanpu Chen",
      "Yiguang Hong",
      "Baris Fidan",
      "Thomas Parisini",
      "Karl H. Johansson"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2401.02537",
    "title": "Using Singular Value Decomposition in a Convolutional Neural Network to  Improve Brain Tumor Segmentation Accuracy",
    "abstract": "A brain tumor consists of cells showing abnormal brain growth. The area of the brain tumor significantly affects choosing the type of treatment and following the course of the disease during the treatment. At the same time, pictures of Brain MRIs are accompanied by noise. Eliminating existing noises can significantly impact the better segmentation and diagnosis of brain tumors. In this work, we have tried using the analysis of eigenvalues. We have used the MSVD algorithm, reducing the image noise and then using the deep neural network to segment the tumor in the images. The proposed method's accuracy was increased by 2.4% compared to using the original images. With Using the MSVD method, convergence speed has also increased, showing the proposed method's effectiveness ",
    "url": "https://arxiv.org/abs/2401.02537",
    "authors": [
      "Pegah Ahadian",
      "Maryam Babaei",
      "Kourosh Parand"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02554",
    "title": "A note on eigenvalues of zero divisor graphs associated with commutative  rings",
    "abstract": "For a commutative ring $R,$ with non-zero zero divisors $Z^{\\ast}(R)$. The zero divisor graph $\\Gamma(R)$ is a simple graph with vertex set $Z^{\\ast}(R)$, and two distinct vertices $x,y\\in V(\\Gamma(R))$ are adjacent if and only if $x\\cdot y=0.$ In this note, provide counter examples to the eigenvalues, the energy and the second Zagreb index related to zero divisor graphs of rings obtained in [Johnson and Sankar, J. Appl. Math. Comp. (2023), \\cite{johnson}]. We correct the eigenvalues (energy) and the Zagreb index result for the zero divisor graphs of ring $\\mathbb{Z}_{p}[x]/\\langle x^{4} \\rangle.$ We show that for any prime $p$, $\\Gamma(\\mathbb{Z}_{p}[x]/\\langle x^{4} \\rangle)$ is non-hyperenergetic and for prime $p\\geq 3$, $\\Gamma(\\mathbb{Z}_{p}[x]/\\langle x^{4} \\rangle)$ is hypoenergetic. We give a formulae for the topological indices of $\\Gamma(\\mathbb{Z}_{p}[x]/\\langle x^{4} \\rangle)$ and show that its Zagreb indices satisfy Hansen and Vuki$\\check{c}$cevi\\'c conjecture \\cite{hansen}. ",
    "url": "https://arxiv.org/abs/2401.02554",
    "authors": [
      "Bilal Ahmad Rather"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Rings and Algebras (math.RA)",
      "Spectral Theory (math.SP)"
    ]
  },
  {
    "id": "arXiv:2401.02559",
    "title": "A note on the Independent domination polynomial of zero divisor graph of  rings",
    "abstract": "In this note we consider the independent domination polynomial problem along with their unimodal and log-concave properties which were earlier studied by G\\\"ursoy, \\\"Ulker and G\\\"ursoy (Soft Comp. 2022). We show that the independent domination polynomial of zero divisor graphs of $\\mathbb{Z}_{n}$ for $n\\in \\{ pq, p^{2}q, pqr, p^{\\alpha}\\}$ where $p,q,r$ are primes with $2<p<q<r$ are not unimodal thereby contradicting the main result of G\\\"ursoy, \\\"Ulker and G\\\"ursoy \\cite{gursoy}. Besides the authors show that the zero of the independent domination polynomial of these graphs have only real zero and used concept of Newton's inequalities to establish the log-concave property for the afore said polynomials. We show that these polynomials have complex zeros and the technique of Newton's inequalities are not applicable. Finally, by definition of log-concave, we prove that these polynomials are log-concave and fix the flaws in Theorem 10 of G\\\"ursoy, \\\"Ulker and G\\\"ursoy \\cite{gursoy}. ",
    "url": "https://arxiv.org/abs/2401.02559",
    "authors": [
      "Bilal Ahmad Rather"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2401.02565",
    "title": "Vulnerabilities Unveiled: Adversarially Attacking a Multimodal Vision  Langauge Model for Pathology Imaging",
    "abstract": "In the dynamic landscape of medical artificial intelligence, this study explores the vulnerabilities of the Pathology Language-Image Pretraining (PLIP) model, a Vision Language Foundation model, under targeted adversarial conditions. Leveraging the Kather Colon dataset with 7,180 H&E images across nine tissue types, our investigation employs Projected Gradient Descent (PGD) adversarial attacks to intentionally induce misclassifications. The outcomes reveal a 100% success rate in manipulating PLIP's predictions, underscoring its susceptibility to adversarial perturbations. The qualitative analysis of adversarial examples delves into the interpretability challenges, shedding light on nuanced changes in predictions induced by adversarial manipulations. These findings contribute crucial insights into the interpretability, domain adaptation, and trustworthiness of Vision Language Models in medical imaging. The study emphasizes the pressing need for robust defenses to ensure the reliability of AI models. ",
    "url": "https://arxiv.org/abs/2401.02565",
    "authors": [
      "Jai Prakash Veerla",
      "Poojitha Thota",
      "Partha Sai Guttikonda",
      "Shirin Nilizadeh",
      "Jacob M. Luber"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Tissues and Organs (q-bio.TO)"
    ]
  },
  {
    "id": "arXiv:2401.02673",
    "title": "A unified multichannel far-field speech recognition system: combining  neural beamforming with attention based end-to-end model",
    "abstract": "Far-field speech recognition is a challenging task that conventionally uses signal processing beamforming to attack noise and interference problem. But the performance has been found usually limited due to heavy reliance on environmental assumption. In this paper, we propose a unified multichannel far-field speech recognition system that combines the neural beamforming and transformer-based Listen, Spell, Attend (LAS) speech recognition system, which extends the end-to-end speech recognition system further to include speech enhancement. Such framework is then jointly trained to optimize the final objective of interest. Specifically, factored complex linear projection (fCLP) has been adopted to form the neural beamforming. Several pooling strategies to combine look directions are then compared in order to find the optimal approach. Moreover, information of the source direction is also integrated in the beamforming to explore the usefulness of source direction as a prior, which is usually available especially in multi-modality scenario. Experiments on different microphone array geometry are conducted to evaluate the robustness against spacing variance of microphone array. Large in-house databases are used to evaluate the effectiveness of the proposed framework and the proposed method achieve 19.26\\% improvement when compared with a strong baseline. ",
    "url": "https://arxiv.org/abs/2401.02673",
    "authors": [
      "Dongdi Zhao",
      "Jianbo Ma",
      "Lu Lu",
      "Jinke Li",
      "Xuan Ji",
      "Lei Zhu",
      "Fuming Fang",
      "Ming Liu",
      "Feijun Jiang"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2401.02759",
    "title": "Detection and Classification of Diabetic Retinopathy using Deep Learning  Algorithms for Segmentation to Facilitate Referral Recommendation for Test  and Treatment Prediction",
    "abstract": "This research paper addresses the critical challenge of diabetic retinopathy (DR), a severe complication of diabetes leading to potential blindness. The proposed methodology leverages transfer learning with convolutional neural networks (CNNs) for automatic DR detection using a single fundus photograph, demonstrating high effectiveness with a quadratic weighted kappa score of 0.92546 in the APTOS 2019 Blindness Detection Competition. The paper reviews existing literature on DR detection, spanning classical computer vision methods to deep learning approaches, particularly focusing on CNNs. It identifies gaps in the research, emphasizing the lack of exploration in integrating pretrained large language models with segmented image inputs for generating recommendations and understanding dynamic interactions within a web application context.Objectives include developing a comprehensive DR detection methodology, exploring model integration, evaluating performance through competition ranking, contributing significantly to DR detection methodologies, and identifying research gaps.The methodology involves data preprocessing, data augmentation, and the use of a U-Net neural network architecture for segmentation. The U-Net model efficiently segments retinal structures, including blood vessels, hard and soft exudates, haemorrhages, microaneurysms, and the optical disc. High evaluation scores in Jaccard, F1, recall, precision, and accuracy underscore the model's potential for enhancing diagnostic capabilities in retinal pathology assessment.The outcomes of this research hold promise for improving patient outcomes through timely diagnosis and intervention in the fight against diabetic retinopathy, marking a significant contribution to the field of medical image analysis. ",
    "url": "https://arxiv.org/abs/2401.02759",
    "authors": [
      "Manoj S H",
      "Arya A Bosale"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02765",
    "title": "An improved upper bound for the domination number of a graph",
    "abstract": "Let $G$ be a graph of order $n$. A classical upper bound for the domination number of a graph $G$ having no isolated vertices is $\\lfloor\\frac{n}{2}\\rfloor$. However, for several families of graphs, we have $\\gamma(G) \\le \\lfloor\\sqrt{n}\\rfloor$ which gives a substantially improved upper bound. In this paper, we give a condition necessary for a graph $G$ to have $\\gamma(G) \\le \\lfloor\\sqrt{n}\\rfloor$, and some conditions sufficient for a graph $G$ to have $\\gamma(G) \\le \\lfloor\\sqrt{n}\\rfloor$. We also present a characterization of all connected graphs $G$ of order $n$ with $\\gamma(G) = \\lfloor\\sqrt{n}\\rfloor$. Further, we prove that for a graph $G$ not satisfying $rad(G)=diam(G)=rad(\\overline{G})=diam(\\overline{G})=2$, deciding whether $\\gamma(G) \\le \\lfloor\\sqrt{n}\\rfloor$ or $\\gamma(\\overline{G}) \\le \\lfloor\\sqrt{n}\\rfloor$ can be done in polynomial time. We conjecture that this decision problem can be solved in polynomial time for any graph $G$. ",
    "url": "https://arxiv.org/abs/2401.02765",
    "authors": [
      "Subramanian Arumugam",
      "Suresh Manjanath Hegde",
      "Shashanka Kulamarva"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2401.02772",
    "title": "Complex systems approach to natural language",
    "abstract": "The review summarizes the main methodological concepts used in studying natural language from the perspective of complexity science and documents their applicability in identifying both universal and system-specific features of language in its written representation. Three main complexity-related research trends in quantitative linguistics are covered. The first part addresses the issue of word frequencies in texts and demonstrates that taking punctuation into consideration restores scaling whose violation in the Zipf's law is often observed for the most frequent words. The second part introduces methods inspired by time series analysis, used in studying various kinds of correlations in written texts. The related time series are generated on the basis of text partition into sentences or into phrases between consecutive punctuation marks. It turns out that these series develop features often found in signals generated by complex systems, like long-range correlations or (multi)fractal structures. Moreover, it appears that the distances between punctuation marks comply with the discrete variant of the Weibull distribution. In the third part, the application of the network formalism to natural language is reviewed, particularly in the context of the so-called word-adjacency networks. Parameters characterizing topology of such networks can be used for classification of texts, for example, from a stylometric perspective. Network approach can also be applied to represent the organization of word associations. Structure of word-association networks turns out to be significantly different from that observed in random networks, revealing genuine properties of language. Finally, punctuation seems to have a significant impact not only on the language's information-carrying ability but also on its key statistical properties, hence it is recommended to consider punctuation marks on a par with words. ",
    "url": "https://arxiv.org/abs/2401.02772",
    "authors": [
      "Tomasz Stanisz",
      "Stanisław Drożdż",
      "Jarosław Kwapień"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Computation and Language (cs.CL)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2401.02794",
    "title": "Subjective and Objective Analysis of Indian Social Media Video Quality",
    "abstract": "We conducted a large-scale subjective study of the perceptual quality of User-Generated Mobile Video Content on a set of mobile-originated videos obtained from the Indian social media platform ShareChat. The content viewed by volunteer human subjects under controlled laboratory conditions has the benefit of culturally diversifying the existing corpus of User-Generated Content (UGC) video quality datasets. There is a great need for large and diverse UGC-VQA datasets, given the explosive global growth of the visual internet and social media platforms. This is particularly true in regard to videos obtained by smartphones, especially in rapidly emerging economies like India. ShareChat provides a safe and cultural community oriented space for users to generate and share content in their preferred Indian languages and dialects. Our subjective quality study, which is based on this data, offers a boost of cultural, visual, and language diversification to the video quality research community. We expect that this new data resource will also allow for the development of systems that can predict the perceived visual quality of Indian social media videos, to control scaling and compression protocols for streaming, provide better user recommendations, and guide content analysis and processing. We demonstrate the value of the new data resource by conducting a study of leading blind video quality models on it, including a new model, called MoEVA, which deploys a mixture of experts to predict video quality. Both the new LIVE-ShareChat dataset and sample source code for MoEVA are being made freely available to the research community at https://github.com/sandeep-sm/LIVE-SC ",
    "url": "https://arxiv.org/abs/2401.02794",
    "authors": [
      "Sandeep Mishra",
      "Mukul Jha",
      "Alan C. Bovik"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.02890",
    "title": "Nonlinear functional regression by functional deep neural network with  kernel embedding",
    "abstract": "With the rapid development of deep learning in various fields of science and technology, such as speech recognition, image classification, and natural language processing, recently it is also widely applied in the functional data analysis (FDA) with some empirical success. However, due to the infinite dimensional input, we need a powerful dimension reduction method for functional learning tasks, especially for the nonlinear functional regression. In this paper, based on the idea of smooth kernel integral transformation, we propose a functional deep neural network with an efficient and fully data-dependent dimension reduction method. The architecture of our functional net consists of a kernel embedding step: an integral transformation with a data-dependent smooth kernel; a projection step: a dimension reduction by projection with eigenfunction basis based on the embedding kernel; and finally an expressive deep ReLU neural network for the prediction. The utilization of smooth kernel embedding enables our functional net to be discretization invariant, efficient, and robust to noisy observations, capable of utilizing information in both input functions and responses data, and have a low requirement on the number of discrete points for an unimpaired generalization performance. We conduct theoretical analysis including approximation error and generalization error analysis, and numerical simulations to verify these advantages of our functional net. ",
    "url": "https://arxiv.org/abs/2401.02890",
    "authors": [
      "Zhongjie Shi",
      "Jun Fan",
      "Linhao Song",
      "Ding-Xuan Zhou",
      "Johan A.K. Suykens"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.04987",
    "title": "AutoGL: A Library for Automated Graph Learning",
    "abstract": " Comments: Extended version; initial version published at ICLR 2021 Workshop on Geometrical and Topological Representation Learning ",
    "url": "https://arxiv.org/abs/2104.04987",
    "authors": [
      "Ziwei Zhang",
      "Yijian Qin",
      "Zeyang Zhang",
      "Chaoyu Guan",
      "Jie Cai",
      "Heng Chang",
      "Jiyan Jiang",
      "Haoyang Li",
      "Zixin Sun",
      "Beini Xie",
      "Yang Yao",
      "Yipeng Zhang",
      "Xin Wang",
      "Wenwu Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2110.06166",
    "title": "Game Theory for Adversarial Attacks and Defenses",
    "abstract": " Comments: With the agreement of my coauthors, I would like to withdraw the manuscript \"Game Theory for Adversarial Attacks and Defenses\". Some experimental procedures were not included in the manuscript, which makes a part of important claims not meaningful ",
    "url": "https://arxiv.org/abs/2110.06166",
    "authors": [
      "Shorya Sharma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2110.06485",
    "title": "Communication-Efficient Triangle Counting under Local Differential  Privacy",
    "abstract": " Comments: Full version of the paper accepted at USENIX Security 2022; The first and second authors made equal contribution; The current version added an addendum to double clipping (Appendix I) ",
    "url": "https://arxiv.org/abs/2110.06485",
    "authors": [
      "Jacob Imola",
      "Takao Murakami",
      "Kamalika Chaudhuri"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2208.04988",
    "title": "Quantum artificial vision for defect detection in manufacturing",
    "abstract": " Comments: 11 pages, 7 figures, 16 tables, revised version ",
    "url": "https://arxiv.org/abs/2208.04988",
    "authors": [
      "Daniel Guijo",
      "Victor Onofre",
      "Gianni Del Bimbo",
      "Samuel Mugel",
      "Daniel Estepa",
      "Xabier De Carlos",
      "Ana Adell",
      "Aizea Lojo",
      "Josu Bilbao",
      "Roman Orus"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2208.12511",
    "title": "Lower Difficulty and Better Robustness: A Bregman Divergence Perspective  for Adversarial Training",
    "abstract": " Title: Lower Difficulty and Better Robustness: A Bregman Divergence Perspective  for Adversarial Training ",
    "url": "https://arxiv.org/abs/2208.12511",
    "authors": [
      "Zihui Wu",
      "Haichang Gao",
      "Bingqian Zhou",
      "Xiaoyan Guo",
      "Shudong Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.15849",
    "title": "Hierarchical speaker representation for target speaker extraction",
    "abstract": " Comments: Accepted to ICASSP 2024 ",
    "url": "https://arxiv.org/abs/2210.15849",
    "authors": [
      "Shulin He",
      "Huaiwen Zhang",
      "Wei Rao",
      "Kanghao Zhang",
      "Yukai Ju",
      "Yang Yang",
      "Xueliang Zhang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2211.07866",
    "title": "Efficient Estimation for Longitudinal Networks via Adaptive Merging",
    "abstract": " Comments: 30 pages and 4 figures; appendix including technical proof will be uploaded later ",
    "url": "https://arxiv.org/abs/2211.07866",
    "authors": [
      "Haoran Zhang",
      "Junhui Wang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.12735",
    "title": "Fast-iTPN: Integrally Pre-Trained Transformer Pyramid Network with Token  Migration",
    "abstract": " Comments: The tiny/small/base-level models report new records on ImageNet-1K. Code: github.com/sunsmarterjie/iTPN ",
    "url": "https://arxiv.org/abs/2211.12735",
    "authors": [
      "Yunjie Tian",
      "Lingxi Xie",
      "Jihao Qiu",
      "Jianbin Jiao",
      "Yaowei Wang",
      "Qi Tian",
      "Qixiang Ye"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.00344",
    "title": "Bayesian Heuristics for Robust Spatial Perception",
    "abstract": " Comments: 10 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2212.00344",
    "authors": [
      "Aamir Hussain Chughtai",
      "Muhammad Tahir",
      "Momin Uppal"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2302.04720",
    "title": "Computers as Bad Social Actors: Dark Patterns and Anti-Patterns in  Interfaces that Act Socially",
    "abstract": " Comments: Accepted paper for the 2024 ACM SIGCHI Conference on Computer-Supported Cooperative Work & Social Computing (CSCW) ",
    "url": "https://arxiv.org/abs/2302.04720",
    "authors": [
      "Lize Alberts",
      "Ulrik Lyngs",
      "Max Van Kleek"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2303.02725",
    "title": "Local Environment Poisoning Attacks on Federated Reinforcement Learning",
    "abstract": " Title: Local Environment Poisoning Attacks on Federated Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2303.02725",
    "authors": [
      "Evelyn Ma",
      "Praneet Rathi",
      "S. Rasoul Etesami"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2303.15065",
    "title": "Single-subject Multi-contrast MRI Super-resolution via Implicit Neural  Representations",
    "abstract": " Title: Single-subject Multi-contrast MRI Super-resolution via Implicit Neural  Representations ",
    "url": "https://arxiv.org/abs/2303.15065",
    "authors": [
      "Julian McGinnis",
      "Suprosanna Shit",
      "Hongwei Bran Li",
      "Vasiliki Sideri-Lampretsa",
      "Robert Graf",
      "Maik Dannecker",
      "Jiazhen Pan",
      "Nil Stolt Ansó",
      "Mark Mühlau",
      "Jan S. Kirschke",
      "Daniel Rueckert",
      "Benedikt Wiestler"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.04163",
    "title": "Energy-Efficient URLLC Service Provision via a Near-Space Information  Network",
    "abstract": " Title: Energy-Efficient URLLC Service Provision via a Near-Space Information  Network ",
    "url": "https://arxiv.org/abs/2304.04163",
    "authors": [
      "Puguang An",
      "Peng Yang",
      "Xianbin Cao",
      "Kun Guo",
      "Yue Gao",
      "Tony Q. S. Quek"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.03465",
    "title": "Modular Polynomial Codes for Secure and Robust Distributed Matrix  Multiplication",
    "abstract": " Title: Modular Polynomial Codes for Secure and Robust Distributed Matrix  Multiplication ",
    "url": "https://arxiv.org/abs/2305.03465",
    "authors": [
      "David Karpuk",
      "Razane Tajeddine"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2305.03890",
    "title": "Approximation by non-symmetric networks for cross-domain learning",
    "abstract": " Title: Approximation by non-symmetric networks for cross-domain learning ",
    "url": "https://arxiv.org/abs/2305.03890",
    "authors": [
      "Hrushikesh Mhaskar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2305.08039",
    "title": "Systematic Meets Unintended: Prior Knowledge Adaptive 5G Vulnerability  Detection via Multi-Fuzzing",
    "abstract": " Title: Systematic Meets Unintended: Prior Knowledge Adaptive 5G Vulnerability  Detection via Multi-Fuzzing ",
    "url": "https://arxiv.org/abs/2305.08039",
    "authors": [
      "Jingda Yang",
      "Ying Wang",
      "Yanjun Pan",
      "Tuyen X. Tran"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2306.07562",
    "title": "Statistical Beamformer Exploiting Non-stationarity and Sparsity with  Spatially Constrained ICA for Robust Speech Recognition",
    "abstract": " Comments: Accepted by TASLP ",
    "url": "https://arxiv.org/abs/2306.07562",
    "authors": [
      "Ui-Hyeop Shin",
      "Hyung-Min Park"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2306.08109",
    "title": "Provable Accelerated Convergence of Nesterov's Momentum for Deep ReLU  Neural Networks",
    "abstract": " Comments: Accepted by ALT 2024 ",
    "url": "https://arxiv.org/abs/2306.08109",
    "authors": [
      "Fangshuo Liao",
      "Anastasios Kyrillidis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2306.08980",
    "title": "The Upper Bound of Information Diffusion in Code Review",
    "abstract": " Comments: To appear in Empirical Software Engineering Journal ",
    "url": "https://arxiv.org/abs/2306.08980",
    "authors": [
      "Michael Dorner",
      "Daniel Mendez",
      "Krzysztof Wnuk",
      "Ehsan Zabardast",
      "Jacek Czerwonka"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2307.11196",
    "title": "Exact Community Recovery in the Geometric SBM",
    "abstract": " Title: Exact Community Recovery in the Geometric SBM ",
    "url": "https://arxiv.org/abs/2307.11196",
    "authors": [
      "Julia Gaudio",
      "Xiaochun Niu",
      "Ermin Wei"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Probability (math.PR)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2307.15696",
    "title": "Development of a Boston-area 50-km fiber quantum network testbed",
    "abstract": " Comments: 9 pages, 5 figures + Supplemental Materials ",
    "url": "https://arxiv.org/abs/2307.15696",
    "authors": [
      "Eric Bersin",
      "Matthew Grein",
      "Madison Sutula",
      "Ryan Murphy",
      "Yan Qi Huan",
      "Mark Stevens",
      "Aziza Suleymanzade",
      "Catherine Lee",
      "Ralf Riedinger",
      "David J. Starling",
      "Pieter-Jan Stas",
      "Can M. Knaut",
      "Neil Sinclair",
      "Daniel R. Assumpcao",
      "Yan-Cheng Wei",
      "Erik N. Knall",
      "Bartholomeus Machielse",
      "Denis D. Sukachev",
      "David S. Levonian",
      "Mihir K. Bhaskar",
      "Marko Lončar",
      "Scott Hamilton",
      "Mikhail Lukin",
      "Dirk Englund",
      "P. Benjamin Dixon"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Networking and Internet Architecture (cs.NI)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2308.07688",
    "title": "Enhancing Network Initialization for Medical AI Models Using  Large-Scale, Unlabeled Natural Images",
    "abstract": " Comments: Published in European Radiology Experimental ",
    "url": "https://arxiv.org/abs/2308.07688",
    "authors": [
      "Soroosh Tayebi Arasteh",
      "Leo Misera",
      "Jakob Nikolas Kather",
      "Daniel Truhn",
      "Sven Nebelung"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.07728",
    "title": "Domain-Aware Fine-Tuning: Enhancing Neural Network Adaptability",
    "abstract": " Title: Domain-Aware Fine-Tuning: Enhancing Neural Network Adaptability ",
    "url": "https://arxiv.org/abs/2308.07728",
    "authors": [
      "Seokhyeon Ha",
      "Sunbeom Jung",
      "Jungwoo Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.12325",
    "title": "Predicting Drug Solubility Using Different Machine Learning Methods --  Linear Regression Model with Extracted Chemical Features vs Graph  Convolutional Neural Network",
    "abstract": " Comments: 7 pages, 4 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2308.12325",
    "authors": [
      "John Ho",
      "Zhao-Heng Yin",
      "Colin Zhang",
      "Nicole Guo",
      "Yang Ha"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.12910",
    "title": "SCoRD: Subject-Conditional Relation Detection with Text-Augmented Data",
    "abstract": " Comments: WACV 2024 ",
    "url": "https://arxiv.org/abs/2308.12910",
    "authors": [
      "Ziyan Yang",
      "Kushal Kafle",
      "Zhe Lin",
      "Scott Cohen",
      "Zhihong Ding",
      "Vicente Ordonez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.05305",
    "title": "Fully-Connected Spatial-Temporal Graph for Multivariate Time-Series Data",
    "abstract": " Comments: 10 pages, 8 figures, Accepted by AAAI 2024 ",
    "url": "https://arxiv.org/abs/2309.05305",
    "authors": [
      "Yucheng Wang",
      "Yuecong Xu",
      "Jianfei Yang",
      "Min Wu",
      "Xiaoli Li",
      "Lihua Xie",
      "Zhenghua Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.15325",
    "title": "Neural Operators for Accelerating Scientific Simulations and Design",
    "abstract": " Title: Neural Operators for Accelerating Scientific Simulations and Design ",
    "url": "https://arxiv.org/abs/2309.15325",
    "authors": [
      "Kamyar Azizzadenesheli",
      "Nikola Kovachki",
      "Zongyi Li",
      "Miguel Liu-Schiaffini",
      "Jean Kossaifi",
      "Anima Anandkumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2310.15436",
    "title": "VGX: Large-Scale Sample Generation for Boosting Learning-Based Software  Vulnerability Analyses",
    "abstract": " Comments: 13 pages, 6 figures, To appear at ICSE 2024 ",
    "url": "https://arxiv.org/abs/2310.15436",
    "authors": [
      "Yu Nong",
      "Richard Fang",
      "Guangbei Yi",
      "Kunsong Zhao",
      "Xiapu Luo",
      "Feng Chen",
      "Haipeng Cai"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2311.05197",
    "title": "Deep learning in computed tomography pulmonary angiography imaging: a  dual-pronged approach for pulmonary embolism detection",
    "abstract": " Comments: Published in Expert Systems With Applications ",
    "url": "https://arxiv.org/abs/2311.05197",
    "authors": [
      "Fabiha Bushra",
      "Muhammad E. H. Chowdhury",
      "Rusab Sarmun",
      "Saidul Kabir",
      "Menatalla Said",
      "Sohaib Bassam Zoghoul",
      "Adam Mushtak",
      "Israa Al-Hashimi",
      "Abdulrahman Alqahtani",
      "Anwarul Hasan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.14386",
    "title": "Collective Memory, Consensus, and Learning Explained by Network  Connectivity",
    "abstract": " Title: Collective Memory, Consensus, and Learning Explained by Network  Connectivity ",
    "url": "https://arxiv.org/abs/2311.14386",
    "authors": [
      "Jeroen Bruggeman"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2312.01049",
    "title": "Joint User Association and Resource Allocation for Multi-Cell Networks  with Adaptive Semantic Communication",
    "abstract": " Title: Joint User Association and Resource Allocation for Multi-Cell Networks  with Adaptive Semantic Communication ",
    "url": "https://arxiv.org/abs/2312.01049",
    "authors": [
      "Xingqiu He",
      "Chaoqun You",
      "Tony Q.S. Quek"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2312.01056",
    "title": "Investigating the Surrogate Modeling Capabilities of Continuous Time  Echo State Networks",
    "abstract": " Title: Investigating the Surrogate Modeling Capabilities of Continuous Time  Echo State Networks ",
    "url": "https://arxiv.org/abs/2312.01056",
    "authors": [
      "Saakaar Bhatnagar"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2312.01878",
    "title": "HGPROMPT: Bridging Homogeneous and Heterogeneous Graphs for Few-shot  Prompt Learning",
    "abstract": " Comments: Accepted by AAAI2024 ",
    "url": "https://arxiv.org/abs/2312.01878",
    "authors": [
      "Xingtong Yu",
      "Yuan Fang",
      "Zemin Liu",
      "Xinming Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07180",
    "title": "Context-Aware Iteration Policy Network for Efficient Optical Flow  Estimation",
    "abstract": " Comments: 2024, Association for the Advancement of Artificial Intelligence ",
    "url": "https://arxiv.org/abs/2312.07180",
    "authors": [
      "Ri Cheng",
      "Ruian He",
      "Xuhao Jiang",
      "Shili Zhou",
      "Weimin Tan",
      "Bo Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.10983",
    "title": "MatchDet: A Collaborative Framework for Image Matching and Object  Detection",
    "abstract": " Title: MatchDet: A Collaborative Framework for Image Matching and Object  Detection ",
    "url": "https://arxiv.org/abs/2312.10983",
    "authors": [
      "Jinxiang Lai",
      "Wenlong Wu",
      "Bin-Bin Gao",
      "Jun Liu",
      "Jiawei Zhan",
      "Congchong Nie",
      "Yi Zeng",
      "Chengjie Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.11153",
    "title": "Research on Multilingual Natural Scene Text Detection Algorithm",
    "abstract": " Comments: Sorry, we discovered certain mistake and asked that the current version be removed in order to perform a thorough reanalysis ",
    "url": "https://arxiv.org/abs/2312.11153",
    "authors": [
      "Tao Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.12105",
    "title": "Preserving Data Secrecy in Decentralized Inter-organizational Process  Mining",
    "abstract": " Title: Preserving Data Secrecy in Decentralized Inter-organizational Process  Mining ",
    "url": "https://arxiv.org/abs/2312.12105",
    "authors": [
      "Valerio Goretti",
      "Davide Basile",
      "Luca Barbaro",
      "Claudio Di Ciccio"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2312.17093",
    "title": "LITE: A Stable Framework for Lattice-Integrated Embedding of Topological  Descriptors",
    "abstract": " Comments: 15 pages, 1 figure, fixed references and typos, changed name of the paper, minor changes to results section ",
    "url": "https://arxiv.org/abs/2312.17093",
    "authors": [
      "Michael Etienne Van Huffel",
      "Matteo Palo"
    ],
    "subjectives": [
      "Algebraic Topology (math.AT)",
      "Computational Geometry (cs.CG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2312.17163",
    "title": "FENet: Focusing Enhanced Network for Lane Detection",
    "abstract": " Comments: 12 pages including appendix. The Code is available at this https URL ",
    "url": "https://arxiv.org/abs/2312.17163",
    "authors": [
      "Liman Wang",
      "Hanyang Zhong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.00031",
    "title": "Self-supervised Pretraining for Decision Foundation Model: Formulation,  Pipeline and Challenges",
    "abstract": " Title: Self-supervised Pretraining for Decision Foundation Model: Formulation,  Pipeline and Challenges ",
    "url": "https://arxiv.org/abs/2401.00031",
    "authors": [
      "Xiaoqian Liu",
      "Jianbin Jiao",
      "Junge Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.00867",
    "title": "Tensor Networks for Explainable Machine Learning in Cybersecurity",
    "abstract": " Comments: 9 pages, 9 figures, 2 table, minor typos corrected ",
    "url": "https://arxiv.org/abs/2401.00867",
    "authors": [
      "Borja Aizpurua",
      "Roman Orus"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2401.01100",
    "title": "Scalable manifold learning by uniform landmark sampling and constrained  locally linear embedding",
    "abstract": " Comments: 33 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2401.01100",
    "authors": [
      "Dehua Peng",
      "Zhipeng Gui",
      "Wenzhang Wei",
      "Huayi Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02163",
    "title": "Enumerating m-Length Walks in Directed Graphs with Constant Delay",
    "abstract": " Title: Enumerating m-Length Walks in Directed Graphs with Constant Delay ",
    "url": "https://arxiv.org/abs/2401.02163",
    "authors": [
      "Duncan Adamson",
      "Pawel Gawrychowski",
      "Florin Manea"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2401.02306",
    "title": "Secure Control of Connected and Automated Vehicles Using Trust-Aware  Robust Event-Triggered Control Barrier Functions",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2305.16818 ",
    "url": "https://arxiv.org/abs/2401.02306",
    "authors": [
      "H M Sabbir Ahmad",
      "Ehsan Sabouni",
      "Akua Dickson",
      "Wei Xiao",
      "Christos G. Cassandras",
      "Wenchao Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2401.02309",
    "title": "TR-DETR: Task-Reciprocal Transformer for Joint Moment Retrieval and  Highlight Detection",
    "abstract": " Comments: Accepted by AAAI-24 ",
    "url": "https://arxiv.org/abs/2401.02309",
    "authors": [
      "Hao Sun",
      "Mingyao Zhou",
      "Wenjing Chen",
      "Wei Xie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2401.02361",
    "title": "An Open and Comprehensive Pipeline for Unified Object Grounding and  Detection",
    "abstract": " Comments: 10 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2401.02361",
    "authors": [
      "Xiangyu Zhao",
      "Yicheng Chen",
      "Shilin Xu",
      "Xiangtai Li",
      "Xinjiang Wang",
      "Yining Li",
      "Haian Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]