[
  {
    "id": "arXiv:2201.02615",
    "title": "Posture Prediction for Healthy Sitting using a Smart Chair",
    "abstract": "Poor sitting habits have been identified as a risk factor to musculoskeletal disorders and lower back pain especially on the elderly, disabled people, and office workers. In the current computerized world, even while involved in leisure or work activity, people tend to spend most of their days sitting at computer desks. This can result in spinal pain and related problems. Therefore, a means to remind people about their sitting habits and provide recommendations to counterbalance, such as physical exercise, is important. Posture recognition for seated postures have not received enough attention as most works focus on standing postures. Wearable sensors, pressure or force sensors, videos and images were used for posture recognition in the literature. The aim of this study is to build Machine Learning models for classifying sitting posture of a person by analyzing data collected from a chair platted with two 32 by 32 pressure sensors at its seat and backrest. Models were built using five algorithms: Random Forest (RF), Gaussian Na\\\"ive Bayes, Logistic Regression, Support Vector Machine and Deep Neural Network (DNN). All the models are evaluated using KFold cross-validation technique. This paper presents experiments conducted using the two separate datasets, controlled and realistic, and discusses results achieved at classifying six sitting postures. Average classification accuracies of 98% and 97% were achieved on the controlled and realistic datasets, respectively. ",
    "url": "https://arxiv.org/abs/2201.02615",
    "authors": [
      "Tariku Adane Gelaw",
      "Misgina Tsighe Hagos"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2201.02621",
    "title": "Spatio-Temporal Graph Representation Learning for Fraudster Group  Detection",
    "abstract": "Motivated by potential financial gain, companies may hire fraudster groups to write fake reviews to either demote competitors or promote their own businesses. Such groups are considerably more successful in misleading customers, as people are more likely to be influenced by the opinion of a large group. To detect such groups, a common model is to represent fraudster groups' static networks, consequently overlooking the longitudinal behavior of a reviewer thus the dynamics of co-review relations among reviewers in a group. Hence, these approaches are incapable of excluding outlier reviewers, which are fraudsters intentionally camouflaging themselves in a group and genuine reviewers happen to co-review in fraudster groups. To address this issue, in this work, we propose to first capitalize on the effectiveness of the HIN-RNN in both reviewers' representation learning while capturing the collaboration between reviewers, we first utilize the HIN-RNN to model the co-review relations of reviewers in a group in a fixed time window of 28 days. We refer to this as spatial relation learning representation to signify the generalisability of this work to other networked scenarios. Then we use an RNN on the spatial relations to predict the spatio-temporal relations of reviewers in the group. In the third step, a Graph Convolution Network (GCN) refines the reviewers' vector representations using these predicted relations. These refined representations are then used to remove outlier reviewers. The average of the remaining reviewers' representation is then fed to a simple fully connected layer to predict if the group is a fraudster group or not. Exhaustive experiments of the proposed approach showed a 5% (4%), 12% (5%), 12% (5%) improvement over three of the most recent approaches on precision, recall, and F1-value over the Yelp (Amazon) dataset, respectively. ",
    "url": "https://arxiv.org/abs/2201.02621",
    "authors": [
      "Saeedreza Shehnepoor",
      "Roberto Togneri",
      "Wei Liu",
      "Mohammed Bennamoun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2201.02626",
    "title": "Neighbor2vec: an efficient and effective method for Graph Embedding",
    "abstract": "Graph embedding techniques have led to significant progress in recent years. However, present techniques are not effective enough to capture the patterns of networks. This paper propose neighbor2vec, a neighbor-based sampling strategy used algorithm to learn the neighborhood representations of node, a framework to gather the structure information by feature propagation between the node and its neighbors. We claim that neighbor2vec is a simple and effective approach to enhancing the scalability as well as equality of graph embedding, and it breaks the limits of the existing state-of-the-art unsupervised techniques. We conduct experiments on several node classification and link prediction tasks for networks such as ogbn-arxiv, ogbn-products, ogbn-proteins, ogbl-ppa,ogbl-collab and ogbl-citation2. The result shows that Neighbor2vec's representations provide an average accuracy scores up to 6.8 percent higher than competing methods in node classification tasks and 3.0 percent higher in link prediction tasks. The neighbor2vec's representations are able to outperform all baseline methods and two classical GNN models in all six experiments. ",
    "url": "https://arxiv.org/abs/2201.02626",
    "authors": [
      "Zhiming Lin"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.02639",
    "title": "MERLOT Reserve: Neural Script Knowledge through Vision and Language and  Sound",
    "abstract": "As humans, we navigate the world through all our senses, using perceptual input from each one to correct the others. We introduce MERLOT Reserve, a model that represents videos jointly over time -- through a new training objective that learns from audio, subtitles, and video frames. Given a video, we replace snippets of text and audio with a MASK token; the model learns by choosing the correct masked-out snippet. Our objective learns faster than alternatives, and performs well at scale: we pretrain on 20 million YouTube videos. Empirical results show that MERLOT Reserve learns strong representations about videos through all constituent modalities. When finetuned, it sets a new state-of-the-art on both VCR and TVQA, outperforming prior work by 5% and 7% respectively. Ablations show that both tasks benefit from audio pretraining -- even VCR, a QA task centered around images (without sound). Moreover, our objective enables out-of-the-box prediction, revealing strong multimodal commonsense understanding. In a fully zero-shot setting, our model obtains competitive results on four video understanding tasks, even outperforming supervised approaches on the recently proposed Situated Reasoning (STAR) benchmark. We analyze why incorporating audio leads to better vision-language representations, suggesting significant opportunities for future research. We conclude by discussing ethical and societal implications of multimodal pretraining. ",
    "url": "https://arxiv.org/abs/2201.02639",
    "authors": [
      "Rowan Zellers",
      "Jiasen Lu",
      "Ximing Lu",
      "Youngjae Yu",
      "Yanpeng Zhao",
      "Mohammadreza Salehi",
      "Aditya Kusupati",
      "Jack Hessel",
      "Ali Farhadi",
      "Yejin Choi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2201.02661",
    "title": "Stay Positive: Knowledge Graph Embedding Without Negative Sampling",
    "abstract": "Knowledge graphs (KGs) are typically incomplete and we often wish to infer new facts given the existing ones. This can be thought of as a binary classification problem; we aim to predict if new facts are true or false. Unfortunately, we generally only have positive examples (the known facts) but we also need negative ones to train a classifier. To resolve this, it is usual to generate negative examples using a negative sampling strategy. However, this can produce false negatives which may reduce performance, is computationally expensive, and does not produce calibrated classification probabilities. In this paper, we propose a training procedure that obviates the need for negative sampling by adding a novel regularization term to the loss function. Our results for two relational embedding models (DistMult and SimplE) show the merit of our proposal both in terms of performance and speed. ",
    "url": "https://arxiv.org/abs/2201.02661",
    "authors": [
      "Ainaz Hajimoradlou",
      "Mehran Kazemi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.02665",
    "title": "Detecting CAN Masquerade Attacks with Signal Clustering Similarity",
    "abstract": "Vehicular Controller Area Networks (CANs) are susceptible to cyber attacks of different levels of sophistication. Fabrication attacks are the easiest to administer -- an adversary simply sends (extra) frames on a CAN -- but also the easiest to detect because they disrupt frame frequency. To overcome time-based detection methods, adversaries must administer masquerade attacks by sending frames in lieu of (and therefore at the expected time of) benign frames but with malicious payloads. Research efforts have proven that CAN attacks, and masquerade attacks in particular, can affect vehicle functionality. Examples include causing unintended acceleration, deactivation of vehicle's brakes, as well as steering the vehicle. We hypothesize that masquerade attacks modify the nuanced correlations of CAN signal time series and how they cluster together. Therefore, changes in cluster assignments should indicate anomalous behavior. We confirm this hypothesis by leveraging our previously developed capability for reverse engineering CAN signals (i.e., CAN-D [Controller Area Network Decoder]) and focus on advancing the state of the art for detecting masquerade attacks by analyzing time series extracted from raw CAN frames. Specifically, we demonstrate that masquerade attacks can be detected by computing time series clustering similarity using hierarchical clustering on the vehicle's CAN signals (time series) and comparing the clustering similarity across CAN captures with and without attacks. We test our approach in a previously collected CAN dataset with masquerade attacks (i.e., the ROAD dataset) and develop a forensic tool as a proof of concept to demonstrate the potential of the proposed approach for detecting CAN masquerade attacks. ",
    "url": "https://arxiv.org/abs/2201.02665",
    "authors": [
      "Pablo Moriano",
      "Robert A. Bridges",
      "Michael D. Iannacone"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2201.02693",
    "title": "BottleFit: Learning Compressed Representations in Deep Neural Networks  for Effective and Efficient Split Computing",
    "abstract": "Although mission-critical applications require the use of deep neural networks (DNNs), their continuous execution at mobile devices results in a significant increase in energy consumption. While edge offloading can decrease energy consumption, erratic patterns in channel quality, network and edge server load can lead to severe disruption of the system's key operations. An alternative approach, called split computing, generates compressed representations within the model (called \"bottlenecks\"), to reduce bandwidth usage and energy consumption. Prior work has proposed approaches that introduce additional layers, to the detriment of energy consumption and latency. For this reason, we propose a new framework called BottleFit, which, in addition to targeted DNN architecture modifications, includes a novel training strategy to achieve high accuracy even with strong compression rates. We apply BottleFit on cutting-edge DNN models in image classification, and show that BottleFit achieves 77.1% data compression with up to 0.6% accuracy loss on ImageNet dataset, while state of the art such as SPINN loses up to 6% in accuracy. We experimentally measure the power consumption and latency of an image classification application running on an NVIDIA Jetson Nano board (GPU-based) and a Raspberry PI board (GPU-less). We show that BottleFit decreases power consumption and latency respectively by up to 49% and 89% with respect to (w.r.t.) local computing and by 37% and 55% w.r.t. edge offloading. We also compare BottleFit with state-of-the-art autoencoders-based approaches, and show that (i) BottleFit reduces power consumption and execution time respectively by up to 54% and 44% on the Jetson and 40% and 62% on Raspberry PI; (ii) the size of the head model executed on the mobile device is 83 times smaller. The code repository will be published for full reproducibility of the results. ",
    "url": "https://arxiv.org/abs/2201.02693",
    "authors": [
      "Yoshitomo Matsubara",
      "Davide Callegaro",
      "Sameer Singh",
      "Marco Levorato",
      "Francesco Restuccia"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2201.02697",
    "title": "Embedded Model Predictive Control Using Robust Penalty Method",
    "abstract": "Model predictive control (MPC) has become a hot cake technology for various applications due to its ability to handle multi-input multi-output systems with physical constraints. The optimization solvers require considerable time, limiting their embedded implementation for real-time control. To overcome the bottleneck of traditional quadratic programming (QP) solvers, this paper proposes a robust penalty method (RPM) to solve an optimization problem in a linear MPC. The main idea of RPM is to solve an unconstrained QP problem using Broyden Fletcher Goldfarb Shannon (BFGS) algorithm. The beauty of this method is that it can find optimal solutions even if initial conditions are in an infeasible region, which makes it robust. Moreover, the RPM is computationally inexpensive as compared to the traditional QP solvers. The proposed RPM is implemented on resource-limited embedded hardware (STM32 microcontroller), and its performance is validated with a case study of a citation aircraft control problem. We show the hardware-in-the-loop co-simulation results of the proposed RPM and compared them with the active set method (ASM) and interior point method (IPM) QP solvers. The performance of MPC with the aforementioned solvers is compared by considering the optimality, time complexity, and ease of hardware implementation. Presented results show that the proposed RPM gives the same optimality as ASM and IPM, and outperforms them in terms of speed. ",
    "url": "https://arxiv.org/abs/2201.02697",
    "authors": [
      "Abhijith Sharma",
      "Chaitanya Jugade",
      "Shreya Yawalkar",
      "Vaishali Patne",
      "Deepak Ingole",
      "Dayaram Sonawane"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2201.02711",
    "title": "Block Walsh-Hadamard Transform Based Binary Layers in Deep Neural  Networks",
    "abstract": "Convolution has been the core operation of modern deep neural networks. It is well-known that convolutions can be implemented in the Fourier Transform domain. In this paper, we propose to use binary block Walsh-Hadamard transform (WHT) instead of the Fourier transform. We use WHT-based binary layers to replace some of the regular convolution layers in deep neural networks. We utilize both one-dimensional (1-D) and two-dimensional (2-D) binary WHTs in this paper. In both 1-D and 2-D layers, we compute the binary WHT of the input feature map and denoise the WHT domain coefficients using a nonlinearity which is obtained by combining soft-thresholding with the tanh function. After denoising, we compute the inverse WHT. We use 1D-WHT to replace the $1\\times 1$ convolutional layers, and 2D-WHT layers can replace the 3$\\times$3 convolution layers and Squeeze-and-Excite layers. 2D-WHT layers with trainable weights can be also inserted before the Global Average Pooling (GAP) layers to assist the dense layers. In this way, we can reduce the number of trainable parameters significantly with a slight decrease in trainable parameters. In this paper, we implement the WHT layers into MobileNet-V2, MobileNet-V3-Large, and ResNet to reduce the number of parameters significantly with negligible accuracy loss. Moreover, according to our speed test, the 2D-FWHT layer runs about 24 times as fast as the regular $3\\times 3$ convolution with 19.51\\% less RAM usage in an NVIDIA Jetson Nano experiment. ",
    "url": "https://arxiv.org/abs/2201.02711",
    "authors": [
      "Hongyi Pan",
      "Diaa Badawi",
      "Ahmet Enis Cetin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2201.02712",
    "title": "CONFIDANT: A Privacy Controller for Social Robots",
    "abstract": "As social robots become increasingly prevalent in day-to-day environments, they will participate in conversations and appropriately manage the information shared with them. However, little is known about how robots might appropriately discern the sensitivity of information, which has major implications for human-robot trust. As a first step to address a part of this issue, we designed a privacy controller, CONFIDANT, for conversational social robots, capable of using contextual metadata (e.g., sentiment, relationships, topic) from conversations to model privacy boundaries. Afterwards, we conducted two crowdsourced user studies. The first study (n=174) focused on whether a variety of human-human interaction scenarios were perceived as either private/sensitive or non-private/non-sensitive. The findings from our first study were used to generate association rules. Our second study (n=95) evaluated the effectiveness and accuracy of the privacy controller in human-robot interaction scenarios by comparing a robot that used our privacy controller against a baseline robot with no privacy controls. Our results demonstrate that the robot with the privacy controller outperforms the robot without the privacy controller in privacy-awareness, trustworthiness, and social-awareness. We conclude that the integration of privacy controllers in authentic human-robot conversations can allow for more trustworthy robots. This initial privacy controller will serve as a foundation for more complex solutions. ",
    "url": "https://arxiv.org/abs/2201.02712",
    "authors": [
      "Brian Tang",
      "Dakota Sullivan",
      "Bengisu Cagiltay",
      "Varun Chandrasekaran",
      "Kassem Fawaz",
      "Bilge Mutlu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2201.02728",
    "title": "Automatically layout and visualize the biological pathway map with  spectral graph theory",
    "abstract": "The pathway is a biological term that refers to a series of interactions between molecules in a cell that causes a certain product or a change in the cell. Pathway analysis is a powerful method for gene expression analysis. Through pathway maps, the lists of genes that are differentially expressed across the given phenotypes are translated into various biological phenomena. Visualizing a pathway map manually is a common practice nowadays because of the limitations of existing solutions to draw complicated graphs (i.e. directed graphs, graphs with edge crossings, etc). This project provides a solution to draw pathway maps automatically based on spectral graph theory and topological sort. Various methods are taken to enhance pathway maps' readability. Significant reductions in the number of edge crossings and the sum of adjacent nodes are achieved. ",
    "url": "https://arxiv.org/abs/2201.02728",
    "authors": [
      "Lingran Xiao",
      "Yanfei Wang",
      "Shiying Li",
      "Lingxi Chen",
      "Shuaicheng Li"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2201.02730",
    "title": "AI for Beyond 5G Networks: A Cyber-Security Defense or Offense Enabler?",
    "abstract": "Artificial Intelligence (AI) is envisioned to play a pivotal role in empowering intelligent, adaptive and autonomous security management in 5G and beyond networks, thanks to its potential to uncover hidden patterns from a large set of time-varying multi-dimensional data, and deliver faster and accurate decisions. Unfortunately, AI's capabilities and vulnerabilities make it a double-edged sword that may jeopardize the security of future networks. This paper sheds light on how AI may impact the security of 5G and its successive from its posture of defender, offender or victim, and recommends potential defenses to safeguard from malevolent AI while pointing out their limitations and adoption challenges. ",
    "url": "https://arxiv.org/abs/2201.02730",
    "authors": [
      "C. Benzaid",
      "T. Taleb"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.02733",
    "title": "Testing the Robustness of a BiLSTM-based Structural Story Classifier",
    "abstract": "The growing prevalence of counterfeit stories on the internet has fostered significant interest towards fast and scalable detection of fake news in the machine learning community. While several machine learning techniques for this purpose have emerged, we observe that there is a need to evaluate the impact of noise on these techniques' performance, where noise constitutes news articles being mistakenly labeled as fake (or real). This work takes a step in that direction, where we examine the impact of noise on a state-of-the-art, structural model based on BiLSTM (Bidirectional Long-Short Term Model) for fake news detection, Hierarchical Discourse-level Structure for Fake News Detection by Karimi and Tang (Reference no. 9). ",
    "url": "https://arxiv.org/abs/2201.02733",
    "authors": [
      "Aftab Hussain",
      "Sai Durga Prasad Nanduri",
      "Sneha Seenuvasavarathan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.02757",
    "title": "DeHIN: A Decentralized Framework for Embedding Large-scale Heterogeneous  Information Networks",
    "abstract": "Modeling heterogeneity by extraction and exploitation of high-order information from heterogeneous information networks (HINs) has been attracting immense research attention in recent times. Such heterogeneous network embedding (HNE) methods effectively harness the heterogeneity of small-scale HINs. However, in the real world, the size of HINs grow exponentially with the continuous introduction of new nodes and different types of links, making it a billion-scale network. Learning node embeddings on such HINs creates a performance bottleneck for existing HNE methods that are commonly centralized, i.e., complete data and the model are both on a single machine. To address large-scale HNE tasks with strong efficiency and effectiveness guarantee, we present \\textit{Decentralized Embedding Framework for Heterogeneous Information Network} (DeHIN) in this paper. In DeHIN, we generate a distributed parallel pipeline that utilizes hypergraphs in order to infuse parallelization into the HNE task. DeHIN presents a context preserving partition mechanism that innovatively formulates a large HIN as a hypergraph, whose hyperedges connect semantically similar nodes. Our framework then adopts a decentralized strategy to efficiently partition HINs by adopting a tree-like pipeline. Then, each resulting subnetwork is assigned to a distributed worker, which employs the deep information maximization theorem to locally learn node embeddings from the partition it receives. We further devise a novel embedding alignment scheme to precisely project independently learned node embeddings from all subnetworks onto a common vector space, thus allowing for downstream tasks like link prediction and node classification. ",
    "url": "https://arxiv.org/abs/2201.02757",
    "authors": [
      "Mubashir Imran",
      "Hongzhi Yin",
      "Tong Chen",
      "Zi Huang",
      "Kai Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.02761",
    "title": "Global Convergence Analysis of Deep Linear Networks with A One-neuron  Layer",
    "abstract": "In this paper, we follow Eftekhari's work to give a non-local convergence analysis of deep linear networks. Specifically, we consider optimizing deep linear networks which have a layer with one neuron under quadratic loss. We describe the convergent point of trajectories with arbitrary starting point under gradient flow, including the paths which converge to one of the saddle points or the original point. We also show specific convergence rates of trajectories that converge to the global minimizer by stages. To achieve these results, this paper mainly extends the machinery in Eftekhari's work to provably identify the rank-stable set and the global minimizer convergent set. We also give specific examples to show the necessity of our definitions. Crucially, as far as we know, our results appear to be the first to give a non-local global analysis of linear neural networks from arbitrary initialized points, rather than the lazy training regime which has dominated the literature of neural networks, and restricted benign initialization in Eftekhari's work. We also note that extending our results to general linear networks without one hidden neuron assumption remains a challenging open problem. ",
    "url": "https://arxiv.org/abs/2201.02761",
    "authors": [
      "Kun Chen",
      "Dachao Lin",
      "Zhihua Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.02775",
    "title": "Attacking Vertical Collaborative Learning System Using Adversarial  Dominating Inputs",
    "abstract": "Vertical collaborative learning system also known as vertical federated learning (VFL) system has recently become prominent as a concept to process data distributed across many individual sources without the need to centralize it. Multiple participants collaboratively train models based on their local data in a privacy-preserving manner. To date, VFL has become a de facto solution to securely learn a model among organizations, allowing knowledge to be shared without compromising privacy of any individual organizations. Despite the prosperous development of VFL systems, we find that certain inputs of a participant, named adversarial dominating inputs (ADIs), can dominate the joint inference towards the direction of the adversary's will and force other (victim) participants to make negligible contributions, losing rewards that are usually offered regarding the importance of their contributions in collaborative learning scenarios. We conduct a systematic study on ADIs by first proving their existence in typical VFL systems. We then propose gradient-based methods to synthesize ADIs of various formats and exploit common VFL systems. We further launch greybox fuzz testing, guided by the resiliency score of \"victim\" participants, to perturb adversary-controlled inputs and systematically explore the VFL attack surface in a privacy-preserving manner. We conduct an in-depth study on the influence of critical parameters and settings in synthesizing ADIs. Our study reveals new VFL attack opportunities, promoting the identification of unknown threats before breaches and building more secure VFL systems. ",
    "url": "https://arxiv.org/abs/2201.02775",
    "authors": [
      "Qi Pang",
      "Yuanyuan Yuan",
      "Shuai Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.02779",
    "title": "A Baseline Statistical Method For Robust User-Assisted Multiple  Segmentation",
    "abstract": "Recently, several image segmentation methods that welcome and leverage different types of user assistance have been developed. In these methods, the user inputs can be provided by drawing bounding boxes over image objects, drawing scribbles or planting seeds that help to differentiate between image boundaries or by interactively refining the missegmented image regions. Due to the variety in the types and the amounts of these inputs, relative assessment of different segmentation methods becomes difficult. As a possible solution, we propose a simple yet effective, statistical segmentation method that can handle and utilize different input types and amounts. The proposed method is based on robust hypothesis testing, specifically the DGL test, and can be implemented with time complexity that is linear in the number of pixels and quadratic in the number of image regions. Therefore, it is suitable to be used as a baseline method for quick benchmarking and assessing the relative performance improvements of different types of user-assisted segmentation algorithms. We provide a mathematical analysis on the operation of the proposed method, discuss its capabilities and limitations, provide design guidelines and present simulations that validate its operation. ",
    "url": "https://arxiv.org/abs/2201.02779",
    "authors": [
      "Huseyin Afser"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2201.02783",
    "title": "A Fair and Efficient Hybrid Federated Learning Framework based on  XGBoost for Distributed Power Prediction",
    "abstract": "In a modern power system, real-time data on power generation/consumption and its relevant features are stored in various distributed parties, including household meters, transformer stations and external organizations. To fully exploit the underlying patterns of these distributed data for accurate power prediction, federated learning is needed as a collaborative but privacy-preserving training scheme. However, current federated learning frameworks are polarized towards addressing either the horizontal or vertical separation of data, and tend to overlook the case where both are present. Furthermore, in mainstream horizontal federated learning frameworks, only artificial neural networks are employed to learn the data patterns, which are considered less accurate and interpretable compared to tree-based models on tabular datasets. To this end, we propose a hybrid federated learning framework based on XGBoost, for distributed power prediction from real-time external features. In addition to introducing boosted trees to improve accuracy and interpretability, we combine horizontal and vertical federated learning, to address the scenario where features are scattered in local heterogeneous parties and samples are scattered in various local districts. Moreover, we design a dynamic task allocation scheme such that each party gets a fair share of information, and the computing power of each party can be fully leveraged to boost training efficiency. A follow-up case study is presented to justify the necessity of adopting the proposed framework. The advantages of the proposed framework in fairness, efficiency and accuracy performance are also confirmed. ",
    "url": "https://arxiv.org/abs/2201.02783",
    "authors": [
      "Haizhou Liu",
      "Xuan Zhang",
      "Xinwei Shen",
      "Hongbin Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2201.02791",
    "title": "Scaling Knowledge Graph Embedding Models",
    "abstract": "Developing scalable solutions for training Graph Neural Networks (GNNs) for link prediction tasks is challenging due to the high data dependencies which entail high computational cost and huge memory footprint. We propose a new method for scaling training of knowledge graph embedding models for link prediction to address these challenges. Towards this end, we propose the following algorithmic strategies: self-sufficient partitions, constraint-based negative sampling, and edge mini-batch training. Both, partitioning strategy and constraint-based negative sampling, avoid cross partition data transfer during training. In our experimental evaluation, we show that our scaling solution for GNN-based knowledge graph embedding models achieves a 16x speed up on benchmark datasets while maintaining a comparable model performance as non-distributed methods on standard metrics. ",
    "url": "https://arxiv.org/abs/2201.02791",
    "authors": [
      "Nasrullah Sheikh",
      "Xiao Qin",
      "Berthold Reinwald",
      "Chuan Lei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.02799",
    "title": "Counteracting Dark Web Text-Based CAPTCHA with Generative Adversarial  Learning for Proactive Cyber Threat Intelligence",
    "abstract": "Automated monitoring of dark web (DW) platforms on a large scale is the first step toward developing proactive Cyber Threat Intelligence (CTI). While there are efficient methods for collecting data from the surface web, large-scale dark web data collection is often hindered by anti-crawling measures. In particular, text-based CAPTCHA serves as the most prevalent and prohibiting type of these measures in the dark web. Text-based CAPTCHA identifies and blocks automated crawlers by forcing the user to enter a combination of hard-to-recognize alphanumeric characters. In the dark web, CAPTCHA images are meticulously designed with additional background noise and variable character length to prevent automated CAPTCHA breaking. Existing automated CAPTCHA breaking methods have difficulties in overcoming these dark web challenges. As such, solving dark web text-based CAPTCHA has been relying heavily on human involvement, which is labor-intensive and time-consuming. In this study, we propose a novel framework for automated breaking of dark web CAPTCHA to facilitate dark web data collection. This framework encompasses a novel generative method to recognize dark web text-based CAPTCHA with noisy background and variable character length. To eliminate the need for human involvement, the proposed framework utilizes Generative Adversarial Network (GAN) to counteract dark web background noise and leverages an enhanced character segmentation algorithm to handle CAPTCHA images with variable character length. Our proposed framework, DW-GAN, was systematically evaluated on multiple dark web CAPTCHA testbeds. DW-GAN significantly outperformed the state-of-the-art benchmark methods on all datasets, achieving over 94.4% success rate on a carefully collected real-world dark web dataset... ",
    "url": "https://arxiv.org/abs/2201.02799",
    "authors": [
      "Ning Zhang",
      "Mohammadreza Ebrahimi",
      "Weifeng Li",
      "Hsinchun Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.02805",
    "title": "A novel audio representation using space filling curves",
    "abstract": "Since convolutional neural networks (CNNs) have revolutionized the image processing field, they have been widely applied in the audio context. A common approach is to convert the one-dimensional audio signal time series to two-dimensional images using a time-frequency decomposition method. Also it is common to discard the phase information. In this paper, we propose to map one-dimensional audio waveforms to two-dimensional images using space filling curves (SFCs). These mappings do not compress the input signal, while preserving its local structure. Moreover, the mappings benefit from progress made in deep learning and the large collection of existing computer vision networks. We test eight SFCs on two keyword spotting problems. We show that the Z curve yields the best results due to its shift equivariance under convolution operations. Additionally, the Z curve produces comparable results to the widely used mel frequency cepstral coefficients across multiple CNNs. ",
    "url": "https://arxiv.org/abs/2201.02805",
    "authors": [
      "Alessandro Mari",
      "Arash Salarian"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2201.02822",
    "title": "AnomMAN: Detect Anomaly on Multi-view Attributed Networks",
    "abstract": "Anomaly detection on attributed networks is widely used in web shopping, financial transactions, communication networks, and so on. However, most work tries to detect anomalies on attributed networks only considering a single interaction action, which cannot consider rich kinds of interaction actions in multi-view attributed networks. In fact, it remains a challenging task to consider all different kinds of interaction actions uniformly and detect anomalous instances in multi-view attributed networks. In this paper, we propose a Graph Convolution based framework, AnomMAN, to detect \\textbf{Anom}aly on \\textbf{M}ulti-view \\textbf{A}ttributed \\textbf{N}etworks. To consider the attributes and all interaction actions jointly, we use the attention mechanism to define the importance of all views in networks. Besides, the Graph Convolution operation cannot be simply applied in anomaly detection tasks on account of its low-pass characteristic. Therefore, AnomMAN uses a graph auto-encoder module to overcome the shortcoming and transform it to our strength. According to experiments on real-world datasets, AnomMAN outperforms state-of-the-art models and two variants of our proposed model. Besides, the Accuracy@50 indicator of AnomMAN reaches 1.000 on the dataset, which shows that the top 50 anomalous instances detected by AnomMAN are all anomalous ones. ",
    "url": "https://arxiv.org/abs/2201.02822",
    "authors": [
      "Ling-Hao Chen",
      "He Li",
      "Wenhao Yang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.02830",
    "title": "HFUL: A Hybrid Framework for User Account Linkage across Location-Aware  Social Networks",
    "abstract": "Sources of complementary information are connected when we link user accounts belonging to the same user across different platforms or devices. The expanded information promotes the development of a wide range of applications, such as cross-platform prediction, cross-platform recommendation, and advertisement. Due to the significance of user account linkage and the widespread popularization of GPS-enabled mobile devices, there are increasing research studies on linking user account with spatio-temporal data across location-aware social networks. Being different from most existing studies in this domain that only focus on the effectiveness, we propose a novel framework entitled HFUL (A Hybrid Framework for User Account Linkage across Location-Aware Social Networks), where efficiency, effectiveness, scalability, robustness, and application of user account linkage are considered. Specifically, to improve the efficiency, we develop a comprehensive index structure from the spatio-temporal perspective, and design novel pruning strategies to reduce the search space. To improve the effectiveness, a kernel density estimation-based method has been proposed to alleviate the data sparsity problem in measuring users' similarities. Additionally, we investigate the application of HFUL in terms of user prediction, time prediction, and location prediction. The extensive experiments conducted on three real-world datasets demonstrate the superiority of HFUL in terms of effectiveness, efficiency, scalability, robustness, and application compared with the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2201.02830",
    "authors": [
      "Wei Chen",
      "Weiqing Wang",
      "Hongzhi Yin",
      "Lei Zhao",
      "Xiaofang Zhou"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2201.02836",
    "title": "Self-aligned Spatial Feature Extraction Network for UAV Vehicle  Re-identification",
    "abstract": "Compared with existing vehicle re-identification (ReID) tasks conducted with datasets collected by fixed surveillance cameras, vehicle ReID for unmanned aerial vehicle (UAV) is still under-explored and could be more challenging. Vehicles with the same color and type show extremely similar appearance from the UAV's perspective so that mining fine-grained characteristics becomes necessary. Recent works tend to extract distinguishing information by regional features and component features. The former requires input images to be aligned and the latter entails detailed annotations, both of which are difficult to meet in UAV application. In order to extract efficient fine-grained features and avoid tedious annotating work, this letter develops an unsupervised self-aligned network consisting of three branches. The network introduced a self-alignment module to convert the input images with variable orientations to a uniform orientation, which is implemented under the constraint of triple loss function designed with spatial features. On this basis, spatial features, obtained by vertical and horizontal segmentation methods, and global features are integrated to improve the representation ability in embedded space. Extensive experiments are conducted on UAV-VeID dataset, and our method achieves the best performance compared with recent ReID works. ",
    "url": "https://arxiv.org/abs/2201.02836",
    "authors": [
      "Aihuan Yao",
      "Jiahao Qi",
      "Ping Zhong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.02838",
    "title": "Smart Power Supply for UAV Agility Enhancement Using Deep Neural  Networks",
    "abstract": "Recently unmanned aerial vehicles (UAV) have been widely deployed in various real-world scenarios such as disaster rescue and package delivery. Many of these working environments are unstructured with uncertain and dynamic obstacles. UAV collision frequently happens. An UAV with high agility is highly desired to adjust its motions to adapt to these environmental dynamics. However, UAV agility is restricted by its battery power output; particularly, an UAV's power system cannot be aware of its actual power need in motion planning while the need is dynamically changing as the environment and UAV condition vary. It is difficult to accurately and timely align the power supply with power needs in motion plannings. This mismatching will lead to an insufficient power supply to an UAV and cause delayed motion adjustments, largely increasing the risk of collisions with obstacles and therefore undermine UAV agility. To improve UAV agility, a novel intelligent power solution, Agility-Enhanced Power Supply (AEPS), was developed to proactively prepare appropriate amount powers at the right timing to support motion planning with enhanced agility. This method builds a bridge between the physical power system and UAV planning. With agility-enhanced motion planning, the safety of UAV in complex working environment will be enhanced. To evaluate AEPS effectiveness, missions of \"patrol missions for community security\" with unexpected obstacles were adopted; the power supply is realized by hybrid integration of fuel cell, battery, and capacitor. The effectiveness of AEPS in improving UAV agility was validated by the successful and timely power supply, improved task success rate and system safety, and reduced mission duration. ",
    "url": "https://arxiv.org/abs/2201.02838",
    "authors": [
      "Yanze Liu",
      "Xuhui Chen",
      "Yanhai Du",
      "Rui Liu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2201.02846",
    "title": "Coherence-Based Distributed Document Representation Learning for  Scientific Documents",
    "abstract": "Distributed document representation is one of the basic problems in natural language processing. Currently distributed document representation methods mainly consider the context information of words or sentences. These methods do not take into account the coherence of the document as a whole, e.g., a relation between the paper title and abstract, headline and description, or adjacent bodies in the document. The coherence shows whether a document is meaningful, both logically and syntactically, especially in scientific documents (papers or patents, etc.). In this paper, we propose a coupled text pair embedding (CTPE) model to learn the representation of scientific documents, which maintains the coherence of the document with coupled text pairs formed by segmenting the document. First, we divide the document into two parts (e.g., title and abstract, etc) which construct a coupled text pair. Then, we adopt negative sampling to construct uncoupled text pairs whose two parts are from different documents. Finally, we train the model to judge whether the text pair is coupled or uncoupled and use the obtained embedding of coupled text pairs as the embedding of documents. We perform experiments on three datasets for one information retrieval task and two recommendation tasks. The experimental results verify the effectiveness of the proposed CTPE model. ",
    "url": "https://arxiv.org/abs/2201.02846",
    "authors": [
      "Shicheng Tan",
      "Shu Zhao",
      "Yanping Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2201.02853",
    "title": "Fake Hilsa Fish Detection Using Machine Vision",
    "abstract": "Hilsa is the national fish of Bangladesh. Bangladesh is earning a lot of foreign currency by exporting this fish. Unfortunately, in recent days, some unscrupulous businessmen are selling fake Hilsa fishes to gain profit. The Sardines and Sardinella are the most sold in the market as Hilsa. The government agency of Bangladesh, namely Bangladesh Food Safety Authority said that these fake Hilsa fish contain high levels of cadmium and lead which are detrimental for humans. In this research, we have proposed a method that can readily identify original Hilsa fish and fake Hilsa fish. Based on the research available on online literature, we are the first to do research on identifying original Hilsa fish. We have collected more than 16,000 images of original and counterfeit Hilsa fish. To classify these images, we have used several deep learning-based models. Then, the performance has been compared between them. Among those models, DenseNet201 achieved the highest accuracy of 97.02%. ",
    "url": "https://arxiv.org/abs/2201.02853",
    "authors": [
      "Mirajul Islam",
      "Jannatul Ferdous Ani",
      "Abdur Rahman",
      "Zakia Zaman"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.02863",
    "title": "PocketNN: Integer-only Training and Inference of Neural Networks via  Direct Feedback Alignment and Pocket Activations in Pure C++",
    "abstract": "Standard deep learning algorithms are implemented using floating-point real numbers. This presents an obstacle for implementing them on low-end devices which may not have dedicated floating-point units (FPUs). As a result, researchers in TinyML have considered machine learning algorithms that can train and run a deep neural network (DNN) on a low-end device using integer operations only. In this paper we propose PocketNN, a light and self-contained proof-of-concept framework in pure C++ for the training and inference of DNNs using only integers. Unlike other approaches, PocketNN directly operates on integers without requiring any explicit quantization algorithms or customized fixed-point formats. This was made possible by pocket activations, which are a family of activation functions devised for integer-only DNNs, and an emerging DNN training algorithm called direct feedback alignment (DFA). Unlike the standard backpropagation (BP), DFA trains each layer independently, thus avoiding integer overflow which is a key problem when using BP with integer-only operations. We used PocketNN to train some DNNs on two well-known datasets, MNIST and Fashion-MNIST. Our experiments show that the DNNs trained with our PocketNN achieved 96.98% and 87.7% accuracies on MNIST and Fashion-MNIST datasets, respectively. The accuracies are very close to the equivalent DNNs trained using BP with floating-point real number operations, such that accuracy degradations were just 1.02%p and 2.09%p, respectively. Finally, our PocketNN has high compatibility and portability for low-end devices as it is open source and implemented in pure C++ without any dependencies. ",
    "url": "https://arxiv.org/abs/2201.02863",
    "authors": [
      "Jaewoo Song",
      "Fangzhen Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.02866",
    "title": "Horizontal DPA Attacks against ECC: Impact of Implemented Field  Multiplication Formula",
    "abstract": "Due to the nature of applications such as critical infrastructure and the Internet of Things etc. side channel analysis attacks are becoming a serious threat. Side channel analysis attacks take advantage from the fact that the behavior of crypto implementations can be observed and provides hints that simplify revealing keys. A new type of SCA are the so called horizontal SCAs. Well known randomization based countermeasures are effective means against vertical DPA attacks but they are not effective against horizontal DPA attacks. In this paper we investigate how the formula used to implement the multiplication of $GF(2^n)$-elements influences the results of horizontal DPA attacks against a Montgomery kP implementation. We implemented 5 designs with different partial multipliers, i.e. based on different multiplication formulae. We used two different technologies, i.e. a 130 and a 250 nm technology, to simulate power traces for our analysis. We show that the implemented multiplication formula influences the success of horizontal attacks significantly, but we also learned that its impact differs from technology to technology. Our analysis also reveals that the use of different multiplication formulae as the single countermeasure is not sufficient to protect cryptographic designs against horizontal DPA attacks. ",
    "url": "https://arxiv.org/abs/2201.02866",
    "authors": [
      "Ievgen Kabin",
      "Zoya Dyka",
      "Dan Klann",
      "Peter Langendoerfer"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2201.02868",
    "title": "Horizontal Attacks against ECC: from Simulations to ASIC",
    "abstract": "In this paper we analyse the impact of different compile options on the success rate of side-channel analysis attacks. We run horizontal differential side-channel attacks against simulated power traces for the same $kP$ design synthesized using two different compile options after synthesis and after layout. As we are interested in the effect on the produced ASIC we also run the same attack against measured power traces after manufacturing the ASIC. We found that the compile_ultra option reduces the success rate significantly from 5 key candidates with a correctness of between 75 and 90 per cent down to 3 key candidates with a maximum success rate of 72 per cent compared to the simple compile option. Also the success rate after layout shows a very high correlation with the one obtained attacking the measured power and electromagnetic traces, i.e. the simulations are a good indicator of the resistance of the ASIC. ",
    "url": "https://arxiv.org/abs/2201.02868",
    "authors": [
      "Ievgen Kabin",
      "Zoya Dyka",
      "Dan Klann",
      "Peter Langendoerfer"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2201.02873",
    "title": "LoMar: A Local Defense Against Poisoning Attack on Federated Learning",
    "abstract": "Federated learning (FL) provides a high efficient decentralized machine learning framework, where the training data remains distributed at remote clients in a network. Though FL enables a privacy-preserving mobile edge computing framework using IoT devices, recent studies have shown that this approach is susceptible to poisoning attacks from the side of remote clients. To address the poisoning attacks on FL, we provide a \\textit{two-phase} defense algorithm called {Lo}cal {Ma}licious Facto{r} (LoMar). In phase I, LoMar scores model updates from each remote client by measuring the relative distribution over their neighbors using a kernel density estimation method. In phase II, an optimal threshold is approximated to distinguish malicious and clean updates from a statistical perspective. Comprehensive experiments on four real-world datasets have been conducted, and the experimental results show that our defense strategy can effectively protect the FL system. {Specifically, the defense performance on Amazon dataset under a label-flipping attack indicates that, compared with FG+Krum, LoMar increases the target label testing accuracy from $96.0\\%$ to $98.8\\%$, and the overall averaged testing accuracy from $90.1\\%$ to $97.0\\%$. ",
    "url": "https://arxiv.org/abs/2201.02873",
    "authors": [
      "Xingyu Li",
      "Zhe Qu",
      "Shangqing Zhao",
      "Bo Tang",
      "Zhuo Lu",
      "Yao Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2201.02933",
    "title": "Causal Discovery from Sparse Time-Series Data Using Echo State Network",
    "abstract": "Causal discovery between collections of time-series data can help diagnose causes of symptoms and hopefully prevent faults before they occur. However, reliable causal discovery can be very challenging, especially when the data acquisition rate varies (i.e., non-uniform data sampling), or in the presence of missing data points (e.g., sparse data sampling). To address these issues, we proposed a new system comprised of two parts, the first part fills missing data with a Gaussian Process Regression, and the second part leverages an Echo State Network, which is a type of reservoir computer (i.e., used for chaotic system modeling) for Causal discovery. We evaluate the performance of our proposed system against three other off-the-shelf causal discovery algorithms, namely, structural expectation-maximization, sub-sampled linear auto-regression absolute coefficients, and multivariate Granger Causality with vector auto-regressive using the Tennessee Eastman chemical dataset; we report on their corresponding Matthews Correlation Coefficient(MCC) and Receiver Operating Characteristic curves (ROC) and show that the proposed system outperforms existing algorithms, demonstrating the viability of our approach to discover causal relationships in a complex system with missing entries. ",
    "url": "https://arxiv.org/abs/2201.02933",
    "authors": [
      "Haonan Chen",
      "Bo Yuan Chang",
      "Mohamed A. Naiel1",
      "Georges Younes",
      "Steven Wardell",
      "Stan Kleinikkink",
      "John S. Zelek"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2201.02941",
    "title": "TPAD: Identifying Effective Trajectory Predictions Under the Guidance of  Trajectory Anomaly Detection Model",
    "abstract": "Trajectory Prediction (TP) is an important research topic in computer vision and robotics fields. Recently, many stochastic TP models have been proposed to deal with this problem and have achieved better performance than the traditional models with deterministic trajectory outputs. However, these stochastic models can generate a number of future trajectories with different qualities. They are lack of self-evaluation ability, that is, to examine the rationality of their prediction results, thus failing to guide users to identify high-quality ones from their candidate results. This hinders them from playing their best in real applications. In this paper, we make up for this defect and propose TPAD, a novel TP evaluation method based on the trajectory Anomaly Detection (AD) technique. In TPAD, we firstly combine the Automated Machine Learning (AutoML) technique and the experience in the AD and TP field to automatically design an effective trajectory AD model. Then, we utilize the learned trajectory AD model to examine the rationality of the predicted trajectories, and screen out good TP results for users. Extensive experimental results demonstrate that TPAD can effectively identify near-optimal prediction results, improving stochastic TP models' practical application effect. ",
    "url": "https://arxiv.org/abs/2201.02941",
    "authors": [
      "Chunnan Wang",
      "Chen Liang",
      "Xiang Chen",
      "Hongzhi Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.02942",
    "title": "Fast solver for J2-perturbed Lambert problem using deep neural network",
    "abstract": "This paper presents a novel and fast solver for the J2-perturbed Lambert problem. The solver consists of an intelligent initial guess generator combined with a differential correction procedure. The intelligent initial guess generator is a deep neural network that is trained to correct the initial velocity vector coming from the solution of the unperturbed Lambert problem. The differential correction module takes the initial guess and uses a forward shooting procedure to further update the initial velocity and exactly meet the terminal conditions. Eight sample forms are analyzed and compared to find the optimum form to train the neural network on the J2-perturbed Lambert problem. The accuracy and performance of this novel approach will be demonstrated on a representative test case: the solution of a multi-revolution J2-perturbed Lambert problem in the Jupiter system. We will compare the performance of the proposed approach against a classical standard shooting method and a homotopy-based perturbed Lambert algorithm. It will be shown that, for a comparable level of accuracy, the proposed method is significantly faster than the other two. ",
    "url": "https://arxiv.org/abs/2201.02942",
    "authors": [
      "Bin Yang",
      "Shuang Li",
      "Jinglang Feng",
      "Massimiliano Vasile"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.02944",
    "title": "Adaptive Performance Anomaly Detection for Online Service Systems via  Pattern Sketching",
    "abstract": "To ensure the performance of online service systems, their status is closely monitored with various software and system metrics. Performance anomalies represent the performance degradation issues (e.g., slow response) of the service systems. When performing anomaly detection over the metrics, existing methods often lack the merit of interpretability, which is vital for engineers and analysts to take remediation actions. Moreover, they are unable to effectively accommodate the ever-changing services in an online fashion. To address these limitations, in this paper, we propose ADSketch, an interpretable and adaptive performance anomaly detection approach based on pattern sketching. ADSketch achieves interpretability by identifying groups of anomalous metric patterns, which represent particular types of performance issues. The underlying issues can then be immediately recognized if similar patterns emerge again. In addition, an adaptive learning algorithm is designed to embrace unprecedented patterns induced by service updates. The proposed approach is evaluated with public data as well as industrial data collected from a representative online service system in Huawei Cloud. The experimental results show that ADSketch outperforms state-of-the-art approaches by a significant margin, and demonstrate the effectiveness of the online algorithm in new pattern discovery. Furthermore, our approach has been successfully deployed in industrial practice. ",
    "url": "https://arxiv.org/abs/2201.02944",
    "authors": [
      "Zhuangbin Chen",
      "Jinyang Liu",
      "Yuxin Su",
      "Hongyu Zhang",
      "Xiao Ling",
      "Yongqiang Yang",
      "Michael R. Lyu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2201.02972",
    "title": "Performance Analysis and Power Allocation of Joint Communication and  Sensing Towards Future Communication Networks",
    "abstract": "To mitigate the radar and communication frequency overlapping caused by massive devices access, we propose a novel joint communication and sensing (JCS) system in this paper, where a micro base station (MiBS) can realize target sensing and cooperative communication simultaneously. Concretely, the MiBS, as the sensing equipment, can also serve as a full-duplex (FD) decode-and-forward (DF) relay to assist the end-to-end communication. To further improve the spectrum utilization, non-orthogonal multiple access (NOMA) is adopted such that the communication between the macro base station (MaBS) and the Internet-of-Things (IoT) devices. To facilitate the performance evaluation, the exact and asymptotic outage probabilities, ergodic rates, sensing probability of the system are characterized. Subsequently, two optimal power allocation (OPA) problems of maximizing the received signal-to-interference-plus-noise ratio of sensing signal and maximizing the sum rate for communication are designed that are solved by means of the Lagrangian method and function monotonicity. The simulation results demonstrate that: 1) the proposed JCS NOMA system can accomplish both communication enhancement and sensing function under the premise of the same power consumption as non-cooperative NOMA; 2) the proposed OPA schemes manifest superiorities over a random power allocation scheme. ",
    "url": "https://arxiv.org/abs/2201.02972",
    "authors": [
      "Meng Liu",
      "Minglei Yang",
      "Huifang Li",
      "Kun Zeng",
      "Zhaoming Zhang",
      "Xiancheng Cheng",
      "Arumugam Nallanathan",
      "Derrick Wing Kwan Ng",
      "Guangjian Wang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2201.02978",
    "title": "Auto-Encoder based Co-Training Multi-View Representation Learning",
    "abstract": "Multi-view learning is a learning problem that utilizes the various representations of an object to mine valuable knowledge and improve the performance of learning algorithm, and one of the significant directions of multi-view learning is sub-space learning. As we known, auto-encoder is a method of deep learning, which can learn the latent feature of raw data by reconstructing the input, and based on this, we propose a novel algorithm called Auto-encoder based Co-training Multi-View Learning (ACMVL), which utilizes both complementarity and consistency and finds a joint latent feature representation of multiple views. The algorithm has two stages, the first is to train auto-encoder of each view, and the second stage is to train a supervised network. Interestingly, the two stages share the weights partly and assist each other by co-training process. According to the experimental result, we can learn a well performed latent feature representation, and auto-encoder of each view has more powerful reconstruction ability than traditional auto-encoder. ",
    "url": "https://arxiv.org/abs/2201.02978",
    "authors": [
      "Run-kun Lu",
      "Jian-wei Liu",
      "Yuan-fang Wang",
      "Hao-jie Xie",
      "Xin Zuo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.02986",
    "title": "A Retrospective and Futurespective of Rowhammer Attacks and Defenses on  DRAM",
    "abstract": "Rowhammer has drawn much attention from both academia and industry in the last few years as rowhammer exploitation poses severe consequences to system security. Since the first comprehensive study of rowhammer in 2014, a number of rowhammer attacks have been demonstrated against ubiquitous dynamic random access memory (DRAM)-based commodity systems to cause denial-of-service, gain privilege escalation, leak sensitive information or degrade DNN model inference accuracy. Accordingly, numerous software defenses have been proposed to protect legacy systems while hardware defenses aim to protect next-generation DRAM-based systems. In this paper, we systematize rowhammer attacks and defenses with a focus on DRAM. Particularly, we characterize rowhammer attacks comprehensively, shedding lights on possible new attack vectors that have not yet been explored. We further summarize and classify existing software defenses, from which new defense strategies are identified and worth future exploring. We also categorize proposed hardware defenses from both industry and academia and summarize their limitations. In particular, most industrial solutions have turned out to be ineffective against rowhammer while on-die ECC's susceptibility to rowhammer calls for a comprehensive study. Our work is expected to inspire software-security community to identify new rowhammer attack vectors while present novel defense solutions against them in legacy systems. More importantly, both software and hardware security communities should work together to develop more effective and practical defense solutions. ",
    "url": "https://arxiv.org/abs/2201.02986",
    "authors": [
      "Zhi Zhang",
      "Jiahao Qi",
      "Yueqiang Cheng",
      "Shijie Jiang",
      "Yiyang Lin",
      "Yansong Gao",
      "Surya Nepal",
      "Yi Zou"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2201.02993",
    "title": "Rethink Stealthy Backdoor Attacks in Natural Language Processing",
    "abstract": "Recently, it has been shown that natural language processing (NLP) models are vulnerable to a kind of security threat called the Backdoor Attack, which utilizes a `backdoor trigger' paradigm to mislead the models. The most threatening backdoor attack is the stealthy backdoor, which defines the triggers as text style or syntactic. Although they have achieved an incredible high attack success rate (ASR), we find that the principal factor contributing to their ASR is not the `backdoor trigger' paradigm. Thus the capacity of these stealthy backdoor attacks is overestimated when categorized as backdoor attacks. Therefore, to evaluate the real attack power of backdoor attacks, we propose a new metric called attack successful rate difference (ASRD), which measures the ASR difference between clean state and poison state models. Besides, since the defenses against stealthy backdoor attacks are absent, we propose Trigger Breaker, consisting of two too simple tricks that can defend against stealthy backdoor attacks effectively. Experiments on text classification tasks show that our method achieves significantly better performance than state-of-the-art defense methods against stealthy backdoor attacks. ",
    "url": "https://arxiv.org/abs/2201.02993",
    "authors": [
      "Lingfeng Shen",
      "Haiyun Jiang",
      "Lemao Liu",
      "Shuming Shi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.02997",
    "title": "Performance Analysis of Event-Triggered Consensus Control for  Multi-agent Systems under Cyber-Physical Attacks",
    "abstract": "This work presents a rigorous analysis of the adverse effects of cyber-physical attacks on the performance of multi-agent consensus with event-triggered control protocols. It is shown how a strategic malicious attack on sensors and actuators can deceive the triggering condition of both state-based event-triggered mechanism and combinational state-based event-triggered mechanism, which are commonplace and widely used in the literature. More precisely, it is first shown that a deception attack in the case of combinational state-based event-triggered mechanism can result in a non-triggering misbehavior, in the sense that the compromised agent does not trigger any event and consequently results in partial feedback disconnectivity by preventing information from reaching the local neighbors of the compromised agent. This indicates that the combinational state-based event-triggered mechanism can be leveraged by the attacker to harm the network connectivity by rendering the recent data unavailable to agents. It is then shown that the deception attack in the case of state-based event-triggered mechanism can result in a continuous-triggering misbehavior in the sense that the event-triggered mechanism continuously generates triggering events resulting in undesirable phenomenon of Zeno behavior. Finally, numerical simulations are presented to illustrate the theoretical findings. ",
    "url": "https://arxiv.org/abs/2201.02997",
    "authors": [
      "Majid Mazouchi",
      "Aquib Mustafa",
      "Hamidreza Modares",
      "Christos G. Panayiotou",
      "Marios M. Polycarpou"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2201.03000",
    "title": "Quantum Distributed Algorithms for Detection of Cliques",
    "abstract": "The possibilities offered by quantum computing have drawn attention in the distributed computing community recently, with several breakthrough results showing quantum distributed algorithms that run faster than the fastest known classical counterparts, and even separations between the two models. A prime example is the result by Izumi, Le Gall, and Magniez [STACS 2020], who showed that triangle detection by quantum distributed algorithms is easier than triangle listing, while an analogous result is not known in the classical case. In this paper we present a framework for fast quantum distributed clique detection. This improves upon the state-of-the-art for the triangle case, and is also more general, applying to larger clique sizes. Our main technical contribution is a new approach for detecting cliques by encapsulating this as a search task for nodes that can be added to smaller cliques. To extract the best complexities out of our approach, we develop a framework for nested distributed quantum searches, which employ checking procedures that are quantum themselves. Moreover, we show a circuit-complexity barrier on proving a lower bound of the form $\\Omega(n^{3/5+\\epsilon})$ for $K_p$-detection for any $p \\geq 4$, even in the classical (non-quantum) distributed CONGEST setting. ",
    "url": "https://arxiv.org/abs/2201.03000",
    "authors": [
      "Keren Censor-Hillel",
      "Orr Fischer",
      "François Le Gall",
      "Dean Leitersdorf",
      "Rotem Oshman"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2201.03002",
    "title": "MaskMTL: Attribute prediction in masked facial images with deep  multitask learning",
    "abstract": "Predicting attributes in the landmark free facial images is itself a challenging task which gets further complicated when the face gets occluded due to the usage of masks. Smart access control gates which utilize identity verification or the secure login to personal electronic gadgets may utilize face as a biometric trait. Particularly, the Covid-19 pandemic increasingly validates the essentiality of hygienic and contactless identity verification. In such cases, the usage of masks become more inevitable and performing attribute prediction helps in segregating the target vulnerable groups from community spread or ensuring social distancing for them in a collaborative environment. We create a masked face dataset by efficiently overlaying masks of different shape, size and textures to effectively model variability generated by wearing mask. This paper presents a deep Multi-Task Learning (MTL) approach to jointly estimate various heterogeneous attributes from a single masked facial image. Experimental results on benchmark face attribute UTKFace dataset demonstrate that the proposed approach supersedes in performance to other competing techniques. ",
    "url": "https://arxiv.org/abs/2201.03002",
    "authors": [
      "Prerana Mukherjee",
      "Vinay Kaushik",
      "Ronak Gupta",
      "Ritika Jha",
      "Daneshwari Kankanwadi",
      "Brejesh Lall"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.03004",
    "title": "Privacy-aware Early Detection of COVID-19 through Adversarial Training",
    "abstract": "Early detection of COVID-19 is an ongoing area of research that can help with triage, monitoring and general health assessment of potential patients and may reduce operational strain on hospitals that cope with the coronavirus pandemic. Different machine learning techniques have been used in the literature to detect coronavirus using routine clinical data (blood tests, and vital signs). Data breaches and information leakage when using these models can bring reputational damage and cause legal issues for hospitals. In spite of this, protecting healthcare models against leakage of potentially sensitive information is an understudied research area. In this work, we examine two machine learning approaches, intended to predict a patient's COVID-19 status using routinely collected and readily available clinical data. We employ adversarial training to explore robust deep learning architectures that protect attributes related to demographic information about the patients. The two models we examine in this work are intended to preserve sensitive information against adversarial attacks and information leakage. In a series of experiments using datasets from the Oxford University Hospitals, Bedfordshire Hospitals NHS Foundation Trust, University Hospitals Birmingham NHS Foundation Trust, and Portsmouth Hospitals University NHS Trust we train and test two neural networks that predict PCR test results using information from basic laboratory blood tests, and vital signs performed on a patients' arrival to hospital. We assess the level of privacy each one of the models can provide and show the efficacy and robustness of our proposed architectures against a comparable baseline. One of our main contributions is that we specifically target the development of effective COVID-19 detection models with built-in mechanisms in order to selectively protect sensitive attributes against adversarial attacks. ",
    "url": "https://arxiv.org/abs/2201.03004",
    "authors": [
      "Omid Rohanian",
      "Samaneh Kouchaki",
      "Andrew Soltan",
      "Jenny Yang",
      "Morteza Rohanian",
      "Yang Yang",
      "David Clifton"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2201.03010",
    "title": "Differentially Private Release of Event Logs for Process Mining",
    "abstract": "The applicability of process mining techniques hinges on the availability of event logs capturing the execution of a business process. In some use cases, particularly those involving customer-facing processes, these event logs may contain private information. Data protection regulations restrict the use of such event logs for analysis purposes. One way of circumventing these restrictions is to anonymize the event log to the extent that no individual can be singled out using the anonymized log. This article addresses the problem of anonymizing an event log in order to guarantee that, upon release of the anonymized log, the probability that an attacker may single out any individual represented in the original log does not increase by more than a threshold. The article proposes a differentially private release mechanism, which samples the cases in the log and adds noise to the timestamps to the extent required to achieve the above privacy guarantee. The article reports on an empirical comparison of the proposed approach against the state-of-the-art approaches using 14 real-life event logs in terms of data utility loss and computational efficiency. ",
    "url": "https://arxiv.org/abs/2201.03010",
    "authors": [
      "Gamal Elkoumy",
      "Alisa Pankova",
      "Marlon Dumas"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2201.03014",
    "title": "Glance and Focus Networks for Dynamic Visual Recognition",
    "abstract": "Spatial redundancy widely exists in visual recognition tasks, i.e., discriminative features in an image or video frame usually correspond to only a subset of pixels, while the remaining regions are irrelevant to the task at hand. Therefore, static models which process all the pixels with an equal amount of computation result in considerable redundancy in terms of time and space consumption. In this paper, we formulate the image recognition problem as a sequential coarse-to-fine feature learning process, mimicking the human visual system. Specifically, the proposed Glance and Focus Network (GFNet) first extracts a quick global representation of the input image at a low resolution scale, and then strategically attends to a series of salient (small) regions to learn finer features. The sequential process naturally facilitates adaptive inference at test time, as it can be terminated once the model is sufficiently confident about its prediction, avoiding further redundant computation. It is worth noting that the problem of locating discriminant regions in our model is formulated as a reinforcement learning task, thus requiring no additional manual annotations other than classification labels. GFNet is general and flexible as it is compatible with any off-the-shelf backbone models (such as MobileNets, EfficientNets and TSM), which can be conveniently deployed as the feature extractor. Extensive experiments on a variety of image classification and video recognition tasks and with various backbone models demonstrate the remarkable efficiency of our method. For example, it reduces the average latency of the highly efficient MobileNet-V3 on an iPhone XS Max by 1.3x without sacrificing accuracy. Code and pre-trained models are available at https://github.com/blackfeather-wang/GFNet-Pytorch. ",
    "url": "https://arxiv.org/abs/2201.03014",
    "authors": [
      "Gao Huang",
      "Yulin Wang",
      "Kangchen Lv",
      "Haojun Jiang",
      "Wenhui Huang",
      "Pengfei Qi",
      "Shiji Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03018",
    "title": "Self-Supervised Feature Learning from Partial Point Clouds via Pose  Disentanglement",
    "abstract": "Self-supervised learning on point clouds has gained a lot of attention recently, since it addresses the label-efficiency and domain-gap problems on point cloud tasks. In this paper, we propose a novel self-supervised framework to learn informative representations from partial point clouds. We leverage partial point clouds scanned by LiDAR that contain both content and pose attributes, and we show that disentangling such two factors from partial point clouds enhances feature representation learning. To this end, our framework consists of three main parts: 1) a completion network to capture holistic semantics of point clouds; 2) a pose regression network to understand the viewing angle where partial data is scanned from; 3) a partial reconstruction network to encourage the model to learn content and pose features. To demonstrate the robustness of the learnt feature representations, we conduct several downstream tasks including classification, part segmentation, and registration, with comparisons against state-of-the-art methods. Our method not only outperforms existing self-supervised methods, but also shows a better generalizability across synthetic and real-world datasets. ",
    "url": "https://arxiv.org/abs/2201.03018",
    "authors": [
      "Meng-Shiun Tsai",
      "Pei-Ze Chiang",
      "Yi-Hsuan Tsai",
      "Wei-Chen Chiu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.03019",
    "title": "Robust and Resource-Efficient Data-Free Knowledge Distillation by  Generative Pseudo Replay",
    "abstract": "Data-Free Knowledge Distillation (KD) allows knowledge transfer from a trained neural network (teacher) to a more compact one (student) in the absence of original training data. Existing works use a validation set to monitor the accuracy of the student over real data and report the highest performance throughout the entire process. However, validation data may not be available at distillation time either, making it infeasible to record the student snapshot that achieved the peak accuracy. Therefore, a practical data-free KD method should be robust and ideally provide monotonically increasing student accuracy during distillation. This is challenging because the student experiences knowledge degradation due to the distribution shift of the synthetic data. A straightforward approach to overcome this issue is to store and rehearse the generated samples periodically, which increases the memory footprint and creates privacy concerns. We propose to model the distribution of the previously observed synthetic samples with a generative network. In particular, we design a Variational Autoencoder (VAE) with a training objective that is customized to learn the synthetic data representations optimally. The student is rehearsed by the generative pseudo replay technique, with samples produced by the VAE. Hence knowledge degradation can be prevented without storing any samples. Experiments on image classification benchmarks show that our method optimizes the expected value of the distilled model accuracy while eliminating the large memory overhead incurred by the sample-storing methods. ",
    "url": "https://arxiv.org/abs/2201.03019",
    "authors": [
      "Kuluhan Binici",
      "Shivam Aggarwal",
      "Nam Trung Pham",
      "Karianto Leman",
      "Tulika Mitra"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.03027",
    "title": "Meta-Generalization for Multiparty Privacy Learning to Identify Anomaly  Multimedia Traffic in Graynet",
    "abstract": "Identifying anomaly multimedia traffic in cyberspace is a big challenge in distributed service systems, multiple generation networks and future internet of everything. This letter explores meta-generalization for a multiparty privacy learning model in graynet to improve the performance of anomaly multimedia traffic identification. The multiparty privacy learning model in graynet is a globally shared model that is partitioned, distributed and trained by exchanging multiparty parameters updates with preserving private data. The meta-generalization refers to discovering the inherent attributes of a learning model to reduce its generalization error. In experiments, three meta-generalization principles are tested as follows. The generalization error of the multiparty privacy learning model in graynet is reduced by changing the dimension of byte-level imbedding. Following that, the error is reduced by adapting the depth for extracting packet-level features. Finally, the error is reduced by adjusting the size of support set for preprocessing traffic-level data. Experimental results demonstrate that the proposal outperforms the state-of-the-art learning models for identifying anomaly multimedia traffic. ",
    "url": "https://arxiv.org/abs/2201.03027",
    "authors": [
      "Satoshi Kamo",
      "Yiqiang Sheng"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.03032",
    "title": "Arithmetic Network Coding for Secret Sum Computation",
    "abstract": "We consider a network coding problem where the destination wants to recover the sum of the signals (Gaussian random variables or random finite field elements) at all the source nodes, but the sum must be kept secret from an eavesdropper that can wiretap on a subset of edges. This setting arises naturally in sensor networks and federated learning, where the secrecy of the sum of the signals (e.g. weights, gradients) may be desired. While the case for finite field can be solved, the case for Gaussian random variables is surprisingly difficult. We give a simple conjecture on the necessary and sufficient condition under which such secret computation is possible for the Gaussian case, and prove the conjecture when the number of wiretapped edges is at most 2. ",
    "url": "https://arxiv.org/abs/2201.03032",
    "authors": [
      "Sijie Li",
      "Cheuk Ting Li"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2201.03035",
    "title": "Medication Error Detection Using Contextual Language Models",
    "abstract": "Medication errors most commonly occur at the ordering or prescribing stage, potentially leading to medical complications and poor health outcomes. While it is possible to catch these errors using different techniques; the focus of this work is on textual and contextual analysis of prescription information to detect and prevent potential medication errors. In this paper, we demonstrate how to use BERT-based contextual language models to detect anomalies in written or spoken text based on a data set extracted from real-world medical data of thousands of patient records. The proposed models are able to learn patterns of text dependency and predict erroneous output based on contextual information such as patient data. The experimental results yield accuracy up to 96.63% for text input and up to 79.55% for speech input, which is satisfactory for most real-world applications. ",
    "url": "https://arxiv.org/abs/2201.03035",
    "authors": [
      "Yu Jiang",
      "Christian Poellabauer"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03101",
    "title": "ImageSubject: A Large-scale Dataset for Subject Detection",
    "abstract": "Main subjects usually exist in the images or videos, as they are the objects that the photographer wants to highlight. Human viewers can easily identify them but algorithms often confuse them with other objects. Detecting the main subjects is an important technique to help machines understand the content of images and videos. We present a new dataset with the goal of training models to understand the layout of the objects and the context of the image then to find the main subjects among them. This is achieved in three aspects. By gathering images from movie shots created by directors with professional shooting skills, we collect the dataset with strong diversity, specifically, it contains 107\\,700 images from 21\\,540 movie shots. We labeled them with the bounding box labels for two classes: subject and non-subject foreground object. We present a detailed analysis of the dataset and compare the task with saliency detection and object detection. ImageSubject is the first dataset that tries to localize the subject in an image that the photographer wants to highlight. Moreover, we find the transformer-based detection model offers the best result among other popular model architectures. Finally, we discuss the potential applications and conclude with the importance of the dataset. ",
    "url": "https://arxiv.org/abs/2201.03101",
    "authors": [
      "Xin Miao",
      "Jiayi Liu",
      "Huayan Wang",
      "Jun Fu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.03102",
    "title": "Preserving Domain Private Representation via Mutual Information  Maximization",
    "abstract": "Recent advances in unsupervised domain adaptation have shown that mitigating the domain divergence by extracting the domain-invariant representation could significantly improve the generalization of a model to an unlabeled data domain. Nevertheless, the existing methods fail to effectively preserve the representation that is private to the label-missing domain, which could adversely affect the generalization. In this paper, we propose an approach to preserve such representation so that the latent distribution of the unlabeled domain could represent both the domain-invariant features and the individual characteristics that are private to the unlabeled domain. In particular, we demonstrate that maximizing the mutual information between the unlabeled domain and its latent space while mitigating the domain divergence can achieve such preservation. We also theoretically and empirically validate that preserving the representation that is private to the unlabeled domain is important and of necessity for the cross-domain generalization. Our approach outperforms state-of-the-art methods on several public datasets. ",
    "url": "https://arxiv.org/abs/2201.03102",
    "authors": [
      "Jiahong Chen",
      "Jing Wang",
      "Weipeng Lin",
      "Kuangen Zhang",
      "Clarence W. de Silva"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.03106",
    "title": "Voronoi diagrams for the distributed sensor network system data  processing",
    "abstract": "This article represents the computational model for spacial addresation of the sensors in the dynamically changing real-time internet of things system. The model bases on the Voronoi diagrams as a basic data structure. Problem - the correct data addresation without time delays in real-time processing and database indexation in distributed storages. Goal - to develop the real-time processing model of the object location identification in the Voronoi diagram data structure. Relevance - the research and development on the contemporary issues on the convergence (the N limit up to which the model presents the algorithm convergence), time-delay, correct indexation in the database transactions and adressation throughout wireless radio frequencies in the distribiuted sensor systems. Solution proposes the Voronoi diagram computational geometry data structure and the sweeping curve algorithm. Methods represents the following steps: simulation of the dynamically changing agent system using set of points that are based on a contemporary paths of the public transport routes, bykes, vehicles circulations; 3D map rendering on the SITG Canton of Geneva map; Voronoi diagrams calculation with the Fortune's algorithm. ",
    "url": "https://arxiv.org/abs/2201.03106",
    "authors": [
      "Almagul Kondybayeva",
      "Giovanna Di Marzo"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Geometry (cs.CG)",
      "Databases (cs.DB)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2201.03110",
    "title": "Towards the Next 1000 Languages in Multilingual Machine Translation:  Exploring the Synergy Between Supervised and Self-Supervised Learning",
    "abstract": "Achieving universal translation between all human language pairs is the holy-grail of machine translation (MT) research. While recent progress in massively multilingual MT is one step closer to reaching this goal, it is becoming evident that extending a multilingual MT system simply by training on more parallel data is unscalable, since the availability of labeled data for low-resource and non-English-centric language pairs is forbiddingly limited. To this end, we present a pragmatic approach towards building a multilingual MT model that covers hundreds of languages, using a mixture of supervised and self-supervised objectives, depending on the data availability for different language pairs. We demonstrate that the synergy between these two training paradigms enables the model to produce high-quality translations in the zero-resource setting, even surpassing supervised translation quality for low- and mid-resource languages. We conduct a wide array of experiments to understand the effect of the degree of multilingual supervision, domain mismatches and amounts of parallel and monolingual data on the quality of our self-supervised multilingual models. To demonstrate the scalability of the approach, we train models with over 200 languages and demonstrate high performance on zero-resource translation on several previously under-studied languages. We hope our findings will serve as a stepping stone towards enabling translation for the next thousand languages. ",
    "url": "https://arxiv.org/abs/2201.03110",
    "authors": [
      "Aditya Siddhant",
      "Ankur Bapna",
      "Orhan Firat",
      "Yuan Cao",
      "Mia Xu Chen",
      "Isaac Caswell",
      "Xavier Garcia"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03121",
    "title": "Information-Theoretic Bias Reduction via Causal View of Spurious  Correlation",
    "abstract": "We propose an information-theoretic bias measurement technique through a causal interpretation of spurious correlation, which is effective to identify the feature-level algorithmic bias by taking advantage of conditional mutual information. Although several bias measurement methods have been proposed and widely investigated to achieve algorithmic fairness in various tasks such as face recognition, their accuracy- or logit-based metrics are susceptible to leading to trivial prediction score adjustment rather than fundamental bias reduction. Hence, we design a novel debiasing framework against the algorithmic bias, which incorporates a bias regularization loss derived by the proposed information-theoretic bias measurement approach. In addition, we present a simple yet effective unsupervised debiasing technique based on stochastic label noise, which does not require the explicit supervision of bias information. The proposed bias measurement and debiasing approaches are validated in diverse realistic scenarios through extensive experiments on multiple standard benchmarks. ",
    "url": "https://arxiv.org/abs/2201.03121",
    "authors": [
      "Seonguk Seo",
      "Joon-Young Lee",
      "Bohyung Han"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2201.03134",
    "title": "An Interpretable Federated Learning-based Network Intrusion Detection  Framework",
    "abstract": "Learning-based Network Intrusion Detection Systems (NIDSs) are widely deployed for defending various cyberattacks. Existing learning-based NIDS mainly uses Neural Network (NN) as a classifier that relies on the quality and quantity of cyberattack data. Such NN-based approaches are also hard to interpret for improving efficiency and scalability. In this paper, we design a new local-global computation paradigm, FEDFOREST, a novel learning-based NIDS by combining the interpretable Gradient Boosting Decision Tree (GBDT) and Federated Learning (FL) framework. Specifically, FEDFOREST is composed of multiple clients that extract local cyberattack data features for the server to train models and detect intrusions. A privacy-enhanced technology is also proposed in FEDFOREST to further defeat the privacy of the FL systems. Extensive experiments on 4 cyberattack datasets of different tasks demonstrate that FEDFOREST is effective, efficient, interpretable, and extendable. FEDFOREST ranks first in the collaborative learning and cybersecurity competition 2021 for Chinese college students. ",
    "url": "https://arxiv.org/abs/2201.03134",
    "authors": [
      "Tian Dong",
      "Song Li",
      "Han Qiu",
      "Jialiang Lu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03139",
    "title": "Differentially Private Generative Adversarial Networks with Model  Inversion",
    "abstract": "To protect sensitive data in training a Generative Adversarial Network (GAN), the standard approach is to use differentially private (DP) stochastic gradient descent method in which controlled noise is added to the gradients. The quality of the output synthetic samples can be adversely affected and the training of the network may not even converge in the presence of these noises. We propose Differentially Private Model Inversion (DPMI) method where the private data is first mapped to the latent space via a public generator, followed by a lower-dimensional DP-GAN with better convergent properties. Experimental results on standard datasets CIFAR10 and SVHN as well as on a facial landmark dataset for Autism screening show that our approach outperforms the standard DP-GAN method based on Inception Score, Fr\\'echet Inception Distance, and classification accuracy under the same privacy guarantee. ",
    "url": "https://arxiv.org/abs/2201.03139",
    "authors": [
      "Dongjie Chen",
      "Sen-ching Samson Cheung",
      "Chen-Nee Chuah",
      "Sally Ozonoff"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2201.03142",
    "title": "Deletion to Scattered Graph Classes II -- Improved FPT Algorithms for  Deletion to Pairs of Graph Classes",
    "abstract": "Let $\\Pi$ be a hereditary graph class. The problem of deletion to $\\Pi$, takes as input a graph $G$ and asks for a minimum number (or a fixed integer $k$) of vertices to be deleted from $G$ so that the resulting graph belongs to $\\Pi$. This is a well-studied problem in paradigms including approximation and parameterized complexity. Recently, the study of a natural extension of the problem was initiated where we are given a finite set of hereditary graph classes, and the goal is to determine whether $k$ vertices can be deleted from a given graph so that the connected components of the resulting graph belong to one of the given hereditary graph classes. The problem is shown to be FPT as long as the deletion problem to each of the given hereditary graph classes is fixed-parameter tractable, and the property of being in any of the graph classes is expressible in the counting monodic second order (CMSO) logic. While this was shown using some black box theorems, faster algorithms were shown when each of the hereditary graph classes has a finite forbidden set. In this paper, we do a deep dive on pairs of specific graph classes ($\\Pi_1, \\Pi_2$) in which we would like the connected components of the resulting graph to belong to, and design simpler and more efficient FPT algorithms. We design a general FPT algorithm and approximation algorithm for pairs of graph classes (possibly having infinite forbidden sets) satisfying certain conditions. These algorithms cover several pairs of popular graph classes. Our algorithm makes non-trivial use of the branching technique and as a black box, FPT algorithms for deletion to individual graph classes. ",
    "url": "https://arxiv.org/abs/2201.03142",
    "authors": [
      "Ashwin Jacob",
      "Diptapriyo Majumdar",
      "Venkatesh Raman"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2201.03147",
    "title": "Effective Representation to Capture Collaboration Behaviors between  Explainer and User",
    "abstract": "An explainable AI (XAI) model aims to provide transparency (in the form of justification, explanation, etc) for its predictions or actions made by it. Recently, there has been a lot of focus on building XAI models, especially to provide explanations for understanding and interpreting the predictions made by deep learning models. At UCLA, we propose a generic framework to interact with an XAI model in natural language. ",
    "url": "https://arxiv.org/abs/2201.03147",
    "authors": [
      "Arjun Akula",
      "Song-Chun Zhu"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2201.03158",
    "title": "Collaborative Reflection-Augmented Autoencoder Network for Recommender  Systems",
    "abstract": "As the deep learning techniques have expanded to real-world recommendation tasks, many deep neural network based Collaborative Filtering (CF) models have been developed to project user-item interactions into latent feature space, based on various neural architectures, such as multi-layer perceptron, auto-encoder and graph neural networks. However, the majority of existing collaborative filtering systems are not well designed to handle missing data. Particularly, in order to inject the negative signals in the training phase, these solutions largely rely on negative sampling from unobserved user-item interactions and simply treating them as negative instances, which brings the recommendation performance degradation. To address the issues, we develop a Collaborative Reflection-Augmented Autoencoder Network (CRANet), that is capable of exploring transferable knowledge from observed and unobserved user-item interactions. The network architecture of CRANet is formed of an integrative structure with a reflective receptor network and an information fusion autoencoder module, which endows our recommendation framework with the ability of encoding implicit user's pairwise preference on both interacted and non-interacted items. Additionally, a parametric regularization-based tied-weight scheme is designed to perform robust joint training of the two-stage CRANet model. We finally experimentally validate CRANet on four diverse benchmark datasets corresponding to two recommendation tasks, to show that debiasing the negative signals of user-item interactions improves the performance as compared to various state-of-the-art recommendation techniques. Our source code is available at https://github.com/akaxlh/CRANet. ",
    "url": "https://arxiv.org/abs/2201.03158",
    "authors": [
      "Lianghao Xia",
      "Chao Huang",
      "Yong Xu",
      "Huance Xu",
      "Xiang Li",
      "Weiguo Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03163",
    "title": "Continuous-Curvature Target Tree Algorithm for Path Planning in Complex  Parking Environments",
    "abstract": "Rapidly-exploring random tree (RRT) has been applied for autonomous parking due to quickly solving high-dimensional motion planning and easily reflecting constraints. However, planning time increases by the low probability of extending toward narrow parking spots without collisions. To reduce the planning time, the target tree algorithm was proposed, substituting a parking goal in RRT with a set (target tree) of backward parking paths. However, it consists of circular and straight paths, and an autonomous vehicle cannot park accurately because of curvature-discontinuity. Moreover, the planning time increases in complex environments; backward paths can be blocked by obstacles. Therefore, this paper introduces the continuous-curvature target tree algorithm for complex parking environments. First, a target tree includes clothoid paths to address such curvature-discontinuity. Second, to reduce the planning time further, a cost function is defined to construct a target tree that considers obstacles. Integrated with optimal-variant RRT and searching for the shortest path among the reached backward paths, the proposed algorithm obtains a near-optimal path as the sampling time increases. Experiment results in real environments show that the vehicle more accurately parks, and continuous-curvature paths are obtained more quickly and with higher success rates than those acquired with other sampling-based algorithms. ",
    "url": "https://arxiv.org/abs/2201.03163",
    "authors": [
      "Minsoo Kim",
      "Joonwoo Ahn",
      "Jaeheung Park"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2201.03169",
    "title": "FedDTG:Federated Data-Free Knowledge Distillation via Three-Player  Generative Adversarial Networks",
    "abstract": "Applying knowledge distillation to personalized cross-silo federated learning can well alleviate the problem of user heterogeneity. This approach, however, requires a proxy dataset, which is difficult to obtain in the real world. Moreover, the global model based on parameter averaging will lead to the leakage of user privacy. We introduce a distributed three-player GAN to implement datafree co-distillation between clients. This technique mitigates the user heterogeneity problem and better protects user privacy. We confirmed that thefake samples generated by GAN can make federated distillation more efficient and robust, and the co-distillation can achieve good performance for individual clients on the basis of obtaining global knowledge. Our extensive experiments on benchmark datasets demonstrate the superior generalization performance of the proposed methods, compared with the state-of-the-art. ",
    "url": "https://arxiv.org/abs/2201.03169",
    "authors": [
      "Zhenyuan Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03194",
    "title": "Label Relation Graphs Enhanced Hierarchical Residual Network for  Hierarchical Multi-Granularity Classification",
    "abstract": "Hierarchical multi-granularity classification (HMC) assigns hierarchical multi-granularity labels to each object and focuses on encoding the label hierarchy, e.g., [\"Albatross\", \"Laysan Albatross\"] from coarse-to-fine levels. However, the definition of what is fine-grained is subjective, and the image quality may affect the identification. Thus, samples could be observed at any level of the hierarchy, e.g., [\"Albatross\"] or [\"Albatross\", \"Laysan Albatross\"], and examples discerned at coarse categories are often neglected in the conventional setting of HMC. In this paper, we study the HMC problem in which objects are labeled at any level of the hierarchy. The essential designs of the proposed method are derived from two motivations: (1) learning with objects labeled at various levels should transfer hierarchical knowledge between levels; (2) lower-level classes should inherit attributes related to upper-level superclasses. The proposed combinatorial loss maximizes the marginal probability of the observed ground truth label by aggregating information from related labels defined in the tree hierarchy. If the observed label is at the leaf level, the combinatorial loss further imposes the multi-class cross-entropy loss to increase the weight of fine-grained classification loss. Considering the hierarchical feature interaction, we propose a hierarchical residual network (HRN), in which granularity-specific features from parent levels acting as residual connections are added to features of children levels. Experiments on three commonly used datasets demonstrate the effectiveness of our approach compared to the state-of-the-art HMC approaches and fine-grained visual classification (FGVC) methods exploiting the label hierarchy. ",
    "url": "https://arxiv.org/abs/2201.03194",
    "authors": [
      "Jingzhou Chen",
      "Peng Wang",
      "Jian Liu",
      "Yuntao Qian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.03202",
    "title": "Differentiable and Scalable Generative Adversarial Models for Data  Imputation",
    "abstract": "Data imputation has been extensively explored to solve the missing data problem. The dramatically increasing volume of incomplete data makes the imputation models computationally infeasible in many real-life applications. In this paper, we propose an effective scalable imputation system named SCIS to significantly speed up the training of the differentiable generative adversarial imputation models under accuracy-guarantees for large-scale incomplete data. SCIS consists of two modules, differentiable imputation modeling (DIM) and sample size estimation (SSE). DIM leverages a new masking Sinkhorn divergence function to make an arbitrary generative adversarial imputation model differentiable, while for such a differentiable imputation model, SSE can estimate an appropriate sample size to ensure the user-specified imputation accuracy of the final model. Extensive experiments upon several real-life large-scale datasets demonstrate that, our proposed system can accelerate the generative adversarial model training by 7.1x. Using around 7.6% samples, SCIS yields competitive accuracy with the state-of-the-art imputation methods in a much shorter computation time. ",
    "url": "https://arxiv.org/abs/2201.03202",
    "authors": [
      "Yangyang Wu",
      "Jun Wang",
      "Xiaoye Miao",
      "Wenjia Wang",
      "Jianwei Yin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2201.03209",
    "title": "Energy Efficiency for Proactive Eavesdropping in Cooperative Cognitive  Radio Networks",
    "abstract": "This paper investigates a distant proactive eavesdropping system in cooperative cognitive radio (CR) networks. Specifically, an amplify-and-forward (AF) full-duplex (FD) secondary transmitter assists to relay the received signal from suspicious users to legitimate monitor for wireless information surveillance. In return, the secondary transmitter is granted to share the spectrum belonging to the suspicious users for its own information transmission. To improve the eavesdropping, the transmitted secondary user's signal can also be used as a jamming signal to moderate the data rate of the suspicious link. We consider two cases, i.e., non-negligible processing delay (NNPD) and negligible processing delay (NPD) at secondary transmitter. Our target is to maximize network energy efficiency (NEE) via jointly optimizing the AF relay matrix and precoding vector at the secondary transmitter, as well as the receiver combining vector at monitor, subject to the maximum power constraint at the secondary transmitter and minimum data rate requirement of the secondary user. We also guarantee that the achievable data rate of the eavesdropping link should be no less than that of the suspicious link for efficient surveillance. Due to the non-convexity of the formulated NEE maximization problem, we develop an efficient path-following algorithm and a robust alternating optimization (AO) method as solutions under perfect and imperfect channel state information (CSI) conditions, respectively. We also analyze the convergence and computational complexity of the proposed schemes. Numerical results are provided to validate the effectiveness of our proposed schemes. ",
    "url": "https://arxiv.org/abs/2201.03209",
    "authors": [
      "Yao Ge",
      "P. C. Ching"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2201.03220",
    "title": "An Exact Algorithm for finding Maximum Induced Matching in Subcubic  Graphs",
    "abstract": "The Maximum Induced Matching problem asks to find the maximum $k$ such that, given a graph $G=(V,E)$, can we find a subset of vertices $S$ of size $k$ for which every vertices $v$ in the induced graph $G[S]$ has exactly degree $1$. In this paper, we design an exact algorithm running in $O(1.2630^n)$ time and polynomial space to solve the Maximum Induced Matching problem for graphs where each vertex has degree at most 3. Prior work solved the problem by finding the Maximum Independent Set using polynomial space in the line graph $L(G^2)$; this method uses $O(1.3139^n)$ time. ",
    "url": "https://arxiv.org/abs/2201.03220",
    "authors": [
      "Gordon Hoi",
      "Ammar Fathin Sabili",
      "Frank Stephan"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Logic (math.LO)"
    ]
  },
  {
    "id": "arXiv:2201.03225",
    "title": "Integration of Explainable Artificial Intelligence to Identify  Significant Landslide Causal Factors for Extreme Gradient Boosting based  Landslide Susceptibility Mapping with Improved Feature Selection",
    "abstract": "Landslides have been a regular occurrence and an alarming threat to human life and property in the era of anthropogenic global warming. An early prediction of landslide susceptibility using a data-driven approach is a demand of time. In this study, we explored the eloquent features that best describe landslide susceptibility with state-of-the-art machine learning methods. In our study, we employed state-of-the-art machine learning algorithms including XgBoost, LR, KNN, SVM, Adaboost for landslide susceptibility prediction. To find the best hyperparameters of each individual classifier for optimized performance, we have incorporated the Grid Search method, with 10 Fold Cross-Validation. In this context, the optimized version of XgBoost outperformed all other classifiers with a Cross-validation Weighted F1 score of 94.62%. Followed by this empirical evidence, we explored the XgBoost classifier by incorporating TreeSHAP and identified eloquent features such as SLOPE, ELEVATION, TWI that complement the performance of the XGBoost classifier mostly and features such as LANDUSE, NDVI, SPI which has less effect on models performance. According to the TreeSHAP explanation of features, we selected the 9 most significant landslide causal factors out of 15. Evidently, an optimized version of XgBoost along with feature reduction by 40%, has outperformed all other classifiers in terms of popular evaluation metrics with a Cross-Validation Weighted F1 score of 95.01% on the training and AUC score of 97%. ",
    "url": "https://arxiv.org/abs/2201.03225",
    "authors": [
      "Muhammad Sakib Khan Inan",
      "Istiakur Rahman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03229",
    "title": "Wind Park Power Prediction: Attention-Based Graph Networks and Deep  Learning to Capture Wake Losses",
    "abstract": "With the increased penetration of wind energy into the power grid, it has become increasingly important to be able to predict the expected power production for larger wind farms. Deep learning (DL) models can learn complex patterns in the data and have found wide success in predicting wake losses and expected power production. This paper proposes a modular framework for attention-based graph neural networks (GNN), where attention can be applied to any desired component of a graph block. The results show that the model significantly outperforms a multilayer perceptron (MLP) and a bidirectional LSTM (BLSTM) model, while delivering performance on-par with a vanilla GNN model. Moreover, we argue that the proposed graph attention architecture can easily adapt to different applications by offering flexibility into the desired attention operations to be used, which might depend on the specific application. Through analysis of the attention weights, it was showed that employing attention-based GNNs can provide insights into what the models learn. In particular, the attention networks seemed to realise turbine dependencies that aligned with some physical intuition about wake losses. ",
    "url": "https://arxiv.org/abs/2201.03229",
    "authors": [
      "Lars Ødegaard Bentsen",
      "Narada Dilp Warakagoda",
      "Roy Stenbro",
      "Paal Engelstad"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.03237",
    "title": "Tree-based Search Graph for Approximate Nearest Neighbor Search",
    "abstract": "Nearest neighbor search supports important applications in many domains, such as database, machine learning, computer vision. Since the computational cost for accurate search is too high, the community turned to the research of approximate nearest neighbor search (ANNS). Among them, graph-based algorithm is one of the most important branches. Research by Fu et al. shows that the algorithms based on Monotonic Search Network (MSNET), such as NSG and NSSG, have achieved the state-of-the-art search performance in efficiency. The MSNET is dedicated to achieving monotonic search with minimal out-degree of nodes to pursue high efficiency. However, the current MSNET designs did not optimize the probability of the monotonic search, and the lower bound of the probability is only 50%. If they fail in monotonic search stage, they have to suffer tremendous backtracking cost to achieve the required accuracy. This will cause performance problems in search efficiency. To address this problem, we propose (r,p)-MSNET, which achieves guaranteed probability on monotonic search. Due to the high building complexity of a strict (r,p)-MSNET, we propose TBSG, which is an approximation with low complexity. Experiment conducted on four million-scaled datasets show that TBSG outperforms existing state-of-the-art graph-based algorithms in search efficiency. Our code has been released on Github. ",
    "url": "https://arxiv.org/abs/2201.03237",
    "authors": [
      "Xiaobin Fan",
      "Xiaoping Wang",
      "Kai Lu",
      "Lei Xue",
      "Jinjing Zhao"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2201.03243",
    "title": "Small Object Detection using Deep Learning",
    "abstract": "Now a days, UAVs such as drones are greatly used for various purposes like that of capturing and target detection from ariel imagery etc. Easy access of these small ariel vehicles to public can cause serious security threats. For instance, critical places may be monitored by spies blended in public using drones. Study in hand proposes an improved and efficient Deep Learning based autonomous system which can detect and track very small drones with great precision. The proposed system consists of a custom deep learning model Tiny YOLOv3, one of the flavors of very fast object detection model You Look Only Once (YOLO) is built and used for detection. The object detection algorithm will efficiently the detect the drones. The proposed architecture has shown significantly better performance as compared to the previous YOLO version. The improvement is observed in the terms of resource usage and time complexity. The performance is measured using the metrics of recall and precision that are 93% and 91% respectively. ",
    "url": "https://arxiv.org/abs/2201.03243",
    "authors": [
      "Aleena Ajaz",
      "Ayesha Salar",
      "Tauseef Jamal",
      "Asif Ullah Khan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03244",
    "title": "GridTuner: Reinvestigate Grid Size Selection for Spatiotemporal  Prediction Models [Technical Report]",
    "abstract": "With the development of traffic prediction technology, spatiotemporal prediction models have attracted more and more attention from academia communities and industry. However, most existing researches focus on reducing model's prediction error but ignore the error caused by the uneven distribution of spatial events within a region. In this paper, we study a region partitioning problem, namely optimal grid size selection problem (OGSS), which aims to minimize the real error of spatiotemporal prediction models by selecting the optimal grid size. In order to solve OGSS, we analyze the upper bound of real error of spatiotemporal prediction models and minimize the real error by minimizing its upper bound. Through in-depth analysis, we find that the upper bound of real error will decrease then increase when the number of model grids increase from 1 to the maximum allowed value. Then, we propose two algorithms, namely Ternary Search and Iterative Method, to automatically find the optimal grid size. Finally, the experiments verify that the error of prediction has the same trend as its upper bound, and the change trend of the upper bound of real error with respect to the increase of the number of model grids will decrease then increase. Meanwhile, in a case study, by selecting the optimal grid size, the order dispatching results of a state-of-the-art prediction-based algorithm can be improved up to 13.6%, which shows the effectiveness of our methods on tuning the region partition for spatiotemporal prediction models. ",
    "url": "https://arxiv.org/abs/2201.03244",
    "authors": [
      "Jiabao Jin",
      "Peng Cheng",
      "Lei Chen",
      "Xuemin Lin",
      "Wenjie Zhang"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03246",
    "title": "Vision in adverse weather: Augmentation using CycleGANs with various  object detectors for robust perception in autonomous racing",
    "abstract": "In an autonomous driving system, perception - identification of features and objects from the environment - is crucial. In autonomous racing, high speeds and small margins demand rapid and accurate detection systems. During the race, the weather can change abruptly, causing significant degradation in perception, resulting in ineffective manoeuvres. In order to improve detection in adverse weather, deep-learning-based models typically require extensive datasets captured in such conditions - the collection of which is a tedious, laborious, and costly process. However, recent developments in CycleGAN architectures allow the synthesis of highly realistic scenes in multiple weather conditions. To this end, we introduce an approach of using synthesised adverse condition datasets in autonomous racing (generated using CycleGAN) to improve the performance of four out of five state-of-the-art detectors by an average of 42.7 and 4.4 mAP percentage points in the presence of night-time conditions and droplets, respectively. Furthermore, we present a comparative analysis of five object detectors - identifying the optimal pairing of detector and training data for use during autonomous racing in challenging conditions. ",
    "url": "https://arxiv.org/abs/2201.03246",
    "authors": [
      "Izzeddin Teeti",
      "Valentina Musat",
      "Salman Khan",
      "Alexander Rast",
      "Fabio Cuzzolin",
      "Andrew Bradley"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.03254",
    "title": "Motion Primitives-based Navigation Planning using Deep Collision  Prediction",
    "abstract": "This paper contributes a method to design a novel navigation planner exploiting a learning-based collision prediction network. The neural network is tasked to predict the collision cost of each action sequence in a predefined motion primitives library in the robot's velocity-steering angle space, given only the current depth image and the estimated linear and angular velocities of the robot. Furthermore, we account for the uncertainty of the robot's partial state by utilizing the Unscented Transform and the uncertainty of the neural network model by using Monte Carlo dropout. The uncertainty-aware collision cost is then combined with the goal direction given by a global planner in order to determine the best action sequence to execute in a receding horizon manner. To demonstrate the method, we develop a resilient small flying robot integrating lightweight sensing and computing resources. A set of simulation and experimental studies, including a field deployment, in both cluttered and perceptually-challenging environments is conducted to evaluate the quality of the prediction network and the performance of the proposed planner. ",
    "url": "https://arxiv.org/abs/2201.03254",
    "authors": [
      "Huan Nguyen",
      "Sondre Holm Fyhn",
      "Paolo De Petris",
      "Kostas Alexis"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2201.03269",
    "title": "Neural Networks to solve Partial Differential Equations: a Comparison  with Finite Elements",
    "abstract": "We compare the Finite Element Method (FEM) simulation of a standard Partial Differential Equation thermal problem of a plate with a hole with a Neural Network (NN) simulation. The largest deviation from the true solution obtained from FEM (0.025 for a solution on the order of unity) is easily achieved with NN too without much tuning of the hyperparameters. A higher accuracy value (0.001) instead requires refinement with an alternative optimizer to reach a similar performance with NN. A rough comparison between the Floating Point Operations values, as a machine-independent quantification of the computational performance, suggests a significant difference between FEM and NN in favour of the former. This also strongly holds for computation time: for an accuracy on the order of $10^{-5}$, FEM and NN require 38 and 1100 seconds, respectively. A detailed analysis of the effect of varying different hyperparameters shows that accuracy and computational time only weakly depend on the major part of them. Accuracies below 0.01 cannot be achieved with the \"Adam\" optimizers and it looks as though accuracies below $10^{-5}$ cannot be achieved at all. Training turns to be equally effective when performed on points extracted from the FEM mesh. ",
    "url": "https://arxiv.org/abs/2201.03269",
    "authors": [
      "Andrea Sacchetti",
      "Benjamin Bachmann",
      "Kaspar Löffel",
      "Urs-Martin Künzi",
      "Beatrice Paoli"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2201.03297",
    "title": "GhostNets on Heterogeneous Devices via Cheap Operations",
    "abstract": "Deploying convolutional neural networks (CNNs) on mobile devices is difficult due to the limited memory and computation resources. We aim to design efficient neural networks for heterogeneous devices including CPU and GPU, by exploiting the redundancy in feature maps, which has rarely been investigated in neural architecture design. For CPU-like devices, we propose a novel CPU-efficient Ghost (C-Ghost) module to generate more feature maps from cheap operations. Based on a set of intrinsic feature maps, we apply a series of linear transformations with cheap cost to generate many ghost feature maps that could fully reveal information underlying intrinsic features. The proposed C-Ghost module can be taken as a plug-and-play component to upgrade existing convolutional neural networks. C-Ghost bottlenecks are designed to stack C-Ghost modules, and then the lightweight C-GhostNet can be easily established. We further consider the efficient networks for GPU devices. Without involving too many GPU-inefficient operations (e.g.,, depth-wise convolution) in a building stage, we propose to utilize the stage-wise feature redundancy to formulate GPU-efficient Ghost (G-Ghost) stage structure. The features in a stage are split into two parts where the first part is processed using the original block with fewer output channels for generating intrinsic features, and the other are generated using cheap operations by exploiting stage-wise redundancy. Experiments conducted on benchmarks demonstrate the effectiveness of the proposed C-Ghost module and the G-Ghost stage. C-GhostNet and G-GhostNet can achieve the optimal trade-off of accuracy and latency for CPU and GPU, respectively. Code is available at https://github.com/huawei-noah/CV-Backbones. ",
    "url": "https://arxiv.org/abs/2201.03297",
    "authors": [
      "Kai Han",
      "Yunhe Wang",
      "Chang Xu",
      "Jianyuan Guo",
      "Chunjing Xu",
      "Enhua Wu",
      "Qi Tian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.03299",
    "title": "Avoiding Overfitting: A Survey on Regularization Methods for  Convolutional Neural Networks",
    "abstract": "Several image processing tasks, such as image classification and object detection, have been significantly improved using Convolutional Neural Networks (CNN). Like ResNet and EfficientNet, many architectures have achieved outstanding results in at least one dataset by the time of their creation. A critical factor in training concerns the network's regularization, which prevents the structure from overfitting. This work analyzes several regularization methods developed in the last few years, showing significant improvements for different CNN models. The works are classified into three main areas: the first one is called \"data augmentation\", where all the techniques focus on performing changes in the input data. The second, named \"internal changes\", which aims to describe procedures to modify the feature maps generated by the neural network or the kernels. The last one, called \"label\", concerns transforming the labels of a given input. This work presents two main differences comparing to other available surveys about regularization: (i) the first concerns the papers gathered in the manuscript, which are not older than five years, and (ii) the second distinction is about reproducibility, i.e., all works refered here have their code available in public repositories or they have been directly implemented in some framework, such as TensorFlow or Torch. ",
    "url": "https://arxiv.org/abs/2201.03299",
    "authors": [
      "Claudio Filipi Gonçalves dos Santos",
      "João Paulo Papa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03308",
    "title": "Physics-Guided Neural Networks for Feedforward Control: An Orthogonal  Projection-Based Approach",
    "abstract": "Unknown nonlinear dynamics can limit the performance of model-based feedforward control. The aim of this paper is to develop a feedforward control framework for systems with unknown, typically nonlinear, dynamics. To address the unknown dynamics, a physics-based feedforward model is complemented by a neural network. The neural network output in the subspace of the model is penalized through orthogonal projection. This results in uniquely identifiable model coefficients, enabling both increased performance and good generalization. The feedforward control framework is validated on a representative system with performance limiting nonlinear friction characteristics. ",
    "url": "https://arxiv.org/abs/2201.03308",
    "authors": [
      "Johan Kon",
      "Dennis Bruijnen",
      "Jeroen van de Wijdeven",
      "Marcel Heertjes",
      "Tom Oomen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2201.03318",
    "title": "Detours in Directed Graphs",
    "abstract": "We study two \"above guarantee\" versions of the classical Longest Path problem on undirected and directed graphs and obtain the following results. In the first variant of Longest Path that we study, called Longest Detour, the task is to decide whether a graph has an (s,t)-path of length at least dist_G(s,t)+k (where dist_G(s,t) denotes the length of a shortest path from s to t). Bez\\'akov\\'a et al. proved that on undirected graphs the problem is fixed-parameter tractable (FPT) by providing an algorithm of running time 2^{O (k)} n. Further, they left the parameterized complexity of the problem on directed graphs open. Our first main result establishes a connection between Longest Detour on directed graphs and 3-Disjoint Paths on directed graphs. Using these new insights, we design a 2^{O(k)} n^{O(1)} time algorithm for the problem on directed planar graphs. Further, the new approach yields a significantly faster FPT algorithm on undirected graphs. In the second variant of Longest Path, namely Longest Path Above Diameter, the task is to decide whether the graph has a path of length at least diam(G)+k (diam(G) denotes the length of a longest shortest path in a graph G). We obtain dichotomy results about Longest Path Above Diameter on undirected and directed graphs. For (un)directed graphs, Longest Path Above Diameter is NP-complete even for k=1. However, if the input undirected graph is 2-connected, then the problem is FPT. On the other hand, for 2-connected directed graphs, we show that Longest Path Above Diameter is solvable in polynomial time for each k\\in{1,\\dots, 4} and is NP-complete for every k\\geq 5. The parameterized complexity of Longest Path Above Diameter on general directed graphs remains an interesting open problem. ",
    "url": "https://arxiv.org/abs/2201.03318",
    "authors": [
      "Fedor V. Fomin",
      "Petr A. Golovach",
      "William Lochet",
      "Danil Sagunov",
      "Kirill Simonov",
      "Saket Saurabh"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2201.03326",
    "title": "Graph Representation Learning for Multi-Task Settings: a Meta-Learning  Approach",
    "abstract": "Graph Neural Networks (GNNs) have become the state-of-the-art method for many applications on graph structured data. GNNs are a framework for graph representation learning, where a model learns to generate low dimensional node embeddings that encapsulate structural and feature-related information. GNNs are usually trained in an end-to-end fashion, leading to highly specialized node embeddings. While this approach achieves great results in the single-task setting, generating node embeddings that can be used to perform multiple tasks (with performance comparable to single-task models) is still an open problem. We propose a novel training strategy for graph representation learning, based on meta-learning, which allows the training of a GNN model capable of producing multi-task node embeddings. Our method avoids the difficulties arising when learning to perform multiple tasks concurrently by, instead, learning to quickly (i.e. with a few steps of gradient descent) adapt to multiple tasks singularly. We show that the embeddings produced by a model trained with our method can be used to perform multiple tasks with comparable or, surprisingly, even higher performance than both single-task and multi-task end-to-end models. ",
    "url": "https://arxiv.org/abs/2201.03326",
    "authors": [
      "Davide Buffelli",
      "Fabio Vandin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03330",
    "title": "Social Media Networks Attacks and their Preventive Mechanisms: A Review",
    "abstract": "We live in a virtual world where actual lifestyles are replicated. The growing reliance on the use of social media networks worldwide has resulted in great concern for information security. One of the factors popularizing the social media platforms is how they connect people worldwide to interact, share content, and engage in mutual interactions of common interest that cut across geographical boundaries. Behind all these incredible gains are digital crime equivalence that threatens the physical socialization. Criminal-minded elements and hackers are exploiting Social Media Platforms (SMP) for many nefarious activities to harm others. As detection tools are developed to control these crimes, hackers' tactics and techniques are constantly evolving. Hackers are constantly developing new attacking tools and hacking strategies to gain malicious access to systems and attack social media network thereby making it difficult for security administrators and organizations to develop and implement the proper policies and procedures necessary to prevent the hackers' attacks. The increase in cyber-attacks on the social media platforms calls for urgent and more intelligent security measures to enhance the effectiveness of social media platforms. This paper explores the mode and tactics of hackers' mode of attacks on social media and ways of preventing their activities against users to ensure secure social cyberspace and enhance virtual socialization. Social media platforms are briefly categorized, the various types of attacks are also highlighted with current state-of-the-art preventive mechanisms to overcome the attacks as proposed in research works, finally, social media intrusion detection mechanism is suggested as a second line of defense to combat cybercrime on social media networks ",
    "url": "https://arxiv.org/abs/2201.03330",
    "authors": [
      "Emmanuel Etuh",
      "Francis S. Bakpo",
      "Eneh Agozie H"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2201.03331",
    "title": "Fiuncho: a program for any-order epistasis detection in CPU clusters",
    "abstract": "Epistasis can be defined as the statistical interaction of genes during the expression of a phenotype. It is believed that it plays a fundamental role in gene expression, as individual genetic variants have reported a very small increase in disease risk in previous Genome-Wide Association Studies. The most successful approach to epistasis detection is the exhaustive method, although its exponential time complexity requires a highly parallel implementation in order to be used. This work presents Fiuncho, a program that exploits all levels of parallelism present in \\textit{x86\\textunderscore 64} CPU clusters in order to mitigate the complexity of this approach. It supports epistasis interactions of any order, and when compared with other exhaustive methods, it is on average 242, 7 and 3 times faster than MDR, BitEpi and MPI3SNP, respectively. ",
    "url": "https://arxiv.org/abs/2201.03331",
    "authors": [
      "Christian Ponte-Fernández",
      "Jorge González Domínguez",
      "María J. Martín"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2201.03340",
    "title": "Cross-view Self-Supervised Learning on Heterogeneous Graph Neural  Network via Bootstrapping",
    "abstract": "Heterogeneous graph neural networks can represent information of heterogeneous graphs with excellent ability. Recently, self-supervised learning manner is researched which learns the unique expression of a graph through a contrastive learning method. In the absence of labels, this learning methods show great potential. However, contrastive learning relies heavily on positive and negative pairs, and generating high-quality pairs from heterogeneous graphs is difficult. In this paper, in line with recent innovations in self-supervised learning, we introduce a that can generate good representations without generating large number of pairs. In addition, paying attention to the fact that heterogeneous graphs can be viewed from two perspectives in this process, high-level expressions in the graphs are captured and expressed. The proposed model showed state-of-the-art performance than other methods in various real world datasets. ",
    "url": "https://arxiv.org/abs/2201.03340",
    "authors": [
      "Minjae Park"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.03346",
    "title": "Better Modeling the Programming World with Code Concept Graphs-augmented  Multi-modal Learning",
    "abstract": "The progress made in code modeling has been tremendous in recent years thanks to the design of natural language processing learning approaches based on state-of-the-art model architectures. Nevertheless, we believe that the current state-of-the-art does not focus enough on the full potential that data may bring to a learning process in software engineering. Our vision articulates on the idea of leveraging multi-modal learning approaches to modeling the programming world. In this paper, we investigate one of the underlying idea of our vision whose objective based on concept graphs of identifiers aims at leveraging high-level relationships between domain concepts manipulated through particular language constructs. In particular, we propose to enhance an existing pretrained language model of code by joint-learning it with a graph neural network based on our concept graphs. We conducted a preliminary evaluation that shows gain of effectiveness of the models for code search using a simple joint-learning method and prompts us to further investigate our research vision. ",
    "url": "https://arxiv.org/abs/2201.03346",
    "authors": [
      "Martin Weyssow",
      "Houari Sahraoui",
      "Bang Liu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Information Retrieval (cs.IR)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2201.03353",
    "title": "GMFIM: A Generative Mask-guided Facial Image Manipulation Model for  Privacy Preservation",
    "abstract": "The use of social media websites and applications has become very popular and people share their photos on these networks. Automatic recognition and tagging of people's photos on these networks has raised privacy preservation issues and users seek methods for hiding their identities from these algorithms. Generative adversarial networks (GANs) are shown to be very powerful in generating face images in high diversity and also in editing face images. In this paper, we propose a Generative Mask-guided Face Image Manipulation (GMFIM) model based on GANs to apply imperceptible editing to the input face image to preserve the privacy of the person in the image. Our model consists of three main components: a) the face mask module to cut the face area out of the input image and omit the background, b) the GAN-based optimization module for manipulating the face image and hiding the identity and, c) the merge module for combining the background of the input image and the manipulated de-identified face image. Different criteria are considered in the loss function of the optimization step to produce high-quality images that are as similar as possible to the input image while they cannot be recognized by AFR systems. The results of the experiments on different datasets show that our model can achieve better performance against automated face recognition systems in comparison to the state-of-the-art methods and it catches a higher attack success rate in most experiments from a total of 18. Moreover, the generated images of our proposed model have the highest quality and are more pleasing to human eyes. ",
    "url": "https://arxiv.org/abs/2201.03353",
    "authors": [
      "Mohammad Hossein Khojaste",
      "Nastaran Moradzadeh Farid",
      "Ahmad Nickabadi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.03356",
    "title": "Continual Learning of Long Topic Sequences in Neural Information  Retrieval",
    "abstract": "In information retrieval (IR) systems, trends and users' interests may change over time, altering either the distribution of requests or contents to be recommended. Since neural ranking approaches heavily depend on the training data, it is crucial to understand the transfer capacity of recent IR approaches to address new domains in the long term. In this paper, we first propose a dataset based upon the MSMarco corpus aiming at modeling a long stream of topics as well as IR property-driven controlled settings. We then in-depth analyze the ability of recent neural IR models while continually learning those streams. Our empirical study highlights in which particular cases catastrophic forgetting occurs (e.g., level of similarity between tasks, peculiarities on text length, and ways of learning models) to provide future directions in terms of model design. ",
    "url": "https://arxiv.org/abs/2201.03356",
    "authors": [
      "Thomas Gerald",
      "Laure Soulier"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03370",
    "title": "Spectrum Sharing for Secrecy Performance Enhancement in D2D-enabled UAV  Networks",
    "abstract": "With the assistance of device-to-device (D2D) communications, unmanned aerial vehicle (UAV) networks are anticipated to support widespread applications in the fifth generation (5G) and beyond wireless systems, by providing seamless coverage, flexible deployment, and high channel rate. However, the networks face significant security threats from malicious eavesdroppers due to the inherent broadcast and openness nature of wireless channels. To ensure secure communications of such networks, physical layer security is a promising technique, which utilizes the randomness and noise of wireless channels to enhance secrecy performance. This article investigates physical layer security performance via spectrum sharing in D2D-enabled UAV networks. We first present two typical network architectures where each UAV serves as either a flying base station or an aerial user equipment. Then, we propose a spectrum sharing strategy to fully exploit interference incurred by spectrum reuse for improving secrecy performance. We further conduct two case studies to evaluate the spectrum sharing strategy in these two typical network architectures, and also show secrecy performance gains compared to traditional spectrum sharing strategy. Finally, we discuss some future research directions in D2D-enabled UAV networks. ",
    "url": "https://arxiv.org/abs/2201.03370",
    "authors": [
      "B. Yang",
      "T. Taleb",
      "Z. Wu",
      "L. Ma"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2201.03386",
    "title": "Sub-mW Keyword Spotting on an MCU: Analog Binary Feature Extraction and  Binary Neural Networks",
    "abstract": "Keyword spotting (KWS) is a crucial function enabling the interaction with the many ubiquitous smart devices in our surroundings, either activating them through wake-word or directly as a human-computer interface. For many applications, KWS is the entry point for our interactions with the device and, thus, an always-on workload. Many smart devices are mobile and their battery lifetime is heavily impacted by continuously running services. KWS and similar always-on services are thus the focus when optimizing the overall power consumption. This work addresses KWS energy-efficiency on low-cost microcontroller units (MCUs). We combine analog binary feature extraction with binary neural networks. By replacing the digital preprocessing with the proposed analog front-end, we show that the energy required for data acquisition and preprocessing can be reduced by 29x, cutting its share from a dominating 85% to a mere 16% of the overall energy consumption for our reference KWS application. Experimental evaluations on the Speech Commands Dataset show that the proposed system outperforms state-of-the-art accuracy and energy efficiency, respectively, by 1% and 4.3x on a 10-class dataset while providing a compelling accuracy-energy trade-off including a 2% accuracy drop for a 71x energy reduction. ",
    "url": "https://arxiv.org/abs/2201.03386",
    "authors": [
      "Gianmarco Cerutti",
      "Lukas Cavigelli",
      "Renzo Andri",
      "Michele Magno",
      "Elisabetta Farella",
      "Luca Benini"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2201.03401",
    "title": "An Example of Privacy and Data Protection Best Practices for Biometrics  Data Processing in Border Control: Lesson Learned from SMILE",
    "abstract": "Biometric recognition is a highly adopted technology to support different kinds of applications, ranging from security and access control applications to low enforcement applications. However, such systems raise serious privacy and data protection concerns. Misuse of data, compromising the privacy of individuals and/or authorized processing of data may be irreversible and could have severe consequences on the individual's rights to privacy and data protection. This is partly due to the lack of methods and guidance for the integration of data protection and privacy by design in the system development process. In this paper, we present an example of privacy and data protection best practices to provide more guidance for data controllers and developers on how to comply with the legal obligation for data protection. These privacy and data protection best practices and considerations are based on the lessons learned from the SMart mobILity at the European land borders (SMILE) project. ",
    "url": "https://arxiv.org/abs/2201.03401",
    "authors": [
      "Mohamed Abomhara",
      "Sule Yildirim Yayilgan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2201.03410",
    "title": "Border Control and Use of Biometrics: Reasons Why the Right to Privacy  Can Not Be Absolute",
    "abstract": "This paper discusses concerns pertaining to the absoluteness of the right to privacy regarding the use of biometric data for border control. The discussion explains why privacy cannot be absolute from different points of view, including privacy versus national security, privacy properties conflicting with border risk analysis, and Privacy by Design (PbD) and engineering design challenges. ",
    "url": "https://arxiv.org/abs/2201.03410",
    "authors": [
      "Mohamed Abomhara",
      "Sule Yildirim Yayilgan",
      "Marina Shalaginova",
      "Zoltan Szekely"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2201.03423",
    "title": "A Survey of Plagiarism Detection Systems: Case of Use with English,  French and Arabic Languages",
    "abstract": "In academia, plagiarism is certainly not an emerging concern, but it became of a greater magnitude with the popularisation of the Internet and the ease of access to a worldwide source of content, rendering human-only intervention insufficient. Despite that, plagiarism is far from being an unaddressed problem, as computer-assisted plagiarism detection is currently an active area of research that falls within the field of Information Retrieval (IR) and Natural Language Processing (NLP). Many software solutions emerged to help fulfil this task, and this paper presents an overview of plagiarism detection systems for use in Arabic, French, and English academic and educational settings. The comparison was held between eight systems and was performed with respect to their features, usability, technical aspects, as well as their performance in detecting three levels of obfuscation from different sources: verbatim, paraphrase, and cross-language plagiarism. An indepth examination of technical forms of plagiarism was also performed in the context of this study. In addition, a survey of plagiarism typologies and classifications proposed by different authors is provided. ",
    "url": "https://arxiv.org/abs/2201.03423",
    "authors": [
      "Mehdi Abdelhamid",
      "Faical Azouaou",
      "Sofiane Batata"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2201.03450",
    "title": "Leveraging Social Influence based on Users Activity Centers for  Point-of-Interest Recommendation",
    "abstract": "Recommender Systems (RSs) aim to model and predict the user preference while interacting with items, such as Points of Interest (POIs). These systems face several challenges, such as data sparsity, limiting their effectiveness. In this paper, we address this problem by incorporating social, geographical, and temporal information into the Matrix Factorization (MF) technique. To this end, we model social influence based on two factors: similarities between users in terms of common check-ins and the friendships between them. We introduce two levels of friendship based on explicit friendship networks and high check-in overlap between users. We base our friendship algorithm on users' geographical activity centers. The results show that our proposed model outperforms the state-of-the-art on two real-world datasets. More specifically, our ablation study shows that the social model improves the performance of our proposed POI recommendation system by 31% and 14% on the Gowalla and Yelp datasets in terms of Precision@10, respectively. ",
    "url": "https://arxiv.org/abs/2201.03450",
    "authors": [
      "Kosar Seyedhoseinzadeh",
      "Hossein A. Rahmani",
      "Mohsen Afsharchi",
      "Mohammad Aliannejadi"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.03454",
    "title": "3D Face Morphing Attacks: Generation, Vulnerability and Detection",
    "abstract": "Face Recognition systems (FRS) have been found vulnerable to morphing attacks, where the morphed face image is generated by blending the face images from contributory data subjects. This work presents a novel direction towards generating face morphing attacks in 3D. To this extent, we have introduced a novel approach based on blending the 3D face point clouds corresponding to the contributory data subjects. The proposed method will generate the 3D face morphing by projecting the input 3D face point clouds to depth-maps \\& 2D color images followed by the image blending and wrapping operations performed independently on the color images and depth maps. We then back-project the 2D morphing color-map and the depth-map to the point cloud using the canonical (fixed) view. Given that the generated 3D face morphing models will result in the holes due to a single canonical view, we have proposed a new algorithm for hole filling that will result in a high-quality 3D face morphing model. Extensive experiments are carried out on the newly generated 3D face dataset comprised of 675 3D scans corresponding to 41 unique data subjects. Experiments are performed to benchmark the vulnerability of automatic 2D and 3D FRS and human observer analysis. We also present the quantitative assessment of the quality of the generated 3D face morphing models using eight different quality metrics. Finally, we have proposed three different 3D face Morphing Attack Detection (3D-MAD) algorithms to benchmark the performance of the 3D MAD algorithms. ",
    "url": "https://arxiv.org/abs/2201.03454",
    "authors": [
      "Jag Mohan Singh",
      "Raghavendra Ramachandra"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.03468",
    "title": "Protocolo de Revisão Sistemática da Literatura para Wireless Mesh  Networks com mecanismos de incentivo financeiro",
    "abstract": "The objective of this systematic review is to assess the state of the art on routing protocols aimed at WMNs, when associated with mechanisms for financial incentives that aim to ensure the self-sustainability of the network, seeking to identify the improvements and associated risks as well as the efficiency of the mechanisms adopted within networks, thus ensuring increased reliability in the use of such protocols for routing encouraged WMNs. ",
    "url": "https://arxiv.org/abs/2201.03468",
    "authors": [
      "Rodolfo B. S. Carvalho"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.03470",
    "title": "Latency in Mesh Networks",
    "abstract": "In this work, we consider latency in wireless networks, motivated by the need for reliable and low-latency wireless communication for applications such as vehicle-to-vehicle communication and industrial automation. The environment that these applications operate in is often highly dynamic, and, as a result, the wireless network technology used needs to be able to adapt to changing conditions, which makes mesh networking a good fit. Hence, in this work, we consider Thread and Bluetooth Mesh, two prominent mesh networking technologies. We measure one-way point-to-point latency using these technologies and show the cumulative probability distribution of the latency for varying payload size. We carry out the measurements under static conditions in an open-air environment. Our results show that Thread achieves lower latency than Bluetooth Mesh, especially for larger payloads. Furthermore, we show that Thread meets some of the latency targets set out for 5G. However, since Thread networks are slow to adapt to network changes, Thread may still not be suitable for application requiring low latency. Bluetooth mesh, on the other hand, does not meet any of the latency targets, although it is close when the payload is small (less than 11 bytes). Overall, there needs to be further optimization before these technologies can be used for reliable and low-latency communication in dynamic environments. ",
    "url": "https://arxiv.org/abs/2201.03470",
    "authors": [
      "Joakim Algrøy"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.03482",
    "title": "Disentangled Graph Neural Networks for Session-based Recommendation",
    "abstract": "Session-based recommendation (SBR) has drawn increasingly research attention in recent years, due to its great practical value by only exploiting the limited user behavior history in the current session. Existing methods typically learn the session embedding at the item level, namely, aggregating the embeddings of items with or without the attention weights assigned to items. However, they ignore the fact that a user's intent on adopting an item is driven by certain factors of the item (e.g., the leading actors of an movie). In other words, they have not explored finer-granularity interests of users at the factor level to generate the session embedding, leading to sub-optimal performance. To address the problem, we propose a novel method called Disentangled Graph Neural Network (Disen-GNN) to capture the session purpose with the consideration of factor-level attention on each item. Specifically, we first employ the disentangled learning technique to cast item embeddings into the embedding of multiple factors, and then use the gated graph neural network (GGNN) to learn the embedding factor-wisely based on the item adjacent similarity matrix computed for each factor. Moreover, the distance correlation is adopted to enhance the independence between each pair of factors. After representing each item with independent factors, an attention mechanism is designed to learn user intent to different factors of each item in the session. The session embedding is then generated by aggregating the item embeddings with attention weights of each item's factors. To this end, our model takes user intents at the factor level into account to infer the user purpose in a session. Extensive experiments on three benchmark datasets demonstrate the superiority of our method over existing methods. ",
    "url": "https://arxiv.org/abs/2201.03482",
    "authors": [
      "Ansong Li",
      "Zhiyong Cheng",
      "Fan Liu",
      "Zan Gao",
      "Weili Guan",
      "Yuxin Peng"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2201.03499",
    "title": "Deletion-Compliance in the Absence of Privacy",
    "abstract": "Garg, Goldwasser and Vasudevan (Eurocrypt 2020) invented the notion of deletion-compliance to formally model the \"right to be forgotten\", a concept that confers individuals more control over their digital data. A requirement of deletion-compliance is strong privacy for the deletion requesters since no outside observer must be able to tell if deleted data was ever present in the first place. Naturally, many real world systems where information can flow across users are automatically ruled out. The main thesis of this paper is that deletion-compliance is a standalone notion, distinct from privacy. We present an alternative definition that meaningfully captures deletion-compliance without any privacy implications. This allows broader class of data collectors to demonstrate compliance to deletion requests and to be paired with various notions of privacy. Our new definition has several appealing properties: - It is implied by the stronger definition of Garg et al. under natural conditions, and is equivalent when we add a privacy requirement. - It is naturally composable with minimal assumptions. - Its requirements are met by data structure implementations that do not reveal the order of operations, a concept known as history-independence. Along the way, we discuss the many challenges that remain in providing a universal definition of compliance to the \"right to be forgotten.\" ",
    "url": "https://arxiv.org/abs/2201.03499",
    "authors": [
      "Jonathan Godin",
      "Philippe Lamontagne"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2201.03511",
    "title": "A study on cross-corpus speech emotion recognition and data augmentation",
    "abstract": "Models that can handle a wide range of speakers and acoustic conditions are essential in speech emotion recognition (SER). Often, these models tend to show mixed results when presented with speakers or acoustic conditions that were not visible during training. This paper investigates the impact of cross-corpus data complementation and data augmentation on the performance of SER models in matched (test-set from same corpus) and mismatched (test-set from different corpus) conditions. Investigations using six emotional speech corpora that include single and multiple speakers as well as variations in emotion style (acted, elicited, natural) and recording conditions are presented. Observations show that, as expected, models trained on single corpora perform best in matched conditions while performance decreases between 10-40% in mismatched conditions, depending on corpus specific features. Models trained on mixed corpora can be more stable in mismatched contexts, and the performance reductions range from 1 to 8% when compared with single corpus models in matched conditions. Data augmentation yields additional gains up to 4% and seem to benefit mismatched conditions more than matched ones. ",
    "url": "https://arxiv.org/abs/2201.03511",
    "authors": [
      "Norbert Braunschweiler",
      "Rama Doddipatla",
      "Simon Keizer",
      "Svetlana Stoyanchev"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2201.03543",
    "title": "Investigating internal migration with network analysis and latent space  representations: An application to Turkey",
    "abstract": "Human migration patterns influence the redistribution of population characteristics over the geography and since such distributions are closely related to social and economic outcomes, investigating the structure and dynamics of internal migration plays a crucial role in understanding and designing policies for such systems. We provide an in-depth investigation into the structure and dynamics of the internal migration in Turkey from 2008 to 2020. We identify a set of classical migration laws and examine them via various methods for signed network analysis, ego network analysis, representation learning, temporal stability analysis, community detection, and network visualization. The findings show that, in line with the classical migration laws, most migration links are geographically bounded with several exceptions involving cities with large economic activity, major migration flows are countered with migration flows in the opposite direction, there are well-defined migration routes, and the migration system is generally stable over the investigated period. Apart from these general results, we also provide unique and specific insights into Turkey. Overall, the novel toolset we employ for the first time in the literature allows the investigation of selected migration laws from a complex networks perspective and sheds light on future migration research on different geographies. ",
    "url": "https://arxiv.org/abs/2201.03543",
    "authors": [
      "Furkan Gürsoy",
      "Bertan Badur"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.02629",
    "title": "United adversarial learning for liver tumor segmentation and detection  of multi-modality non-contrast MRI",
    "abstract": "Simultaneous segmentation and detection of liver tumors (hemangioma and hepatocellular carcinoma (HCC)) by using multi-modality non-contrast magnetic resonance imaging (NCMRI) are crucial for the clinical diagnosis. However, it is still a challenging task due to: (1) the HCC information on NCMRI is invisible or insufficient makes extraction of liver tumors feature difficult; (2) diverse imaging characteristics in multi-modality NCMRI causes feature fusion and selection difficult; (3) no specific information between hemangioma and HCC on NCMRI cause liver tumors detection difficult. In this study, we propose a united adversarial learning framework (UAL) for simultaneous liver tumors segmentation and detection using multi-modality NCMRI. The UAL first utilizes a multi-view aware encoder to extract multi-modality NCMRI information for liver tumor segmentation and detection. In this encoder, a novel edge dissimilarity feature pyramid module is designed to facilitate the complementary multi-modality feature extraction. Second, the newly designed fusion and selection channel is used to fuse the multi-modality feature and make the decision of the feature selection. Then, the proposed mechanism of coordinate sharing with padding integrates the multi-task of segmentation and detection so that it enables multi-task to perform united adversarial learning in one discriminator. Lastly, an innovative multi-phase radiomics guided discriminator exploits the clear and specific tumor information to improve the multi-task performance via the adversarial learning strategy. The UAL is validated in corresponding multi-modality NCMRI (i.e. T1FS pre-contrast MRI, T2FS MRI, and DWI) and three phases contrast-enhanced MRI of 255 clinical subjects. The experiments show that UAL has great potential in the clinical diagnosis of liver tumors. ",
    "url": "https://arxiv.org/abs/2201.02629",
    "authors": [
      "Jianfeng Zhao",
      "Dengwang Li",
      "Shuo Li"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.02702",
    "title": "An Improved Mathematical Model of Sepsis: Modeling, Bifurcation  Analysis, and Optimal Control Study for Complex Nonlinear Infectious Disease  System",
    "abstract": "Sepsis is a life-threatening medical emergency, which is a major cause of death worldwide and the second highest cause of mortality in the United States. Researching the optimal control treatment or intervention strategy on the comprehensive sepsis system is key in reducing mortality. For this purpose, first, this paper improves a complex nonlinear sepsis model proposed in our previous work. Then, bifurcation analyses are conducted for each sepsis subsystem to study the model behaviors under some system parameters. The bifurcation analysis results also further indicate the necessity of control treatment and intervention therapy. If the sepsis system is without adding any control under some parameter and initial system value settings, the system will perform persistent inflammation outcomes as time goes by. Therefore, we develop our complex improved nonlinear sepsis model into a sepsis optimal control model, and then use some effective biomarkers recommended in existing clinic practices as optimization objective function to measure the development of sepsis. Besides that, a Bayesian optimization algorithm by combining Recurrent neural network (RNN-BO algorithm) is introduced to predict the optimal control strategy for the studied sepsis optimal control system. The difference between the RNN-BO algorithm from other optimization algorithms is that once given any new initial system value setting (initial value is associated with the initial conditions of patients), the RNN-BO algorithm is capable of quickly predicting a corresponding time-series optimal control based on the historical optimal control data for any new sepsis patient. To demonstrate the effectiveness and efficiency of the RNN-BO algorithm on solving the optimal control solution on the complex nonlinear sepsis system, some numerical simulations are implemented by comparing with other optimization algorithms in this paper. ",
    "url": "https://arxiv.org/abs/2201.02702",
    "authors": [
      "Yuyang Chen",
      "Kaiming Bi",
      "Chih-Hang J. Wu",
      "David Ben-Arieh",
      "Ashesh Sinha"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Applications (stat.AP)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2201.02746",
    "title": "Expert Knowledge-guided Geometric Representation Learning for Magnetic  Resonance Imaging-based Glioma Grading",
    "abstract": "Radiomics and deep learning have shown high popularity in automatic glioma grading. Radiomics can extract hand-crafted features that quantitatively describe the expert knowledge of glioma grades, and deep learning is powerful in extracting a large number of high-throughput features that facilitate the final classification. However, the performance of existing methods can still be improved as their complementary strengths have not been sufficiently investigated and integrated. Furthermore, lesion maps are usually needed for the final prediction at the testing phase, which is very troublesome. In this paper, we propose an expert knowledge-guided geometric representation learning (ENROL) framework . Geometric manifolds of hand-crafted features and learned features are constructed to mine the implicit relationship between deep learning and radiomics, and therefore to dig mutual consent and essential representation for the glioma grades. With a specially designed manifold discrepancy measurement, the grading model can exploit the input image data and expert knowledge more effectively in the training phase and get rid of the requirement of lesion segmentation maps at the testing phase. The proposed framework is flexible regarding deep learning architectures to be utilized. Three different architectures have been evaluated and five models have been compared, which show that our framework can always generate promising results. ",
    "url": "https://arxiv.org/abs/2201.02746",
    "authors": [
      "Yeqi Wang",
      "Longfei Li",
      "Cheng Li",
      "Yan Xi",
      "Hairong Zheng",
      "Yusong Lin",
      "Shanshan Wang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.02771",
    "title": "A Sneak Attack on Segmentation of Medical Images Using Deep Neural  Network Classifiers",
    "abstract": "Instead of using current deep-learning segmentation models (like the UNet and variants), we approach the segmentation problem using trained Convolutional Neural Network (CNN) classifiers, which automatically extract important features from classified targets for image classification. Those extracted features can be visualized and formed heatmaps using Gradient-weighted Class Activation Mapping (Grad-CAM). This study tested whether the heatmaps could be used to segment the classified targets. We also proposed an evaluation method for the heatmaps; that is, to re-train the CNN classifier using images filtered by heatmaps and examine its performance. We used the mean-Dice coefficient to evaluate segmentation results. Results from our experiments show that heatmaps can locate and segment partial tumor areas. But only use of the heatmaps from CNN classifiers may not be an optimal approach for segmentation. In addition, we have verified that the predictions of CNN classifiers mainly depend on tumor areas, and dark regions in Grad-CAM's heatmaps also contribute to classification. ",
    "url": "https://arxiv.org/abs/2201.02771",
    "authors": [
      "Shuyue Guan",
      "Murray Loew"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.02821",
    "title": "Classification of Hyperspectral Images by Using Spectral Data and Fully  Connected Neural Network",
    "abstract": "It is observed that high classification performance is achieved for one- and two-dimensional signals by using deep learning methods. In this context, most researchers have tried to classify hyperspectral images by using deep learning methods and classification success over 90% has been achieved for these images. Deep neural networks (DNN) actually consist of two parts: i) Convolutional neural network (CNN) and ii) fully connected neural network (FCNN). While CNN determines the features, FCNN is used in classification. In classification of the hyperspectral images, it is observed that almost all of the researchers used 2D or 3D convolution filters on the spatial data beside spectral data (features). It is convenient to use convolution filters on images or time signals. In hyperspectral images, each pixel is represented by a signature vector which consists of individual features that are independent of each other. Since the order of the features in the vector can be changed, it doesn't make sense to use convolution filters on these features as on time signals. At the same time, since the hyperspectral images do not have a textural structure, there is no need to use spatial data besides spectral data. In this study, hyperspectral images of Indian pines, Salinas, Pavia centre, Pavia university and Botswana are classified by using only fully connected neural network and the spectral data with one dimensional. An average accuracy of 97.5% is achieved for the test sets of all hyperspectral images. ",
    "url": "https://arxiv.org/abs/2201.02821",
    "authors": [
      "Zumray Dokur",
      "Tamer Olmez"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.02834",
    "title": "Reconfigurable Intelligent Surface Enabled Spatial Multiplexing with  Fully Convolutional Network",
    "abstract": "Reconfigurable intelligent surface (RIS) is an emerging technology for future wireless communication systems. In this work, we consider downlink spatial multiplexing enabled by the RIS for weighted sum-rate (WSR) maximization. In the literature, most solutions use alternating gradient-based optimization, which has moderate performance, high complexity, and limited scalability. We propose to apply a fully convolutional network (FCN) to solve this problem, which was originally designed for semantic segmentation of images. The rectangular shape of the RIS and the spatial correlation of channels with adjacent RIS antennas due to the short distance between them encourage us to apply it for the RIS configuration. We design a set of channel features that includes both cascaded channels via the RIS and the direct channel. In the base station (BS), the differentiable minimum mean squared error (MMSE) precoder is used for pretraining and the weighted minimum mean squared error (WMMSE) precoder is then applied for fine-tuning, which is nondifferentiable, more complex, but achieves a better performance. Evaluation results show that the proposed solution has higher performance and allows for a faster evaluation than the baselines. Hence it scales better to a large number of antennas, advancing the RIS one step closer to practical deployment. ",
    "url": "https://arxiv.org/abs/2201.02834",
    "authors": [
      "Bile Peng",
      "Jan-Aike Termöhlen",
      "Cong Sun",
      "Danping He",
      "Ke Guan",
      "Tim Fingscheidt",
      "Eduard A. Jorswieck"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.02876",
    "title": "Defocus Deblur Microscopy via feature interactive coarse-to-fine network",
    "abstract": "The clarity of microscopic images is vital in biology research and diagnosis. When taking microscopy images at cell or molecule level, mechanical drift occurs and could be difficult and expansive to counter. Such a problem could be overcome by developing an end-to-end deep learning-based workflow capable of predicting in focused microscopic images from out-of-focused counterparts. In our model, we adopt a structure of multi-level U-net, each level connected head-to-tail with corresponding convolution layers from each other. In contrast to the conventional coarse-to-fine model, our model uses the knowledge distilled from the coarse network transferred to the finer network. We evaluate the performance of our model and found our method to be effective and has a better performance by comparing the results with existing models. ",
    "url": "https://arxiv.org/abs/2201.02876",
    "authors": [
      "Jiahe Wang",
      "Boran Han"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.02967",
    "title": "Robust classification with flexible discriminant analysis in  heterogeneous data",
    "abstract": "Linear and Quadratic Discriminant Analysis are well-known classical methods but can heavily suffer from non-Gaussian distributions and/or contaminated datasets, mainly because of the underlying Gaussian assumption that is not robust. To fill this gap, this paper presents a new robust discriminant analysis where each data point is drawn by its own arbitrary Elliptically Symmetrical (ES) distribution and its own arbitrary scale parameter. Such a model allows for possibly very heterogeneous, independent but non-identically distributed samples. After deriving a new decision rule, it is shown that maximum-likelihood parameter estimation and classification are very simple, fast and robust compared to state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2201.02967",
    "authors": [
      "Pierre Houdouin",
      "Frédéric Pascal",
      "Matthieu Jonckheere",
      "Andrew Wang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2201.03131",
    "title": "Systematic biases when using deep neural networks for annotating large  catalogs of astronomical images",
    "abstract": "Deep convolutional neural networks (DCNNs) have become the most common solution for automatic image annotation due to their non-parametric nature, good performance, and their accessibility through libraries such as TensorFlow. Among other fields, DCNNs are also a common approach to the annotation of large astronomical image databases acquired by digital sky surveys. One of the main downsides of DCNNs is the complex non-intuitive rules that make DCNNs act as a ``black box\", providing annotations in a manner that is unclear to the user. Therefore, the user is often not able to know what information is used by the DCNNs for the classification. Here we demonstrate that the training of a DCNN is sensitive to the context of the training data such as the location of the objects in the sky. We show that for basic classification of elliptical and spiral galaxies, the sky location of the galaxies used for training affects the behavior of the algorithm, and leads to a small but consistent and statistically significant bias. That bias exhibits itself in the form of cosmological-scale anisotropy in the distribution of basic galaxy morphology. Therefore, while DCNNs are powerful tools for annotating images of extended sources, the construction of training sets for galaxy morphology should take into consideration more aspects than the visual appearance of the object. In any case, catalogs created with deep neural networks that exhibit signs of cosmological anisotropy should be interpreted with the possibility of consistent bias. ",
    "url": "https://arxiv.org/abs/2201.03131",
    "authors": [
      "Sanchari Dhar",
      "Lior Shamir"
    ],
    "subjectives": [
      "Astrophysics of Galaxies (astro-ph.GA)",
      "Cosmology and Nongalactic Astrophysics (astro-ph.CO)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03156",
    "title": "$m^\\ast$ of two-dimensional electron gas: a neural canonical  transformation study",
    "abstract": "The quasiparticle effective mass $m^\\ast$ of interacting electrons is a fundamental quantity in the Fermi liquid theory. However, the precise value of the effective mass of uniform electron gas is still elusive after decades of research. The newly developed neural canonical transformation approach arXiv:2105.08644 offers a principled way to extract the effective mass of electron gas by directly calculating the thermal entropy at low temperature. The approach models a variational many-electron density matrix using two generative neural networks: an autoregressive model for momentum occupation and a normalizing flow for electron coordinates. Our calculation reveals a suppression of effective mass in the two-dimensional spin-polarized electron gas, which is more pronounced than previous reports in the low-density strong-coupling region. This prediction calls for verification in two-dimensional electron gas experiments. ",
    "url": "https://arxiv.org/abs/2201.03156",
    "authors": [
      "Hao Xie",
      "Linfeng Zhang",
      "Lei Wang"
    ],
    "subjectives": [
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Mesoscale and Nanoscale Physics (cond-mat.mes-hall)",
      "Strongly Correlated Electrons (cond-mat.str-el)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2201.03182",
    "title": "Non-Asymptotic Guarantees for Robust Statistical Learning under  $(1+\\varepsilon)$-th Moment Assumption",
    "abstract": "There has been a surge of interest in developing robust estimators for models with heavy-tailed data in statistics and machine learning. This paper proposes a log-truncated M-estimator for a large family of statistical regressions and establishes its excess risk bound under the condition that the data have $(1+\\varepsilon)$-th moment with $\\varepsilon \\in (0,1]$. With an additional assumption on the associated risk function, we obtain an $\\ell_2$-error bound for the estimation. Our theorems are applied to establish robust M-estimators for concrete regressions. Besides convex regressions such as quantile regression and generalized linear models, many non-convex regressions can also be fit into our theorems, we focus on robust deep neural network regressions, which can be solved by the stochastic gradient descent algorithms. Simulations and real data analysis demonstrate the superiority of log-truncated estimations over standard estimations. ",
    "url": "https://arxiv.org/abs/2201.03182",
    "authors": [
      "Lihu Xu",
      "Fang Yao",
      "Qiuran Yao",
      "Huiming Zhang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2201.03283",
    "title": "An application of the splitting-up method for the computation of a  neural network representation for the solution for the filtering equations",
    "abstract": "The filtering equations govern the evolution of the conditional distribution of a signal process given partial, and possibly noisy, observations arriving sequentially in time. Their numerical approximation plays a central role in many real-life applications, including numerical weather prediction, finance and engineering. One of the classical approaches to approximate the solution of the filtering equations is to use a PDE inspired method, called the splitting-up method, initiated by Gyongy, Krylov, LeGland, among other contributors. This method, and other PDE based approaches, have particular applicability for solving low-dimensional problems. In this work we combine this method with a neural network representation. The new methodology is used to produce an approximation of the unnormalised conditional distribution of the signal process. We further develop a recursive normalisation procedure to recover the normalised conditional distribution of the signal process. The new scheme can be iterated over multiple time steps whilst keeping its asymptotic unbiasedness property intact. We test the neural network approximations with numerical approximation results for the Kalman and Benes filter. ",
    "url": "https://arxiv.org/abs/2201.03283",
    "authors": [
      "Dan Crisan",
      "Alexander Lobbe",
      "Salvador Ortiz-Latorre"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Artificial Intelligence (cs.AI)",
      "Numerical Analysis (math.NA)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2201.03319",
    "title": "Comparison of Representation Learning Techniques for Tracking in time  resolved 3D Ultrasound",
    "abstract": "3D ultrasound (3DUS) becomes more interesting for target tracking in radiation therapy due to its capability to provide volumetric images in real-time without using ionizing radiation. It is potentially usable for tracking without using fiducials. For this, a method for learning meaningful representations would be useful to recognize anatomical structures in different time frames in representation space (r-space). In this study, 3DUS patches are reduced into a 128-dimensional r-space using conventional autoencoder, variational autoencoder and sliced-wasserstein autoencoder. In the r-space, the capability of separating different ultrasound patches as well as recognizing similar patches is investigated and compared based on a dataset of liver images. Two metrics to evaluate the tracking capability in the r-space are proposed. It is shown that ultrasound patches with different anatomical structures can be distinguished and sets of similar patches can be clustered in r-space. The results indicate that the investigated autoencoders have different levels of usability for target tracking in 3DUS. ",
    "url": "https://arxiv.org/abs/2201.03319",
    "authors": [
      "Daniel Wulff",
      "Jannis Hagenah",
      "Floris Ernst"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03321",
    "title": "A Practical Guide to Logical Access Voice Presentation Attack Detection",
    "abstract": "Voice-based human-machine interfaces with an automatic speaker verification (ASV) component are commonly used in the market. However, the threat from presentation attacks is also growing since attackers can use recent speech synthesis technology to produce a natural-sounding voice of a victim. Presentation attack detection (PAD) for ASV, or speech anti-spoofing, is therefore indispensable. Research on voice PAD has seen significant progress since the early 2010s, including the advancement in PAD models, benchmark datasets, and evaluation campaigns. This chapter presents a practical guide to the field of voice PAD, with a focus on logical access attacks using text-to-speech and voice conversion algorithms and spoofing countermeasures based on artifact detection. It introduces the basic concept of voice PAD, explains the common techniques, and provides an experimental study using recent methods on a benchmark dataset. Code for the experiments is open-sourced. ",
    "url": "https://arxiv.org/abs/2201.03321",
    "authors": [
      "Xin Wang",
      "Junichi Yamagishi"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Cryptography and Security (cs.CR)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2201.03402",
    "title": "Automated Detection of Missing Links in Developed Bicycle Networks",
    "abstract": "Cycling is an effective solution for making urban transport more sustainable. However, bicycle networks are typically developed in a slow, piecewise process that leaves open a large number of gaps, even in well developed cycling cities like Copenhagen. Here, we develop the IPCC procedure (Identify, Prioritize, Cluster, Classify) for finding the most important missing links in developed urban bicycle networks, by analyzing street networks from OpenStreetMap. We apply the IPCC procedure to Copenhagen and report the 105 top priority gaps. For evaluation, we compare these gaps with the city's most recent Cycle Path Prioritization Plan and find considerable overlaps. Our results show how network analysis with minimal data requirements can serve as a cost-efficient support tool for bicycle network planning. The IPCC procedure takes into account the whole city network for consolidating urban bicycle networks and can therefore well complement localized, manual planning processes, providing a data-driven framework for more effective, city-wide decision-making. ",
    "url": "https://arxiv.org/abs/2201.03402",
    "authors": [
      "Anastassia Vybornova",
      "Tiago Cunha",
      "Astrid Gühnemann",
      "Michael Szell"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:1403.5617",
    "title": "On the Rise and Fall of Online Social Networks",
    "abstract": " Title: On the Rise and Fall of Online Social Networks ",
    "url": "https://arxiv.org/abs/1403.5617",
    "authors": [
      "Arnab Basu",
      "Saswata Shannigrahi",
      "Simrat Singh Chhabra",
      "Ajit Brundavanam"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:1909.10215",
    "title": "Local Routing in Sparse and Lightweight Geometric Graphs",
    "abstract": " Title: Local Routing in Sparse and Lightweight Geometric Graphs ",
    "url": "https://arxiv.org/abs/1909.10215",
    "authors": [
      "Vikrant Ashvinkumar",
      "Joachim Gudmundsson",
      "Christos Levcopoulos",
      "Bengt J. Nilsson",
      "André van Renssen"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:1910.08527",
    "title": "Masked Gradient-Based Causal Structure Learning",
    "abstract": " Comments: Accepted to SDM 2022 ",
    "url": "https://arxiv.org/abs/1910.08527",
    "authors": [
      "Ignavier Ng",
      "Shengyu Zhu",
      "Zhuangyan Fang",
      "Haoyang Li",
      "Zhitang Chen",
      "Jun Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2001.03853",
    "title": "Supply Network Formation and Fragility",
    "abstract": " Title: Supply Network Formation and Fragility ",
    "url": "https://arxiv.org/abs/2001.03853",
    "authors": [
      "Matthew Elliott",
      "Benjamin Golub",
      "Matthew V. Leduc"
    ],
    "subjectives": [
      "Theoretical Economics (econ.TH)",
      "Computer Science and Game Theory (cs.GT)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2002.00269",
    "title": "A Tutorial on Learning With Bayesian Networks",
    "abstract": " Comments: Added a note on averaging causal models ",
    "url": "https://arxiv.org/abs/2002.00269",
    "authors": [
      "David Heckerman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2004.01123",
    "title": "Surrogate-assisted performance prediction for data-driven knowledge  discovery algorithms: application to evolutionary modeling of clinical  pathways",
    "abstract": " Title: Surrogate-assisted performance prediction for data-driven knowledge  discovery algorithms: application to evolutionary modeling of clinical  pathways ",
    "url": "https://arxiv.org/abs/2004.01123",
    "authors": [
      "Anastasia A. Funkner",
      "Aleksey N. Yakovlev",
      "Sergey V. Kovalchuk"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2006.04622",
    "title": "Trade-offs between membership privacy & adversarially robust learning",
    "abstract": " Title: Trade-offs between membership privacy & adversarially robust learning ",
    "url": "https://arxiv.org/abs/2006.04622",
    "authors": [
      "Jamie Hayes"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2007.02901",
    "title": "Wiki-CS: A Wikipedia-Based Benchmark for Graph Neural Networks",
    "abstract": " Comments: Graph Representation Learning and Beyond workshop (ICML 2020); corrected incorrect metrics due to issue in experiment implementation ",
    "url": "https://arxiv.org/abs/2007.02901",
    "authors": [
      "Péter Mernyei",
      "Cătălina Cangea"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2007.15090",
    "title": "Robust Linear Estimation with Non-parametric Uncertainty: Average and  Worst-case Performance (Full Version)",
    "abstract": " Comments: 74 pages, 2 figures, research report, submitted ",
    "url": "https://arxiv.org/abs/2007.15090",
    "authors": [
      "Gilberto O. Corrêa",
      "Marlon M. López-Flores"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2008.00997",
    "title": "Improving concave point detection to better segment overlapped objects  in images",
    "abstract": " Comments: Corrected typos. Improved results section ",
    "url": "https://arxiv.org/abs/2008.00997",
    "authors": [
      "Miquel Miró-Nicolau",
      "Biel Moyà-Alcover",
      "Manuel Gonzàlez-Hidalgo",
      "Antoni Jaume-i-Capó"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2008.04601",
    "title": "Improving Blockchain scalability based on one-time cross-chain contract  and gossip network",
    "abstract": " Comments: 10 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2008.04601",
    "authors": [
      "Keyang Liu",
      "Yukio Ohsawa"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2008.11193",
    "title": "Individual Privacy Accounting via a Renyi Filter",
    "abstract": " Title: Individual Privacy Accounting via a Renyi Filter ",
    "url": "https://arxiv.org/abs/2008.11193",
    "authors": [
      "Vitaly Feldman",
      "Tijana Zrnic"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2009.03892",
    "title": "Neural-PDE: A RNN based neural network for solving time dependent PDEs",
    "abstract": " Title: Neural-PDE: A RNN based neural network for solving time dependent PDEs ",
    "url": "https://arxiv.org/abs/2009.03892",
    "authors": [
      "Yihao Hu",
      "Tong Zhao",
      "Shixin Xu",
      "Zhiliang Xu",
      "Lizhen Lin"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2009.05673",
    "title": "Applications of Deep Neural Networks",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:1610.02357, arXiv:1603.05027, arXiv:1801.04381, arXiv:2001.02394, arXiv:1704.04861 by other authors ",
    "url": "https://arxiv.org/abs/2009.05673",
    "authors": [
      "Jeff Heaton"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2010.12528",
    "title": "Towards Dynamic-Point Systems on Metric Graphs with Longest  Stabilization Time",
    "abstract": " Comments: 15 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2010.12528",
    "authors": [
      "Leonid W. Dworzanski"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Mathematical Physics (math-ph)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2012.14600",
    "title": "Addressing the Lack of Comparability & Testing in CAN Intrusion  Detection Research: A Comprehensive Guide to CAN IDS Data & Introduction of  the ROAD Dataset",
    "abstract": " Comments: title changed and author added from original version ",
    "url": "https://arxiv.org/abs/2012.14600",
    "authors": [
      "Miki E. Verma",
      "Michael D. Iannacone",
      "Robert A. Bridges",
      "Samuel C. Hollifield",
      "Pablo Moriano",
      "Bill Kay",
      "Frank L. Combs"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.00363",
    "title": "Tiny Adversarial Mulit-Objective Oneshot Neural Architecture Search",
    "abstract": " Title: Tiny Adversarial Mulit-Objective Oneshot Neural Architecture Search ",
    "url": "https://arxiv.org/abs/2103.00363",
    "authors": [
      "Guoyang Xie",
      "Jinbao Wang",
      "Guo Yu",
      "Feng Zheng",
      "Yaochu Jin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2103.04354",
    "title": "Feedback Refined Local-Global Network for Super-Resolution of  Hyperspectral Imagery",
    "abstract": " Title: Feedback Refined Local-Global Network for Super-Resolution of  Hyperspectral Imagery ",
    "url": "https://arxiv.org/abs/2103.04354",
    "authors": [
      "Zhenjie Tang",
      "Qing Xu",
      "Zhenwei Shi",
      "Bin Pan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2103.05804",
    "title": "Reframing Neural Networks: Deep Structure in Overcomplete  Representations",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2003.13866 ",
    "url": "https://arxiv.org/abs/2103.05804",
    "authors": [
      "Calvin Murdock",
      "George Cazenavette",
      "Simon Lucey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2103.11109",
    "title": "DataLens: Scalable Privacy Preserving Training via Gradient Compression  and Aggregation",
    "abstract": " Comments: Accepted to ACM CCS 2021. 23 pages, 4 figures, 12 tables ",
    "url": "https://arxiv.org/abs/2103.11109",
    "authors": [
      "Boxin Wang",
      "Fan Wu",
      "Yunhui Long",
      "Luka Rimanic",
      "Ce Zhang",
      "Bo Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2104.08811",
    "title": "Human Schema Curation via Causal Association Rule Mining",
    "abstract": " Comments: 11 pages, 6 figures, 6 tables ",
    "url": "https://arxiv.org/abs/2104.08811",
    "authors": [
      "Noah Weber",
      "Anton Belyy",
      "Nils Holzenberger",
      "Rachel Rudinger",
      "Benjamin Van Durme"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2104.14624",
    "title": "The Logic of Graph Neural Networks",
    "abstract": " Title: The Logic of Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2104.14624",
    "authors": [
      "Martin Grohe"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2105.03480",
    "title": "A semigroup method for high dimensional elliptic PDEs and eigenvalue  problems based on neural networks",
    "abstract": " Comments: 17 pages, 18 figures; Final version accepted at Journal of Computational Physics ",
    "url": "https://arxiv.org/abs/2105.03480",
    "authors": [
      "Haoya Li",
      "Lexing Ying"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.06637",
    "title": "Understanding occupants' behaviour, engagement, emotion, and comfort  indoors with heterogeneous sensors and wearables",
    "abstract": " Comments: This paper introduces In-Gauge and En-Gage datasets. The link for the datasets: this https URL ",
    "url": "https://arxiv.org/abs/2105.06637",
    "authors": [
      "Nan Gao",
      "Max Marschall",
      "Jane Burry",
      "Simon Watkins",
      "Flora D. Salim"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.09378",
    "title": "Robust partial Fourier reconstruction for diffusion-weighted imaging  using a recurrent convolutional neural network",
    "abstract": " Comments: Revisions made as required for appearance in Magnetic Resonance in Medicine ",
    "url": "https://arxiv.org/abs/2105.09378",
    "authors": [
      "Fasil Gadjimuradov",
      "Thomas Benkert",
      "Marcel Dominik Nickel",
      "Andreas Maier"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.11397",
    "title": "Autonomous Kinetic Modeling of Biomass Pyrolysis using Chemical Reaction  Neural Networks",
    "abstract": " Title: Autonomous Kinetic Modeling of Biomass Pyrolysis using Chemical Reaction  Neural Networks ",
    "url": "https://arxiv.org/abs/2105.11397",
    "authors": [
      "Weiqi Ji",
      "Franz Richter",
      "Michael J. Gollner",
      "Sili Deng"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.11627",
    "title": "Least-Squares ReLU Neural Network (LSNN) Method For Scalar Nonlinear  Hyperbolic Conservation Law",
    "abstract": " Title: Least-Squares ReLU Neural Network (LSNN) Method For Scalar Nonlinear  Hyperbolic Conservation Law ",
    "url": "https://arxiv.org/abs/2105.11627",
    "authors": [
      "Zhiqiang Cai",
      "Jingshuang Chen",
      "Min Liu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.11866",
    "title": "GraphFM: Graph Factorization Machines for Feature Interaction Modeling",
    "abstract": " Comments: The code and data are available at this https URL ",
    "url": "https://arxiv.org/abs/2105.11866",
    "authors": [
      "Zekun Li",
      "Shu Wu",
      "Zeyu Cui",
      "Xiaoyu Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2105.13623",
    "title": "Enhanced Doubly Robust Learning for Debiasing Post-click Conversion Rate  Estimation",
    "abstract": " Comments: 10 pages, 3 figures, accepted by SIGIR 2021 ",
    "url": "https://arxiv.org/abs/2105.13623",
    "authors": [
      "Siyuan Guo",
      "Lixin Zou",
      "Yiding Liu",
      "Wenwen Ye",
      "Suqi Cheng",
      "Shuaiqiang Wang",
      "Hechang Chen",
      "Dawei Yin",
      "Yi Chang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2106.06866",
    "title": "A Multi-Implicit Neural Representation for Fonts",
    "abstract": " Title: A Multi-Implicit Neural Representation for Fonts ",
    "url": "https://arxiv.org/abs/2106.06866",
    "authors": [
      "Pradyumna Reddy",
      "Zhifei Zhang",
      "Matthew Fisher",
      "Hailin Jin",
      "Zhaowen Wang",
      "Niloy J. Mitra"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2106.11716",
    "title": "Robust EMRAN-aided Coupled Controller for Autonomous Vehicles",
    "abstract": " Title: Robust EMRAN-aided Coupled Controller for Autonomous Vehicles ",
    "url": "https://arxiv.org/abs/2106.11716",
    "authors": [
      "Sauranil Debarshi",
      "Suresh Sundaram",
      "Narasimhan Sundararajan"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2107.03342",
    "title": "A Survey of Uncertainty in Deep Neural Networks",
    "abstract": " Title: A Survey of Uncertainty in Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2107.03342",
    "authors": [
      "Jakob Gawlikowski",
      "Cedrique Rovile Njieutcheu Tassi",
      "Mohsin Ali",
      "Jongseok Lee",
      "Matthias Humt",
      "Jianxiang Feng",
      "Anna Kruspe",
      "Rudolph Triebel",
      "Peter Jung",
      "Ribana Roscher",
      "Muhammad Shahzad",
      "Wen Yang",
      "Richard Bamler",
      "Xiao Xiang Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.10716",
    "title": "Project Achoo: A Practical Model and Application for COVID-19 Detection  from Recordings of Breath, Voice, and Cough",
    "abstract": " Title: Project Achoo: A Practical Model and Application for COVID-19 Detection  from Recordings of Breath, Voice, and Cough ",
    "url": "https://arxiv.org/abs/2107.10716",
    "authors": [
      "Alexander Ponomarchuk",
      "Ilya Burenko",
      "Elian Malkin",
      "Ivan Nazarov",
      "Vladimir Kokh",
      "Manvel Avetisian",
      "Leonid Zhukov"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2108.07893",
    "title": "Failure of the simultaneous block diagonalization technique applied to  complete and cluster synchronization of random networks",
    "abstract": " Comments: Accepted for publication in PRE ",
    "url": "https://arxiv.org/abs/2108.07893",
    "authors": [
      "Shirin Panahi",
      "Nelson Amaya",
      "Isaac Klickstein",
      "Galen Novello",
      "Francesco Sorrentino"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2108.08162",
    "title": "Specificity-preserving RGB-D Saliency Detection",
    "abstract": " Comments: This is an extensive version and has been accepted by Computational Visual Media ",
    "url": "https://arxiv.org/abs/2108.08162",
    "authors": [
      "Tao Zhou",
      "Deng-Ping Fan",
      "Geng Chen",
      "Yi Zhou",
      "Huazhu Fu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.11117",
    "title": "GlassNet: Label Decoupling-based Three-stream Neural Network for Robust  Image Glass Detection",
    "abstract": " Title: GlassNet: Label Decoupling-based Three-stream Neural Network for Robust  Image Glass Detection ",
    "url": "https://arxiv.org/abs/2108.11117",
    "authors": [
      "C. Zheng",
      "D. Shi",
      "X. Yan",
      "D. Liang",
      "M. wei",
      "X. Yang",
      "Y. Guo",
      "H. Xie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.02860",
    "title": "Hierarchical Graph Convolutional Skeleton Transformer for Action  Recognition",
    "abstract": " Comments: 7 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2109.02860",
    "authors": [
      "Ruwen Bai",
      "Min Li",
      "Bo Meng",
      "Fengfa Li",
      "Miao Jiang",
      "Junxing Ren",
      "Degang Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.03217",
    "title": "Recommendation Algorithms to Increase Equitable Access to Influencers in  a Network",
    "abstract": " Comments: 24 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2109.03217",
    "authors": [
      "Naisha Agarwal"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2110.03473",
    "title": "Unsupervised Image Decomposition with Phase-Correlation Networks",
    "abstract": " Title: Unsupervised Image Decomposition with Phase-Correlation Networks ",
    "url": "https://arxiv.org/abs/2110.03473",
    "authors": [
      "Angel Villar-Corrales",
      "Sven Behnke"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.07077",
    "title": "Modeling and Analysis of Intermittent Federated Learning Over  Cellular-Connected UAV Networks",
    "abstract": " Comments: 6 pages, 3 figures, conference ",
    "url": "https://arxiv.org/abs/2110.07077",
    "authors": [
      "Chun-Hung Liu",
      "Di-Chun Liang",
      "Rung-Hung Gau",
      "Lu Wei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2110.13655",
    "title": "Bridging the gap to real-world for network intrusion detection systems  with data-centric approach",
    "abstract": " Comments: Camera-ready version from Data-centric AI workshop at NeurIPS 2021, see this https URL ",
    "url": "https://arxiv.org/abs/2110.13655",
    "authors": [
      "Gustavo de Carvalho Bertoli",
      "Lourenço Alves Pereira Junior",
      "Filipe Alves Neto Verri",
      "Aldri Luiz dos Santos",
      "Osamu Saotome"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.02840",
    "title": "Adversarial GLUE: A Multi-Task Benchmark for Robustness Evaluation of  Language Models",
    "abstract": " Comments: Oral Presentation in NeurIPS 2021 (Datasets and Benchmarks Track). 24 pages, 4 figures, 12 tables ",
    "url": "https://arxiv.org/abs/2111.02840",
    "authors": [
      "Boxin Wang",
      "Chejian Xu",
      "Shuohang Wang",
      "Zhe Gan",
      "Yu Cheng",
      "Jianfeng Gao",
      "Ahmed Hassan Awadallah",
      "Bo Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.03972",
    "title": "Understanding Layer-wise Contributions in Deep Neural Networks through  Spectral Analysis",
    "abstract": " Title: Understanding Layer-wise Contributions in Deep Neural Networks through  Spectral Analysis ",
    "url": "https://arxiv.org/abs/2111.03972",
    "authors": [
      "Yatin Dandi",
      "Arthur Jacot"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2111.07865",
    "title": "Achievable Rates for Short-Reach Fiber-Optic Channels with Direct  Detection",
    "abstract": " Comments: Submitted to IEEE/OPTICA J. Lightw. Technol. on November 15th, 2021. Revised on January 7th, 2022 ",
    "url": "https://arxiv.org/abs/2111.07865",
    "authors": [
      "Daniel Plabst",
      "Tobias Prinz",
      "Thomas Wiegart",
      "Talha Rahman",
      "Nebojša Stojanović",
      "Stefano Calabrò",
      "Norbert Hanik",
      "Gerhard Kramer"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2111.08922",
    "title": "Traversing the Local Polytopes of ReLU Neural Networks: A Unified  Approach for Network Verification",
    "abstract": " Title: Traversing the Local Polytopes of ReLU Neural Networks: A Unified  Approach for Network Verification ",
    "url": "https://arxiv.org/abs/2111.08922",
    "authors": [
      "Shaojie Xu",
      "Joel Vaughan",
      "Jie Chen",
      "Aijun Zhang",
      "Agus Sudjianto"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2111.13164",
    "title": "Lévy Induced Stochastic Differential Equation Equipped with Neural  Network for Time Series Forecasting",
    "abstract": " Comments: 20 pages, 41 figures ",
    "url": "https://arxiv.org/abs/2111.13164",
    "authors": [
      "Luxuan Yang",
      "Ting Gao",
      "Yubin Lu",
      "Jinqiao Duan",
      "Tao Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Mathematical Finance (q-fin.MF)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2111.14411",
    "title": "PGGANet: Pose Guided Graph Attention Network for Person  Re-identification",
    "abstract": " Comments: 22 pages, 9 figures, 5 tables, 60 references ",
    "url": "https://arxiv.org/abs/2111.14411",
    "authors": [
      "Zhijun He",
      "Hongbo Zhao",
      "Wenquan Feng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.00183",
    "title": "Descriptive vs. inferential community detection: pitfalls, myths and  half-truths",
    "abstract": " Comments: 56 pages, 17 figures ",
    "url": "https://arxiv.org/abs/2112.00183",
    "authors": [
      "Tiago P. Peixoto"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.05883",
    "title": "Self-supervised Spatiotemporal Representation Learning by Exploiting  Video Continuity",
    "abstract": " Comments: Accepted at AAAI2022. arXiv v2: add more experimental details ",
    "url": "https://arxiv.org/abs/2112.05883",
    "authors": [
      "Hanwen Liang",
      "Niamul Quader",
      "Zhixiang Chi",
      "Lizhe Chen",
      "Peng Dai",
      "Juwei Lu",
      "Yang Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.06876",
    "title": "A cognitively driven weighted-entropy model for embedding semantic  categories in hyperbolic geometry",
    "abstract": " Comments: 13 Pages ",
    "url": "https://arxiv.org/abs/2112.06876",
    "authors": [
      "Eugene Yu Ji"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2112.07606",
    "title": "Semantic Answer Type and Relation Prediction Task (SMART 2021)",
    "abstract": " Title: Semantic Answer Type and Relation Prediction Task (SMART 2021) ",
    "url": "https://arxiv.org/abs/2112.07606",
    "authors": [
      "Nandana Mihindukulasooriya",
      "Mohnish Dubey",
      "Alfio Gliozzo",
      "Jens Lehmann",
      "Axel-Cyrille Ngonga Ngomo",
      "Ricardo Usbeck",
      "Gaetano Rossiello",
      "Uttam Kumar"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.08366",
    "title": "AGMI: Attention-Guided Multi-omics Integration for Drug Response  Prediction with Graph Neural Networks",
    "abstract": " Title: AGMI: Attention-Guided Multi-omics Integration for Drug Response  Prediction with Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2112.08366",
    "authors": [
      "Ruiwei Feng",
      "Yufeng Xie",
      "Minshan Lai",
      "Danny Z. Chen",
      "Ji Cao",
      "Jian Wu"
    ],
    "subjectives": [
      "Genomics (q-bio.GN)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.08638",
    "title": "Evaluating Hybrid Graph Pattern Queries Using Runtime Index Graphs",
    "abstract": " Title: Evaluating Hybrid Graph Pattern Queries Using Runtime Index Graphs ",
    "url": "https://arxiv.org/abs/2112.08638",
    "authors": [
      "Xiaoying Wu",
      "Dimitri Theodoratos"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2112.14877",
    "title": "A Unified and Constructive Framework for the Universality of Neural  Networks",
    "abstract": " Comments: fix typos errors, remove results that are not necessary, and add section 9 on non-asymptotic results. Add figures to demonstrate the theoretical results ",
    "url": "https://arxiv.org/abs/2112.14877",
    "authors": [
      "Tan Bui-Thanh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.15272",
    "title": "ViNMT: Neural Machine Translation Toolkit",
    "abstract": " Title: ViNMT: Neural Machine Translation Toolkit ",
    "url": "https://arxiv.org/abs/2112.15272",
    "authors": [
      "Nguyen Hoang Quan",
      "Nguyen Thanh Dat",
      "Nguyen Hoang Minh Cong",
      "Nguyen Van Vinh",
      "Ngo Thi Vinh",
      "Nguyen Phuong Thai",
      "Tran Hong Viet"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.15287",
    "title": "Distributed Random Reshuffling over Networks",
    "abstract": " Comments: 27 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2112.15287",
    "authors": [
      "Kun Huang",
      "Xiao Li",
      "Andre Milzarek",
      "Shi Pu",
      "Junwen Qiu"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2201.00009",
    "title": "Improving Deep Neural Network Classification Confidence using  Heatmap-based eXplainable AI",
    "abstract": " Title: Improving Deep Neural Network Classification Confidence using  Heatmap-based eXplainable AI ",
    "url": "https://arxiv.org/abs/2201.00009",
    "authors": [
      "Erico Tjoa",
      "Hong Jing Khok",
      "Tushar Chouhan",
      "Guan Cuntai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.00625",
    "title": "GAT-CADNet: Graph Attention Network for Panoptic Symbol Spotting in CAD  Drawings",
    "abstract": " Title: GAT-CADNet: Graph Attention Network for Panoptic Symbol Spotting in CAD  Drawings ",
    "url": "https://arxiv.org/abs/2201.00625",
    "authors": [
      "Zhaohua Zheng",
      "Jianfang Li",
      "Lingjie Zhu",
      "Honghua Li",
      "Frank Petzold",
      "Ping Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.00947",
    "title": "HWRCNet: Handwritten Word Recognition in JPEG Compressed Domain using  CNN-BiLSTM Network",
    "abstract": " Comments: The author list is updated as Abhishek Kumar Gupta did not inform that this was the original work by Bulla Rajesh ",
    "url": "https://arxiv.org/abs/2201.00947",
    "authors": [
      "Bulla Rajesh",
      "Abhishek Kumar Gupta",
      "Ayush Raj",
      "Mohammed Javed"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2201.01293",
    "title": "A Transformer-Based Siamese Network for Change Detection",
    "abstract": " Comments: Submitted to International Geoscience and Remote Sensing Symposium (IGARSS), 2022 ",
    "url": "https://arxiv.org/abs/2201.01293",
    "authors": [
      "Wele Gedara Chaminda Bandara",
      "Vishal M. Patel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.02080",
    "title": "BERN2: an advanced neural biomedical named entity recognition and  normalization tool",
    "abstract": " Comments: 6 pages. Web service available at this http URL Code available at this https URL ",
    "url": "https://arxiv.org/abs/2201.02080",
    "authors": [
      "Mujeen Sung",
      "Minbyul Jeong",
      "Yonghwa Choi",
      "Donghyeon Kim",
      "Jinhyuk Lee",
      "Jaewoo Kang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2201.02569",
    "title": "Visual Attention Prediction Improves Performance of Autonomous Drone  Racing Agents",
    "abstract": " Comments: 12 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2201.02569",
    "authors": [
      "Christian Pfeiffer",
      "Simon Wengeler",
      "Antonio Loquercio",
      "Davide Scaramuzza"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  }
]