[
  {
    "id": "arXiv:2311.13603",
    "title": "Cross-layer scheme for low latency multiple description video streaming  over Vehicular Ad-hoc NETworks (VANETs)",
    "abstract": "There is nowadays a growing demand in vehicular communications for real-time applications requiring video assistance. The new state-of-the-art high-efficiency video coding (HEVC) standard is very promising for real-time video streaming. It offers high coding efficiency, as well as dedicated low delay coding structures. Among these, the all intra (AI) coding structure guarantees minimal coding time at the expense of higher video bitrates, which therefore penalizes transmission performances. In this work, we propose an original cross-layer system in order to enhance received video quality in vehicular communications. The system is low complex and relies on a multiple description coding (MDC) approach. It is based on an adaptive mapping mechanism applied at the IEEE 802.11p standard medium access control (MAC) layer. Simulation results in a realistic vehicular environment demonstrate that for low delay video communications, the proposed method provides significant video quality improvements on the receiver side. ",
    "url": "https://arxiv.org/abs/2311.13603",
    "authors": [
      "Mohamed Aymen Labiod",
      "Mohamed Gharbi",
      "Francois-Xavier Coudoux",
      "Patrick Corlay",
      "Noureddine Doghmane"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)",
      "Networking and Internet Architecture (cs.NI)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2311.13610",
    "title": "TRIDENT: The Nonlinear Trilogy for Implicit Neural Representations",
    "abstract": "Implicit neural representations (INRs) have garnered significant interest recently for their ability to model complex, high-dimensional data without explicit parameterisation. In this work, we introduce TRIDENT, a novel function for implicit neural representations characterised by a trilogy of nonlinearities. Firstly, it is designed to represent high-order features through order compactness. Secondly, TRIDENT efficiently captures frequency information, a feature called frequency compactness. Thirdly, it has the capability to represent signals or images such that most of its energy is concentrated in a limited spatial region, denoting spatial compactness. We demonstrated through extensive experiments on various inverse problems that our proposed function outperforms existing implicit neural representation functions. ",
    "url": "https://arxiv.org/abs/2311.13610",
    "authors": [
      "Zhenda Shen",
      "Yanqi Cheng",
      "Raymond H. Chan",
      "Pietro Liò",
      "Carola-Bibiane Schönlieb",
      "Angelica I Aviles-Rivero"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2311.13624",
    "title": "A Theoretical Insight into Attack and Defense of Gradient Leakage in  Transformer",
    "abstract": "The Deep Leakage from Gradient (DLG) attack has emerged as a prevalent and highly effective method for extracting sensitive training data by inspecting exchanged gradients. This approach poses a substantial threat to the privacy of individuals and organizations alike. This research presents a comprehensive analysis of the gradient leakage method when applied specifically to transformer-based models. Through meticulous examination, we showcase the capability to accurately recover data solely from gradients and rigorously investigate the conditions under which gradient attacks can be executed, providing compelling evidence. Furthermore, we reevaluate the approach of introducing additional noise on gradients as a protective measure against gradient attacks. To address this, we outline a theoretical proof that analyzes the associated privacy costs within the framework of differential privacy. Additionally, we affirm the convergence of the Stochastic Gradient Descent (SGD) algorithm under perturbed gradients. The primary objective of this study is to augment the understanding of gradient leakage attack and defense strategies while actively contributing to the development of privacy-preserving techniques specifically tailored for transformer-based models. By shedding light on the vulnerabilities and countermeasures associated with gradient leakage, this research aims to foster advancements in safeguarding sensitive data and upholding privacy in the context of transformer-based models. ",
    "url": "https://arxiv.org/abs/2311.13624",
    "authors": [
      "Chenyang Li",
      "Zhao Song",
      "Weixin Wang",
      "Chiwun Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.13656",
    "title": "Panda or not Panda? Understanding Adversarial Attacks with Interactive  Visualization",
    "abstract": "Adversarial machine learning (AML) studies attacks that can fool machine learning algorithms into generating incorrect outcomes as well as the defenses against worst-case attacks to strengthen model robustness. Specifically for image classification, it is challenging to understand adversarial attacks due to their use of subtle perturbations that are not human-interpretable, as well as the variability of attack impacts influenced by diverse methodologies, instance differences, and model architectures. Through a design study with AML learners and teachers, we introduce AdvEx, a multi-level interactive visualization system that comprehensively presents the properties and impacts of evasion attacks on different image classifiers for novice AML learners. We quantitatively and qualitatively assessed AdvEx in a two-part evaluation including user studies and expert interviews. Our results show that AdvEx is not only highly effective as a visualization tool for understanding AML mechanisms, but also provides an engaging and enjoyable learning experience, thus demonstrating its overall benefits for AML learners. ",
    "url": "https://arxiv.org/abs/2311.13656",
    "authors": [
      "Yuzhe You",
      "Jarvis Tse",
      "Jian Zhao"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.13681",
    "title": "Compact 3D Gaussian Representation for Radiance Field",
    "abstract": "Neural Radiance Fields (NeRFs) have demonstrated remarkable potential in capturing complex 3D scenes with high fidelity. However, one persistent challenge that hinders the widespread adoption of NeRFs is the computational bottleneck due to the volumetric rendering. On the other hand, 3D Gaussian splatting (3DGS) has recently emerged as an alternative representation that leverages a 3D Gaussisan-based representation and adopts the rasterization pipeline to render the images rather than volumetric rendering, achieving very fast rendering speed and promising image quality. However, a significant drawback arises as 3DGS entails a substantial number of 3D Gaussians to maintain the high fidelity of the rendered images, which requires a large amount of memory and storage. To address this critical issue, we place a specific emphasis on two key objectives: reducing the number of Gaussian points without sacrificing performance and compressing the Gaussian attributes, such as view-dependent color and covariance. To this end, we propose a learnable mask strategy that significantly reduces the number of Gaussians while preserving high performance. In addition, we propose a compact but effective representation of view-dependent color by employing a grid-based neural field rather than relying on spherical harmonics. Finally, we learn codebooks to compactly represent the geometric attributes of Gaussian by vector quantization. In our extensive experiments, we consistently show over 10$\\times$ reduced storage and enhanced rendering speed, while maintaining the quality of the scene representation, compared to 3DGS. Our work provides a comprehensive framework for 3D scene representation, achieving high performance, fast training, compactness, and real-time rendering. Our project page is available at https://maincold2.github.io/c3dgs/. ",
    "url": "https://arxiv.org/abs/2311.13681",
    "authors": [
      "Joo Chan Lee",
      "Daniel Rho",
      "Xiangyu Sun",
      "Jong Hwan Ko",
      "Eunbyung Park"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2311.13708",
    "title": "Dynamic Analysis Method for Hidden Dangers in Substation Based on  Knowledge Graph",
    "abstract": "To address the challenge of identifying and understanding hidden dangers in substations from unstructured text data, a novel dynamic analysis method is proposed. This approach begins by analyzing and extracting data from the unstructured text related to hidden dangers. It then leverages a flexible, distributed data search engine built on Elastic-Search to handle this information. Following this, the hidden Markov model is employed to train the data within the engine. The Viterbi algorithm is integrated to decipher the hidden state sequences, facilitating the segmentation and labeling of entities related to hidden dangers. The final step involves using the Neo4j graph database to dynamically create a knowledge map that visualizes hidden dangers in the substation. This method's effectiveness is demonstrated through an example analysis using data from a specific substation's hidden dangers. ",
    "url": "https://arxiv.org/abs/2311.13708",
    "authors": [
      "Weiwei Li",
      "Xing Liu",
      "Wei Wang",
      "Lu Chen",
      "Sizhe Li",
      "Hui Fan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.13713",
    "title": "A Somewhat Robust Image Watermark against Diffusion-based Editing Models",
    "abstract": "Recently, diffusion models (DMs) have become the state-of-the-art method for image synthesis. Editing models based on DMs, known for their high fidelity and precision, have inadvertently introduced new challenges related to image copyright infringement and malicious editing. Our work is the first to formalize and address this issue. After assessing and attempting to enhance traditional image watermarking techniques, we recognize their limitations in this emerging context. In response, we develop a novel technique, RIW (Robust Invisible Watermarking), to embed invisible watermarks leveraging adversarial example techniques. Our technique ensures a high extraction accuracy of $96\\%$ for the invisible watermark after editing, compared to the $0\\%$ offered by conventional methods. We provide access to our code at https://github.com/BennyTMT/RIW. ",
    "url": "https://arxiv.org/abs/2311.13713",
    "authors": [
      "Mingtian Tan",
      "Tianhao Wang",
      "Somesh Jha"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.13716",
    "title": "DiverseNet: Decision Diversified Semi-supervised Semantic Segmentation  Networks for Remote Sensing Imagery",
    "abstract": "Semi-supervised learning is designed to help reduce the cost of the manual labelling process by exploiting the use of useful features from a large quantity of unlabelled data during training. Since pixel-level manual labelling in large-scale remote sensing imagery is expensive, semi-supervised learning becomes an appropriate solution to this. However, most of the existing semi-supervised learning methods still lack efficient perturbation methods to promote diversity of features and the precision of pseudo labels during training. In order to fill this gap, we propose DiverseNet architectures which explore multi-head and multi-model semi-supervised learning algorithms by simultaneously promoting precision and diversity during training. The two proposed methods of DiverseNet, namely the DiverseHead and DiverseModel, achieve the highest semantic segmentation performance in four widely utilised remote sensing imagery data sets compared to state-of-the-art semi-supervised learning methods. Meanwhile, the proposed DiverseHead architecture is relatively lightweight in terms of parameter space compared to the state-of-the-art methods whilst reaching high-performance results for all the tested data sets. ",
    "url": "https://arxiv.org/abs/2311.13716",
    "authors": [
      "Wanli Ma",
      "Oktay Karakus",
      "Paul L. Rosin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.13739",
    "title": "OASIS: Offsetting Active Reconstruction Attacks in Federated Learning",
    "abstract": "Federated Learning (FL) has garnered significant attention for its potential to protect user privacy while enhancing model training efficiency. However, recent research has demonstrated that FL protocols can be easily compromised by active reconstruction attacks executed by dishonest servers. These attacks involve the malicious modification of global model parameters, allowing the server to obtain a verbatim copy of users' private data by inverting their gradient updates. Tackling this class of attack remains a crucial challenge due to the strong threat model. In this paper, we propose OASIS, a defense mechanism based on image augmentation that effectively counteracts active reconstruction attacks while preserving model performance. We first uncover the core principle of gradient inversion that enables these attacks and theoretically identify the main conditions by which the defense can be robust regardless of the attack strategies. We then construct OASIS with image augmentation showing that it can undermine the attack principle. Comprehensive evaluations demonstrate the efficacy of OASIS highlighting its feasibility as a solution. ",
    "url": "https://arxiv.org/abs/2311.13739",
    "authors": [
      "Tre' R. Jeter",
      "Truc Nguyen",
      "Raed Alharbi",
      "My T. Thai"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.13744",
    "title": "Security and Privacy Challenges in Deep Learning Models",
    "abstract": "These days, deep learning models have achieved great success in multiple fields, from autonomous driving to medical diagnosis. These models have expanded the abilities of artificial intelligence by offering great solutions to complex problems that were very difficult to solve earlier. In spite of their unseen success in various, it has been identified, through research conducted, that deep learning models can be subjected to various attacks that compromise model security and data privacy of the Deep Neural Network models. Deep learning models can be subjected to various attacks at different stages of their lifecycle. During the testing phase, attackers can exploit vulnerabilities through different kinds of attacks such as Model Extraction Attacks, Model Inversion attacks, and Adversarial attacks. Model Extraction Attacks are aimed at reverse-engineering a trained deep learning model, with the primary objective of revealing its architecture and parameters. Model inversion attacks aim to compromise the privacy of the data used in the Deep learning model. These attacks are done to compromise the confidentiality of the model by going through the sensitive training data from the model's predictions. By analyzing the model's responses, attackers aim to reconstruct sensitive information. In this way, the model's data privacy is compromised. Adversarial attacks, mainly employed on computer vision models, are made to corrupt models into confidently making incorrect predictions through malicious testing data. These attacks subtly alter the input data, making it look normal but misleading deep learning models to make incorrect decisions. Such attacks can happen during both the model's evaluation and training phases. Data Poisoning Attacks add harmful data to the training set, disrupting the learning process and reducing the reliability of the deep learning mode. ",
    "url": "https://arxiv.org/abs/2311.13744",
    "authors": [
      "Gopichandh Golla"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.13750",
    "title": "Towards Transferable Multi-modal Perception Representation Learning for  Autonomy: NeRF-Supervised Masked AutoEncoder",
    "abstract": "This work proposes a unified self-supervised pre-training framework for transferable multi-modal perception representation learning via masked multi-modal reconstruction in Neural Radiance Field (NeRF), namely NeRF-Supervised Masked AutoEncoder (NS-MAE). Specifically, conditioned on certain view directions and locations, multi-modal embeddings extracted from corrupted multi-modal input signals, i.e., Lidar point clouds and images, are rendered into projected multi-modal feature maps via neural rendering. Then, original multi-modal signals serve as reconstruction targets for the rendered multi-modal feature maps to enable self-supervised representation learning. Extensive experiments show that the representation learned via NS-MAE shows promising transferability for diverse multi-modal and single-modal (camera-only and Lidar-only) perception models on diverse 3D perception downstream tasks (3D object detection and BEV map segmentation) with diverse amounts of fine-tuning labeled data. Moreover, we empirically find that NS-MAE enjoys the synergy of both the mechanism of masked autoencoder and neural radiance field. Our code shall be released upon acceptance. ",
    "url": "https://arxiv.org/abs/2311.13750",
    "authors": [
      "Xiaohao Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.13766",
    "title": "A Unified Framework for Fair Spectral Clustering With Effective Graph  Learning",
    "abstract": "We consider the problem of spectral clustering under group fairness constraints, where samples from each sensitive group are approximately proportionally represented in each cluster. Traditional fair spectral clustering (FSC) methods consist of two consecutive stages, i.e., performing fair spectral embedding on a given graph and conducting $k$means to obtain discrete cluster labels. However, in practice, the graph is usually unknown, and we need to construct the underlying graph from potentially noisy data, the quality of which inevitably affects subsequent fair clustering performance. Furthermore, performing FSC through separate steps breaks the connections among these steps, leading to suboptimal results. To this end, we first theoretically analyze the effect of the constructed graph on FSC. Motivated by the analysis, we propose a novel graph construction method with a node-adaptive graph filter to learn graphs from noisy data. Then, all independent stages of conventional FSC are integrated into a single objective function, forming an end-to-end framework that inputs raw data and outputs discrete cluster labels. An algorithm is developed to jointly and alternately update the variables in each stage. Finally, we conduct extensive experiments on synthetic, benchmark, and real data, which show that our model is superior to state-of-the-art fair clustering methods. ",
    "url": "https://arxiv.org/abs/2311.13766",
    "authors": [
      "Xiang Zhang",
      "Qiao Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2311.13774",
    "title": "Learning Hierarchical Polynomials with Three-Layer Neural Networks",
    "abstract": "We study the problem of learning hierarchical polynomials over the standard Gaussian distribution with three-layer neural networks. We specifically consider target functions of the form $h = g \\circ p$ where $p : \\mathbb{R}^d \\rightarrow \\mathbb{R}$ is a degree $k$ polynomial and $g: \\mathbb{R} \\rightarrow \\mathbb{R}$ is a degree $q$ polynomial. This function class generalizes the single-index model, which corresponds to $k=1$, and is a natural class of functions possessing an underlying hierarchical structure. Our main result shows that for a large subclass of degree $k$ polynomials $p$, a three-layer neural network trained via layerwise gradient descent on the square loss learns the target $h$ up to vanishing test error in $\\widetilde{\\mathcal{O}}(d^k)$ samples and polynomial time. This is a strict improvement over kernel methods, which require $\\widetilde \\Theta(d^{kq})$ samples, as well as existing guarantees for two-layer networks, which require the target function to be low-rank. Our result also generalizes prior works on three-layer neural networks, which were restricted to the case of $p$ being a quadratic. When $p$ is indeed a quadratic, we achieve the information-theoretically optimal sample complexity $\\widetilde{\\mathcal{O}}(d^2)$, which is an improvement over prior work~\\citep{nichani2023provable} requiring a sample size of $\\widetilde\\Theta(d^4)$. Our proof proceeds by showing that during the initial stage of training the network performs feature learning to recover the feature $p$ with $\\widetilde{\\mathcal{O}}(d^k)$ samples. This work demonstrates the ability of three-layer neural networks to learn complex features and as a result, learn a broad class of hierarchical functions. ",
    "url": "https://arxiv.org/abs/2311.13774",
    "authors": [
      "Zihao Wang",
      "Eshaan Nichani",
      "Jason D. Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2311.13781",
    "title": "Dynamic Compositional Graph Convolutional Network for Efficient  Composite Human Motion Prediction",
    "abstract": "With potential applications in fields including intelligent surveillance and human-robot interaction, the human motion prediction task has become a hot research topic and also has achieved high success, especially using the recent Graph Convolutional Network (GCN). Current human motion prediction task usually focuses on predicting human motions for atomic actions. Observing that atomic actions can happen at the same time and thus formulating the composite actions, we propose the composite human motion prediction task. To handle this task, we first present a Composite Action Generation (CAG) module to generate synthetic composite actions for training, thus avoiding the laborious work of collecting composite action samples. Moreover, we alleviate the effect of composite actions on demand for a more complicated model by presenting a Dynamic Compositional Graph Convolutional Network (DC-GCN). Extensive experiments on the Human3.6M dataset and our newly collected CHAMP dataset consistently verify the efficiency of our DC-GCN method, which achieves state-of-the-art motion prediction accuracies and meanwhile needs few extra computational costs than traditional GCN-based human motion methods. ",
    "url": "https://arxiv.org/abs/2311.13781",
    "authors": [
      "Wanying Zhang",
      "Shen Zhao",
      "Fanyang Meng",
      "Songtao Wu",
      "Mengyuan Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.13782",
    "title": "Scalable AI Generative Content for Vehicular Network Semantic  Communication",
    "abstract": "Perceiving vehicles in a driver's blind spot is vital for safe driving. The detection of potentially dangerous vehicles in these blind spots can benefit from vehicular network semantic communication technology. However, efficient semantic communication involves a trade-off between accuracy and delay, especially in bandwidth-limited situations. This paper unveils a scalable Artificial Intelligence Generated Content (AIGC) system that leverages an encoder-decoder architecture. This system converts images into textual representations and reconstructs them into quality-acceptable images, optimizing transmission for vehicular network semantic communication. Moreover, when bandwidth allows, auxiliary information is integrated. The encoder-decoder aims to maintain semantic equivalence with the original images across various tasks. Then the proposed approach employs reinforcement learning to enhance the reliability of the generated contents. Experimental results suggest that the proposed method surpasses the baseline in perceiving vehicles in blind spots and effectively compresses communication data. While this method is specifically designed for driving scenarios, this encoder-decoder architecture also holds potential for wide use across various semantic communication scenarios. ",
    "url": "https://arxiv.org/abs/2311.13782",
    "authors": [
      "Hao Feng",
      "Yi Yang",
      "Zhu Han"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.13800",
    "title": "Enhancing Intrusion Detection In Internet Of Vehicles Through Federated  Learning",
    "abstract": "Federated learning is a technique of decentralized machine learning. that allows multiple parties to collaborate and learn a shared model without sharing their raw data. Our paper proposes a federated learning framework for intrusion detection in Internet of Vehicles (IOVs) using the CIC-IDS 2017 dataset. The proposed framework employs SMOTE for handling class imbalance, outlier detection for identifying and removing abnormal observations, and hyperparameter tuning to optimize the model's performance. The authors evaluated the proposed framework using various performance metrics and demonstrated its effectiveness in detecting intrusions with other datasets (KDD-Cup 99 and UNSW- NB-15) and conventional classifiers. Furthermore, the proposed framework can protect sensitive data while achieving high intrusion detection performance. ",
    "url": "https://arxiv.org/abs/2311.13800",
    "authors": [
      "Abhishek Sebastian",
      "Pragna R",
      "Sudhakaran G",
      "Renjith P N",
      "Leela Karthikeyan H"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.13806",
    "title": "AdaTyper: Adaptive Semantic Column Type Detection",
    "abstract": "Understanding the semantics of relational tables is instrumental for automation in data exploration and preparation systems. A key source for understanding a table is the semantics of its columns. With the rise of deep learning, learned table representations are now available, which can be applied for semantic type detection and achieve good performance on benchmarks. Nevertheless, we observe a gap between this performance and its applicability in practice. In this paper, we propose AdaTyper to address one of the most critical deployment challenges: adaptation. AdaTyper uses weak-supervision to adapt a hybrid type predictor towards new semantic types and shifted data distributions at inference time, using minimal human feedback. The hybrid type predictor of AdaTyper combines rule-based methods and a light machine learning model for semantic column type detection. We evaluate the adaptation performance of AdaTyper on real-world database tables hand-annotated with semantic column types through crowdsourcing and find that the f1-score improves for new and existing types. AdaTyper approaches an average precision of 0.6 after only seeing 5 examples, significantly outperforming existing adaptation methods based on human-provided regular expressions or dictionaries. ",
    "url": "https://arxiv.org/abs/2311.13806",
    "authors": [
      "Madelon Hulsebos",
      "Paul Groth",
      "Çağatay Demiralp"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.13841",
    "title": "Adversarial defense based on distribution transfer",
    "abstract": "The presence of adversarial examples poses a significant threat to deep learning models and their applications. Existing defense methods provide certain resilience against adversarial examples, but often suffer from decreased accuracy and generalization performance, making it challenging to achieve a trade-off between robustness and generalization. To address this, our paper interprets the adversarial example problem from the perspective of sample distribution and proposes a defense method based on distribution shift, leveraging the distribution transfer capability of a diffusion model for adversarial defense. The core idea is to exploit the discrepancy between normal and adversarial sample distributions to achieve adversarial defense using a pretrained diffusion model. Specifically, an adversarial sample undergoes a forward diffusion process, moving away from the source distribution, followed by a reverse process guided by the protected model (victim model) output to map it back to the normal distribution. Experimental evaluations on CIFAR10 and ImageNet30 datasets are conducted, comparing with adversarial training and input preprocessing methods. For infinite-norm attacks with 8/255 perturbation, accuracy rates of 78.1% and 83.5% are achieved, respectively. For 2-norm attacks with 128/255 perturbation, accuracy rates are 74.3% and 82.5%. Additional experiments considering perturbation amplitude, diffusion iterations, and adaptive attacks also validate the effectiveness of the proposed method. Results demonstrate that even when the attacker has knowledge of the defense, the proposed distribution-based method effectively withstands adversarial examples. It fills the gaps of traditional approaches, restoring high-quality original samples and showcasing superior performance in model robustness and generalization. ",
    "url": "https://arxiv.org/abs/2311.13841",
    "authors": [
      "Jiahao Chen",
      "Diqun Yan",
      "Li Dong"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.13843",
    "title": "Exact Combinatorial Optimization with Temporo-Attentional Graph Neural  Networks",
    "abstract": "Combinatorial optimization finds an optimal solution within a discrete set of variables and constraints. The field has seen tremendous progress both in research and industry. With the success of deep learning in the past decade, a recent trend in combinatorial optimization has been to improve state-of-the-art combinatorial optimization solvers by replacing key heuristic components with machine learning (ML) models. In this paper, we investigate two essential aspects of machine learning algorithms for combinatorial optimization: temporal characteristics and attention. We argue that for the task of variable selection in the branch-and-bound (B&B) algorithm, incorporating the temporal information as well as the bipartite graph attention improves the solver's performance. We support our claims with intuitions and numerical results over several standard datasets used in the literature and competitions. Code is available at: https://developer.huaweicloud.com/develop/aigallery/notebook/detail?id=047c6cf2-8463-40d7-b92f-7b2ca998e935 ",
    "url": "https://arxiv.org/abs/2311.13843",
    "authors": [
      "Mehdi Seyfi",
      "Amin Banitalebi-Dehkordi",
      "Zirui Zhou",
      "Yong Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Mathematical Software (cs.MS)"
    ]
  },
  {
    "id": "arXiv:2311.13864",
    "title": "Which Matters Most in Making Fund Investment Decisions? A  Multi-granularity Graph Disentangled Learning Framework",
    "abstract": "In this paper, we highlight that both conformity and risk preference matter in making fund investment decisions beyond personal interest and seek to jointly characterize these aspects in a disentangled manner. Consequently, we develop a novel M ulti-granularity Graph Disentangled Learning framework named MGDL to effectively perform intelligent matching of fund investment products. Benefiting from the well-established fund graph and the attention module, multi-granularity user representations are derived from historical behaviors to separately express personal interest, conformity and risk preference in a fine-grained way. To attain stronger disentangled representations with specific semantics, MGDL explicitly involve two self-supervised signals, i.e., fund type based contrasts and fund popularity. Extensive experiments in offline and online environments verify the effectiveness of MGDL. ",
    "url": "https://arxiv.org/abs/2311.13864",
    "authors": [
      "Chunjing Gan",
      "Binbin Hu",
      "Bo Huang",
      "Tianyu Zhao",
      "Yingru Lin",
      "Wenliang Zhong",
      "Zhiqiang Zhang",
      "Jun Zhou",
      "Chuan Shi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.13866",
    "title": "Data-Driven Robot Fault Detection and Diagnosis Using Generative Models:  A Modified SFDD Algorithm",
    "abstract": "This paper presents a modification of the data-driven sensor-based fault detection and diagnosis (SFDD) algorithm for online robot monitoring. Our version of the algorithm uses a collection of generative models, in particular restricted Boltzmann machines, each of which represents the distribution of sliding window correlations between a pair of correlated measurements. We use such models in a residual generation scheme, where high residuals generate conflict sets that are then used in a subsequent diagnosis step. As a proof of concept, the framework is evaluated on a mobile logistics robot for the problem of recognising disconnected wheels, such that the evaluation demonstrates the feasibility of the framework (on the faulty data set, the models obtained 88.6% precision and 75.6% recall rates), but also shows that the monitoring results are influenced by the choice of distribution model and the model parameters as a whole. ",
    "url": "https://arxiv.org/abs/2311.13866",
    "authors": [
      "Alex Mitrevski",
      "Paul G. Plöger"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.13885",
    "title": "Can Physics Informed Neural Operators Self Improve?",
    "abstract": "Self-training techniques have shown remarkable value across many deep learning models and tasks. However, such techniques remain largely unexplored when considered in the context of learning fast solvers for systems of partial differential equations (Eg: Neural Operators). In this work, we explore the use of self-training for Fourier Neural Operators (FNO). Neural Operators emerged as a data driven technique, however, data from experiments or traditional solvers is not always readily available. Physics Informed Neural Operators (PINO) overcome this constraint by utilizing a physics loss for the training, however the accuracy of PINO trained without data does not match the performance obtained by training with data. In this work we show that self-training can be used to close this gap in performance. We examine canonical examples, namely the 1D-Burgers and 2D-Darcy PDEs, to showcase the efficacy of self-training. Specifically, FNOs, when trained exclusively with physics loss through self-training, approach 1.07x for Burgers and 1.02x for Darcy, compared to FNOs trained with both data and physics loss. Furthermore, we discover that pseudo-labels can be used for self-training without necessarily training to convergence in each iteration. A consequence of this is that we are able to discover self-training schedules that improve upon the baseline performance of PINO in terms of accuracy as well as time. ",
    "url": "https://arxiv.org/abs/2311.13885",
    "authors": [
      "Ritam Majumdar",
      "Amey Varhade",
      "Shirish Karande",
      "Lovekesh Vig"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Analysis of PDEs (math.AP)"
    ]
  },
  {
    "id": "arXiv:2311.13887",
    "title": "Unsupervised Learning for Topological Classification of Transportation  Networks",
    "abstract": "With increasing urbanization, transportation plays an increasingly critical role in city development. The number of studies on modeling, optimization, simulation, and data analysis of transportation systems is on the rise. Many of these studies utilize transportation test networks to represent real-world transportation systems in urban areas, examining the efficacy of their proposed approaches. Each of these networks exhibits unique characteristics in their topology, making their applications distinct for various study objectives. Despite their widespread use in research, there is a lack of comprehensive study addressing the classification of these networks based on their topological characteristics. This study aims to fill this gap by employing unsupervised learning methods, particularly clustering. We present a comprehensive framework for evaluating various topological network characteristics. Additionally, we employ two dimensionality reduction techniques, namely Principal Component Analysis (PCA) and Isometric Feature Mapping (ISOMAP), to reduce overlaps of highly correlated features and enhance the interpretability of the subsequent classification results. We then utilize two clustering algorithms, K-means and HDBSCAN, to classify 14 transportation networks. The PCA method, followed by the K-means clustering approach, outperforms other alternatives with a Silhouette score of $0.510$, enabling the classification of transportation networks into five clusters. We also provide a detailed discussion on the resulting classification. ",
    "url": "https://arxiv.org/abs/2311.13887",
    "authors": [
      "Sina Sabzekar",
      "Mohammad Reza Valipour Malakshah",
      "Zahra Amini"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.13893",
    "title": "Beamforming Design for Hybrid IRS-aided AF Relay Wireless Networks",
    "abstract": "In this paper, a hybrid IRS-aided amplify-and-forward (AF) relay wireless network is put forward, where the hybrid IRS is made up of passive and active elements. For maximum signal-to-noise ratio (SNR), a low-complexity method based on successive convex approximation and fractional programming (LC-SCA-FP) is proposed to jointly optimize the beamforming matrix at AF relay and the reflecting coefficient matrices at IRS. Simulation results verify that the rate achieved by the proposed LC-SCA-FP method surpass those of the benchmark schemes, namely the passive IRS-aided AF relay and only AF relay network. ",
    "url": "https://arxiv.org/abs/2311.13893",
    "authors": [
      "Xuehui Wang",
      "Yifan Zhao",
      "Feng Shu",
      "Yan Wang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2311.13921",
    "title": "Some Like It Small: Czech Semantic Embedding Models for Industry  Applications",
    "abstract": "This article focuses on the development and evaluation of Small-sized Czech sentence embedding models. Small models are important components for real-time industry applications in resource-constrained environments. Given the limited availability of labeled Czech data, alternative approaches, including pre-training, knowledge distillation, and unsupervised contrastive fine-tuning, are investigated. Comprehensive intrinsic and extrinsic analyses are conducted, showcasing the competitive performance of our models compared to significantly larger counterparts, with approximately 8 times smaller size and 5 times faster speed than conventional Base-sized models. To promote cooperation and reproducibility, both the models and the evaluation pipeline are made publicly accessible. Ultimately, this article presents practical applications of the developed sentence embedding models in Seznam.cz, the Czech search engine. These models have effectively replaced previous counterparts, enhancing the overall search experience for instance, in organic search, featured snippets, and image search. This transition has yielded improved performance. ",
    "url": "https://arxiv.org/abs/2311.13921",
    "authors": [
      "Jiří Bednář",
      "Jakub Náplava",
      "Petra Barančíková",
      "Ondřej Lisický"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2311.13928",
    "title": "Parameter Exchange for Robust Dynamic Domain Generalization",
    "abstract": "Agnostic domain shift is the main reason of model degradation on the unknown target domains, which brings an urgent need to develop Domain Generalization (DG). Recent advances at DG use dynamic networks to achieve training-free adaptation on the unknown target domains, termed Dynamic Domain Generalization (DDG), which compensates for the lack of self-adaptability in static models with fixed weights. The parameters of dynamic networks can be decoupled into a static and a dynamic component, which are designed to learn domain-invariant and domain-specific features, respectively. Based on the existing arts, in this work, we try to push the limits of DDG by disentangling the static and dynamic components more thoroughly from an optimization perspective. Our main consideration is that we can enable the static component to learn domain-invariant features more comprehensively by augmenting the domain-specific information. As a result, the more comprehensive domain-invariant features learned by the static component can then enforce the dynamic component to focus more on learning adaptive domain-specific features. To this end, we propose a simple yet effective Parameter Exchange (PE) method to perturb the combination between the static and dynamic components. We optimize the model using the gradients from both the perturbed and non-perturbed feed-forward jointly to implicitly achieve the aforementioned disentanglement. In this way, the two components can be optimized in a mutually-beneficial manner, which can resist the agnostic domain shifts and improve the self-adaptability on the unknown target domain. Extensive experiments show that PE can be easily plugged into existing dynamic networks to improve their generalization ability without bells and whistles. ",
    "url": "https://arxiv.org/abs/2311.13928",
    "authors": [
      "Luojun Lin",
      "Zhifeng Shen",
      "Zhishu Sun",
      "Yuanlong Yu",
      "Lei Zhang",
      "Weijie Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.13929",
    "title": "MetaFBP: Learning to Learn High-Order Predictor for Personalized Facial  Beauty Prediction",
    "abstract": "Predicting individual aesthetic preferences holds significant practical applications and academic implications for human society. However, existing studies mainly focus on learning and predicting the commonality of facial attractiveness, with little attention given to Personalized Facial Beauty Prediction (PFBP). PFBP aims to develop a machine that can adapt to individual aesthetic preferences with only a few images rated by each user. In this paper, we formulate this task from a meta-learning perspective that each user corresponds to a meta-task. To address such PFBP task, we draw inspiration from the human aesthetic mechanism that visual aesthetics in society follows a Gaussian distribution, which motivates us to disentangle user preferences into a commonality and an individuality part. To this end, we propose a novel MetaFBP framework, in which we devise a universal feature extractor to capture the aesthetic commonality and then optimize to adapt the aesthetic individuality by shifting the decision boundary of the predictor via a meta-learning mechanism. Unlike conventional meta-learning methods that may struggle with slow adaptation or overfitting to tiny support sets, we propose a novel approach that optimizes a high-order predictor for fast adaptation. In order to validate the performance of the proposed method, we build several PFBP benchmarks by using existing facial beauty prediction datasets rated by numerous users. Extensive experiments on these benchmarks demonstrate the effectiveness of the proposed MetaFBP method. ",
    "url": "https://arxiv.org/abs/2311.13929",
    "authors": [
      "Luojun Lin",
      "Zhifeng Shen",
      "Jia-Li Yin",
      "Qipeng Liu",
      "Yuanlong Yu",
      "Weijie Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.13930",
    "title": "Periodically Exchange Teacher-Student for Source-Free Object Detection",
    "abstract": "Source-free object detection (SFOD) aims to adapt the source detector to unlabeled target domain data in the absence of source domain data. Most SFOD methods follow the same self-training paradigm using mean-teacher (MT) framework where the student model is guided by only one single teacher model. However, such paradigm can easily fall into a training instability problem that when the teacher model collapses uncontrollably due to the domain shift, the student model also suffers drastic performance degradation. To address this issue, we propose the Periodically Exchange Teacher-Student (PETS) method, a simple yet novel approach that introduces a multiple-teacher framework consisting of a static teacher, a dynamic teacher, and a student model. During the training phase, we periodically exchange the weights between the static teacher and the student model. Then, we update the dynamic teacher using the moving average of the student model that has already been exchanged by the static teacher. In this way, the dynamic teacher can integrate knowledge from past periods, effectively reducing error accumulation and enabling a more stable training process within the MT-based framework. Further, we develop a consensus mechanism to merge the predictions of two teacher models to provide higher-quality pseudo labels for student model. Extensive experiments on multiple SFOD benchmarks show that the proposed method achieves state-of-the-art performance compared with other related methods, demonstrating the effectiveness and superiority of our method on SFOD task. ",
    "url": "https://arxiv.org/abs/2311.13930",
    "authors": [
      "Qipeng Liu",
      "Luojun Lin",
      "Zhifeng Shen",
      "Zhifeng Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.13934",
    "title": "Robustness-Reinforced Knowledge Distillation with Correlation Distance  and Network Pruning",
    "abstract": "The improvement in the performance of efficient and lightweight models (i.e., the student model) is achieved through knowledge distillation (KD), which involves transferring knowledge from more complex models (i.e., the teacher model). However, most existing KD techniques rely on Kullback-Leibler (KL) divergence, which has certain limitations. First, if the teacher distribution has high entropy, the KL divergence's mode-averaging nature hinders the transfer of sufficient target information. Second, when the teacher distribution has low entropy, the KL divergence tends to excessively focus on specific modes, which fails to convey an abundant amount of valuable knowledge to the student. Consequently, when dealing with datasets that contain numerous confounding or challenging samples, student models may struggle to acquire sufficient knowledge, resulting in subpar performance. Furthermore, in previous KD approaches, we observed that data augmentation, a technique aimed at enhancing a model's generalization, can have an adverse impact. Therefore, we propose a Robustness-Reinforced Knowledge Distillation (R2KD) that leverages correlation distance and network pruning. This approach enables KD to effectively incorporate data augmentation for performance improvement. Extensive experiments on various datasets, including CIFAR-100, FGVR, TinyImagenet, and ImageNet, demonstrate our method's superiority over current state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2311.13934",
    "authors": [
      "Seonghak Kim",
      "Gyeongdo Ham",
      "Yucheol Cho",
      "Daeshik Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.13946",
    "title": "Weakly-Supervised Video Moment Retrieval via Regularized Two-Branch  Proposal Networks with Erasing Mechanism",
    "abstract": "Video moment retrieval is to identify the target moment according to the given sentence in an untrimmed video. Due to temporal boundary annotations of the video are extremely time-consuming to acquire, modeling in the weakly-supervised setting is increasingly focused, where we only have access to the video-sentence pairs during training. Most existing weakly-supervised methods adopt a MIL-based framework to develop inter-sample confrontment, but neglect the intra-sample confrontment between moments with similar semantics. Therefore, these methods fail to distinguish the correct moment from plausible negative moments. Further, the previous attention models in cross-modal interaction tend to focus on a few dominant words exorbitantly, ignoring the comprehensive video-sentence correspondence. In this paper, we propose a novel Regularized Two-Branch Proposal Network with Erasing Mechanism to consider the inter-sample and intra-sample confrontments simultaneously. Concretely, we first devise a language-aware visual filter to generate both enhanced and suppressed video streams. Then, we design the sharable two-branch proposal module to generate positive and plausible negative proposals from the enhanced and suppressed branch respectively, contributing to sufficient confrontment. Besides, we introduce an attention-guided dynamic erasing mechanism in enhanced branch to discover the complementary video-sentence relation. Moreover, we apply two types of proposal regularization to stabilize the training process and improve model performance. The extensive experiments on ActivityCaption, Charades-STA and DiDeMo datasets show the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2311.13946",
    "authors": [
      "Haoyuan Li",
      "Zhou Zhao",
      "Zhu Zhang",
      "Zhijie Lin"
    ],
    "subjectives": [
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2311.13949",
    "title": "Optimal Power Flow in Highly Renewable Power System Based on Attention  Neural Networks",
    "abstract": "The Optimal Power Flow (OPF) problem is pivotal for power system operations, guiding generator output and power distribution to meet demand at minimized costs, while adhering to physical and engineering constraints. The integration of renewable energy sources, like wind and solar, however, poses challenges due to their inherent variability. This variability, driven largely by changing weather conditions, demands frequent recalibrations of power settings, thus necessitating recurrent OPF resolutions. This task is daunting using traditional numerical methods, particularly for extensive power systems. In this work, we present a cutting-edge, physics-informed machine learning methodology, trained using imitation learning and historical European weather datasets. Our approach directly correlates electricity demand and weather patterns with power dispatch and generation, circumventing the iterative requirements of traditional OPF solvers. This offers a more expedient solution apt for real-time applications. Rigorous evaluations on aggregated European power systems validate our method's superiority over existing data-driven techniques in OPF solving. By presenting a quick, robust, and efficient solution, this research sets a new standard in real-time OPF resolution, paving the way for more resilient power systems in the era of renewable energy. ",
    "url": "https://arxiv.org/abs/2311.13949",
    "authors": [
      "Chen Li",
      "Alexander Kies",
      "Kai Zhou",
      "Markus Schlott",
      "Omar El Sayed",
      "Mariia Bilousova",
      "Horst Stoecker"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.13950",
    "title": "Object Location Prediction in Real-time using LSTM Neural Network and  Polynomial Regression",
    "abstract": "This paper details the design and implementation of a system for predicting and interpolating object location coordinates. Our solution is based on processing inertial measurements and global positioning system data through a Long Short-Term Memory (LSTM) neural network and polynomial regression. LSTM is a type of recurrent neural network (RNN) particularly suited for processing data sequences and avoiding the long-term dependency problem. We employed data from real-world vehicles and the global positioning system (GPS) sensors. A critical pre-processing step was developed to address varying sensor frequencies and inconsistent GPS time steps and dropouts. The LSTM-based system's performance was compared with the Kalman Filter. The system was tuned to work in real-time with low latency and high precision. We tested our system on roads under various driving conditions, including acceleration, turns, deceleration, and straight paths. We tested our proposed solution's accuracy and inference time and showed that it could perform in real-time. Our LSTM-based system yielded an average error of 0.11 meters with an inference time of 2 ms. This represents a 76\\% reduction in error compared to the traditional Kalman filter method, which has an average error of 0.46 meters with a similar inference time to the LSTM-based system. ",
    "url": "https://arxiv.org/abs/2311.13950",
    "authors": [
      "Petar Stojković",
      "Predrag Tadić"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.13954",
    "title": "Electric Network Frequency Optical Sensing Devices",
    "abstract": "Electric Network Frequency (ENF) acts as a fingerprint in multimedia forensics applications. In indoor environments, ENF variations affect the intensity of light sources connected to power mains. Accordingly, the light intensity variations captured by sensing devices can be exploited to estimate the ENF. A first optical sensing device based on a photodiode is developed for capturing ENF variations in indoor lighting environments. In addition, a device that captures the ENF directly from power mains is implemented. This device serves as a ground truth ENF collector. Video recordings captured by a camera are also employed to estimate the ENF. The camera serves as a second optical sensor. The factors affecting the ENF estimation are thoroughly studied. The maximum correlation coefficient between the ENF estimated by the two optical sensors and that estimated directly from power mains is used to measure the estimation accuracy. The paper's major contribution is in the disclosure of extensive experimental evidence on ENF estimation in scenes ranging from static ones capturing a white wall to non-static ones, including human activity. ",
    "url": "https://arxiv.org/abs/2311.13954",
    "authors": [
      "Christos Moysiadis",
      "Georgios Karantaidis",
      "Constantine Kotropoulos"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2311.13959",
    "title": "RankFeat\\&RankWeight: Rank-1 Feature/Weight Removal for  Out-of-distribution Detection",
    "abstract": "The task of out-of-distribution (OOD) detection is crucial for deploying machine learning models in real-world settings. In this paper, we observe that the singular value distributions of the in-distribution (ID) and OOD features are quite different: the OOD feature matrix tends to have a larger dominant singular value than the ID feature, and the class predictions of OOD samples are largely determined by it. This observation motivates us to propose \\texttt{RankFeat}, a simple yet effective \\emph{post hoc} approach for OOD detection by removing the rank-1 matrix composed of the largest singular value and the associated singular vectors from the high-level feature. \\texttt{RankFeat} achieves \\emph{state-of-the-art} performance and reduces the average false positive rate (FPR95) by 17.90\\% compared with the previous best method. The success of \\texttt{RankFeat} motivates us to investigate whether a similar phenomenon would exist in the parameter matrices of neural networks. We thus propose \\texttt{RankWeight} which removes the rank-1 weight from the parameter matrices of a single deep layer. Our \\texttt{RankWeight}is also \\emph{post hoc} and only requires computing the rank-1 matrix once. As a standalone approach, \\texttt{RankWeight} has very competitive performance against other methods across various backbones. Moreover, \\texttt{RankWeight} enjoys flexible compatibility with a wide range of OOD detection methods. The combination of \\texttt{RankWeight} and \\texttt{RankFeat} refreshes the new \\emph{state-of-the-art} performance, achieving the FPR95 as low as 16.13\\% on the ImageNet-1k benchmark. Extensive ablation studies and comprehensive theoretical analyses are presented to support the empirical results. ",
    "url": "https://arxiv.org/abs/2311.13959",
    "authors": [
      "Yue Song",
      "Nicu Sebe",
      "Wei Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.13980",
    "title": "On the Permutation-Representation Number of Bipartite Graphs using  Neighborhood Graphs",
    "abstract": "The problems of determining the permutation-representation number (prn) and the representation number of bipartite graphs are open in the literature. Moreover, the decision problem corresponding to the determination of the prn of a bipartite graph is NP-complete. However, these numbers were established for certain subclasses of bipartite graphs, e.g., for crown graphs. Further, it was conjectured that the crown graphs have the highest representation number among the bipartite graphs. In this work, first, we reconcile the relation between the prn of a comparability graph and the dimension of its induced poset and review the upper bounds on the prn of bipartite graphs. Then, we study the prn of bipartite graphs using the notion called neighborhood graphs. This approach substantiates the aforesaid conjecture and gives us theoretical evidence. In this connection, we devise a polynomial-time procedure to construct a word that represents a given bipartite graph permutationally. Accordingly, we provide a better upper bound for the prn of bipartite graphs. Further, we construct a class of bipartite graphs, viz., extended crown graphs, defined over posets and investigate its prn using the neighborhood graphs. ",
    "url": "https://arxiv.org/abs/2311.13980",
    "authors": [
      "Khyodeno Mozhui",
      "K. V. Krishna"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2311.13982",
    "title": "Probabilistic Tree-of-thought Reasoning for Answering  Knowledge-intensive Complex Questions",
    "abstract": "Large language models (LLMs) are capable of answering knowledge-intensive complex questions with chain-of-thought (CoT) reasoning. However, they tend to generate factually incorrect reasoning steps when the required knowledge is not available or up-to-date in models' parameters. Recent works turn to retrieving external knowledge to augment CoT reasoning. Despite being promising, these chain-based methods suffer from: 1) Negative retrieval. Unnecessary or incorrect retrieval may mislead the reasoning; 2) Limited sight. Lacking the ability to look backward or forward, a local error in one step will propagate along the chain. In this paper, we propose a novel approach: Probabilistic Tree-of-thought Reasoning (ProbTree). First, LLMs translate a complex question into a query tree, in which each non-root node denotes a sub-question of its parent node. Then, probabilistic reasoning is conducted over the tree, by solving questions from leaf to root considering the confidence of both question decomposing and answering. During reasoning, for leaf nodes, LLMs choose a more confident answer from Closed-book QA that employs parametric knowledge and Open-book QA that employs retrieved external knowledge, thus eliminating the negative retrieval problem. For non-leaf nodes, with the hierarchical structure, LLMs have broader sights and are able to globally reason with the information from child nodes, thus recovering from local errors. The experiments on three Complex QA datasets under the open-domain setting show that our approach outperforms SOTA methods significantly, demonstrating the effect of probabilistic tree-of-thought reasoning. ",
    "url": "https://arxiv.org/abs/2311.13982",
    "authors": [
      "Shulin Cao",
      "Jiajie Zhang",
      "Jiaxin Shi",
      "Xin Lv",
      "Zijun Yao",
      "Qi Tian",
      "Juanzi Li",
      "Lei Hou"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.14003",
    "title": "Direct Preference-Based Evolutionary Multi-Objective Optimization with  Dueling Bandit",
    "abstract": "Optimization problems find widespread use in both single-objective and multi-objective scenarios. In practical applications, users aspire for solutions that converge to the region of interest (ROI) along the Pareto front (PF). While the conventional approach involves approximating a fitness function or an objective function to reflect user preferences, this paper explores an alternative avenue. Specifically, we aim to discover a method that sidesteps the need for calculating the fitness function, relying solely on human feedback. Our proposed approach entails conducting direct preference learning facilitated by an active dueling bandit algorithm. The experimental phase is structured into three sessions. Firstly, we assess the performance of our active dueling bandit algorithm. Secondly, we implement our proposed method within the context of Multi-objective Evolutionary Algorithms (MOEAs). Finally, we deploy our method in a practical problem, specifically in protein structure prediction (PSP). This research presents a novel interactive preference-based MOEA framework that not only addresses the limitations of traditional techniques but also unveils new possibilities for optimization problems. ",
    "url": "https://arxiv.org/abs/2311.14003",
    "authors": [
      "Tian Huang",
      "Ke Li"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.14005",
    "title": "When Side-Channel Attacks Break the Black-Box Property of Embedded  Artificial Intelligence",
    "abstract": "Artificial intelligence, and specifically deep neural networks (DNNs), has rapidly emerged in the past decade as the standard for several tasks from specific advertising to object detection. The performance offered has led DNN algorithms to become a part of critical embedded systems, requiring both efficiency and reliability. In particular, DNNs are subject to malicious examples designed in a way to fool the network while being undetectable to the human observer: the adversarial examples. While previous studies propose frameworks to implement such attacks in black box settings, those often rely on the hypothesis that the attacker has access to the logits of the neural network, breaking the assumption of the traditional black box. In this paper, we investigate a real black box scenario where the attacker has no access to the logits. In particular, we propose an architecture-agnostic attack which solve this constraint by extracting the logits. Our method combines hardware and software attacks, by performing a side-channel attack that exploits electromagnetic leakages to extract the logits for a given input, allowing an attacker to estimate the gradients and produce state-of-the-art adversarial examples to fool the targeted neural network. Through this example of adversarial attack, we demonstrate the effectiveness of logits extraction using side-channel as a first step for more general attack frameworks requiring either the logits or the confidence scores. ",
    "url": "https://arxiv.org/abs/2311.14005",
    "authors": [
      "Benoit Coqueret",
      "Mathieu Carbone",
      "Olivier Sentieys",
      "Gabriel Zaid"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.14012",
    "title": "Shadow: A Novel Loss Function for Efficient Training in Siamese Networks",
    "abstract": "Despite significant recent advances in similarity detection tasks, existing approaches pose substantial challenges under memory constraints. One of the primary reasons for this is the use of computationally expensive metric learning loss functions such as Triplet Loss in Siamese networks. In this paper, we present a novel loss function called Shadow Loss that compresses the dimensions of an embedding space during loss calculation without loss of performance. The distance between the projections of the embeddings is learned from inputs on a compact projection space where distances directly correspond to a measure of class similarity. Projecting on a lower-dimension projection space, our loss function converges faster, and the resulting classified image clusters have higher inter-class and smaller intra-class distances. Shadow Loss not only reduces embedding dimensions favoring memory constraint devices but also consistently performs better than the state-of-the-art Triplet Margin Loss by an accuracy of 5\\%-10\\% across diverse datasets. The proposed loss function is also model agnostic, upholding its performance across several tested models. Its effectiveness and robustness across balanced, imbalanced, medical, and non-medical image datasets suggests that it is not specific to a particular model or dataset but demonstrates superior performance consistently while using less memory and computation. ",
    "url": "https://arxiv.org/abs/2311.14012",
    "authors": [
      "Alif Elham Khan",
      "Mohammad Junayed Hasan",
      "Humayra Anjum",
      "Nabeel Mohammed"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.14029",
    "title": "Understanding the Vulnerability of CLIP to Image Compression",
    "abstract": "CLIP is a widely used foundational vision-language model that is used for zero-shot image recognition and other image-text alignment tasks. We demonstrate that CLIP is vulnerable to change in image quality under compression. This surprising result is further analysed using an attribution method-Integrated Gradients. Using this attribution method, we are able to better understand both quantitatively and qualitatively exactly the nature in which the compression affects the zero-shot recognition accuracy of this model. We evaluate this extensively on CIFAR-10 and STL-10. Our work provides the basis to understand this vulnerability of CLIP and can help us develop more effective methods to improve the robustness of CLIP and other vision-language models. ",
    "url": "https://arxiv.org/abs/2311.14029",
    "authors": [
      "Cangxiong Chen",
      "Vinay P. Namboodiri",
      "Julian Padget"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14030",
    "title": "PrivateLoRA For Efficient Privacy Preserving LLM",
    "abstract": "End users face a choice between privacy and efficiency in current Large Language Model (LLM) service paradigms. In cloud-based paradigms, users are forced to compromise data locality for generation quality and processing speed. Conversely, edge device paradigms maintain data locality but fail to deliver satisfactory performance. In this work, we propose a novel LLM service paradigm that distributes privacy-sensitive computation on edge devices and shared computation in the cloud. Only activations are transmitted between the central cloud and edge devices to ensure data locality. Our core innovation, PrivateLoRA, addresses the challenging communication overhead by exploiting the low rank of residual activations, achieving over 95% communication reduction. Consequently, PrivateLoRA effectively maintains data locality and is extremely resource efficient. Under standard 5G networks, PrivateLoRA achieves throughput over 300% of device-only solutions for 7B models and over 80% of an A100 GPU for 33B models. PrivateLoRA also provides tuning performance comparable to LoRA for advanced personalization. Our approach democratizes access to state-of-the-art generative AI for edge devices, paving the way for more tailored LLM experiences for the general public. To our knowledge, our proposed framework is the first efficient and privacy-preserving LLM solution in the literature. ",
    "url": "https://arxiv.org/abs/2311.14030",
    "authors": [
      "Yiming Wang",
      "Yu Lin",
      "Xiaodong Zeng",
      "Guannan Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.14037",
    "title": "AdapterFL: Adaptive Heterogeneous Federated Learning for  Resource-constrained Mobile Computing Systems",
    "abstract": "Federated Learning (FL) enables collaborative learning of large-scale distributed clients without data sharing. However, due to the disparity of computing resources among massive mobile computing devices, the performance of traditional homogeneous model-based Federated Learning (FL) is seriously limited. On the one hand, to achieve model training in all the diverse clients, mobile computing systems can only use small low-performance models for collaborative learning. On the other hand, devices with high computing resources cannot train a high-performance large model with their insufficient raw data. To address the resource-constrained problem in mobile computing systems, we present a novel heterogeneous FL approach named AdapterFL, which uses a model reassemble strategy to facilitate collaborative training of massive heterogeneous mobile devices adaptively. Specifically, we select multiple candidate heterogeneous models based on the computing performance of massive mobile devices and then divide each heterogeneous model into two partitions. By reassembling the partitions, we can generate models with varied sizes that are combined by the partial parameters of the large model with the partial parameters of the small model. Using these reassembled models for FL training, we can train the partial parameters of the large model using low-performance devices. In this way, we can alleviate performance degradation in large models due to resource constraints. The experimental results show that AdapterFL can achieve up to 12\\% accuracy improvement compared to the state-of-the-art heterogeneous federated learning methods in resource-constrained scenarios. ",
    "url": "https://arxiv.org/abs/2311.14037",
    "authors": [
      "Ruixuan Liu",
      "Ming Hu",
      "Zeke Xia",
      "Jun Xia",
      "Pengyu Zhang",
      "Yihao Huang",
      "Yang Liu",
      "Mingsong Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14045",
    "title": "Physics Informed Neural Network Framework for Unsteady Discretized  Reduced Order System",
    "abstract": "This work addresses the development of a physics-informed neural network (PINN) with a loss term derived from a discretized time-dependent reduced-order system. In this work, first, the governing equations are discretized using a finite difference scheme (whereas, any other discretization technique can be adopted), then projected on a reduced or latent space using the Proper Orthogonal Decomposition (POD)-Galerkin approach and next, the residual arising from discretized reduced order equation is considered as an additional loss penalty term alongside the data-driven loss term using different variants of deep learning method such as Artificial neural network (ANN), Long Short-Term Memory based neural network (LSTM). The LSTM neural network has been proven to be very effective for time-dependent problems in a purely data-driven environment. The current work demonstrates the LSTM network's potential over ANN networks in physics-informed neural networks (PINN) as well. The potential of using discretized governing equations instead of continuous form lies in the flexibility of input to the PINN. Different sizes of data ranging from small, medium to big datasets are used to assess the potential of discretized-physics-informed neural networks when there is very sparse or no data available. The proposed methods are applied to a pitch-plunge airfoil motion governed by rigid-body dynamics and a one-dimensional viscous Burgers' equation. The current work also demonstrates the prediction capability of various discretized-physics-informed neural networks outside the domain where the data is available or governing equation-based residuals are minimized. ",
    "url": "https://arxiv.org/abs/2311.14045",
    "authors": [
      "Rahul Halder",
      "Giovanni Stabile",
      "Gianluigi Rozza"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2311.14053",
    "title": "Coevolution of Neural Architectures and Features for Stock Market  Forecasting: A Multi-objective Decision Perspective",
    "abstract": "In a multi objective setting, a portfolio manager's highly consequential decisions can benefit from assessing alternative forecasting models of stock index movement. The present investigation proposes a new approach to identify a set of nondominated neural network models for further selection by the decision maker. A new coevolution approach is proposed to simultaneously select the features and topology of neural networks (collectively referred to as neural architecture), where the features are viewed from a topological perspective as input neurons. Further, the coevolution is posed as a multicriteria problem to evolve sparse and efficacious neural architectures. The well known dominance and decomposition based multiobjective evolutionary algorithms are augmented with a nongeometric crossover operator to diversify and balance the search for neural architectures across conflicting criteria. Moreover, the coevolution is augmented to accommodate the data based implications of distinct market behaviors prior to and during the ongoing COVID 19 pandemic. A detailed comparative evaluation is carried out with the conventional sequential approach of feature selection followed by neural topology design, as well as a scalarized coevolution approach. The results on the NASDAQ index in pre and peri COVID time windows convincingly demonstrate that the proposed coevolution approach can evolve a set of nondominated neural forecasting models with better generalization capabilities. ",
    "url": "https://arxiv.org/abs/2311.14053",
    "authors": [
      "Faizal Hafiz",
      "Jan Broekaert",
      "Davide La Torre",
      "Akshya Swain"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2311.14057",
    "title": "Assessing the Impact of Noise on Quantum Neural Networks: An  Experimental Analysis",
    "abstract": "In the race towards quantum computing, the potential benefits of quantum neural networks (QNNs) have become increasingly apparent. However, Noisy Intermediate-Scale Quantum (NISQ) processors are prone to errors, which poses a significant challenge for the execution of complex algorithms or quantum machine learning. To ensure the quality and security of QNNs, it is crucial to explore the impact of noise on their performance. This paper provides a comprehensive analysis of the impact of noise on QNNs, examining the Mottonen state preparation algorithm under various noise models and studying the degradation of quantum states as they pass through multiple layers of QNNs. Additionally, the paper evaluates the effect of noise on the performance of pre-trained QNNs and highlights the challenges posed by noise models in quantum computing. The findings of this study have significant implications for the development of quantum software, emphasizing the importance of prioritizing stability and noise-correction measures when developing QNNs to ensure reliable and trustworthy results. This paper contributes to the growing body of literature on quantum computing and quantum machine learning, providing new insights into the impact of noise on QNNs and paving the way towards the development of more robust and efficient quantum algorithms. ",
    "url": "https://arxiv.org/abs/2311.14057",
    "authors": [
      "Erik B. Terres Escudero",
      "Danel Arias Alamo",
      "Oier Mentxaka Gómez",
      "Pablo García Bringas"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.14058",
    "title": "Identification for Tree-shaped Structural Causal Models in Polynomial  Time",
    "abstract": "Linear structural causal models (SCMs) are used to express and analyse the relationships between random variables. Direct causal effects are represented as directed edges and confounding factors as bidirected edges. Identifying the causal parameters from correlations between the nodes is an open problem in artificial intelligence. In this paper, we study SCMs whose directed component forms a tree. Van der Zander et al. (AISTATS'22, PLMR 151, pp. 6770--6792, 2022) give a PSPACE-algorithm for the identification problem in this case, which is a significant improvement over the general Gr\\\"obner basis approach, which has doubly-exponential time complexity in the number of structural parameters. In this work, we present a randomized polynomial-time algorithm, which solves the identification problem for tree-shaped SCMs. For every structural parameter, our algorithms decides whether it is generically identifiable, generically 2-identifiable, or generically unidentifiable. (No other cases can occur.) In the first two cases, it provides one or two fractional affine square root terms of polynomials (FASTPs) for the corresponding parameter, respectively. ",
    "url": "https://arxiv.org/abs/2311.14058",
    "authors": [
      "Aaryan Gupta",
      "Markus Bläser"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2311.14064",
    "title": "HGCLIP: Exploring Vision-Language Models with Graph Representations for  Hierarchical Understanding",
    "abstract": "Object categories are typically organized into a multi-granularity taxonomic hierarchy. When classifying categories at different hierarchy levels, traditional uni-modal approaches focus primarily on image features, revealing limitations in complex scenarios. Recent studies integrating Vision-Language Models (VLMs) with class hierarchies have shown promise, yet they fall short of fully exploiting the hierarchical relationships. These efforts are constrained by their inability to perform effectively across varied granularity of categories. To tackle this issue, we propose a novel framework (HGCLIP) that effectively combines CLIP with a deeper exploitation of the Hierarchical class structure via Graph representation learning. We explore constructing the class hierarchy into a graph, with its nodes representing the textual or image features of each category. After passing through a graph encoder, the textual features incorporate hierarchical structure information, while the image features emphasize class-aware features derived from prototypes through the attention mechanism. Our approach demonstrates significant improvements on both generic and fine-grained visual recognition benchmarks. Our codes are fully available at https://github.com/richard-peng-xia/HGCLIP. ",
    "url": "https://arxiv.org/abs/2311.14064",
    "authors": [
      "Peng Xia",
      "Xingtong Yu",
      "Ming Hu",
      "Lie Ju",
      "Zhiyong Wang",
      "Peibo Duan",
      "Zongyuan Ge"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.14078",
    "title": "Machine learning-based decentralized TDMA for VLC IoT networks",
    "abstract": "In this paper, a machine learning-based decentralized time division multiple access (TDMA) algorithm for visible light communication (VLC) Internet of Things (IoT) networks is proposed. The proposed algorithm is based on Q-learning, a reinforcement learning algorithm. This paper considers a decentralized condition in which there is no coordinator node for sending synchronization frames and assigning transmission time slots to other nodes. The proposed algorithm uses a decentralized manner for synchronization, and each node uses the Q-learning algorithm to find the optimal transmission time slot for sending data without collisions. The proposed algorithm is implemented on a VLC hardware system, which had been designed and implemented in our laboratory. Average reward, convergence time, goodput, average delay, and data packet size are evaluated parameters. The results show that the proposed algorithm converges quickly and provides collision-free decentralized TDMA for the network. The proposed algorithm is compared with carrier-sense multiple access with collision avoidance (CSMA/CA) algorithm as a potential selection for decentralized VLC IoT networks. The results show that the proposed algorithm provides up to 61% more goodput and up to 49% less average delay than CSMA/CA. ",
    "url": "https://arxiv.org/abs/2311.14078",
    "authors": [
      "Armin Makvandi",
      "Yousef Seifi Kavian"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14094",
    "title": "Robust Decision Aggregation with Second-order Information",
    "abstract": "We consider a decision aggregation problem with two experts who each make a binary recommendation after observing a private signal about an unknown binary world state. An agent, who does not know the joint information structure between signals and states, sees the experts' recommendations and aims to match the action with the true state. Under the scenario, we study whether supplemented additionally with second-order information (each expert's forecast on the other's recommendation) could enable a better aggregation. We adopt a minimax regret framework to evaluate the aggregator's performance, by comparing it to an omniscient benchmark that knows the joint information structure. With general information structures, we show that second-order information provides no benefit. No aggregator can improve over a trivial aggregator, which always follows the first expert's recommendation. However, positive results emerge when we assume experts' signals are conditionally independent given the world state. When the aggregator is deterministic, we present a robust aggregator that leverages second-order information, which can significantly outperform counterparts without it. Second, when two experts are homogeneous, by adding a non-degenerate assumption on the signals, we demonstrate that random aggregators using second-order information can surpass optimal ones without it. In the remaining settings, the second-order information is not beneficial. We also extend the above results to the setting when the aggregator's utility function is more general. ",
    "url": "https://arxiv.org/abs/2311.14094",
    "authors": [
      "Yuqi Pan",
      "Zhaohua Chen",
      "Yuqing Kong"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14095",
    "title": "Video Anomaly Detection using GAN",
    "abstract": "Accounting for the increased concern for public safety, automatic abnormal event detection and recognition in a surveillance scene is crucial. It is a current open study subject because of its intricacy and utility. The identification of aberrant events automatically, it's a difficult undertaking because everyone's idea of abnormality is different. A typical occurrence in one circumstance could be seen as aberrant in another. Automatic anomaly identification becomes particularly challenging in the surveillance footage with a large crowd due to congestion and high occlusion. With the use of machine learning techniques, this thesis study aims to offer the solution for this use case so that human resources won't be required to keep an eye out for any unusual activity in the surveillance system records. We have developed a novel generative adversarial network (GAN) based anomaly detection model. This model is trained such that it learns together about constructing a high dimensional picture space and determining the latent space from the video's context. The generator uses a residual Autoencoder architecture made up of a multi-stage channel attention-based decoder and a two-stream, deep convolutional encoder that can realise both spatial and temporal data. We have also offered a technique for refining the GAN model that reduces training time while also generalising the model by utilising transfer learning between datasets. Using a variety of assessment measures, we compare our model to the current state-of-the-art techniques on four benchmark datasets. The empirical findings indicate that, in comparison to existing techniques, our network performs favourably on all datasets. ",
    "url": "https://arxiv.org/abs/2311.14095",
    "authors": [
      "Anikeit Sethi",
      "Krishanu Saini",
      "Sai Mounika Mididoddi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.14097",
    "title": "ACT: Adversarial Consistency Models",
    "abstract": "Though diffusion models excel in image generation, their step-by-step denoising leads to slow generation speeds. Consistency training addresses this issue with single-step sampling but often produces lower-quality generations and requires high training costs. In this paper, we show that optimizing consistency training loss minimizes the Wasserstein distance between target and generated distributions. As timestep increases, the upper bound accumulates previous consistency training losses. Therefore, larger batch sizes are needed to reduce both current and accumulated losses. We propose Adversarial Consistency Training (ACT), which directly minimizes the Jensen-Shannon (JS) divergence between distributions at each timestep using a discriminator. Theoretically, ACT enhances generation quality, and convergence. By incorporating a discriminator into the consistency training framework, our method achieves improved FID scores on CIFAR10 and ImageNet 64$\\times$64, retains zero-shot image inpainting capabilities, and uses less than $1/6$ of the original batch size and fewer than $1/2$ of the model parameters and training steps compared to the baseline method, this leads to a substantial reduction in resource consumption. ",
    "url": "https://arxiv.org/abs/2311.14097",
    "authors": [
      "Fei Kong",
      "Jinhao Duan",
      "Lichao Sun",
      "Hao Cheng",
      "Renjing Xu",
      "Hengtao Shen",
      "Xiaofeng Zhu",
      "Xiaoshuang Shi",
      "Kaidi Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.14114",
    "title": "SySMOL: A Hardware-software Co-design Framework for Ultra-Low and  Fine-Grained Mixed-Precision Neural Networks",
    "abstract": "Recent advancements in quantization and mixed-precision techniques offer significant promise for improving the run-time and energy efficiency of neural networks. In this work, we further showed that neural networks, wherein individual parameters or activations can take on different precisions ranging between 1 and 4 bits, can achieve accuracies comparable to or exceeding the full-precision counterparts. However, the deployment of such networks poses numerous challenges, stemming from the necessity to manage and control the compute/communication/storage requirements associated with these extremely fine-grained mixed precisions for each piece of data. There is a lack of existing efficient hardware and system-level support tailored to these unique and challenging requirements. Our research introduces the first novel holistic hardware-software co-design approach for these networks, which enables a continuous feedback loop between hardware design, training, and inference to facilitate systematic design exploration. As a proof-of-concept, we illustrate this co-design approach by designing new, configurable CPU SIMD architectures tailored for these networks, tightly integrating the architecture with new system-aware training and inference techniques. We perform systematic design space exploration using this framework to analyze various tradeoffs. The design for mixed-precision networks that achieves optimized tradeoffs corresponds to an architecture that supports 1, 2, and 4-bit fixed-point operations with four configurable precision patterns, when coupled with system-aware training and inference optimization -- networks trained for this design achieve accuracies that closely match full-precision accuracies, while compressing and improving run-time efficiency of the neural networks drastically by 10-20x, compared to full-precision networks. ",
    "url": "https://arxiv.org/abs/2311.14114",
    "authors": [
      "Cyrus Zhou",
      "Vaughn Richard",
      "Pedro Savarese",
      "Zachary Hassman",
      "Michael Maire",
      "Michael DiBrino",
      "Yanjing Li"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Machine Learning (cs.LG)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2311.14120",
    "title": "Weight fluctuations in (deep) linear neural networks and a derivation of  the inverse-variance flatness relation",
    "abstract": "We investigate the stationary (late-time) training regime of single- and two-layer linear neural networks within the continuum limit of stochastic gradient descent (SGD) for synthetic Gaussian data. In the case of a single-layer network in the weakly oversampled regime, the spectrum of the noise covariance matrix deviates notably from the Hessian, which can be attributed to the broken detailed balance of SGD dynamics. The weight fluctuations are in this case generally anisotropic, but experience an isotropic loss. For a two-layer network, we obtain the stochastic dynamics of the weights in each layer and analyze the associated stationary covariances. We identify the inter-layer coupling as a new source of anisotropy for the weight fluctuations. In contrast to the single-layer case, the weight fluctuations experience an anisotropic loss, the flatness of which is inversely related to the fluctuation variance. We thereby provide an analytical derivation of the recently observed inverse variance-flatness relation in a deep linear network model. ",
    "url": "https://arxiv.org/abs/2311.14120",
    "authors": [
      "Markus Gross",
      "Arne P. Raulf",
      "Christoph Räth"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Statistical Mechanics (cond-mat.stat-mech)"
    ]
  },
  {
    "id": "arXiv:2311.14126",
    "title": "Towards Auditing Large Language Models: Improving Text-based Stereotype  Detection",
    "abstract": "Large Language Models (LLM) have made significant advances in the recent past becoming more mainstream in Artificial Intelligence (AI) enabled human-facing applications. However, LLMs often generate stereotypical output inherited from historical data, amplifying societal biases and raising ethical concerns. This work introduces i) the Multi-Grain Stereotype Dataset, which includes 52,751 instances of gender, race, profession and religion stereotypic text and ii) a novel stereotype classifier for English text. We design several experiments to rigorously test the proposed model trained on the novel dataset. Our experiments show that training the model in a multi-class setting can outperform the one-vs-all binary counterpart. Consistent feature importance signals from different eXplainable AI tools demonstrate that the new model exploits relevant text features. We utilise the newly created model to assess the stereotypic behaviour of the popular GPT family of models and observe the reduction of bias over time. In summary, our work establishes a robust and practical framework for auditing and evaluating the stereotypic bias in LLM. ",
    "url": "https://arxiv.org/abs/2311.14126",
    "authors": [
      "Wu Zekun",
      "Sahan Bulathwela",
      "Adriano Soares Koshiyama"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14127",
    "title": "Byzantine Robustness and Partial Participation Can Be Achieved  Simultaneously: Just Clip Gradient Differences",
    "abstract": "Distributed learning has emerged as a leading paradigm for training large machine learning models. However, in real-world scenarios, participants may be unreliable or malicious, posing a significant challenge to the integrity and accuracy of the trained models. Byzantine fault tolerance mechanisms have been proposed to address these issues, but they often assume full participation from all clients, which is not always practical due to the unavailability of some clients or communication constraints. In our work, we propose the first distributed method with client sampling and provable tolerance to Byzantine workers. The key idea behind the developed method is the use of gradient clipping to control stochastic gradient differences in recursive variance reduction. This allows us to bound the potential harm caused by Byzantine workers, even during iterations when all sampled clients are Byzantine. Furthermore, we incorporate communication compression into the method to enhance communication efficiency. Under quite general assumptions, we prove convergence rates for the proposed method that match the existing state-of-the-art (SOTA) theoretical results. ",
    "url": "https://arxiv.org/abs/2311.14127",
    "authors": [
      "Grigory Malinovsky",
      "Peter Richtárik",
      "Samuel Horváth",
      "Eduard Gorbunov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2311.14131",
    "title": "Exactly conservative physics-informed neural networks and deep operator  networks for dynamical systems",
    "abstract": "We introduce a method for training exactly conservative physics-informed neural networks and physics-informed deep operator networks for dynamical systems. The method employs a projection-based technique that maps a candidate solution learned by the neural network solver for any given dynamical system possessing at least one first integral onto an invariant manifold. We illustrate that exactly conservative physics-informed neural network solvers and physics-informed deep operator networks for dynamical systems vastly outperform their non-conservative counterparts for several real-world problems from the mathematical sciences. ",
    "url": "https://arxiv.org/abs/2311.14131",
    "authors": [
      "Elsa Cardoso-Bihlo",
      "Alex Bihlo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2311.14139",
    "title": "Machine Learning For An Explainable Cost Prediction of Medical Insurance",
    "abstract": "Predictive modeling in healthcare continues to be an active actuarial research topic as more insurance companies aim to maximize the potential of Machine Learning approaches to increase their productivity and efficiency. In this paper, the authors deployed three regression-based ensemble ML models that combine variations of decision trees through Extreme Gradient Boosting, Gradient-boosting Machine, and Random Forest) methods in predicting medical insurance costs. Explainable Artificial Intelligence methods SHapley Additive exPlanations and Individual Conditional Expectation plots were deployed to discover and explain the key determinant factors that influence medical insurance premium prices in the dataset. The dataset used comprised 986 records and is publicly available in the KAGGLE repository. The models were evaluated using four performance evaluation metrics, including R-squared, Mean Absolute Error, Root Mean Squared Error, and Mean Absolute Percentage Error. The results show that all models produced impressive outcomes; however, the XGBoost model achieved a better overall performance although it also expanded more computational resources, while the RF model recorded a lesser prediction error and consumed far fewer computing resources than the XGBoost model. Furthermore, we compared the outcome of both XAi methods in identifying the key determinant features that influenced the PremiumPrices for each model and whereas both XAi methods produced similar outcomes, we found that the ICE plots showed in more detail the interactions between each variable than the SHAP analysis which seemed to be more high-level. It is the aim of the authors that the contributions of this study will help policymakers, insurers, and potential medical insurance buyers in their decision-making process for selecting the right policies that meet their specific needs. ",
    "url": "https://arxiv.org/abs/2311.14139",
    "authors": [
      "Ugochukwu Orji",
      "Elochukwu Ukwandu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.14153",
    "title": "Tube-NeRF: Efficient Imitation Learning of Visuomotor Policies from MPC  using Tube-Guided Data Augmentation and NeRFs",
    "abstract": "Imitation learning (IL) can train computationally-efficient sensorimotor policies from a resource-intensive Model Predictive Controller (MPC), but it often requires many samples, leading to long training times or limited robustness. To address these issues, we combine IL with a variant of robust MPC that accounts for process and sensing uncertainties, and we design a data augmentation (DA) strategy that enables efficient learning of vision-based policies. The proposed DA method, named Tube-NeRF, leverages Neural Radiance Fields (NeRFs) to generate novel synthetic images, and uses properties of the robust MPC (the tube) to select relevant views and to efficiently compute the corresponding actions. We tailor our approach to the task of localization and trajectory tracking on a multirotor, by learning a visuomotor policy that generates control actions using images from the onboard camera as only source of horizontal position. Our evaluations numerically demonstrate learning of a robust visuomotor policy with an 80-fold increase in demonstration efficiency and a 50% reduction in training time over current IL methods. Additionally, our policies successfully transfer to a real multirotor, achieving accurate localization and low tracking errors despite large disturbances, with an onboard inference time of only 1.5 ms. ",
    "url": "https://arxiv.org/abs/2311.14153",
    "authors": [
      "Andrea Tagliabue",
      "Jonathan P. How"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14155",
    "title": "GigaPose: Fast and Robust Novel Object Pose Estimation via One  Correspondence",
    "abstract": "We present GigaPose, a fast, robust, and accurate method for CAD-based novel object pose estimation in RGB images. GigaPose first leverages discriminative templates, rendered images of the CAD models, to recover the out-of-plane rotation and then uses patch correspondences to estimate the four remaining parameters. Our approach samples templates in only a two-degrees-of-freedom space instead of the usual three and matches the input image to the templates using fast nearest neighbor search in feature space, results in a speedup factor of 38x compared to the state of the art. Moreover, GigaPose is significantly more robust to segmentation errors. Our extensive evaluation on the seven core datasets of the BOP challenge demonstrates that it achieves state-of-the-art accuracy and can be seamlessly integrated with a refinement method. Additionally, we show the potential of GigaPose with 3D models predicted by recent work on 3D reconstruction from a single image, relaxing the need for CAD models and making 6D pose object estimation much more convenient. Our source code and trained models are publicly available at https://github.com/nv-nguyen/gigaPose ",
    "url": "https://arxiv.org/abs/2311.14155",
    "authors": [
      "Van Nguyen Nguyen",
      "Thibault Groueix",
      "Mathieu Salzmann",
      "Vincent Lepetit"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.14156",
    "title": "Variational Annealing on Graphs for Combinatorial Optimization",
    "abstract": "Several recent unsupervised learning methods use probabilistic approaches to solve combinatorial optimization (CO) problems based on the assumption of statistically independent solution variables. We demonstrate that this assumption imposes performance limitations in particular on difficult problem instances. Our results corroborate that an autoregressive approach which captures statistical dependencies among solution variables yields superior performance on many popular CO problems. We introduce subgraph tokenization in which the configuration of a set of solution variables is represented by a single token. This tokenization technique alleviates the drawback of the long sequential sampling procedure which is inherent to autoregressive methods without sacrificing expressivity. Importantly, we theoretically motivate an annealed entropy regularization and show empirically that it is essential for efficient and stable learning. ",
    "url": "https://arxiv.org/abs/2311.14156",
    "authors": [
      "Sebastian Sanokowski",
      "Wilhelm Berghammer",
      "Sepp Hochreiter",
      "Sebastian Lehner"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Discrete Mathematics (cs.DM)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2311.14175",
    "title": "Appearance-based gaze estimation enhanced with synthetic images using  deep neural networks",
    "abstract": "Human eye gaze estimation is an important cognitive ingredient for successful human-robot interaction, enabling the robot to read and predict human behavior. We approach this problem using artificial neural networks and build a modular system estimating gaze from separately cropped eyes, taking advantage of existing well-functioning components for face detection (RetinaFace) and head pose estimation (6DRepNet). Our proposed method does not require any special hardware or infrared filters but uses a standard notebook-builtin RGB camera, as often approached with appearance-based methods. Using the MetaHuman tool, we also generated a large synthetic dataset of more than 57,000 human faces and made it publicly available. The inclusion of this dataset (with eye gaze and head pose information) on top of the standard Columbia Gaze dataset into training the model led to better accuracy with a mean average error below two degrees in eye pitch and yaw directions, which compares favourably to related methods. We also verified the feasibility of our model by its preliminary testing in real-world setting using the builtin 4K camera in NICO semi-humanoid robot's eye. ",
    "url": "https://arxiv.org/abs/2311.14175",
    "authors": [
      "Dmytro Herashchenko",
      "Igor Farkaš"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.14200",
    "title": "Prebunking Design as a Defense Mechanism Against Misinformation  Propagation on Social Networks",
    "abstract": "The growing reliance on social media for news consumption necessitates effective countermeasures to mitigate the rapid spread of misinformation. Prebunking, a proactive method that arms users with accurate information before they come across false content, has garnered support from journalism and psychology experts. We formalize the problem of optimal prebunking as optimizing the timing of delivering accurate information, ensuring users encounter it before receiving misinformation while minimizing the disruption to user experience. Utilizing a susceptible-infected epidemiological process to model the propagation of misinformation, we frame optimal prebunking as a policy synthesis problem with safety constraints. We then propose a policy that approximates the optimal solution to a relaxed problem. The experiments show that this policy cuts the user experience cost of repeated information delivery in half, compared to delivering accurate information immediately after identifying a misinformation propagation. ",
    "url": "https://arxiv.org/abs/2311.14200",
    "authors": [
      "Yigit Ege Bayiz",
      "Ufuk Topcu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.14208",
    "title": "ECRF: Entropy-Constrained Neural Radiance Fields Compression with  Frequency Domain Optimization",
    "abstract": "Explicit feature-grid based NeRF models have shown promising results in terms of rendering quality and significant speed-up in training. However, these methods often require a significant amount of data to represent a single scene or object. In this work, we present a compression model that aims to minimize the entropy in the frequency domain in order to effectively reduce the data size. First, we propose using the discrete cosine transform (DCT) on the tensorial radiance fields to compress the feature-grid. This feature-grid is transformed into coefficients, which are then quantized and entropy encoded, following a similar approach to the traditional video coding pipeline. Furthermore, to achieve a higher level of sparsity, we propose using an entropy parameterization technique for the frequency domain, specifically for DCT coefficients of the feature-grid. Since the transformed coefficients are optimized during the training phase, the proposed model does not require any fine-tuning or additional information. Our model only requires a lightweight compression pipeline for encoding and decoding, making it easier to apply volumetric radiance field methods for real-world applications. Experimental results demonstrate that our proposed frequency domain entropy model can achieve superior compression performance across various datasets. The source code will be made publicly available. ",
    "url": "https://arxiv.org/abs/2311.14208",
    "authors": [
      "Soonbin Lee",
      "Fangwen Shu",
      "Yago Sanchez",
      "Thomas Schierl",
      "Cornelius Hellge"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2311.14214",
    "title": "Extending Variability-Aware Model Selection with Bias Detection in  Machine Learning Projects",
    "abstract": "Data science projects often involve various machine learning (ML) methods that depend on data, code, and models. One of the key activities in these projects is the selection of a model or algorithm that is appropriate for the data analysis at hand. ML model selection depends on several factors, which include data-related attributes such as sample size, functional requirements such as the prediction algorithm type, and non-functional requirements such as performance and bias. However, the factors that influence such selection are often not well understood and explicitly represented. This paper describes ongoing work on extending an adaptive variability-aware model selection method with bias detection in ML projects. The method involves: (i) modeling the variability of the factors that affect model selection using feature models based on heuristics proposed in the literature; (ii) instantiating our variability model with added features related to bias (e.g., bias-related metrics); and (iii) conducting experiments that illustrate the method in a specific case study to illustrate our approach based on a heart failure prediction project. The proposed approach aims to advance the state of the art by making explicit factors that influence model selection, particularly those related to bias, as well as their interactions. The provided representations can transform model selection in ML projects into a non ad hoc, adaptive, and explainable process. ",
    "url": "https://arxiv.org/abs/2311.14214",
    "authors": [
      "Cristina Tavares",
      "Nathalia Nascimento",
      "Paulo Alencar",
      "Donald Cowan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2311.14218",
    "title": "A New Benchmark and Model for Challenging Image Manipulation Detection",
    "abstract": "The ability to detect manipulation in multimedia data is vital in digital forensics. Existing Image Manipulation Detection (IMD) methods are mainly based on detecting anomalous features arisen from image editing or double compression artifacts. All existing IMD techniques encounter challenges when it comes to detecting small tampered regions from a large image. Moreover, compression-based IMD approaches face difficulties in cases of double compression of identical quality factors. To investigate the State-of-The-Art (SoTA) IMD methods in those challenging conditions, we introduce a new Challenging Image Manipulation Detection (CIMD) benchmark dataset, which consists of two subsets, for evaluating editing-based and compression-based IMD methods, respectively. The dataset images were manually taken and tampered with high-quality annotations. In addition, we propose a new two-branch network model based on HRNet that can better detect both the image-editing and compression artifacts in those challenging conditions. Extensive experiments on the CIMD benchmark show that our model significantly outperforms SoTA IMD methods on CIMD. ",
    "url": "https://arxiv.org/abs/2311.14218",
    "authors": [
      "Zhenfei Zhang",
      "Mingyang Li",
      "Ming-Ching Chang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.14242",
    "title": "RSB-Pose: Robust Short-Baseline Binocular 3D Human Pose Estimation with  Occlusion Handling",
    "abstract": "In the domain of 3D Human Pose Estimation, which finds widespread daily applications, the requirement for convenient acquisition equipment continues to grow. To satisfy this demand, we set our sights on a short-baseline binocular setting that offers both portability and a geometric measurement property that radically mitigates depth ambiguity. However, as the binocular baseline shortens, two serious challenges emerge: first, the robustness of 3D reconstruction against 2D errors deteriorates; and second, occlusion reoccurs due to the limited visual differences between two views. To address the first challenge, we propose the Stereo Co-Keypoints Estimation module to improve the view consistency of 2D keypoints and enhance the 3D robustness. In this module, the disparity is utilized to represent the correspondence of binocular 2D points and the Stereo Volume Feature is introduced to contain binocular features across different disparities. Through the regression of SVF, two-view 2D keypoints are simultaneously estimated in a collaborative way which restricts their view consistency. Furthermore, to deal with occlusions, a Pre-trained Pose Transformer module is introduced. Through this module, 3D poses are refined by perceiving pose coherence, a representation of joint correlations. This perception is injected by the Pose Transformer network and learned through a pre-training task that recovers iterative masked joints. Comprehensive experiments carried out on H36M and MHAD datasets, complemented by visualizations, validate the effectiveness of our approach in the short-baseline binocular 3D Human Pose Estimation and occlusion handling. ",
    "url": "https://arxiv.org/abs/2311.14242",
    "authors": [
      "Xiaoyue Wan",
      "Zhuo Chen",
      "Yiming Bao",
      "Xu Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.14255",
    "title": "Out-of-Distribution Generalized Dynamic Graph Neural Network with  Disentangled Intervention and Invariance Promotion",
    "abstract": "Dynamic graph neural networks (DyGNNs) have demonstrated powerful predictive abilities by exploiting graph structural and temporal dynamics. However, the existing DyGNNs fail to handle distribution shifts, which naturally exist in dynamic graphs, mainly because the patterns exploited by DyGNNs may be variant with respect to labels under distribution shifts. In this paper, we propose Disentangled Intervention-based Dynamic graph Attention networks with Invariance Promotion (I-DIDA) to handle spatio-temporal distribution shifts in dynamic graphs by discovering and utilizing invariant patterns, i.e., structures and features whose predictive abilities are stable across distribution shifts. Specifically, we first propose a disentangled spatio-temporal attention network to capture the variant and invariant patterns. By utilizing the disentangled patterns, we design a spatio-temporal intervention mechanism to create multiple interventional distributions and an environment inference module to infer the latent spatio-temporal environments, and minimize the variance of predictions among these intervened distributions and environments, so that our model can make predictions based on invariant patterns with stable predictive abilities under distribution shifts. Extensive experiments demonstrate the superiority of our method over state-of-the-art baselines under distribution shifts. Our work is the first study of spatio-temporal distribution shifts in dynamic graphs, to the best of our knowledge. ",
    "url": "https://arxiv.org/abs/2311.14255",
    "authors": [
      "Zeyang Zhang",
      "Xin Wang",
      "Ziwei Zhang",
      "Haoyang Li",
      "Wenwu Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14288",
    "title": "Fair Influence Maximization in Social Networks: A Community-Based  Evolutionary Algorithm",
    "abstract": "Influence Maximization (IM) has been extensively studied in network science, which attempts to find a subset of users to maximize the influence spread. A new variant of IM, Fair Influence Maximization (FIM), which primarily enhances the fair propagation of information, attracts increasing attention in academic. However, existing algorithms for FIM suffer from a trade-off between fairness and running time. Since it is a tough task to ensure that users are fairly influenced in terms of sensitive attributes, such as race or gender, while maintaining a high influence spread. To tackle this problem, in this paper, we propose an effective and efficient Community-based Evolutionary Algorithm for FIM (named CEA-FIM). In CEA-FIM, a community-based node selection strategy is proposed to identify potential nodes, which not only considers the size of the community but also the attributes of the nodes in the community. Subsequently, we design an evolutionary algorithm based on the proposed node selection strategy to hasten the search for the optimal solution, including the novel initialization, crossover and mutation strategies. We validate the proposed algorithm CEA-FIM by performing experiments on real-world and synthetic networks. The experimental results show that the proposed CEA-FIM achieves a better balance between effectiveness and efficiency, compared to the state-of-the-art baseline algorithms. ",
    "url": "https://arxiv.org/abs/2311.14288",
    "authors": [
      "Kaicong Ma",
      "Xinxiang Xu",
      "Haipeng Yang",
      "Renzhi Cao",
      "Lei Zhang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2311.14295",
    "title": "Exploiting Active RIS in NOMA Networks with Hardware Impairments",
    "abstract": "Active reconfigurable intelligent surface (ARIS) is a promising way to compensate for multiplicative fading attenuation by amplifying and reflecting event signals to selected users. This paper investigates the performance of ARIS assisted non-orthogonal multiple access (NOMA) networks over cascaded Nakagami-m fading channels. The effects of hardware impairments (HIS) and reflection coefficients on ARIS-NOMA networks with imperfect successive interference cancellation (ipSIC) and perfect successive interference cancellation (pSIC) are considered. More specifically, we develop new precise and asymptotic expressions of outage probability and ergodic data rate with ipSIC/pSIC for ARIS-NOMA-HIS networks. According to the approximated analyses, the diversity orders and multiplexing gains for couple of non-orthogonal users are attained in detail. Additionally, the energy efficiency of ARIS-NOMA-HIS networks is surveyed in delay-limited and delay-tolerant transmission schemes. The simulation findings are presented to demonstrate that: i) The outage behaviors and ergodic data rates of ARIS-NOMA-HIS networks precede that of ARIS aided orthogonal multiple access (OMA) and passive reconfigurable intelligent surface (PRIS) aided OMA; ii) As the reflection coefficient of ARIS increases, ARIS-NOMA-HIS networks have the ability to provide the strengthened outage performance; and iii) ARIS-NOMA-HIS networks are more energy efficient than ARIS/PRIS-OMA networks and conventional cooperative schemes. ",
    "url": "https://arxiv.org/abs/2311.14295",
    "authors": [
      "Xinwei Yue",
      "Meiqi Song",
      "Chongjun Ouyang",
      "Yuanwei Liu",
      "Tian Li",
      "Tianwei Hou"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2311.14304",
    "title": "AdaMedGraph: Adaboosting Graph Neural Networks for Personalized Medicine",
    "abstract": "Precision medicine tailored to individual patients has gained significant attention in recent times. Machine learning techniques are now employed to process personalized data from various sources, including images, genetics, and assessments. These techniques have demonstrated good outcomes in many clinical prediction tasks. Notably, the approach of constructing graphs by linking similar patients and then applying graph neural networks (GNNs) stands out, because related information from analogous patients are aggregated and considered for prediction. However, selecting the appropriate edge feature to define patient similarity and construct the graph is challenging, given that each patient is depicted by high-dimensional features from diverse sources. Previous studies rely on human expertise to select the edge feature, which is neither scalable nor efficient in pinpointing crucial edge features for complex diseases. In this paper, we propose a novel algorithm named \\ours, which can automatically select important features to construct multiple patient similarity graphs, and train GNNs based on these graphs as weak learners in adaptive boosting. \\ours{} is evaluated on two real-world medical scenarios and shows superiors performance. ",
    "url": "https://arxiv.org/abs/2311.14304",
    "authors": [
      "Jie Lian",
      "Xufang Luo",
      "Caihua Shan",
      "Dongqi Han",
      "Varut Vardhanabhuti",
      "Dongsheng Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14315",
    "title": "Robust Domain Misinformation Detection via Multi-modal Feature Alignment",
    "abstract": "Social media misinformation harms individuals and societies and is potentialized by fast-growing multi-modal content (i.e., texts and images), which accounts for higher \"credibility\" than text-only news pieces. Although existing supervised misinformation detection methods have obtained acceptable performances in key setups, they may require large amounts of labeled data from various events, which can be time-consuming and tedious. In turn, directly training a model by leveraging a publicly available dataset may fail to generalize due to domain shifts between the training data (a.k.a. source domains) and the data from target domains. Most prior work on domain shift focuses on a single modality (e.g., text modality) and ignores the scenario where sufficient unlabeled target domain data may not be readily available in an early stage. The lack of data often happens due to the dynamic propagation trend (i.e., the number of posts related to fake news increases slowly before catching the public attention). We propose a novel robust domain and cross-modal approach (\\textbf{RDCM}) for multi-modal misinformation detection. It reduces the domain shift by aligning the joint distribution of textual and visual modalities through an inter-domain alignment module and bridges the semantic gap between both modalities through a cross-modality alignment module. We also propose a framework that simultaneously considers application scenarios of domain generalization (in which the target domain data is unavailable) and domain adaptation (in which unlabeled target domain data is available). Evaluation results on two public multi-modal misinformation detection datasets (Pheme and Twitter Datasets) evince the superiority of the proposed model. The formal implementation of this paper can be found in this link: https://github.com/less-and-less-bugs/RDCM ",
    "url": "https://arxiv.org/abs/2311.14315",
    "authors": [
      "Hui Liu",
      "Wenya Wang",
      "Hao Sun",
      "Anderson Rocha",
      "Haoliang Li"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.14324",
    "title": "Large Language Models as Topological Structure Enhancers for  Text-Attributed Graphs",
    "abstract": "The latest advancements in large language models (LLMs) have revolutionized the field of natural language processing (NLP). Inspired by the success of LLMs in NLP tasks, some recent work has begun investigating the potential of applying LLMs in graph learning tasks. However, most of the existing work focuses on utilizing LLMs as powerful node feature augmenters, leaving employing LLMs to enhance graph topological structures an understudied problem. In this work, we explore how to leverage the information retrieval and text generation capabilities of LLMs to refine/enhance the topological structure of text-attributed graphs (TAGs) under the node classification setting. First, we propose using LLMs to help remove unreliable edges and add reliable ones in the TAG. Specifically, we first let the LLM output the semantic similarity between node attributes through delicate prompt designs, and then perform edge deletion and edge addition based on the similarity. Second, we propose using pseudo-labels generated by the LLM to improve graph topology, that is, we introduce the pseudo-label propagation as a regularization to guide the graph neural network (GNN) in learning proper edge weights. Finally, we incorporate the two aforementioned LLM-based methods for graph topological refinement into the process of GNN training, and perform extensive experiments on four real-world datasets. The experimental results demonstrate the effectiveness of LLM-based graph topology refinement (achieving a 0.15%--2.47% performance gain on public benchmarks). ",
    "url": "https://arxiv.org/abs/2311.14324",
    "authors": [
      "Shengyin Sun",
      "Yuxiang Ren",
      "Chen Ma",
      "Xuecang Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14327",
    "title": "C-ITS Environment Modeling and Attack Modeling",
    "abstract": "As technology advances, cities are evolving into smart cities, with the ability to process large amounts of data and the increasing complexity and diversification of various elements within urban areas. Among the core systems of a smart city is the Cooperative-Intelligent Transport Systems (C-ITS). C-ITS is a system where vehicles provide real-time information to drivers about surrounding traffic conditions, sudden stops, falling objects, and other accident risks through roadside base stations. It consists of road infrastructure, C-ITS centers, and vehicle terminals. However, as smart cities integrate many elements through networks and electronic control, they are susceptible to cybersecurity issues. In the case of cybersecurity problems in C-ITS, there is a significant risk of safety issues arising. This technical document aims to model the C-ITS environment and the services it provides, with the purpose of identifying the attack surface where security incidents could occur in a smart city environment. Subsequently, based on the identified attack surface, the document aims to construct attack scenarios and their respective stages. The document provides a description of the concept of C-ITS, followed by the description of the C-ITS environment model, service model, and attack scenario model defined by us. ",
    "url": "https://arxiv.org/abs/2311.14327",
    "authors": [
      "Jaewoong Choi",
      "Min Geun Song",
      "Hyosun Lee",
      "Chaeyeon Sagong",
      "Sangbeom Park",
      "Jaesung Lee",
      "Jeongdo Yoo",
      "Huy Kang Kim"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.14332",
    "title": "GATGPT: A Pre-trained Large Language Model with Graph Attention Network  for Spatiotemporal Imputation",
    "abstract": "The analysis of spatiotemporal data is increasingly utilized across diverse domains, including transportation, healthcare, and meteorology. In real-world settings, such data often contain missing elements due to issues like sensor malfunctions and data transmission errors. The objective of spatiotemporal imputation is to estimate these missing values by understanding the inherent spatial and temporal relationships in the observed multivariate time series. Traditionally, spatiotemporal imputation has relied on specific, intricate architectures designed for this purpose, which suffer from limited applicability and high computational complexity. In contrast, our approach integrates pre-trained large language models (LLMs) into spatiotemporal imputation, introducing a groundbreaking framework, GATGPT. This framework merges a graph attention mechanism with LLMs. We maintain most of the LLM parameters unchanged to leverage existing knowledge for learning temporal patterns, while fine-tuning the upper layers tailored to various applications. The graph attention component enhances the LLM's ability to understand spatial relationships. Through tests on three distinct real-world datasets, our innovative approach demonstrates comparable results to established deep learning benchmarks. ",
    "url": "https://arxiv.org/abs/2311.14332",
    "authors": [
      "Yakun Chen",
      "Xianzhi Wang",
      "Guandong Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2311.14333",
    "title": "Cycle Invariant Positional Encoding for Graph Representation Learning",
    "abstract": "Cycles are fundamental elements in graph-structured data and have demonstrated their effectiveness in enhancing graph learning models. To encode such information into a graph learning framework, prior works often extract a summary quantity, ranging from the number of cycles to the more sophisticated persistence diagram summaries. However, more detailed information, such as which edges are encoded in a cycle, has not yet been used in graph neural networks. In this paper, we make one step towards addressing this gap, and propose a structure encoding module, called CycleNet, that encodes cycle information via edge structure encoding in a permutation invariant manner. To efficiently encode the space of all cycles, we start with a cycle basis (i.e., a minimal set of cycles generating the cycle space) which we compute via the kernel of the 1-dimensional Hodge Laplacian of the input graph. To guarantee the encoding is invariant w.r.t. the choice of cycle basis, we encode the cycle information via the orthogonal projector of the cycle basis, which is inspired by BasisNet proposed by Lim et al. We also develop a more efficient variant which however requires that the input graph has a unique shortest cycle basis. To demonstrate the effectiveness of the proposed module, we provide some theoretical understandings of its expressive power. Moreover, we show via a range of experiments that networks enhanced by our CycleNet module perform better in various benchmarks compared to several existing SOTA models. ",
    "url": "https://arxiv.org/abs/2311.14333",
    "authors": [
      "Zuoyu Yan",
      "Tengfei Ma",
      "Liangcai Gao",
      "Zhi Tang",
      "Chao Chen",
      "Yusu Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14342",
    "title": "AI-based Attack Graph Generation",
    "abstract": "With the advancement of IoT technology, many electronic devices are interconnected through networks, communicating with each other and performing specific roles. However, as numerous devices join networks, the threat of cyberattacks also escalates. Preventing and detecting cyber threats are crucial, and one method of preventing such threats involves using attack graphs. Attack graphs are widely used to assess security threats within networks. However, a drawback emerges as the network scales, as generating attack graphs becomes time-consuming. To overcome this limitation, artificial intelligence models can be employed. By utilizing AI models, attack graphs can be created within a short period, approximating optimal outcomes. AI models designed for attack graph generation consist of encoders and decoders, trained using reinforcement learning algorithms. After training the AI models, we confirmed the model's learning effectiveness by observing changes in loss and reward values. Additionally, we compared attack graphs generated by the AI model with those created through conventional methods. ",
    "url": "https://arxiv.org/abs/2311.14342",
    "authors": [
      "Sangbeom Park",
      "Jaesung Lee",
      "Jeongdo Yoo",
      "Min Geun Song",
      "Hyosun Lee",
      "Jaewoong Choi",
      "Chaeyeon Sagong",
      "Huy Kang Kim"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.14354",
    "title": "Modularity-based selection of the number of slices in temporal network  clustering",
    "abstract": "A popular way to cluster a temporal network is to transform it into a sequence of networks, also called slices, where each slice corresponds to a time interval and contains the vertices and edges existing in that interval. A reason to perform this transformation is that after a network has been sliced, existing algorithms designed to find clusters in multilayer networks can be used. However, to use this approach, we need to know how many slices to generate. This chapter discusses how to select the number of slices when generalized modularity is used to identify the clusters. ",
    "url": "https://arxiv.org/abs/2311.14354",
    "authors": [
      "Patrik Seiron",
      "Axel Lindegren",
      "Matteo Magnani",
      "Christian Rohner",
      "Tsuyoshi Murata",
      "Petter Holme"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2311.14361",
    "title": "Deciphering and integrating invariants for neural operator learning with  various physical mechanisms",
    "abstract": "Neural operators have been explored as surrogate models for simulating physical systems to overcome the limitations of traditional partial differential equation (PDE) solvers. However, most existing operator learning methods assume that the data originate from a single physical mechanism, limiting their applicability and performance in more realistic scenarios. To this end, we propose Physical Invariant Attention Neural Operator (PIANO) to decipher and integrate the physical invariants (PI) for operator learning from the PDE series with various physical mechanisms. PIANO employs self-supervised learning to extract physical knowledge and attention mechanisms to integrate them into dynamic convolutional layers. Compared to existing techniques, PIANO can reduce the relative error by 13.6\\%-82.2\\% on PDE forecasting tasks across varying coefficients, forces, or boundary conditions. Additionally, varied downstream tasks reveal that the PI embeddings deciphered by PIANO align well with the underlying invariants in the PDE systems, verifying the physical significance of PIANO. The source code will be publicly available at: https://github.com/optray/PIANO. ",
    "url": "https://arxiv.org/abs/2311.14361",
    "authors": [
      "Rui Zhang",
      "Qi Meng",
      "Zhi-Ming Ma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2311.14386",
    "title": "Collective Memory, Consensus, and Learning explained by Network  Connectivity",
    "abstract": "Humans cluster in social groups where they discuss their shared past, problems, and potential solutions, learn collectively when they repeat activities, synchronize when they sing or dance together, and bond through social cohesion. By representing a group network by a Laplacian matrix, the outcomes of these activities, as well as group's cohesion, can be predicted by its second smallest eigenvalue, called algebraic connectivity. It predicts well when processes converge towards a consensus or focal activity, but it cannot predict divergence, such as division of labor or polarization. ",
    "url": "https://arxiv.org/abs/2311.14386",
    "authors": [
      "Jeroen Bruggeman"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2311.14388",
    "title": "A Parameterized Generative Adversarial Network Using Cyclic Projection  for Explainable Medical Image Classification",
    "abstract": "Although current data augmentation methods are successful to alleviate the data insufficiency, conventional augmentation are primarily intra-domain while advanced generative adversarial networks (GANs) generate images remaining uncertain, particularly in small-scale datasets. In this paper, we propose a parameterized GAN (ParaGAN) that effectively controls the changes of synthetic samples among domains and highlights the attention regions for downstream classification. Specifically, ParaGAN incorporates projection distance parameters in cyclic projection and projects the source images to the decision boundary to obtain the class-difference maps. Our experiments show that ParaGAN can consistently outperform the existing augmentation methods with explainable classification on two small-scale medical datasets. ",
    "url": "https://arxiv.org/abs/2311.14388",
    "authors": [
      "Xiangyu Xiong",
      "Yue Sun",
      "Xiaohong Liu",
      "ChanTong Lam",
      "Tong Tong",
      "Hao Chen",
      "Qinquan Gao",
      "Wei Ke",
      "Tao Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14395",
    "title": "Multi-scale Semantic Correlation Mining for Visible-Infrared Person  Re-Identification",
    "abstract": "The main challenge in the Visible-Infrared Person Re-Identification (VI-ReID) task lies in how to extract discriminative features from different modalities for matching purposes. While the existing well works primarily focus on minimizing the modal discrepancies, the modality information can not thoroughly be leveraged. To solve this problem, a Multi-scale Semantic Correlation Mining network (MSCMNet) is proposed to comprehensively exploit semantic features at multiple scales and simultaneously reduce modality information loss as small as possible in feature extraction. The proposed network contains three novel components. Firstly, after taking into account the effective utilization of modality information, the Multi-scale Information Correlation Mining Block (MIMB) is designed to explore semantic correlations across multiple scales. Secondly, in order to enrich the semantic information that MIMB can utilize, a quadruple-stream feature extractor (QFE) with non-shared parameters is specifically designed to extract information from different dimensions of the dataset. Finally, the Quadruple Center Triplet Loss (QCT) is further proposed to address the information discrepancy in the comprehensive features. Extensive experiments on the SYSU-MM01, RegDB, and LLCM datasets demonstrate that the proposed MSCMNet achieves the greatest accuracy. ",
    "url": "https://arxiv.org/abs/2311.14395",
    "authors": [
      "Ke Cheng",
      "Xuecheng Hua",
      "Hu Lu",
      "Juanjuan Tu",
      "Yuanquan Wang",
      "Shitong Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.14404",
    "title": "BHGNN-RT: Network embedding for directed heterogeneous graphs",
    "abstract": "Networks are one of the most valuable data structures for modeling problems in the real world. However, the most recent node embedding strategies have focused on undirected graphs, with limited attention to directed graphs, especially directed heterogeneous graphs. In this study, we first investigated the network properties of directed heterogeneous graphs. Based on network analysis, we proposed an embedding method, a bidirectional heterogeneous graph neural network with random teleport (BHGNN-RT), for directed heterogeneous graphs, that leverages bidirectional message-passing process and network heterogeneity. With the optimization of teleport proportion, BHGNN-RT is beneficial to overcome the over-smoothing problem. Extensive experiments on various datasets were conducted to verify the efficacy and efficiency of BHGNN-RT. Furthermore, we investigated the effects of message components, model layer, and teleport proportion on model performance. The performance comparison with all other baselines illustrates that BHGNN-RT achieves state-of-the-art performance, outperforming the benchmark methods in both node classification and unsupervised clustering tasks. ",
    "url": "https://arxiv.org/abs/2311.14404",
    "authors": [
      "Xiyang Sun",
      "Fumiyasu Komaki"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14431",
    "title": "What you need to know about a learning robot: Identifying the enabling  architecture of complex systems",
    "abstract": "Nowadays, we are dealing more and more with robots and AI in everyday life. However, their behavior is not always apparent to most lay users, especially in error situations. As a result, there can be misconceptions about the behavior of the technologies in use. This, in turn, can lead to misuse and rejection by users. Explanation, for example, through transparency, can address these misconceptions. However, it would be confusing and overwhelming for users if the entire software or hardware was explained. Therefore, this paper looks at the 'enabling' architecture. It describes those aspects of a robotic system that might need to be explained to enable someone to use the technology effectively. Furthermore, this paper is concerned with the 'explanandum', which is the corresponding misunderstanding or missing concepts of the enabling architecture that needs to be clarified. We have thus developed and present an approach for determining this 'enabling' architecture and the resulting 'explanandum' of complex technologies. ",
    "url": "https://arxiv.org/abs/2311.14431",
    "authors": [
      "Helen Beierling",
      "Phillip Richter",
      "Mara Brandt",
      "Lutz Terfloth",
      "Carsten Schulte",
      "Heiko Wersing",
      "Anna-Lisa Vollmer"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.14450",
    "title": "Segment (Almost) Nothing: Prompt-Agnostic Adversarial Attacks on  Segmentation Models",
    "abstract": "General purpose segmentation models are able to generate (semantic) segmentation masks from a variety of prompts, including visual (points, boxed, etc.) and textual (object names) ones. In particular, input images are pre-processed by an image encoder to obtain embedding vectors which are later used for mask predictions. Existing adversarial attacks target the end-to-end tasks, i.e. aim at altering the segmentation mask predicted for a specific image-prompt pair. However, this requires running an individual attack for each new prompt for the same image. We propose instead to generate prompt-agnostic adversarial attacks by maximizing the $\\ell_2$-distance, in the latent space, between the embedding of the original and perturbed images. Since the encoding process only depends on the image, distorted image representations will cause perturbations in the segmentation masks for a variety of prompts. We show that even imperceptible $\\ell_\\infty$-bounded perturbations of radius $\\epsilon=1/255$ are often sufficient to drastically modify the masks predicted with point, box and text prompts by recently proposed foundation models for segmentation. Moreover, we explore the possibility of creating universal, i.e. non image-specific, attacks which can be readily applied to any input without further computational cost. ",
    "url": "https://arxiv.org/abs/2311.14450",
    "authors": [
      "Francesco Croce",
      "Matthias Hein"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14459",
    "title": "IDD-AW: A Benchmark for Safe and Robust Segmentation of Drive Scenes in  Unstructured Traffic and Adverse Weather",
    "abstract": "Large-scale deployment of fully autonomous vehicles requires a very high degree of robustness to unstructured traffic, and weather conditions, and should prevent unsafe mispredictions. While there are several datasets and benchmarks focusing on segmentation for drive scenes, they are not specifically focused on safety and robustness issues. We introduce the IDD-AW dataset, which provides 5000 pairs of high-quality images with pixel-level annotations, captured under rain, fog, low light, and snow in unstructured driving conditions. As compared to other adverse weather datasets, we provide i.) more annotated images, ii.) paired Near-Infrared (NIR) image for each frame, iii.) larger label set with a 4-level label hierarchy to capture unstructured traffic conditions. We benchmark state-of-the-art models for semantic segmentation in IDD-AW. We also propose a new metric called ''Safe mean Intersection over Union (Safe mIoU)'' for hierarchical datasets which penalizes dangerous mispredictions that are not captured in the traditional definition of mean Intersection over Union (mIoU). The results show that IDD-AW is one of the most challenging datasets to date for these tasks. The dataset and code will be available here: this http URL ",
    "url": "https://arxiv.org/abs/2311.14459",
    "authors": [
      "Furqan Ahmed Shaik",
      "Abhishek Malreddy",
      "Nikhil Reddy Billa",
      "Kunal Chaudhary",
      "Sunny Manchanda",
      "Girish Varma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.14469",
    "title": "Fault Detection in Telecom Networks using Bi-level Federated Graph  Neural Networks",
    "abstract": "5G and Beyond Networks become increasingly complex and heterogeneous, with diversified and high requirements from a wide variety of emerging applications. The complexity and diversity of Telecom networks place an increasing strain on maintenance and operation efforts. Moreover, the strict security and privacy requirements present a challenge for mobile operators to leverage network data. To detect network faults, and mitigate future failures, prior work focused on leveraging traditional ML/DL methods to locate anomalies in networks. The current approaches, although powerful, do not consider the intertwined nature of embedded and software-intensive Radio Access Network systems. In this paper, we propose a Bi-level Federated Graph Neural Network anomaly detection and diagnosis model that is able to detect anomalies in Telecom networks in a privacy-preserving manner, while minimizing communication costs. Our method revolves around conceptualizing Telecom data as a bi-level temporal Graph Neural Networks. The first graph captures the interactions between different RAN nodes that are exposed to different deployment scenarios in the network, while each individual Radio Access Network node is further elaborated into its software (SW) execution graph. Additionally, we use Federated Learning to address privacy and security limitations. Furthermore, we study the performance of anomaly detection model under three settings: (1) Centralized (2) Federated Learning and (3) Personalized Federated Learning using real-world data from an operational network. Our comprehensive experiments showed that Personalized Federated Temporal Graph Neural Networks method outperforms the most commonly used techniques for Anomaly Detection. ",
    "url": "https://arxiv.org/abs/2311.14469",
    "authors": [
      "R. Bourgerie",
      "T. Zanouda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2311.14480",
    "title": "Evolutionary game theory: the mathematics of evolution and collective  behaviours",
    "abstract": "This brief discusses evolutionary game theory as a powerful and unified mathematical tool to study evolution of collective behaviours. It summarises some of my recent research directions using evolutionary game theory methods, which include i) the analysis of statistical properties of the number of (stable) equilibria in a random evolutionary game, and ii) the modelling of safety behaviours' evolution and the risk posed by advanced Artificial Intelligence technologies in a technology development race. Finally, it includes an outlook and some suggestions for future researchers. ",
    "url": "https://arxiv.org/abs/2311.14480",
    "authors": [
      "Anh Han"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Mathematical Physics (math-ph)",
      "Dynamical Systems (math.DS)",
      "Adaptation and Self-Organizing Systems (nlin.AO)"
    ]
  },
  {
    "id": "arXiv:2311.14496",
    "title": "RTPS Attack Dataset Description",
    "abstract": "This paper explains all about our RTPS datasets. We collect attack and normal packet data by injecting attack data in an Unmanned Ground Vehicle (UGV) which is normal state. To collect this dataset, We assembled a test bed consisting of UGV, controller, PC, and router. We conducted two types of Attacks \"Command Injection\" and \"ARP Spoofing\" on the testbed. The data collection time is 180, 300, 600, and 1200, the scenario has 30 each on collection time. 240 total. We expect this dataset will contribute to the development of technologies such as anomaly detection to address security threat issues in ROS2 networks and UGVs. ",
    "url": "https://arxiv.org/abs/2311.14496",
    "authors": [
      "Dong Young Kim",
      "Dong Sung Kim",
      "Yu Chan Song",
      "Gang Min Kim",
      "Min Geun Song",
      "Jeong Do Yoo",
      "Huy Kang Kim"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.14506",
    "title": "Multi-Class Anomaly Detection based on Regularized Discriminative  Coupled hypersphere-based Feature Adaptation",
    "abstract": "In anomaly detection, identification of anomalies across diverse product categories is a complex task. This paper introduces a new model by including class discriminative properties obtained by a modified Regularized Discriminative Variational Auto-Encoder (RD-VAE) in the feature extraction process of Coupled-hypersphere-based Feature Adaptation (CFA). By doing so, the proposed Regularized Discriminative Coupled-hypersphere-based Feature Adaptation (RD-CFA), forms a solution for multi-class anomaly detection. By using the discriminative power of RD-VAE to capture intricate class distributions, combined with CFA's robust anomaly detection capability, the proposed method excels in discerning anomalies across various classes. Extensive evaluations on multi-class anomaly detection and localization using the MVTec AD and BeanTech AD datasets showcase the effectiveness of RD-CFA compared to eight leading contemporary methods. ",
    "url": "https://arxiv.org/abs/2311.14506",
    "authors": [
      "Mehdi Rafiei",
      "Alexandros Iosifidis"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.14509",
    "title": "FAMAC: A Federated Assisted Modified Actor-Critic Framework for Secured  Energy Saving in 5G and Beyond Networks",
    "abstract": "The constant surge in the traffic demand on cellular networks has led to continuous expansion in network capacity in order to accommodate existing and new service demands. This has given rise to ultra-dense base station deployment in 5G and beyond networks which leads to increased energy consumption in the network. Hence, these ultra-dense base station deployments must be operated in a way that the energy consumption of the network can be adapted to the spatio-temporal traffic demands on the network in order to minimize the overall energy consumption of the network. To achieve this goal, we leverage two artificial intelligence algorithms, federated learning and actor-critic algorithm, to develop a proactive and intelligent base station switching framework that can learn the operating policy of the small base station in an ultra-dense heterogeneous network (UDHN) that would result in maximum energy saving in the network while respecting the quality of service (QoS) constraints. The performance evaluation reveals that the proposed framework can achieve an energy saving that is about 77% more than that of the state-of-the-art solutions while respecting the QoS constraints of the network. ",
    "url": "https://arxiv.org/abs/2311.14509",
    "authors": [
      "Attai Ibrahim Abubakar",
      "Michael S. Mollel",
      "Naeem Ramzan"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.14514",
    "title": "FRAD: Front-Running Attacks Detection on Ethereum using Ternary  Classification Model",
    "abstract": "With the evolution of blockchain technology, the issue of transaction security, particularly on platforms like Ethereum, has become increasingly critical. Front-running attacks, a unique form of security threat, pose significant challenges to the integrity of blockchain transactions. In these attack scenarios, malicious actors monitor other users' transaction activities, then strategically submit their own transactions with higher fees. This ensures their transactions are executed before the monitored transactions are included in the block. The primary objective of this paper is to delve into a comprehensive classification of transactions associated with front-running attacks, which aims to equip developers with specific strategies to counter each type of attack. To achieve this, we introduce a novel detection method named FRAD (Front-Running Attacks Detection on Ethereum using Ternary Classification Model). This method is specifically tailored for transactions within decentralized applications (DApps) on Ethereum, enabling accurate classification of front-running attacks involving transaction displacement, insertion, and suppression. Our experimental validation reveals that the Multilayer Perceptron (MLP) classifier offers the best performance in detecting front-running attacks, achieving an impressive accuracy rate of 84.59% and F1-score of 84.60%. ",
    "url": "https://arxiv.org/abs/2311.14514",
    "authors": [
      "Yuheng Zhang",
      "Pin Liu",
      "Guojun Wang",
      "Peiqiang Li",
      "Wanyi Gu",
      "Houji Chen",
      "Xuelei Liu",
      "Jinyao Zhu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.14516",
    "title": "Morphing Graph Drawings in the Presence of Point Obstacles",
    "abstract": "A crossing-free morph is a continuous deformation between two graph drawings that preserves straight-line pairwise noncrossing edges. Motivated by applications in 3D morphing problems, we initiate the study of morphing graph drawings in the plane in the presence of stationary point obstacles, which need to be avoided throughout the deformation. As our main result, we prove that it is NP-hard to decide whether such an obstacle-avoiding 2D morph between two given drawings of the same graph exists. This is in sharp contrast to the classical case without obstacles, where there is an efficiently verifiable (necessary and sufficient) criterion for the existence of a morph. ",
    "url": "https://arxiv.org/abs/2311.14516",
    "authors": [
      "Oksana Firman",
      "Tim Hegemann",
      "Boris Klemz",
      "Felix Klesen",
      "Marie Diana Sieper",
      "Alexander Wolff",
      "Johannes Zink"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2311.14532",
    "title": "Digital Twin-Native AI-Driven Service Architecture for Industrial  Networks",
    "abstract": "The dramatic increase in the connectivity demand results in an excessive amount of Internet of Things (IoT) sensors. To meet the management needs of these large-scale networks, such as accurate monitoring and learning capabilities, Digital Twin (DT) is the key enabler. However, current attempts regarding DT implementations remain insufficient due to the perpetual connectivity requirements of IoT networks. Furthermore, the sensor data streaming in IoT networks cause higher processing time than traditional methods. In addition to these, the current intelligent mechanisms cannot perform well due to the spatiotemporal changes in the implemented IoT network scenario. To handle these challenges, we propose a DT-native AI-driven service architecture in support of the concept of IoT networks. Within the proposed DT-native architecture, we implement a TCP-based data flow pipeline and a Reinforcement Learning (RL)-based learner model. We apply the proposed architecture to one of the broad concepts of IoT networks, the Internet of Vehicles (IoV). We measure the efficiency of our proposed architecture and note ~30% processing time-saving thanks to the TCP-based data flow pipeline. Moreover, we test the performance of the learner model by applying several learning rate combinations for actor and critic networks and highlight the most successive model. ",
    "url": "https://arxiv.org/abs/2311.14532",
    "authors": [
      "Kubra Duran",
      "Matthew Broadbent",
      "Gokhan Yurdakul",
      "Berk Canberk"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.14544",
    "title": "Inferring Latent Class Statistics from Text for Robust Visual Few-Shot  Learning",
    "abstract": "In the realm of few-shot learning, foundation models like CLIP have proven effective but exhibit limitations in cross-domain robustness especially in few-shot settings. Recent works add text as an extra modality to enhance the performance of these models. Most of these approaches treat text as an auxiliary modality without fully exploring its potential to elucidate the underlying class visual features distribution. In this paper, we present a novel approach that leverages text-derived statistics to predict the mean and covariance of the visual feature distribution for each class. This predictive framework enriches the latent space, yielding more robust and generalizable few-shot learning models. We demonstrate the efficacy of incorporating both mean and covariance statistics in improving few-shot classification performance across various datasets. Our method shows that we can use text to predict the mean and covariance of the distribution offering promising improvements in few-shot learning scenarios. ",
    "url": "https://arxiv.org/abs/2311.14544",
    "authors": [
      "Yassir Bendou",
      "Vincent Gripon",
      "Bastien Pasdeloup",
      "Giulia Lioi",
      "Lukas Mauch",
      "Fabien Cardinaux",
      "Ghouthi Boukli Hacene"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.14573",
    "title": "Uncertainties in Robust Planning and Control of Autonomous  Tractor-Trailer Vehicles",
    "abstract": "To study the effects of uncertainty in autonomous motion planning and control, an 8-DOF model of a tractor-semitrailer is implemented and analyzed. The implications of uncertainties in the model are then quantified and presented using sensitivity analysis and closed-loop simulations. The analysis reveals that the significance of various model parameters varies depending on the specific scenario under investigation. By using sampling-based closed-loop predictions, uncertainty bounds on state variable trajectories are determined. Our findings suggest the potential for the inclusion of our method within a robust predictive controller or as a driver-assistance system for rollover or lane departure warnings. ",
    "url": "https://arxiv.org/abs/2311.14573",
    "authors": [
      "Theodor Westny",
      "Björn Olofsson",
      "Erik Frisk"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.14595",
    "title": "A Survey and Analysis of Evolutionary Operators for Permutations",
    "abstract": "There are many combinatorial optimization problems whose solutions are best represented by permutations. The classic traveling salesperson seeks an optimal ordering over a set of cities. Scheduling problems often seek optimal orderings of tasks or activities. Although some evolutionary approaches to such problems utilize the bit strings of a genetic algorithm, it is more common to directly represent solutions with permutations. Evolving permutations directly requires specialized evolutionary operators. Over the years, many crossover and mutation operators have been developed for solving permutation problems with evolutionary algorithms. In this paper, we survey the breadth of evolutionary operators for permutations. We implemented all of these in Chips-n-Salsa, an open source Java library for evolutionary computation. Finally, we empirically analyze the crossover operators on artificial fitness landscapes isolating different permutation features. ",
    "url": "https://arxiv.org/abs/2311.14595",
    "authors": [
      "Vincent A. Cicirello"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2311.14601",
    "title": "A Metalearned Neural Circuit for Nonparametric Bayesian Inference",
    "abstract": "Most applications of machine learning to classification assume a closed set of balanced classes. This is at odds with the real world, where class occurrence statistics often follow a long-tailed power-law distribution and it is unlikely that all classes are seen in a single sample. Nonparametric Bayesian models naturally capture this phenomenon, but have significant practical barriers to widespread adoption, namely implementation complexity and computational inefficiency. To address this, we present a method for extracting the inductive bias from a nonparametric Bayesian model and transferring it to an artificial neural network. By simulating data with a nonparametric Bayesian prior, we can metalearn a sequence model that performs inference over an unlimited set of classes. After training, this \"neural circuit\" has distilled the corresponding inductive bias and can successfully perform sequential inference over an open set of classes. Our experimental results show that the metalearned neural circuit achieves comparable or better performance than particle filter-based methods for inference in these models while being faster and simpler to use than methods that explicitly incorporate Bayesian nonparametric inference. ",
    "url": "https://arxiv.org/abs/2311.14601",
    "authors": [
      "Jake C. Snell",
      "Gianluca Bencomo",
      "Thomas L. Griffiths"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2311.14604",
    "title": "Evolution of Neural Architectures for Financial Forecasting: A Note on  Data Incompatibility during Crisis Periods",
    "abstract": "This note focuses on the optimization of neural architectures for stock index movement forecasting following a major market disruption or crisis. Given that such crises may introduce a shift in market dynamics, this study aims to investigate whether the training data from market dynamics prior to the crisis are compatible with the data during the crisis period. To this end, two distinct learning environments are designed to evaluate and reconcile the effects of possibly different market dynamics. These environments differ principally based on the role assigned to the pre-crisis data. In both environments, a set of non-dominated architectures are identified to satisfy the multi-criteria co-evolution problem, which simultaneously addresses the selection issues related to features and hidden layer topology. To test the hypothesis of pre-crisis data incompatibility, the day-ahead movement prediction of the NASDAQ index is considered during two recent and major market disruptions; the 2008 financial crisis and the COVID-19 pandemic. The results of a detailed comparative evaluation convincingly support the incompatibility hypothesis and highlight the need to select re-training windows carefully. ",
    "url": "https://arxiv.org/abs/2311.14604",
    "authors": [
      "Faizal Hafiz",
      "Jan Broekaert",
      "Akshya Swain"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2311.14617",
    "title": "Neural Style Transfer for Computer Games",
    "abstract": "Neural Style Transfer (NST) research has been applied to images, videos, 3D meshes and radiance fields, but its application to 3D computer games remains relatively unexplored. Whilst image and video NST systems can be used as a post-processing effect for a computer game, this results in undesired artefacts and diminished post-processing effects. Here, we present an approach for injecting depth-aware NST as part of the 3D rendering pipeline. Qualitative and quantitative experiments are used to validate our in-game stylisation framework. We demonstrate temporally consistent results of artistically stylised game scenes, outperforming state-of-the-art image and video NST methods. ",
    "url": "https://arxiv.org/abs/2311.14617",
    "authors": [
      "Eleftherios Ioannou",
      "Steve Maddock"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.14634",
    "title": "New Bounds on the Local and Global Edge-length Ratio of Planar Graphs",
    "abstract": "The \\emph{local edge-length ratio} of a planar straight-line drawing $\\Gamma$ is the largest ratio between the lengths of any pair of edges of $\\Gamma$ that share a common vertex. The \\emph{global edge-length ratio} of $\\Gamma$ is the largest ratio between the lengths of any pair of edges of $\\Gamma$. The local (global) edge-length ratio of a planar graph is the infimum over all local (global) edge-length ratios of its planar straight-line drawings. We show that there exist planar graphs with $n$ vertices whose local edge-length ratio is $\\Omega(\\sqrt{n})$. We then show a technique to establish upper bounds on the global (and hence local) edge-length ratio of planar graphs and~apply~it to Halin graphs and to other families of graphs having outerplanarity two. ",
    "url": "https://arxiv.org/abs/2311.14634",
    "authors": [
      "Emilio Di Giacomo",
      "Walter Didimo",
      "Giuseppe Liotta",
      "Henk Meijer",
      "Fabrizio Montecchiani",
      "Stephen Wismath"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2311.14635",
    "title": "Automated Detection and Counting of Windows using UAV Imagery based  Remote Sensing",
    "abstract": "Despite the technological advancements in the construction and surveying sector, the inspection of salient features like windows in an under-construction or existing building is predominantly a manual process. Moreover, the number of windows present in a building is directly related to the magnitude of deformation it suffers under earthquakes. In this research, a method to accurately detect and count the number of windows of a building by deploying an Unmanned Aerial Vehicle (UAV) based remote sensing system is proposed. The proposed two-stage method automates the identification and counting of windows by developing computer vision pipelines that utilize data from UAV's onboard camera and other sensors. Quantitative and Qualitative results show the effectiveness of our proposed approach in accurately detecting and counting the windows compared to the existing method. ",
    "url": "https://arxiv.org/abs/2311.14635",
    "authors": [
      "Dhruv Patel",
      "Shivani Chepuri",
      "Sarvesh Thakur",
      "K. Harikumar",
      "Ravi Kiran S.",
      "K. Madhava Krishna"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.14649",
    "title": "Learning in Deep Factor Graphs with Gaussian Belief Propagation",
    "abstract": "We propose an approach to do learning in Gaussian factor graphs. We treat all relevant quantities (inputs, outputs, parameters, latents) as random variables in a graphical model, and view both training and prediction as inference problems with different observed nodes. Our experiments show that these problems can be efficiently solved with belief propagation (BP), whose updates are inherently local, presenting exciting opportunities for distributed and asynchronous training. Our approach can be scaled to deep networks and provides a natural means to do continual learning: use the BP-estimated parameter marginals of the current task as parameter priors for the next. On a video denoising task we demonstrate the benefit of learnable parameters over a classical factor graph approach and we show encouraging performance of deep factor graphs for continual image classification on MNIST. ",
    "url": "https://arxiv.org/abs/2311.14649",
    "authors": [
      "Seth Nabarro",
      "Mark van der Wilk",
      "Andrew J Davison"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2311.14650",
    "title": "GVEL: Fast Graph Loading in Edgelist and Compressed Sparse Row (CSR)  formats",
    "abstract": "Efficient IO techniques are crucial in high-performance graph processing frameworks like Gunrock and Hornet, as fast graph loading is essential to minimize processing time and reduce system/cloud usage charges. This research study presents approaches for efficiently reading an Edgelist from a text file and converting it to a Compressed Sparse Row (CSR) representation. On a server with dual 16-core Intel Xeon Gold 6226R processors and MegaRAID SAS-3 storage, our approach, which we term as GVEL, outperforms Hornet, Gunrock, and PIGO by significant margins in CSR reading, exhibiting an average speedup of 78x, 112x, and 1.8x, respectively. For Edgelist reading, GVEL is 2.6x faster than PIGO on average, and achieves a Edgelist read rate of 1.9 billion edges/s. For every doubling of threads, GVEL improves performance at an average rate of 1.9x and 1.7x for reading Edgelist and reading CSR respectively. ",
    "url": "https://arxiv.org/abs/2311.14650",
    "authors": [
      "Subhajit Sahu"
    ],
    "subjectives": [
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2311.14658",
    "title": "Convergence Analysis for Learning Orthonormal Deep Linear Neural  Networks",
    "abstract": "Enforcing orthonormal or isometric property for the weight matrices has been shown to enhance the training of deep neural networks by mitigating gradient exploding/vanishing and increasing the robustness of the learned networks. However, despite its practical performance, the theoretical analysis of orthonormality in neural networks is still lacking; for example, how orthonormality affects the convergence of the training process. In this letter, we aim to bridge this gap by providing convergence analysis for training orthonormal deep linear neural networks. Specifically, we show that Riemannian gradient descent with an appropriate initialization converges at a linear rate for training orthonormal deep linear neural networks with a class of loss functions. Unlike existing works that enforce orthonormal weight matrices for all the layers, our approach excludes this requirement for one layer, which is crucial to establish the convergence guarantee. Our results shed light on how increasing the number of hidden layers can impact the convergence speed. Experimental results validate our theoretical analysis. ",
    "url": "https://arxiv.org/abs/2311.14658",
    "authors": [
      "Zhen Qin",
      "Xuwei Tan",
      "Zhihui Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2311.14665",
    "title": "Understanding Self-Supervised Features for Learning Unsupervised  Instance Segmentation",
    "abstract": "Self-supervised learning (SSL) can be used to solve complex visual tasks without human labels. Self-supervised representations encode useful semantic information about images, and as a result, they have already been used for tasks such as unsupervised semantic segmentation. In this paper, we investigate self-supervised representations for instance segmentation without any manual annotations. We find that the features of different SSL methods vary in their level of instance-awareness. In particular, DINO features, which are known to be excellent semantic descriptors, lack behind MAE features in their sensitivity for separating instances. ",
    "url": "https://arxiv.org/abs/2311.14665",
    "authors": [
      "Paul Engstler",
      "Luke Melas-Kyriazi",
      "Christian Rupprecht",
      "Iro Laina"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:quant-ph/0502031",
    "title": "Mutually Unbiased Bases are Complex Projective 2-Designs",
    "abstract": "Mutually unbiased bases (MUBs) are a primitive used in quantum information processing to capture the principle of complementarity. While constructions of maximal sets of d+1 such bases are known for systems of prime power dimension d, it is unknown whether this bound can be achieved for any non-prime power dimension. In this paper we demonstrate that maximal sets of MUBs come with a rich combinatorial structure by showing that they actually are the same objects as the complex projective 2-designs with angle set {0,1/d}. We also give a new and simple proof that symmetric informationally complete POVMs are complex projective 2-designs with angle set {1/(d+1)}. ",
    "url": "https://arxiv.org/abs/quant-ph/0502031",
    "authors": [
      "Andreas Klappenecker",
      "Martin Roetteler"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:quant-ph/0511148",
    "title": "Limitations of Quantum Coset States for Graph Isomorphism",
    "abstract": "It has been known for some time that graph isomorphism reduces to the hidden subgroup problem (HSP). What is more, most exponential speedups in quantum computation are obtained by solving instances of the HSP. A common feature of the resulting algorithms is the use of quantum coset states, which encode the hidden subgroup. An open question has been how hard it is to use these states to solve graph isomorphism. It was recently shown by Moore, Russell, and Schulman that only an exponentially small amount of information is available from one, or a pair of coset states. A potential source of power to exploit are entangled quantum measurements that act jointly on many states at once. We show that entangled quantum measurements on at least \\Omega(n log n) coset states are necessary to get useful information for the case of graph isomorphism, matching an information theoretic upper bound. This may be viewed as a negative result because highly entangled measurements seem hard to implement in general. Our main theorem is very general and also rules out using joint measurements on few coset states for some other groups, such as GL(n, F_{p^m}) and G^n where G is finite and satisfies a suitable property. ",
    "url": "https://arxiv.org/abs/quant-ph/0511148",
    "authors": [
      "Sean Hallgren",
      "Martin Roetteler",
      "Pranab Sen"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2311.13060",
    "title": "Training Deep 3D Convolutional Neural Networks to Extract BSM Physics  Parameters Directly from HEP Data: a Proof-of-Concept Study Using Monte Carlo  Simulations",
    "abstract": "We report on a novel application of computer vision techniques to extract beyond the Standard Model (BSM) parameters directly from high energy physics (HEP) flavor data. We develop a method of transforming angular and kinematic distributions into \"quasi-images\" that can be used to train a convolutional neural network to perform regression tasks, similar to fitting. This contrasts with the usual classification functions performed using ML/AI in HEP. As a proof-of-concept, we train a 34-layer Residual Neural Network to regress on these images and determine the Wilson Coefficient $C_{9}$ in MC (Monte Carlo) simulations of $B \\rightarrow K^{*}\\mu^{+}\\mu^{-}$ decays. The technique described here can be generalized and may find applicability across various HEP experiments and elsewhere. ",
    "url": "https://arxiv.org/abs/2311.13060",
    "authors": [
      "S. Dubey",
      "T.E. Browder",
      "S.Kohani",
      "R. Mandal",
      "A. Sibidanov",
      "R. Sinha"
    ],
    "subjectives": [
      "High Energy Physics - Experiment (hep-ex)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)"
    ]
  },
  {
    "id": "arXiv:2311.13626",
    "title": "Physics-driven generative adversarial networks empower single-pixel  infrared hyperspectral imaging",
    "abstract": "A physics-driven generative adversarial network (GAN) was established here for single-pixel hyperspectral imaging (HSI) in the infrared spectrum, to eliminate the extensive data training work required by traditional data-driven model. Within the GAN framework, the physical process of single-pixel imaging (SPI) was integrated into the generator, and the actual and estimated one-dimensional (1D) bucket signals were employed as constraints in the objective function to update the network's parameters and optimize the generator with the assistance of the discriminator. In comparison to single-pixel infrared HSI methods based on compressed sensing and physics-driven convolution neural networks, our physics-driven GAN-based single-pixel infrared HSI can achieve higher imaging performance but with fewer measurements. We believe that this physics-driven GAN will promote practical applications of computational imaging, especially various SPI-based techniques. ",
    "url": "https://arxiv.org/abs/2311.13626",
    "authors": [
      "Dong-Yin Wang",
      "Shu-Hang Bie",
      "Xi-Hao Chen",
      "Wen-Kai Yu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2311.13706",
    "title": "Multi-view Hybrid Graph Convolutional Network for Volume-to-mesh  Reconstruction in Cardiovascular MRI",
    "abstract": "Cardiovascular magnetic resonance imaging is emerging as a crucial tool to examine cardiac morphology and function. Essential to this endeavour are anatomical 3D surface and volumetric meshes derived from CMR images, which facilitate computational anatomy studies, biomarker discovery, and in-silico simulations. However, conventional surface mesh generation methods, such as active shape models and multi-atlas segmentation, are highly time-consuming and require complex processing pipelines to generate simulation-ready 3D meshes. In response, we introduce HybridVNet, a novel architecture for direct image-to-mesh extraction seamlessly integrating standard convolutional neural networks with graph convolutions, which we prove can efficiently handle surface and volumetric meshes by encoding them as graph structures. To further enhance accuracy, we propose a multiview HybridVNet architecture which processes both long axis and short axis CMR, showing that it can increase the performance of cardiac MR mesh generation. Our model combines traditional convolutional networks with variational graph generative models, deep supervision and mesh-specific regularisation. Experiments on a comprehensive dataset from the UK Biobank confirm the potential of HybridVNet to significantly advance cardiac imaging and computational cardiology by efficiently generating high-fidelity and simulation ready meshes from CMR images. ",
    "url": "https://arxiv.org/abs/2311.13706",
    "authors": [
      "Nicolás Gaggion",
      "Benjamin A. Matheson",
      "Yan Xia",
      "Rodrigo Bonazzola",
      "Nishant Ravikumar",
      "Zeike A. Taylor",
      "Diego H. Milone",
      "Alejandro F. Frangi",
      "Enzo Ferrante"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.13763",
    "title": "Extraction of n = 0 pick-up by locked mode detectors based on neural  networks in J-TEXT",
    "abstract": "Measurement of locked mode (LM) is important for the physical research of Magnetohydrodynamic (MHD) instabilities and plasma disruption. The n = 0 pick-up need to be extracted and subtracted to calculate the amplitude and phase of the LM. A new method to extract this pick-up has been developed by predicting the n = 0 pick-up brn=0 by the LM detectors based on Neural Networks (NNs) in J-TEXT. An approach called Power Multiple Time Scale (PMTS) has been developed with outstanding regressing effect in multiple frequency ranges. Three models have been progressed based on PMTS NNs. PMTS could fit the brn=0 on the LM detectors with little errors both in time domain and frequency domain. The n>0 pick-up brn>0 generated by resonant magnetic perturbations (RMPs) can be obtained after subtracting the extracted brn=0. This new method uses only one LM instead of 4 LM detectors to extract brn=0. Therefore, the distribution of the LM detectors can also be optimized based on this new method. ",
    "url": "https://arxiv.org/abs/2311.13763",
    "authors": [
      "Chengshuo Shen",
      "Jianchao Li",
      "Yonghua Ding",
      "Jiaolong Dong",
      "Nengchao Wang",
      "Dongliang.Han",
      "Feiyue Mao",
      "Da Li",
      "Zhipeng Chen",
      "Zhoujun Yang",
      "Zhongyong Chen",
      "Yuan Pan",
      "J-Text Team"
    ],
    "subjectives": [
      "Plasma Physics (physics.plasm-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.13779",
    "title": "Detection and Identification Accuracy of PCA-Accelerated Real-Time  Processing of Hyperspectral Imagery",
    "abstract": "Real-time or near real-time hyperspectral detection and identification are extremely useful and needed in many fields. These data sets can be quite large, and the algorithms can require numerous computations that slow the process down. A common way of speeding up the process is to use principal component analysis (PCA) for dimension reduction. In the reduced dimensional space, provided by a subset of the principal components, fewer computations are needed to process the data resulting in a faster run time. In this paper, we propose a way to further decrease the time required to use PCA by investigating how many principal components may be omitted with minimal impact on the detection rate. Using ACE to perform the detection, and then probability, and spectral fit for identification, we find that the number of principal components can be reduced by a substantial amount before seeing a noticeable change in detection rates. ",
    "url": "https://arxiv.org/abs/2311.13779",
    "authors": [
      "Abigail Basener",
      "Meagan Herald"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.13810",
    "title": "Bridging Classical and Quantum Machine Learning: Knowledge Transfer From  Classical to Quantum Neural Networks Using Knowledge Distillation",
    "abstract": "Very recently, studies have shown that quantum neural networks surpass classical neural networks in tasks like image classification when a similar number of learnable parameters are used. However, the development and optimization of quantum models are currently hindered by issues such as qubit instability and limited qubit availability, leading to error-prone systems with weak performance. In contrast, classical models can exhibit high-performance owing to substantial resource availability. As a result, more studies have been focusing on hybrid classical-quantum integration. A line of research particularly focuses on transfer learning through classical-quantum integration or quantum-quantum approaches. Unlike previous studies, this paper introduces a new method to transfer knowledge from classical to quantum neural networks using knowledge distillation, effectively bridging the gap between classical machine learning and emergent quantum computing techniques. We adapt classical convolutional neural network (CNN) architectures like LeNet and AlexNet to serve as teacher networks, facilitating the training of student quantum models by sending supervisory signals during backpropagation through KL-divergence. The approach yields significant performance improvements for the quantum models by solely depending on classical CNNs, with quantum models achieving an average accuracy improvement of 0.80% on the MNIST dataset and 5.40% on the more complex Fashion MNIST dataset. Applying this technique eliminates the cumbersome training of huge quantum models for transfer learning in resource-constrained settings and enables re-using existing pre-trained classical models to improve performance.Thus, this study paves the way for future research in quantum machine learning (QML) by positioning knowledge distillation as a core technique for advancing QML applications. ",
    "url": "https://arxiv.org/abs/2311.13810",
    "authors": [
      "Mohammad Junayed Hasan",
      "M.R.C.Mahdy"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.13812",
    "title": "Mechanical Characterization and Inverse Design of Stochastic Architected  Metamaterials Using Neural Operators",
    "abstract": "Machine learning (ML) is emerging as a transformative tool for the design of architected materials, offering properties that far surpass those achievable through lab-based trial-and-error methods. However, a major challenge in current inverse design strategies is their reliance on extensive computational and/or experimental datasets, which becomes particularly problematic for designing micro-scale stochastic architected materials that exhibit nonlinear mechanical behaviors. Here, we introduce a new end-to-end scientific ML framework, leveraging deep neural operators (DeepONet), to directly learn the relationship between the complete microstructure and mechanical response of architected metamaterials from sparse but high-quality in situ experimental data. The approach facilitates the inverse design of structures tailored to specific nonlinear mechanical behaviors. Results obtained from spinodal microstructures, printed using two-photon lithography, reveal that the prediction error for mechanical responses is within a range of 5 - 10%. Our work underscores that by employing neural operators with advanced micro-mechanics experimental techniques, the design of complex micro-architected materials with desired properties becomes feasible, even in scenarios constrained by data scarcity. Our work marks a significant advancement in the field of materials-by-design, potentially heralding a new era in the discovery and development of next-generation metamaterials with unparalleled mechanical characteristics derived directly from experimental insights. ",
    "url": "https://arxiv.org/abs/2311.13812",
    "authors": [
      "Hanxun Jin",
      "Enrui Zhang",
      "Boyu Zhang",
      "Sridhar Krishnaswamy",
      "George Em Karniadakis",
      "Horacio D. Espinosa"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.13876",
    "title": "EEG Connectivity Analysis Using Denoising Autoencoders for the Detection  of Dyslexia",
    "abstract": "The Temporal Sampling Framework (TSF) theorizes that the characteristic phonological difficulties of dyslexia are caused by an atypical oscillatory sampling at one or more temporal rates. The LEEDUCA study conducted a series of Electroencephalography (EEG) experiments on children listening to amplitude modulated (AM) noise with slow-rythmic prosodic (0.5-1 Hz), syllabic (4-8 Hz) or the phoneme (12-40 Hz) rates, aimed at detecting differences in perception of oscillatory sampling that could be associated with dyslexia. The purpose of this work is to check whether these differences exist and how they are related to children's performance in different language and cognitive tasks commonly used to detect dyslexia. To this purpose, temporal and spectral inter-channel EEG connectivity was estimated, and a denoising autoencoder (DAE) was trained to learn a low-dimensional representation of the connectivity matrices. This representation was studied via correlation and classification analysis, which revealed ability in detecting dyslexic subjects with an accuracy higher than 0.8, and balanced accuracy around 0.7. Some features of the DAE representation were significantly correlated ($p<0.005$) with children's performance in language and cognitive tasks of the phonological hypothesis category such as phonological awareness and rapid symbolic naming, as well as reading efficiency and reading comprehension. Finally, a deeper analysis of the adjacency matrix revealed a reduced bilateral connection between electrodes of the temporal lobe (roughly the primary auditory cortex) in DD subjects, as well as an increased connectivity of the F7 electrode, placed roughly on Broca's area. These results pave the way for a complementary assessment of dyslexia using more objective methodologies such as EEG. ",
    "url": "https://arxiv.org/abs/2311.13876",
    "authors": [
      "Francisco Jesus Martinez-Murcia",
      "Andrés Ortiz",
      "Juan Manuel Górriz",
      "Javier Ramírez",
      "Pedro Javier Lopez-Perez",
      "Miguel López-Zamora",
      "Juan Luis Luque"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2311.13906",
    "title": "Threat-Based Resource Allocation Strategy for Target Tracking in a  Cognitive Radar Network",
    "abstract": "Cognitive radar is developed to utilize the feedback of its operating environment obtained from a beam to make resource allocation decisions by solving optimization problems. Previous works focused on target tracking accuracy by designing an evaluation metric for an optimization problem. However, in a real combat situation, not only the tracking performance of the target but also its operational perspective should be considered. In this study, the usage of threats in the allocation of radar resource is proposed for a cognitive radar framework. Resource allocation regarding radar dwell time is considered to reflect the operational importance of target effects. The dwell time allocation problem is solved using a Second-Order Cone Program (SOCP). Numerical simulations are performed to verify the effectiveness of the proposed framework. ",
    "url": "https://arxiv.org/abs/2311.13906",
    "authors": [
      "JiYe Lee",
      "J.H Park"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.13917",
    "title": "Exploring the impact of social stress on the adaptive dynamics of  COVID-19: Typing the behavior of naïve populations faced with epidemics",
    "abstract": "In the context of natural disasters, human responses inevitably intertwine with natural factors. The COVID-19 pandemic, as a significant stress factor, has brought to light profound variations among different countries in terms of their adaptive dynamics in addressing the spread of infection outbreaks across different regions. This emphasizes the crucial role of cultural characteristics in natural disaster analysis. The theoretical understanding of large-scale epidemics primarily relies on mean-field kinetic models. However, conventional SIR-like models failed to fully explain the observed phenomena at the onset of the COVID-19 outbreak. These phenomena included the unexpected cessation of exponential growth, the reaching of plateaus, and the occurrence of multi-wave dynamics. In situations where an outbreak of a highly virulent and unfamiliar infection arises, it becomes crucial to respond swiftly at a non-medical level to mitigate the negative socio-economic impact. Here we present a theoretical examination of the first wave of the epidemic based on a simple SIRSS model (SIR with Social Stress). We conduct an analysis of the socio-cultural features of na\\\"ive population behaviors across various countries worldwide. The unique characteristics of each country/territory are encapsulated in only a few constants within our model, derived from the fitted COVID-19 statistics. These constants also reflect the societal response dynamics to the external stress factor, underscoring the importance of studying the mutual behavior of humanity and natural factors during global social disasters. Based on these distinctive characteristics of specific regions, local authorities can optimize their strategies to effectively combat epidemics until vaccines are developed. ",
    "url": "https://arxiv.org/abs/2311.13917",
    "authors": [
      "Innokentiy Kastalskiy",
      "Andrei Zinovyev",
      "Evgeny Mirkes",
      "Victor Kazantsev",
      "Alexander N. Gorban"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14160",
    "title": "Efficient and Robust Jet Tagging at the LHC with Knowledge Distillation",
    "abstract": "The challenging environment of real-time data processing systems at the Large Hadron Collider (LHC) strictly limits the computational complexity of algorithms that can be deployed. For deep learning models, this implies that only models with low computational complexity that have weak inductive bias are feasible. To address this issue, we utilize knowledge distillation to leverage both the performance of large models and the reduced computational complexity of small ones. In this paper, we present an implementation of knowledge distillation, demonstrating an overall boost in the student models' performance for the task of classifying jets at the LHC. Furthermore, by using a teacher model with a strong inductive bias of Lorentz symmetry, we show that we can induce the same inductive bias in the student model which leads to better robustness against arbitrary Lorentz boost. ",
    "url": "https://arxiv.org/abs/2311.14160",
    "authors": [
      "Ryan Liu",
      "Abhijith Gandrakota",
      "Jennifer Ngadiuba",
      "Maria Spiropulu",
      "Jean-Roch Vlimant"
    ],
    "subjectives": [
      "High Energy Physics - Experiment (hep-ex)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14197",
    "title": "Enhancing mTBI Diagnosis with Residual Triplet Convolutional Neural  Network Using 3D CT",
    "abstract": "Mild Traumatic Brain Injury (mTBI) is a common and challenging condition to diagnose accurately. Timely and precise diagnosis is essential for effective treatment and improved patient outcomes. Traditional diagnostic methods for mTBI often have limitations in terms of accuracy and sensitivity. In this study, we introduce an innovative approach to enhance mTBI diagnosis using 3D Computed Tomography (CT) images and a metric learning technique trained with triplet loss. To address these challenges, we propose a Residual Triplet Convolutional Neural Network (RTCNN) model to distinguish between mTBI cases and healthy ones by embedding 3D CT scans into a feature space. The triplet loss function maximizes the margin between similar and dissimilar image pairs, optimizing feature representations. This facilitates better context placement of individual cases, aids informed decision-making, and has the potential to improve patient outcomes. Our RTCNN model shows promising performance in mTBI diagnosis, achieving an average accuracy of 94.3%, a sensitivity of 94.1%, and a specificity of 95.2%, as confirmed through a five-fold cross-validation. Importantly, when compared to the conventional Residual Convolutional Neural Network (RCNN) model, the RTCNN exhibits a significant improvement, showcasing a remarkable 22.5% increase in specificity, a notable 16.2% boost in accuracy, and an 11.3% enhancement in sensitivity. Moreover, RTCNN requires lower memory resources, making it not only highly effective but also resource-efficient in minimizing false positives while maximizing its diagnostic accuracy in distinguishing normal CT scans from mTBI cases. The quantitative performance metrics provided and utilization of occlusion sensitivity maps to visually explain the model's decision-making process further enhance the interpretability and transparency of our approach. ",
    "url": "https://arxiv.org/abs/2311.14197",
    "authors": [
      "Hanem Ellethy",
      "Shekhar S. Chandra",
      "Viktor Vegh"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14227",
    "title": "Robust and Interpretable COVID-19 Diagnosis on Chest X-ray Images using  Adversarial Training",
    "abstract": "The novel 2019 Coronavirus disease (COVID-19) global pandemic is a defining health crisis. Recent efforts have been increasingly directed towards achieving quick and accurate detection of COVID-19 across symptomatic patients to mitigate the intensity and spread of the disease. Artificial intelligence (AI) algorithms applied to chest X-ray (CXR) images have emerged as promising diagnostic tools, and previous work has demonstrated impressive classification performances. However, such methods have faced criticisms from physicians due to their black-box reasoning process and unpredictable nature. In contrast to professional radiologist diagnosis, AI systems often lack generalizability, explainability, and robustness in the clinical decision making process. In our work, we address these issues by first proposing an extensive baseline study, training and evaluating 21 convolutional neural network (CNN) models on a diverse set of 33,000+ CXR images to classify between healthy, COVID-19, and non-COVID-19 pneumonia CXRs. Our resulting models achieved a 3-way classification accuracy, recall, and precision of up to 97.03\\%, 97.97\\%, and 99.95\\%, respectively. Next, we investigate the effectiveness of adversarial training on model robustness and explainability via Gradient-weighted Class Activation Mapping (Grad-CAM) heatmaps. We find that adversarially trained models not only significantly outperform their standard counterparts on classifying perturbed images, but also yield saliency maps that 1) better specify clinically relevant features, 2) are robust against extraneous artifacts, and 3) agree considerably more with expert radiologist findings. ",
    "url": "https://arxiv.org/abs/2311.14227",
    "authors": [
      "Karina Yang",
      "Alexis Bennett",
      "Dominique Duncan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14303",
    "title": "RFI Detection with Spiking Neural Networks",
    "abstract": "Radio Frequency Interference (RFI) detection and mitigation is critical for enabling and maximising the scientific output of radio telescopes. The emergence of machine learning methods capable of handling large datasets has led to their application in radio astronomy, particularly in RFI detection. Spiking Neural Networks (SNNs), inspired by biological systems, are well-suited for processing spatio-temporal data. This study introduces the first application of SNNs to an astronomical data-processing task, specifically RFI detection. We adapt the nearest-latent-neighbours (NLN) algorithm and auto-encoder architecture proposed by previous authors to SNN execution by direct ANN2SNN conversion, enabling simplified downstream RFI detection by sampling the naturally varying latent space from the internal spiking neurons. We evaluate performance with the simulated HERA telescope and hand-labelled LOFAR dataset that the original authors provided. We additionally evaluate performance with a new MeerKAT-inspired simulation dataset. This dataset focuses on satellite-based RFI, an increasingly important class of RFI and is, therefore, an additional contribution. Our SNN approach remains competitive with the original NLN algorithm and AOFlagger in AUROC, AUPRC and F1 scores for the HERA dataset but exhibits difficulty in the LOFAR and MeerKAT datasets. However, our method maintains this performance while completely removing the compute and memory-intense latent sampling step found in NLN. This work demonstrates the viability of SNNs as a promising avenue for machine-learning-based RFI detection in radio telescopes by establishing a minimal performance baseline on traditional and nascent satellite-based RFI sources and is the first work to our knowledge to apply SNNs in astronomy. ",
    "url": "https://arxiv.org/abs/2311.14303",
    "authors": [
      "Nicholas J. Pritchard",
      "Andreas Wicenec",
      "Mohammed Bennamoun",
      "Richard Dodson"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2311.14316",
    "title": "Windformer:Bi-Directional Long-Distance Spatio-Temporal Network For Wind  Speed Prediction",
    "abstract": "Wind speed prediction is critical to the management of wind power generation. Due to the large range of wind speed fluctuations and wake effect, there may also be strong correlations between long-distance wind turbines. This difficult-to-extract feature has become a bottleneck for improving accuracy. History and future time information includes the trend of airflow changes, whether this dynamic information can be utilized will also affect the prediction effect. In response to the above problems, this paper proposes Windformer. First, Windformer divides the wind turbine cluster into multiple non-overlapping windows and calculates correlations inside the windows, then shifts the windows partially to provide connectivity between windows, and finally fuses multi-channel features based on detailed and global information. To dynamically model the change process of wind speed, this paper extracts time series in both history and future directions simultaneously. Compared with other current-advanced methods, the Mean Square Error (MSE) of Windformer is reduced by 0.5\\% to 15\\% on two datasets from NERL. ",
    "url": "https://arxiv.org/abs/2311.14316",
    "authors": [
      "Xuewei Li",
      "Zewen Shang",
      "Zhiqiang Liu",
      "Jian Yu",
      "Wei Xiong",
      "Mei Yu"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.14326",
    "title": "Temporal link prediction methods based on behavioral synchrony",
    "abstract": "Link prediction -- to identify potential missing or spurious links in temporal network data -- has typically been based on local structures, ignoring long-term temporal effects. In this chapter, we propose link-prediction methods based on agents' behavioral synchrony. Since synchronous behavior signals similarity and similar agents are known to have a tendency to connect in the future, behavioral synchrony could function as a precursor of contacts and, thus, as a basis for link prediction. We use four data sets of different sizes to test the algorithm's accuracy. We compare the results with traditional link prediction models involving both static and temporal networks. Among our findings, we note that the proposed algorithm is superior to conventional methods, with the average accuracy improved by approximately 2% - 5%. We identify different evolution patterns of four network topologies -- a proximity network, a communication network, transportation data, and a collaboration network. We found that: (1) timescale similarity contributes more to the evolution of the human contact network and the human communication network; (2) such contribution is not observed through a transportation network whose evolution pattern is more dependent on network structure than on the behavior of regional agents; (3) both timescale similarity and local structural similarity contribute to the collaboration network. ",
    "url": "https://arxiv.org/abs/2311.14326",
    "authors": [
      "Yueran Duan",
      "Qing Guan",
      "Petter Holme",
      "Yacheng Yang",
      "Wei Guan"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2311.14344",
    "title": "Traveling Salesman Problem from a Tensor Networks Perspective",
    "abstract": "We present a novel quantum-inspired algorithm for solving the Traveling Salesman Problem (TSP) and some of its variations using tensor networks. This approach consists on the simulated initialization of a quantum system with superposition of all possible combinations, an imaginary time evolution, a projection, and lastly a partial trace to search for solutions. We adapt it to different generalizations of the TSP and apply it to the job reassignment problem, a real productive industrial case. ",
    "url": "https://arxiv.org/abs/2311.14344",
    "authors": [
      "Alejandro Mata Ali",
      "Iñigo Perez Delgado",
      "Aitor Moreno Fdez. de Leceta"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2311.14364",
    "title": "The Depth Poset of a Filtered Lefschetz Complex",
    "abstract": "Taking a discrete approach to functions and dynamical systems, this paper integrates the combinatorial gradients in Forman's discrete Morse theory with persistent homology to forge a unified approach to function simplification. The two crucial ingredients in this effort are the Lefschetz complex, which focuses on the homology at the expense of the geometry of the cells, and the shallow pairs, which are birth-death pairs that can double as vectors in discrete Morse theory. The main new concept is the depth poset on the birth-death pairs, which captures all simplifications achieved through canceling shallow pairs. One of its linear extensions is the ordering by persistence. ",
    "url": "https://arxiv.org/abs/2311.14364",
    "authors": [
      "Herbert Edelsbrunner",
      "Marian Mrozek"
    ],
    "subjectives": [
      "Algebraic Topology (math.AT)",
      "Computational Geometry (cs.CG)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2311.14609",
    "title": "Analysis of the expected $L_2$ error of an over-parametrized deep neural  network estimate learned by gradient descent without regularization",
    "abstract": "Recent results show that estimates defined by over-parametrized deep neural networks learned by applying gradient descent to a regularized empirical $L_2$ risk are universally consistent and achieve good rates of convergence. In this paper, we show that the regularization term is not necessary to obtain similar results. In the case of a suitably chosen initialization of the network, a suitable number of gradient descent steps, and a suitable step size we show that an estimate without a regularization term is universally consistent for bounded predictor variables. Additionally, we show that if the regression function is H\\\"older smooth with H\\\"older exponent $1/2 \\leq p \\leq 1$, the $L_2$ error converges to zero with a convergence rate of approximately $n^{-1/(1+d)}$. Furthermore, in case of an interaction model, where the regression function consists of a sum of H\\\"older smooth functions with $d^*$ components, a rate of convergence is derived which does not depend on the input dimension $d$. ",
    "url": "https://arxiv.org/abs/2311.14609",
    "authors": [
      "Selina Drews",
      "Michael Kohler"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14654",
    "title": "JetLOV: Enhancing Jet Tree Tagging through Neural Network Learning of  Optimal LundNet Variables",
    "abstract": "Machine learning has played a pivotal role in advancing physics, with deep learning notably contributing to solving complex classification problems such as jet tagging in the field of jet physics. In this experiment, we aim to harness the full potential of neural networks while acknowledging that, at times, we may lose sight of the underlying physics governing these models. Nevertheless, we demonstrate that we can achieve remarkable results obscuring physics knowledge and relying completely on the model's outcome. We introduce JetLOV, a composite comprising two models: a straightforward multilayer perceptron (MLP) and the well-established LundNet. Our study reveals that we can attain comparable jet tagging performance without relying on the pre-computed LundNet variables. Instead, we allow the network to autonomously learn an entirely new set of variables, devoid of a priori knowledge of the underlying physics. These findings hold promise, particularly in addressing the issue of model dependence, which can be mitigated through generalization and training on diverse data sets. ",
    "url": "https://arxiv.org/abs/2311.14654",
    "authors": [
      "Mauricio A. Diaz",
      "Giorgio Cerro",
      "Jacan Chaplais",
      "Srinandan Dasmahapatra",
      "Stefano Moretti"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.01208",
    "title": "Mind the box: $l_1$-APGD for sparse adversarial attacks on image  classifiers",
    "abstract": " Comments: In ICML 2021. Fixed typos in Eq. (3) and Eq. (4) ",
    "url": "https://arxiv.org/abs/2103.01208",
    "authors": [
      "Francesco Croce",
      "Matthias Hein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.00542",
    "title": "Shared Certificates for Neural Network Verification",
    "abstract": " Comments: Extended version of our CAV'22 paper ",
    "url": "https://arxiv.org/abs/2109.00542",
    "authors": [
      "Marc Fischer",
      "Christian Sprecher",
      "Dimitar I. Dimitrov",
      "Gagandeep Singh",
      "Martin Vechev"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2110.02271",
    "title": "Networked Time Series Prediction with Incomplete Data via Generative  Adversarial Network",
    "abstract": " Title: Networked Time Series Prediction with Incomplete Data via Generative  Adversarial Network ",
    "url": "https://arxiv.org/abs/2110.02271",
    "authors": [
      "Yichen Zhu",
      "Bo Jiang",
      "Haiming Jin",
      "Mengtian Zhang",
      "Feng Gao",
      "Jianqiang Huang",
      "Tao Lin",
      "Xinbing Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.07628",
    "title": "Training Multi-Layer Over-Parametrized Neural Network in Subquadratic  Time",
    "abstract": " Comments: ITCS 2024 ",
    "url": "https://arxiv.org/abs/2112.07628",
    "authors": [
      "Zhao Song",
      "Lichen Zhang",
      "Ruizhe Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2201.00292",
    "title": "Fair Data Representation for Machine Learning at the Pareto Frontier",
    "abstract": " Comments: 63 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2201.00292",
    "authors": [
      "Shizhou Xu",
      "Thomas Strohmer"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2204.10581",
    "title": "Fused Audio Instance and Representation for Respiratory Disease  Detection",
    "abstract": " Title: Fused Audio Instance and Representation for Respiratory Disease  Detection ",
    "url": "https://arxiv.org/abs/2204.10581",
    "authors": [
      "Tuan Truong",
      "Matthias Lenga",
      "Antoine Serrurier",
      "Sadegh Mohammadi"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.11291",
    "title": "Large Scale Time-Series Representation Learning via Simultaneous Low and  High Frequency Feature Bootstrapping",
    "abstract": " Title: Large Scale Time-Series Representation Learning via Simultaneous Low and  High Frequency Feature Bootstrapping ",
    "url": "https://arxiv.org/abs/2204.11291",
    "authors": [
      "Vandan Gorade",
      "Azad Singh",
      "Deepak Mishra"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.11161",
    "title": "Sharing pattern submodels for prediction with missing values",
    "abstract": " Title: Sharing pattern submodels for prediction with missing values ",
    "url": "https://arxiv.org/abs/2206.11161",
    "authors": [
      "Lena Stempfle",
      "Ashkan Panahi",
      "Fredrik D. Johansson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2207.01072",
    "title": "Dynamic Sub-Cluster-Aware Network for Few-Shot Skin Disease  Classification",
    "abstract": " Comments: Accepted by TNNLS 2023 ",
    "url": "https://arxiv.org/abs/2207.01072",
    "authors": [
      "Shuhan LI",
      "Xiaomeng Li",
      "Xiaowei Xu",
      "Kwang-Ting Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.09154",
    "title": "Physics-Constrained Neural Network for Design and Feature-Based  Optimization of Weave Architectures",
    "abstract": " Title: Physics-Constrained Neural Network for Design and Feature-Based  Optimization of Weave Architectures ",
    "url": "https://arxiv.org/abs/2209.09154",
    "authors": [
      "Haotian Feng",
      "Sabarinathan P Subramaniyan",
      "Hridyesh Tewani",
      "Pavana Prabhakar"
    ],
    "subjectives": [
      "Applied Physics (physics.app-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.10198",
    "title": "Promoting Social Behaviour in Reducing Peak Electricity Consumption  Using Multi-Agent Systems",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2006.14526 ",
    "url": "https://arxiv.org/abs/2211.10198",
    "authors": [
      "Nathan A. Brooks",
      "Simon T. Powers",
      "James M. Borg"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2211.11744",
    "title": "Visual Dexterity: In-Hand Reorientation of Novel and Complex Object  Shapes",
    "abstract": " Comments: Published in Science Robotics: this https URL ",
    "url": "https://arxiv.org/abs/2211.11744",
    "authors": [
      "Tao Chen",
      "Megha Tippur",
      "Siyang Wu",
      "Vikash Kumar",
      "Edward Adelson",
      "Pulkit Agrawal"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2211.12792",
    "title": "MECCH: Metapath Context Convolution-based Heterogeneous Graph Neural  Networks",
    "abstract": " Comments: 12 pages, 7 figures, 7 tables; published in Neural Networks; code available at this https URL ",
    "url": "https://arxiv.org/abs/2211.12792",
    "authors": [
      "Xinyu Fu",
      "Irwin King"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.05911",
    "title": "Adaptive Self-Training for Object Detection",
    "abstract": " Comments: 10 pages, 4 figures, 5 tables, 1 page of supplementary material ",
    "url": "https://arxiv.org/abs/2212.05911",
    "authors": [
      "Renaud Vandeghen",
      "Gilles Louppe",
      "Marc Van Droogenbroeck"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.07486",
    "title": "CINM (Cinnamon): A Compilation Infrastructure for Heterogeneous Compute  In-Memory and Compute Near-Memory Paradigms",
    "abstract": " Comments: 13 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2301.07486",
    "authors": [
      "Asif Ali Khan",
      "Hamid Farzaneh",
      "Karl F. A. Friebel",
      "Clément Fournier",
      "Lorenzo Chelini",
      "Jeronimo Castrillon"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2302.05104",
    "title": "Monte Carlo Neural PDE Solver for Learning PDEs via Probabilistic  Representation",
    "abstract": " Title: Monte Carlo Neural PDE Solver for Learning PDEs via Probabilistic  Representation ",
    "url": "https://arxiv.org/abs/2302.05104",
    "authors": [
      "Rui Zhang",
      "Qi Meng",
      "Rongchan Zhu",
      "Yue Wang",
      "Wenlei Shi",
      "Shihua Zhang",
      "Zhi-Ming Ma",
      "Tie-Yan Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2302.12115",
    "title": "Dynamic realization of miscellaneous profile services in elastic optical  networks using spectrum partitioning",
    "abstract": " Comments: 12 pages, 13 figures ",
    "url": "https://arxiv.org/abs/2302.12115",
    "authors": [
      "Behnam Gheysari",
      "Arash Rezaee",
      "Lotfollah Beygi"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2303.00132",
    "title": "Onboard dynamic-object detection and tracking for autonomous robot  navigation with RGB-D camera",
    "abstract": " Comments: 8 pages, 10 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2303.00132",
    "authors": [
      "Zhefan Xu",
      "Xiaoyang Zhan",
      "Yumeng Xiu",
      "Christopher Suzuki",
      "Kenji Shimada"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2303.01538",
    "title": "Feature Perturbation Augmentation for Reliable Evaluation of Importance  Estimators in Neural Networks",
    "abstract": " Title: Feature Perturbation Augmentation for Reliable Evaluation of Importance  Estimators in Neural Networks ",
    "url": "https://arxiv.org/abs/2303.01538",
    "authors": [
      "Lennart Brocki",
      "Neo Christopher Chung"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.03962",
    "title": "Cops and Robbers on Multi-Layer Graphs",
    "abstract": " Comments: 30 pages, 6 figures. Latest version contains a strengthening of Theorem 6.2 ",
    "url": "https://arxiv.org/abs/2303.03962",
    "authors": [
      "Jessica Enright",
      "Kitty Meeks",
      "William Pettersson",
      "John Sylvester"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2303.04689",
    "title": "A Privacy Preserving System for Movie Recommendations Using Federated  Learning",
    "abstract": " Comments: Accepted for publication in the ACM Transactions on Recommender Systems (TORS) Special Issue on Trustworthy Recommender Systems ",
    "url": "https://arxiv.org/abs/2303.04689",
    "authors": [
      "David Neumann",
      "Andreas Lutz",
      "Karsten Müller",
      "Wojciech Samek"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.14483",
    "title": "Spatio-Temporal Graph Neural Networks for Predictive Learning in Urban  Computing: A Survey",
    "abstract": " Title: Spatio-Temporal Graph Neural Networks for Predictive Learning in Urban  Computing: A Survey ",
    "url": "https://arxiv.org/abs/2303.14483",
    "authors": [
      "Guangyin Jin",
      "Yuxuan Liang",
      "Yuchen Fang",
      "Zezhi Shao",
      "Jincai Huang",
      "Junbo Zhang",
      "Yu Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.07067",
    "title": "Characterization of the weak Pareto boundary of resource allocation  problems in wireless networks -- Implications to cell-less systems",
    "abstract": " Comments: Accepted at IEEE ICC 2023 ",
    "url": "https://arxiv.org/abs/2304.07067",
    "authors": [
      "Renato Luis Garrido Cavalcante",
      "Lorenzo Miretti",
      "Slawomir Stanczak"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2305.00557",
    "title": "Collective Relational Inference for learning heterogeneous interactions",
    "abstract": " Comments: Under review. Links to the supporting code can be found at the end of the main content ",
    "url": "https://arxiv.org/abs/2305.00557",
    "authors": [
      "Zhichao Han",
      "Olga Fink",
      "David S. Kammer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.03463",
    "title": "Reducing Idleness in Financial Cloud Services via Multi-objective  Evolutionary Reinforcement Learning based Load Balancer",
    "abstract": " Comments: 20 pages, 14 figures ",
    "url": "https://arxiv.org/abs/2305.03463",
    "authors": [
      "Peng Yang",
      "Laoming Zhang",
      "Haifeng Liu",
      "Guiying Li"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2305.12476",
    "title": "Zero-shot Visual Relation Detection via Composite Visual Cues from Large  Language Models",
    "abstract": " Title: Zero-shot Visual Relation Detection via Composite Visual Cues from Large  Language Models ",
    "url": "https://arxiv.org/abs/2305.12476",
    "authors": [
      "Lin Li",
      "Jun Xiao",
      "Guikun Chen",
      "Jian Shao",
      "Yueting Zhuang",
      "Long Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.19190",
    "title": "Inverse Approximation Theory for Nonlinear Recurrent Neural Networks",
    "abstract": " Title: Inverse Approximation Theory for Nonlinear Recurrent Neural Networks ",
    "url": "https://arxiv.org/abs/2305.19190",
    "authors": [
      "Shida Wang",
      "Zhong Li",
      "Qianxiao Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2305.19621",
    "title": "XTransCT: Ultra-Fast Volumetric CT Reconstruction using Two Orthogonal  X-Ray Projections for Image-guided Radiation Therapy via a Transformer  Network",
    "abstract": " Title: XTransCT: Ultra-Fast Volumetric CT Reconstruction using Two Orthogonal  X-Ray Projections for Image-guided Radiation Therapy via a Transformer  Network ",
    "url": "https://arxiv.org/abs/2305.19621",
    "authors": [
      "Chulong Zhang",
      "Lin Liu",
      "Jingjing Dai",
      "Xuan Liu",
      "Wenfeng He",
      "Yinping Chan",
      "Yaoqin Xie",
      "Feng Chi",
      "Xiaokun Liang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2306.06064",
    "title": "Neural Algorithmic Reasoning for Combinatorial Optimisation",
    "abstract": " Title: Neural Algorithmic Reasoning for Combinatorial Optimisation ",
    "url": "https://arxiv.org/abs/2306.06064",
    "authors": [
      "Dobrik Georgiev",
      "Danilo Numeroso",
      "Davide Bacciu",
      "Pietro Liò"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.10548",
    "title": "MARBLE: Music Audio Representation Benchmark for Universal Evaluation",
    "abstract": " Comments: camera-ready version for NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2306.10548",
    "authors": [
      "Ruibin Yuan",
      "Yinghao Ma",
      "Yizhi Li",
      "Ge Zhang",
      "Xingran Chen",
      "Hanzhi Yin",
      "Le Zhuo",
      "Yiqi Liu",
      "Jiawen Huang",
      "Zeyue Tian",
      "Binyue Deng",
      "Ningzhi Wang",
      "Chenghua Lin",
      "Emmanouil Benetos",
      "Anton Ragni",
      "Norbert Gyenge",
      "Roger Dannenberg",
      "Wenhu Chen",
      "Gus Xia",
      "Wei Xue",
      "Si Liu",
      "Shi Wang",
      "Ruibo Liu",
      "Yike Guo",
      "Jie Fu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2306.11380",
    "title": "A Bayesian Take on Gaussian Process Networks",
    "abstract": " Title: A Bayesian Take on Gaussian Process Networks ",
    "url": "https://arxiv.org/abs/2306.11380",
    "authors": [
      "Enrico Giudice",
      "Jack Kuipers",
      "Giusi Moffa"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.13724",
    "title": "Review of compressed embedding layers and their applications for  recommender systems",
    "abstract": " Comments: 10 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2306.13724",
    "authors": [
      "Tamas Hajgato"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.15381",
    "title": "Asymptotic-Preserving Neural Networks for Multiscale Kinetic Equations",
    "abstract": " Title: Asymptotic-Preserving Neural Networks for Multiscale Kinetic Equations ",
    "url": "https://arxiv.org/abs/2306.15381",
    "authors": [
      "Shi Jin",
      "Zheng Ma",
      "Keke Wu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2307.07697",
    "title": "Think-on-Graph: Deep and Responsible Reasoning of Large Language Model  on Knowledge Graph",
    "abstract": " Comments: 30 pages, 13 figures, 20 tables ",
    "url": "https://arxiv.org/abs/2307.07697",
    "authors": [
      "Jiashuo Sun",
      "Chengjin Xu",
      "Lumingyuan Tang",
      "Saizhuo Wang",
      "Chen Lin",
      "Yeyun Gong",
      "Lionel M. Ni",
      "Heung-Yeung Shum",
      "Jian Guo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.12777",
    "title": "Proceeding of the 1st Workshop on Social Robots Personalisation At the  crossroads between engineering and humanities (CONCATENATE)",
    "abstract": " Title: Proceeding of the 1st Workshop on Social Robots Personalisation At the  crossroads between engineering and humanities (CONCATENATE) ",
    "url": "https://arxiv.org/abs/2307.12777",
    "authors": [
      "Imene Tarakli",
      "Georgios Angelopoulos",
      "Mehdi Hellou",
      "Camille Vindolet",
      "Boris Abramovic",
      "Rocco Limongelli",
      "Dimitri Lacroix",
      "Andrea Bertolini",
      "Silvia Rossi",
      "Alessandro Di Nuovo",
      "Angelo Cangelosi",
      "Gordon Cheng"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2307.15064",
    "title": "Self-Supervised Visual Acoustic Matching",
    "abstract": " Comments: Project page: this https URL . Accepted at NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2307.15064",
    "authors": [
      "Arjun Somayazulu",
      "Changan Chen",
      "Kristen Grauman"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2308.08467",
    "title": "On Neural Quantum Support Vector Machines",
    "abstract": " Comments: 16 pages, 1 figure. arXiv admin note: substantial text overlap with arXiv:2308.07204 ",
    "url": "https://arxiv.org/abs/2308.08467",
    "authors": [
      "Lars Simon",
      "Manuel Radons"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.09687",
    "title": "Graph of Thoughts: Solving Elaborate Problems with Large Language Models",
    "abstract": " Title: Graph of Thoughts: Solving Elaborate Problems with Large Language Models ",
    "url": "https://arxiv.org/abs/2308.09687",
    "authors": [
      "Maciej Besta",
      "Nils Blach",
      "Ales Kubicek",
      "Robert Gerstenberger",
      "Lukas Gianinazzi",
      "Joanna Gajda",
      "Tomasz Lehmann",
      "Michal Podstawski",
      "Hubert Niewiadomski",
      "Piotr Nyczyk",
      "Torsten Hoefler"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.10192",
    "title": "EDDense-Net: Fully Dense Encoder Decoder Network for Joint Segmentation  of Optic Cup and Disc",
    "abstract": " Title: EDDense-Net: Fully Dense Encoder Decoder Network for Joint Segmentation  of Optic Cup and Disc ",
    "url": "https://arxiv.org/abs/2308.10192",
    "authors": [
      "Mehwish Mehmood",
      "Khuram Naveed",
      "Khursheed Aurangzeb",
      "Haroon Ahmed Khan",
      "Musaed Alhussein",
      "Syed Saud Naqvi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.12319",
    "title": "RemovalNet: DNN Fingerprint Removal Attacks",
    "abstract": " Comments: Accepted to IEEE TDSC, code is available at: this https URL ",
    "url": "https://arxiv.org/abs/2308.12319",
    "authors": [
      "Hongwei Yao",
      "Zheng Li",
      "Kunzhe Huang",
      "Jian Lou",
      "Zhan Qin",
      "Kui Ren"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16483",
    "title": "Improving Out-of-Distribution Detection in Echocardiographic View  Classication through Enhancing Semantic Features",
    "abstract": " Title: Improving Out-of-Distribution Detection in Echocardiographic View  Classication through Enhancing Semantic Features ",
    "url": "https://arxiv.org/abs/2308.16483",
    "authors": [
      "Jaeik Jeon",
      "Seongmin Ha",
      "Yeonggul Jang",
      "Yeonyee E. Yoon",
      "Jiyeon Kim",
      "Hyunseok Jeong",
      "Dawun Jeong",
      "Youngtaek Hong",
      "Seung-Ah Lee Hyuk-Jae Chang"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.00168",
    "title": "Pose-Graph Attentional Graph Neural Network for Lidar Place Recognition",
    "abstract": " Comments: 10 pages, 5 figures, 5 tables, Accepted for Publication in the IEEE Robotics and Automation Letters (RA-L) ",
    "url": "https://arxiv.org/abs/2309.00168",
    "authors": [
      "Milad Ramezani",
      "Liang Wang",
      "Joshua Knights",
      "Zhibin Li",
      "Pauline Pounds",
      "Peyman Moghadam"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.00851",
    "title": "Drift Analysis with Fitness Levels for Elitist Evolutionary Algorithms",
    "abstract": " Title: Drift Analysis with Fitness Levels for Elitist Evolutionary Algorithms ",
    "url": "https://arxiv.org/abs/2309.00851",
    "authors": [
      "Jun He",
      "Yuren Zhou"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2309.02317",
    "title": "A study on the impact of pre-trained model on Just-In-Time defect  prediction",
    "abstract": " Comments: Accepted by QRS2023 ",
    "url": "https://arxiv.org/abs/2309.02317",
    "authors": [
      "Yuxiang Guo",
      "Xiaopeng Gao",
      "Zhenyu Zhang",
      "W.K.Chan",
      "Bo Jiang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.12862",
    "title": "Associative Transformer Is A Sparse Representation Learner",
    "abstract": " Title: Associative Transformer Is A Sparse Representation Learner ",
    "url": "https://arxiv.org/abs/2309.12862",
    "authors": [
      "Yuwei Sun",
      "Hideya Ochiai",
      "Zhirong Wu",
      "Stephen Lin",
      "Ryota Kanai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2310.00116",
    "title": "Certified Robustness via Dynamic Margin Maximization and Improved  Lipschitz Regularization",
    "abstract": " Title: Certified Robustness via Dynamic Margin Maximization and Improved  Lipschitz Regularization ",
    "url": "https://arxiv.org/abs/2310.00116",
    "authors": [
      "Mahyar Fazlyab",
      "Taha Entesari",
      "Aniket Roy",
      "Rama Chellappa"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.00574",
    "title": "YFlows: Systematic Dataflow Exploration and Code Generation for  Efficient Neural Network Inference using SIMD Architectures on CPUs",
    "abstract": " Title: YFlows: Systematic Dataflow Exploration and Code Generation for  Efficient Neural Network Inference using SIMD Architectures on CPUs ",
    "url": "https://arxiv.org/abs/2310.00574",
    "authors": [
      "Cyrus Zhou",
      "Zack Hassman",
      "Ruize Xu",
      "Dhirpal Shah",
      "Vaugnn Richard",
      "Yanjing Li"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Machine Learning (cs.LG)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2310.00648",
    "title": "Fewer is More: Trojan Attacks on Parameter-Efficient Fine-Tuning",
    "abstract": " Comments: 20 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2310.00648",
    "authors": [
      "Lauren Hong",
      "Ting Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.02428",
    "title": "EGraFFBench: Evaluation of Equivariant Graph Neural Network Force Fields  for Atomistic Simulations",
    "abstract": " Title: EGraFFBench: Evaluation of Equivariant Graph Neural Network Force Fields  for Atomistic Simulations ",
    "url": "https://arxiv.org/abs/2310.02428",
    "authors": [
      "Vaibhav Bihani",
      "Utkarsh Pratiush",
      "Sajid Mannan",
      "Tao Du",
      "Zhimin Chen",
      "Santiago Miret",
      "Matthieu Micoulaut",
      "Morten M Smedskjaer",
      "Sayan Ranu",
      "N M Anoop Krishnan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Materials Science (cond-mat.mtrl-sci)"
    ]
  },
  {
    "id": "arXiv:2310.02970",
    "title": "Fast, Expressive SE$(n)$ Equivariant Networks through Weight-Sharing in  Position-Orientation Space",
    "abstract": " Comments: Our code is publicly available at this https URL ",
    "url": "https://arxiv.org/abs/2310.02970",
    "authors": [
      "Erik J Bekkers",
      "Sharvaree Vadgama",
      "Rob D Hesselink",
      "Putri A van der Linden",
      "David W Romero"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Group Theory (math.GR)"
    ]
  },
  {
    "id": "arXiv:2310.05052",
    "title": "Accurate battery lifetime prediction across diverse aging conditions  with deep learning",
    "abstract": " Title: Accurate battery lifetime prediction across diverse aging conditions  with deep learning ",
    "url": "https://arxiv.org/abs/2310.05052",
    "authors": [
      "Han Zhang",
      "Yuqi Li",
      "Shun Zheng",
      "Ziheng Lu",
      "Xiaofan Gui",
      "Wei Xu",
      "Jiang Bian"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.14948",
    "title": "Physics-Informed Graph Convolutional Networks: Towards a generalized  framework for complex geometries",
    "abstract": " Title: Physics-Informed Graph Convolutional Networks: Towards a generalized  framework for complex geometries ",
    "url": "https://arxiv.org/abs/2310.14948",
    "authors": [
      "Marien Chenaud",
      "José Alves",
      "Frédéric Magoulès"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Mathematical Physics (math-ph)",
      "Analysis of PDEs (math.AP)"
    ]
  },
  {
    "id": "arXiv:2310.20457",
    "title": "FlexTrain: A Dynamic Training Framework for Heterogeneous Devices  Environments",
    "abstract": " Comments: Workshop on Advancing Neural Network Training (WANT) at NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2310.20457",
    "authors": [
      "Mert Unsal",
      "Ali Maatouk",
      "Antonio De Domenico",
      "Nicola Piovesan",
      "Fadhel Ayed"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.03996",
    "title": "An Initialization Schema for Neuronal Networks on Tabular Data",
    "abstract": " Title: An Initialization Schema for Neuronal Networks on Tabular Data ",
    "url": "https://arxiv.org/abs/2311.03996",
    "authors": [
      "Wolfgang Fuhl"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.05286",
    "title": "Causal Inference from Text: Unveiling Interactions between Variables",
    "abstract": " Comments: EMNLP 2023 Findings (mark typo corrected) ",
    "url": "https://arxiv.org/abs/2311.05286",
    "authors": [
      "Yuxiang Zhou",
      "Yulan He"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.06928",
    "title": "Attention for Causal Relationship Discovery from Biological Neural  Dynamics",
    "abstract": " Comments: Accepted to the NeurIPS 2023 Workshop on Causal Representation Learning ",
    "url": "https://arxiv.org/abs/2311.06928",
    "authors": [
      "Ziyu Lu",
      "Anika Tabassum",
      "Shruti Kulkarni",
      "Lu Mi",
      "J. Nathan Kutz",
      "Eric Shea-Brown",
      "Seung-Hwan Lim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2311.06996",
    "title": "AGRAMPLIFIER: Defending Federated Learning Against Poisoning Attacks  Through Local Update Amplification",
    "abstract": " Comments: Accepted by IEEE TIFS, this is the complete version ",
    "url": "https://arxiv.org/abs/2311.06996",
    "authors": [
      "Zirui Gong",
      "Liyue Shen",
      "Yanjun Zhang",
      "Leo Yu Zhang",
      "Jingwei Wang",
      "Guangdong Bai",
      "Yong Xiang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.07075",
    "title": "GazeForensics: DeepFake Detection via Gaze-guided Spatial Inconsistency  Learning",
    "abstract": " Title: GazeForensics: DeepFake Detection via Gaze-guided Spatial Inconsistency  Learning ",
    "url": "https://arxiv.org/abs/2311.07075",
    "authors": [
      "Qinlin He",
      "Chunlei Peng",
      "Decheng Liu",
      "Nannan Wang",
      "Xinbo Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.07553",
    "title": "An Extensive Study on Adversarial Attack against Pre-trained Models of  Code",
    "abstract": " Comments: Accepted to ESEC/FSE 2023 ",
    "url": "https://arxiv.org/abs/2311.07553",
    "authors": [
      "Xiaohu Du",
      "Ming Wen",
      "Zichao Wei",
      "Shangwen Wang",
      "Hai Jin"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.07585",
    "title": "Input Reconstruction Attack against Vertical Federated Large Language  Models",
    "abstract": " Title: Input Reconstruction Attack against Vertical Federated Large Language  Models ",
    "url": "https://arxiv.org/abs/2311.07585",
    "authors": [
      "Fei Zheng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.09433",
    "title": "Backdoor Activation Attack: Attack Large Language Models using  Activation Steering for Safety-Alignment",
    "abstract": " Title: Backdoor Activation Attack: Attack Large Language Models using  Activation Steering for Safety-Alignment ",
    "url": "https://arxiv.org/abs/2311.09433",
    "authors": [
      "Haoran Wang",
      "Kai Shu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.10642",
    "title": "Rethinking Attention: Exploring Shallow Feed-Forward Neural Networks as  an Alternative to Attention Layers in Transformers",
    "abstract": " Comments: Accepted at AAAI24(this https URL) ",
    "url": "https://arxiv.org/abs/2311.10642",
    "authors": [
      "Vukasin Bozic",
      "Danilo Dordevic",
      "Daniele Coppola",
      "Joseph Thommes",
      "Sidak Pal Singh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.10754",
    "title": "A Recent Survey of the Advancements in Deep Learning Techniques for  Monkeypox Disease Detection",
    "abstract": " Comments: 53 pages, 16 figures, 7 tables ",
    "url": "https://arxiv.org/abs/2311.10754",
    "authors": [
      "Saddam Hussain Khan",
      "Rashid Iqbal",
      "Saeeda Naz"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.11995",
    "title": "BrainWash: A Poisoning Attack to Forget in Continual Learning",
    "abstract": " Title: BrainWash: A Poisoning Attack to Forget in Continual Learning ",
    "url": "https://arxiv.org/abs/2311.11995",
    "authors": [
      "Ali Abbasi",
      "Parsa Nooralinejad",
      "Hamed Pirsiavash",
      "Soheil Kolouri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.12024",
    "title": "PF-LRM: Pose-Free Large Reconstruction Model for Joint Pose and Shape  Prediction",
    "abstract": " Comments: Project website: this https URL ; add more experiments ",
    "url": "https://arxiv.org/abs/2311.12024",
    "authors": [
      "Peng Wang",
      "Hao Tan",
      "Sai Bi",
      "Yinghao Xu",
      "Fujun Luan",
      "Kalyan Sunkavalli",
      "Wenping Wang",
      "Zexiang Xu",
      "Kai Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.12255",
    "title": "Exploring Time Granularity on Temporal Graphs for Dynamic Link  Prediction in Real-world Networks",
    "abstract": " Comments: Presented at the Temporal Graph Learning Workshop @ NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2311.12255",
    "authors": [
      "Xiangjian Jiang",
      "Yanyi Pu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2311.12401",
    "title": "CASR: Refining Action Segmentation via Magrinalizing Frame-levle Causal  Relationships",
    "abstract": " Title: CASR: Refining Action Segmentation via Magrinalizing Frame-levle Causal  Relationships ",
    "url": "https://arxiv.org/abs/2311.12401",
    "authors": [
      "Keqing Du",
      "Xinyu Yang",
      "Hang Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2311.12651",
    "title": "Mobile-Seed: Joint Semantic Segmentation and Boundary Detection for  Mobile Robots",
    "abstract": " Comments: 8 pages, IEEE conference/letter underreview. Code and additional results are available at: this https URL ",
    "url": "https://arxiv.org/abs/2311.12651",
    "authors": [
      "Youqi Liao",
      "Shuhao Kang",
      "Jianping Li",
      "Yang Liu",
      "Yun Liu",
      "Zhen Dong",
      "Bisheng Yang",
      "Xieyuanli Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.12856",
    "title": "Density of States Prediction of Crystalline Materials via Prompt-guided  Multi-Modal Transformer",
    "abstract": " Comments: NeurIPS 2023. arXiv admin note: text overlap with arXiv:2303.07000 ",
    "url": "https://arxiv.org/abs/2311.12856",
    "authors": [
      "Namkyeong Lee",
      "Heewoong Noh",
      "Sungwon Kim",
      "Dongmin Hyun",
      "Gyoung S. Na",
      "Chanyoung Park"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.13559",
    "title": "Transfer Learning-based Real-time Handgun Detection",
    "abstract": " Comments: 16 pages, 9 figures, and 3 tables. Accepted at The Iraqi Journal of Science, issued by College of Science at University of Baghdad ",
    "url": "https://arxiv.org/abs/2311.13559",
    "authors": [
      "Youssef Elmir",
      "Sid Ahmed Laouar",
      "Larbi Hamdaoui"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  }
]