[
  {
    "id": "arXiv:2108.07903",
    "title": "Spatially and color consistent environment lighting estimation using  deep neural networks for mixed reality",
    "abstract": "The representation of consistent mixed reality (XR) environments requires adequate real and virtual illumination composition in real-time. Estimating the lighting of a real scenario is still a challenge. Due to the ill-posed nature of the problem, classical inverse-rendering techniques tackle the problem for simple lighting setups. However, those assumptions do not satisfy the current state-of-art in computer graphics and XR applications. While many recent works solve the problem using machine learning techniques to estimate the environment light and scene's materials, most of them are limited to geometry or previous knowledge. This paper presents a CNN-based model to estimate complex lighting for mixed reality environments with no previous information about the scene. We model the environment illumination using a set of spherical harmonics (SH) environment lighting, capable of efficiently represent area lighting. We propose a new CNN architecture that inputs an RGB image and recognizes, in real-time, the environment lighting. Unlike previous CNN-based lighting estimation methods, we propose using a highly optimized deep neural network architecture, with a reduced number of parameters, that can learn high complex lighting scenarios from real-world high-dynamic-range (HDR) environment images. We show in the experiments that the CNN architecture can predict the environment lighting with an average mean squared error (MSE) of \\num{7.85e-04} when comparing SH lighting coefficients. We validate our model in a variety of mixed reality scenarios. Furthermore, we present qualitative results comparing relights of real-world scenes. ",
    "url": "https://arxiv.org/abs/2108.07903",
    "authors": [
      "Bruno Augusto Dorta Marques",
      "Esteban Walter Gonzalez Clua",
      "Anselmo Antunes Montenegro",
      "Cristina Nader Vasconcelos"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2108.08106",
    "title": "Existence, uniqueness, and convergence rates for gradient flows in the  training of artificial neural networks with ReLU activation",
    "abstract": "The training of artificial neural networks (ANNs) with rectified linear unit (ReLU) activation via gradient descent (GD) type optimization schemes is nowadays a common industrially relevant procedure. Till this day in the scientific literature there is in general no mathematical convergence analysis which explains the numerical success of GD type optimization schemes in the training of ANNs with ReLU activation. GD type optimization schemes can be regarded as temporal discretization methods for the gradient flow (GF) differential equations associated to the considered optimization problem and, in view of this, it seems to be a natural direction of research to first aim to develop a mathematical convergence theory for time-continuous GF differential equations and, thereafter, to aim to extend such a time-continuous convergence theory to implementable time-discrete GD type optimization methods. In this article we establish two basic results for GF differential equations in the training of fully-connected feedforward ANNs with one hidden layer and ReLU activation. In the first main result of this article we establish in the training of such ANNs under the assumption that the probability distribution of the input data of the considered supervised learning problem is absolutely continuous with a bounded density function that every GF differential equation admits for every initial value a solution which is also unique among a suitable class of solutions. In the second main result of this article we prove in the training of such ANNs under the assumption that the target function and the density function of the probability distribution of the input data are piecewise polynomial that every non-divergent GF trajectory converges with an appropriate rate of convergence to a critical point and that the risk of the non-divergent GF trajectory converges with rate 1 to the risk of the critical point. ",
    "url": "https://arxiv.org/abs/2108.08106",
    "authors": [
      "Simon Eberle",
      "Arnulf Jentzen",
      "Adrian Riekert",
      "Georg S. Weiss"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2108.08273",
    "title": "User configurable 3D object regeneration for spatial privacy",
    "abstract": "Environmental understanding capability of $\\textit{augmented}$ (AR) and $\\textit{mixed reality}$ (MR) devices are continuously improving through advances in sensing, computer vision, and machine learning. Various AR/MR applications demonstrate such capabilities i.e. scanning a space using a handheld or head mounted device and capturing a digital representation of the space that are accurate copies of the real space. However, these capabilities impose privacy risks to users: personally identifiable information can leak from captured 3D maps of the sensitive spaces and/or captured sensitive objects within the mapped space. Thus, in this work, we demonstrate how we can leverage 3D object regeneration for preserving privacy of 3D point clouds. That is, we employ an intermediary layer of protection to transform the 3D point cloud before providing it to the third-party applications. Specifically, we use an existing adversarial autoencoder to generate copies of 3D objects where the likeness of the copies from the original can be varied. To test the viability and performance of this method as a privacy preserving mechanism, we use a 3D classifier to classify and identify these transformed point clouds i.e. perform $\\textit{super}$-class and $\\textit{intra}$-class classification. To measure the performance of the proposed privacy framework, we define privacy, $\\Pi\\in[0,1]$, and utility metrics, $Q\\in[0,1]$, which are desired to be maximized. Experimental evaluation shows that the privacy framework can indeed variably effect the privacy of a 3D object by varying the privilege level $l\\in[0,1]$ i.e. if a low $l<0.17$ is maintained, $\\Pi_1,\\Pi_2>0.4$ is ensured where $\\Pi_1,\\Pi_2$ are super- and intra-class privacy. Lastly, the privacy framework can ensure relatively high intra-class privacy and utility i.e. $\\Pi_2>0.63$ and $Q>0.70$, if the privilege level is kept within the range of $0.17<l<0.25$. ",
    "url": "https://arxiv.org/abs/2108.08273",
    "authors": [
      "Arpit Nama",
      "Amaya Dharmasiri",
      "Kanchana Thilakarathna",
      "Albert Zomaya",
      "Jaybie Agullo de Guzman"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2108.07893",
    "title": "Failure of the simultaneous block diagonalization technique applied to  complete and cluster synchronization of random networks",
    "abstract": "We discuss here the application of the algebraic techniques for the simultaneous block diagonalization (SBD) of matrices to the study of the stability of both complete and cluster synchronization in random (generic) networks. For both problems, we see that the extent of the dimensionality reduction achievable is the same as that produced by application of a trivial transformation. ",
    "url": "https://arxiv.org/abs/2108.07893",
    "authors": [
      "Shirin Panahi",
      "Nelson Amaya",
      "Isaac Klickstein",
      "Galen Novello",
      "Francesco Sorrentino"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2108.07942",
    "title": "Algorithmic techniques for finding resistance distances on structured  graphs",
    "abstract": "In this paper we give a survey of methods used to calculate values of resistance distance (also known as effective resistance) in graphs. Resistance distance has played a prominent role not only in circuit theory and chemistry, but also in combinatorial matrix theory and spectral graph theory. Moreover resistance distance has applications ranging from quantifying biological structures, distributed control systems, network analysis, and power grid systems. In this paper we discuss both exact techniques and approximate techniques and for each method discussed we provide an illustrative example of the technique. We also present some open questions and conjectures. ",
    "url": "https://arxiv.org/abs/2108.07942",
    "authors": [
      "E. J. Evans",
      "A. E. Francis"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2108.07977",
    "title": "Classification and reconstruction of spatially overlapping phase images  using diffractive optical networks",
    "abstract": "Diffractive optical networks unify wave optics and deep learning to all-optically compute a given machine learning or computational imaging task as the light propagates from the input to the output plane. Here, we report the design of diffractive optical networks for the classification and reconstruction of spatially overlapping, phase-encoded objects. When two different phase-only objects spatially overlap, the individual object functions are perturbed since their phase patterns are summed up. The retrieval of the underlying phase images from solely the overlapping phase distribution presents a challenging problem, the solution of which is generally not unique. We show that through a task-specific training process, passive diffractive networks composed of successive transmissive layers can all-optically and simultaneously classify two different randomly-selected, spatially overlapping phase images at the input. After trained with ~550 million unique combinations of phase-encoded handwritten digits from the MNIST dataset, our blind testing results reveal that the diffractive network achieves an accuracy of >85.8% for all-optical classification of two overlapping phase images of new handwritten digits. In addition to all-optical classification of overlapping phase objects, we also demonstrate the reconstruction of these phase images based on a shallow electronic neural network that uses the highly compressed output of the diffractive network as its input (with e.g., ~20-65 times less number of pixels) to rapidly reconstruct both of the phase images, despite their spatial overlap and related phase ambiguity. The presented phase image classification and reconstruction framework might find applications in e.g., computational imaging, microscopy and quantitative phase imaging fields. ",
    "url": "https://arxiv.org/abs/2108.07977",
    "authors": [
      "Deniz Mengu",
      "Muhammed Veli",
      "Yair Rivenson",
      "Aydogan Ozcan"
    ],
    "subjectives": [
      "Optics (physics.optics)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Applied Physics (physics.app-ph)"
    ]
  },
  {
    "id": "arXiv:1904.11665",
    "title": "Rapid evaluation of the spectral signal detection threshold and  Stieltjes transform",
    "abstract": " Title: Rapid evaluation of the spectral signal detection threshold and  Stieltjes transform ",
    "url": "https://arxiv.org/abs/1904.11665",
    "authors": [
      "William Leeb"
    ],
    "subjectives": [
      "Computation (stat.CO)",
      "Numerical Analysis (math.NA)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2007.02713",
    "title": "Bifurcated backbone strategy for RGB-D salient object detection",
    "abstract": " Comments: A preliminary version of this work has been accepted in ECCV 2020 ",
    "url": "https://arxiv.org/abs/2007.02713",
    "authors": [
      "Yingjie Zhai",
      "Deng-Ping Fan",
      "Jufeng Yang",
      "Ali Borji",
      "Ling Shao",
      "Junwei Han",
      "Liang Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2103.07413",
    "title": "The general aspects of noise in analogue hardware deep neural networks",
    "abstract": " Title: The general aspects of noise in analogue hardware deep neural networks ",
    "url": "https://arxiv.org/abs/2103.07413",
    "authors": [
      "Nadezhda Semenova",
      "Laurent Larger",
      "Daniel Brunner"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2103.13870",
    "title": "A novel weighted approach for time series forecasting based on  visibility graph",
    "abstract": " Title: A novel weighted approach for time series forecasting based on  visibility graph ",
    "url": "https://arxiv.org/abs/2103.13870",
    "authors": [
      "Tianxiang Zhan",
      "Fuyuan Xiao"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2106.00647",
    "title": "Mapping the NFT revolution: market trends, trade networks and visual  features",
    "abstract": " Comments: Working paper, comments welcome ",
    "url": "https://arxiv.org/abs/2106.00647",
    "authors": [
      "Matthieu Nadini",
      "Laura Alessandretti",
      "Flavio Di Giacinto",
      "Mauro Martino",
      "Luca Maria Aiello",
      "Andrea Baronchelli"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Computers and Society (cs.CY)",
      "Physics and Society (physics.soc-ph)"
    ]
  }
]