[
  {
    "id": "arXiv:2107.11460",
    "title": "Non-intrusive reduced order modeling of natural convection in porous  media using convolutional autoencoders: comparison with linear subspace  techniques",
    "abstract": "Natural convection in porous media is a highly nonlinear multiphysical problem relevant to many engineering applications (e.g., the process of $\\mathrm{CO_2}$ sequestration). Here, we present a non-intrusive reduced order model of natural convection in porous media employing deep convolutional autoencoders for the compression and reconstruction and either radial basis function (RBF) interpolation or artificial neural networks (ANNs) for mapping parameters of partial differential equations (PDEs) on the corresponding nonlinear manifolds. To benchmark our approach, we also describe linear compression and reconstruction processes relying on proper orthogonal decomposition (POD) and ANNs. We present comprehensive comparisons among different models through three benchmark problems. The reduced order models, linear and nonlinear approaches, are much faster than the finite element model, obtaining a maximum speed-up of $7 \\times 10^{6}$ because our framework is not bound by the Courant-Friedrichs-Lewy condition; hence, it could deliver quantities of interest at any given time contrary to the finite element model. Our model's accuracy still lies within a mean squared error of 0.07 (two-order of magnitude lower than the maximum value of the finite element results) in the worst-case scenario. We illustrate that, in specific settings, the nonlinear approach outperforms its linear counterpart and vice versa. We hypothesize that a visual comparison between principal component analysis (PCA) or t-Distributed Stochastic Neighbor Embedding (t-SNE) could indicate which method will perform better prior to employing any specific compression strategy. ",
    "url": "https://arxiv.org/abs/2107.11460",
    "authors": [
      "T. Kadeethum",
      "F. Ballarin",
      "Y. Cho",
      "D. O'Malley",
      "H. Yoon",
      "N. Bouklas"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2107.11496",
    "title": "Training multi-objective/multi-task collocation physics-informed neural  network with student/teachers transfer learnings",
    "abstract": "This paper presents a PINN training framework that employs (1) pre-training steps that accelerates and improve the robustness of the training of physics-informed neural network with auxiliary data stored in point clouds, (2) a net-to-net knowledge transfer algorithm that improves the weight initialization of the neural network and (3) a multi-objective optimization algorithm that may improve the performance of a physical-informed neural network with competing constraints. We consider the training and transfer and multi-task learning of physics-informed neural network (PINN) as multi-objective problems where the physics constraints such as the governing equation, boundary conditions, thermodynamic inequality, symmetry, and invariant properties, as well as point cloud used for pre-training can sometimes lead to conflicts and necessitating the seek of the Pareto optimal solution. In these situations, weighted norms commonly used to handle multiple constraints may lead to poor performance, while other multi-objective algorithms may scale poorly with increasing dimensionality. To overcome this technical barrier, we adopt the concept of vectorized objective function and modify a gradient descent approach to handle the issue of conflicting gradients. Numerical experiments are compared the benchmark boundary value problems solved via PINN. The performance of the proposed paradigm is compared against the classical equal-weighted norm approach. Our numerical experiments indicate that the brittleness and lack of robustness demonstrated in some PINN implementations can be overcome with the proposed strategy. ",
    "url": "https://arxiv.org/abs/2107.11496",
    "authors": [
      "Bahador Bahmani",
      "WaiChing Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.11818",
    "title": "Bangla sign language recognition using concatenated BdSL network",
    "abstract": "Sign language is the only medium of communication for the hearing impaired and the deaf and dumb community. Communication with the general mass is thus always a challenge for this minority group. Especially in Bangla sign language (BdSL), there are 38 alphabets with some having nearly identical symbols. As a result, in BdSL recognition, the posture of hand is an important factor in addition to visual features extracted from traditional Convolutional Neural Network (CNN). In this paper, a novel architecture \"Concatenated BdSL Network\" is proposed which consists of a CNN based image network and a pose estimation network. While the image network gets the visual features, the relative positions of hand keypoints are taken by the pose estimation network to obtain the additional features to deal with the complexity of the BdSL symbols. A score of 91.51% was achieved by this novel approach in test set and the effectiveness of the additional pose estimation network is suggested by the experimental results. ",
    "url": "https://arxiv.org/abs/2107.11818",
    "authors": [
      "Thasin Abedin",
      "Khondokar S. S. Prottoy",
      "Ayana Moshruba",
      "Safayat Bin Hakim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.11862",
    "title": "Decision-forest voting scheme for classification of rare classes in  network intrusion detection",
    "abstract": "In this paper, Bayesian based aggregation of decision trees in an ensemble (decision forest) is investigated. The focus is laid on multi-class classification with number of samples significantly skewed toward one of the classes. The algorithm leverages out-of-bag datasets to estimate prediction errors of individual trees, which are then used in accordance with the Bayes rule to refine the decision of the ensemble. The algorithm takes prevalence of individual classes into account and does not require setting of any additional parameters related to class weights or decision-score thresholds. Evaluation is based on publicly available datasets as well as on an proprietary dataset comprising network traffic telemetry from hundreds of enterprise networks with over a million of users overall. The aim is to increase the detection capabilities of an operating malware detection system. While we were able to keep precision of the system higher than 94\\%, that is only 6 out of 100 detections shown to the network administrator are false alarms, we were able to achieve increase of approximately 7\\% in the number of detections. The algorithm effectively handles large amounts of data, and can be used in conjunction with most of the state-of-the-art algorithms used to train decision forests. ",
    "url": "https://arxiv.org/abs/2107.11862",
    "authors": [
      "Jan Brabec",
      "Lukas Machlica"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.11892",
    "title": "A brief note on understanding neural networks as Gaussian processes",
    "abstract": "As a generalization of the work in [Lee et al., 2017], this note briefly discusses when the prior of a neural network output follows a Gaussian process, and how a neural-network-induced Gaussian process is formulated. The posterior mean functions of such a Gaussian process regression lie in the reproducing kernel Hilbert space defined by the neural-network-induced kernel. In the case of two-layer neural networks, the induced Gaussian processes provide an interpretation of the reproducing kernel Hilbert spaces whose union forms a Barron space. ",
    "url": "https://arxiv.org/abs/2107.11892",
    "authors": [
      "Mengwu Guo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.12146",
    "title": "Physics-informed graph neural Galerkin networks: A unified framework for  solving PDE-governed forward and inverse problems",
    "abstract": "Despite the great promise of the physics-informed neural networks (PINNs) in solving forward and inverse problems, several technical challenges are present as roadblocks for more complex and realistic applications. First, most existing PINNs are based on point-wise formulation with fully-connected networks to learn continuous functions, which suffer from poor scalability and hard boundary enforcement. Second, the infinite search space over-complicates the non-convex optimization for network training. Third, although the convolutional neural network (CNN)-based discrete learning can significantly improve training efficiency, CNNs struggle to handle irregular geometries with unstructured meshes. To properly address these challenges, we present a novel discrete PINN framework based on graph convolutional network (GCN) and variational structure of PDE to solve forward and inverse partial differential equations (PDEs) in a unified manner. The use of a piecewise polynomial basis can reduce the dimension of search space and facilitate training and convergence. Without the need of tuning penalty parameters in classic PINNs, the proposed method can strictly impose boundary conditions and assimilate sparse data in both forward and inverse settings. The flexibility of GCNs is leveraged for irregular geometries with unstructured meshes. The effectiveness and merit of the proposed method are demonstrated over a variety of forward and inverse computational mechanics problems governed by both linear and nonlinear PDEs. ",
    "url": "https://arxiv.org/abs/2107.12146",
    "authors": [
      "Han Gao",
      "Matthew J. Zahr",
      "Jian-Xun Wang"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2107.12165",
    "title": "Utilizing synchronization to partition power networks into microgrids",
    "abstract": "The problem of partitioning a power grid into a set of microgrids, or islands, is of interest for both the design of future smart grids, and as a last resort to restore power dispatchment in sections of a grid affected by an extreme failure. In the literature this problem is usually solved by turning it into a combinatorial optimization problem, often solved through generic heruristic methods such as Genetic Algorithms or Tabu Search. In this paper, we take a different route and obtain the grid partition by exploiting the synchronization dynamics of a cyberlayer of Kuramoto oscillators, each parameterized as a rough approximation of the dynamics of the grid's node it corresponds to. We present first a centralised algorithm and then a decentralised strategy. In the former, nodes are aggregated based on their internode synchronization times while in the latter they exploit synchronization of the oscillators in the cyber layer to selforganise into islands. Our preliminary results show that the heuristic synchronization based algorithms do converge towards partitions that are comparable to those obtained via other more cumbersome and computationally expensive optimization-based methods. ",
    "url": "https://arxiv.org/abs/2107.12165",
    "authors": [
      "Ricardo Cardona-Rivera",
      "Francesco Lo Iudice",
      "Antonio Grotta",
      "Marco Coraggio",
      "Mario di Bernardo"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2107.12172",
    "title": "Studying the anonymity trilemma with a discrete-event mix network  simulator",
    "abstract": "In this work, we present a discrete event mix network simulator, which allows analysing how anonymity, latency, and bandwidth overhead are affected by various scenarios of deployment and design choices. These design choices include network topology, mixing technique, volume of traffic, latency requirements, packet size or use of cover traffic. To the best of our knowledge, this is the first such simulator as work on it began in 2017 to analyze the Loopix mix network, and the code of our simulator is available under an open-source license. To demonstrate the capabilities of our simulator, we perform an empirical analysis of the impact of core design choices on anonymity, scalability and latency in Elixxir, HOPR and Nym, currently deployed mix network infrastructures that make a variety of different choices in their design. ",
    "url": "https://arxiv.org/abs/2107.12172",
    "authors": [
      "Ania M. Piotrowska"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2107.12198",
    "title": "Computational graphs for matrix functions",
    "abstract": "Many numerical methods for evaluating matrix functions can be naturally viewed as computational graphs. Rephrasing these methods as directed acyclic graphs (DAGs) is a particularly effective way to study existing techniques, improve them, and eventually derive new ones. As the accuracy of these matrix techniques is determined by the accuracy of their scalar counterparts, the design of algorithms for matrix functions can be viewed as a scalar-valued optimization problem. The derivatives needed during the optimization can be calculated automatically by exploiting the structure of the DAG, in a fashion akin to backpropagation. The Julia package GraphMatFun.jl offers the tools to generate and manipulate computational graphs, to optimize their coefficients, and to generate Julia, MATLAB, and C code to evaluate them efficiently. The software also provides the means to estimate the accuracy of an algorithm and thus obtain numerically reliable methods. For the matrix exponential, for example, using a particular form (degree-optimal) of polynomials produces algorithms that are cheaper, in terms of computational cost, than the Pad\\'e-based techniques typically used in mathematical software. The optimized graphs and the corresponding generated code are available online. ",
    "url": "https://arxiv.org/abs/2107.12198",
    "authors": [
      "Elias Jarlebring",
      "Massimiliano Fasi",
      "Emil Ringh"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2107.12224",
    "title": "Local2Global: Scaling global representation learning on graphs via local  training",
    "abstract": "We propose a decentralised \"local2global\" approach to graph representation learning, that one can a-priori use to scale any embedding technique. Our local2global approach proceeds by first dividing the input graph into overlapping subgraphs (or \"patches\") and training local representations for each patch independently. In a second step, we combine the local representations into a globally consistent representation by estimating the set of rigid motions that best align the local representations using information from the patch overlaps, via group synchronization. A key distinguishing feature of local2global relative to existing work is that patches are trained independently without the need for the often costly parameter synchronisation during distributed training. This allows local2global to scale to large-scale industrial applications, where the input graph may not even fit into memory and may be stored in a distributed manner. Preliminary results on medium-scale data sets (up to $\\sim$7K nodes and $\\sim$200K edges) are promising, with a graph reconstruction performance for local2global that is comparable to that of globally trained embeddings. A thorough evaluation of local2global on large scale data and applications to downstream tasks, such as node classification and link prediction, constitutes ongoing work. ",
    "url": "https://arxiv.org/abs/2107.12224",
    "authors": [
      "Lucas G. S. Jeub",
      "Giovanni Colavizza",
      "Xiaowen Dong",
      "Marya Bazzi",
      "Mihai Cucuringu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.12235",
    "title": "Living in a pandemic: adaptation of individual mobility and social  activity in the US",
    "abstract": "The non-pharmaceutical interventions (NPIs), aimed at reducing the diffusion of the COVID-19 pandemic, has dramatically influenced our behaviour in everyday life. In this work, we study how individuals adapted their daily movements and person-to-person contact patterns over time in response to the COVID-19 pandemic and the NPIs. We leverage longitudinal GPS mobility data of hundreds of thousands of anonymous individuals in four US states and empirically show the dramatic disruption in people's life. We find that local interventions did not just impact the number of visits to different venues but also how people experience them. Individuals spend less time in venues, preferring simpler and more predictable routines and reducing person-to-person contact activities. Moreover, we show that the stringency of interventions alone does explain the number and duration of visits to venues: individual patterns of visits seem to be influenced by the local severity of the pandemic and a risk adaptation factor, which increases the people's mobility regardless of the stringency of interventions. ",
    "url": "https://arxiv.org/abs/2107.12235",
    "authors": [
      "Lorenzo Lucchini",
      "Simone Centellegher",
      "Luca Pappalardo",
      "Riccardo Gallotti",
      "Filippo Privitera",
      "Bruno Lepri",
      "Marco De Nadai"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2107.12248",
    "title": "Are Bayesian neural networks intrinsically good at out-of-distribution  detection?",
    "abstract": "The need to avoid confident predictions on unfamiliar data has sparked interest in out-of-distribution (OOD) detection. It is widely assumed that Bayesian neural networks (BNN) are well suited for this task, as the endowed epistemic uncertainty should lead to disagreement in predictions on outliers. In this paper, we question this assumption and provide empirical evidence that proper Bayesian inference with common neural network architectures does not necessarily lead to good OOD detection. To circumvent the use of approximate inference, we start by studying the infinite-width case, where Bayesian inference can be exact considering the corresponding Gaussian process. Strikingly, the kernels induced under common architectural choices lead to uncertainties that do not reflect the underlying data generating process and are therefore unsuited for OOD detection. Finally, we study finite-width networks using HMC, and observe OOD behavior that is consistent with the infinite-width case. Overall, our study discloses fundamental problems when naively using BNNs for OOD detection and opens interesting avenues for future research. ",
    "url": "https://arxiv.org/abs/2107.12248",
    "authors": [
      "Christian Henning",
      "Francesco D'Angelo",
      "Benjamin F. Grewe"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.12325",
    "title": "From Implicit to Explicit feedback: A deep neural network for modeling  sequential behaviours and long-short term preferences of online users",
    "abstract": "In this work, we examine the advantages of using multiple types of behaviour in recommendation systems. Intuitively, each user has to do some implicit actions (e.g., click) before making an explicit decision (e.g., purchase). Previous studies showed that implicit and explicit feedback have different roles for a useful recommendation. However, these studies either exploit implicit and explicit behaviour separately or ignore the semantic of sequential interactions between users and items. In addition, we go from the hypothesis that a user's preference at a time is a combination of long-term and short-term interests. In this paper, we propose some Deep Learning architectures. The first one is Implicit to Explicit (ITE), to exploit users' interests through the sequence of their actions. And two versions of ITE with Bidirectional Encoder Representations from Transformers based (BERT-based) architecture called BERT-ITE and BERT-ITE-Si, which combine users' long- and short-term preferences without and with side information to enhance user representation. The experimental results show that our models outperform previous state-of-the-art ones and also demonstrate our views on the effectiveness of exploiting the implicit to explicit order as well as combining long- and short-term preferences in two large-scale datasets. ",
    "url": "https://arxiv.org/abs/2107.12325",
    "authors": [
      "Quyen Tran",
      "Lam Tran",
      "Linh Chu Hai",
      "Linh Ngo Van",
      "Khoat Than"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.11403",
    "title": "A principled (and practical) test for network comparison",
    "abstract": "How might one test the hypothesis that graphs were sampled from the same distribution? Here, we compare two statistical tests that address this question. The first uses the observed subgraph densities themselves as estimates of those of the underlying distribution. The second test uses a new approach that converts these subgraph densities into estimates of the graph cumulants of the distribution. We demonstrate -- via theory, simulation, and application to real data -- the superior statistical power of using graph cumulants. ",
    "url": "https://arxiv.org/abs/2107.11403",
    "authors": [
      "Gecia Bravo Hermsdorff",
      "Lee M. Gunderson",
      "Pierre-André Maugis",
      "Carey E. Priebe"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Discrete Mathematics (cs.DM)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2107.11785",
    "title": "Sensitivity and robustness analysis in Bayesian networks with the  bnmonitor R package",
    "abstract": "Bayesian networks are a class of models that are widely used for risk assessment of complex operational systems. There are now multiple approaches, as well as implemented software, that guide their construction via data learning or expert elicitation. However, a constructed Bayesian network needs to be validated before it can be used for practical risk assessment. Here, we illustrate the usage of the bnmonitor R package: the first comprehensive software for the validation of a Bayesian network. An applied data analysis using bnmonitor is carried out over a medical dataset to illustrate the use of its wide array of functions. ",
    "url": "https://arxiv.org/abs/2107.11785",
    "authors": [
      "Manuele Leonelli",
      "Ramsiya Ramanathan",
      "Rachel L. Wilkerson"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.12243",
    "title": "Protein-RNA interaction prediction with deep learning: Structure matters",
    "abstract": "Protein-RNA interactions are of vital importance to a variety of cellular activities. Both experimental and computational techniques have been developed to study the interactions. Due to the limitation of the previous database, especially the lack of protein structure data, most of the existing computational methods rely heavily on the sequence data, with only a small portion of the methods utilizing the structural information. Recently, AlphaFold has revolutionized the entire protein and biology field. Foreseeably, the protein-RNA interaction prediction will also be promoted significantly in the upcoming years. In this work, we give a thorough review of this field, surveying both the binding site and binding preference prediction problems and covering the commonly used datasets, features, and models. We also point out the potential challenges and opportunities in this field. This survey summarizes the development of the RBP-RNA interaction field in the past and foresees its future development in the post-AlphaFold era. ",
    "url": "https://arxiv.org/abs/2107.12243",
    "authors": [
      "Junkang Wei",
      "Siyuan Chen",
      "Licheng Zong",
      "Xin Gao",
      "Yu Li"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2107.12321",
    "title": "MAG-Net: Mutli-task attention guided network for brain tumor  segmentation and classification",
    "abstract": "Brain tumor is the most common and deadliest disease that can be found in all age groups. Generally, MRI modality is adopted for identifying and diagnosing tumors by the radiologists. The correct identification of tumor regions and its type can aid to diagnose tumors with the followup treatment plans. However, for any radiologist analysing such scans is a complex and time-consuming task. Motivated by the deep learning based computer-aided-diagnosis systems, this paper proposes multi-task attention guided encoder-decoder network (MAG-Net) to classify and segment the brain tumor regions using MRI images. The MAG-Net is trained and evaluated on the Figshare dataset that includes coronal, axial, and sagittal views with 3 types of tumors meningioma, glioma, and pituitary tumor. With exhaustive experimental trials the model achieved promising results as compared to existing state-of-the-art models, while having least number of training parameters among other state-of-the-art models. ",
    "url": "https://arxiv.org/abs/2107.12321",
    "authors": [
      "Sachin Gupta",
      "Narinder Singh Punn",
      "Sanjay Kumar Sonbhadra",
      "Sonali Agarwal"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:1710.07365",
    "title": "An extension of the Moran process using type-specific connection graphs",
    "abstract": " Title: An extension of the Moran process using type-specific connection graphs ",
    "url": "https://arxiv.org/abs/1710.07365",
    "authors": [
      "Themistoklis Melissourgos",
      "Sotiris Nikoletseas",
      "Christoforos Raptopoulos",
      "Paul Spirakis"
    ],
    "subjectives": [
      "Populations and Evolution (q-bio.PE)",
      "Discrete Mathematics (cs.DM)",
      "Computer Science and Game Theory (cs.GT)",
      "Social and Information Networks (cs.SI)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2003.12618",
    "title": "Image compression optimized for 3D reconstruction by utilizing deep  neural networks",
    "abstract": " Title: Image compression optimized for 3D reconstruction by utilizing deep  neural networks ",
    "url": "https://arxiv.org/abs/2003.12618",
    "authors": [
      "Alex Golts",
      "Yoav Y. Schechner"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2005.10058",
    "title": "On embedding Lambek calculus into commutative categorial grammars",
    "abstract": " Comments: Much better presentation in the new version. Added pictures and examples, simplified proofs, improved notation and terminology, computational part reduced almost to zero ",
    "url": "https://arxiv.org/abs/2005.10058",
    "authors": [
      "Sergey Slavnov"
    ],
    "subjectives": [
      "Logic (math.LO)",
      "Computation and Language (cs.CL)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2006.07356",
    "title": "Implicit bias of gradient descent for mean squared error regression with  wide neural networks",
    "abstract": " Comments: 86 pages, 14 figures. Added the analysis of multivariate regression ",
    "url": "https://arxiv.org/abs/2006.07356",
    "authors": [
      "Hui Jin",
      "Guido Montúfar"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2007.03492",
    "title": "Computing a maximum clique in geometric superclasses of disk graphs",
    "abstract": " Title: Computing a maximum clique in geometric superclasses of disk graphs ",
    "url": "https://arxiv.org/abs/2007.03492",
    "authors": [
      "Nicolas Grelier"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2007.03983",
    "title": "Dynamic social learning under graph constraints",
    "abstract": " Title: Dynamic social learning under graph constraints ",
    "url": "https://arxiv.org/abs/2007.03983",
    "authors": [
      "Konstantin Avrachenkov",
      "Vivek S. Borkar",
      "Sharayu Moharir",
      "Suhail M. Shah"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2009.03575",
    "title": "NC-MOPSO: Network centrality guided multi-objective particle swarm  optimization for transport optimization on networks",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2009.03575",
    "authors": [
      "Jiexin Wu",
      "Cunlai Pu",
      "Shuxin Ding",
      "Guo Cao",
      "Panos M. Pardalos"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2009.10588",
    "title": "Anomalous diffusion dynamics of learning in deep neural networks",
    "abstract": " Comments: 10 pages, 8 figures, a new angle to unravel the learning dynamics of SGD in DNNs ",
    "url": "https://arxiv.org/abs/2009.10588",
    "authors": [
      "Guozhang Chen",
      "Cheng Kevin Qu",
      "Pulin Gong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2011.02600",
    "title": "Upwind summation by parts finite difference methods for large scale  elastic wave simulations in 3D complex geometries",
    "abstract": " Title: Upwind summation by parts finite difference methods for large scale  elastic wave simulations in 3D complex geometries ",
    "url": "https://arxiv.org/abs/2011.02600",
    "authors": [
      "Kenneth Duru",
      "Frederick Fung",
      "Christopher Williams"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Geophysics (physics.geo-ph)"
    ]
  },
  {
    "id": "arXiv:2012.00280",
    "title": "A robust and scalable unfitted adaptive finite element framework for  nonlinear solid mechanics",
    "abstract": " Title: A robust and scalable unfitted adaptive finite element framework for  nonlinear solid mechanics ",
    "url": "https://arxiv.org/abs/2012.00280",
    "authors": [
      "Santiago Badia",
      "Manuel Caicedo",
      "Alberto F. Martín",
      "Javier Principe"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Mathematical Software (cs.MS)"
    ]
  },
  {
    "id": "arXiv:2102.06984",
    "title": "Learning low-rank latent mesoscale structures in networks",
    "abstract": " Comments: 55 pages, 14 figures, 1 table ",
    "url": "https://arxiv.org/abs/2102.06984",
    "authors": [
      "Hanbaek Lyu",
      "Yacoub H. Kureh",
      "Joshua Vendrow",
      "Mason A. Porter"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Physics and Society (physics.soc-ph)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2103.13550",
    "title": "Term-community-based topic detection with variable resolution",
    "abstract": " Comments: 31 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2103.13550",
    "authors": [
      "Andreas Hamm",
      "Simon Odrowski"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2103.14224",
    "title": "Active multi-fidelity Bayesian online changepoint detection",
    "abstract": " Comments: 37th Conference on Uncertainty in Artificial Intelligence ",
    "url": "https://arxiv.org/abs/2103.14224",
    "authors": [
      "Gregory W. Gundersen",
      "Diana Cai",
      "Chuteng Zhou",
      "Barbara E. Engelhardt",
      "Ryan P. Adams"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.17107",
    "title": "Facial expression and attributes recognition based on multi-task  learning of lightweight neural networks",
    "abstract": " Comments: 14 pages, 3 figures, accepted at IEEE SISY 2021 ",
    "url": "https://arxiv.org/abs/2103.17107",
    "authors": [
      "Andrey V. Savchenko"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.07176",
    "title": "The Laplace Mechanism has optimal utility for differential privacy over  continuous queries",
    "abstract": " Title: The Laplace Mechanism has optimal utility for differential privacy over  continuous queries ",
    "url": "https://arxiv.org/abs/2105.07176",
    "authors": [
      "Natasha Fernandes",
      "Annabelle McIver",
      "Carroll Morgan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2106.00757",
    "title": "Neural message passing for joint paratope-epitope prediction",
    "abstract": " Comments: ICML Workshop on Computational Biology 2021 , 5 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2106.00757",
    "authors": [
      "Alice Del Vecchio",
      "Andreea Deac",
      "Pietro Liò",
      "Petar Veličković"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2107.03383",
    "title": "Assessing putative bias in prediction of anti-microbial resistance from  real-world genotyping data under explicit causal assumptions",
    "abstract": " Comments: In DSHealth '21] Joint KDD 2021 Health Day and 2021 KDD Workshop on Applied Data Science for Healthcare, Aug 14--18, 2021, Virtual, 5 pages ",
    "url": "https://arxiv.org/abs/2107.03383",
    "authors": [
      "Mattia Prosperi",
      "Simone Marini",
      "Christina Boucher",
      "Jiang Bian"
    ],
    "subjectives": [
      "Genomics (q-bio.GN)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.07761",
    "title": "Exploiting generative self-supervised learning for the assessment of  biological images with lack of annotations: a COVID-19 case-study",
    "abstract": " Title: Exploiting generative self-supervised learning for the assessment of  biological images with lack of annotations: a COVID-19 case-study ",
    "url": "https://arxiv.org/abs/2107.07761",
    "authors": [
      "Alessio Mascolini",
      "Dario Cardamone",
      "Francesco Ponzio",
      "Santa Di Cataldo",
      "Elisa Ficarra"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]