[
  {
    "id": "arXiv:2308.15481",
    "title": "Online Job Failure Prediction in an HPC System",
    "abstract": "Modern High Performance Computing (HPC) systems are complex machines, with major impacts on economy and society. Along with their computational capability, their energy consumption is also steadily raising, representing a critical issue given the ongoing environmental and energetic crisis. Therefore, developing strategies to optimize HPC system management has paramount importance, both to guarantee top-tier performance and to improve energy efficiency. One strategy is to act at the workload level and highlight the jobs that are most likely to fail, prior to their execution on the system. Jobs failing during their execution unnecessarily occupy resources which could delay other jobs, adversely affecting the system performance and energy consumption. In this paper, we study job failure prediction at submit-time using classical machine learning algorithms. Our novelty lies in (i) the combination of these algorithms with Natural Language Processing (NLP) tools to represent jobs and (ii) the design of the approach to work in an online fashion in a real system. The study is based on a dataset extracted from a production machine hosted at the HPC centre CINECA in Italy. Experimental results show that our approach is promising. ",
    "url": "https://arxiv.org/abs/2308.15481",
    "authors": [
      "Francesco Antici",
      "Andrea Borghesi",
      "Zeynep Kiziltan"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15494",
    "title": "Parallel Unconstrained Local Search for Partitioning Irregular Graphs",
    "abstract": "We present new refinement heuristics for the balanced graph partitioning problem that break with an age-old rule. Traditionally, local search only permits moves that keep the block sizes balanced (below a size constraint). In this work, we demonstrate that admitting large temporary balance violations drastically improves solution quality. The effects are particularly strong on irregular instances such as social networks. Designing efficient implementations of this general idea involves both careful selection of candidates for unconstrained moves as well as algorithms for rebalancing the solution later on. We explore a wide array of design choices to achieve this, in addition to our third goal of high parallel scalability. We present compelling experimental results, demonstrating that our parallel unconstrained local search techniques outperform the prior state of the art by a substantial margin. Compared with four state-of-the-art solvers, our new technique finds 91% of the best solutions on irregular graphs. We achieve a 13.8% improvement in edge cut over the next best competitor, while being only 11.4% slower in the geometric mean. ",
    "url": "https://arxiv.org/abs/2308.15494",
    "authors": [
      "Nikolai Maas",
      "Lars Gottesbüren",
      "Daniel Seemaier"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2308.15499",
    "title": "Classification robustness to common optical aberrations",
    "abstract": "Computer vision using deep neural networks (DNNs) has brought about seminal changes in people's lives. Applications range from automotive, face recognition in the security industry, to industrial process monitoring. In some cases, DNNs infer even in safety-critical situations. Therefore, for practical applications, DNNs have to behave in a robust way to disturbances such as noise, pixelation, or blur. Blur directly impacts the performance of DNNs, which are often approximated as a disk-shaped kernel to model defocus. However, optics suggests that there are different kernel shapes depending on wavelength and location caused by optical aberrations. In practice, as the optical quality of a lens decreases, such aberrations increase. This paper proposes OpticsBench, a benchmark for investigating robustness to realistic, practically relevant optical blur effects. Each corruption represents an optical aberration (coma, astigmatism, spherical, trefoil) derived from Zernike Polynomials. Experiments on ImageNet show that for a variety of different pre-trained DNNs, the performance varies strongly compared to disk-shaped kernels, indicating the necessity of considering realistic image degradations. In addition, we show on ImageNet-100 with OpticsAugment that robustness can be increased by using optical kernels as data augmentation. Compared to a conventionally trained ResNeXt50, training with OpticsAugment achieves an average performance gain of 21.7% points on OpticsBench and 6.8% points on 2D common corruptions. ",
    "url": "https://arxiv.org/abs/2308.15499",
    "authors": [
      "Patrick Müller",
      "Alexander Braun",
      "Margret Keuper"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15509",
    "title": "The Relationship between Loneliness and Depression among College  Students: Mining data derived from Passive Sensing",
    "abstract": "Loneliness and depression are interrelated mental health issues affecting students well-being. Using passive sensing data provides a novel approach to examine the granular behavioural indicators differentiating loneliness and depression, and the mediators in their relationship. This study aimed to investigate associations between behavioural features and loneliness and depression among students, exploring the complex relationships between these mental health conditions and associated behaviours. This study combined regression analysis, mediation analysis, and machine learning analysis to explore relationships between behavioural features, loneliness, and depression using passive sensing data, capturing daily life behaviours such as physical activity, phone usage, sleep patterns, and social interactions. Results revealed significant associations between behavioural features and loneliness and depression, emphasizing their interconnected nature. Increased activity and sleep duration were identified as protective factors. Distinct behavioural features for each condition were also found. Mediation analysis highlighted significant indirect effects in the relationship between loneliness and depression. The XGBoost model achieved the highest accuracy in predicting these conditions. This study demonstrated the importance of using passive sensing data and a multi-method approach to understand the complex relationship between loneliness, depression, and associated behaviours. Identifying specific behavioural features and mediators contributes to a deeper understanding of factors influencing loneliness and depression among students. This comprehensive perspective emphasizes the importance of interdisciplinary collaboration for a more nuanced understanding of complex human experiences. ",
    "url": "https://arxiv.org/abs/2308.15509",
    "authors": [
      "Malik Muhammad Qirtas",
      "Evi Zafeiridi",
      "Eleanor Bantry White",
      "Dirk Pesch"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.15515",
    "title": "Finding Optimal 2-Packing Sets on Arbitrary Graphs at Scale",
    "abstract": "A 2-packing set for an undirected graph $G=(V,E)$ is a subset $\\mathcal{S} \\subset V$ such that any two vertices $v_1,v_2 \\in \\mathcal{S}$ have no common neighbors. Finding a 2-packing set of maximum cardinality is a NP-hard problem. We develop a new approach to solve this problem on arbitrary graphs using its close relation to the independent set problem. Thereby, our algorithm red2pack uses new data reduction rules specific to the 2-packing set problem as well as a graph transformation. Our experiments show that we outperform the state-of-the-art for arbitrary graphs with respect to solution quality and also are able to compute solutions multiple orders of magnitude faster than previously possible. For example, we are able to solve 63% of our graphs to optimality in less than a second while the competitor for arbitrary graphs can only solve 5% of the graphs in the data set to optimality even with a 10 hour time limit. Moreover, our approach can solve a wide range of large instances that have previously been unsolved. ",
    "url": "https://arxiv.org/abs/2308.15515",
    "authors": [
      "Jannick Borowitz",
      "Ernestine Großmann",
      "Christian Schulz",
      "Dominik Schweisgut"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2308.15517",
    "title": "Document AI: A Comparative Study of Transformer-Based, Graph-Based  Models, and Convolutional Neural Networks For Document Layout Analysis",
    "abstract": "Document AI aims to automatically analyze documents by leveraging natural language processing and computer vision techniques. One of the major tasks of Document AI is document layout analysis, which structures document pages by interpreting the content and spatial relationships of layout, image, and text. This task can be image-centric, wherein the aim is to identify and label various regions such as authors and paragraphs, or text-centric, where the focus is on classifying individual words in a document. Although there are increasingly sophisticated methods for improving layout analysis, doubts remain about the extent to which their findings can be generalized to a broader context. Specifically, prior work developed systems based on very different architectures, such as transformer-based, graph-based, and CNNs. However, no work has mentioned the effectiveness of these models in a comparative analysis. Moreover, while language-independent Document AI models capable of knowledge transfer have been developed, it remains to be investigated to what degree they can effectively transfer knowledge. In this study, we aim to fill these gaps by conducting a comparative evaluation of state-of-the-art models in document layout analysis and investigating the potential of cross-lingual layout analysis by utilizing machine translation techniques. ",
    "url": "https://arxiv.org/abs/2308.15517",
    "authors": [
      "Sotirios Kastanas",
      "Shaomu Tan",
      "Yi He"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15536",
    "title": "DebSDF: Delving into the Details and Bias of Neural Indoor Scene  Reconstruction",
    "abstract": "In recent years, the neural implicit surface has emerged as a powerful representation for multi-view surface reconstruction due to its simplicity and state-of-the-art performance. However, reconstructing smooth and detailed surfaces in indoor scenes from multi-view images presents unique challenges. Indoor scenes typically contain large texture-less regions, making the photometric loss unreliable for optimizing the implicit surface. Previous work utilizes monocular geometry priors to improve the reconstruction in indoor scenes. However, monocular priors often contain substantial errors in thin structure regions due to domain gaps and the inherent inconsistencies when derived independently from different views. This paper presents \\textbf{DebSDF} to address these challenges, focusing on the utilization of uncertainty in monocular priors and the bias in SDF-based volume rendering. We propose an uncertainty modeling technique that associates larger uncertainties with larger errors in the monocular priors. High-uncertainty priors are then excluded from optimization to prevent bias. This uncertainty measure also informs an importance-guided ray sampling and adaptive smoothness regularization, enhancing the learning of fine structures. We further introduce a bias-aware signed distance function to density transformation that takes into account the curvature and the angle between the view direction and the SDF normals to reconstruct fine details better. Our approach has been validated through extensive experiments on several challenging datasets, demonstrating improved qualitative and quantitative results in reconstructing thin structures in indoor scenes, thereby outperforming previous work. ",
    "url": "https://arxiv.org/abs/2308.15536",
    "authors": [
      "Yuting Xiao",
      "Jingwei Xu",
      "Zehao Yu",
      "Shenghua Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15550",
    "title": "Adversarial Style Transfer for Robust Policy Optimization in Deep  Reinforcement Learning",
    "abstract": "This paper proposes an algorithm that aims to improve generalization for reinforcement learning agents by removing overfitting to confounding features. Our approach consists of a max-min game theoretic objective. A generator transfers the style of observation during reinforcement learning. An additional goal of the generator is to perturb the observation, which maximizes the agent's probability of taking a different action. In contrast, a policy network updates its parameters to minimize the effect of such perturbations, thus staying robust while maximizing the expected future reward. Based on this setup, we propose a practical deep reinforcement learning algorithm, Adversarial Robust Policy Optimization (ARPO), to find a robust policy that generalizes to unseen environments. We evaluate our approach on Procgen and Distracting Control Suite for generalization and sample efficiency. Empirically, ARPO shows improved performance compared to a few baseline algorithms, including data augmentation. ",
    "url": "https://arxiv.org/abs/2308.15550",
    "authors": [
      "Md Masudur Rahman",
      "Yexiang Xue"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15557",
    "title": "A Pseudo-Boolean Polynomials Approach for Image Edge Detection",
    "abstract": "We introduce a novel approach for image edge detection based on pseudo-Boolean polynomials for image patches. We show that patches covering edge regions in the image result in pseudo-Boolean polynomials with higher degrees compared to patches that cover blob regions. The proposed approach is based on reduction of polynomial degree and equivalence properties of penalty-based pseudo-Boolean polynomials. ",
    "url": "https://arxiv.org/abs/2308.15557",
    "authors": [
      "Tendai Mapungwana Chikake",
      "Boris Goldengorin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2308.15568",
    "title": "Over-Squashing in Graph Neural Networks: A Comprehensive survey",
    "abstract": "Graph Neural Networks (GNNs) have emerged as a revolutionary paradigm in the realm of machine learning, offering a transformative approach to dissect intricate relationships inherent in graph-structured data. The foundational architecture of most GNNs involves the dissemination of information through message aggregation and transformation among interconnected nodes, a mechanism that has demonstrated remarkable efficacy across diverse applications encompassing node classification, link prediction, and recommendation systems. Nonetheless, their potential prowess encounters a restraint intrinsic to scenarios necessitating extensive contextual insights. In certain contexts, accurate predictions hinge not only upon a node's immediate local surroundings but also on interactions spanning far-reaching domains. This intricate demand for long-range information dissemination exposes a pivotal challenge recognized as \"over-squashing,\" wherein the fidelity of information flow from distant nodes becomes distorted. This phenomenon significantly curtails the efficiency of message-passing mechanisms, particularly for tasks reliant on intricate long-distance interactions. In this comprehensive article, we illuminate the prevalent constraint of over-squashing pervading GNNs. Our exploration entails a meticulous exposition of the ongoing efforts by researchers to improve the ramifications posed by this limitation. Through systematic elucidation, we delve into strategies, methodologies, and innovations proposed thus far, all aimed at mitigating the detriments of over-squashing. By shedding light on this intricately woven issue, we aim to contribute to a nuanced understanding of the challenges within the GNN landscape and the evolving solutions designed to surmount them. ",
    "url": "https://arxiv.org/abs/2308.15568",
    "authors": [
      "Singh Akansha"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15575",
    "title": "Prototype Fission: Closing Set for Robust Open-set Semi-supervised  Learning",
    "abstract": "Semi-supervised Learning (SSL) has been proven vulnerable to out-of-distribution (OOD) samples in realistic large-scale unsupervised datasets due to over-confident pseudo-labeling OODs as in-distribution (ID). A key underlying problem is class-wise latent space spreading from closed seen space to open unseen space, and the bias is further magnified in SSL's self-training loops. To close the ID distribution set so that OODs are better rejected for safe SSL, we propose Prototype Fission(PF) to divide class-wise latent spaces into compact sub-spaces by automatic fine-grained latent space mining, driven by coarse-grained labels only. Specifically, we form multiple unique learnable sub-class prototypes for each class, optimized towards both diversity and consistency. The Diversity Modeling term encourages samples to be clustered by one of the multiple sub-class prototypes, while the Consistency Modeling term clusters all samples of the same class to a global prototype. Instead of \"opening set\", i.e., modeling OOD distribution, Prototype Fission \"closes set\" and makes it hard for OOD samples to fit in sub-class latent space. Therefore, PF is compatible with existing methods for further performance gains. Extensive experiments validate the effectiveness of our method in open-set SSL settings in terms of successfully forming sub-classes, discriminating OODs from IDs and improving overall accuracy. Codes will be released. ",
    "url": "https://arxiv.org/abs/2308.15575",
    "authors": [
      "Xuwei Tan",
      "Yi-Jie Huang",
      "Yaqian Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15602",
    "title": "An Experimental Comparison of Partitioning Strategies for Distributed  Graph Neural Network Training",
    "abstract": "Recently, graph neural networks (GNNs) have gained much attention as a growing area of deep learning capable of learning on graph-structured data. However, the computational and memory requirements for training GNNs on large-scale graphs can exceed the capabilities of single machines or GPUs, making distributed GNN training a promising direction for large-scale GNN training. A prerequisite for distributed GNN training is to partition the input graph into smaller parts that are distributed among multiple machines of a compute cluster. Although graph partitioning has been extensively studied with regard to graph analytics and graph databases, its effect on GNN training performance is largely unexplored. In this paper, we study the effectiveness of graph partitioning for distributed GNN training. Our study aims to understand how different factors such as GNN parameters, mini-batch size, graph type, features size, and scale-out factor influence the effectiveness of graph partitioning. We conduct experiments with two different GNN systems using vertex and edge partitioning. We found that graph partitioning is a crucial pre-processing step that can heavily reduce the training time and memory footprint. Furthermore, our results show that invested partitioning time can be amortized by reduced GNN training, making it a relevant optimization. ",
    "url": "https://arxiv.org/abs/2308.15602",
    "authors": [
      "Nikolai Merkel",
      "Daniel Stoll",
      "Ruben Mayer",
      "Hans-Arno Jacobsen"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15605",
    "title": "Measurement Tampering Detection Benchmark",
    "abstract": "When training powerful AI systems to perform complex tasks, it may be challenging to provide training signals which are robust to optimization. One concern is measurement tampering, where the AI system manipulates multiple measurements to create the illusion of good results instead of achieving the desired outcome. In this work, we build four new text-based datasets to evaluate measurement tampering detection techniques on large language models. Concretely, given sets of text inputs and measurements aimed at determining if some outcome occurred, as well as a base model able to accurately predict measurements, the goal is to determine if examples where all measurements indicate the outcome actually had the outcome occur, or if this was caused by measurement tampering. We demonstrate techniques that outperform simple baselines on most datasets, but don't achieve maximum performance. We believe there is significant room for improvement for both techniques and datasets, and we are excited for future work tackling measurement tampering. ",
    "url": "https://arxiv.org/abs/2308.15605",
    "authors": [
      "Fabien Roger",
      "Ryan Greenblatt",
      "Max Nadeau",
      "Buck Shlegeris",
      "Nate Thomas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15609",
    "title": "InstaTune: Instantaneous Neural Architecture Search During Fine-Tuning",
    "abstract": "One-Shot Neural Architecture Search (NAS) algorithms often rely on training a hardware agnostic super-network for a domain specific task. Optimal sub-networks are then extracted from the trained super-network for different hardware platforms. However, training super-networks from scratch can be extremely time consuming and compute intensive especially for large models that rely on a two-stage training process of pre-training and fine-tuning. State of the art pre-trained models are available for a wide range of tasks, but their large sizes significantly limits their applicability on various hardware platforms. We propose InstaTune, a method that leverages off-the-shelf pre-trained weights for large models and generates a super-network during the fine-tuning stage. InstaTune has multiple benefits. Firstly, since the process happens during fine-tuning, it minimizes the overall time and compute resources required for NAS. Secondly, the sub-networks extracted are optimized for the target task, unlike prior work that optimizes on the pre-training objective. Finally, InstaTune is easy to \"plug and play\" in existing frameworks. By using multi-objective evolutionary search algorithms along with lightly trained predictors, we find Pareto-optimal sub-networks that outperform their respective baselines across different performance objectives such as accuracy and MACs. Specifically, we demonstrate that our approach performs well across both unimodal (ViT and BERT) and multi-modal (BEiT-3) transformer based architectures. ",
    "url": "https://arxiv.org/abs/2308.15609",
    "authors": [
      "Sharath Nittur Sridhar",
      "Souvik Kundu",
      "Sairam Sundaresan",
      "Maciej Szankin",
      "Anthony Sarah"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15614",
    "title": "Everything Perturbed All at Once: Enabling Differentiable Graph Attacks",
    "abstract": "As powerful tools for representation learning on graphs, graph neural networks (GNNs) have played an important role in applications including social networks, recommendation systems, and online web services. However, GNNs have been shown to be vulnerable to adversarial attacks, which can significantly degrade their effectiveness. Recent state-of-the-art approaches in adversarial attacks rely on gradient-based meta-learning to selectively perturb a single edge with the highest attack score until they reach the budget constraint. While effective in identifying vulnerable links, these methods are plagued by high computational costs. By leveraging continuous relaxation and parameterization of the graph structure, we propose a novel attack method called Differentiable Graph Attack (DGA) to efficiently generate effective attacks and meanwhile eliminate the need for costly retraining. Compared to the state-of-the-art, DGA achieves nearly equivalent attack performance with 6 times less training time and 11 times smaller GPU memory footprint on different benchmark datasets. Additionally, we provide extensive experimental analyses of the transferability of the DGA among different graph models, as well as its robustness against widely-used defense mechanisms. ",
    "url": "https://arxiv.org/abs/2308.15614",
    "authors": [
      "Haoran Liu",
      "Bokun Wang",
      "Jianling Wang",
      "Xiangjue Dong",
      "Tianbao Yang",
      "James Caverlee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2308.15622",
    "title": "Flexible Handover with Real-Time Robust Dynamic Grasp Trajectory  Generation",
    "abstract": "In recent years, there has been a significant effort dedicated to developing efficient, robust, and general human-to-robot handover systems. However, the area of flexible handover in the context of complex and continuous objects' motion remains relatively unexplored. In this work, we propose an approach for effective and robust flexible handover, which enables the robot to grasp moving objects with flexible motion trajectories with a high success rate. The key innovation of our approach is the generation of real-time robust grasp trajectories. We also design a future grasp prediction algorithm to enhance the system's adaptability to dynamic handover scenes. We conduct one-motion handover experiments and motion-continuous handover experiments on our novel benchmark that includes 31 diverse household objects. The system we have developed allows users to move and rotate objects in their hands within a relatively large range. The success rate of the robot grasping such moving objects is 78.15% over the entire household object benchmark. ",
    "url": "https://arxiv.org/abs/2308.15622",
    "authors": [
      "Gu Zhang",
      "Hao-Shu Fang",
      "Hongjie Fang",
      "Cewu Lu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.15624",
    "title": "Detection of Mild Cognitive Impairment Using Facial Features in Video  Conversations",
    "abstract": "Early detection of Mild Cognitive Impairment (MCI) leads to early interventions to slow the progression from MCI into dementia. Deep Learning (DL) algorithms could help achieve early non-invasive, low-cost detection of MCI. This paper presents the detection of MCI in older adults using DL models based only on facial features extracted from video-recorded conversations at home. We used the data collected from the I-CONECT behavioral intervention study (NCT02871921), where several sessions of semi-structured interviews between socially isolated older individuals and interviewers were video recorded. We develop a framework that extracts spatial holistic facial features using a convolutional autoencoder and temporal information using transformers. Our proposed DL model was able to detect the I-CONECT study participants' cognitive conditions (MCI vs. those with normal cognition (NC)) using facial features. The segments and sequence information of the facial features improved the prediction performance compared with the non-temporal features. The detection accuracy using this combined method reached 88% whereas 84% is the accuracy without applying the segments and sequences information of the facial features within a video on a certain theme. ",
    "url": "https://arxiv.org/abs/2308.15624",
    "authors": [
      "Muath Alsuhaibani",
      "Hiroko H. Dodge",
      "Mohammad H. Mahoor"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15639",
    "title": "Hyperbolic Convolutional Neural Networks",
    "abstract": "Deep Learning is mostly responsible for the surge of interest in Artificial Intelligence in the last decade. So far, deep learning researchers have been particularly successful in the domain of image processing, where Convolutional Neural Networks are used. Although excelling at image classification, Convolutional Neural Networks are quite naive in that no inductive bias is set on the embedding space for images. Similar flaws are also exhibited by another type of Convolutional Networks - Graph Convolutional Neural Networks. However, using non-Euclidean space for embedding data might result in more robust and explainable models. One example of such a non-Euclidean space is hyperbolic space. Hyperbolic spaces are particularly useful due to their ability to fit more data in a low-dimensional space and tree-likeliness properties. These attractive properties have been previously used in multiple papers which indicated that they are beneficial for building hierarchical embeddings using shallow models and, recently, using MLPs and RNNs. However, no papers have yet suggested a general approach to using Hyperbolic Convolutional Neural Networks for structured data processing, although these are the most common examples of data used. Therefore, the goal of this work is to devise a general recipe for building Hyperbolic Convolutional Neural Networks. We hypothesize that ability of hyperbolic space to capture hierarchy in the data would lead to better performance. This ability should be particularly useful in cases where data has a tree-like structure. Since this is the case for many existing datasets \\citep{wordnet, imagenet, fb15k}, we argue that such a model would be advantageous both in terms of applications and future research prospects. ",
    "url": "https://arxiv.org/abs/2308.15639",
    "authors": [
      "Andrii Skliar",
      "Maurice Weiler"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15660",
    "title": "Unveiling Camouflage: A Learnable Fourier-based Augmentation for  Camouflaged Object Detection and Instance Segmentation",
    "abstract": "Camouflaged object detection (COD) and camouflaged instance segmentation (CIS) aim to recognize and segment objects that are blended into their surroundings, respectively. While several deep neural network models have been proposed to tackle those tasks, augmentation methods for COD and CIS have not been thoroughly explored. Augmentation strategies can help improve the performance of models by increasing the size and diversity of the training data and exposing the model to a wider range of variations in the data. Besides, we aim to automatically learn transformations that help to reveal the underlying structure of camouflaged objects and allow the model to learn to better identify and segment camouflaged objects. To achieve this, we propose a learnable augmentation method in the frequency domain for COD and CIS via Fourier transform approach, dubbed CamoFourier. Our method leverages a conditional generative adversarial network and cross-attention mechanism to generate a reference image and an adaptive hybrid swapping with parameters to mix the low-frequency component of the reference image and the high-frequency component of the input image. This approach aims to make camouflaged objects more visible for detection and segmentation models. Without bells and whistles, our proposed augmentation method boosts the performance of camouflaged object detectors and camouflaged instance segmenters by large margins. ",
    "url": "https://arxiv.org/abs/2308.15660",
    "authors": [
      "Minh-Quan Le",
      "Minh-Triet Tran",
      "Trung-Nghia Le",
      "Tam V. Nguyen",
      "Thanh-Toan Do"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15663",
    "title": "Adaptive Attack Detection in Text Classification: Leveraging Space  Exploration Features for Text Sentiment Classification",
    "abstract": "Adversarial example detection plays a vital role in adaptive cyber defense, especially in the face of rapidly evolving attacks. In adaptive cyber defense, the nature and characteristics of attacks continuously change, making it crucial to have robust mechanisms in place to detect and counter these threats effectively. By incorporating adversarial example detection techniques, adaptive cyber defense systems can enhance their ability to identify and mitigate attacks that attempt to exploit vulnerabilities in machine learning models or other systems. Adversarial examples are inputs that are crafted by applying intentional perturbations to natural inputs that result in incorrect classification. In this paper, we propose a novel approach that leverages the power of BERT (Bidirectional Encoder Representations from Transformers) and introduces the concept of Space Exploration Features. We utilize the feature vectors obtained from the BERT model's output to capture a new representation of feature space to improve the density estimation method. ",
    "url": "https://arxiv.org/abs/2308.15663",
    "authors": [
      "Atefeh Mahdavi",
      "Neda Keivandarian",
      "Marco Carvalho"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.15669",
    "title": "ACER: An AST-based Call Graph Generator Framework",
    "abstract": "We introduce ACER, an AST-based call graph generator framework. ACER leverages tree-sitter to interface with any language. We opted to focus on generators that operate on abstract syntax trees (ASTs) due to their speed and simplicitly in certain scenarios; however, a fully quantified intermediate representation usually provides far better information at the cost of requiring compilation. To evaluate our framework, we created two context-insensitive Java generators and compared them to existing open-source Java generators. ",
    "url": "https://arxiv.org/abs/2308.15669",
    "authors": [
      "Andrew Chen",
      "Yanfu Yan",
      "Denys Poshyvanyk"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.15671",
    "title": "Lower Bound for Independence Covering in $C_4$-Free Graphs",
    "abstract": "An independent set in a graph $G$ is a set $S$ of pairwise non-adjacent vertices in $G$. A family $\\mathcal{F}$ of independent sets in $G$ is called a $k$-independence covering family if for every independent set $I$ in $G$ of size at most $k$, there exists an $S \\in \\mathcal{F}$ such that $I \\subseteq S$. Lokshtanov et al. [ACM Transactions on Algorithms, 2018] showed that graphs of degeneracy $d$ admit $k$-independence covering families of size $\\binom{k(d+1)}{k} \\cdot 2^{o(kd)} \\cdot \\log n$, and used this result to design efficient parameterized algorithms for a number of problems, including STABLE ODD CYCLE TRANSVERSAL and STABLE MULTICUT. In light of the results of Lokshtanov et al. it is quite natural to ask whether even more general families of graphs admit $k$-independence covering families of size $f(k)n^{O(1)}$. Graphs that exclude a complete bipartite graph $K_{d+1,d+1}$ with $d+1$ vertices on both sides as a subgraph, called $K_{d+1,d+1}$-free graphs, are a frequently considered generalization of $d$-degenerate graphs. This motivates the question whether $K_{d,d}$-free graphs admit $k$-independence covering families of size $f(k,d)n^{O(1)}$. Our main result is a resounding \"no\" to this question -- specifically we prove that even $K_{2,2}$-free graphs (or equivalently $C_4$-free graphs) do not admit $k$-independence covering families of size $f(k)n^{\\frac{k}{4}-\\epsilon}$. ",
    "url": "https://arxiv.org/abs/2308.15671",
    "authors": [
      "Michael Kuhn",
      "Daniel Lokshtanov",
      "Zachary Miller"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2308.15673",
    "title": "MDTD: A Multi Domain Trojan Detector for Deep Neural Networks",
    "abstract": "Machine learning models that use deep neural networks (DNNs) are vulnerable to backdoor attacks. An adversary carrying out a backdoor attack embeds a predefined perturbation called a trigger into a small subset of input samples and trains the DNN such that the presence of the trigger in the input results in an adversary-desired output class. Such adversarial retraining however needs to ensure that outputs for inputs without the trigger remain unaffected and provide high classification accuracy on clean samples. In this paper, we propose MDTD, a Multi-Domain Trojan Detector for DNNs, which detects inputs containing a Trojan trigger at testing time. MDTD does not require knowledge of trigger-embedding strategy of the attacker and can be applied to a pre-trained DNN model with image, audio, or graph-based inputs. MDTD leverages an insight that input samples containing a Trojan trigger are located relatively farther away from a decision boundary than clean samples. MDTD estimates the distance to a decision boundary using adversarial learning methods and uses this distance to infer whether a test-time input sample is Trojaned or not. We evaluate MDTD against state-of-the-art Trojan detection methods across five widely used image-based datasets: CIFAR100, CIFAR10, GTSRB, SVHN, and Flowers102; four graph-based datasets: AIDS, WinMal, Toxicant, and COLLAB; and the SpeechCommand audio dataset. MDTD effectively identifies samples that contain different types of Trojan triggers. We evaluate MDTD against adaptive attacks where an adversary trains a robust DNN to increase (decrease) distance of benign (Trojan) inputs from a decision boundary. ",
    "url": "https://arxiv.org/abs/2308.15673",
    "authors": [
      "Arezoo Rajabi",
      "Surudhi Asokraj",
      "Fengqing Jiang",
      "Luyao Niu",
      "Bhaskar Ramasubramanian",
      "Jim Ritcey",
      "Radha Poovendran"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15674",
    "title": "Predict And Prevent DDOS Attacks Using Machine Learning and Statistical  Algorithms",
    "abstract": "A malicious attempt to exhaust a victim's resources to cause it to crash or halt its services is known as a distributed denial-of-service (DDoS) attack. DDOS attacks stop authorized users from accessing specific services available on the Internet. It targets varying components of a network layer and it is better to stop into layer 4 (transport layer) of the network before approaching a higher layer. This study uses several machine learning and statistical models to detect DDoS attacks from traces of traffic flow and suggests a method to prevent DDOS attacks. For this purpose, we used logistic regression, CNN, XGBoost, naive Bayes, AdaBoostClassifier, KNN, and random forest ML algorithms. In addition, data preprocessing was performed using three methods to identify the most relevant features. This paper explores the issue of improving the DDOS attack detection accuracy using the latest dataset named CICDDoS2019, which has over 50 million records. Because we employed an extensive dataset for this investigation, our findings are trustworthy and practical. Our target class (attack class) was imbalanced. Therefore, we used two techniques to deal with imbalanced data in machine learning. The XGboost machine learning model provided the best detection accuracy of (99.9999%) after applying the SMOTE approach to the target class, outperforming recently developed DDoS detection systems. To the best of our knowledge, no other research has worked on the most recent dataset with over 50 million records, addresses the statistical technique to select the most significant feature, has this high accuracy, and suggests ways to avoid DDOS attackI. ",
    "url": "https://arxiv.org/abs/2308.15674",
    "authors": [
      "Azadeh Golduzian"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.15692",
    "title": "Intriguing Properties of Diffusion Models: A Large-Scale Dataset for  Evaluating Natural Attack Capability in Text-to-Image Generative Models",
    "abstract": "Denoising probabilistic diffusion models have shown breakthrough performance that can generate more photo-realistic images or human-level illustrations than the prior models such as GANs. This high image-generation capability has stimulated the creation of many downstream applications in various areas. However, we find that this technology is indeed a double-edged sword: We identify a new type of attack, called the Natural Denoising Diffusion (NDD) attack based on the finding that state-of-the-art deep neural network (DNN) models still hold their prediction even if we intentionally remove their robust features, which are essential to the human visual system (HVS), by text prompts. The NDD attack can generate low-cost, model-agnostic, and transferrable adversarial attacks by exploiting the natural attack capability in diffusion models. Motivated by the finding, we construct a large-scale dataset, Natural Denoising Diffusion Attack (NDDA) dataset, to systematically evaluate the risk of the natural attack capability of diffusion models with state-of-the-art text-to-image diffusion models. We evaluate the natural attack capability by answering 6 research questions. Through a user study to confirm the validity of the NDD attack, we find that the NDD attack can achieve an 88% detection rate while being stealthy to 93% of human subjects. We also find that the non-robust features embedded by diffusion models contribute to the natural attack capability. To confirm the model-agnostic and transferrable attack capability, we perform the NDD attack against an AD vehicle and find that 73% of the physically printed attacks can be detected as a stop sign. We hope that our study and dataset can help our community to be aware of the risk of diffusion models and facilitate further research toward robust DNN models. ",
    "url": "https://arxiv.org/abs/2308.15692",
    "authors": [
      "Takami Sato",
      "Justin Yue",
      "Nanze Chen",
      "Ningfei Wang",
      "Qi Alfred Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.15697",
    "title": "Segmenting mechanically heterogeneous domains via unsupervised learning",
    "abstract": "From biological organs to soft robotics, highly deformable materials are essential components of natural and engineered systems. These highly deformable materials can have heterogeneous material properties, and can experience heterogeneous deformations with or without underlying material heterogeneity. Many recent works have established that computational modeling approaches are well suited for understanding and predicting the consequences of material heterogeneity and for interpreting observed heterogeneous strain fields. In particular, there has been significant work towards developing inverse analysis approaches that can convert observed kinematic quantities (e.g., displacement, strain) to material properties and mechanical state. Despite the success of these approaches, they are not necessarily generalizable and often rely on tight control and knowledge of boundary conditions. Here, we will build on the recent advances (and ubiquity) of machine learning approaches to explore alternative approaches to detect patterns in heterogeneous material properties and mechanical behavior. Specifically, we will explore unsupervised learning approaches to clustering and ensemble clutering to identify heterogeneous regions. Overall, we find that these approaches are effective, yet limited in their abilities. Through this initial exploration (where all data and code is published alongside this manuscript), we set the stage for future studies that more specifically adapt these methods to mechanical data. ",
    "url": "https://arxiv.org/abs/2308.15697",
    "authors": [
      "Quan Nguyen",
      "Emma Lejeune"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Tissues and Organs (q-bio.TO)"
    ]
  },
  {
    "id": "arXiv:2308.15703",
    "title": "Fragment and Integrate Network (FIN): A Novel Spatial-Temporal Modeling  Based on Long Sequential Behavior for Online Food Ordering Click-Through Rate  Prediction",
    "abstract": "Spatial-temporal information has been proven to be of great significance for click-through rate prediction tasks in online Location-Based Services (LBS), especially in mainstream food ordering platforms such as DoorDash, Uber Eats, Meituan, and Ele.me. Modeling user spatial-temporal preferences with sequential behavior data has become a hot topic in recommendation systems and online advertising. However, most of existing methods either lack the representation of rich spatial-temporal information or only handle user behaviors with limited length, e.g. 100. In this paper, we tackle these problems by designing a new spatial-temporal modeling paradigm named Fragment and Integrate Network (FIN). FIN consists of two networks: (i) Fragment Network (FN) extracts Multiple Sub-Sequences (MSS) from lifelong sequential behavior data, and captures the specific spatial-temporal representation by modeling each MSS respectively. Here both a simplified attention and a complicated attention are adopted to balance the performance gain and resource consumption. (ii) Integrate Network (IN) builds a new integrated sequence by utilizing spatial-temporal interaction on MSS and captures the comprehensive spatial-temporal representation by modeling the integrated sequence with a complicated attention. Both public datasets and production datasets have demonstrated the accuracy and scalability of FIN. Since 2022, FIN has been fully deployed in the recommendation advertising system of Ele.me, one of the most popular online food ordering platforms in China, obtaining 5.7% improvement on Click-Through Rate (CTR) and 7.3% increase on Revenue Per Mille (RPM). ",
    "url": "https://arxiv.org/abs/2308.15703",
    "authors": [
      "Jun Li",
      "Jingjian Wang",
      "Hongwei Wang",
      "Xing Deng",
      "Jielong Chen",
      "Bing Cao",
      "Zekun Wang",
      "Guanjie Xu",
      "Ge Zhang",
      "Feng Shi",
      "Hualei Liu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15705",
    "title": "Towards Earlier Detection of Oral Diseases On Smartphones Using Oral and  Dental RGB Images",
    "abstract": "Oral diseases such as periodontal (gum) diseases and dental caries (cavities) affect billions of people across the world today. However, previous state-of-the-art models have relied on X-ray images to detect oral diseases, making them inaccessible to remote monitoring, developing countries, and telemedicine. To combat this overuse of X-ray imagery, we propose a lightweight machine learning model capable of detecting calculus (also known as hardened plaque or tartar) in RGB images while running efficiently on low-end devices. The model, a modified MobileNetV3-Small neural network transfer learned from ImageNet, achieved an accuracy of 72.73% (which is comparable to state-of-the-art solutions) while still being able to run on mobile devices due to its reduced memory requirements and processing times. A ResNet34-based model was also constructed and achieved an accuracy of 81.82%. Both of these models were tested on a mobile app, demonstrating their potential to limit the number of serious oral disease cases as their predictions can help patients schedule appointments earlier without the need to go to the clinic. ",
    "url": "https://arxiv.org/abs/2308.15705",
    "authors": [
      "Ayush Garg",
      "Julia Lu",
      "Anika Maji"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15706",
    "title": "Representing the Disciplinary Structure of Physics: A Comparative  Evaluation of Graph and Text Embedding Methods",
    "abstract": "Recent advances in machine learning offer new ways to represent and study scholarly works and the space of knowledge. Graph and text embeddings provide a convenient vector representation of scholarly works based on citations and text. Yet, it is unclear whether their representations are consistent or provide different views of the structure of science. Here, we compare graph and text embedding by testing their ability to capture the hierarchical structure of the Physics and Astronomy Classification Scheme (PACS) of papers published by the American Physical Society (APS). We also provide a qualitative comparison of the overall structure of the graph and text embeddings for reference. We find that neural network-based methods outperform traditional methods and graph embedding methods such as node2vec are better than other methods at capturing the PACS structure. Our results call for further investigations into how different contexts of scientific papers are captured by different methods, and how we can combine and leverage such information in an interpretable manner. ",
    "url": "https://arxiv.org/abs/2308.15706",
    "authors": [
      "Isabel Constantino",
      "Sadamori Kojaku",
      "Santo Fortunato",
      "Yong-Yeol Ahn"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2308.15714",
    "title": "A constant factor approximation for the (p,3)-flexible graph  connectivity problem",
    "abstract": "In this article we provide a constant factor approximation for the $(p,3)$-flexible graph connectivity problem, improving on the previous best known $O(p)$-approximation. ",
    "url": "https://arxiv.org/abs/2308.15714",
    "authors": [
      "Ishan Bansal"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2308.15717",
    "title": "Risk-aware Flexible Resource Utilization in an Unbalanced Three-Phase  Distribution Network using SDP-based Distributionally Robust Optimal Power  Flow",
    "abstract": "The variability caused by the proliferation of distributed energy resources (DERs) and the significant growth in unbalanced three-phase loads pose unprecedented challenges to distribution network operations. This paper focuses on how a distribution system operator (DSO), taking over the distribution grid and market operations, would develop a risk-aware flexibility market to mitigate uncertainties in an unbalanced three-phase power distribution network. First, a distributionally robust chance constraint (DRCC) method is devised to solve the unbalanced three-phase optimal power flow using a semidefinite programming (SDP) model. The DSO can apply the proposed solution to jointly clear energy and flexibility markets. Then, the DRCC model accuracy is improved by an information-sharing mechanism characterized by spatially-correlated uncertainties in the distribution grid. Further, a novel system-wide response function is derived to make the DRCC model tractable. Using the duality theory, the paper further investigates the physical composition of the DSO's cleared flexibility prices to guide the unbalanced distribution network operation. Finally, the effectiveness of the risk-aware flexibility market is verified in a modified three-phase IEEE 34-node system. Results demonstrate that the flexibility market can quantify the impact of spatially correlated uncertainties and facilitate the utilization of flexible resources to mitigate uncertainties across the network. ",
    "url": "https://arxiv.org/abs/2308.15717",
    "authors": [
      "Zelong Lu",
      "Jianxue Wang",
      "Mohammad Shahidehpour",
      "Linquan Bai",
      "Zuyi Li",
      "Lei Yan",
      "Xianlong Chen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2308.15724",
    "title": "Background Debiased SAR Target Recognition via Causal Interventional  Regularizer",
    "abstract": "Recent studies have utilized deep learning (DL) techniques to automatically extract features from synthetic aperture radar (SAR) images, which shows great promise for enhancing the performance of SAR automatic target recognition (ATR). However, our research reveals a previously overlooked issue: SAR images to be recognized include not only the foreground (i.e., the target), but also a certain size of the background area. When a DL-model is trained exclusively on foreground data, its recognition performance is significantly superior to a model trained on original data that includes both foreground and background. This suggests that the presence of background impedes the ability of the DL-model to learn additional semantic information about the target. To address this issue, we construct a structural causal model (SCM) that incorporates the background as a confounder. Based on the constructed SCM, we propose a causal intervention based regularization method to eliminate the negative impact of background on feature semantic learning and achieve background debiased SAR-ATR. The proposed causal interventional regularizer can be integrated into any existing DL-based SAR-ATR models to mitigate the impact of background interference on the feature extraction and recognition accuracy. Experimental results on the Moving and Stationary Target Acquisition and Recognition (MSTAR) dataset indicate that the proposed method can enhance the efficiency of existing DL-based methods in a plug-and-play manner. ",
    "url": "https://arxiv.org/abs/2308.15724",
    "authors": [
      "Hongwei Dong",
      "Fangzhou Han",
      "Lingyu Si",
      "Wenwen Qiang",
      "Lamei Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15730",
    "title": "Fully Embedded Time-Series Generative Adversarial Networks",
    "abstract": "Generative Adversarial Networks (GANs) should produce synthetic data that fits the underlying distribution of the data being modeled. For real valued time-series data, this implies the need to simultaneously capture the static distribution of the data, but also the full temporal distribution of the data for any potential time horizon. This temporal element produces a more complex problem that can potentially leave current solutions under-constrained, unstable during training, or prone to varying degrees of mode collapse. In FETSGAN, entire sequences are translated directly to the generator's sampling space using a seq2seq style adversarial auto encoder (AAE), where adversarial training is used to match the training distribution in both the feature space and the lower dimensional sampling space. This additional constraint provides a loose assurance that the temporal distribution of the synthetic samples will not collapse. In addition, the First Above Threshold (FAT) operator is introduced to supplement the reconstruction of encoded sequences, which improves training stability and the overall quality of the synthetic data being generated. These novel contributions demonstrate a significant improvement to the current state of the art for adversarial learners in qualitative measures of temporal similarity and quantitative predictive ability of data generated through FETSGAN. ",
    "url": "https://arxiv.org/abs/2308.15730",
    "authors": [
      "Joe Beck",
      "Subhadeep Chakraborty"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15734",
    "title": "Efficient and Explainable Graph Neural Architecture Search via  Monte-Carlo Tree Search",
    "abstract": "Graph neural networks (GNNs) are powerful tools for performing data science tasks in various domains. Although we use GNNs in wide application scenarios, it is a laborious task for researchers and practitioners to design/select optimal GNN rchitectures in diverse graphs. To save human efforts and computational costs, graph neural architecture search (Graph NAS) has been used to search for a sub-optimal GNN architecture that combines existing components. However, there are no existing Graph NAS methods that satisfy explainability, efficiency, and adaptability to various graphs. Therefore, we propose an efficient and explainable Graph NAS method, called ExGNAS, which consists of (i) a simple search space that can adapt to various graphs and (ii) a search algorithm that makes the decision process explainable. The search space includes only fundamental functions that can handle homophilic and heterophilic graphs. The search algorithm efficiently searches for the best GNN architecture via Monte-Carlo tree search without neural models. The combination of our search space and algorithm achieves finding accurate GNN models and the important functions within the search space. We comprehensively evaluate our method compared with twelve hand-crafted GNN architectures and three Graph NAS methods in four graphs. Our experimental results show that ExGNAS increases AUC up to 3.6 and reduces run time up to 78\\% compared with the state-of-the-art Graph NAS methods. Furthermore, we show ExGNAS is effective in analyzing the difference between GNN architectures in homophilic and heterophilic graphs. ",
    "url": "https://arxiv.org/abs/2308.15734",
    "authors": [
      "Yuya Sasaki"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2308.15736",
    "title": "Vulnerability of Machine Learning Approaches Applied in IoT-based Smart  Grid: A Review",
    "abstract": "The machine learning (ML) sees an increasing prevalence of being used in the internet-of-things enabled smart grid. However, the trustworthiness of ML is a severe issue that must be addressed to accommodate the trend of ML-based smart grid applications (MLsgAPPs). The adversarial distortion injected into the power signal will greatly affect the system's normal control and operation. Therefore, it is imperative to conduct vulnerability assessment for MLsgAPPs applied in the context of safety-critical power systems. In this paper, we provide a comprehensive review of the recent progress in designing attack and defense methods for MLsgAPPs. Unlike the traditional survey about ML security, this is the first review work about the security of MLsgAPPs that focuses on the characteristics of power systems. The survey is organized from the aspects of adversarial assumptions, targeted applications, evaluation metrics, defending approaches, physics-related constraints, and applied datasets. We also highlight future directions on this topic to encourage more researchers to conduct further research on adversarial attacks and defending approaches for MLsgAPPs. ",
    "url": "https://arxiv.org/abs/2308.15736",
    "authors": [
      "Zhenyong Zhang",
      "Mengxiang Liu",
      "Mingyang Sun",
      "Ruilong Deng",
      "Peng Cheng",
      "Dusit Niyato",
      "Mo-Yuen Chow",
      "Jiming Chen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.15745",
    "title": "Cyberbullying Detection for Low-resource Languages and Dialects: Review  of the State of the Art",
    "abstract": "The struggle of social media platforms to moderate content in a timely manner, encourages users to abuse such platforms to spread vulgar or abusive language, which, when performed repeatedly becomes cyberbullying a social problem taking place in virtual environments, yet with real-world consequences, such as depression, withdrawal, or even suicide attempts of its victims. Systems for the automatic detection and mitigation of cyberbullying have been developed but, unfortunately, the vast majority of them are for the English language, with only a handful available for low-resource languages. To estimate the present state of research and recognize the needs for further development, in this paper we present a comprehensive systematic survey of studies done so far for automatic cyberbullying detection in low-resource languages. We analyzed all studies on this topic that were available. We investigated more than seventy published studies on automatic detection of cyberbullying or related language in low-resource languages and dialects that were published between around 2017 and January 2023. There are 23 low-resource languages and dialects covered by this paper, including Bangla, Hindi, Dravidian languages and others. In the survey, we identify some of the research gaps of previous studies, which include the lack of reliable definitions of cyberbullying and its relevant subcategories, biases in the acquisition, and annotation of data. Based on recognizing those research gaps, we provide some suggestions for improving the general research conduct in cyberbullying detection, with a primary focus on low-resource languages. Based on those proposed suggestions, we collect and release a cyberbullying dataset in the Chittagonian dialect of Bangla and propose a number of initial ML solutions trained on that dataset. In addition, pre-trained transformer-based the BanglaBERT model was also attempted. ",
    "url": "https://arxiv.org/abs/2308.15745",
    "authors": [
      "Tanjim Mahmud",
      "Michal Ptaszynski",
      "Juuso Eronen",
      "Fumito Masui"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.15780",
    "title": "DBNet: Leveraging DBMS for Network Automation",
    "abstract": "We present DBNet, a data-driven network automation framework built on top of a DBMS. DBNet utilizes key primitives of a DBMS including tables, procedures, transactions, logging, and access control to serve the functions of a data-centric network control plane. DBNet accomplishes this functionality by storing mirrored network device states, executing automation programs on these mirror states within the DBMS, and proxying state updates out to the physical devices upon changes to mirror/local state. The framework also stores network telemetry data, performs analytics on the data, uses the analytics to motivate control plane actions, and provides provenance logging features on the actions taken. We apply DBNet to motivating cloud network infrastructure examples and show how developers can use DBNet's interface to express rich user-defined policies. Our preliminary case studies show that the overhead to run DBNet is trivial in the timescales generally relevant for network automation. ",
    "url": "https://arxiv.org/abs/2308.15780",
    "authors": [
      "Rithvik Chuppala",
      "Silvery Fu",
      "Sylvia Ratnasamy"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2308.15783",
    "title": "Split Without a Leak: Reducing Privacy Leakage in Split Learning",
    "abstract": "The popularity of Deep Learning (DL) makes the privacy of sensitive data more imperative than ever. As a result, various privacy-preserving techniques have been implemented to preserve user data privacy in DL. Among various privacy-preserving techniques, collaborative learning techniques, such as Split Learning (SL) have been utilized to accelerate the learning and prediction process. Initially, SL was considered a promising approach to data privacy. However, subsequent research has demonstrated that SL is susceptible to many types of attacks and, therefore, it cannot serve as a privacy-preserving technique. Meanwhile, countermeasures using a combination of SL and encryption have also been introduced to achieve privacy-preserving deep learning. In this work, we propose a hybrid approach using SL and Homomorphic Encryption (HE). The idea behind it is that the client encrypts the activation map (the output of the split layer between the client and the server) before sending it to the server. Hence, during both forward and backward propagation, the server cannot reconstruct the client's input data from the intermediate activation map. This improvement is important as it reduces privacy leakage compared to other SL-based works, where the server can gain valuable information about the client's input. In addition, on the MIT-BIH dataset, our proposed hybrid approach using SL and HE yields faster training time (about 6 times) and significantly reduced communication overhead (almost 160 times) compared to other HE-based approaches, thereby offering improved privacy protection for sensitive data in DL. ",
    "url": "https://arxiv.org/abs/2308.15783",
    "authors": [
      "Khoa Nguyen",
      "Tanveer Khan",
      "Antonis Michalas"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15785",
    "title": "Collaborative, Code-Proximal Dynamic Software Visualization within Code  Editors",
    "abstract": "Software visualizations are usually realized as standalone and isolated tools that use embedded code viewers within the visualization. In the context of program comprehension, only few approaches integrate visualizations into code editors, such as integrated development environments. This is surprising since professional developers consider reading source code as one of the most important ways to understand software, therefore spend a lot of time with code editors. In this paper, we introduce the design and proof-of-concept implementation for a software visualization approach that can be embedded into code editors. Our contribution differs from related work in that we use dynamic analysis of a software system's runtime behavior. Additionally, we incorporate distributed tracing. This enables developers to understand how, for example, the currently handled source code behaves as a fully deployed, distributed software system. Our visualization approach enhances common remote pair programming tools and is collaboratively usable by employing shared code cities. As a result, user interactions are synchronized between code editor and visualization, as well as broadcasted to collaborators. To the best of our knowledge, this is the first approach that combines code editors with collaboratively usable code cities. Therefore, we conducted a user study to collect first-time feedback regarding the perceived usefulness and perceived usability of our approach. We additionally collected logging information to provide more data regarding time spent in code cities that are embedded in code editors. Seven teams with two students each participated in that study. The results show that the majority of participants find our approach useful and would employ it for their own use. We provide each participant's video recording, raw results, and all steps to reproduce our experiment as supplementary package. ",
    "url": "https://arxiv.org/abs/2308.15785",
    "authors": [
      "Alexander Krause-Glau",
      "Wilhelm Hasselbring"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.15786",
    "title": "FedCiR: Client-Invariant Representation Learning for Federated Non-IID  Features",
    "abstract": "Federated learning (FL) is a distributed learning paradigm that maximizes the potential of data-driven models for edge devices without sharing their raw data. However, devices often have non-independent and identically distributed (non-IID) data, meaning their local data distributions can vary significantly. The heterogeneity in input data distributions across devices, commonly referred to as the feature shift problem, can adversely impact the training convergence and accuracy of the global model. To analyze the intrinsic causes of the feature shift problem, we develop a generalization error bound in FL, which motivates us to propose FedCiR, a client-invariant representation learning framework that enables clients to extract informative and client-invariant features. Specifically, we improve the mutual information term between representations and labels to encourage representations to carry essential classification knowledge, and diminish the mutual information term between the client set and representations conditioned on labels to promote representations of clients to be client-invariant. We further incorporate two regularizers into the FL framework to bound the mutual information terms with an approximate global representation distribution to compensate for the absence of the ground-truth global representation distribution, thus achieving informative and client-invariant feature extraction. To achieve global representation distribution approximation, we propose a data-free mechanism performed by the server without compromising privacy. Extensive experiments demonstrate the effectiveness of our approach in achieving client-invariant representation learning and solving the data heterogeneity issue. ",
    "url": "https://arxiv.org/abs/2308.15786",
    "authors": [
      "Zijian Li",
      "Zehong Lin",
      "Jiawei Shao",
      "Yuyi Mao",
      "Jun Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15791",
    "title": "Neural Video Compression with Temporal Layer-Adaptive Hierarchical  B-frame Coding",
    "abstract": "Neural video compression (NVC) is a rapidly evolving video coding research area, with some models achieving superior coding efficiency compared to the latest video coding standard Versatile Video Coding (VVC). In conventional video coding standards, the hierarchical B-frame coding, which utilizes a bidirectional prediction structure for higher compression, had been well-studied and exploited. In NVC, however, limited research has investigated the hierarchical B scheme. In this paper, we propose an NVC model exploiting hierarchical B-frame coding with temporal layer-adaptive optimization. We first extend an existing unidirectional NVC model to a bidirectional model, which achieves -21.13% BD-rate gain over the unidirectional baseline model. However, this model faces challenges when applied to sequences with complex or large motions, leading to performance degradation. To address this, we introduce temporal layer-adaptive optimization, incorporating methods such as temporal layer-adaptive quality scaling (TAQS) and temporal layer-adaptive latent scaling (TALS). The final model with the proposed methods achieves an impressive BD-rate gain of -39.86% against the baseline. It also resolves the challenges in sequences with large or complex motions with up to -49.13% more BD-rate gains than the simple bidirectional extension. This improvement is attributed to the allocation of more bits to lower temporal layers, thereby enhancing overall reconstruction quality with smaller bits. Since our method has little dependency on a specific NVC model architecture, it can serve as a general tool for extending unidirectional NVC models to the ones with hierarchical B-frame coding. ",
    "url": "https://arxiv.org/abs/2308.15791",
    "authors": [
      "Yeongwoong Kim",
      "Suyong Bahk",
      "Seungeon Kim",
      "Won Hee Lee",
      "Dokwan Oh",
      "Hui Yong Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.15795",
    "title": "Occlusion-Aware Detection and Re-ID Calibrated Network for Multi-Object  Tracking",
    "abstract": "Multi-Object Tracking (MOT) is a crucial computer vision task that aims to predict the bounding boxes and identities of objects simultaneously. While state-of-the-art methods have made remarkable progress by jointly optimizing the multi-task problems of detection and Re-ID feature learning, yet, few approaches explore to tackle the occlusion issue, which is a long-standing challenge in the MOT field. Generally, occluded objects may hinder the detector from estimating the bounding boxes, resulting in fragmented trajectories. And the learned occluded Re-ID embeddings are less distinct since they contain interferer. To this end, we propose an occlusion-aware detection and Re-ID calibrated network for multi-object tracking, termed as ORCTrack. Specifically, we propose an Occlusion-Aware Attention (OAA) module in the detector that highlights the object features while suppressing the occluded background regions. OAA can serve as a modulator that enhances the detector for some potentially occluded objects. Furthermore, we design a Re-ID embedding matching block based on the optimal transport problem, which focuses on enhancing and calibrating the Re-ID representations through different adjacent frames complementarily. To validate the effectiveness of the proposed method, extensive experiments are conducted on two challenging VisDrone2021-MOT and KITTI benchmarks. Experimental evaluations demonstrate the superiority of our approach, which can achieve new state-of-the-art performance and enjoy high run-time efficiency. ",
    "url": "https://arxiv.org/abs/2308.15795",
    "authors": [
      "Yukun Su",
      "Ruizhou Sun",
      "Xin Shu",
      "Yu Zhang",
      "Qingyao Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15802",
    "title": "Benchmarking Robustness and Generalization in Multi-Agent Systems: A  Case Study on Neural MMO",
    "abstract": "We present the results of the second Neural MMO challenge, hosted at IJCAI 2022, which received 1600+ submissions. This competition targets robustness and generalization in multi-agent systems: participants train teams of agents to complete a multi-task objective against opponents not seen during training. The competition combines relatively complex environment design with large numbers of agents in the environment. The top submissions demonstrate strong success on this task using mostly standard reinforcement learning (RL) methods combined with domain-specific engineering. We summarize the competition design and results and suggest that, as an academic community, competitions may be a powerful approach to solving hard problems and establishing a solid benchmark for algorithms. We will open-source our benchmark including the environment wrapper, baselines, a visualization tool, and selected policies for further research. ",
    "url": "https://arxiv.org/abs/2308.15802",
    "authors": [
      "Yangkun Chen",
      "Joseph Suarez",
      "Junjie Zhang",
      "Chenghui Yu",
      "Bo Wu",
      "Hanmo Chen",
      "Hengman Zhu",
      "Rui Du",
      "Shanliang Qian",
      "Shuai Liu",
      "Weijun Hong",
      "Jinke He",
      "Yibing Zhang",
      "Liang Zhao",
      "Clare Zhu",
      "Julian Togelius",
      "Sharada Mohanty",
      "Jiaxin Chen",
      "Xiu Li",
      "Xiaolong Zhu",
      "Phillip Isola"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15804",
    "title": "Securing Blockchain Systems: A Novel Collaborative Learning Framework to  Detect Attacks in Transactions and Smart Contracts",
    "abstract": "With the escalating prevalence of malicious activities exploiting vulnerabilities in blockchain systems, there is an urgent requirement for robust attack detection mechanisms. To address this challenge, this paper presents a novel collaborative learning framework designed to detect attacks in blockchain transactions and smart contracts by analyzing transaction features. Our framework exhibits the capability to classify various types of blockchain attacks, including intricate attacks at the machine code level (e.g., injecting malicious codes to withdraw coins from users unlawfully), which typically necessitate significant time and security expertise to detect. To achieve that, the proposed framework incorporates a unique tool that transforms transaction features into visual representations, facilitating efficient analysis and classification of low-level machine codes. Furthermore, we propose a customized collaborative learning model to enable real-time detection of diverse attack types at distributed mining nodes. In order to create a comprehensive dataset, we deploy a pilot system based on a private Ethereum network and conduct multiple attack scenarios. To the best of our knowledge, our dataset is the most comprehensive and diverse collection of transactions and smart contracts synthesized in a laboratory for cyberattack detection in blockchain systems. Our framework achieves a detection accuracy of approximately 94\\% through extensive simulations and real-time experiments with a throughput of over 1,100 transactions per second. These compelling results validate the efficacy of our framework and showcase its adaptability in addressing real-world cyberattack scenarios. ",
    "url": "https://arxiv.org/abs/2308.15804",
    "authors": [
      "Tran Viet Khoa",
      "Do Hai Son",
      "Chi-Hieu Nguyen",
      "Dinh Thai Hoang",
      "Diep N. Nguyen",
      "Nguyen Linh Trung",
      "Tran Thi Thuy Quynh",
      "Trong-Minh Hoang",
      "Nguyen Viet Ha",
      "Eryk Dutkiewicz"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2308.15829",
    "title": "Early Detection of Red Palm Weevil Infestations using Deep Learning  Classification of Acoustic Signals",
    "abstract": "The Red Palm Weevil (RPW), also known as the palm weevil, is considered among the world's most damaging insect pests of palms. Current detection techniques include the detection of symptoms of RPW using visual or sound inspection and chemical detection of volatile signatures generated by infested palm trees. However, efficient detection of RPW diseases at an early stage is considered one of the most challenging issues for cultivating date palms. In this paper, an efficient approach to the early detection of RPW is proposed. The proposed approach is based on RPW sound activities being recorded and analyzed. The first step involves the conversion of sound data into images based on a selected set of features. The second step involves the combination of images from the same sound file but computed by different features into a single image. The third step involves the application of different Deep Learning (DL) techniques to classify resulting images into two classes: infested and not infested. Experimental results show good performances of the proposed approach for RPW detection using different DL techniques, namely MobileNetV2, ResNet50V2, ResNet152V2, VGG16, VGG19, DenseNet121, DenseNet201, Xception, and InceptionV3. The proposed approach outperformed existing techniques for public datasets. ",
    "url": "https://arxiv.org/abs/2308.15829",
    "authors": [
      "Wadii Boulila",
      "Ayyub Alzahem",
      "Anis Koubaa",
      "Bilel Benjdira",
      "Adel Ammar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15840",
    "title": "MSGNN: Multi-scale Spatio-temporal Graph Neural Network for Epidemic  Forecasting",
    "abstract": "Infectious disease forecasting has been a key focus and proved to be crucial in controlling epidemic. A recent trend is to develop forecast-ing models based on graph neural networks (GNNs). However, existing GNN-based methods suffer from two key limitations: (1) Current models broaden receptive fields by scaling the depth of GNNs, which is insuffi-cient to preserve the semantics of long-range connectivity between distant but epidemic related areas. (2) Previous approaches model epidemics within single spatial scale, while ignoring the multi-scale epidemic pat-terns derived from different scales. To address these deficiencies, we devise the Multi-scale Spatio-temporal Graph Neural Network (MSGNN) based on an innovative multi-scale view. To be specific, in the proposed MSGNN model, we first devise a novel graph learning module, which directly captures long-range connectivity from trans-regional epidemic signals and integrates them into a multi-scale graph. Based on the learned multi-scale graph, we utilize a newly designed graph convolution module to exploit multi-scale epidemic patterns. This module allows us to facilitate multi-scale epidemic modeling by mining both scale-shared and scale-specific pat-terns. Experimental results on forecasting new cases of COVID-19 in United State demonstrate the superiority of our method over state-of-arts. Further analyses and visualization also show that MSGNN offers not only accurate, but also robust and interpretable forecasting result. ",
    "url": "https://arxiv.org/abs/2308.15840",
    "authors": [
      "Mingjie Qiu",
      "Zhiyi Tan",
      "Bing-kun Bao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Physics and Society (physics.soc-ph)",
      "Populations and Evolution (q-bio.PE)"
    ]
  },
  {
    "id": "arXiv:2308.15846",
    "title": "Exploring Multi-Modal Contextual Knowledge for Open-Vocabulary Object  Detection",
    "abstract": "In this paper, we for the first time explore helpful multi-modal contextual knowledge to understand novel categories for open-vocabulary object detection (OVD). The multi-modal contextual knowledge stands for the joint relationship across regions and words. However, it is challenging to incorporate such multi-modal contextual knowledge into OVD. The reason is that previous detection frameworks fail to jointly model multi-modal contextual knowledge, as object detectors only support vision inputs and no caption description is provided at test time. To this end, we propose a multi-modal contextual knowledge distillation framework, MMC-Det, to transfer the learned contextual knowledge from a teacher fusion transformer with diverse multi-modal masked language modeling (D-MLM) to a student detector. The diverse multi-modal masked language modeling is realized by an object divergence constraint upon traditional multi-modal masked language modeling (MLM), in order to extract fine-grained region-level visual contexts, which are vital to object detection. Extensive experiments performed upon various detection datasets show the effectiveness of our multi-modal context learning strategy, where our approach well outperforms the recent state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2308.15846",
    "authors": [
      "Yifan Xu",
      "Mengdan Zhang",
      "Xiaoshan Yang",
      "Changsheng Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15868",
    "title": "Feature Attention Network (FA-Net): A Deep-Learning Based Approach for  Underwater Single Image Enhancement",
    "abstract": "Underwater image processing and analysis have been a hotspot of study in recent years, as more emphasis has been focused to underwater monitoring and usage of marine resources. Compared with the open environment, underwater image encountered with more complicated conditions such as light abortion, scattering, turbulence, nonuniform illumination and color diffusion. Although considerable advances and enhancement techniques achieved in resolving these issues, they treat low-frequency information equally across the entire channel, which results in limiting the network's representativeness. We propose a deep learning and feature-attention-based end-to-end network (FA-Net) to solve this problem. In particular, we propose a Residual Feature Attention Block (RFAB), containing the channel attention, pixel attention, and residual learning mechanism with long and short skip connections. RFAB allows the network to focus on learning high-frequency information while skipping low-frequency information on multi-hop connections. The channel and pixel attention mechanism considers each channel's different features and the uneven distribution of haze over different pixels in the image. The experimental results shows that the FA-Net propose by us provides higher accuracy, quantitatively and qualitatively and superiority to previous state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2308.15868",
    "authors": [
      "Muhammad Hamza",
      "Ammar Hawbani",
      "Sami Ul Rehman",
      "Xingfu Wang",
      "Liang Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.15873",
    "title": "Minimum Width for Deep, Narrow MLP: A Diffeomorphism and the Whitney  Embedding Theorem Approach",
    "abstract": "Recently, there has been significant attention on determining the minimum width for the universal approximation property of deep, narrow MLPs. Among these challenges, approximating a continuous function under the uniform norm is important and challenging, with the gap between its lower and upper bound being hard to narrow. In this regard, we propose a novel upper bound for the minimum width, given by $\\operatorname{max}(2d_x+1, d_y) + \\alpha(\\sigma)$, to achieve uniform approximation in deep narrow MLPs, where $0\\leq \\alpha(\\sigma)\\leq 2$ represents the constant depending on the activation function. We demonstrate this bound through two key proofs. First, we establish that deep, narrow MLPs with little additional width can approximate diffeomorphisms. Secondly, we utilize the Whitney embedding theorem to show that any continuous function can be approximated by embeddings, further decomposed into linear transformations and diffeomorphisms. ",
    "url": "https://arxiv.org/abs/2308.15873",
    "authors": [
      "Geonho Hwang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Geometric Topology (math.GT)"
    ]
  },
  {
    "id": "arXiv:2308.15890",
    "title": "Natlog: Embedding Logic Programming into the Python Deep-Learning  Ecosystem",
    "abstract": "Driven by expressiveness commonalities of Python and our Python-based embedded logic-based language Natlog, we design high-level interaction patterns between equivalent language constructs and data types on the two sides. By directly connecting generators and backtracking, nested tuples and terms, coroutines and first-class logic engines, reflection and meta-interpretation, we enable logic-based language constructs to access the full power of the Python ecosystem. We show the effectiveness of our design via Natlog apps working as orchestrators for JAX and Pytorch pipelines and as DCG-driven GPT3 and DALL.E prompt generators. Keyphrases: embedding of logic programming in the Python ecosystem, high-level inter-paradigm data exchanges, coroutining with logic engines, logic-based neuro-symbolic computing, logic grammars as prompt-generators for Large Language Models, logic-based neural network configuration and training. ",
    "url": "https://arxiv.org/abs/2308.15890",
    "authors": [
      "Paul Tarau"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2308.15899",
    "title": "Beyond Traditional Neural Networks: Toward adding Reasoning and Learning  Capabilities through Computational Logic Techniques",
    "abstract": "Deep Learning (DL) models have become popular for solving complex problems, but they have limitations such as the need for high-quality training data, lack of transparency, and robustness issues. Neuro-Symbolic AI has emerged as a promising approach combining the strengths of neural networks and symbolic reasoning. Symbolic knowledge injection (SKI) techniques are a popular method to incorporate symbolic knowledge into sub-symbolic systems. This work proposes solutions to improve the knowledge injection process and integrate elements of ML and logic into multi-agent systems (MAS). ",
    "url": "https://arxiv.org/abs/2308.15899",
    "authors": [
      "Andrea Rafanelli"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2308.15900",
    "title": "Data reduction for directed feedback vertex set on graphs without long  induced cycles",
    "abstract": "We study reduction rules for Directed Feedback Vertex Set (DFVS) on instances without long cycles. A DFVS instance without cycles longer than $d$ naturally corresponds to an instance of $d$-Hitting Set, however, enumerating all cycles in an $n$-vertex graph and then kernelizing the resulting $d$-Hitting Set instance can be too costly, as already enumerating all cycles can take time $\\Omega(n^d)$. We show how to compute a kernel with at most $2^dk^d$ vertices and at most $d^{3d}k^d$ induced cycles of length at most $d$ (which however, cannot be enumerated efficiently), where $k$ is the size of a minimum directed feedback vertex set. We then study classes of graphs whose underlying undirected graphs have bounded expansion or are nowhere dense; these are very general classes of sparse graphs, containing e.g. classes excluding a minor or a topological minor. We prove that for such classes without induced cycles of length greater than $d$ we can compute a kernel with $O_d(k)$ and $O_{d,\\epsilon}(k^{1+\\epsilon})$ vertices for any $\\epsilon>0$, respectively, in time $O_d(n^{O(1)})$ and $O_{d,\\epsilon}(n^{O(1)})$, respectively. The most restricted classes we consider are strongly connected planar graphs without any (induced or non-induced) long cycles. We show that these have bounded treewidth and hence DFVS on planar graphs without cycles of length greater than $d$ can be solved in time $2^{O(d)}\\cdot n^{O(1)}$. We finally present a new data reduction rule for general DFVS and prove that the rule together with a few standard rules subsumes all the rules applied by Bergougnoux et al. to obtain a polynomial kernel for DFVS[FVS], i.e., DFVS parameterized by the feedback vertex set number of the underlying (undirected) graph. We conclude by studying the LP-based approximation of DFVS. ",
    "url": "https://arxiv.org/abs/2308.15900",
    "authors": [
      "Jona Dirks",
      "Enna Gerhard",
      "Mario Grobler",
      "Amer E. Mouawad",
      "Sebastian Siebertz"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2308.15926",
    "title": "IDVT: Interest-aware Denoising and View-guided Tuning for Social  Recommendation",
    "abstract": "In the information age, recommendation systems are vital for efficiently filtering information and identifying user preferences. Online social platforms have enriched these systems by providing valuable auxiliary information. Socially connected users are assumed to share similar preferences, enhancing recommendation accuracy and addressing cold start issues. However, empirical findings challenge the assumption, revealing that certain social connections can actually harm system performance. Our statistical analysis indicates a significant amount of noise in the social network, where many socially connected users do not share common interests. To address this issue, we propose an innovative \\underline{I}nterest-aware \\underline{D}enoising and \\underline{V}iew-guided \\underline{T}uning (IDVT) method for the social recommendation. The first ID part effectively denoises social connections. Specifically, the denoising process considers both social network structure and user interaction interests in a global view. Moreover, in this global view, we also integrate denoised social information (social domain) into the propagation of the user-item interactions (collaborative domain) and aggregate user representations from two domains using a gating mechanism. To tackle potential user interest loss and enhance model robustness within the global view, our second VT part introduces two additional views (local view and dropout-enhanced view) for fine-tuning user representations in the global view through contrastive learning. Extensive evaluations on real-world datasets with varying noise ratios demonstrate the superiority of IDVT over state-of-the-art social recommendation methods. ",
    "url": "https://arxiv.org/abs/2308.15926",
    "authors": [
      "Dezhao Yang",
      "Jianghong Ma",
      "Shanshan Feng",
      "Haijun Zhang",
      "Zhao Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15949",
    "title": "Latency-aware Unified Dynamic Networks for Efficient Image Recognition",
    "abstract": "Dynamic computation has emerged as a promising avenue to enhance the inference efficiency of deep networks. It allows selective activation of computational units, leading to a reduction in unnecessary computations for each input sample. However, the actual efficiency of these dynamic models can deviate from theoretical predictions. This mismatch arises from: 1) the lack of a unified approach due to fragmented research; 2) the focus on algorithm design over critical scheduling strategies, especially in CUDA-enabled GPU contexts; and 3) challenges in measuring practical latency, given that most libraries cater to static operations. Addressing these issues, we unveil the Latency-Aware Unified Dynamic Networks (LAUDNet), a framework that integrates three primary dynamic paradigms-spatially adaptive computation, dynamic layer skipping, and dynamic channel skipping. To bridge the theoretical and practical efficiency gap, LAUDNet merges algorithmic design with scheduling optimization, guided by a latency predictor that accurately gauges dynamic operator latency. We've tested LAUDNet across multiple vision tasks, demonstrating its capacity to notably reduce the latency of models like ResNet-101 by over 50% on platforms such as V100, RTX3090, and TX2 GPUs. Notably, LAUDNet stands out in balancing accuracy and efficiency. Code is available at: https://www.github.com/LeapLabTHU/LAUDNet. ",
    "url": "https://arxiv.org/abs/2308.15949",
    "authors": [
      "Yizeng Han",
      "Zeyu Liu",
      "Zhihang Yuan",
      "Yifan Pu",
      "Chaofei Wang",
      "Shiji Song",
      "Gao Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15964",
    "title": "Specx: a C++ task-based runtime system for heterogeneous distributed  architectures",
    "abstract": "Parallelization is needed everywhere, from laptops and mobile phones to supercomputers. Among parallel programming models, task-based programming has demonstrated a powerful potential and is widely used in high-performance scientific computing. Not only does it allow for efficient parallelization across distributed heterogeneous computing nodes, but it also allows for elegant source code structuring by describing hardware-independent algorithms. In this paper, we present Specx, a task-based runtime system written in modern C++. Specx supports distributed heterogeneous computing by simultaneously exploiting CPUs and GPUs (CUDA/HIP) and incorporating communication into the task graph. We describe the specificities of Specx and demonstrate its potential by running parallel applications. ",
    "url": "https://arxiv.org/abs/2308.15964",
    "authors": [
      "Paul Cardosi",
      "Bérenger Bramas"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.15973",
    "title": "Demo: A Digital Twin of the 5G Radio Access Network for Anomaly  Detection Functionality",
    "abstract": "Recently, the concept of digital twins (DTs) has received significant attention within the realm of 5G/6G. This demonstration shows an innovative DT design and implementation framework tailored toward integration within the 5G infrastructure. The proposed DT enables near real-time anomaly detection capability pertaining to user connectivity. It empowers the 5G system to proactively execute decisions for resource control and connection restoration. ",
    "url": "https://arxiv.org/abs/2308.15973",
    "authors": [
      "Peizheng Li",
      "Adnan Aijaz",
      "Tim Farnham",
      "Sajida Gufran",
      "Sita Chintalapati"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15979",
    "title": "Fine-Grained Socioeconomic Prediction from Satellite Images with  Distributional Adjustment",
    "abstract": "While measuring socioeconomic indicators is critical for local governments to make informed policy decisions, such measurements are often unavailable at fine-grained levels like municipality. This study employs deep learning-based predictions from satellite images to close the gap. We propose a method that assigns a socioeconomic score to each satellite image by capturing the distributional behavior observed in larger areas based on the ground truth. We train an ordinal regression scoring model and adjust the scores to follow the common power law within and across regions. Evaluation based on official statistics in South Korea shows that our method outperforms previous models in predicting population and employment size at both the municipality and grid levels. Our method also demonstrates robust performance in districts with uneven development, suggesting its potential use in developing countries where reliable, fine-grained data is scarce. ",
    "url": "https://arxiv.org/abs/2308.15979",
    "authors": [
      "Donghyun Ahn",
      "Minhyuk Song",
      "Seungeon Lee",
      "Yubin Choi",
      "Jihee Kim",
      "Sangyoon Park",
      "Hyunjoo Yang",
      "Meeyoung Cha"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2308.15984",
    "title": "Learning Structure-from-Motion with Graph Attention Networks",
    "abstract": "In this paper we tackle the problem of learning Structure-from-Motion (SfM) through the use of graph attention networks. SfM is a classic computer vision problem that is solved though iterative minimization of reprojection errors, referred to as Bundle Adjustment (BA), starting from a good initialization. In order to obtain a good enough initialization to BA, conventional methods rely on a sequence of sub-problems (such as pairwise pose estimation, pose averaging or triangulation) which provides an initial solution that can then be refined using BA. In this work we replace these sub-problems by learning a model that takes as input the 2D keypoints detected across multiple views, and outputs the corresponding camera poses and 3D keypoint coordinates. Our model takes advantage of graph neural networks to learn SfM-specific primitives, and we show that it can be used for fast inference of the reconstruction for new and unseen sequences. The experimental results show that the proposed model outperforms competing learning-based methods, and challenges COLMAP while having lower runtime. ",
    "url": "https://arxiv.org/abs/2308.15984",
    "authors": [
      "Lucas Brynte",
      "José Pedro Iglesias",
      "Carl Olsson",
      "Fredrik Kahl"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15985",
    "title": "Vision-Based Traffic Accident Detection and Anticipation: A Survey",
    "abstract": "Traffic accident detection and anticipation is an obstinate road safety problem and painstaking efforts have been devoted. With the rapid growth of video data, Vision-based Traffic Accident Detection and Anticipation (named Vision-TAD and Vision-TAA) become the last one-mile problem for safe driving and surveillance safety. However, the long-tailed, unbalanced, highly dynamic, complex, and uncertain properties of traffic accidents form the Out-of-Distribution (OOD) feature for Vision-TAD and Vision-TAA. Current AI development may focus on these OOD but important problems. What has been done for Vision-TAD and Vision-TAA? What direction we should focus on in the future for this problem? A comprehensive survey is important. We present the first survey on Vision-TAD in the deep learning era and the first-ever survey for Vision-TAA. The pros and cons of each research prototype are discussed in detail during the investigation. In addition, we also provide a critical review of 31 publicly available benchmarks and related evaluation metrics. Through this survey, we want to spawn new insights and open possible trends for Vision-TAD and Vision-TAA tasks. ",
    "url": "https://arxiv.org/abs/2308.15985",
    "authors": [
      "Jianwu Fang",
      "iahuan Qiao",
      "Jianru Xue",
      "Zhengguo Li"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.15990",
    "title": "Dual-path Transformer Based Neural Beamformer for Target Speech  Extraction",
    "abstract": "Neural beamformers, integrating both pre-separation and beamforming modules, have shown impressive efficacy in the target speech extraction task. Nevertheless, the performance of these beamformers is inherently constrained by the predictive accuracy of the pre-separation module. In this paper, we introduce a neural beamformer underpinned by a dual-path transformer. Initially, we harness the cross-attention mechanism in the time domain, extracting pivotal spatial information related to beamforming from the noisy covariance matrix. Subsequently, in the frequency domain, the self-attention mechanism is employed to bolster the model's capacity to process frequency-specific details. By design, our model circumvents the influence of pre-separation modules, delivering the performance in a more holistic end-to-end fashion. Experimental results reveal that our model not only surpasses contemporary leading neural beamforming algorithms in separation performance, but also achieves this with a notable reduction in parameter count. ",
    "url": "https://arxiv.org/abs/2308.15990",
    "authors": [
      "Aoqi Guo",
      "Sichong Qian",
      "Baoxiang Li",
      "Dazhi Gao"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2308.15992",
    "title": "AI-powered Fraud Detection in Decentralized Finance: A Project Life  Cycle Perspective",
    "abstract": "In recent years, blockchain technology has introduced decentralized finance (DeFi) as an alternative to traditional financial systems. DeFi aims to create a transparent and efficient financial ecosystem using smart contracts and emerging decentralized applications. However, the growing popularity of DeFi has made it a target for fraudulent activities, resulting in losses of billions of dollars due to various types of frauds. To address these issues, researchers have explored the potential of artificial intelligence (AI) approaches to detect such fraudulent activities. Yet, there is a lack of a systematic survey to organize and summarize those existing works and to identify the future research opportunities. In this survey, we provide a systematic taxonomy of various frauds in the DeFi ecosystem, categorized by the different stages of a DeFi project's life cycle: project development, introduction, growth, maturity, and decline. This taxonomy is based on our finding: many frauds have strong correlations in the stage of the DeFi project. According to the taxonomy, we review existing AI-powered detection methods, including statistical modeling, natural language processing and other machine learning techniques, etc. We find that fraud detection in different stages employs distinct types of methods and observe the commendable performance of tree-based and graph-related models in tackling fraud detection tasks. By analyzing the challenges and trends, we present the findings to provide proactive suggestion and guide future research in DeFi fraud detection. We believe that this survey is able to support researchers, practitioners, and regulators in establishing a secure and trustworthy DeFi ecosystem. ",
    "url": "https://arxiv.org/abs/2308.15992",
    "authors": [
      "Bingqiao Luo",
      "Zhen Zhang",
      "Qian Wang",
      "Anli Ke",
      "Shengliang Lu",
      "Bingsheng He"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2308.16055",
    "title": "AsyncET: Asynchronous Learning for Knowledge Graph Entity Typing with  Auxiliary Relations",
    "abstract": "Knowledge graph entity typing (KGET) is a task to predict the missing entity types in knowledge graphs (KG). Previously, KG embedding (KGE) methods tried to solve the KGET task by introducing an auxiliary relation, 'hasType', to model the relationship between entities and their types. However, a single auxiliary relation has limited expressiveness for diverse entity-type patterns. We improve the expressiveness of KGE methods by introducing multiple auxiliary relations in this work. Similar entity types are grouped to reduce the number of auxiliary relations and improve their capability to model entity-type patterns with different granularities. With the presence of multiple auxiliary relations, we propose a method adopting an Asynchronous learning scheme for Entity Typing, named AsyncET, which updates the entity and type embeddings alternatively to keep the learned entity embedding up-to-date and informative for entity type prediction. Experiments are conducted on two commonly used KGET datasets to show that the performance of KGE methods on the KGET task can be substantially improved by the proposed multiple auxiliary relations and asynchronous embedding learning. Furthermore, our method has a significant advantage over state-of-the-art methods in model sizes and time complexity. ",
    "url": "https://arxiv.org/abs/2308.16055",
    "authors": [
      "Yun-Cheng Wang",
      "Xiou Ge",
      "Bin Wang",
      "C.-C. Jay Kuo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16060",
    "title": "Text-to-OverpassQL: A Natural Language Interface for Complex Geodata  Querying of OpenStreetMap",
    "abstract": "We present Text-to-OverpassQL, a task designed to facilitate a natural language interface for querying geodata from OpenStreetMap (OSM). The Overpass Query Language (OverpassQL) allows users to formulate complex database queries and is widely adopted in the OSM ecosystem. Generating Overpass queries from natural language input serves multiple use-cases. It enables novice users to utilize OverpassQL without prior knowledge, assists experienced users with crafting advanced queries, and enables tool-augmented large language models to access information stored in the OSM database. In order to assess the performance of current sequence generation models on this task, we propose OverpassNL, a dataset of 8,352 queries with corresponding natural language inputs. We further introduce task specific evaluation metrics and ground the evaluation of the Text-to-OverpassQL task by executing the queries against the OSM database. We establish strong baselines by finetuning sequence-to-sequence models and adapting large language models with in-context examples. The detailed evaluation reveals strengths and weaknesses of the considered learning strategies, laying the foundations for further research into the Text-to-OverpassQL task. ",
    "url": "https://arxiv.org/abs/2308.16060",
    "authors": [
      "Michael Staniek",
      "Raphael Schumann",
      "Maike Züfle",
      "Stefan Riezler"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Databases (cs.DB)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.16067",
    "title": "Consensus of state of the art mortality prediction models: From  all-cause mortality to sudden death prediction",
    "abstract": "Worldwide, many millions of people die suddenly and unexpectedly each year, either with or without a prior history of cardiovascular disease. Such events are sparse (once in a lifetime), many victims will not have had prior investigations for cardiac disease and many different definitions of sudden death exist. Accordingly, sudden death is hard to predict. This analysis used NHS Electronic Health Records (EHRs) for people aged $\\geq$50 years living in the Greater Glasgow and Clyde (GG\\&C) region in 2010 (n = 380,000) to try to overcome these challenges. We investigated whether medical history, blood tests, prescription of medicines, and hospitalisations might, in combination, predict a heightened risk of sudden death. We compared the performance of models trained to predict either sudden death or all-cause mortality. We built six models for each outcome of interest: three taken from state-of-the-art research (BEHRT, Deepr and Deep Patient), and three of our own creation. We trained these using two different data representations: a language-based representation, and a sparse temporal matrix. We used global interpretability to understand the most important features of each model, and compare how much agreement there was amongst models using Rank Biased Overlap. It is challenging to account for correlated variables without increasing the complexity of the interpretability technique. We overcame this by clustering features into groups and comparing the most important groups for each model. We found the agreement between models to be much higher when accounting for correlated variables. Our analysis emphasises the challenge of predicting sudden death and emphasises the need for better understanding and interpretation of machine learning models applied to healthcare applications. ",
    "url": "https://arxiv.org/abs/2308.16067",
    "authors": [
      "Dr Yola Jones",
      "Dr Fani Deligianni",
      "Dr Jeff Dalton",
      "Dr Pierpaolo Pellicori",
      "Professor John G F Cleland"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16081",
    "title": "Abstract Fractional Cauchy Problem: Existence of Propagators and  Inhomogeneous Solution Representation",
    "abstract": "We consider a Cauchy problem for the inhomogeneous differential equation given in terms of an unbounded linear operator $A$ and the Caputo fractional derivative of order $\\alpha \\in (0, 2)$ in time. The previously known representation of the mild solution to such a problem does not have a conventional variation-of-constants like form, with the propagator derived from the associated homogeneous problem. Instead, it relies on the existence of two propagators with different analytical properties. This fact limits theoretical and especially numerical applicability of the existing solution representation. Here, we propose an alternative representation of the mild solution to the given problem that consolidates the solution formulas for sub-parabolic, parabolic and sub-hyperbolic equations with a positive sectorial operator $A$ and non-zero initial data. The new representation is solely based on the propagator of the homogeneous problem and, therefore, can be considered as a more natural fractional extension of the solution to the classical parabolic Cauchy problem. By exploiting a trade-off between the regularity assumptions on the initial data in terms of the fractional powers of $A$ and the regularity assumptions on the right-hand side in time, we show that the proposed solution formula is strongly convergent for $t \\geq 0$ under considerably weaker assumptions compared to the standard results from the literature. Crucially, the achieved relaxation of space regularity assumptions ensures that the new solution representation is practically feasible for any $\\alpha \\in (0, 2)$ and is amenable to the numerical evaluation using uniformly accurate quadrature-based algorithms. ",
    "url": "https://arxiv.org/abs/2308.16081",
    "authors": [
      "Dmytro Sytnyk",
      "Barbara Wohlmuth"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Analysis of PDEs (math.AP)",
      "Dynamical Systems (math.DS)",
      "Functional Analysis (math.FA)"
    ]
  },
  {
    "id": "arXiv:2308.16083",
    "title": "Learned Image Reasoning Prior Penetrates Deep Unfolding Network for  Panchromatic and Multi-Spectral Image Fusion",
    "abstract": "The success of deep neural networks for pan-sharpening is commonly in a form of black box, lacking transparency and interpretability. To alleviate this issue, we propose a novel model-driven deep unfolding framework with image reasoning prior tailored for the pan-sharpening task. Different from existing unfolding solutions that deliver the proximal operator networks as the uncertain and vague priors, our framework is motivated by the content reasoning ability of masked autoencoders (MAE) with insightful designs. Specifically, the pre-trained MAE with spatial masking strategy, acting as intrinsic reasoning prior, is embedded into unfolding architecture. Meanwhile, the pre-trained MAE with spatial-spectral masking strategy is treated as the regularization term within loss function to constrain the spatial-spectral consistency. Such designs penetrate the image reasoning prior into deep unfolding networks while improving its interpretability and representation capability. The uniqueness of our framework is that the holistic learning process is explicitly integrated with the inherent physical mechanism underlying the pan-sharpening task. Extensive experiments on multiple satellite datasets demonstrate the superiority of our method over the existing state-of-the-art approaches. Code will be released at \\url{https://manman1995.github.io/}. ",
    "url": "https://arxiv.org/abs/2308.16083",
    "authors": [
      "Man Zhou",
      "Jie Huang",
      "Naishan Zheng",
      "Chongyi Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.16089",
    "title": "Application of Zone Method based Machine Learning and Physics-Informed  Neural Networks in Reheating Furnaces",
    "abstract": "Despite the high economic relevance of Foundation Industries, certain components like Reheating furnaces within their manufacturing chain are energy-intensive. Notable energy consumption reduction could be obtained by reducing the overall heating time in furnaces. Computer-integrated Machine Learning (ML) and Artificial Intelligence (AI) powered control systems in furnaces could be enablers in achieving the Net-Zero goals in Foundation Industries for sustainable manufacturing. In this work, due to the infeasibility of achieving good quality data in scenarios like reheating furnaces, classical Hottel's zone method based computational model has been used to generate data for ML and Deep Learning (DL) based model training via regression. It should be noted that the zone method provides an elegant way to model the physical phenomenon of Radiative Heat Transfer (RHT), the dominating heat transfer mechanism in high-temperature processes inside heating furnaces. Using this data, an extensive comparison among a wide range of state-of-the-art, representative ML and DL methods has been made against their temperature prediction performances in varying furnace environments. Owing to their holistic balance among inference times and model performance, DL stands out among its counterparts. To further enhance the Out-Of-Distribution (OOD) generalization capability of the trained DL models, we propose a Physics-Informed Neural Network (PINN) by incorporating prior physical knowledge using a set of novel Energy-Balance regularizers. Our setup is a generic framework, is geometry-agnostic of the 3D structure of the underlying furnace, and as such could accommodate any standard ML regression model, to serve as a Digital Twin of the underlying physical processes, for transitioning Foundation Industries towards Industry 4.0. ",
    "url": "https://arxiv.org/abs/2308.16089",
    "authors": [
      "Ujjal Kr Dutta",
      "Aldo Lipani",
      "Chuan Wang",
      "Yukun Hu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.16122",
    "title": "Spatial Graph Coarsening: Weather and Weekday Prediction with London's  Bike-Sharing Service using GNN",
    "abstract": "This study introduced the use of Graph Neural Network (GNN) for predicting the weather and weekday of a day in London, from the dataset of Santander Cycles bike-sharing system as a graph classification task. The proposed GNN models newly introduced (i) a concatenation operator of graph features with trained node embeddings and (ii) a graph coarsening operator based on geographical contiguity, namely \"Spatial Graph Coarsening\". With the node features of land-use characteristics and number of households around the bike stations and graph features of temperatures in the city, our proposed models outperformed the baseline model in cross-entropy loss and accuracy of the validation dataset. ",
    "url": "https://arxiv.org/abs/2308.16122",
    "authors": [
      "Yuta Sato",
      "Pak Hei Lam",
      "Shruti Gupta",
      "Fareesah Hussain"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16145",
    "title": "CircleFormer: Circular Nuclei Detection in Whole Slide Images with  Circle Queries and Attention",
    "abstract": "Both CNN-based and Transformer-based object detection with bounding box representation have been extensively studied in computer vision and medical image analysis, but circular object detection in medical images is still underexplored. Inspired by the recent anchor free CNN-based circular object detection method (CircleNet) for ball-shape glomeruli detection in renal pathology, in this paper, we present CircleFormer, a Transformer-based circular medical object detection with dynamic anchor circles. Specifically, queries with circle representation in Transformer decoder iteratively refine the circular object detection results, and a circle cross attention module is introduced to compute the similarity between circular queries and image features. A generalized circle IoU (gCIoU) is proposed to serve as a new regression loss of circular object detection as well. Moreover, our approach is easy to generalize to the segmentation task by adding a simple segmentation branch to CircleFormer. We evaluate our method in circular nuclei detection and segmentation on the public MoNuSeg dataset, and the experimental results show that our method achieves promising performance compared with the state-of-the-art approaches. The effectiveness of each component is validated via ablation studies as well. Our code is released at: \\url{https://github.com/zhanghx-iim-ahu/CircleFormer}. ",
    "url": "https://arxiv.org/abs/2308.16145",
    "authors": [
      "Hengxu Zhang",
      "Pengpeng Liang",
      "Zhiyong Sun",
      "Bo Song",
      "Erkang Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16154",
    "title": "MMVP: Motion-Matrix-based Video Prediction",
    "abstract": "A central challenge of video prediction lies where the system has to reason the objects' future motions from image frames while simultaneously maintaining the consistency of their appearances across frames. This work introduces an end-to-end trainable two-stream video prediction framework, Motion-Matrix-based Video Prediction (MMVP), to tackle this challenge. Unlike previous methods that usually handle motion prediction and appearance maintenance within the same set of modules, MMVP decouples motion and appearance information by constructing appearance-agnostic motion matrices. The motion matrices represent the temporal similarity of each and every pair of feature patches in the input frames, and are the sole input of the motion prediction module in MMVP. This design improves video prediction in both accuracy and efficiency, and reduces the model size. Results of extensive experiments demonstrate that MMVP outperforms state-of-the-art systems on public data sets by non-negligible large margins (about 1 db in PSNR, UCF Sports) in significantly smaller model sizes (84% the size or smaller). Please refer to https://github.com/Kay1794/MMVP-motion-matrix-based-video-prediction for the official code and the datasets used in this paper. ",
    "url": "https://arxiv.org/abs/2308.16154",
    "authors": [
      "Yiqi Zhong",
      "Luming Liang",
      "Ilya Zharkov",
      "Ulrich Neumann"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16160",
    "title": "Occ$^2$Net: Robust Image Matching Based on 3D Occupancy Estimation for  Occluded Regions",
    "abstract": "Image matching is a fundamental and critical task in various visual applications, such as Simultaneous Localization and Mapping (SLAM) and image retrieval, which require accurate pose estimation. However, most existing methods ignore the occlusion relations between objects caused by camera motion and scene structure. In this paper, we propose Occ$^2$Net, a novel image matching method that models occlusion relations using 3D occupancy and infers matching points in occluded regions. Thanks to the inductive bias encoded in the Occupancy Estimation (OE) module, it greatly simplifies bootstrapping of a multi-view consistent 3D representation that can then integrate information from multiple views. Together with an Occlusion-Aware (OA) module, it incorporates attention layers and rotation alignment to enable matching between occluded and visible points. We evaluate our method on both real-world and simulated datasets and demonstrate its superior performance over state-of-the-art methods on several metrics, especially in occlusion scenarios. ",
    "url": "https://arxiv.org/abs/2308.16160",
    "authors": [
      "Miao Fan",
      "Mingrui Chen",
      "Chen Hu",
      "Shuchang Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.16180",
    "title": "Framework and Methodology for Verification of a Complex Scientific  Simulation Software, Flash-X",
    "abstract": "Computational science relies on scientific software as its primary instrument for scientific discovery. Therefore, similar to the use of other types of scientific instruments, correct software and the correct operation of the software is necessary for executing rigorous scientific investigations. Scientific software verification can be especially difficult, as users typically need to modify the software as part of a scientific study. Systematic methodologies for building test suites for scientific software are rare in the literature. Here, we describe a methodology that we have developed for Flash-X, a community simulation software for multiple scientific domains, that has composable components that can be permuted and combined in a multitude of ways to generate a wide range of applications. Ensuring sufficient code coverage by a test suite is particularly challenging due to this composability. Our methodology includes a consideration of trade-offs between meeting software quality goals, developer productivity, and meeting the scientific goals of the Flash-X user community. ",
    "url": "https://arxiv.org/abs/2308.16180",
    "authors": [
      "Akash Dhruv",
      "Rajeev Jain",
      "Jared O'Neal",
      "Klaus Weide",
      "Anshu Dubey"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.16187",
    "title": "Boosting Detection in Crowd Analysis via Underutilized Output Features",
    "abstract": "Detection-based methods have been viewed unfavorably in crowd analysis due to their poor performance in dense crowds. However, we argue that the potential of these methods has been underestimated, as they offer crucial information for crowd analysis that is often ignored. Specifically, the area size and confidence score of output proposals and bounding boxes provide insight into the scale and density of the crowd. To leverage these underutilized features, we propose Crowd Hat, a plug-and-play module that can be easily integrated with existing detection models. This module uses a mixed 2D-1D compression technique to refine the output features and obtain the spatial and numerical distribution of crowd-specific information. Based on these features, we further propose region-adaptive NMS thresholds and a decouple-then-align paradigm that address the major limitations of detection-based methods. Our extensive evaluations on various crowd analysis tasks, including crowd counting, localization, and detection, demonstrate the effectiveness of utilizing output features and the potential of detection-based methods in crowd analysis. ",
    "url": "https://arxiv.org/abs/2308.16187",
    "authors": [
      "Shaokai Wu",
      "Fengyu Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15484",
    "title": "Dynamic Dual-Graph Fusion Convolutional Network For Alzheimer's Disease  Diagnosis",
    "abstract": "In this paper, a dynamic dual-graph fusion convolutional network is proposed to improve Alzheimer's disease (AD) diagnosis performance. The following are the paper's main contributions: (a) propose a novel dynamic GCN architecture, which is an end-to-end pipeline for diagnosis of the AD task; (b) the proposed architecture can dynamically adjust the graph structure for GCN to produce better diagnosis outcomes by learning the optimal underlying latent graph; (c) incorporate feature graph learning and dynamic graph learning, giving those useful features of subjects more weight while decreasing the weights of other noise features. Experiments indicate that our model provides flexibility and stability while achieving excellent classification results in AD diagnosis. ",
    "url": "https://arxiv.org/abs/2308.15484",
    "authors": [
      "Fanshi Li",
      "Zhihui Wang",
      "Yifan Guo",
      "Congcong Liu",
      "Yanjie Zhu",
      "Yihang Zhou",
      "Jun Li",
      "Dong Liang",
      "Haifeng Wang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2308.15564",
    "title": "Learning Sequential Information in Task-based fMRI for Synthetic Data  Augmentation",
    "abstract": "Insufficiency of training data is a persistent issue in medical image analysis, especially for task-based functional magnetic resonance images (fMRI) with spatio-temporal imaging data acquired using specific cognitive tasks. In this paper, we propose an approach for generating synthetic fMRI sequences that can then be used to create augmented training datasets in downstream learning tasks. To synthesize high-resolution task-specific fMRI, we adapt the $\\alpha$-GAN structure, leveraging advantages of both GAN and variational autoencoder models, and propose different alternatives in aggregating temporal information. The synthetic images are evaluated from multiple perspectives including visualizations and an autism spectrum disorder (ASD) classification task. The results show that the synthetic task-based fMRI can provide effective data augmentation in learning the ASD classification task. ",
    "url": "https://arxiv.org/abs/2308.15564",
    "authors": [
      "Jiyao Wang",
      "Nicha C. Dvornek",
      "Lawrence H. Staib",
      "James S. Duncan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15590",
    "title": "String graphs with precise number of intersections",
    "abstract": "A string graph is an intersection graph of curves in the plane. A $k$-string graph is a graph with a string representation in which every pair of curves intersects in at most $k$ points. We introduce the class of $(=k)$-string graphs as a further restriction of $k$-string graphs by requiring that every two curves intersect in either zero or precisely $k$ points. We study the hierarchy of these graphs, showing that for any $k\\geq 1$, $(=k)$-string graphs are a subclass of $(=k+2)$-string graphs as well as of $(=4k)$-string graphs; however, there are no other inclusions between the classes of $(=k)$-string and $(=\\ell)$-string graphs apart from those that are implied by the above rules. In particular, the classes of $(=k)$-string graphs and $(=k+1)$-string graphs are incomparable by inclusion for any $k$, and the class of $(=2)$-string graphs is not contained in the class of $(=2\\ell+1)$-string graphs for any $\\ell$. ",
    "url": "https://arxiv.org/abs/2308.15590",
    "authors": [
      "Petr Chmel",
      "Vít Jelínek"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2308.15640",
    "title": "Identifying Constitutive Parameters for Complex Hyperelastic Solids  using Physics-Informed Neural Networks",
    "abstract": "Identifying constitutive parameters in engineering and biological materials, particularly those with intricate geometries and mechanical behaviors, remains a longstanding challenge. The recent advent of Physics-Informed Neural Networks (PINNs) offers promising solutions, but current frameworks are often limited to basic constitutive laws and encounter practical constraints when combined with experimental data. In this paper, we introduce a new PINN-based framework designed to identify material parameters for soft materials, specifically those exhibiting complex constitutive behaviors, under large deformation in plane stress conditions. Distinctively, our model emphasizes training PINNs with multi-modal time-dependent experimental datasets consisting of full-field deformation and loading history, ensuring algorithm robustness even amidst noisy data. Our results reveal that our framework can accurately identify constitutive parameters of the incompressible Arruda-Boyce model for samples with intricate geometries, maintaining an error below 5%, even with an experimental noise level of 5%. We believe our framework sets the stage for a transformative approach in modulus identification for complex solids, especially for those with geometrical and constitutive intricate. ",
    "url": "https://arxiv.org/abs/2308.15640",
    "authors": [
      "Siyuan Song",
      "Hanxun Jin"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15712",
    "title": "Exploring Deep Learning for Full-disk Solar Flare Prediction with  Empirical Insights from Guided Grad-CAM Explanations",
    "abstract": "This study progresses solar flare prediction research by presenting a full-disk deep-learning model to forecast $\\geq$M-class solar flares and evaluating its efficacy on both central (within $\\pm$70$^\\circ$) and near-limb (beyond $\\pm$70$^\\circ$) events, showcasing qualitative assessment of post hoc explanations for the model's predictions, and providing empirical findings from human-centered quantitative assessments of these explanations. Our model is trained using hourly full-disk line-of-sight magnetogram images to predict $\\geq$M-class solar flares within the subsequent 24-hour prediction window. Additionally, we apply the Guided Gradient-weighted Class Activation Mapping (Guided Grad-CAM) attribution method to interpret our model's predictions and evaluate the explanations. Our analysis unveils that full-disk solar flare predictions correspond with active region characteristics. The following points represent the most important findings of our study: (1) Our deep learning models achieved an average true skill statistic (TSS) of $\\sim$0.51 and a Heidke skill score (HSS) of $\\sim$0.38, exhibiting skill to predict solar flares where for central locations the average recall is $\\sim$0.75 (recall values for X- and M-class are 0.95 and 0.73 respectively) and for the near-limb flares the average recall is $\\sim$0.52 (recall values for X- and M-class are 0.74 and 0.50 respectively); (2) qualitative examination of the model's explanations reveals that it discerns and leverages features linked to active regions in both central and near-limb locations within full-disk magnetograms to produce respective predictions. In essence, our models grasp the shape and texture-based properties of flaring active regions, even in proximity to limb areas -- a novel and essential capability with considerable significance for operational forecasting systems. ",
    "url": "https://arxiv.org/abs/2308.15712",
    "authors": [
      "Chetraj Pandey",
      "Anli Ji",
      "Trisha Nandakumar",
      "Rafal A. Angryk",
      "Berkay Aydin"
    ],
    "subjectives": [
      "Solar and Stellar Astrophysics (astro-ph.SR)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15805",
    "title": "Design of Coherent Passive Quantum Equalizers Using Robust Control  Theory",
    "abstract": "The paper develops a methodology for the design of coherent equalizing filters for quantum communication channels. Given a linear quantum system model of a quantum communication channel, the aim is to obtain another quantum system which, when coupled with the original system, mitigates degrading effects of the environment. The main result of the paper is a systematic equalizer synthesis algorithm which relies on methods of state-space robust control design via semidefinite programming. ",
    "url": "https://arxiv.org/abs/2308.15805",
    "authors": [
      "V. Ugrinovskii",
      "M.R. James"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2308.15822",
    "title": "AMDNet23: A combined deep Contour-based Convolutional Neural Network and  Long Short Term Memory system to diagnose Age-related Macular Degeneration",
    "abstract": "In light of the expanding population, an automated framework of disease detection can assist doctors in the diagnosis of ocular diseases, yields accurate, stable, rapid outcomes, and improves the success rate of early detection. The work initially intended the enhancing the quality of fundus images by employing an adaptive contrast enhancement algorithm (CLAHE) and Gamma correction. In the preprocessing techniques, CLAHE elevates the local contrast of the fundus image and gamma correction increases the intensity of relevant features. This study operates on a AMDNet23 system of deep learning that combined the neural networks made up of convolutions (CNN) and short-term and long-term memory (LSTM) to automatically detect aged macular degeneration (AMD) disease from fundus ophthalmology. In this mechanism, CNN is utilized for extracting features and LSTM is utilized to detect the extracted features. The dataset of this research is collected from multiple sources and afterward applied quality assessment techniques, 2000 experimental fundus images encompass four distinct classes equitably. The proposed hybrid deep AMDNet23 model demonstrates to detection of AMD ocular disease and the experimental result achieved an accuracy 96.50%, specificity 99.32%, sensitivity 96.5%, and F1-score 96.49.0%. The system achieves state-of-the-art findings on fundus imagery datasets to diagnose AMD ocular disease and findings effectively potential of our method. ",
    "url": "https://arxiv.org/abs/2308.15822",
    "authors": [
      "Md. Aiyub Ali",
      "Md. Shakhawat Hossain",
      "Md.Kawar Hossain",
      "Subhadra Soumi Sikder",
      "Sharun Akter Khushbu",
      "Mirajul Islam"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15881",
    "title": "Interpretability-guided Data Augmentation for Robust Segmentation in  Multi-centre Colonoscopy Data",
    "abstract": "Multi-centre colonoscopy images from various medical centres exhibit distinct complicating factors and overlays that impact the image content, contingent on the specific acquisition centre. Existing Deep Segmentation networks struggle to achieve adequate generalizability in such data sets, and the currently available data augmentation methods do not effectively address these sources of data variability. As a solution, we introduce an innovative data augmentation approach centred on interpretability saliency maps, aimed at enhancing the generalizability of Deep Learning models within the realm of multi-centre colonoscopy image segmentation. The proposed augmentation technique demonstrates increased robustness across different segmentation models and domains. Thorough testing on a publicly available multi-centre dataset for polyp detection demonstrates the effectiveness and versatility of our approach, which is observed both in quantitative and qualitative results. The code is publicly available at: https://github.com/nki-radiology/interpretability_augmentation ",
    "url": "https://arxiv.org/abs/2308.15881",
    "authors": [
      "Valentina Corbetta",
      "Regina Beets-Tan",
      "Wilson Silva"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15904",
    "title": "Forbidden patterns of graphs 12-representable by pattern-avoiding words",
    "abstract": "A graph $G = (\\{1, 2, \\ldots, n\\}, E)$ is $12$-representable if there is a word $w$ over $\\{1, 2, \\ldots, n\\}$ such that two vertices $i$ and $j$ with $i < j$ are adjacent if and only if every $j$ occurs before every $i$ in $w$. These graphs have been shown to be equivalent to the complements of simple-triangle graphs. This equivalence provides a characterization in terms of forbidden patterns in vertex orderings as well as a polynomial-time recognition algorithm. The class of $12$-representable graphs was introduced by Jones et al. (2015) as a variant of word-representable graphs. A general research direction for word-representable graphs suggested by Kitaev and Lozin (2015) is to study graphs representable by some specific types of words. For instance, Gao, Kitaev, and Zhang (2017) and Mandelshtam (2019) investigated word-representable graphs represented by pattern-avoiding words. Following this research direction, this paper studies $12$-representable graphs represented by words that avoid a pattern $p$. Such graphs are trivial when $p$ is of length $2$. When $p = 111$, $121$, $231$, and $321$, the classes of such graphs are equivalent to well-known classes, such as trivially perfect graphs and bipartite permutation graphs. For the cases where $p = 123$, $132$, and $211$, this paper provides forbidden pattern characterizations. ",
    "url": "https://arxiv.org/abs/2308.15904",
    "authors": [
      "Asahi Takaoka"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2308.16124",
    "title": "Towards Robust Solvers for Nuclear Fusion Simulations Using JOREK: A  Numerical Analysis Perspective",
    "abstract": "One of the most well-established codes for modeling non-linear Magnetohydrodynamics (MHD) for tokamak reactors is JOREK, which solves these equations with a B\\'ezier surface based finite element method. This code produces a highly sparse but also very large linear system. The main solver behind the code uses the Generalized Minimum Residual Method (GMRES) with a physics-based preconditioner, but even with the preconditioner there are issues with memory and computation costs and the solver does not always converge well. This work contains the first thorough study of the mathematical properties of the underlying linear system. It enables us to diagnose and pinpoint the cause of hampered convergence. In particular, analyzing the spectral properties of the matrix and the preconditioned system with numerical linear algebra techniques, will open the door to research and investigate more performant solver strategies, such as projection methods. ",
    "url": "https://arxiv.org/abs/2308.16124",
    "authors": [
      "Alex Quinlan",
      "Vandana Dwarka",
      "Ihor Holod",
      "Matthias Hoelzl"
    ],
    "subjectives": [
      "Plasma Physics (physics.plasm-ph)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2001.10474",
    "title": "Coagent Networks Revisited",
    "abstract": " Comments: Reformatted paper significantly and clarified results on the asynchronous case ",
    "url": "https://arxiv.org/abs/2001.10474",
    "authors": [
      "Modjtaba Shokrian Zini",
      "Mohammad Pedramfar",
      "Matthew Riemer",
      "Ahmadreza Moradipari",
      "Miao Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2007.11513",
    "title": "A class of graphs with large rankwidth",
    "abstract": " Title: A class of graphs with large rankwidth ",
    "url": "https://arxiv.org/abs/2007.11513",
    "authors": [
      "Chính Hoàng",
      "Nicolas Trotignon"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2011.01710",
    "title": "BCGGAN: Ballistocardiogram artifact removal in simultaneous EEG-fMRI  using generative adversarial network",
    "abstract": " Title: BCGGAN: Ballistocardiogram artifact removal in simultaneous EEG-fMRI  using generative adversarial network ",
    "url": "https://arxiv.org/abs/2011.01710",
    "authors": [
      "Guang Lin",
      "Jianhai Zhang",
      "Yuxi Liu",
      "Tianyang Gao",
      "Wanzeng Kong",
      "Xu Lei",
      "Tao Qiu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.11069",
    "title": "Roughness Index for Loss Landscapes of Neural Network Models of Partial  Differential Equations",
    "abstract": " Title: Roughness Index for Loss Landscapes of Neural Network Models of Partial  Differential Equations ",
    "url": "https://arxiv.org/abs/2103.11069",
    "authors": [
      "Keke Wu",
      "Xiangru Jian",
      "Rui Du",
      "Jingrun Chen",
      "Xiang Zhou"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2204.07000",
    "title": "Solving AC Power Flow with Graph Neural Networks under Realistic  Constraints",
    "abstract": " Title: Solving AC Power Flow with Graph Neural Networks under Realistic  Constraints ",
    "url": "https://arxiv.org/abs/2204.07000",
    "authors": [
      "Luis Böttcher",
      "Hinrikus Wolf",
      "Bastian Jung",
      "Philipp Lutat",
      "Marc Trageser",
      "Oliver Pohl",
      "Andreas Ulbig",
      "Martin Grohe"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.09398",
    "title": "Case-Aware Adversarial Training",
    "abstract": " Title: Case-Aware Adversarial Training ",
    "url": "https://arxiv.org/abs/2204.09398",
    "authors": [
      "Mingyuan Fan",
      "Yang Liu",
      "Cen Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.11141",
    "title": "Deep neural networks on diffeomorphism groups for optimal shape  reparameterization",
    "abstract": " Comments: 36 pages, 11 figures. Accepted by BIT Numerical Mathematics, not yet published ",
    "url": "https://arxiv.org/abs/2207.11141",
    "authors": [
      "Elena Celledoni",
      "Helge Glöckner",
      "Jørgen Riseth",
      "Alexander Schmeding"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Differential Geometry (math.DG)"
    ]
  },
  {
    "id": "arXiv:2208.12672",
    "title": "Flexible Vertical Federated Learning with Heterogeneous Parties",
    "abstract": " Title: Flexible Vertical Federated Learning with Heterogeneous Parties ",
    "url": "https://arxiv.org/abs/2208.12672",
    "authors": [
      "Timothy Castiglia",
      "Shiqiang Wang",
      "Stacy Patterson"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2209.12871",
    "title": "Variationally Mimetic Operator Networks",
    "abstract": " Comments: 49 pages, 18 figures, 1 Appendix ",
    "url": "https://arxiv.org/abs/2209.12871",
    "authors": [
      "Dhruv Patel",
      "Deep Ray",
      "Michael R. A. Abdelmalik",
      "Thomas J. R. Hughes",
      "Assad A. Oberai"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.14624",
    "title": "Is Complexity Required for Neural Network Pruning? A Case Study on  Global Magnitude Pruning",
    "abstract": " Title: Is Complexity Required for Neural Network Pruning? A Case Study on  Global Magnitude Pruning ",
    "url": "https://arxiv.org/abs/2209.14624",
    "authors": [
      "Manas Gupta",
      "Efe Camci",
      "Vishandi Rudy Keneta",
      "Abhishek Vaidyanathan",
      "Ritwik Kanodia",
      "Chuan-Sheng Foo",
      "Wu Min",
      "Lin Jie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.05152",
    "title": "TriangleNet: Edge Prior Augmented Network for Semantic Segmentation  through Cross-Task Consistency",
    "abstract": " Comments: Accepted for publication in the journal \"International Journal of Intelligent Systems\" ",
    "url": "https://arxiv.org/abs/2210.05152",
    "authors": [
      "Dan Zhang",
      "Rui Zheng",
      "Luosang Gadeng",
      "Pei Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.10264",
    "title": "SignReLU neural network and its approximation ability",
    "abstract": " Title: SignReLU neural network and its approximation ability ",
    "url": "https://arxiv.org/abs/2210.10264",
    "authors": [
      "Jianfei Li",
      "Han Feng",
      "Ding-Xuan Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Science and Game Theory (cs.GT)",
      "Image and Video Processing (eess.IV)",
      "Functional Analysis (math.FA)"
    ]
  },
  {
    "id": "arXiv:2211.01772",
    "title": "Collaborative Honeypot Defense in UAV Networks: A Learning-Based Game  Approach",
    "abstract": " Comments: Accepted Aug. 28, 2023 by IEEE Transactions on Information Forensics & Security. arXiv admin note: text overlap with arXiv:2209.13815 ",
    "url": "https://arxiv.org/abs/2211.01772",
    "authors": [
      "Yuntao Wang",
      "Zhou Su",
      "Abderrahim Benslimane",
      "Qichao Xu",
      "Minghui Dai",
      "Ruidong Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2211.10085",
    "title": "Identifying Unique Causal Network from Nonstationary Time Series",
    "abstract": " Comments: This manuscript are submitted so that other researchers can follow. The code of this work is available at: this https URL Many thanks for supports! ",
    "url": "https://arxiv.org/abs/2211.10085",
    "authors": [
      "Mingyu Kang",
      "Duxin Chen",
      "Ning Meng",
      "Gang Yan",
      "Wenwu Yu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.16098",
    "title": "Three-stage binarization of color document images based on discrete  wavelet transform and generative adversarial networks",
    "abstract": " Title: Three-stage binarization of color document images based on discrete  wavelet transform and generative adversarial networks ",
    "url": "https://arxiv.org/abs/2211.16098",
    "authors": [
      "Rui-Yang Ju",
      "Yu-Shian Lin",
      "Chih-Chia Chen",
      "Chun-Tse Chien",
      "Jen-Shiun Chiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.06074",
    "title": "Regression with Label Differential Privacy",
    "abstract": " Comments: Appeared at ICLR '23, 28 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2212.06074",
    "authors": [
      "Badih Ghazi",
      "Pritish Kamath",
      "Ravi Kumar",
      "Ethan Leeman",
      "Pasin Manurangsi",
      "Avinash Varadarajan",
      "Chiyuan Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2212.08108",
    "title": "Dataflow Analysis-Inspired Deep Learning for Efficient Vulnerability  Detection",
    "abstract": " Comments: 11 pages, 9 figures. Accepted as a conference paper at ICSE 2024 ",
    "url": "https://arxiv.org/abs/2212.08108",
    "authors": [
      "Benjamin Steenhoek",
      "Hongyang Gao",
      "Wei Le"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08491",
    "title": "Modeling Moral Choices in Social Dilemmas with Multi-Agent Reinforcement  Learning",
    "abstract": " Comments: Accepted at IJCAI 2023 (32nd International Joint Conference on Artificial Intelligence - Macao, S.A.R.) ",
    "url": "https://arxiv.org/abs/2301.08491",
    "authors": [
      "Elizaveta Tennant",
      "Stephen Hailes",
      "Mirco Musolesi"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.11418",
    "title": "Parkinson gait modelling from an anomaly deep representation",
    "abstract": " Comments: Journal not submitted to any editorial ",
    "url": "https://arxiv.org/abs/2301.11418",
    "authors": [
      "Edgar Rangel",
      "Fabio Martinez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2302.08811",
    "title": "G-Signatures: Global Graph Propagation With Randomized Signatures",
    "abstract": " Comments: 7 pages (+ appendix); 4 figures ",
    "url": "https://arxiv.org/abs/2302.08811",
    "authors": [
      "Bernhard Schäfl",
      "Lukas Gruber",
      "Johannes Brandstetter",
      "Sepp Hochreiter"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.12161",
    "title": "Distributed State Estimation for Jointly Observable Linear Systems over  Time-varying Networks",
    "abstract": " Comments: 12 pages,12 figures ",
    "url": "https://arxiv.org/abs/2302.12161",
    "authors": [
      "Shimin Wang",
      "Martin Guay"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2303.02698",
    "title": "Robust affine point matching via quadratic assignment on Grassmannians",
    "abstract": " Comments: 8 pages, 23 figures; GitHub repository at (this https URL) ",
    "url": "https://arxiv.org/abs/2303.02698",
    "authors": [
      "Alexander Kolpakov",
      "Michael Werman"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.04150",
    "title": "Evolutionary Reinforcement Learning: A Survey",
    "abstract": " Title: Evolutionary Reinforcement Learning: A Survey ",
    "url": "https://arxiv.org/abs/2303.04150",
    "authors": [
      "Hui Bai",
      "Ran Cheng",
      "Yaochu Jin"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.07543",
    "title": "WDiscOOD: Out-of-Distribution Detection via Whitened Linear Discriminant  Analysis",
    "abstract": " Comments: Accepted by ICCV 2023. Code is available at: this https URL ",
    "url": "https://arxiv.org/abs/2303.07543",
    "authors": [
      "Yiye Chen",
      "Yunzhi Lin",
      "Ruinian Xu",
      "Patricio A. Vela"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.12247",
    "title": "Exploring the Benefits of Visual Prompting in Differential Privacy",
    "abstract": " Comments: Published at ICCV 2023 ",
    "url": "https://arxiv.org/abs/2303.12247",
    "authors": [
      "Yizhe Li",
      "Yu-Lin Tsai",
      "Xuebin Ren",
      "Chia-Mu Yu",
      "Pin-Yu Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.17783",
    "title": "Uncertainty-Aware Source-Free Adaptive Image Super-Resolution with  Wavelet Augmentation Transformer",
    "abstract": " Comments: 9 pages, 7 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2303.17783",
    "authors": [
      "Yuang Ai",
      "Xiaoqiang Zhou",
      "Huaibo Huang",
      "Lei Zhang",
      "Ran He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.17895",
    "title": "EA-LSS: Edge-aware Lift-splat-shot Framework for 3D BEV Object Detection",
    "abstract": " Title: EA-LSS: Edge-aware Lift-splat-shot Framework for 3D BEV Object Detection ",
    "url": "https://arxiv.org/abs/2303.17895",
    "authors": [
      "Haotian Hu",
      "Fanyi Wang",
      "Jingwen Su",
      "Yaonong Wang",
      "Laifeng Hu",
      "Weiye Fang",
      "Jingwei Xu",
      "Zhiwang Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.04027",
    "title": "Estimating 3D Dental Structures using Simulated Panoramic Radiographs  and Neural Ray Tracing",
    "abstract": " Comments: 20 pages, 16 figures ",
    "url": "https://arxiv.org/abs/2304.04027",
    "authors": [
      "Sihwa Park",
      "Seongjun Kim",
      "Doeyoung Kwon",
      "Yohan Jang",
      "In-Seok Song",
      "Seungjun Baek"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.09490",
    "title": "Neural Network Quantisation for Faster Homomorphic Encryption",
    "abstract": " Comments: 5 pages, 2 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2304.09490",
    "authors": [
      "Wouter Legiest",
      "Jan-Pieter D'Anvers",
      "Furkan Turan",
      "Michiel Van Beirendonck",
      "Ingrid Verbauwhede"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.10755",
    "title": "Interpretable and Robust AI in EEG Systems: A Survey",
    "abstract": " Title: Interpretable and Robust AI in EEG Systems: A Survey ",
    "url": "https://arxiv.org/abs/2304.10755",
    "authors": [
      "Xinliang Zhou",
      "Chenyu Liu",
      "Liming Zhai",
      "Ziyu Jia",
      "Cuntai Guan",
      "Yang Liu"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.02422",
    "title": "GAMIVAL: Video Quality Prediction on Mobile Cloud Gaming Content",
    "abstract": " Comments: Accepted to IEEE SPL 2023. The implementation of GAMIVAL has been made available online: this https URL ",
    "url": "https://arxiv.org/abs/2305.02422",
    "authors": [
      "Yu-Chih Chen",
      "Avinab Saha",
      "Chase Davis",
      "Bo Qiu",
      "Xiaoming Wang",
      "Rahul Gowda",
      "Ioannis Katsavounidis",
      "Alan C. Bovik"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2305.04466",
    "title": "Generalized Universal Domain Adaptation with Generative Flow Networks",
    "abstract": " Title: Generalized Universal Domain Adaptation with Generative Flow Networks ",
    "url": "https://arxiv.org/abs/2305.04466",
    "authors": [
      "Didi Zhu",
      "Yinchuan Li",
      "Yunfeng Shao",
      "Jianye Hao",
      "Fei Wu",
      "Kun Kuang",
      "Jun Xiao",
      "Chao Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.18221",
    "title": "GazeGNN: A Gaze-Guided Graph Neural Network for Chest X-ray  Classification",
    "abstract": " Comments: WACV 2024 ",
    "url": "https://arxiv.org/abs/2305.18221",
    "authors": [
      "Bin Wang",
      "Hongyi Pan",
      "Armstrong Aboah",
      "Zheyuan Zhang",
      "Elif Keles",
      "Drew Torigian",
      "Baris Turkbey",
      "Elizabeth Krupinski",
      "Jayaram Udupa",
      "Ulas Bagci"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.01762",
    "title": "Pre-trained transformer for adversarial purification",
    "abstract": " Title: Pre-trained transformer for adversarial purification ",
    "url": "https://arxiv.org/abs/2306.01762",
    "authors": [
      "Kai Wu",
      "Yujian Betterest Li",
      "Xiaoyu Zhang",
      "Handing Wang",
      "Jing Liu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.02415",
    "title": "Top-Down Network Combines Back-Propagation with Attention",
    "abstract": " Title: Top-Down Network Combines Back-Propagation with Attention ",
    "url": "https://arxiv.org/abs/2306.02415",
    "authors": [
      "Roy Abel",
      "Shimon Ullman"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.06237",
    "title": "Beyond Weights: Deep learning in Spiking Neural Networks with pure  synaptic-delay training",
    "abstract": " Comments: Published at International Conference on Neuromorphic Systems (ICONS) 2023 ",
    "url": "https://arxiv.org/abs/2306.06237",
    "authors": [
      "Edoardo W. Grappolini",
      "Anand Subramoney"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2306.10720",
    "title": "Exploring the Relationship between Samples and Masks for Robust Defect  Localization",
    "abstract": " Title: Exploring the Relationship between Samples and Masks for Robust Defect  Localization ",
    "url": "https://arxiv.org/abs/2306.10720",
    "authors": [
      "Jiang Lin",
      "Yaping Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.10799",
    "title": "SelfTalk: A Self-Supervised Commutative Training Diagram to Comprehend  3D Talking Faces",
    "abstract": " Comments: Accepted by ACM MM 2023 ",
    "url": "https://arxiv.org/abs/2306.10799",
    "authors": [
      "Ziqiao Peng",
      "Yihao Luo",
      "Yue Shi",
      "Hao Xu",
      "Xiangyu Zhu",
      "Jun He",
      "Hongyan Liu",
      "Zhaoxin Fan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.01927",
    "title": "Safe Connectivity Maintenance in Underactuated Multi-Agent Networks for  Dynamic Oceanic Environments",
    "abstract": " Comments: 8 pages, submitted to 2023 IEEE 62th Annual Conference on Decision and Control (CDC) Nicolas Hoischen and Marius Wiggert contributed equally to this work ",
    "url": "https://arxiv.org/abs/2307.01927",
    "authors": [
      "Nicolas Hoischen",
      "Marius Wiggert",
      "Claire J. Tomlin"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2307.09829",
    "title": "What do neural networks learn in image classification? A frequency  shortcut perspective",
    "abstract": " Comments: Accepted at ICCV2023 ",
    "url": "https://arxiv.org/abs/2307.09829",
    "authors": [
      "Shunxin Wang",
      "Raymond Veldhuis",
      "Christoph Brune",
      "Nicola Strisciuglio"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.15428",
    "title": "Implicit neural representation for change detection",
    "abstract": " Comments: Main article is 10 pages + 6 pages of supplementary. Conference style paper ",
    "url": "https://arxiv.org/abs/2307.15428",
    "authors": [
      "Peter Naylor",
      "Diego Di Carlo",
      "Arianna Traviglia",
      "Makoto Yamada",
      "Marco Fiorucci"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.02562",
    "title": "Food Classification using Joint Representation of Visual and Textual  Data",
    "abstract": " Comments: Updated results and discussions to be posted and some sections needed to be expanded ",
    "url": "https://arxiv.org/abs/2308.02562",
    "authors": [
      "Prateek Mittal",
      "Puneet Goyal",
      "Joohi Chauhan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.09884",
    "title": "A Transformer-based Framework For Multi-variate Time Series: A Remaining  Useful Life Prediction Use Case",
    "abstract": " Title: A Transformer-based Framework For Multi-variate Time Series: A Remaining  Useful Life Prediction Use Case ",
    "url": "https://arxiv.org/abs/2308.09884",
    "authors": [
      "Oluwaseyi Ogunfowora",
      "Homayoun Najjaran"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.10028",
    "title": "Voucher Abuse Detection with Prompt-based Fine-tuning on Graph Neural  Networks",
    "abstract": " Comments: 7 pages, Accepted by CIKM23 Applied Research Track ",
    "url": "https://arxiv.org/abs/2308.10028",
    "authors": [
      "Zhihao Wen",
      "Yuan Fang",
      "Yihan Liu",
      "Yang Guo",
      "Shuji Hao"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2308.10421",
    "title": "UniM$^2$AE: Multi-modal Masked Autoencoders with Unified 3D  Representation for 3D Perception in Autonomous Driving",
    "abstract": " Comments: Code available at this https URL ",
    "url": "https://arxiv.org/abs/2308.10421",
    "authors": [
      "Jian Zou",
      "Tianyu Huang",
      "Guanglei Yang",
      "Zhenhua Guo",
      "Wangmeng Zuo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.10966",
    "title": "Decentralized Multi-Robot Social Navigation in Constrained Environments  via Game-Theoretic Control Barrier Functions",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2306.08815 ",
    "url": "https://arxiv.org/abs/2308.10966",
    "authors": [
      "Rohan Chandra",
      "Vrushabh Zinage",
      "Efstathios Bakolas",
      "Joydeep Biswas",
      "Peter Stone"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.12315",
    "title": "Trustworthy Representation Learning Across Domains",
    "abstract": " Comments: 38 pages, 15 figures ",
    "url": "https://arxiv.org/abs/2308.12315",
    "authors": [
      "Ronghang Zhu",
      "Dongliang Guo",
      "Daiqing Qi",
      "Zhixuan Chu",
      "Xiang Yu",
      "Sheng Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.13604",
    "title": "Network science Ising states of matter",
    "abstract": " Comments: 17 pages, 18 figures ",
    "url": "https://arxiv.org/abs/2308.13604",
    "authors": [
      "Hanlin Sun",
      "Rajat Kumar Panda",
      "Roberto Verdel",
      "Alex Rodriguez",
      "Marcello Dalmonte",
      "Ginestra Bianconi"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Social and Information Networks (cs.SI)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2308.14306",
    "title": "Evaluating the Robustness to Instructions of Large Language Models",
    "abstract": " Comments: In our study, erroneous data analysis inadvertently led to misleading outcomes. Incorrect variables were included, distorting results. This emphasizes the significance of robust data processing and analysis techniques in research ",
    "url": "https://arxiv.org/abs/2308.14306",
    "authors": [
      "Yuansheng Ni",
      "Sichao Jiang",
      "Xinyu wu",
      "Hui Shen",
      "Yuli Zhou"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.14359",
    "title": "Effect of Attention and Self-Supervised Speech Embeddings on  Non-Semantic Speech Tasks",
    "abstract": " Comments: Accepted to appear at ACM Multimedia 2023 Multimedia Grand Challenges Track ",
    "url": "https://arxiv.org/abs/2308.14359",
    "authors": [
      "Payal Mohapatra",
      "Akash Pandey",
      "Yueyuan Sui",
      "Qi Zhu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.14806",
    "title": "Domain-based user embedding for competing events on social media",
    "abstract": " Comments: Computational social science application ",
    "url": "https://arxiv.org/abs/2308.14806",
    "authors": [
      "Wentao Xu",
      "Kazutoshi Sasahara"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2308.14815",
    "title": "Distributionally Robust Statistical Verification with Imprecise Neural  Networks",
    "abstract": " Title: Distributionally Robust Statistical Verification with Imprecise Neural  Networks ",
    "url": "https://arxiv.org/abs/2308.14815",
    "authors": [
      "Souradeep Dutta",
      "Michele Caprio",
      "Vivian Lin",
      "Matthew Cleaveland",
      "Kuk Jin Jang",
      "Ivan Ruchkin",
      "Oleg Sokolsky",
      "Insup Lee"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.14847",
    "title": "NSF: Neural Surface Fields for Human Modeling from Monocular Depth",
    "abstract": " Comments: Accpted to ICCV 2023; Homepage at: this https URL ",
    "url": "https://arxiv.org/abs/2308.14847",
    "authors": [
      "Yuxuan Xue",
      "Bharat Lal Bhatnagar",
      "Riccardo Marin",
      "Nikolaos Sarafianos",
      "Yuanlu Xu",
      "Gerard Pons-Moll",
      "Tony Tung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15005",
    "title": "Few-Shot Object Detection via Synthetic Features with Optimal Transport",
    "abstract": " Title: Few-Shot Object Detection via Synthetic Features with Optimal Transport ",
    "url": "https://arxiv.org/abs/2308.15005",
    "authors": [
      "Anh-Khoa Nguyen Vu",
      "Thanh-Toan Do",
      "Vinh-Tiep Nguyen",
      "Tam Le",
      "Minh-Triet Tran",
      "Tam V. Nguyen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]