[
  {
    "id": "arXiv:2309.14345",
    "title": "Bias Assessment and Mitigation in LLM-based Code Generation",
    "abstract": "Utilizing state-of-the-art Large Language Models (LLMs), automatic code generation models play a pivotal role in enhancing the productivity and efficiency of software development coding procedures. As the adoption of LLMs becomes more widespread in software coding ecosystems, a pressing issue has emerged: does the generated code contain social biases, such as those related to age, gender, and race? This issue concerns the integrity, fairness, and ethical foundation of software applications that depend on the code generated by these models, yet is under-explored in the literature. This paper presents a novel bias assessment framework that is specifically designed for code generation tasks. Based on this framework, we conduct an extensive evaluation on the bias of nine state-of-the-art LLM-based code generation models. Our findings reveal that first, 31.45\\% to 79.93\\% code functions generated by our evaluated code generation models are biased, and 9.68\\% to 37.37\\% code functions' functionality are affected by the bias, which means biases not only exist in code generation models but in some cases, directly affect the functionality of the generated code, posing risks of unintended and possibly harmful software behaviors. To mitigate bias from code generation models, we propose three mitigation strategies, which can decrease the biased code ratio to a very low level of 0.4\\% to 4.57\\%. ",
    "url": "https://arxiv.org/abs/2309.14345",
    "authors": [
      "Dong Huang",
      "Qingwen Bu",
      "Jie Zhang",
      "Xiaofei Xie",
      "Junjie Chen",
      "Heming Cui"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.14348",
    "title": "Defending Against Alignment-Breaking Attacks via Robustly Aligned LLM",
    "abstract": "Recently, Large Language Models (LLMs) have made significant advancements and are now widely used across various domains. Unfortunately, there has been a rising concern that LLMs can be misused to generate harmful or malicious content. Though a line of research has focused on aligning LLMs with human values and preventing them from producing inappropriate content, such alignments are usually vulnerable and can be bypassed by alignment-breaking attacks via adversarially optimized or handcrafted jailbreaking prompts. In this work, we introduce a Robustly Aligned LLM (RA-LLM) to defend against potential alignment-breaking attacks. RA-LLM can be directly constructed upon an existing aligned LLM with a robust alignment checking function, without requiring any expensive retraining or fine-tuning process of the original LLM. Furthermore, we also provide a theoretical analysis for RA-LLM to verify its effectiveness in defending against alignment-breaking attacks. Through real-world experiments on open-source large language models, we demonstrate that RA-LLM can successfully defend against both state-of-the-art adversarial prompts and popular handcrafted jailbreaking prompts by reducing their attack success rates from nearly 100\\% to around 10\\% or less. ",
    "url": "https://arxiv.org/abs/2309.14348",
    "authors": [
      "Bochuan Cao",
      "Yuanpu Cao",
      "Lu Lin",
      "Jinghui Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.14379",
    "title": "Machine-assisted mixed methods: augmenting humanities and social  sciences with artificial intelligence",
    "abstract": "The increasing capacities of large language models (LLMs) present an unprecedented opportunity to scale up data analytics in the humanities and social sciences, augmenting and automating qualitative analytic tasks previously typically allocated to human labor. This contribution proposes a systematic mixed methods framework to harness qualitative analytic expertise, machine scalability, and rigorous quantification, with attention to transparency and replicability. 16 machine-assisted case studies are showcased as proof of concept. Tasks include linguistic and discourse analysis, lexical semantic change detection, interview analysis, historical event cause inference and text mining, detection of political stance, text and idea reuse, genre composition in literature and film; social network inference, automated lexicography, missing metadata augmentation, and multimodal visual cultural analytics. In contrast to the focus on English in the emerging LLM applicability literature, many examples here deal with scenarios involving smaller languages and historical texts prone to digitization distortions. In all but the most difficult tasks requiring expert knowledge, generative LLMs can demonstrably serve as viable research instruments. LLM (and human) annotations may contain errors and variation, but the agreement rate can and should be accounted for in subsequent statistical modeling; a bootstrapping approach is discussed. The replications among the case studies illustrate how tasks previously requiring potentially months of team effort and complex computational pipelines, can now be accomplished by an LLM-assisted scholar in a fraction of the time. Importantly, this approach is not intended to replace, but to augment researcher knowledge and skills. With these opportunities in sight, qualitative expertise and the ability to pose insightful questions have arguably never been more critical. ",
    "url": "https://arxiv.org/abs/2309.14379",
    "authors": [
      "Andres Karjus"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2309.14381",
    "title": "Survey of Social Bias in Vision-Language Models",
    "abstract": "In recent years, the rapid advancement of machine learning (ML) models, particularly transformer-based pre-trained models, has revolutionized Natural Language Processing (NLP) and Computer Vision (CV) fields. However, researchers have discovered that these models can inadvertently capture and reinforce social biases present in their training datasets, leading to potential social harms, such as uneven resource allocation and unfair representation of specific social groups. Addressing these biases and ensuring fairness in artificial intelligence (AI) systems has become a critical concern in the ML community. The recent introduction of pre-trained vision-and-language (VL) models in the emerging multimodal field demands attention to the potential social biases present in these models as well. Although VL models are susceptible to social bias, there is a limited understanding compared to the extensive discussions on bias in NLP and CV. This survey aims to provide researchers with a high-level insight into the similarities and differences of social bias studies in pre-trained models across NLP, CV, and VL. By examining these perspectives, the survey aims to offer valuable guidelines on how to approach and mitigate social bias in both unimodal and multimodal settings. The findings and recommendations presented here can benefit the ML community, fostering the development of fairer and non-biased AI models in various applications and research endeavors. ",
    "url": "https://arxiv.org/abs/2309.14381",
    "authors": [
      "Nayeon Lee",
      "Yejin Bang",
      "Holy Lovenia",
      "Samuel Cahyawijaya",
      "Wenliang Dai",
      "Pascale Fung"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.14390",
    "title": "Early Churn Prediction from Large Scale User-Product Interaction Time  Series",
    "abstract": "User churn, characterized by customers ending their relationship with a business, has profound economic consequences across various Business-to-Customer scenarios. For numerous system-to-user actions, such as promotional discounts and retention campaigns, predicting potential churners stands as a primary objective. In volatile sectors like fantasy sports, unpredictable factors such as international sports events can influence even regular spending habits. Consequently, while transaction history and user-product interaction are valuable in predicting churn, they demand deep domain knowledge and intricate feature engineering. Additionally, feature development for churn prediction systems can be resource-intensive, particularly in production settings serving 200m+ users, where inference pipelines largely focus on feature engineering. This paper conducts an exhaustive study on predicting user churn using historical data. We aim to create a model forecasting customer churn likelihood, facilitating businesses in comprehending attrition trends and formulating effective retention plans. Our approach treats churn prediction as multivariate time series classification, demonstrating that combining user activity and deep neural networks yields remarkable results for churn prediction in complex business-to-customer contexts. ",
    "url": "https://arxiv.org/abs/2309.14390",
    "authors": [
      "Shamik Bhattacharjee",
      "Utkarsh Thukral",
      "Nilesh Patil"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.14451",
    "title": "Methods of quantifying specialized knowledge and network rewiring",
    "abstract": "Technological innovations are a major driver of economic development that depend on the exchange of knowledge and ideas among those with unique but complementary specialized knowledge and knowhow. However, measurement of specialized knowledge embedded in technologists, scientists and entrepreneurs in the knowledge economy presents an empirical challenge as both the exchange of knowledge and knowledge itself remain difficult to observe. We develop novel measures of specialized knowledge using a unique dataset of longitudinal records of participation at technology-focused meetup events in two regional knowledge economics. Our measures of specialized knowledge can be further used to quantify the extend of knowledge spillover and network rewiring and uncover underlying social mechanisms that contribute to the development of increasingly complex and differentiated networks in maturing knowledge economies. We apply these methods in the context of the rapid morphogenesis of emerging regional technology economies in New York City and Los Angeles. ",
    "url": "https://arxiv.org/abs/2309.14451",
    "authors": [
      "Sirui Wang",
      "Michael Macy",
      "Victor Nee"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2309.14478",
    "title": "Incorporating Ensemble and Transfer Learning For An End-To-End  Auto-Colorized Image Detection Model",
    "abstract": "Image colorization is the process of colorizing grayscale images or recoloring an already-color image. This image manipulation can be used for grayscale satellite, medical and historical images making them more expressive. With the help of the increasing computation power of deep learning techniques, the colorization algorithms results are becoming more realistic in such a way that human eyes cannot differentiate between natural and colorized images. However, this poses a potential security concern, as forged or illegally manipulated images can be used illegally. There is a growing need for effective detection methods to distinguish between natural color and computer-colorized images. This paper presents a novel approach that combines the advantages of transfer and ensemble learning approaches to help reduce training time and resource requirements while proposing a model to classify natural color and computer-colorized images. The proposed model uses pre-trained branches VGG16 and Resnet50, along with Mobile Net v2 or Efficientnet feature vectors. The proposed model showed promising results, with accuracy ranging from 94.55% to 99.13% and very low Half Total Error Rate values. The proposed model outperformed existing state-of-the-art models regarding classification performance and generalization capabilities. ",
    "url": "https://arxiv.org/abs/2309.14478",
    "authors": [
      "Ahmed Samir Ragab",
      "Shereen Aly Taie",
      "Howida Youssry Abdelnaby"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.14482",
    "title": "LogGPT: Log Anomaly Detection via GPT",
    "abstract": "Detecting system anomalies based on log data is important for ensuring the security and reliability of computer systems. Recently, deep learning models have been widely used for log anomaly detection. The core idea is to model the log sequences as natural language and adopt deep sequential models, such as LSTM or Transformer, to encode the normal patterns in log sequences via language modeling. However, there is a gap between language modeling and anomaly detection as the objective of training a sequential model via a language modeling loss is not directly related to anomaly detection. To fill up the gap, we propose LogGPT, a novel framework that employs GPT for log anomaly detection. LogGPT is first trained to predict the next log entry based on the preceding sequence. To further enhance the performance of LogGPT, we propose a novel reinforcement learning strategy to finetune the model specifically for the log anomaly detection task. The experimental results on three datasets show that LogGPT significantly outperforms existing state-of-the-art approaches. ",
    "url": "https://arxiv.org/abs/2309.14482",
    "authors": [
      "Xiao Han",
      "Shuhan Yuan",
      "Mohamed Trabelsi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.14497",
    "title": "Interaction-Aware Decision-Making for Autonomous Vehicles in Forced  Merging Scenario Leveraging Social Psychology Factors",
    "abstract": "Understanding the intention of vehicles in the surrounding traffic is crucial for an autonomous vehicle to successfully accomplish its driving tasks in complex traffic scenarios such as highway forced merging. In this paper, we consider a behavioral model that incorporates both social behaviors and personal objectives of the interacting drivers. Leveraging this model, we develop a receding-horizon control-based decision-making strategy, that estimates online the other drivers' intentions using Bayesian filtering and incorporates predictions of nearby vehicles' behaviors under uncertain intentions. The effectiveness of the proposed decision-making strategy is demonstrated and evaluated based on simulation studies in comparison with a game theoretic controller and a real-world traffic dataset. ",
    "url": "https://arxiv.org/abs/2309.14497",
    "authors": [
      "Xiao Li",
      "Kaiwen Liu",
      "H. Eric Tseng",
      "Anouck Girard",
      "Ilya Kolmanovsky"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2309.14510",
    "title": "An Empathy-Based Sandbox Approach to Bridge Attitudes, Goals, Knowledge,  and Behaviors in the Privacy Paradox",
    "abstract": "The \"privacy paradox\" describes the discrepancy between users' privacy attitudes and their actual behaviors. Mitigating this discrepancy requires solutions that account for both system opaqueness and users' hesitations in testing different privacy settings due to fears of unintended data exposure. We introduce an empathy-based approach that allows users to experience how privacy behaviors may alter system outcomes in a risk-free sandbox environment from the perspective of artificially generated personas. To generate realistic personas, we introduce a novel pipeline that augments the outputs of large language models using few-shot learning, contextualization, and chain of thoughts. Our empirical studies demonstrated the adequate quality of generated personas and highlighted the changes in privacy-related applications (e.g., online advertising) caused by different personas. Furthermore, users demonstrated cognitive and emotional empathy towards the personas when interacting with our sandbox. We offered design implications for downstream applications in improving user privacy literacy and promoting behavior changes. ",
    "url": "https://arxiv.org/abs/2309.14510",
    "authors": [
      "Chaoran Chen",
      "Weijun Li",
      "Wenxin Song",
      "Yanfang Ye",
      "Yaxing Yao",
      "Toby Jia-jun Li"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2309.14516",
    "title": "UniBEV: Multi-modal 3D Object Detection with Uniform BEV Encoders for  Robustness against Missing Sensor Modalities",
    "abstract": "Multi-sensor object detection is an active research topic in automated driving, but the robustness of such detection models against missing sensor input (modality missing), e.g., due to a sudden sensor failure, is a critical problem which remains under-studied. In this work, we propose UniBEV, an end-to-end multi-modal 3D object detection framework designed for robustness against missing modalities: UniBEV can operate on LiDAR plus camera input, but also on LiDAR-only or camera-only input without retraining. To facilitate its detector head to handle different input combinations, UniBEV aims to create well-aligned Bird's Eye View (BEV) feature maps from each available modality. Unlike prior BEV-based multi-modal detection methods, all sensor modalities follow a uniform approach to resample features from the native sensor coordinate systems to the BEV features. We furthermore investigate the robustness of various fusion strategies w.r.t. missing modalities: the commonly used feature concatenation, but also channel-wise averaging, and a generalization to weighted averaging termed Channel Normalized Weights. To validate its effectiveness, we compare UniBEV to state-of-the-art BEVFusion and MetaBEV on nuScenes over all sensor input combinations. In this setting, UniBEV achieves $52.5 \\%$ mAP on average over all input combinations, significantly improving over the baselines ($43.5 \\%$ mAP on average for BEVFusion, $48.7 \\%$ mAP on average for MetaBEV). An ablation study shows the robustness benefits of fusing by weighted averaging over regular concatenation, and of sharing queries between the BEV encoders of each modality. Our code will be released upon paper acceptance. ",
    "url": "https://arxiv.org/abs/2309.14516",
    "authors": [
      "Shiming Wang",
      "Holger Caesar",
      "Liangliang Nan",
      "Julian F. P. Kooij"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.14518",
    "title": "Detach-ROCKET: Sequential feature selection for time series  classification with random convolutional kernels",
    "abstract": "Time series classification is essential in many fields, such as medicine, finance, environmental science, and manufacturing, enabling tasks like disease diagnosis, anomaly detection, and stock price prediction. Machine learning models like Recurrent Neural Networks and InceptionTime, while successful in numerous applications, can face scalability limitations due to intensive training requirements. To address this, random convolutional kernel models such as Rocket and its derivatives have emerged, simplifying training and achieving state-of-the-art performance by utilizing a large number of randomly generated features from time series data. However, due to their random nature, most of the generated features are redundant or non-informative, adding unnecessary computational load and compromising generalization. Here, we introduce Sequential Feature Detachment (SFD) as a method to identify and prune these non-essential features. SFD uses model coefficients to estimate feature importance and, unlike previous algorithms, can handle large feature sets without the need for complex hyperparameter tuning. Testing on the UCR archive demonstrates that SFD can produce models with $10\\%$ of the original features while improving $0.2\\%$ the accuracy on the test set. We also present an end-to-end procedure for determining an optimal balance between the number of features and model accuracy, called Detach-ROCKET. When applied to the largest binary UCR dataset, Detach-ROCKET is capable of reduce model size by $98.9\\%$ and increases test accuracy by $0.6\\%$. ",
    "url": "https://arxiv.org/abs/2309.14518",
    "authors": [
      "Gonzalo Uribarri",
      "Federico Barone",
      "Alessio Ansuini",
      "Erik Fransén"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.14531",
    "title": "Pixel-Grounded Prototypical Part Networks",
    "abstract": "Prototypical part neural networks (ProtoPartNNs), namely PROTOPNET and its derivatives, are an intrinsically interpretable approach to machine learning. Their prototype learning scheme enables intuitive explanations of the form, this (prototype) looks like that (testing image patch). But, does this actually look like that? In this work, we delve into why object part localization and associated heat maps in past work are misleading. Rather than localizing to object parts, existing ProtoPartNNs localize to the entire image, contrary to generated explanatory visualizations. We argue that detraction from these underlying issues is due to the alluring nature of visualizations and an over-reliance on intuition. To alleviate these issues, we devise new receptive field-based architectural constraints for meaningful localization and a principled pixel space mapping for ProtoPartNNs. To improve interpretability, we propose additional architectural improvements, including a simplified classification head. We also make additional corrections to PROTOPNET and its derivatives, such as the use of a validation set, rather than a test set, to evaluate generalization during training. Our approach, PIXPNET (Pixel-grounded Prototypical part Network), is the only ProtoPartNN that truly learns and localizes to prototypical object parts. We demonstrate that PIXPNET achieves quantifiably improved interpretability without sacrificing accuracy. ",
    "url": "https://arxiv.org/abs/2309.14531",
    "authors": [
      "Zachariah Carmichael",
      "Suhas Lohit",
      "Anoop Cherian",
      "Michael Jones",
      "Walter Scheirer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.14538",
    "title": "Dynamic Scene Graph Representation for Surgical Video",
    "abstract": "Surgical videos captured from microscopic or endoscopic imaging devices are rich but complex sources of information, depicting different tools and anatomical structures utilized during an extended amount of time. Despite containing crucial workflow information and being commonly recorded in many procedures, usage of surgical videos for automated surgical workflow understanding is still limited. In this work, we exploit scene graphs as a more holistic, semantically meaningful and human-readable way to represent surgical videos while encoding all anatomical structures, tools, and their interactions. To properly evaluate the impact of our solutions, we create a scene graph dataset from semantic segmentations from the CaDIS and CATARACTS datasets. We demonstrate that scene graphs can be leveraged through the use of graph convolutional networks (GCNs) to tackle surgical downstream tasks such as surgical workflow recognition with competitive performance. Moreover, we demonstrate the benefits of surgical scene graphs regarding the explainability and robustness of model decisions, which are crucial in the clinical setting. ",
    "url": "https://arxiv.org/abs/2309.14538",
    "authors": [
      "Felix Holm",
      "Ghazal Ghazaei",
      "Tobias Czempiel",
      "Ege Özsoy",
      "Stefan Saur",
      "Nassir Navab"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.14546",
    "title": "Fall Prediction for Bipedal Robots: The Standing Phase",
    "abstract": "This paper presents a novel approach to fall prediction for bipedal robots, specifically targeting the detection of potential falls while standing caused by abrupt, incipient, and intermittent faults. Leveraging a 1D convolutional neural network (CNN), our method aims to maximize lead time for fall prediction while minimizing false positive rates. The proposed algorithm uniquely integrates the detection of various fault types and estimates the lead time for potential falls. Our contributions include the development of an algorithm capable of detecting abrupt, incipient, and intermittent faults in full-sized robots, its implementation using both simulation and hardware data for a humanoid robot, and a method for estimating lead time. Evaluation metrics, including false positive rate, lead time, and response time, demonstrate the efficacy of our approach. Particularly, our model achieves impressive lead times and response times across different fault scenarios with a false positive rate of 0. The findings of this study hold significant implications for enhancing the safety and reliability of bipedal robotic systems. ",
    "url": "https://arxiv.org/abs/2309.14546",
    "authors": [
      "M. Eva Mungai",
      "Gokul Prabhakaran",
      "Jessy W. Grizzle"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.14547",
    "title": "Distributed Resource Allocation for D2D Multicast in Underlay Cellular  Networks",
    "abstract": "We address the problem of distributed resource allocation for multicast communication in device-to-device (D2D) enabled underlay cellular networks. The optimal resource allocation is crucial for maximizing the performance of such networks, which are limited by the severe co-channel interference between cellular users (CU) and D2D multicast groups. However, finding such optimal allocation for networks with large number of CUs and D2D users is challenging. Therefore, we propose a pragmatic scheme that allocates resources distributively, reducing signaling overhead and improving network scalability. Numerical simulations establish the efficacy of the proposed solution in improving the overall system throughout, compared to various existing schemes. ",
    "url": "https://arxiv.org/abs/2309.14547",
    "authors": [
      "Mohd Saif Ali Khan",
      "Ajay Bhardwaj",
      "Samar Agnihotri"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2309.14551",
    "title": "ADESS: A Proof-of-Work Protocol to Deter Double-Spend Attacks",
    "abstract": "A principal vulnerability of a proof-of-work (\"PoW\") blockchain is that an attacker can re-write the history of transactions by forking a previously published block and build a new chain segment containing a different sequence of transactions. If the attacker's chain has the most cumulative mining puzzle difficulty, nodes will recognize it as canonical. We propose a modification to PoW protocols, called ADESS, that contains two novel features. The first modification enables a node to identify the attacker chain by comparing the temporal sequence of blocks on competing chains. The second modification penalizes the attacker by requiring it to apply exponentially increasing hashrate in order to make its chain canonical. We demonstrate two things; (i) the expected cost of carrying out a double-spend attack is weakly higher under ADESS compared to the current PoW protocols and (ii) for any value of transaction, there is a penalty setting in ADESS that renders the expected profit of a double-spend attack negative. ",
    "url": "https://arxiv.org/abs/2309.14551",
    "authors": [
      "Daniel Aronoff",
      "Isaac Ardis"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2309.14557",
    "title": "Disruption Detection for a Cognitive Digital Supply Chain Twin Using  Hybrid Deep Learning",
    "abstract": "Purpose: Recent disruptive events, such as COVID-19 and Russia-Ukraine conflict, had a significant impact of global supply chains. Digital supply chain twins have been proposed in order to provide decision makers with an effective and efficient tool to mitigate disruption impact. Methods: This paper introduces a hybrid deep learning approach for disruption detection within a cognitive digital supply chain twin framework to enhance supply chain resilience. The proposed disruption detection module utilises a deep autoencoder neural network combined with a one-class support vector machine algorithm. In addition, long-short term memory neural network models are developed to identify the disrupted echelon and predict time-to-recovery from the disruption effect. Results: The obtained information from the proposed approach will help decision-makers and supply chain practitioners make appropriate decisions aiming at minimizing negative impact of disruptive events based on real-time disruption detection data. The results demonstrate the trade-off between disruption detection model sensitivity, encountered delay in disruption detection, and false alarms. This approach has seldom been used in recent literature addressing this issue. ",
    "url": "https://arxiv.org/abs/2309.14557",
    "authors": [
      "Mahmoud Ashraf",
      "Amr Eltawil",
      "Islam Ali"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2309.14585",
    "title": "DifAttack: Query-Efficient Black-Box Attack via Disentangled Feature  Space",
    "abstract": "This work investigates efficient score-based black-box adversarial attacks with a high Attack Success Rate (ASR) and good generalizability. We design a novel attack method based on a Disentangled Feature space, called DifAttack, which differs significantly from the existing ones operating over the entire feature space. Specifically, DifAttack firstly disentangles an image's latent feature into an adversarial feature and a visual feature, where the former dominates the adversarial capability of an image, while the latter largely determines its visual appearance. We train an autoencoder for the disentanglement by using pairs of clean images and their Adversarial Examples (AEs) generated from available surrogate models via white-box attack methods. Eventually, DifAttack iteratively optimizes the adversarial feature according to the query feedback from the victim model until a successful AE is generated, while keeping the visual feature unaltered. In addition, due to the avoidance of using surrogate models' gradient information when optimizing AEs for black-box models, our proposed DifAttack inherently possesses better attack capability in the open-set scenario, where the training dataset of the victim model is unknown. Extensive experimental results demonstrate that our method achieves significant improvements in ASR and query efficiency simultaneously, especially in the targeted attack and open-set scenarios. The code will be available at https://github.com/csjunjun/DifAttack.git soon. ",
    "url": "https://arxiv.org/abs/2309.14585",
    "authors": [
      "Liu Jun",
      "Zhou Jiantao",
      "Zeng Jiandian",
      "Jinyu Tian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.14590",
    "title": "HeLiPR: Heterogeneous LiDAR Dataset for inter-LiDAR Place Recognition  under Spatial and Temporal Variations",
    "abstract": "Place recognition is crucial for robotic localization and loop closure in simultaneous localization and mapping (SLAM). Recently, LiDARs have gained popularity due to their robust sensing capability and measurement consistency, even in the illumination-variant environment, offering an advantage over traditional imaging sensors. Spinning LiDARs are widely accepted among many types, while non-repetitive scanning patterns have recently been utilized in robotic applications. Beyond the range measurements, some LiDARs offer additional measurements, such as reflectivity, Near Infrared (NIR), and velocity (e.g., FMCW LiDARs). Despite these advancements, a noticeable dearth of datasets comprehensively reflects the broad spectrum of LiDAR configurations optimized for place recognition. To tackle this issue, our paper proposes the HeLiPR dataset, curated especially for place recognition with heterogeneous LiDAR systems, embodying spatial-temporal variations. To the best of our knowledge, the HeLiPR dataset is the first heterogeneous LiDAR dataset designed to support inter-LiDAR place recognition with both non-repetitive and spinning LiDARs, accommodating different field of view (FOV) and varying numbers of rays. Encompassing the distinct LiDAR configurations, it captures varied environments ranging from urban cityscapes to high-dynamic freeways over a month, designed to enhance the adaptability and robustness of place recognition across diverse scenarios. Notably, the HeLiPR dataset also includes trajectories that parallel sequences from MulRan, underscoring its utility for research in heterogeneous LiDAR place recognition and long-term studies. The dataset is accessible at https: //sites.google.com/view/heliprdataset. ",
    "url": "https://arxiv.org/abs/2309.14590",
    "authors": [
      "Minwoo Jung",
      "Wooseong Yang",
      "Dongjae Lee",
      "Hyeonjae Gil",
      "Giseop Kim",
      "Ayoung Kim"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.14595",
    "title": "Neural Informed RRT* with Point-based Network Guidance for Optimal  Sampling-based Path Planning",
    "abstract": "Sampling-based planning algorithms like Rapidly-exploring Random Tree (RRT) are versatile in solving path planning problems. RRT* offers asymptotical optimality but requires growing the tree uniformly over the free space, which leaves room for efficiency improvement. To accelerate convergence, informed approaches sample states in an ellipsoidal subset of the search space determined by current path cost during iteration. Learning-based alternatives model the topology of the search space and infer the states close to the optimal path to guide planning. We combine the strengths from both sides and propose Neural Informed RRT* with Point-based Network Guidance. We introduce Point-based Network to infer the guidance states, and integrate the network into Informed RRT* for guidance state refinement. We use Neural Connect to build connectivity of the guidance state set and further boost performance in challenging planning problems. Our method surpasses previous works in path planning benchmarks while preserving probabilistic completeness and asymptotical optimality. We demonstrate the deployment of our method on mobile robot navigation in the real world. ",
    "url": "https://arxiv.org/abs/2309.14595",
    "authors": [
      "Zhe Huang",
      "Hongyu Chen",
      "Katherine Driggs-Campbell"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.14610",
    "title": "Unsupervised Graph Deep Learning Reveals Emergent Flood Risk Profile of  Urban Areas",
    "abstract": "Urban flood risk emerges from complex and nonlinear interactions among multiple features related to flood hazard, flood exposure, and social and physical vulnerabilities, along with the complex spatial flood dependence relationships. Existing approaches for characterizing urban flood risk, however, are primarily based on flood plain maps, focusing on a limited number of features, primarily hazard and exposure features, without consideration of feature interactions or the dependence relationships among spatial areas. To address this gap, this study presents an integrated urban flood-risk rating model based on a novel unsupervised graph deep learning model (called FloodRisk-Net). FloodRisk-Net is capable of capturing spatial dependence among areas and complex and nonlinear interactions among flood hazards and urban features for specifying emergent flood risk. Using data from multiple metropolitan statistical areas (MSAs) in the United States, the model characterizes their flood risk into six distinct city-specific levels. The model is interpretable and enables feature analysis of areas within each flood-risk level, allowing for the identification of the three archetypes shaping the highest flood risk within each MSA. Flood risk is found to be spatially distributed in a hierarchical structure within each MSA, where the core city disproportionately bears the highest flood risk. Multiple cities are found to have high overall flood-risk levels and low spatial inequality, indicating limited options for balancing urban development and flood-risk reduction. Relevant flood-risk reduction strategies are discussed considering ways that the highest flood risk and uneven spatial distribution of flood risk are formed. ",
    "url": "https://arxiv.org/abs/2309.14610",
    "authors": [
      "Kai Yin Ali Mostafavi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2309.14615",
    "title": "Gray-box Adversarial Attack of Deep Reinforcement Learning-based Trading  Agents",
    "abstract": "In recent years, deep reinforcement learning (Deep RL) has been successfully implemented as a smart agent in many systems such as complex games, self-driving cars, and chat-bots. One of the interesting use cases of Deep RL is its application as an automated stock trading agent. In general, any automated trading agent is prone to manipulations by adversaries in the trading environment. Thus studying their robustness is vital for their success in practice. However, typical mechanism to study RL robustness, which is based on white-box gradient-based adversarial sample generation techniques (like FGSM), is obsolete for this use case, since the models are protected behind secure international exchange APIs, such as NASDAQ. In this research, we demonstrate that a \"gray-box\" approach for attacking a Deep RL-based trading agent is possible by trading in the same stock market, with no extra access to the trading agent. In our proposed approach, an adversary agent uses a hybrid Deep Neural Network as its policy consisting of Convolutional layers and fully-connected layers. On average, over three simulated trading market configurations, the adversary policy proposed in this research is able to reduce the reward values by 214.17%, which results in reducing the potential profits of the baseline by 139.4%, ensemble method by 93.7%, and an automated trading software developed by our industrial partner by 85.5%, while consuming significantly less budget than the victims (427.77%, 187.16%, and 66.97%, respectively). ",
    "url": "https://arxiv.org/abs/2309.14615",
    "authors": [
      "Foozhan Ataiefard",
      "Hadi Hemmati"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Trading and Market Microstructure (q-fin.TR)"
    ]
  },
  {
    "id": "arXiv:2309.14645",
    "title": "A nonparametric learning framework for nonlinear robust output  regulation",
    "abstract": "This paper proposes a nonparametric learning solution framework for a generic internal model design of nonlinear robust output regulation. The global robust output regulation problem for a class of nonlinear systems with output feedback subject to a nonlinear exosystem can be tackled by constructing a linear generic internal model, provided that a continuous nonlinear mapping exists. An explicit continuous nonlinear mapping was constructed recently in [1] under the assumption that the steady-state generator is linear in the exogenous signal. We further relax such an assumption to a relaxed assumption that the steady-state generator is polynomial in the exogenous signal. A nonparametric learning framework is proposed to solve a linear time-varying equation to make the nonlinear continuous mapping always exist. With the help of the proposed framework, the nonlinear robust output regulation problem can be converted into a robust non-adaptive stabilization problem for the augmented system with integral Input-to-State Stable (iISS) inverse dynamics. Moreover, a dynamic gain approach can adaptively raise the gain to a sufficiently large constant to achieve stabilization without requiring any a priori knowledge of the uncertainties appearing in the dynamics of the exosystem and the system. We further apply the nonparametric learning framework to globally reconstruct and estimate multiple sinusoidal signals with unknown frequencies without using adaptive techniques. An explicit nonlinear mapping can directly provide the estimated parameters, which will exponentially converge to the unknown frequencies. As a result, a feedforward control design is proposed to solve the output regulation using our nonparametric learning framework. ",
    "url": "https://arxiv.org/abs/2309.14645",
    "authors": [
      "Shimin Wang",
      "Martin Guay",
      "Zhiyong Chen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)",
      "Adaptation and Self-Organizing Systems (nlin.AO)"
    ]
  },
  {
    "id": "arXiv:2309.14652",
    "title": "Pricing Personalized Preferences for Privacy Protection in Constant  Function Market Makers",
    "abstract": "Constant function market makers (CFMMs) are a popular decentralized exchange mechanism and have recently been the subject of much research, but major CFMMs give traders no privacy. Prior work proposes randomly splitting and shuffling trades to give some privacy to all users [Chitra et al. 2022], or adding noise to the market state after each trade and charging a fixed `privacy fee' to all traders [Frongillo and Waggoner 2018]. In contrast, we propose a noisy CFMM mechanism where users specify personal privacy requirements and pay personalized fees. We show that the noise added for privacy protection creates additional arbitrage opportunities. We call a mechanism priceable if there exists a privacy fee that always matches the additional arbitrage loss in expectation. We show that a mechanism is priceable if and only if the noise added is zero-mean in the asset amount. We also show that priceability and setting the right fee are necessary for a mechanism to be truthful, and that this fee is inversely proportional to the CFMM's liquidity. ",
    "url": "https://arxiv.org/abs/2309.14652",
    "authors": [
      "Mohak Goyal",
      "Geoffrey Ramseyer"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2309.14670",
    "title": "DONNAv2 -- Lightweight Neural Architecture Search for Vision tasks",
    "abstract": "With the growing demand for vision applications and deployment across edge devices, the development of hardware-friendly architectures that maintain performance during device deployment becomes crucial. Neural architecture search (NAS) techniques explore various approaches to discover efficient architectures for diverse learning tasks in a computationally efficient manner. In this paper, we present the next-generation neural architecture design for computationally efficient neural architecture distillation - DONNAv2 . Conventional NAS algorithms rely on a computationally extensive stage where an accuracy predictor is learned to estimate model performance within search space. This building of accuracy predictors helps them predict the performance of models that are not being finetuned. Here, we have developed an elegant approach to eliminate building the accuracy predictor and extend DONNA to a computationally efficient setting. The loss metric of individual blocks forming the network serves as the surrogate performance measure for the sampled models in the NAS search stage. To validate the performance of DONNAv2 we have performed extensive experiments involving a range of diverse vision tasks including classification, object detection, image denoising, super-resolution, and panoptic perception network (YOLOP). The hardware-in-the-loop experiments were carried out using the Samsung Galaxy S10 mobile platform. Notably, DONNAv2 reduces the computational cost of DONNA by 10x for the larger datasets. Furthermore, to improve the quality of NAS search space, DONNAv2 leverages a block knowledge distillation filter to remove blocks with high inference costs. ",
    "url": "https://arxiv.org/abs/2309.14670",
    "authors": [
      "Sweta Priyadarshi",
      "Tianyu Jiang",
      "Hsin-Pai Cheng",
      "Sendil Krishna",
      "Viswanath Ganapathy",
      "Chirag Patel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.14673",
    "title": "ALEX: Towards Effective Graph Transfer Learning with Noisy Labels",
    "abstract": "Graph Neural Networks (GNNs) have garnered considerable interest due to their exceptional performance in a wide range of graph machine learning tasks. Nevertheless, the majority of GNN-based approaches have been examined using well-annotated benchmark datasets, leading to suboptimal performance in real-world graph learning scenarios. To bridge this gap, the present paper investigates the problem of graph transfer learning in the presence of label noise, which transfers knowledge from a noisy source graph to an unlabeled target graph. We introduce a novel technique termed Balance Alignment and Information-aware Examination (ALEX) to address this challenge. ALEX first employs singular value decomposition to generate different views with crucial structural semantics, which help provide robust node representations using graph contrastive learning. To mitigate both label shift and domain shift, we estimate a prior distribution to build subgraphs with balanced label distributions. Building on this foundation, an adversarial domain discriminator is incorporated for the implicit domain alignment of complex multi-modal distributions. Furthermore, we project node representations into a different space, optimizing the mutual information between the projected features and labels. Subsequently, the inconsistency of similarity structures is evaluated to identify noisy samples with potential overfitting. Comprehensive experiments on various benchmark datasets substantiate the outstanding superiority of the proposed ALEX in different settings. ",
    "url": "https://arxiv.org/abs/2309.14673",
    "authors": [
      "Jingyang Yuan",
      "Xiao Luo",
      "Yifang Qin",
      "Zhengyang Mao",
      "Wei Ju",
      "Ming Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2309.14674",
    "title": "Leveraging Herpangina Data to Enhance Hospital-level Prediction of  Hand-Foot-and-Mouth Disease Admissions Using UPTST",
    "abstract": "Outbreaks of hand-foot-and-mouth disease(HFMD) have been associated with significant morbidity and, in severe cases, mortality. Accurate forecasting of daily admissions of pediatric HFMD patients is therefore crucial for aiding the hospital in preparing for potential outbreaks and mitigating nosocomial transmissions. To address this pressing need, we propose a novel transformer-based model with a U-net shape, utilizing the patching strategy and the joint prediction strategy that capitalizes on insights from herpangina, a disease closely correlated with HFMD. This model also integrates representation learning by introducing reconstruction loss as an auxiliary loss. The results show that our U-net Patching Time Series Transformer (UPTST) model outperforms existing approaches in both long- and short-arm prediction accuracy of HFMD at hospital-level. Furthermore, the exploratory extension experiments show that the model's capabilities extend beyond prediction of infectious disease, suggesting broader applicability in various domains. ",
    "url": "https://arxiv.org/abs/2309.14674",
    "authors": [
      "Guoqi Yu",
      "Hailun Yao",
      "Huan Zheng",
      "Ximing Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.14675",
    "title": "FedCompass: Efficient Cross-Silo Federated Learning on Heterogeneous  Client Devices using a Computing Power Aware Scheduler",
    "abstract": "Cross-silo federated learning offers a promising solution to collaboratively train robust and generalized AI models without compromising the privacy of local datasets, e.g., healthcare, financial, as well as scientific projects that lack a centralized data facility. Nonetheless, because of the disparity of computing resources among different clients (i.e., device heterogeneity), synchronous federated learning algorithms suffer from degraded efficiency when waiting for straggler clients. Similarly, asynchronous federated learning algorithms experience degradation in the convergence rate and final model accuracy on non-identically and independently distributed (non-IID) heterogeneous datasets due to stale local models and client drift. To address these limitations in cross-silo federated learning with heterogeneous clients and data, we propose FedCompass, an innovative semi-asynchronous federated learning algorithm with a computing power aware scheduler on the server side, which adaptively assigns varying amounts of training tasks to different clients using the knowledge of the computing power of individual clients. FedCompass ensures that multiple locally trained models from clients are received almost simultaneously as a group for aggregation, effectively reducing the staleness of local models. At the same time, the overall training process remains asynchronous, eliminating prolonged waiting periods from straggler clients. Using diverse non-IID heterogeneous distributed datasets, we demonstrate that FedCompass achieves faster convergence and higher accuracy than other asynchronous algorithms while remaining more efficient than synchronous algorithms when performing federated learning on heterogeneous clients. ",
    "url": "https://arxiv.org/abs/2309.14675",
    "authors": [
      "Zilinghan Li",
      "Pranshu Chaturvedi",
      "Shilan He",
      "Han Chen",
      "Gagandeep Singh",
      "Volodymyr Kindratenko",
      "E. A. Huerta",
      "Kibaek Kim",
      "Ravi Madduri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2309.14677",
    "title": "XGV-BERT: Leveraging Contextualized Language Model and Graph Neural  Network for Efficient Software Vulnerability Detection",
    "abstract": "With the advancement of deep learning (DL) in various fields, there are many attempts to reveal software vulnerabilities by data-driven approach. Nonetheless, such existing works lack the effective representation that can retain the non-sequential semantic characteristics and contextual relationship of source code attributes. Hence, in this work, we propose XGV-BERT, a framework that combines the pre-trained CodeBERT model and Graph Neural Network (GCN) to detect software vulnerabilities. By jointly training the CodeBERT and GCN modules within XGV-BERT, the proposed model leverages the advantages of large-scale pre-training, harnessing vast raw data, and transfer learning by learning representations for training data through graph convolution. The research results demonstrate that the XGV-BERT method significantly improves vulnerability detection accuracy compared to two existing methods such as VulDeePecker and SySeVR. For the VulDeePecker dataset, XGV-BERT achieves an impressive F1-score of 97.5%, significantly outperforming VulDeePecker, which achieved an F1-score of 78.3%. Again, with the SySeVR dataset, XGV-BERT achieves an F1-score of 95.5%, surpassing the results of SySeVR with an F1-score of 83.5%. ",
    "url": "https://arxiv.org/abs/2309.14677",
    "authors": [
      "Vu Le Anh Quan",
      "Chau Thuan Phat",
      "Kiet Van Nguyen",
      "Phan The Duy",
      "Van-Hau Pham"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.14687",
    "title": "On The Effects of The Variations In Network Characteristics In Cyber  Physical Systems",
    "abstract": "The popular robotic simulator, Gazebo, lacks the feature of simulating the effects of control latency that would make it a fully-fledged cyber-physical system (CPS) simulator. The CPS that we address to measure is a robotic arm (UR5) controlled remotely with velocity commands. The main goal is to measure Quality of Control (QoC) related KPIs during various network conditions in a simulated environment. We propose a Gazebo plugin to make the above measurement feasible by making Gazebo capable to delay internal control and status messages and also to interface with external network simulators to derive even more advanced network effects. Our preliminary evaluation shows that there is certainly an effect on the behavior of the robotic arm with the introduced network latency in line with our expectations, but a more detailed further study is needed. ",
    "url": "https://arxiv.org/abs/2309.14687",
    "authors": [
      "Géza Szabó",
      "Sándor Rácz",
      "József Pető",
      "Rafael Roque Aschoff"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.14688",
    "title": "Feeder bus service design under spatially heterogeneous demand",
    "abstract": "In rapidly sprawling urban areas and booming intercity express rail networks, efficiently designed feeder bus systems are more essential than ever to transport passengers to and from trunk-line rail terminals. When the feeder service region is sufficiently large, the spatial heterogeneity in demand distribution must be considered. This paper develops continuous approximation models for optimizing a heterogeneous fixed-route feeder network in a rectangular service region next to a rail terminal. Our work enhances previous studies by: (i) optimizing heterogeneous stop spacings along with line spacings and headways; (ii) accounting for passenger boarding and alighting numbers on bus dwell times and patron transfer delays at the rail terminal; and (iii) examining the advantages of asymmetric coordination between trunk and feeder schedules in both service directions. To tackle the increased modeling complexity, we introduce a semi-analytical method that combines analytically derived properties of the optimal solution with an iterative search algorithm. Local transit agencies can readily utilize this approach to design a real fixed-route feeder system. This paper reveals many findings and insights not previously reported. For instance, integrating the heterogeneous stop spacing optimization further reduces the system cost (by 4% under specific operating conditions). The cost savings increase with demand heterogeneity but decrease with the demand rate and service region size. Choosing the layout of feeder lines where buses pick up and drop off passengers along the service region's shorter side also significantly lowers the system cost (by 6% when the service region's aspect ratio is 1 to 2). Furthermore, coordinating trunk and feeder schedules in both service directions yields an additional cost saving of up to 20%. ",
    "url": "https://arxiv.org/abs/2309.14688",
    "authors": [
      "Li Zhen",
      "Weihua Gu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2309.14690",
    "title": "On the Tensor Representation and Algebraic Homomorphism of the Neural  State Turing Machine",
    "abstract": "Recurrent neural networks (RNNs) and transformers have been shown to be Turing-complete, but this result assumes infinite precision in their hidden representations, positional encodings for transformers, and unbounded computation time in general. In practical applications, however, it is crucial to have real-time models that can recognize Turing complete grammars in a single pass. To address this issue and to better understand the true computational power of artificial neural networks (ANNs), we introduce a new class of recurrent models called the neural state Turing machine (NSTM). The NSTM has bounded weights and finite-precision connections and can simulate any Turing Machine in real-time. In contrast to prior work that assumes unbounded time and precision in weights, to demonstrate equivalence with TMs, we prove that a $13$-neuron bounded tensor RNN, coupled with third-order synapses, can model any TM class in real-time. Furthermore, under the Markov assumption, we provide a new theoretical bound for a non-recurrent network augmented with memory, showing that a tensor feedforward network with $25$th-order finite precision weights is equivalent to a universal TM. ",
    "url": "https://arxiv.org/abs/2309.14690",
    "authors": [
      "Ankur Mali",
      "Alexander Ororbia",
      "Daniel Kifer",
      "Lee Giles"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2309.14691",
    "title": "On the Computational Complexity and Formal Hierarchy of Second Order  Recurrent Neural Networks",
    "abstract": "Artificial neural networks (ANNs) with recurrence and self-attention have been shown to be Turing-complete (TC). However, existing work has shown that these ANNs require multiple turns or unbounded computation time, even with unbounded precision in weights, in order to recognize TC grammars. However, under constraints such as fixed or bounded precision neurons and time, ANNs without memory are shown to struggle to recognize even context-free languages. In this work, we extend the theoretical foundation for the $2^{nd}$-order recurrent network ($2^{nd}$ RNN) and prove there exists a class of a $2^{nd}$ RNN that is Turing-complete with bounded time. This model is capable of directly encoding a transition table into its recurrent weights, enabling bounded time computation and is interpretable by design. We also demonstrate that $2$nd order RNNs, without memory, under bounded weights and time constraints, outperform modern-day models such as vanilla RNNs and gated recurrent units in recognizing regular grammars. We provide an upper bound and a stability analysis on the maximum number of neurons required by $2$nd order RNNs to recognize any class of regular grammar. Extensive experiments on the Tomita grammars support our findings, demonstrating the importance of tensor connections in crafting computationally efficient RNNs. Finally, we show $2^{nd}$ order RNNs are also interpretable by extraction and can extract state machines with higher success rates as compared to first-order RNNs. Our results extend the theoretical foundations of RNNs and offer promising avenues for future explainable AI research. ",
    "url": "https://arxiv.org/abs/2309.14691",
    "authors": [
      "Ankur Mali",
      "Alexander Ororbia",
      "Daniel Kifer",
      "Lee Giles"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2309.14700",
    "title": "Structure Invariant Transformation for better Adversarial  Transferability",
    "abstract": "Given the severe vulnerability of Deep Neural Networks (DNNs) against adversarial examples, there is an urgent need for an effective adversarial attack to identify the deficiencies of DNNs in security-sensitive applications. As one of the prevalent black-box adversarial attacks, the existing transfer-based attacks still cannot achieve comparable performance with the white-box attacks. Among these, input transformation based attacks have shown remarkable effectiveness in boosting transferability. In this work, we find that the existing input transformation based attacks transform the input image globally, resulting in limited diversity of the transformed images. We postulate that the more diverse transformed images result in better transferability. Thus, we investigate how to locally apply various transformations onto the input image to improve such diversity while preserving the structure of image. To this end, we propose a novel input transformation based attack, called Structure Invariant Attack (SIA), which applies a random image transformation onto each image block to craft a set of diverse images for gradient calculation. Extensive experiments on the standard ImageNet dataset demonstrate that SIA exhibits much better transferability than the existing SOTA input transformation based attacks on CNN-based and transformer-based models, showing its generality and superiority in boosting transferability. Code is available at https://github.com/xiaosen-wang/SIT. ",
    "url": "https://arxiv.org/abs/2309.14700",
    "authors": [
      "Xiaosen Wang",
      "Zeliang Zhang",
      "Jianping Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.14704",
    "title": "Tile Classification Based Viewport Prediction with Multi-modal Fusion  Transformer",
    "abstract": "Viewport prediction is a crucial aspect of tile-based 360 video streaming system. However, existing trajectory based methods lack of robustness, also oversimplify the process of information construction and fusion between different modality inputs, leading to the error accumulation problem. In this paper, we propose a tile classification based viewport prediction method with Multi-modal Fusion Transformer, namely MFTR. Specifically, MFTR utilizes transformer-based networks to extract the long-range dependencies within each modality, then mine intra- and inter-modality relations to capture the combined impact of user historical inputs and video contents on future viewport selection. In addition, MFTR categorizes future tiles into two categories: user interested or not, and selects future viewport as the region that contains most user interested tiles. Comparing with predicting head trajectories, choosing future viewport based on tile's binary classification results exhibits better robustness and interpretability. To evaluate our proposed MFTR, we conduct extensive experiments on two widely used PVS-HM and Xu-Gaze dataset. MFTR shows superior performance over state-of-the-art methods in terms of average prediction accuracy and overlap ratio, also presents competitive computation efficiency. ",
    "url": "https://arxiv.org/abs/2309.14704",
    "authors": [
      "Zhihao Zhang",
      "Yiwei Chen",
      "Weizhan Zhang",
      "Caixia Yan",
      "Qinghua Zheng",
      "Qi Wang",
      "Wangdu Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2309.14731",
    "title": "Exploring the impact of automated vehicles lane-changing behavior on  urban network efficiency",
    "abstract": "While automated vehicle (AV) research has grown steadily in recent years, the impact of automated lane changing behavior on transportation systems remains a largely understudied topic. The present work aims to explore the effects of automated lane changing behavior on urban network efficiency as the penetration rate of AVs increases. To the best of the authors knowledge, this represents the first attempt to do so by isolating the effects of the lane changing behavior; this was obtained by considering AVs with automated lateral control, yet retaining the same longitudinal control characteristics of conventional vehicles (CV). An urban road network located in Hannover, Germany, was modeled with the microsimulation software SUMO, and several scenarios were analyzed, starting from a baseline with only CVs and then progressively increasing the AV penetration rate with 10% increments. Results highlight a modest, but statistically significant, decrease in system performance, with travel times increasing, and average speed and network capacity decreasing, as penetration rates increase. This was likely caused by a more prudent behavior of AVs, which accepted larger gaps than CVs when performing lane changing maneuvers. ",
    "url": "https://arxiv.org/abs/2309.14731",
    "authors": [
      "Alberto Pelizza",
      "Federico Orsini",
      "Sefa Yilmaz-Niewerth",
      "Riccardo Rossi",
      "Bernhard Friedrich"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2309.14753",
    "title": "Advanced Volleyball Stats for All Levels: Automatic Setting Tactic  Detection and Classification with a Single Camera",
    "abstract": "This paper presents PathFinder and PathFinderPlus, two novel end-to-end computer vision frameworks designed specifically for advanced setting strategy classification in volleyball matches from a single camera view. Our frameworks combine setting ball trajectory recognition with a novel set trajectory classifier to generate comprehensive and advanced statistical data. This approach offers a fresh perspective for in-game analysis and surpasses the current level of granularity in volleyball statistics. In comparison to existing methods used in our baseline PathFinder framework, our proposed ball trajectory detection methodology in PathFinderPlus exhibits superior performance for classifying setting tactics under various game conditions. This robustness is particularly advantageous in handling complex game situations and accommodating different camera angles. Additionally, our study introduces an innovative algorithm for automatic identification of the opposing team's right-side (opposite) hitter's current row (front or back) during gameplay, providing critical insights for tactical analysis. The successful demonstration of our single-camera system's feasibility and benefits makes high-level technical analysis accessible to volleyball enthusiasts of all skill levels and resource availability. Furthermore, the computational efficiency of our system allows for real-time deployment, enabling in-game strategy analysis and on-the-spot gameplan adjustments. ",
    "url": "https://arxiv.org/abs/2309.14753",
    "authors": [
      "Haotian Xia",
      "Rhys Tracy",
      "Yun Zhao",
      "Yuqing Wang",
      "Yuan-Fang Wang",
      "Weining Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.14770",
    "title": "KERMIT: Knowledge Graph Completion of Enhanced Relation Modeling with  Inverse Transformation",
    "abstract": "Knowledge graph completion is a task that revolves around filling in missing triples based on the information available in a knowledge graph. Among the current studies, text-based methods complete the task by utilizing textual descriptions of triples. However, this modeling approach may encounter limitations, particularly when the description fails to accurately and adequately express the intended meaning. To overcome these challenges, we propose the augmentation of data through two additional mechanisms. Firstly, we employ ChatGPT as an external knowledge base to generate coherent descriptions to bridge the semantic gap between the queries and answers. Secondly, we leverage inverse relations to create a symmetric graph, thereby creating extra labeling and providing supplementary information for link prediction. This approach offers additional insights into the relationships between entities. Through these efforts, we have observed significant improvements in knowledge graph completion, as these mechanisms enhance the richness and diversity of the available data, leading to more accurate results. ",
    "url": "https://arxiv.org/abs/2309.14770",
    "authors": [
      "Haotian Li",
      "Lingzhi Wang",
      "Yuliang Wei",
      "Richard Yi Da Xu",
      "Bailing Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2309.14781",
    "title": "Frugal Satellite Image Change Detection with Deep-Net Inversion",
    "abstract": "Change detection in satellite imagery seeks to find occurrences of targeted changes in a given scene taken at different instants. This task has several applications ranging from land-cover mapping, to anthropogenic activity monitory as well as climate change and natural hazard damage assessment. However, change detection is highly challenging due to the acquisition conditions and also to the subjectivity of changes. In this paper, we devise a novel algorithm for change detection based on active learning. The proposed method is based on a question and answer model that probes an oracle (user) about the relevance of changes only on a small set of critical images (referred to as virtual exemplars), and according to oracle's responses updates deep neural network (DNN) classifiers. The main contribution resides in a novel adversarial model that allows learning the most representative, diverse and uncertain virtual exemplars (as inverted preimages of the trained DNNs) that challenge (the most) the trained DNNs, and this leads to a better re-estimate of these networks in the subsequent iterations of active learning. Experiments show the out-performance of our proposed deep-net inversion against the related work. ",
    "url": "https://arxiv.org/abs/2309.14781",
    "authors": [
      "Hichem Sahbi",
      "Sebastien Deschamps"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.14792",
    "title": "Less Is More: Robust Robot Learning via Partially Observable Multi-Agent  Reinforcement Learning",
    "abstract": "In many multi-agent and high-dimensional robotic tasks, the controller can be designed in either a centralized or decentralized way. Correspondingly, it is possible to use either single-agent reinforcement learning (SARL) or multi-agent reinforcement learning (MARL) methods to learn such controllers. However, the relationship between these two paradigms remains under-studied in the literature. This work explores research questions in terms of robustness and performance of SARL and MARL approaches to the same task, in order to gain insight into the most suitable methods. We start by analytically showing the equivalence between these two paradigms under the full-state observation assumption. Then, we identify a broad subclass of \\textit{Dec-POMDP} tasks where the agents are weakly or partially interacting. In these tasks, we show that partial observations of each agent are sufficient for near-optimal decision-making. Furthermore, we propose to exploit such partially observable MARL to improve the robustness of robots when joint or agent failures occur. Our experiments on both simulated multi-agent tasks and a real robot task with a mobile manipulator validate the presented insights and the effectiveness of the proposed robust robot learning method via partially observable MARL. ",
    "url": "https://arxiv.org/abs/2309.14792",
    "authors": [
      "Wenshuai Zhao",
      "Eetu-Aleksi Rantala",
      "Joni Pajarinen",
      "Jorge Peña Queralta"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.14800",
    "title": "3D Density-Gradient based Edge Detection on Neural Radiance Fields  (NeRFs) for Geometric Reconstruction",
    "abstract": "Generating geometric 3D reconstructions from Neural Radiance Fields (NeRFs) is of great interest. However, accurate and complete reconstructions based on the density values are challenging. The network output depends on input data, NeRF network configuration and hyperparameter. As a result, the direct usage of density values, e.g. via filtering with global density thresholds, usually requires empirical investigations. Under the assumption that the density increases from non-object to object area, the utilization of density gradients from relative values is evident. As the density represents a position-dependent parameter it can be handled anisotropically, therefore processing of the voxelized 3D density field is justified. In this regard, we address geometric 3D reconstructions based on density gradients, whereas the gradients result from 3D edge detection filters of the first and second derivatives, namely Sobel, Canny and Laplacian of Gaussian. The gradients rely on relative neighboring density values in all directions, thus are independent from absolute magnitudes. Consequently, gradient filters are able to extract edges along a wide density range, almost independent from assumptions and empirical investigations. Our approach demonstrates the capability to achieve geometric 3D reconstructions with high geometric accuracy on object surfaces and remarkable object completeness. Notably, Canny filter effectively eliminates gaps, delivers a uniform point density, and strikes a favorable balance between correctness and completeness across the scenes. ",
    "url": "https://arxiv.org/abs/2309.14800",
    "authors": [
      "Miriam Jäger",
      "Boris Jutzi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.14805",
    "title": "Fine-tuning and aligning question answering models for complex  information extraction tasks",
    "abstract": "The emergence of Large Language Models (LLMs) has boosted performance and possibilities in various NLP tasks. While the usage of generative AI models like ChatGPT opens up new opportunities for several business use cases, their current tendency to hallucinate fake content strongly limits their applicability to document analysis, such as information retrieval from documents. In contrast, extractive language models like question answering (QA) or passage retrieval models guarantee query results to be found within the boundaries of an according context document, which makes them candidates for more reliable information extraction in productive environments of companies. In this work we propose an approach that uses and integrates extractive QA models for improved feature extraction of German business documents such as insurance reports or medical leaflets into a document analysis solution. We further show that fine-tuning existing German QA models boosts performance for tailored extraction tasks of complex linguistic features like damage cause explanations or descriptions of medication appearance, even with using only a small set of annotated data. Finally, we discuss the relevance of scoring metrics for evaluating information extraction tasks and deduce a combined metric from Levenshtein distance, F1-Score, Exact Match and ROUGE-L to mimic the assessment criteria from human experts. ",
    "url": "https://arxiv.org/abs/2309.14805",
    "authors": [
      "Matthias Engelbach",
      "Dennis Klau",
      "Felix Scheerer",
      "Jens Drawehn",
      "Maximilien Kintz"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.14807",
    "title": "Evaluating Soccer Match Prediction Models: A Deep Learning Approach and  Feature Optimization for Gradient-Boosted Trees",
    "abstract": "Machine learning models have become increasingly popular for predicting the results of soccer matches, however, the lack of publicly-available benchmark datasets has made model evaluation challenging. The 2023 Soccer Prediction Challenge required the prediction of match results first in terms of the exact goals scored by each team, and second, in terms of the probabilities for a win, draw, and loss. The original training set of matches and features, which was provided for the competition, was augmented with additional matches that were played between 4 April and 13 April 2023, representing the period after which the training set ended, but prior to the first matches that were to be predicted (upon which the performance was evaluated). A CatBoost model was employed using pi-ratings as the features, which were initially identified as the optimal choice for calculating the win/draw/loss probabilities. Notably, deep learning models have frequently been disregarded in this particular task. Therefore, in this study, we aimed to assess the performance of a deep learning model and determine the optimal feature set for a gradient-boosted tree model. The model was trained using the most recent five years of data, and three training and validation sets were used in a hyperparameter grid search. The results from the validation sets show that our model had strong performance and stability compared to previously published models from the 2017 Soccer Prediction Challenge for win/draw/loss prediction. ",
    "url": "https://arxiv.org/abs/2309.14807",
    "authors": [
      "Calvin Yeung",
      "Rory Bunker",
      "Rikuhei Umemoto",
      "Keisuke Fujii"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.14816",
    "title": "A Comparative Study of Population-Graph Construction Methods and Graph  Neural Networks for Brain Age Regression",
    "abstract": "The difference between the chronological and biological brain age of a subject can be an important biomarker for neurodegenerative diseases, thus brain age estimation can be crucial in clinical settings. One way to incorporate multimodal information into this estimation is through population graphs, which combine various types of imaging data and capture the associations among individuals within a population. In medical imaging, population graphs have demonstrated promising results, mostly for classification tasks. In most cases, the graph structure is pre-defined and remains static during training. However, extracting population graphs is a non-trivial task and can significantly impact the performance of Graph Neural Networks (GNNs), which are sensitive to the graph structure. In this work, we highlight the importance of a meaningful graph construction and experiment with different population-graph construction methods and their effect on GNN performance on brain age estimation. We use the homophily metric and graph visualizations to gain valuable quantitative and qualitative insights on the extracted graph structures. For the experimental evaluation, we leverage the UK Biobank dataset, which offers many imaging and non-imaging phenotypes. Our results indicate that architectures highly sensitive to the graph structure, such as Graph Convolutional Network (GCN) and Graph Attention Network (GAT), struggle with low homophily graphs, while other architectures, such as GraphSage and Chebyshev, are more robust across different homophily ratios. We conclude that static graph construction approaches are potentially insufficient for the task of brain age estimation and make recommendations for alternative research directions. ",
    "url": "https://arxiv.org/abs/2309.14816",
    "authors": [
      "Kyriaki-Margarita Bintsi",
      "Tamara T. Mueller",
      "Sophie Starck",
      "Vasileios Baltatzis",
      "Alexander Hammers",
      "Daniel Rueckert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.14829",
    "title": "A Structured Prediction Approach for Robot Imitation Learning",
    "abstract": "We propose a structured prediction approach for robot imitation learning from demonstrations. Among various tools for robot imitation learning, supervised learning has been observed to have a prominent role. Structured prediction is a form of supervised learning that enables learning models to operate on output spaces with complex structures. Through the lens of structured prediction, we show how robots can learn to imitate trajectories belonging to not only Euclidean spaces but also Riemannian manifolds. Exploiting ideas from information theory, we propose a class of loss functions based on the f-divergence to measure the information loss between the demonstrated and reproduced probabilistic trajectories. Different types of f-divergence will result in different policies, which we call imitation modes. Furthermore, our approach enables the incorporation of spatial and temporal trajectory modulation, which is necessary for robots to be adaptive to the change in working conditions. We benchmark our algorithm against state-of-the-art methods in terms of trajectory reproduction and adaptation. The quantitative evaluation shows that our approach outperforms other algorithms regarding both accuracy and efficiency. We also report real-world experimental results on learning manifold trajectories in a polishing task with a KUKA LWR robot arm, illustrating the effectiveness of our algorithmic framework. ",
    "url": "https://arxiv.org/abs/2309.14829",
    "authors": [
      "Anqing Duan",
      "Iason Batzianoulis",
      "Raffaello Camoriano",
      "Lorenzo Rosasco",
      "Daniele Pucci",
      "Aude Billard"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.14845",
    "title": "Graph Neural Network Based Method for Path Planning Problem",
    "abstract": "Sampling-based path planning is a widely used method in robotics, particularly in high-dimensional state space. Among the whole process of the path planning, collision detection is the most time-consuming operation. In this paper, we propose a learning-based path planning method that aims to reduce the number of collision detection. We develop an efficient neural network model based on Graph Neural Networks (GNN) and use the environment map as input. The model outputs weights for each neighbor based on the input and current vertex information, which are used to guide the planner in avoiding obstacles. We evaluate the proposed method's efficiency through simulated random worlds and real-world experiments, respectively. The results demonstrate that the proposed method significantly reduces the number of collision detection and improves the path planning speed in high-dimensional environments. ",
    "url": "https://arxiv.org/abs/2309.14845",
    "authors": [
      "Xingrong Diao",
      "Wenzheng Chi",
      "Jiankun Wang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2309.14846",
    "title": "Supersonic: Learning to Generate Source Code Optimisations in C/C++",
    "abstract": "Software optimization refines programs for resource efficiency while preserving functionality. Traditionally, it is a process done by developers and compilers. This paper introduces a third option, automated optimization at the source code level. We present Supersonic, a neural approach targeting minor source code modifications for optimization. Using a seq2seq model, Supersonic is trained on C/C++ program pairs ($x_{t}$, $x_{t+1}$), where $x_{t+1}$ is an optimized version of $x_{t}$, and outputs a diff. Supersonic's performance is benchmarked against OpenAI's GPT-3.5-Turbo and GPT-4 on competitive programming tasks. The experiments show that Supersonic not only outperforms both models on the code optimization task, but also minimizes the extent of change with a more than 600x smaller than GPT-3.5-Turbo and 3700x smaller than GPT-4. ",
    "url": "https://arxiv.org/abs/2309.14846",
    "authors": [
      "Zimin Chen",
      "Sen Fang",
      "Martin Monperrus"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.14880",
    "title": "Credit Card Fraud Detection with Subspace Learning-based One-Class  Classification",
    "abstract": "In an increasingly digitalized commerce landscape, the proliferation of credit card fraud and the evolution of sophisticated fraudulent techniques have led to substantial financial losses. Automating credit card fraud detection is a viable way to accelerate detection, reducing response times and minimizing potential financial losses. However, addressing this challenge is complicated by the highly imbalanced nature of the datasets, where genuine transactions vastly outnumber fraudulent ones. Furthermore, the high number of dimensions within the feature set gives rise to the ``curse of dimensionality\". In this paper, we investigate subspace learning-based approaches centered on One-Class Classification (OCC) algorithms, which excel in handling imbalanced data distributions and possess the capability to anticipate and counter the transactions carried out by yet-to-be-invented fraud techniques. The study highlights the potential of subspace learning-based OCC algorithms by investigating the limitations of current fraud detection strategies and the specific challenges of credit card fraud detection. These algorithms integrate subspace learning into the data description; hence, the models transform the data into a lower-dimensional subspace optimized for OCC. Through rigorous experimentation and analysis, the study validated that the proposed approach helps tackle the curse of dimensionality and the imbalanced nature of credit card data for automatic fraud detection to mitigate financial losses caused by fraudulent activities. ",
    "url": "https://arxiv.org/abs/2309.14880",
    "authors": [
      "Zaffar Zaffar",
      "Fahad Sohrab",
      "Juho Kanniainen",
      "Moncef Gabbouj"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.14888",
    "title": "Nearest Neighbor Guidance for Out-of-Distribution Detection",
    "abstract": "Detecting out-of-distribution (OOD) samples are crucial for machine learning models deployed in open-world environments. Classifier-based scores are a standard approach for OOD detection due to their fine-grained detection capability. However, these scores often suffer from overconfidence issues, misclassifying OOD samples distant from the in-distribution region. To address this challenge, we propose a method called Nearest Neighbor Guidance (NNGuide) that guides the classifier-based score to respect the boundary geometry of the data manifold. NNGuide reduces the overconfidence of OOD samples while preserving the fine-grained capability of the classifier-based score. We conduct extensive experiments on ImageNet OOD detection benchmarks under diverse settings, including a scenario where the ID data undergoes natural distribution shift. Our results demonstrate that NNGuide provides a significant performance improvement on the base detection scores, achieving state-of-the-art results on both AUROC, FPR95, and AUPR metrics. The code is given at \\url{https://github.com/roomo7time/nnguide}. ",
    "url": "https://arxiv.org/abs/2309.14888",
    "authors": [
      "Jaewoo Park",
      "Yoon Gyo Jung",
      "Andrew Beng Jin Teoh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.14891",
    "title": "REFORM: Removing False Correlation in Multi-level Interaction for CTR  Prediction",
    "abstract": "Click-through rate (CTR) prediction is a critical task in online advertising and recommendation systems, as accurate predictions are essential for user targeting and personalized recommendations. Most recent cutting-edge methods primarily focus on investigating complex implicit and explicit feature interactions. However, these methods neglect the issue of false correlations caused by confounding factors or selection bias. This problem is further magnified by the complexity and redundancy of these interactions. We propose a CTR prediction framework that removes false correlation in multi-level feature interaction, termed REFORM. The proposed REFORM framework exploits a wide range of multi-level high-order feature representations via a two-stream stacked recurrent structure while eliminating false correlations. The framework has two key components: I. The multi-level stacked recurrent (MSR) structure enables the model to efficiently capture diverse nonlinear interactions from feature spaces of different levels, and the richer representations lead to enhanced CTR prediction accuracy. II. The false correlation elimination (FCE) module further leverages Laplacian kernel mapping and sample reweighting methods to eliminate false correlations concealed within the multi-level features, allowing the model to focus on the true causal effects. Extensive experiments based on four challenging CTR datasets and our production dataset demonstrate that the proposed REFORM model achieves state-of-the-art performance. Codes, models and our dataset will be released at https://github.com/yansuoyuli/REFORM. ",
    "url": "https://arxiv.org/abs/2309.14891",
    "authors": [
      "Songli Wu",
      "Liang Du",
      "Jia-Qi Yang",
      "Yuai Wang",
      "De-Chuan Zhan",
      "Shuang Zhao",
      "Zixun Sun"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2309.14907",
    "title": "Label Deconvolution for Node Representation Learning on Large-scale  Attributed Graphs against Learning Bias",
    "abstract": "Node representation learning on attributed graphs -- whose nodes are associated with rich attributes (e.g., texts and protein sequences) -- plays a crucial role in many important downstream tasks. To encode the attributes and graph structures simultaneously, recent studies integrate pre-trained models with graph neural networks (GNNs), where pre-trained models serve as node encoders (NEs) to encode the attributes. As jointly training large NEs and GNNs on large-scale graphs suffers from severe scalability issues, many methods propose to train NEs and GNNs separately. Consequently, they do not take feature convolutions in GNNs into consideration in the training phase of NEs, leading to a significant learning bias from that by the joint training. To address this challenge, we propose an efficient label regularization technique, namely Label Deconvolution (LD), to alleviate the learning bias by a novel and highly scalable approximation to the inverse mapping of GNNs. The inverse mapping leads to an objective function that is equivalent to that by the joint training, while it can effectively incorporate GNNs in the training phase of NEs against the learning bias. More importantly, we show that LD converges to the optimal objective function values by thejoint training under mild assumptions. Experiments demonstrate LD significantly outperforms state-of-the-art methods on Open Graph Benchmark datasets. ",
    "url": "https://arxiv.org/abs/2309.14907",
    "authors": [
      "Zhihao Shi",
      "Jie Wang",
      "Fanghua Lu",
      "Hanzhu Chen",
      "Defu Lian",
      "Zheng Wang",
      "Jieping Ye",
      "Feng Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.14916",
    "title": "PHRIT: Parametric Hand Representation with Implicit Template",
    "abstract": "We propose PHRIT, a novel approach for parametric hand mesh modeling with an implicit template that combines the advantages of both parametric meshes and implicit representations. Our method represents deformable hand shapes using signed distance fields (SDFs) with part-based shape priors, utilizing a deformation field to execute the deformation. The model offers efficient high-fidelity hand reconstruction by deforming the canonical template at infinite resolution. Additionally, it is fully differentiable and can be easily used in hand modeling since it can be driven by the skeleton and shape latent codes. We evaluate PHRIT on multiple downstream tasks, including skeleton-driven hand reconstruction, shapes from point clouds, and single-view 3D reconstruction, demonstrating that our approach achieves realistic and immersive hand modeling with state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2309.14916",
    "authors": [
      "Zhisheng Huang",
      "Yujin Chen",
      "Di Kang",
      "Jinlu Zhang",
      "Zhigang Tu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.14921",
    "title": "A Democratic Platform for Engaging with Disabled Community in Generative  AI Development",
    "abstract": "Artificial Intelligence (AI) systems, especially generative AI technologies are becoming more relevant in our society. Tools like ChatGPT are being used by members of the disabled community e.g., Autistic people may use it to help compose emails. The growing impact and popularity of generative AI tools have prompted us to examine their relevance within the disabled community. The design and development phases often neglect this marginalized group, leading to inaccurate predictions and unfair discrimination directed towards them. This could result from bias in data sets, algorithms, and systems at various phases of creation and implementation. This workshop paper proposes a platform to involve the disabled community while building generative AI systems. With this platform, our aim is to gain insight into the factors that contribute to bias in the outputs generated by generative AI when used by the disabled community. Furthermore, we expect to comprehend which algorithmic factors are the main contributors to the output's incorrectness or irrelevancy. The proposed platform calls on both disabled and non-disabled people from various geographical and cultural backgrounds to collaborate asynchronously and remotely in a democratic approach to decision-making. ",
    "url": "https://arxiv.org/abs/2309.14921",
    "authors": [
      "Deepak Giri",
      "Erin Brady"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.14950",
    "title": "Multi-Source Domain Adaptation for Object Detection with Prototype-based  Mean-teacher",
    "abstract": "Adapting visual object detectors to operational target domains is a challenging task, commonly achieved using unsupervised domain adaptation (UDA) methods. When the labeled dataset is coming from multiple source domains, treating them as separate domains and performing a multi-source domain adaptation (MSDA) improves the accuracy and robustness over mixing these source domains and performing a UDA, as observed by recent studies in MSDA. Existing MSDA methods learn domain invariant and domain-specific parameters (for each source domain) for the adaptation. However, unlike single-source UDA methods, learning domain-specific parameters makes them grow significantly proportional to the number of source domains used. This paper proposes a novel MSDA method called Prototype-based Mean-Teacher (PMT), which uses class prototypes instead of domain-specific subnets to preserve domain-specific information. These prototypes are learned using a contrastive loss, aligning the same categories across domains and separating different categories far apart. Because of the use of prototypes, the parameter size of our method does not increase significantly with the number of source domains, thus reducing memory issues and possible overfitting. Empirical studies show PMT outperforms state-of-the-art MSDA methods on several challenging object detection datasets. ",
    "url": "https://arxiv.org/abs/2309.14950",
    "authors": [
      "Atif Belal",
      "Akhil Meethal",
      "Francisco Perdigon Romero",
      "Marco Pedersoli",
      "Eric Granger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.14957",
    "title": "Context-Aware Generative Models for Prediction of Aircraft Ground Tracks",
    "abstract": "Trajectory prediction (TP) plays an important role in supporting the decision-making of Air Traffic Controllers (ATCOs). Traditional TP methods are deterministic and physics-based, with parameters that are calibrated using aircraft surveillance data harvested across the world. These models are, therefore, agnostic to the intentions of the pilots and ATCOs, which can have a significant effect on the observed trajectory, particularly in the lateral plane. This work proposes a generative method for lateral TP, using probabilistic machine learning to model the effect of the epistemic uncertainty arising from the unknown effect of pilot behaviour and ATCO intentions. The models are trained to be specific to a particular sector, allowing local procedures such as coordinated entry and exit points to be modelled. A dataset comprising a week's worth of aircraft surveillance data, passing through a busy sector of the United Kingdom's upper airspace, was used to train and test the models. Specifically, a piecewise linear model was used as a functional, low-dimensional representation of the ground tracks, with its control points determined by a generative model conditioned on partial context. It was found that, of the investigated models, a Bayesian Neural Network using the Laplace approximation was able to generate the most plausible trajectories in order to emulate the flow of traffic through the sector. ",
    "url": "https://arxiv.org/abs/2309.14957",
    "authors": [
      "Nick Pepper",
      "George De Ath",
      "Marc Thomas",
      "Richard Everson",
      "Tim Dodwell"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.14962",
    "title": "GridFormer: Towards Accurate Table Structure Recognition via Grid  Prediction",
    "abstract": "All tables can be represented as grids. Based on this observation, we propose GridFormer, a novel approach for interpreting unconstrained table structures by predicting the vertex and edge of a grid. First, we propose a flexible table representation in the form of an MXN grid. In this representation, the vertexes and edges of the grid store the localization and adjacency information of the table. Then, we introduce a DETR-style table structure recognizer to efficiently predict this multi-objective information of the grid in a single shot. Specifically, given a set of learned row and column queries, the recognizer directly outputs the vertexes and edges information of the corresponding rows and columns. Extensive experiments on five challenging benchmarks which include wired, wireless, multi-merge-cell, oriented, and distorted tables demonstrate the competitive performance of our model over other methods. ",
    "url": "https://arxiv.org/abs/2309.14962",
    "authors": [
      "Pengyuan Lyu",
      "Weihong Ma",
      "Hongyi Wang",
      "Yuechen Yu",
      "Chengquan Zhang",
      "Kun Yao",
      "Yang Xue",
      "Jingdong Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.14966",
    "title": "Interactively Learning Social Media Representations Improves News Source  Factuality Detection",
    "abstract": "The rise of social media has enabled the widespread propagation of fake news, text that is published with an intent to spread misinformation and sway beliefs. Rapidly detecting fake news, especially as new events arise, is important to prevent misinformation. While prior works have tackled this problem using supervised learning systems, automatedly modeling the complexities of the social media landscape that enables the spread of fake news is challenging. On the contrary, having humans fact check all news is not scalable. Thus, in this paper, we propose to approach this problem interactively, where humans can interact to help an automated system learn a better social media representation quality. On real world events, our experiments show performance improvements in detecting factuality of news sources, even after few human interactions. ",
    "url": "https://arxiv.org/abs/2309.14966",
    "authors": [
      "Nikhil Mehta",
      "Dan Goldwasser"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2309.14972",
    "title": "Improving Unsupervised Visual Program Inference with Code Rewriting  Families",
    "abstract": "Programs offer compactness and structure that makes them an attractive representation for visual data. We explore how code rewriting can be used to improve systems for inferring programs from visual data. We first propose Sparse Intermittent Rewrite Injection (SIRI), a framework for unsupervised bootstrapped learning. SIRI sparsely applies code rewrite operations over a dataset of training programs, injecting the improved programs back into the training set. We design a family of rewriters for visual programming domains: parameter optimization, code pruning, and code grafting. For three shape programming languages in 2D and 3D, we show that using SIRI with our family of rewriters improves performance: better reconstructions and faster convergence rates, compared with bootstrapped learning methods that do not use rewriters or use them naively. Finally, we demonstrate that our family of rewriters can be effectively used at test time to improve the output of SIRI predictions. For 2D and 3D CSG, we outperform or match the reconstruction performance of recent domain-specific neural architectures, while producing more parsimonious programs that use significantly fewer primitives. ",
    "url": "https://arxiv.org/abs/2309.14972",
    "authors": [
      "Aditya Ganeshan",
      "R. Kenny Jones",
      "Daniel Ritchie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2309.14976",
    "title": "MoCaE: Mixture of Calibrated Experts Significantly Improves Object  Detection",
    "abstract": "We propose an extremely simple and highly effective approach to faithfully combine different object detectors to obtain a Mixture of Experts (MoE) that has a superior accuracy to the individual experts in the mixture. We find that naively combining these experts in a similar way to the well-known Deep Ensembles (DEs), does not result in an effective MoE. We identify the incompatibility between the confidence score distribution of different detectors to be the primary reason for such failure cases. Therefore, to construct the MoE, our proposal is to first calibrate each individual detector against a target calibration function. Then, filter and refine all the predictions from different detectors in the mixture. We term this approach as MoCaE and demonstrate its effectiveness through extensive experiments on object detection, instance segmentation and rotated object detection tasks. Specifically, MoCaE improves (i) three strong object detectors on COCO test-dev by $2.4$ $\\mathrm{AP}$ by reaching $59.0$ $\\mathrm{AP}$; (ii) instance segmentation methods on the challenging long-tailed LVIS dataset by $2.3$ $\\mathrm{AP}$; and (iii) all existing rotated object detectors by reaching $82.62$ $\\mathrm{AP_{50}}$ on DOTA dataset, establishing a new state-of-the-art (SOTA). Code will be made public. ",
    "url": "https://arxiv.org/abs/2309.14976",
    "authors": [
      "Kemal Oksuz",
      "Selim Kuzucu",
      "Tom Joy",
      "Puneet K. Dokania"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.14984",
    "title": "The Role of Document Embedding in Research Paper Recommender Systems: To  Breakdown or to Bolster Disciplinary Borders?",
    "abstract": "In the extensive recommender systems literature, novelty and diversity have been identified as key properties of useful recommendations. However, these properties have received limited attention in the specific sub-field of research paper recommender systems. In this work, we argue for the importance of offering novel and diverse research paper recommendations to scientists. This approach aims to reduce siloed reading, break down filter bubbles, and promote interdisciplinary research. We propose a novel framework for evaluating the novelty and diversity of research paper recommendations that leverages methods from network analysis and natural language processing. Using this framework, we show that the choice of representational method within a larger research paper recommendation system can have a measurable impact on the nature of downstream recommendations, specifically on their novelty and diversity. We introduce a novel paper embedding method, which we demonstrate offers more innovative and diverse recommendations without sacrificing precision, compared to other state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2309.14984",
    "authors": [
      "Eoghan Cunningham",
      "Derek Greene",
      "Barry Smyth"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Digital Libraries (cs.DL)"
    ]
  },
  {
    "id": "arXiv:2309.14991",
    "title": "Robust Sequential DeepFake Detection",
    "abstract": "Since photorealistic faces can be readily generated by facial manipulation technologies nowadays, potential malicious abuse of these technologies has drawn great concerns. Numerous deepfake detection methods are thus proposed. However, existing methods only focus on detecting one-step facial manipulation. As the emergence of easy-accessible facial editing applications, people can easily manipulate facial components using multi-step operations in a sequential manner. This new threat requires us to detect a sequence of facial manipulations, which is vital for both detecting deepfake media and recovering original faces afterwards. Motivated by this observation, we emphasize the need and propose a novel research problem called Detecting Sequential DeepFake Manipulation (Seq-DeepFake). Unlike the existing deepfake detection task only demanding a binary label prediction, detecting Seq-DeepFake manipulation requires correctly predicting a sequential vector of facial manipulation operations. To support a large-scale investigation, we construct the first Seq-DeepFake dataset, where face images are manipulated sequentially with corresponding annotations of sequential facial manipulation vectors. Based on this new dataset, we cast detecting Seq-DeepFake manipulation as a specific image-to-sequence task and propose a concise yet effective Seq-DeepFake Transformer (SeqFakeFormer). To better reflect real-world deepfake data distributions, we further apply various perturbations on the original Seq-DeepFake dataset and construct the more challenging Sequential DeepFake dataset with perturbations (Seq-DeepFake-P). To exploit deeper correlation between images and sequences when facing Seq-DeepFake-P, a dedicated Seq-DeepFake Transformer with Image-Sequence Reasoning (SeqFakeFormer++) is devised, which builds stronger correspondence between image-sequence pairs for more robust Seq-DeepFake detection. ",
    "url": "https://arxiv.org/abs/2309.14991",
    "authors": [
      "Rui Shao",
      "Tianxing Wu",
      "Ziwei Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.14992",
    "title": "Exploring ChatGPT Approach to Bidirectional Traceability Problem between  Design Models and Code",
    "abstract": "This study explores the capabilities of Large Language Models (LLMs), particularly OpenAI's ChatGPT, in addressing the challenges associated with software modeling, explicitly focusing on the bidirectional traceability problem between design models and code. The objective of this study is to demonstrate the proficiency of ChatGPT in understanding and integrating specific requirements into design models and code and its potential to offer solutions to the bidirectional traceability problem through a case study. The findings indicate that ChatGPT is capable of generating design models and code from natural language requirements, thereby bridging the gap between these requirements and software modeling. Despite its limitations in suggesting a specific method to resolve the problem using ChatGPT itself, it exhibited the capacity to provide corrections to be consistent between design models and code. As a result, the study concludes that achieving bidirectional traceability between design models and code is feasible using ChatGPT. ",
    "url": "https://arxiv.org/abs/2309.14992",
    "authors": [
      "Hideyuki Kanuka",
      "Genta Koreki",
      "Ryo Soga",
      "Kazu Nishikawa"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2309.14997",
    "title": "IAIFNet: An Illumination-Aware Infrared and Visible Image Fusion Network",
    "abstract": "Infrared and visible image fusion (IVIF) is used to generate fusion images with comprehensive features of both images, which is beneficial for downstream vision tasks. However, current methods rarely consider the illumination condition in low-light environments, and the targets in the fused images are often not prominent. To address the above issues, we propose an Illumination-Aware Infrared and Visible Image Fusion Network, named as IAIFNet. In our framework, an illumination enhancement network first estimates the incident illumination maps of input images. Afterwards, with the help of proposed adaptive differential fusion module (ADFM) and salient target aware module (STAM), an image fusion network effectively integrates the salient features of the illumination-enhanced infrared and visible images into a fusion image of high visual quality. Extensive experimental results verify that our method outperforms five state-of-the-art methods of fusing infrared and visible images. ",
    "url": "https://arxiv.org/abs/2309.14997",
    "authors": [
      "Qiao Yang",
      "Yu Zhang",
      "Jian Zhang",
      "Zijing Zhao",
      "Shunli Zhang",
      "Jinqiao Wang",
      "Junzhe Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.15018",
    "title": "Unidirectional brain-computer interface: Artificial neural network  encoding natural images to fMRI response in the visual cortex",
    "abstract": "While significant advancements in artificial intelligence (AI) have catalyzed progress across various domains, its full potential in understanding visual perception remains underexplored. We propose an artificial neural network dubbed VISION, an acronym for \"Visual Interface System for Imaging Output of Neural activity,\" to mimic the human brain and show how it can foster neuroscientific inquiries. Using visual and contextual inputs, this multimodal model predicts the brain's functional magnetic resonance imaging (fMRI) scan response to natural images. VISION successfully predicts human hemodynamic responses as fMRI voxel values to visual inputs with an accuracy exceeding state-of-the-art performance by 45%. We further probe the trained networks to reveal representational biases in different visual areas, generate experimentally testable hypotheses, and formulate an interpretable metric to associate these hypotheses with cortical functions. With both a model and evaluation metric, the cost and time burdens associated with designing and implementing functional analysis on the visual cortex could be reduced. Our work suggests that the evolution of computational models may shed light on our fundamental understanding of the visual cortex and provide a viable approach toward reliable brain-machine interfaces. ",
    "url": "https://arxiv.org/abs/2309.15018",
    "authors": [
      "Ruixing Liang",
      "Xiangyu Zhang",
      "Qiong Li",
      "Lai Wei",
      "Hexin Liu",
      "Avisha Kumar",
      "Kelley M. Kempski Leadingham",
      "Joshua Punnoose",
      "Leibny Paola Garcia",
      "Amir Manbachi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2309.15030",
    "title": "Quadratic Detection in Noncoherent Massive SIMO Systems over Correlated  Channels",
    "abstract": "With the goal of enabling ultrareliable and low-latency wireless communications for industrial internet of things (IIoT), this paper studies the use of energy-based modulations in noncoherent massive single input multiple output (SIMO) systems. We consider a one-shot communication over a channel with correlated Rayleigh fading and colored Gaussian noise. We first provide a theoretical analysis on the limitations of non-negative pulse-amplitude modulation (PAM) in systems of this kind, based on maximum likelihood detection. The existence of a fundamental error floor at high signal-to-noise ratio (SNR) regimes is proved for constellations with more than two energy levels, when no (statistical) channel state information is available at the transmitter. In the main body of the paper, we present a design framework for quadratic detectors that generalizes the widely-used energy detector, to better exploit the statistical knowledge of the channel. This allows us to design receivers optimized according to information-theoretic criteria that exhibit lower error rates at moderate and high SNR. We subsequently derive an analytic approximation for the error probability of a general class of quadratic detectors in the large array regime. Finally, we introduce an improved reception scheme based on the combination of quadratic detectors and assess its capabilities numerically. ",
    "url": "https://arxiv.org/abs/2309.15030",
    "authors": [
      "Marc Vilà-Insa",
      "Aniol Martí",
      "Jaume Riba",
      "Meritxell Lamarca"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2309.15037",
    "title": "STAR-RIS Assisted Full-Duplex Communication Networks",
    "abstract": "Different from conventional reconfigurable intelligent surfaces (RIS), a recent innovation called simultaneous transmitting and reflecting reconfigurable intelligent surface (STAR-RIS) has emerged, aimed at achieving complete 360-degree coverage in communication networks. Additionally, fullduplex (FD) technology is recognized as a potent approach for enhancing spectral efficiency by enabling simultaneous transmission and reception within the same time and frequency resources. In this study, we investigate the performance of a STAR-RIS-assisted FD communication system. The STAR-RIS is strategically placed at the cell-edge to facilitate communication for users located in this challenging region, while cell-center users can communicate directly with the FD base station (BS). We employ a non-orthogonal multiple access (NOMA) pairing scheme and account for system impairments, such as self-interference at the BS and imperfect successive interference cancellation (SIC). We derive closed-form expressions for the ergodic rates in both the up-link and down-link communications and extend our analysis to bidirectional communication between cell-center and cell-edge users. Furthermore, we formulate an optimization problem aimed at maximizing the ergodic sum-rate. This optimization involves adjusting the amplitudes and phase-shifts of the STAR-RIS elements and allocating total transmit power efficiently. To gain deeper insights into the achievable rates of STAR-RIS-aided FD systems, we explore the impact of various system parameters through numerical results. ",
    "url": "https://arxiv.org/abs/2309.15037",
    "authors": [
      "Abdelhamid Salem",
      "Kai-Kit Wong",
      "Chan-Byoung Chae",
      "Yangyang Zhang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2309.15039",
    "title": "Combining Survival Analysis and Machine Learning for Mass Cancer Risk  Prediction using EHR data",
    "abstract": "Purely medical cancer screening methods are often costly, time-consuming, and weakly applicable on a large scale. Advanced Artificial Intelligence (AI) methods greatly help cancer detection but require specific or deep medical data. These aspects affect the mass implementation of cancer screening methods. For these reasons, it is a disruptive change for healthcare to apply AI methods for mass personalized assessment of the cancer risk among patients based on the existing Electronic Health Records (EHR) volume. This paper presents a novel method for mass cancer risk prediction using EHR data. Among other methods, our one stands out by the minimum data greedy policy, requiring only a history of medical service codes and diagnoses from EHR. We formulate the problem as a binary classification. This dataset contains 175 441 de-identified patients (2 861 diagnosed with cancer). As a baseline, we implement a solution based on a recurrent neural network (RNN). We propose a method that combines machine learning and survival analysis since these approaches are less computationally heavy, can be combined into an ensemble (the Survival Ensemble), and can be reproduced in most medical institutions. We test the Survival Ensemble in some studies. Firstly, we obtain a significant difference between values of the primary metric (Average Precision) with 22.8% (ROC AUC 83.7%, F1 17.8%) for the Survival Ensemble versus 15.1% (ROC AUC 84.9%, F1 21.4%) for the Baseline. Secondly, the performance of the Survival Ensemble is also confirmed during the ablation study. Thirdly, our method exceeds age baselines by a significant margin. Fourthly, in the blind retrospective out-of-time experiment, the proposed method is reliable in cancer patient detection (9 out of 100 selected). Such results exceed the estimates of medical screenings, e.g., the best Number Needed to Screen (9 out of 1000 screenings). ",
    "url": "https://arxiv.org/abs/2309.15039",
    "authors": [
      "Petr Philonenko",
      "Vladimir Kokh",
      "Pavel Blinov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2309.15040",
    "title": "Zero-Energy-Device for 6G: First Real-Time Backscatter Communication  thanks to the Detection of Pilots from an Ambient Commercial Cellular Network",
    "abstract": "Ambient backscatter communication technology (AmBC) and a novel device category called zero-energy devices (ZED) have recently emerged as potential components for the forthcoming 6th generation (6G) networks. A ZED communicates with a smartphone without emitting additional radio waves, by backscattering ambient waves from base stations. Thanks to its very low consumption, a ZED powers itself by harvesting ambient light energy. However, the time variations of data traffic in cellular networks prevents AmBC to work properly. Recent works have demonstrated experimentally that a backscatter device could be detected by listening only ambient pilot signals (which are steady) instead of the whole ambient signal (which is bursty) of 4G. However, these experiments were run with a 4G base station emulator and a bulky energy greedy backscatter device. In this paper, for the first time, we demonstrate real-time AmBC on the field, with Orange commercial 4G network as ambient source and Orange Zero-Energy Device. ",
    "url": "https://arxiv.org/abs/2309.15040",
    "authors": [
      "Papis Ndiaye",
      "Dinh-Thuy Phan-Huy",
      "Ayman Hassan",
      "Jingyi Liao",
      "Xiyu Wang",
      "Kalle Ruttik",
      "Riku Jantti"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2309.15048",
    "title": "Class Incremental Learning via Likelihood Ratio Based Task Prediction",
    "abstract": "Class incremental learning (CIL) is a challenging setting of continual learning, which learns a series of tasks sequentially. Each task consists of a set of unique classes. The key feature of CIL is that no task identifier (or task-id) is provided at test time for each test sample. Predicting the task-id for each test sample is a challenging problem. An emerging theoretically justified and effective approach is to train a task-specific model for each task in a shared network for all tasks based on a task-incremental learning (TIL) method to deal with forgetting. The model for each task in this approach is an out-of-distribution (OOD) detector rather than a conventional classifier. The OOD detector can perform both within-task (in-distribution (IND)) class prediction and OOD detection. The OOD detection capability is the key for task-id prediction during inference for each test sample. However, this paper argues that using a traditional OOD detector for task-id prediction is sub-optimal because additional information (e.g., the replay data and the learned tasks) available in CIL can be exploited to design a better and principled method for task-id prediction. We call the new method TPLR (Task-id Prediction based on Likelihood Ratio}). TPLR markedly outperforms strong CIL baselines. ",
    "url": "https://arxiv.org/abs/2309.15048",
    "authors": [
      "Haowei Lin",
      "Yijia Shao",
      "Weinan Qian",
      "Ningxin Pan",
      "Yiduo Guo",
      "Bing Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.15096",
    "title": "Fixing the NTK: From Neural Network Linearizations to Exact Convex  Programs",
    "abstract": "Recently, theoretical analyses of deep neural networks have broadly focused on two directions: 1) Providing insight into neural network training by SGD in the limit of infinite hidden-layer width and infinitesimally small learning rate (also known as gradient flow) via the Neural Tangent Kernel (NTK), and 2) Globally optimizing the regularized training objective via cone-constrained convex reformulations of ReLU networks. The latter research direction also yielded an alternative formulation of the ReLU network, called a gated ReLU network, that is globally optimizable via efficient unconstrained convex programs. In this work, we interpret the convex program for this gated ReLU network as a Multiple Kernel Learning (MKL) model with a weighted data masking feature map and establish a connection to the NTK. Specifically, we show that for a particular choice of mask weights that do not depend on the learning targets, this kernel is equivalent to the NTK of the gated ReLU network on the training data. A consequence of this lack of dependence on the targets is that the NTK cannot perform better than the optimal MKL kernel on the training set. By using iterative reweighting, we improve the weights induced by the NTK to obtain the optimal MKL kernel which is equivalent to the solution of the exact convex reformulation of the gated ReLU network. We also provide several numerical simulations corroborating our theory. Additionally, we provide an analysis of the prediction error of the resulting optimal kernel via consistency results for the group lasso. ",
    "url": "https://arxiv.org/abs/2309.15096",
    "authors": [
      "Rajat Vadiraj Dwaraknath",
      "Tolga Ergen",
      "Mert Pilanci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2309.15109",
    "title": "DistillBEV: Boosting Multi-Camera 3D Object Detection with Cross-Modal  Knowledge Distillation",
    "abstract": "3D perception based on the representations learned from multi-camera bird's-eye-view (BEV) is trending as cameras are cost-effective for mass production in autonomous driving industry. However, there exists a distinct performance gap between multi-camera BEV and LiDAR based 3D object detection. One key reason is that LiDAR captures accurate depth and other geometry measurements, while it is notoriously challenging to infer such 3D information from merely image input. In this work, we propose to boost the representation learning of a multi-camera BEV based student detector by training it to imitate the features of a well-trained LiDAR based teacher detector. We propose effective balancing strategy to enforce the student to focus on learning the crucial features from the teacher, and generalize knowledge transfer to multi-scale layers with temporal fusion. We conduct extensive evaluations on multiple representative models of multi-camera BEV. Experiments reveal that our approach renders significant improvement over the student models, leading to the state-of-the-art performance on the popular benchmark nuScenes. ",
    "url": "https://arxiv.org/abs/2309.15109",
    "authors": [
      "Zeyu Wang",
      "Dingwen Li",
      "Chenxu Luo",
      "Cihang Xie",
      "Xiaodong Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.15111",
    "title": "SGD Finds then Tunes Features in Two-Layer Neural Networks with  near-Optimal Sample Complexity: A Case Study in the XOR problem",
    "abstract": "In this work, we consider the optimization process of minibatch stochastic gradient descent (SGD) on a 2-layer neural network with data separated by a quadratic ground truth function. We prove that with data drawn from the $d$-dimensional Boolean hypercube labeled by the quadratic ``XOR'' function $y = -x_ix_j$, it is possible to train to a population error $o(1)$ with $d \\:\\text{polylog}(d)$ samples. Our result considers simultaneously training both layers of the two-layer-neural network with ReLU activations via standard minibatch SGD on the logistic loss. To our knowledge, this work is the first to give a sample complexity of $\\tilde{O}(d)$ for efficiently learning the XOR function on isotropic data on a standard neural network with standard training. Our main technique is showing that the network evolves in two phases: a $\\textit{signal-finding}$ phase where the network is small and many of the neurons evolve independently to find features, and a $\\textit{signal-heavy}$ phase, where SGD maintains and balances the features. We leverage the simultaneous training of the layers to show that it is sufficient for only a small fraction of the neurons to learn features, since those neurons will be amplified by the simultaneous growth of their second layer weights. ",
    "url": "https://arxiv.org/abs/2309.15111",
    "authors": [
      "Margalit Glasgow"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2309.14350",
    "title": "Training neural mapping schemes for satellite altimetry with simulation  data",
    "abstract": "Satellite altimetry combined with data assimilation and optimal interpolation schemes have deeply renewed our ability to monitor sea surface dynamics. Recently, deep learning (DL) schemes have emerged as appealing solutions to address space-time interpolation problems. The scarcity of real altimetry dataset, in terms of space-time coverage of the sea surface, however impedes the training of state-of-the-art neural schemes on real-world case-studies. Here, we leverage both simulations of ocean dynamics and satellite altimeters to train simulation-based neural mapping schemes for the sea surface height and demonstrate their performance for real altimetry datasets. We analyze further how the ocean simulation dataset used during the training phase impacts this performance. This experimental analysis covers both the resolution from eddy-present configurations to eddy-rich ones, forced simulations vs. reanalyses using data assimilation and tide-free vs. tide-resolving simulations. Our benchmarking framework focuses on a Gulf Stream region for a realistic 5-altimeter constellation using NEMO ocean simulations and 4DVarNet mapping schemes. All simulation-based 4DVarNets outperform the operational observation-driven and reanalysis products, namely DUACS and GLORYS. The more realistic the ocean simulation dataset used during the training phase, the better the mapping. The best 4DVarNet mapping was trained from an eddy-rich and tide-free simulation datasets. It improves the resolved longitudinal scale from 151 kilometers for DUACS and 241 kilometers for GLORYS to 98 kilometers and reduces the root mean squared error (RMSE) by 23% and 61%. These results open research avenues for new synergies between ocean modelling and ocean observation using learning-based approaches. ",
    "url": "https://arxiv.org/abs/2309.14350",
    "authors": [
      "Quentin Febvre",
      "Julien Le Sommer",
      "Clément Ubelmann",
      "Ronan Fablet"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.14368",
    "title": "Quantum forgery attacks on COPA,AES-COPA and marble authenticated  encryption algorithms",
    "abstract": "The classic forgery attacks on COPA, AES-COPA and Marble authenticated encryption algorithms need to query about 2^(n/2) times, and their success probability is not high. To solve this problem, the corresponding quantum forgery attacks on COPA, AES-COPA and Marble authenticated encryption algorithms are presented. In the quantum forgery attacks on COPA and AES-COPA, we use Simon's algorithm to find the period of the tag generation function in COPA and AES-COPA by querying in superposition, and then generate a forged tag for a new message. In the quantum forgery attack on Marble, Simon's algorithm is used to recover the secret parameter L, and the forged tag can be computed with L. Compared with classic forgery attacks on COPA, AES-COPA and Marble, our attack can reduce the number of queries from O(2^(n/2)) to O(n) and improve success probability close to 100%. ",
    "url": "https://arxiv.org/abs/2309.14368",
    "authors": [
      "Yinsong Xu",
      "Wenjie Liu",
      "Wenbin Yu"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Cryptography and Security (cs.CR)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2309.14404",
    "title": "pLMFPPred: a novel approach for accurate prediction of functional  peptides integrating embedding from pre-trained protein language model and  imbalanced learning",
    "abstract": "Functional peptides have the potential to treat a variety of diseases. Their good therapeutic efficacy and low toxicity make them ideal therapeutic agents. Artificial intelligence-based computational strategies can help quickly identify new functional peptides from collections of protein sequences and discover their different functions.Using protein language model-based embeddings (ESM-2), we developed a tool called pLMFPPred (Protein Language Model-based Functional Peptide Predictor) for predicting functional peptides and identifying toxic peptides. We also introduced SMOTE-TOMEK data synthesis sampling and Shapley value-based feature selection techniques to relieve data imbalance issues and reduce computational costs. On a validated independent test set, pLMFPPred achieved accuracy, Area under the curve - Receiver Operating Characteristics, and F1-Score values of 0.974, 0.99, and 0.974, respectively. Comparative experiments show that pLMFPPred outperforms current methods for predicting functional peptides.The experimental results suggest that the proposed method (pLMFPPred) can provide better performance in terms of Accuracy, Area under the curve - Receiver Operating Characteristics, and F1-Score than existing methods. pLMFPPred has achieved good performance in predicting functional peptides and represents a new computational method for predicting functional peptides. ",
    "url": "https://arxiv.org/abs/2309.14404",
    "authors": [
      "Zebin Ma",
      "Yonglin Zou",
      "Xiaobin Huang",
      "Wenjin Yan",
      "Hao Xu",
      "Jiexin Yang",
      "Ying Zhang",
      "Jinqi Huang"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.14419",
    "title": "On the expressivity of embedding quantum kernels",
    "abstract": "One of the most natural connections between quantum and classical machine learning has been established in the context of kernel methods. Kernel methods rely on kernels, which are inner products of feature vectors living in large feature spaces. Quantum kernels are typically evaluated by explicitly constructing quantum feature states and then taking their inner product, here called embedding quantum kernels. Since classical kernels are usually evaluated without using the feature vectors explicitly, we wonder how expressive embedding quantum kernels are. In this work, we raise the fundamental question: can all quantum kernels be expressed as the inner product of quantum feature states? Our first result is positive: Invoking computational universality, we find that for any kernel function there always exists a corresponding quantum feature map and an embedding quantum kernel. The more operational reading of the question is concerned with efficient constructions, however. In a second part, we formalize the question of universality of efficient embedding quantum kernels. For shift-invariant kernels, we use the technique of random Fourier features to show that they are universal within the broad class of all kernels which allow a variant of efficient Fourier sampling. We then extend this result to a new class of so-called composition kernels, which we show also contains projected quantum kernels introduced in recent works. After proving the universality of embedding quantum kernels for both shift-invariant and composition kernels, we identify the directions towards new, more exotic, and unexplored quantum kernel families, for which it still remains open whether they correspond to efficient embedding quantum kernels. ",
    "url": "https://arxiv.org/abs/2309.14419",
    "authors": [
      "Elies Gil-Fuster",
      "Jens Eisert",
      "Vedran Dunjko"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2309.14460",
    "title": "Online Active Learning For Sound Event Detection",
    "abstract": "Data collection and annotation is a laborious, time-consuming prerequisite for supervised machine learning tasks. Online Active Learning (OAL) is a paradigm that addresses this issue by simultaneously minimizing the amount of annotation required to train a classifier and adapting to changes in the data over the duration of the data collection process. Prior work has indicated that fluctuating class distributions and data drift are still common problems for OAL. This work presents new loss functions that address these challenges when OAL is applied to Sound Event Detection (SED). Experimental results from the SONYC dataset and two Voice-Type Discrimination (VTD) corpora indicate that OAL can reduce the time and effort required to train SED classifiers by a factor of 5 for SONYC, and that the new methods presented here successfully resolve issues present in existing OAL methods. ",
    "url": "https://arxiv.org/abs/2309.14460",
    "authors": [
      "Mark Lindsey",
      "Ankit Shah",
      "Francis Kubala",
      "Richard M. Stern"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2309.14462",
    "title": "On the Impact of Quantization and Pruning of Self-Supervised Speech  Models for Downstream Speech Recognition Tasks \"In-the-Wild''",
    "abstract": "Recent advances with self-supervised learning have allowed speech recognition systems to achieve state-of-the-art (SOTA) word error rates (WER) while requiring only a fraction of the labeled training data needed by its predecessors. Notwithstanding, while such models achieve SOTA performance in matched train/test conditions, their performance degrades substantially when tested in unseen conditions. To overcome this problem, strategies such as data augmentation and/or domain shift training have been explored. Available models, however, are still too large to be considered for edge speech applications on resource-constrained devices, thus model compression tools are needed. In this paper, we explore the effects that train/test mismatch conditions have on speech recognition accuracy based on compressed self-supervised speech models. In particular, we report on the effects that parameter quantization and model pruning have on speech recognition accuracy based on the so-called robust wav2vec 2.0 model under noisy, reverberant, and noise-plus-reverberation conditions. ",
    "url": "https://arxiv.org/abs/2309.14462",
    "authors": [
      "Arthur Pimentel",
      "Heitor Guimarães",
      "Anderson R. Avila",
      "Mehdi Rezagholizadeh",
      "Tiago H. Falk"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2309.14483",
    "title": "Unveiling the Potential of Deep Learning Models for Solar Flare  Prediction in Near-Limb Regions",
    "abstract": "This study aims to evaluate the performance of deep learning models in predicting $\\geq$M-class solar flares with a prediction window of 24 hours, using hourly sampled full-disk line-of-sight (LoS) magnetogram images, particularly focusing on the often overlooked flare events corresponding to the near-limb regions (beyond $\\pm$70$^{\\circ}$ of the solar disk). We trained three well-known deep learning architectures--AlexNet, VGG16, and ResNet34 using transfer learning and compared and evaluated the overall performance of our models using true skill statistics (TSS) and Heidke skill score (HSS) and computed recall scores to understand the prediction sensitivity in central and near-limb regions for both X- and M-class flares. The following points summarize the key findings of our study: (1) The highest overall performance was observed with the AlexNet-based model, which achieved an average TSS$\\sim$0.53 and HSS$\\sim$0.37; (2) Further, a spatial analysis of recall scores disclosed that for the near-limb events, the VGG16- and ResNet34-based models exhibited superior prediction sensitivity. The best results, however, were seen with the ResNet34-based model for the near-limb flares, where the average recall was approximately 0.59 (the recall for X- and M-class was 0.81 and 0.56 respectively) and (3) Our research findings demonstrate that our models are capable of discerning complex spatial patterns from full-disk magnetograms and exhibit skill in predicting solar flares, even in the vicinity of near-limb regions. This ability holds substantial importance for operational flare forecasting systems. ",
    "url": "https://arxiv.org/abs/2309.14483",
    "authors": [
      "Chetraj Pandey",
      "Rafal A. Angryk",
      "Berkay Aydin"
    ],
    "subjectives": [
      "Solar and Stellar Astrophysics (astro-ph.SR)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.14492",
    "title": "AiAReSeg: Catheter Detection and Segmentation in Interventional  Ultrasound using Transformers",
    "abstract": "To date, endovascular surgeries are performed using the golden standard of Fluoroscopy, which uses ionising radiation to visualise catheters and vasculature. Prolonged Fluoroscopic exposure is harmful for the patient and the clinician, and may lead to severe post-operative sequlae such as the development of cancer. Meanwhile, the use of interventional Ultrasound has gained popularity, due to its well-known benefits of small spatial footprint, fast data acquisition, and higher tissue contrast images. However, ultrasound images are hard to interpret, and it is difficult to localise vessels, catheters, and guidewires within them. This work proposes a solution using an adaptation of a state-of-the-art machine learning transformer architecture to detect and segment catheters in axial interventional Ultrasound image sequences. The network architecture was inspired by the Attention in Attention mechanism, temporal tracking networks, and introduced a novel 3D segmentation head that performs 3D deconvolution across time. In order to facilitate training of such deep learning networks, we introduce a new data synthesis pipeline that used physics-based catheter insertion simulations, along with a convolutional ray-casting ultrasound simulator to produce synthetic ultrasound images of endovascular interventions. The proposed method is validated on a hold-out validation dataset, thus demonstrated robustness to ultrasound noise and a wide range of scanning angles. It was also tested on data collected from silicon-based aorta phantoms, thus demonstrated its potential for translation from sim-to-real. This work represents a significant step towards safer and more efficient endovascular surgery using interventional ultrasound. ",
    "url": "https://arxiv.org/abs/2309.14492",
    "authors": [
      "Alex Ranne",
      "Yordanka Velikova",
      "Nassir Navab",
      "Ferdinando Rodriguez y Baena"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.14507",
    "title": "Noise-Robust DSP-Assisted Neural Pitch Estimation with Very Low  Complexity",
    "abstract": "Pitch estimation is an essential step of many speech processing algorithms, including speech coding, synthesis, and enhancement. Recently, pitch estimators based on deep neural networks (DNNs) have have been outperforming well-established DSP-based techniques. Unfortunately, these new estimators can be impractical to deploy in real-time systems, both because of their relatively high complexity, and the fact that some require significant lookahead. We show that a hybrid estimator using a small deep neural network (DNN) with traditional DSP-based features can match or exceed the performance of pure DNN-based models, with a complexity and algorithmic delay comparable to traditional DSP-based algorithms. We further demonstrate that this hybrid approach can provide benefits for a neural vocoding task. ",
    "url": "https://arxiv.org/abs/2309.14507",
    "authors": [
      "Krishna Subramani",
      "Jean-Marc Valin",
      "Jan Buethe",
      "Paris Smaragdis",
      "Mike Goodwin"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2309.14523",
    "title": "Smooth Exact Gradient Descent Learning in Spiking Neural Networks",
    "abstract": "Artificial neural networks are highly successfully trained with backpropagation. For spiking neural networks, however, a similar gradient descent scheme seems prohibitive due to the sudden, disruptive (dis-)appearance of spikes. Here, we demonstrate exact gradient descent learning based on spiking dynamics that change only continuously. These are generated by neuron models whose spikes vanish and appear at the end of a trial, where they do not influence other neurons anymore. This also enables gradient-based spike addition and removal. We apply our learning scheme to induce and continuously move spikes to desired times, in single neurons and recurrent networks. Further, it achieves competitive performance in a benchmark task using deep, initially silent networks. Our results show how non-disruptive learning is possible despite discrete spikes. ",
    "url": "https://arxiv.org/abs/2309.14523",
    "authors": [
      "Christian Klos",
      "Raoul-Martin Memmesheimer"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2309.14550",
    "title": "MEMO: Dataset and Methods for Robust Multimodal Retinal Image  Registration with Large or Small Vessel Density Differences",
    "abstract": "The measurement of retinal blood flow (RBF) in capillaries can provide a powerful biomarker for the early diagnosis and treatment of ocular diseases. However, no single modality can determine capillary flowrates with high precision. Combining erythrocyte-mediated angiography (EMA) with optical coherence tomography angiography (OCTA) has the potential to achieve this goal, as EMA can measure the absolute 2D RBF of retinal microvasculature and OCTA can provide the 3D structural images of capillaries. However, multimodal retinal image registration between these two modalities remains largely unexplored. To fill this gap, we establish MEMO, the first public multimodal EMA and OCTA retinal image dataset. A unique challenge in multimodal retinal image registration between these modalities is the relatively large difference in vessel density (VD). To address this challenge, we propose a segmentation-based deep-learning framework (VDD-Reg) and a new evaluation metric (MSD), which provide robust results despite differences in vessel density. VDD-Reg consists of a vessel segmentation module and a registration module. To train the vessel segmentation module, we further designed a two-stage semi-supervised learning framework (LVD-Seg) combining supervised and unsupervised losses. We demonstrate that VDD-Reg outperforms baseline methods quantitatively and qualitatively for cases of both small VD differences (using the CF-FA dataset) and large VD differences (using our MEMO dataset). Moreover, VDD-Reg requires as few as three annotated vessel segmentation masks to maintain its accuracy, demonstrating its feasibility. ",
    "url": "https://arxiv.org/abs/2309.14550",
    "authors": [
      "Chiao-Yi Wang",
      "Faranguisse Kakhi Sadrieh",
      "Yi-Ting Shen",
      "Shih-En Chen",
      "Sarah Kim",
      "Victoria Chen",
      "Achyut Raghavendra",
      "Dongyi Wang",
      "Osamah Saeedi",
      "Yang Tao"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.14581",
    "title": "Assessing Utility of Differential Privacy for RCTs",
    "abstract": "Randomized control trials, RCTs, have become a powerful tool for assessing the impact of interventions and policies in many contexts. They are considered the gold-standard for inference in the biomedical fields and in many social sciences. Researchers have published an increasing number of studies that rely on RCTs for at least part of the inference, and these studies typically include the response data collected, de-identified and sometimes protected through traditional disclosure limitation methods. In this paper, we empirically assess the impact of strong privacy-preservation methodology (with \\ac{DP} guarantees), on published analyses from RCTs, leveraging the availability of replication packages (research compendia) in economics and policy analysis. We provide simulations studies and demonstrate how we can replicate the analysis in a published economics article on privacy-protected data under various parametrizations. We find that relatively straightforward DP-based methods allow for inference-valid protection of the published data, though computational issues may limit more complex analyses from using these methods. The results have applicability to researchers wishing to share RCT data, especially in the context of low- and middle-income countries, with strong privacy protection. ",
    "url": "https://arxiv.org/abs/2309.14581",
    "authors": [
      "Soumya Mukherjee",
      "Aratrika Mustafi",
      "Aleksandra Slavković",
      "Lars Vilhuber"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Cryptography and Security (cs.CR)",
      "Econometrics (econ.EM)"
    ]
  },
  {
    "id": "arXiv:2309.14741",
    "title": "Rethinking Session Variability: Leveraging Session Embeddings for  Session Robustness in Speaker Verification",
    "abstract": "In the field of speaker verification, session or channel variability poses a significant challenge. While many contemporary methods aim to disentangle session information from speaker embeddings, we introduce a novel approach using an additional embedding to represent the session information. This is achieved by training an auxiliary network appended to the speaker embedding extractor which remains fixed in this training process. This results in two similarity scores: one for the speakers information and one for the session information. The latter score acts as a compensator for the former that might be skewed due to session variations. Our extensive experiments demonstrate that session information can be effectively compensated without retraining of the embedding extractor. ",
    "url": "https://arxiv.org/abs/2309.14741",
    "authors": [
      "Hee-Soo Heo",
      "KiHyun Nam",
      "Bong-Jin Lee",
      "Youngki Kwon",
      "Minjae Lee",
      "You Jin Kim",
      "Joon Son Chung"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2309.14822",
    "title": "OS-net: Orbitally Stable Neural Networks",
    "abstract": "We introduce OS-net (Orbitally Stable neural NETworks), a new family of neural network architectures specifically designed for periodic dynamical data. OS-net is a special case of Neural Ordinary Differential Equations (NODEs) and takes full advantage of the adjoint method based backpropagation method. Utilizing ODE theory, we derive conditions on the network weights to ensure stability of the resulting dynamics. We demonstrate the efficacy of our approach by applying OS-net to discover the dynamics underlying the R\\\"{o}ssler and Sprott's systems, two dynamical systems known for their period doubling attractors and chaotic behavior. ",
    "url": "https://arxiv.org/abs/2309.14822",
    "authors": [
      "Marieme Ngom",
      "Carlo Graziani"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.14913",
    "title": "Robustness of the Random Language Model",
    "abstract": "The Random Language Model (De Giuli 2019) is an ensemble of stochastic context-free grammars, quantifying the syntax of human and computer languages. The model suggests a simple picture of first language learning as a type of annealing in the vast space of potential languages. In its simplest formulation, it implies a single continuous transition to grammatical syntax, at which the symmetry among potential words and categories is spontaneously broken. Here this picture is scrutinized by considering its robustness against explicit symmetry breaking, an inevitable component of learning in the real world. It is shown that the scenario is robust to such symmetry breaking. Comparison with human data on the clustering coefficient of syntax networks suggests that the observed transition is equivalent to that normally experienced by children at age 24 months. ",
    "url": "https://arxiv.org/abs/2309.14913",
    "authors": [
      "Fatemeh Lalegani",
      "Eric De Giuli"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2309.14980",
    "title": "Statistical Analysis of Quantum State Learning Process in Quantum Neural  Networks",
    "abstract": "Quantum neural networks (QNNs) have been a promising framework in pursuing near-term quantum advantage in various fields, where many applications can be viewed as learning a quantum state that encodes useful data. As a quantum analog of probability distribution learning, quantum state learning is theoretically and practically essential in quantum machine learning. In this paper, we develop a no-go theorem for learning an unknown quantum state with QNNs even starting from a high-fidelity initial state. We prove that when the loss value is lower than a critical threshold, the probability of avoiding local minima vanishes exponentially with the qubit count, while only grows polynomially with the circuit depth. The curvature of local minima is concentrated to the quantum Fisher information times a loss-dependent constant, which characterizes the sensibility of the output state with respect to parameters in QNNs. These results hold for any circuit structures, initialization strategies, and work for both fixed ansatzes and adaptive methods. Extensive numerical simulations are performed to validate our theoretical results. Our findings place generic limits on good initial guesses and adaptive methods for improving the learnability and scalability of QNNs, and deepen the understanding of prior information's role in QNNs. ",
    "url": "https://arxiv.org/abs/2309.14980",
    "authors": [
      "Hao-kai Zhang",
      "Chenghong Zhu",
      "Mingrui Jing",
      "Xin Wang"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.15075",
    "title": "On Excess Risk Convergence Rates of Neural Network Classifiers",
    "abstract": "The recent success of neural networks in pattern recognition and classification problems suggests that neural networks possess qualities distinct from other more classical classifiers such as SVMs or boosting classifiers. This paper studies the performance of plug-in classifiers based on neural networks in a binary classification setting as measured by their excess risks. Compared to the typical settings imposed in the literature, we consider a more general scenario that resembles actual practice in two respects: first, the function class to be approximated includes the Barron functions as a proper subset, and second, the neural network classifier constructed is the minimizer of a surrogate loss instead of the $0$-$1$ loss so that gradient descent-based numerical optimizations can be easily applied. While the class of functions we consider is quite large that optimal rates cannot be faster than $n^{-\\frac{1}{3}}$, it is a regime in which dimension-free rates are possible and approximation power of neural networks can be taken advantage of. In particular, we analyze the estimation and approximation properties of neural networks to obtain a dimension-free, uniform rate of convergence for the excess risk. Finally, we show that the rate obtained is in fact minimax optimal up to a logarithmic factor, and the minimax lower bound shows the effect of the margin assumption in this regime. ",
    "url": "https://arxiv.org/abs/2309.15075",
    "authors": [
      "Hyunouk Ko",
      "Namjoon Suh",
      "Xiaoming Huo"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2002.03812",
    "title": "Characterization and Representation of Weighted Core Inverse of Matrices",
    "abstract": " Comments: 18 pages ",
    "url": "https://arxiv.org/abs/2002.03812",
    "authors": [
      "Ratikanta Behera",
      "Jajati Keshari Sahoo",
      "Ram N. Mohapatra"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Rings and Algebras (math.RA)"
    ]
  },
  {
    "id": "arXiv:2106.02600",
    "title": "Causal Graph Discovery from Self and Mutually Exciting Time Series",
    "abstract": " Comments: See v2 for a previous workshop paper on Interpretable ML in Healthcare (IMLH) at ICML 2021, titled \"Causal Graph Recovery for Sepsis-Associated Derangements via Interpretable Hawkes Networks\". Also, see arXiv:2301.11336 for a short version with more experiments of our proposed method to learn \"strict\" DAGs ",
    "url": "https://arxiv.org/abs/2106.02600",
    "authors": [
      "Song Wei",
      "Yao Xie",
      "Christopher S. Josef",
      "Rishikesan Kamaleswaran"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Applications (stat.AP)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2110.09548",
    "title": "Path Regularization: A Convexity and Sparsity Inducing Regularization  for Parallel ReLU Networks",
    "abstract": " Comments: Accepted to NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2110.09548",
    "authors": [
      "Tolga Ergen",
      "Mert Pilanci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.13774",
    "title": "The Mont Blanc of Twitter: Identifying Hierarchies of Outstanding Peaks  in Social Networks",
    "abstract": " Comments: 15 pages, 3 figures, 2 tables. Accepted to ECML/PKDD 2023. Final version available at this https URL ",
    "url": "https://arxiv.org/abs/2110.13774",
    "authors": [
      "Maximilian Stubbemann",
      "Gerd Stumme"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2112.11397",
    "title": "NN2Poly: A polynomial representation for deep feed-forward artificial  neural networks",
    "abstract": " Title: NN2Poly: A polynomial representation for deep feed-forward artificial  neural networks ",
    "url": "https://arxiv.org/abs/2112.11397",
    "authors": [
      "Pablo Morala",
      "Jenny Alexandra Cifuentes",
      "Rosa E. Lillo",
      "Iñaki Ucar"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.03270",
    "title": "Multi-scale Context-aware Network with Transformer for Gait Recognition",
    "abstract": " Comments: Extensions of CSTL ",
    "url": "https://arxiv.org/abs/2204.03270",
    "authors": [
      "Duowang Zhu",
      "Xiaohu Huang",
      "Xinggang Wang",
      "Bo Yang",
      "Botao He",
      "Wenyu Liu",
      "Bin Feng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.14756",
    "title": "EfficientViT: Multi-Scale Linear Attention for High-Resolution Dense  Prediction",
    "abstract": " Comments: ICCV 2023 ",
    "url": "https://arxiv.org/abs/2205.14756",
    "authors": [
      "Han Cai",
      "Junyan Li",
      "Muyan Hu",
      "Chuang Gan",
      "Song Han"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04609",
    "title": "E2EG: End-to-End Node Classification Using Graph Topology and Text-based  Node Attributes",
    "abstract": " Comments: Accepted to MLoG - IEEE International Conference on Data Mining Workshops ICDMW 2023 ",
    "url": "https://arxiv.org/abs/2208.04609",
    "authors": [
      "Tu Anh Dinh",
      "Jeroen den Boef",
      "Joran Cornelisse",
      "Paul Groth"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.08401",
    "title": "Nonlinear Heterogeneous Bayesian Decentralized Data Fusion",
    "abstract": " Comments: 7 pages, 3 figures, 3 tables, submitted to IEEE/RSJ international Conference on intelligent Robots and Systems (IROS 2023). Replacing previous version to account to reviewers' comments, this is the version presented at IROS 2023 ",
    "url": "https://arxiv.org/abs/2209.08401",
    "authors": [
      "Ofer Dagan",
      "Tycho L. Cinquini",
      "Nisar R. Ahmed"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.12160",
    "title": "PL-EVIO: Robust Monocular Event-based Visual Inertial Odometry with  Point and Line Features",
    "abstract": " Title: PL-EVIO: Robust Monocular Event-based Visual Inertial Odometry with  Point and Line Features ",
    "url": "https://arxiv.org/abs/2209.12160",
    "authors": [
      "Weipeng Guan",
      "Peiyu Chen",
      "Yuhan Xie",
      "Peng Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2210.01257",
    "title": "Testing predictions of representation cost theory with CNNs",
    "abstract": " Comments: Comments welcome! V2: Conjecture on non-commutative generalized H\\\"older upgraded to Lemma 4.11, as a consequence restrictions on Theorem 4.9 removed, more datasets, more variable frequency statistics and more CNN architectures. V3: title updated to better reflect content, some new ablations with untrained networks ",
    "url": "https://arxiv.org/abs/2210.01257",
    "authors": [
      "Charles Godfrey",
      "Elise Bishoff",
      "Myles Mckay",
      "Davis Brown",
      "Grayson Jorgenson",
      "Henry Kvinge",
      "Eleanor Byler"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.01051",
    "title": "VeriX: Towards Verified Explainability of Deep Neural Networks",
    "abstract": " Title: VeriX: Towards Verified Explainability of Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2212.01051",
    "authors": [
      "Min Wu",
      "Haoze Wu",
      "Clark Barrett"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.11524",
    "title": "RAPTOR: Advanced Persistent Threat Detection in Industrial IoT via  Attack Stage Correlation",
    "abstract": " Comments: Accepted for publication in PST 2023 ",
    "url": "https://arxiv.org/abs/2301.11524",
    "authors": [
      "Ayush Kumar",
      "Vrizlynn L.L. Thing"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.12148",
    "title": "Quality Indicators for Preference-based Evolutionary Multi-objective  Optimization Using a Reference Point: A Review and Analysis",
    "abstract": " Comments: This is an accepted version of a paper published in the IEEE Transactions on Evolutionary Computation ",
    "url": "https://arxiv.org/abs/2301.12148",
    "authors": [
      "Ryoji Tanabe",
      "Ke Li"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2302.09429",
    "title": "NU-AIR -- A Neuromorphic Urban Aerial Dataset for Detection and  Localization of Pedestrians and Vehicles",
    "abstract": " Comments: 20 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2302.09429",
    "authors": [
      "Craig Iaboni",
      "Thomas Kelly",
      "Pramod Abichandani"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.10972",
    "title": "Complexity of Maker-Breaker Games on Edge Sets of Graphs",
    "abstract": " Title: Complexity of Maker-Breaker Games on Edge Sets of Graphs ",
    "url": "https://arxiv.org/abs/2302.10972",
    "authors": [
      "Eric Duchêne",
      "Valentin Gledel",
      "Fionn Mc Inerney",
      "Nicolas Nisse",
      "Nacim Oijid",
      "Aline Parreau",
      "Miloš Stojaković"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2302.14040",
    "title": "Permutation Equivariant Neural Functionals",
    "abstract": " Comments: To appear in Neural Information Processing Systems (NeurIPS), 2023 ",
    "url": "https://arxiv.org/abs/2302.14040",
    "authors": [
      "Allan Zhou",
      "Kaien Yang",
      "Kaylee Burns",
      "Adriano Cardace",
      "Yiding Jiang",
      "Samuel Sokota",
      "J. Zico Kolter",
      "Chelsea Finn"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.00196",
    "title": "Transformed Low-Rank Parameterization Can Help Robust Generalization for  Tensor Neural Networks",
    "abstract": " Comments: 46 pages, accepted to NeurIPS 2023. We have corrected several typos in the first version (arXiv:2303.00196) ",
    "url": "https://arxiv.org/abs/2303.00196",
    "authors": [
      "Andong Wang",
      "Chao Li",
      "Mingyuan Bai",
      "Zhong Jin",
      "Guoxu Zhou",
      "Qibin Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.06280",
    "title": "Stateful Defenses for Machine Learning Models Are Not Yet Secure Against  Black-box Attacks",
    "abstract": " Comments: ACM CCS 2023 ",
    "url": "https://arxiv.org/abs/2303.06280",
    "authors": [
      "Ryan Feng",
      "Ashish Hooda",
      "Neal Mangaokar",
      "Kassem Fawaz",
      "Somesh Jha",
      "Atul Prakash"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.06671",
    "title": "An extension of the approximate component mode synthesis method to the  heterogeneous Helmholtz equation",
    "abstract": " Title: An extension of the approximate component mode synthesis method to the  heterogeneous Helmholtz equation ",
    "url": "https://arxiv.org/abs/2303.06671",
    "authors": [
      "Elena Giammatteo",
      "Alexander Heinlein",
      "Matthias Schlottbom"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2303.07122",
    "title": "Quantifying Causes of Arctic Amplification via Deep Learning based  Time-series Causal Inference",
    "abstract": " Comments: Accepted by ICMLA 2023 ",
    "url": "https://arxiv.org/abs/2303.07122",
    "authors": [
      "Sahara Ali",
      "Omar Faruque",
      "Yiyi Huang",
      "Md. Osman Gani",
      "Aneesh Subramanian",
      "Nicole-Jienne Shchlegel",
      "Jianwu Wang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2303.07397",
    "title": "Fast exploration and learning of latent graphs with aliased observations",
    "abstract": " Title: Fast exploration and learning of latent graphs with aliased observations ",
    "url": "https://arxiv.org/abs/2303.07397",
    "authors": [
      "Miguel Lazaro-Gredilla",
      "Ishan Deshpande",
      "Sivaramakrishnan Swaminathan",
      "Meet Dave",
      "Dileep George"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.17304",
    "title": "Robust offset-free constrained Model Predictive Control with Long  Short-Term Memory Networks -- Extended version",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2303.17304",
    "authors": [
      "Irene Schimperna",
      "Lalo Magni"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.01681",
    "title": "Low-PAPR Joint Channel Estimation and Data Detection in ZP-OTFS System",
    "abstract": " Title: Low-PAPR Joint Channel Estimation and Data Detection in ZP-OTFS System ",
    "url": "https://arxiv.org/abs/2304.01681",
    "authors": [
      "Omid Abbassi Aghda",
      "Mohammad Javad Omidi",
      "Hamid Saeedi-Sourck"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.01828",
    "title": "Learning Stable and Robust Linear Parameter-Varying State-Space Models",
    "abstract": " Comments: Accepted for the 62nd IEEE Conference on Decision and Control (CDC2023) ",
    "url": "https://arxiv.org/abs/2304.01828",
    "authors": [
      "Chris Verhoek",
      "Ruigang Wang",
      "Roland Tóth"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.04546",
    "title": "Kinship Representation Learning with Face Componential Relation",
    "abstract": " Comments: ICCV 2023 Workshop (Analysis and Modeling of Faces and Gestures) ",
    "url": "https://arxiv.org/abs/2304.04546",
    "authors": [
      "Weng-Tai Su",
      "Min-Hung Chen",
      "Chien-Yi Wang",
      "Shang-Hong Lai",
      "Trista Pei-Chun Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10049",
    "title": "Dynablox: Real-time Detection of Diverse Dynamic Objects in Complex  Environments",
    "abstract": " Comments: Code released at this https URL ",
    "url": "https://arxiv.org/abs/2304.10049",
    "authors": [
      "Lukas Schmid",
      "Olov Andersson",
      "Aurelio Sulser",
      "Patrick Pfreundschuh",
      "Roland Siegwart"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.02294",
    "title": "Heterogeneous message passing for heterogeneous networks",
    "abstract": " Comments: 12 pages, 8 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2305.02294",
    "authors": [
      "George T. Cantwell",
      "Alec Kirkley",
      "Filippo Radicchi"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.06477",
    "title": "SENDD: Sparse Efficient Neural Depth and Deformation for Tissue Tracking",
    "abstract": " Comments: 12 pages, 4 figures. Accepted by MICCAI 2023 ",
    "url": "https://arxiv.org/abs/2305.06477",
    "authors": [
      "Adam Schmidt",
      "Omid Mohareri",
      "Simon DiMaio",
      "Septimiu E. Salcudean"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.08553",
    "title": "Distilling Knowledge for Short-to-Long Term Trajectory Prediction",
    "abstract": " Title: Distilling Knowledge for Short-to-Long Term Trajectory Prediction ",
    "url": "https://arxiv.org/abs/2305.08553",
    "authors": [
      "Sourav Das",
      "Guglielmo Camporese",
      "Lamberto Ballan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.12476",
    "title": "Zero-shot Visual Relation Detection via Composite Visual Cues from Large  Language Models",
    "abstract": " Title: Zero-shot Visual Relation Detection via Composite Visual Cues from Large  Language Models ",
    "url": "https://arxiv.org/abs/2305.12476",
    "authors": [
      "Lin Li",
      "Jun Xiao",
      "Guikun Chen",
      "Jian Shao",
      "Yueting Zhuang",
      "Long Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.17799",
    "title": "I-FENN for thermoelasticity based on physics-informed temporal  convolutional network (PI-TCN)",
    "abstract": " Title: I-FENN for thermoelasticity based on physics-informed temporal  convolutional network (PI-TCN) ",
    "url": "https://arxiv.org/abs/2305.17799",
    "authors": [
      "Diab W. Abueidda",
      "Mostafa E. Mobasher"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2305.18427",
    "title": "Interpretable Reward Redistribution in Reinforcement Learning: A Causal  Approach",
    "abstract": " Comments: Accepted to NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2305.18427",
    "authors": [
      "Yudi Zhang",
      "Yali Du",
      "Biwei Huang",
      "Ziyan Wang",
      "Jun Wang",
      "Meng Fang",
      "Mykola Pechenizkiy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.01762",
    "title": "Pre-trained transformer for adversarial purification",
    "abstract": " Title: Pre-trained transformer for adversarial purification ",
    "url": "https://arxiv.org/abs/2306.01762",
    "authors": [
      "Kai Wu",
      "Yujian Betterest Li",
      "Jian Lou",
      "Xiaoyu Zhang",
      "Handing Wang",
      "Jing Liu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.04507",
    "title": "Improving neural network representations using human similarity  judgments",
    "abstract": " Comments: Published as a conference paper at NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2306.04507",
    "authors": [
      "Lukas Muttenthaler",
      "Lorenz Linhardt",
      "Jonas Dippel",
      "Robert A. Vandermeulen",
      "Katherine Hermann",
      "Andrew K. Lampinen",
      "Simon Kornblith"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.10649",
    "title": "CompanyKG: A Large-Scale Heterogeneous Graph for Company Similarity  Quantification",
    "abstract": " Comments: Paper (13 pages, 5 figures and 2 tables) + Appendix (18 pages, 4 figures and 5 tables) ",
    "url": "https://arxiv.org/abs/2306.10649",
    "authors": [
      "Lele Cao",
      "Vilhelm von Ehrenheim",
      "Mark Granroth-Wilding",
      "Richard Anselmo Stahl",
      "Andrew McCornack",
      "Armin Catovic",
      "Dhiana Deva Cavacanti Rocha"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Databases (cs.DB)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.03332",
    "title": "ACDNet: Attention-guided Collaborative Decision Network for Effective  Medication Recommendation",
    "abstract": " Title: ACDNet: Attention-guided Collaborative Decision Network for Effective  Medication Recommendation ",
    "url": "https://arxiv.org/abs/2307.03332",
    "authors": [
      "Jiacong Mi",
      "Yi Zu",
      "Zhuoyuan Wang",
      "Jieyue He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.05374",
    "title": "Multi-Task Learning to Enhance Generalizability of Neural Network  Equalizers in Coherent Optical Systems",
    "abstract": " Comments: 4 pages, European Conference on Optical Communication (ECOC) ",
    "url": "https://arxiv.org/abs/2307.05374",
    "authors": [
      "Sasipim Srivallapanondh",
      "Pedro J. Freire",
      "Ashraful Alam",
      "Nelson Costa",
      "Bernhard Spinnler",
      "Antonio Napoli",
      "Egor Sedov",
      "Sergei K. Turitsyn",
      "Jaroslaw E. Prilepsky"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.10947",
    "title": "Improving Online Lane Graph Extraction by Object-Lane Clustering",
    "abstract": " Comments: ICCV 2023 ",
    "url": "https://arxiv.org/abs/2307.10947",
    "authors": [
      "Yigit Baran Can",
      "Alexander Liniger",
      "Danda Pani Paudel",
      "Luc Van Gool"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.01237",
    "title": "LSF-IDM: Automotive Intrusion Detection Model with Lightweight  Attribution and Semantic Fusion",
    "abstract": " Comments: 18 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2308.01237",
    "authors": [
      "Pengzhou Cheng",
      "Lei Hua",
      "Haobin Jiang",
      "Gongshen Liu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.03200",
    "title": "Uncovering local aggregated air quality index with smartphone captured  images leveraging efficient deep convolutional neural network",
    "abstract": " Comments: 18 pages, 7 figures, submitted to Nature Scientific Reports ",
    "url": "https://arxiv.org/abs/2308.03200",
    "authors": [
      "Joyanta Jyoti Mondal",
      "Md. Farhadul Islam",
      "Raima Islam",
      "Nowsin Kabir Rhidi",
      "Sarfaraz Newaz",
      "A. B. M. Alim Al Islam",
      "Meem Arafat Manab",
      "Jannatun Noor"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.09421",
    "title": "MonoNeRD: NeRF-like Representations for Monocular 3D Object Detection",
    "abstract": " Comments: Accepted by ICCV 2023 ",
    "url": "https://arxiv.org/abs/2308.09421",
    "authors": [
      "Junkai Xu",
      "Liang Peng",
      "Haoran Cheng",
      "Hao Li",
      "Wei Qian",
      "Ke Li",
      "Wenxiao Wang",
      "Deng Cai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.04737",
    "title": "Learning Spiking Neural Network from Easy to Hard task",
    "abstract": " Title: Learning Spiking Neural Network from Easy to Hard task ",
    "url": "https://arxiv.org/abs/2309.04737",
    "authors": [
      "Lingling Tang",
      "Jiangtao Hu",
      "Hua Yu",
      "Surui Liu",
      "Jielei Chu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.06118",
    "title": "CHITNet: A Complementary to Harmonious Information Transfer Network for  Infrared and Visible Image Fusion",
    "abstract": " Title: CHITNet: A Complementary to Harmonious Information Transfer Network for  Infrared and Visible Image Fusion ",
    "url": "https://arxiv.org/abs/2309.06118",
    "authors": [
      "Yafei Zhang",
      "Keying Du",
      "Huafeng Li",
      "Zhengtao Yu",
      "Yu Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.08690",
    "title": "BANSAC: A dynamic BAyesian Network for adaptive SAmple Consensus",
    "abstract": " Comments: ICCV 2023 paper ",
    "url": "https://arxiv.org/abs/2309.08690",
    "authors": [
      "Valter Piedade",
      "Pedro Miraldo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.11798",
    "title": "A Comprehensive Review of Community Detection in Graphs",
    "abstract": " Title: A Comprehensive Review of Community Detection in Graphs ",
    "url": "https://arxiv.org/abs/2309.11798",
    "authors": [
      "Songning Lai",
      "Jiakang Li",
      "Yonggang Lu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.11845",
    "title": "TMac: Temporal Multi-Modal Graph Learning for Acoustic Event  Classification",
    "abstract": " Comments: This work has been accepted by ACM MM 2023 for publication ",
    "url": "https://arxiv.org/abs/2309.11845",
    "authors": [
      "Meng Liu",
      "Ke Liang",
      "Dayu Hu",
      "Hao Yu",
      "Yue Liu",
      "Lingyuan Meng",
      "Wenxuan Tu",
      "Sihang Zhou",
      "Xinwang Liu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2309.12694",
    "title": "Recurrent Temporal Revision Graph Networks",
    "abstract": " Title: Recurrent Temporal Revision Graph Networks ",
    "url": "https://arxiv.org/abs/2309.12694",
    "authors": [
      "Yizhou Chen",
      "Anxiang Zeng",
      "Guangda Huzhang",
      "Qingtao Yu",
      "Kerui Zhang",
      "Cao Yuanpeng",
      "Kangle Wu",
      "Han Yu",
      "Zhiming Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2309.13226",
    "title": "Real3D-AD: A Dataset of Point Cloud Anomaly Detection",
    "abstract": " Title: Real3D-AD: A Dataset of Point Cloud Anomaly Detection ",
    "url": "https://arxiv.org/abs/2309.13226",
    "authors": [
      "Jiaqi Liu",
      "Guoyang Xie",
      "Ruitao Chen",
      "Xinpeng Li",
      "Jinbao Wang",
      "Yong Liu",
      "Chengjie Wang",
      "Feng Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.13575",
    "title": "Probabilistic Weight Fixing: Large-scale training of neural network  weight uncertainties for quantization",
    "abstract": " Title: Probabilistic Weight Fixing: Large-scale training of neural network  weight uncertainties for quantization ",
    "url": "https://arxiv.org/abs/2309.13575",
    "authors": [
      "Christopher Subia-Waud",
      "Srinandan Dasmahapatra"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.13690",
    "title": "Scalable data concentrator with baseline interconnection network for  triggerless data acquisition systems",
    "abstract": " Title: Scalable data concentrator with baseline interconnection network for  triggerless data acquisition systems ",
    "url": "https://arxiv.org/abs/2309.13690",
    "authors": [
      "Wojciech M. Zabołotny"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2309.13781",
    "title": "Explainable Machine Learning for ICU Readmission Prediction",
    "abstract": " Title: Explainable Machine Learning for ICU Readmission Prediction ",
    "url": "https://arxiv.org/abs/2309.13781",
    "authors": [
      "Alex G. C. de Sá",
      "Daniel Gould",
      "Anna Fedyukova",
      "Mitchell Nicholas",
      "Lucy Dockrell",
      "Calvin Fletcher",
      "David Pilcher",
      "Daniel Capurro",
      "David B. Ascher",
      "Khaled El-Khawas",
      "Douglas E. V. Pires"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.13866",
    "title": "On Calibration of Modern Quantized Efficient Neural Networks",
    "abstract": " Comments: Accepted as an extended abstract at the ICCV 2023 Workshop on Low-Bit Quantized Neural Networks. Corrected some typos ",
    "url": "https://arxiv.org/abs/2309.13866",
    "authors": [
      "Joey Kuang",
      "Alexander Wong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.13881",
    "title": "Skip-Connected Neural Networks with Layout Graphs for Floor Plan  Auto-Generation",
    "abstract": " Title: Skip-Connected Neural Networks with Layout Graphs for Floor Plan  Auto-Generation ",
    "url": "https://arxiv.org/abs/2309.13881",
    "authors": [
      "Yuntae Jeon",
      "Dai Quoc Tran",
      "Seunghee Park"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.14050",
    "title": "NNgTL: Neural Network Guided Optimal Temporal Logic Task Planning for  Mobile Robots",
    "abstract": " Comments: submitted ",
    "url": "https://arxiv.org/abs/2309.14050",
    "authors": [
      "Ruijia Liu",
      "Shaoyuan Li",
      "Xiang Yin"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2309.14065",
    "title": "AsymFormer: Asymmetrical Cross-Modal Representation Learning for Mobile  Platform Real-Time RGB-D Semantic Segmentation",
    "abstract": " Title: AsymFormer: Asymmetrical Cross-Modal Representation Learning for Mobile  Platform Real-Time RGB-D Semantic Segmentation ",
    "url": "https://arxiv.org/abs/2309.14065",
    "authors": [
      "Siqi Du",
      "Weixi Wang",
      "Renzhong Guo",
      "Shengjun Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]