[
  {
    "id": "arXiv:2401.08579",
    "title": "Curve-based Neural Style Transfer",
    "abstract": "This research presents a new parametric style transfer framework specifically designed for curve-based design sketches. In this research, traditional challenges faced by neural style transfer methods in handling binary sketch transformations are effectively addressed through the utilization of parametric shape-editing rules, efficient curve-to-pixel conversion techniques, and the fine-tuning of VGG19 on ImageNet-Sketch, enhancing its role as a feature pyramid network for precise style extraction. By harmonizing intuitive curve-based imagery with rule-based editing, this study holds the potential to significantly enhance design articulation and elevate the practice of style transfer within the realm of product design. ",
    "url": "https://arxiv.org/abs/2401.08579",
    "authors": [
      "Yu-hsuan Chen",
      "Levent Burak Kara",
      "Jonathan Cagan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2401.08581",
    "title": "Temporal Embeddings: Scalable Self-Supervised Temporal Representation  Learning from Spatiotemporal Data for Multimodal Computer Vision",
    "abstract": "There exists a correlation between geospatial activity temporal patterns and type of land use. A novel self-supervised approach is proposed to stratify landscape based on mobility activity time series. First, the time series signal is transformed to the frequency domain and then compressed into task-agnostic temporal embeddings by a contractive autoencoder, which preserves cyclic temporal patterns observed in time series. The pixel-wise embeddings are converted to image-like channels that can be used for task-based, multimodal modeling of downstream geospatial tasks using deep semantic segmentation. Experiments show that temporal embeddings are semantically meaningful representations of time series data and are effective across different tasks such as classifying residential area and commercial areas. Temporal embeddings transform sequential, spatiotemporal motion trajectory data into semantically meaningful image-like tensor representations that can be combined (multimodal fusion) with other data modalities that are or can be transformed into image-like tensor representations (for e.g., RBG imagery, graph embeddings of road networks, passively collected imagery like SAR, etc.) to facilitate multimodal learning in geospatial computer vision. Multimodal computer vision is critical for training machine learning models for geospatial feature detection to keep a geospatial mapping service up-to-date in real-time and can significantly improve user experience and above all, user safety. ",
    "url": "https://arxiv.org/abs/2401.08581",
    "authors": [
      "Yi Cao",
      "Swetava Ganguli",
      "Vipul Pandey"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08588",
    "title": "Improved Pothole Detection Using YOLOv7 and ESRGAN",
    "abstract": "Potholes are common road hazards that is causing damage to vehicles and posing a safety risk to drivers. The introduction of Convolutional Neural Networks (CNNs) is widely used in the industry for object detection based on Deep Learning methods and has achieved significant progress in hardware improvement and software implementations. In this paper, a unique better algorithm is proposed to warrant the use of low-resolution cameras or low-resolution images and video feed for automatic pothole detection using Super Resolution (SR) through Super Resolution Generative Adversarial Networks (SRGANs). Then we have proceeded to establish a baseline pothole detection performance on low quality and high quality dashcam images using a You Only Look Once (YOLO) network, namely the YOLOv7 network. We then have illustrated and examined the speed and accuracy gained above the benchmark after having upscaling implementation on the low quality images. ",
    "url": "https://arxiv.org/abs/2401.08588",
    "authors": [
      "Nirmal Kumar Rout",
      "Gyanateet Dutta",
      "Varun Sinha",
      "Arghadeep Dey",
      "Subhrangshu Mukherjee",
      "Gopal Gupta"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.08603",
    "title": "Representation Learning in a Decomposed Encoder Design for Bio-inspired  Hebbian Learning",
    "abstract": "Modern data-driven machine learning system designs exploit inductive biases on architectural structure, invariance and equivariance requirements, task specific loss functions, and computational optimization tools. Previous works have illustrated that inductive bias in the early layers of the encoder in the form of human specified quasi-invariant filters can serve as a powerful inductive bias to attain better robustness and transparency in learned classifiers. This paper explores this further in the context of representation learning with local plasticity rules i.e. bio-inspired Hebbian learning . We propose a modular framework trained with a bio-inspired variant of contrastive predictive coding (Hinge CLAPP Loss). Our framework is composed of parallel encoders each leveraging a different invariant visual descriptor as an inductive bias. We evaluate the representation learning capacity of our system in a classification scenario on image data of various difficulties (GTSRB, STL10, CODEBRIM) as well as video data (UCF101). Our findings indicate that this form of inductive bias can be beneficial in closing the gap between models with local plasticity rules and backpropagation models as well as learning more robust representations in general. ",
    "url": "https://arxiv.org/abs/2401.08603",
    "authors": [
      "Achref Jaziri",
      "Sina Ditzel",
      "Iuliia Pliushch",
      "Visvanathan Ramesh"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08609",
    "title": "F4D: Factorized 4D Convolutional Neural Network for Efficient  Video-level Representation Learning",
    "abstract": "Recent studies have shown that video-level representation learning is crucial to the capture and understanding of the long-range temporal structure for video action recognition. Most existing 3D convolutional neural network (CNN)-based methods for video-level representation learning are clip-based and focus only on short-term motion and appearances. These CNN-based methods lack the capacity to incorporate and model the long-range spatiotemporal representation of the underlying video and ignore the long-range video-level context during training. In this study, we propose a factorized 4D CNN architecture with attention (F4D) that is capable of learning more effective, finer-grained, long-term spatiotemporal video representations. We demonstrate that the proposed F4D architecture yields significant performance improvements over the conventional 2D, and 3D CNN architectures proposed in the literature. Experiment evaluation on five action recognition benchmark datasets, i.e., Something-Something-v1, SomethingSomething-v2, Kinetics-400, UCF101, and HMDB51 demonstrate the effectiveness of the proposed F4D network architecture for video-level action recognition. ",
    "url": "https://arxiv.org/abs/2401.08609",
    "authors": [
      "Mohammad Al-Saad",
      "Lakshmish Ramaswamy",
      "Suchendra Bhandarkar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.08615",
    "title": "Online Anomaly Detection over Live Social Video Streaming",
    "abstract": "Social video anomaly is an observation in video streams that does not conform to a common pattern of dataset's behaviour. Social video anomaly detection plays a critical role in applications from e-commerce to e-learning. Traditionally, anomaly detection techniques are applied to find anomalies in video broadcasting. However, they neglect the live social video streams which contain interactive talk, speech, or lecture with audience. In this paper, we propose a generic framework for effectively online detecting Anomalies Over social Video LIve Streaming (AOVLIS). Specifically, we propose a novel deep neural network model called Coupling Long Short-Term Memory (CLSTM) that adaptively captures the history behaviours of the presenters and audience, and their mutual interactions to predict their behaviour at next time point over streams. Then we well integrate the CLSTM with a decoder layer, and propose a new reconstruction error-based scoring function $RE_{IA}$ to calculate the anomaly score of each video segment for anomaly detection. After that, we propose a novel model update scheme that incrementally maintains CLSTM and decoder. Moreover, we design a novel upper bound and ADaptive Optimisation Strategy (ADOS) for improving the efficiency of our solution. Extensive experiments are conducted to prove the superiority of AOVLIS. ",
    "url": "https://arxiv.org/abs/2401.08615",
    "authors": [
      "Chengkun He",
      "Xiangmin Zhou",
      "Chen Wang",
      "Iqbal Gondal",
      "Jie Shao",
      "Xun Yi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.08624",
    "title": "Towards Practical Cell-Free 6G Network Deployments: An Open-Source  End-to-End Ray Tracing Simulator",
    "abstract": "The advent of 6G wireless communication marks a transformative era in technological connectivity, bringing forth challenges and opportunities alike. This paper unveils an innovative, open-source simulator, meticulously crafted for cell-free 6G wireless networks. This simulator is not just a tool but a gateway to the future, blending cutting-edge channel models with the simulation of both physical propagation effects and intricate system-level protocols. It stands at the forefront of technological advancement by integrating LIS and MIMO technologies, harnessing the power of the Unity game engine for efficient ray-tracing and GPU-accelerated computations. The unparalleled flexibility in scenario configuration, coupled with its unique ability to dynamically simulate interactions across network layers, establishes this simulator as an indispensable asset in pioneering &G systems' research and development. ",
    "url": "https://arxiv.org/abs/2401.08624",
    "authors": [
      "William Tärneberg",
      "Aleksei Fedorov",
      "Gilles Callebaut",
      "Liesbet Van der Perre",
      "Emma Fitzgerald"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2401.08629",
    "title": "Immature Green Apple Detection and Sizing in Commercial Orchards using  YOLOv8 and Shape Fitting Techniques",
    "abstract": "Detecting and estimating size of apples during the early stages of growth is crucial for predicting yield, pest management, and making informed decisions related to crop-load management, harvest and post-harvest logistics, and marketing. Traditional fruit size measurement methods are laborious and time-consuming. This study employs the state-of-the-art YOLOv8 object detection and instance segmentation algorithm in conjunction with geometric shape fitting techniques on 3D point cloud data to accurately determine the size of immature green apples (or fruitlet) in a commercial orchard environment. The methodology utilized two RGB-D sensors: the Intel RealSense D435i and the Microsoft Azure Kinect DK. Notably, the YOLOv8 instance segmentation models exhibited proficiency in immature green apple detection, with the YOLOv8m-seg model clinching the highest AP@0.5 and AP@0.75 scores of 0.94 and 0.91, respectively. Leveraging the ellipsoid fitting technique on images from the Azure Kinect, we observed remarkable metrics, including an RMSE of 2.35, MAE of 1.66, MAPE of 6.15, and an R-squared value of 0.9. Challenges such as partial occlusion, where YOLOv8 sometimes misinterpreted immature green apple clusters, were recognized. In a comparison of 102 outdoor samples, the Microsoft Azure Kinect showed better performance than the Intel Realsense D435i, as supported by the MAE data. This study emphasizes the combined effectiveness of shape-fitting methods and 3D sensors in improving fruitlet sizing for agriculture. ",
    "url": "https://arxiv.org/abs/2401.08629",
    "authors": [
      "Ranjan Sapkota",
      "Dawood Ahmed",
      "Martin Churuvija",
      "Manoj Karkee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.08633",
    "title": "Creating Visual Effects with Neural Radiance Fields",
    "abstract": "We present a pipeline for integrating NeRFs into traditional compositing VFX pipelines using Nerfstudio, an open-source framework for training and rendering NeRFs. Our approach involves using Blender, a widely used open-source 3D creation software, to align camera paths and composite NeRF renders with meshes and other NeRFs, allowing for seamless integration of NeRFs into traditional VFX pipelines. Our NeRF Blender add-on allows for more controlled camera trajectories of photorealistic scenes, compositing meshes and other environmental effects with NeRFs, and compositing multiple NeRFs in a single scene.This approach of generating NeRF aligned camera paths can be adapted to other 3D tool sets and workflows, enabling a more seamless integration of NeRFs into visual effects and film production. Documentation can be found here: https://docs.nerf.studio/extensions/blender_addon.html ",
    "url": "https://arxiv.org/abs/2401.08633",
    "authors": [
      "Cyrus Vachha"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2401.08634",
    "title": "Resilient Path Planning for UAVs in Data Collection under Adversarial  Attacks",
    "abstract": "In this paper, we investigate jamming-resilient UAV path planning strategies for data collection in Internet of Things (IoT) networks, in which the typical UAV can learn the optimal trajectory to elude such jamming attacks. Specifically, the typical UAV is required to collect data from multiple distributed IoT nodes under collision avoidance, mission completion deadline, and kinematic constraints in the presence of jamming attacks. We first design a fixed ground jammer with continuous jamming attack and periodical jamming attack strategies to jam the link between the typical UAV and IoT nodes. Defensive strategies involving a reinforcement learning (RL) based virtual jammer and the adoption of higher SINR thresholds are proposed to counteract against such attacks. Secondly, we design an intelligent UAV jammer, which utilizes the RL algorithm to choose actions based on its observation. Then, an intelligent UAV anti-jamming strategy is constructed to deal with such attacks, and the optimal trajectory of the typical UAV is obtained via dueling double deep Q-network (D3QN). Simulation results show that both non-intelligent and intelligent jamming attacks have significant influence on the UAV's performance, and the proposed defense strategies can recover the performance close to that in no-jammer scenarios. ",
    "url": "https://arxiv.org/abs/2401.08634",
    "authors": [
      "Xueyuan Wang",
      "M. Cenk Gursoy"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2401.08649",
    "title": "Deep Pulse-Coupled Neural Networks",
    "abstract": "Spiking Neural Networks (SNNs) capture the information processing mechanism of the brain by taking advantage of spiking neurons, such as the Leaky Integrate-and-Fire (LIF) model neuron, which incorporates temporal dynamics and transmits information via discrete and asynchronous spikes. However, the simplified biological properties of LIF ignore the neuronal coupling and dendritic structure of real neurons, which limits the spatio-temporal dynamics of neurons and thus reduce the expressive power of the resulting SNNs. In this work, we leverage a more biologically plausible neural model with complex dynamics, i.e., a pulse-coupled neural network (PCNN), to improve the expressiveness and recognition performance of SNNs for vision tasks. The PCNN is a type of cortical model capable of emulating the complex neuronal activities in the primary visual cortex. We construct deep pulse-coupled neural networks (DPCNNs) by replacing commonly used LIF neurons in SNNs with PCNN neurons. The intra-coupling in existing PCNN models limits the coupling between neurons only within channels. To address this limitation, we propose inter-channel coupling, which allows neurons in different feature maps to interact with each other. Experimental results show that inter-channel coupling can efficiently boost performance with fewer neurons, synapses, and less training time compared to widening the networks. For instance, compared to the LIF-based SNN with wide VGG9, DPCNN with VGG9 uses only 50%, 53%, and 73% of neurons, synapses, and training time, respectively. Furthermore, we propose receptive field and time dependent batch normalization (RFTD-BN) to speed up the convergence and performance of DPCNNs. ",
    "url": "https://arxiv.org/abs/2401.08649",
    "authors": [
      "Zexiang Yi",
      "Jing Lian",
      "Yunliang Qi",
      "Zhaofei Yu",
      "Huajin Tang",
      "Yide Ma",
      "Jizhao Liu"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08663",
    "title": "An Integrated Imitation and Reinforcement Learning Methodology for  Robust Agile Aircraft Control with Limited Pilot Demonstration Data",
    "abstract": "In this paper, we present a methodology for constructing data-driven maneuver generation models for agile aircraft that can generalize across a wide range of trim conditions and aircraft model parameters. Maneuver generation models play a crucial role in the testing and evaluation of aircraft prototypes, providing insights into the maneuverability and agility of the aircraft. However, constructing the models typically requires extensive amounts of real pilot data, which can be time-consuming and costly to obtain. Moreover, models built with limited data often struggle to generalize beyond the specific flight conditions covered in the original dataset. To address these challenges, we propose a hybrid architecture that leverages a simulation model, referred to as the source model. This open-source agile aircraft simulator shares similar dynamics with the target aircraft and allows us to generate unlimited data for building a proxy maneuver generation model. We then fine-tune this model to the target aircraft using a limited amount of real pilot data. Our approach combines techniques from imitation learning, transfer learning, and reinforcement learning to achieve this objective. To validate our methodology, we utilize real agile pilot data provided by Turkish Aerospace Industries (TAI). By employing the F-16 as the source model, we demonstrate that it is possible to construct a maneuver generation model that generalizes across various trim conditions and aircraft parameters without requiring any additional real pilot data. Our results showcase the effectiveness of our approach in developing robust and adaptable models for agile aircraft. ",
    "url": "https://arxiv.org/abs/2401.08663",
    "authors": [
      "Gulay Goktas Sever",
      "Umut Demir",
      "Abdullah Sadik Satir",
      "Mustafa Cagatay Sahin",
      "Nazim Kemal Ure"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2401.08683",
    "title": "Zero-Shot RTL Code Generation with Attention Sink Augmented Large  Language Models",
    "abstract": "The design and optimization of hardware have traditionally been resource-intensive, demanding considerable expertise and dependence on established design automation tools. This paper discusses the possibility of exploiting large language models to streamline the code generation process in hardware design. In contrast to earlier studies, this paper aims to use large language models that accepts high-level design specifications through a single prompt to generate corresponding Register-Transfer Level (RTL) code. The ability to use large language models on RTL code generation not only expedites design iteration cycles but also facilitates the exploration of design spaces that have computational challenges for conventional techniques. Through our evaluation, we demonstrate the shortcoming of existing attention mechanisms, and present the abilities of language models to produce functional, optimized, and industry-standard compliant RTL code when a novel attention mechanism is used. These findings underscore the expanding role of large language models in shaping the future landscape of architectural exploration and automation in hardware design. ",
    "url": "https://arxiv.org/abs/2401.08683",
    "authors": [
      "Selim Sandal",
      "Ismail Akturk"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2401.08689",
    "title": "NODI: Out-Of-Distribution Detection with Noise from Diffusion",
    "abstract": "Out-of-distribution (OOD) detection is a crucial part of deploying machine learning models safely. It has been extensively studied with a plethora of methods developed in the literature. This problem is tackled with an OOD score computation, however, previous methods compute the OOD scores with limited usage of the in-distribution dataset. For instance, the OOD scores are computed with information from a small portion of the in-distribution data. Furthermore, these methods encode images with a neural image encoder. The robustness of these methods is rarely checked with respect to image encoders of different training methods and architectures. In this work, we introduce the diffusion process into the OOD task. The diffusion model integrates information on the whole training set into the predicted noise vectors. What's more, we deduce a closed-form solution for the noise vector (stable point). Then the noise vector is converted into our OOD score, we test both the deep model predicted noise vector and the closed-form noise vector on the OOD benchmarks \\cite{openood}. Our method outperforms previous OOD methods across all types of image encoders (Table. \\ref{main}). A $3.5\\%$ performance gain is achieved with the MAE-based image encoder. Moreover, we studied the robustness of OOD methods by applying different types of image encoders. Some OOD methods failed to generalize well when switching image encoders from ResNet to Vision Transformers, our method performs exhibits good robustness with all the image encoders. ",
    "url": "https://arxiv.org/abs/2401.08689",
    "authors": [
      "Jingqiu Zhou",
      "Aojun Zou",
      "Hongshen Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08696",
    "title": "Hierarchical Source-to-Post-Route QoR Prediction in High-Level Synthesis  with GNNs",
    "abstract": "High-level synthesis (HLS) notably speeds up the hardware design process by avoiding RTL programming. However, the turnaround time of HLS increases significantly when post-route quality of results (QoR) are considered during optimization. To tackle this issue, we propose a hierarchical post-route QoR prediction approach for FPGA HLS, which features: (1) a modeling flow that directly estimates latency and post-route resource usage from C/C++ programs; (2) a graph construction method that effectively represents the control and data flow graph of source code and effects of HLS pragmas; and (3) a hierarchical GNN training and prediction method capable of capturing the impact of loop hierarchies. Experimental results show that our method presents a prediction error of less than 10% for different types of QoR metrics, which gains tremendous improvement compared with the state-of-the-art GNN methods. By adopting our proposed methodology, the runtime for design space exploration in HLS is shortened to tens of minutes and the achieved ADRS is reduced to 6.91% on average. ",
    "url": "https://arxiv.org/abs/2401.08696",
    "authors": [
      "Mingzhe Gao",
      "Jieru Zhao",
      "Zhe Lin",
      "Minyi Guo"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08714",
    "title": "Training program on sign language: social inclusion through Virtual  Reality in ISENSE project",
    "abstract": "Structured hand gestures that incorporate visual motions and signs are used in sign language. Sign language is a valuable means of daily communication for individuals who are deaf or have speech impairments, but it is still rare among hearing people, and fewer are capable of understand it. Within the academic context, parents and teachers play a crucial role in supporting deaf students from childhood by facilitating their learning of sign language. In the last years, among all the teaching tools useful for learning sign language, the use of Virtual Reality (VR) has increased, as it has been demonstrated to improve retention, memory and attention during the learning process. The ISENSE project has been created to assist students with deafness during their academic life by proposing different technological tools for teaching sign language to the hearing community in the academic context. As part of the ISENSE project, this work aims to develop an application for Spanish and Italian sign language recognition that exploits the VR environment to quickly and easily create a comprehensive database of signs and an Artificial Intelligence (AI)-based software to accurately classify and recognize static and dynamic signs: from letters to sentences. ",
    "url": "https://arxiv.org/abs/2401.08714",
    "authors": [
      "Alessia Bisio",
      "Enrique Yeguas-Bolívar",
      "Pilar Aparicio-Martínez",
      "María Dolores Redel-Macías",
      "Sara Pinzi",
      "Stefano Rossi",
      "Juri Taborri"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2401.08717",
    "title": "Robust DOA estimation using deep acoustic imaging",
    "abstract": "Direction of arrival estimation (DoAE) aims at tracking a sound in azimuth and elevation. Recent advancements include data-driven models with inputs derived from ambisonics intensity vectors or correlations between channels in a microphone array. A spherical intensity map (SIM), or acoustic image, is an alternative input representation that remains underexplored. SIMs benefit from high-resolution microphone arrays, yet most DoAE datasets use low-resolution ones. Therefore, we first propose a super-resolution method to upsample low-resolution microphones. Next, we benchmark DoAE models that use SIMs as input. We arrive to a model that uses SIMs for DoAE estimation and outperforms a baseline and a state-of-the-art model. Our study highlights the relevance of acoustic imaging for DoAE tasks. ",
    "url": "https://arxiv.org/abs/2401.08717",
    "authors": [
      "Adrian S. Roman",
      "Iran R. Roman",
      "Juan P. Bello"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2401.08725",
    "title": "Revealing Vulnerabilities in Stable Diffusion via Targeted Attacks",
    "abstract": "Recent developments in text-to-image models, particularly Stable Diffusion, have marked significant achievements in various applications. With these advancements, there are growing safety concerns about the vulnerability of the model that malicious entities exploit to generate targeted harmful images. However, the existing methods in the vulnerability of the model mainly evaluate the alignment between the prompt and generated images, but fall short in revealing the vulnerability associated with targeted image generation. In this study, we formulate the problem of targeted adversarial attack on Stable Diffusion and propose a framework to generate adversarial prompts. Specifically, we design a gradient-based embedding optimization method to craft reliable adversarial prompts that guide stable diffusion to generate specific images. Furthermore, after obtaining successful adversarial prompts, we reveal the mechanisms that cause the vulnerability of the model. Extensive experiments on two targeted attack tasks demonstrate the effectiveness of our method in targeted attacks. The code can be obtained in https://github.com/datar001/Revealing-Vulnerabilities-in-Stable-Diffusion-via-Targeted-Attacks. ",
    "url": "https://arxiv.org/abs/2401.08725",
    "authors": [
      "Chenyu Zhang",
      "Lanjun Wang",
      "Anan Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.08727",
    "title": "MA2GCN: Multi Adjacency relationship Attention Graph Convolutional  Networks for Traffic Prediction using Trajectory data",
    "abstract": "The problem of traffic congestion not only causes a large amount of economic losses, but also seriously endangers the urban environment. Predicting traffic congestion has important practical significance. So far, most studies have been based on historical data from sensors placed on different roads to predict future traffic flow and speed, to analyze the traffic congestion conditions of a certain road segment. However, due to the fixed position of sensors, it is difficult to mine new information. On the other hand, vehicle trajectory data is more flexible and can extract traffic information as needed. Therefore, we proposed a new traffic congestion prediction model - Multi Adjacency relationship Attention Graph Convolutional Networks(MA2GCN). This model transformed vehicle trajectory data into graph structured data in grid form, and proposed a vehicle entry and exit matrix based on the mobility between different grids. At the same time, in order to improve the performance of the model, this paper also built a new adaptive adjacency matrix generation method and adjacency matrix attention module. This model mainly used gated temporal convolution and graph convolution to extract temporal and spatial information, respectively. Compared with multiple baselines, our model achieved the best performance on Shanghai taxi GPS trajectory dataset. The code is available at https://github.com/zachysun/Taxi Traffic Benchmark. ",
    "url": "https://arxiv.org/abs/2401.08727",
    "authors": [
      "Zhengke Sun",
      "Yuliang Ma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.08734",
    "title": "Bag of Tricks to Boost Adversarial Transferability",
    "abstract": "Deep neural networks are widely known to be vulnerable to adversarial examples. However, vanilla adversarial examples generated under the white-box setting often exhibit low transferability across different models. Since adversarial transferability poses more severe threats to practical applications, various approaches have been proposed for better transferability, including gradient-based, input transformation-based, and model-related attacks, \\etc. In this work, we find that several tiny changes in the existing adversarial attacks can significantly affect the attack performance, \\eg, the number of iterations and step size. Based on careful studies of existing adversarial attacks, we propose a bag of tricks to enhance adversarial transferability, including momentum initialization, scheduled step size, dual example, spectral-based input transformation, and several ensemble strategies. Extensive experiments on the ImageNet dataset validate the high effectiveness of our proposed tricks and show that combining them can further boost adversarial transferability. Our work provides practical insights and techniques to enhance adversarial transferability, and offers guidance to improve the attack performance on the real-world application through simple adjustments. ",
    "url": "https://arxiv.org/abs/2401.08734",
    "authors": [
      "Zeliang Zhang",
      "Rongyi Zhu",
      "Wei Yao",
      "Xiaosen Wang",
      "Chenliang Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08809",
    "title": "Learning Implicit Representation for Reconstructing Articulated Objects",
    "abstract": "3D Reconstruction of moving articulated objects without additional information about object structure is a challenging problem. Current methods overcome such challenges by employing category-specific skeletal models. Consequently, they do not generalize well to articulated objects in the wild. We treat an articulated object as an unknown, semi-rigid skeletal structure surrounded by nonrigid material (e.g., skin). Our method simultaneously estimates the visible (explicit) representation (3D shapes, colors, camera parameters) and the implicit skeletal representation, from motion cues in the object video without 3D supervision. Our implicit representation consists of four parts. (1) Skeleton, which specifies how semi-rigid parts are connected. (2) \\textcolor{black}{Skinning Weights}, which associates each surface vertex with semi-rigid parts with probability. (3) Rigidity Coefficients, specifying the articulation of the local surface. (4) Time-Varying Transformations, which specify the skeletal motion and surface deformation parameters. We introduce an algorithm that uses physical constraints as regularization terms and iteratively estimates both implicit and explicit representations. Our method is category-agnostic, thus eliminating the need for category-specific skeletons, we show that our method outperforms state-of-the-art across standard video datasets. ",
    "url": "https://arxiv.org/abs/2401.08809",
    "authors": [
      "Hao Zhang",
      "Fang Li",
      "Samyak Rawlekar",
      "Narendra Ahuja"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.08815",
    "title": "Adversarial Supervision Makes Layout-to-Image Diffusion Models Thrive",
    "abstract": "Despite the recent advances in large-scale diffusion models, little progress has been made on the layout-to-image (L2I) synthesis task. Current L2I models either suffer from poor editability via text or weak alignment between the generated image and the input layout. This limits their usability in practice. To mitigate this, we propose to integrate adversarial supervision into the conventional training pipeline of L2I diffusion models (ALDM). Specifically, we employ a segmentation-based discriminator which provides explicit feedback to the diffusion generator on the pixel-level alignment between the denoised image and the input layout. To encourage consistent adherence to the input layout over the sampling steps, we further introduce the multistep unrolling strategy. Instead of looking at a single timestep, we unroll a few steps recursively to imitate the inference process, and ask the discriminator to assess the alignment of denoised images with the layout over a certain time window. Our experiments show that ALDM enables layout faithfulness of the generated images, while allowing broad editability via text prompts. Moreover, we showcase its usefulness for practical applications: by synthesizing target distribution samples via text control, we improve domain generalization of semantic segmentation models by a large margin (~12 mIoU points). ",
    "url": "https://arxiv.org/abs/2401.08815",
    "authors": [
      "Yumeng Li",
      "Margret Keuper",
      "Dan Zhang",
      "Anna Khoreva"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08818",
    "title": "Link Me Baby One More Time: Social Music Discovery on Spotify",
    "abstract": "We explore the social and contextual factors that influence the outcome of person-to-person music recommendations and discovery. Specifically, we use data from Spotify to investigate how a link sent from one user to another results in the receiver engaging with the music of the shared artist. We consider several factors that may influence this process, such as the strength of the sender-receiver relationship, the user's role in the Spotify social network, their music social cohesion, and how similar the new artist is to the receiver's taste. We find that the receiver of a link is more likely to engage with a new artist when (1) they have similar music taste to the sender and the shared track is a good fit for their taste, (2) they have a stronger and more intimate tie with the sender, and (3) the shared artist is popular with the receiver's connections. Finally, we use these findings to build a Random Forest classifier to predict whether a shared music track will result in the receiver's engagement with the shared artist. This model elucidates which type of social and contextual features are most predictive, although peak performance is achieved when a diverse set of features are included. These findings provide new insights into the multifaceted mechanisms underpinning the interplay between music discovery and social processes. ",
    "url": "https://arxiv.org/abs/2401.08818",
    "authors": [
      "Shazia'Ayn Babul",
      "Desislava Hristova",
      "Antonio Lima",
      "Renaud Lambiotte",
      "Mariano Beguerisse-Díaz"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2401.08822",
    "title": "An Empirical Study of Counterfactual Visualization to Support Visual  Causal Inference",
    "abstract": "Counterfactuals -- expressing what might have been true under different circumstances -- have been widely applied in statistics and machine learning to help understand causal relationships. More recently, counterfactuals have begun to emerge as a technique being applied within visualization research. However, it remains unclear to what extent counterfactuals can aid with visual data communication. In this paper, we primarily focus on assessing the quality of users' understanding of data when provided with counterfactual visualizations. We propose a preliminary model of causality comprehension by connecting theories from causal inference and visual data communication. Leveraging this model, we conducted an empirical study to explore how counterfactuals can improve users' understanding of data in static visualizations. Our results indicate that visualizing counterfactuals had a positive impact on participants' interpretations of causal relations within datasets. These results motivate a discussion of how to more effectively incorporate counterfactuals into data visualizations. ",
    "url": "https://arxiv.org/abs/2401.08822",
    "authors": [
      "Arran Zeyu Wang",
      "David Borland",
      "David Gotz"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2401.08825",
    "title": "AiGen-FoodReview: A Multimodal Dataset of Machine-Generated Restaurant  Reviews and Images on Social Media",
    "abstract": "Online reviews in the form of user-generated content (UGC) significantly impact consumer decision-making. However, the pervasive issue of not only human fake content but also machine-generated content challenges UGC's reliability. Recent advances in Large Language Models (LLMs) may pave the way to fabricate indistinguishable fake generated content at a much lower cost. Leveraging OpenAI's GPT-4-Turbo and DALL-E-2 models, we craft AiGen-FoodReview, a multi-modal dataset of 20,144 restaurant review-image pairs divided into authentic and machine-generated. We explore unimodal and multimodal detection models, achieving 99.80% multimodal accuracy with FLAVA. We use attributes from readability and photographic theories to score reviews and images, respectively, demonstrating their utility as hand-crafted features in scalable and interpretable detection models, with comparable performance. The paper contributes by open-sourcing the dataset and releasing fake review detectors, recommending its use in unimodal and multimodal fake review detection tasks, and evaluating linguistic and visual features in synthetic versus authentic data. ",
    "url": "https://arxiv.org/abs/2401.08825",
    "authors": [
      "Alessandro Gambetti",
      "Qiwei Han"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.08840",
    "title": "Efficient Neural Representation of Volumetric Data using  Coordinate-Based Networks",
    "abstract": "In this paper, we propose an efficient approach for the compression and representation of volumetric data utilizing coordinate-based networks and multi-resolution hash encoding. Efficient compression of volumetric data is crucial for various applications, such as medical imaging and scientific simulations. Our approach enables effective compression by learning a mapping between spatial coordinates and intensity values. We compare different encoding schemes and demonstrate the superiority of multi-resolution hash encoding in terms of compression quality and training efficiency. Furthermore, we leverage optimization-based meta-learning, specifically using the Reptile algorithm, to learn weight initialization for neural representations tailored to volumetric data, enabling faster convergence during optimization. Additionally, we compare our approach with state-of-the-art methods to showcase improved image quality and compression ratios. These findings highlight the potential of coordinate-based networks and multi-resolution hash encoding for an efficient and accurate representation of volumetric data, paving the way for advancements in large-scale data visualization and other applications. ",
    "url": "https://arxiv.org/abs/2401.08840",
    "authors": [
      "Sudarshan Devkota",
      "Sumanta Pattanaik"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2401.08860",
    "title": "Cross-Level Multi-Instance Distillation for Self-Supervised Fine-Grained  Visual Categorization",
    "abstract": "High-quality annotation of fine-grained visual categories demands great expert knowledge, which is taxing and time consuming. Alternatively, learning fine-grained visual representation from enormous unlabeled images (e.g., species, brands) by self-supervised learning becomes a feasible solution. However, recent researches find that existing self-supervised learning methods are less qualified to represent fine-grained categories. The bottleneck lies in that the pre-text representation is built from every patch-wise embedding, while fine-grained categories are only determined by several key patches of an image. In this paper, we propose a Cross-level Multi-instance Distillation (CMD) framework to tackle the challenge. Our key idea is to consider the importance of each image patch in determining the fine-grained pre-text representation by multiple instance learning. To comprehensively learn the relation between informative patches and fine-grained semantics, the multi-instance knowledge distillation is implemented on both the region/image crop pairs from the teacher and student net, and the region-image crops inside the teacher / student net, which we term as intra-level multi-instance distillation and inter-level multi-instance distillation. Extensive experiments on CUB-200-2011, Stanford Cars and FGVC Aircraft show that the proposed method outperforms the contemporary method by upto 10.14% and existing state-of-the-art self-supervised learning approaches by upto 19.78% on both top-1 accuracy and Rank-1 retrieval metric. ",
    "url": "https://arxiv.org/abs/2401.08860",
    "authors": [
      "Qi Bi",
      "Wei Ji",
      "Jingjun Yi",
      "Haolan Zhan",
      "Gui-Song Xia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.08861",
    "title": "Semi-Supervised Learning Approach for Efficient Resource Allocation with  Network Slicing in O-RAN",
    "abstract": "The Open Radio Access Network (O-RAN) technology has emerged as a promising solution for network operators, providing them with an open and favorable environment. Ensuring effective coordination of x-applications (xAPPs) is crucial to enhance flexibility and optimize network performance within the O-RAN. In this paper, we introduce an innovative approach to the resource allocation problem, aiming to coordinate multiple independent xAPPs for network slicing and resource allocation in O-RAN. Our proposed method focuses on maximizing the weighted throughput among user equipments (UE), as well as allocating physical resource blocks (PRBs). We prioritize two service types, namely enhanced Mobile Broadband and Ultra Reliable Low Latency Communication. To achieve this, we have designed two xAPPs: a power control xAPP for each UE and a PRB allocation xAPP. The proposed method consists of a two-part training phase, where the first part uses supervised learning with a Variational Autoencoder trained to regress the power transmission as well as the user association and PRB allocation decisions, and the second part uses unsupervised learning with a contrastive loss approach to improve the generalization and robustness of the model. We evaluate the performance of our proposed method by comparing its results to those obtained from an exhaustive search algorithm, deep Q-network algorithm, and by reporting performance metrics for the regression task. We also evaluate the proposed model's performance in different scenarios among the service types. The results show that the proposed method is a more efficient and effective solution for network slicing problems compared to state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2401.08861",
    "authors": [
      "Salar Nouri",
      "Mojdeh Karbalaee Motalleb",
      "Vahid Shah-Mansouri",
      "Seyed Pooya Shariatpanahi"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2401.08863",
    "title": "Robust Localization of Key Fob Using Channel Impulse Response of Ultra  Wide Band Sensors for Keyless Entry Systems",
    "abstract": "Using neural networks for localization of key fob within and surrounding a car as a security feature for keyless entry is fast emerging. In this paper we study: 1) the performance of pre-computed features of neural networks based UWB (ultra wide band) localization classification forming the baseline of our experiments. 2) Investigate the inherent robustness of various neural networks; therefore, we include the study of robustness of the adversarial examples without any adversarial training in this work. 3) Propose a multi-head self-supervised neural network architecture which outperforms the baseline neural networks without any adversarial training. The model's performance improved by 67% at certain ranges of adversarial magnitude for fast gradient sign method and 37% each for basic iterative method and projected gradient descent method. ",
    "url": "https://arxiv.org/abs/2401.08863",
    "authors": [
      "Abhiram Kolli",
      "Filippo Casamassima",
      "Horst Possegger",
      "Horst Bischof"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.08875",
    "title": "DCRMTA: Unbiased Causal Representation for Multi-touch Attribution",
    "abstract": "Multi-touch attribution (MTA) currently plays a pivotal role in achieving a fair estimation of the contributions of each advertising touchpoint to-wards conversion behavior, deeply influencing budget allocation and advertising recommenda-tion. Traditional multi-touch attribution methods initially build a conversion prediction model, an-ticipating learning the inherent relationship be-tween touchpoint sequences and user purchasing behavior through historical data. Based on this, counterfactual touchpoint sequences are con-structed from the original sequence subset, and conversions are estimated using the prediction model, thus calculating advertising contributions. A covert assumption of these methods is the un-biased nature of conversion prediction models. However, due to confounding variables factors arising from user preferences and internet recom-mendation mechanisms such as homogenization of ad recommendations resulting from past shop-ping records, bias can easily occur in conversion prediction models trained on observational data. This paper redefines the causal effect of user fea-tures on conversions and proposes a novel end-to-end approach, Deep Causal Representation for MTA (DCRMTA). Our model while eliminating confounding variables, extracts features with causal relations to conversions from users. Fur-thermore, Extensive experiments on both synthet-ic and real-world Criteo data demonstrate DCRMTA's superior performance in converting prediction across varying data distributions, while also effectively attributing value across dif-ferent advertising channels ",
    "url": "https://arxiv.org/abs/2401.08875",
    "authors": [
      "Jiaming Tang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2401.08876",
    "title": "Evaluating the Utility of Conformal Prediction Sets for AI-Advised Image  Labeling",
    "abstract": "As deep neural networks are more commonly deployed in high-stakes domains, their lack of interpretability makes uncertainty quantification challenging. We investigate the effects of presenting conformal prediction sets$\\unicode{x2013}$a method for generating valid confidence sets in distribution-free uncertainty quantification$\\unicode{x2013}$to express uncertainty in AI-advised decision-making. Through a large pre-registered experiment, we compare the utility of conformal prediction sets to displays of Top-1 and Top-k predictions for AI-advised image labeling. We find that the utility of prediction sets for accuracy varies with the difficulty of the task: while they result in accuracy on par with or less than Top-1 and Top-k displays for easy images, prediction sets excel at assisting humans in labeling out-of-distribution (OOD) images especially when the set size is small. Our results empirically pinpoint the practical challenges of conformal prediction sets and provide implications on how to incorporate them for real-world decision-making. ",
    "url": "https://arxiv.org/abs/2401.08876",
    "authors": [
      "Dongping Zhang",
      "Angelos Chatzimparmpas",
      "Negar Kamali",
      "Jessica Hullman"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08886",
    "title": "RiemannONets: Interpretable Neural Operators for Riemann Problems",
    "abstract": "Developing the proper representations for simulating high-speed flows with strong shock waves, rarefactions, and contact discontinuities has been a long-standing question in numerical analysis. Herein, we employ neural operators to solve Riemann problems encountered in compressible flows for extreme pressure jumps (up to $10^{10}$ pressure ratio). In particular, we first consider the DeepONet that we train in a two-stage process, following the recent work of Lee and Shin, wherein the first stage, a basis is extracted from the trunk net, which is orthonormalized and subsequently is used in the second stage in training the branch net. This simple modification of DeepONet has a profound effect on its accuracy, efficiency, and robustness and leads to very accurate solutions to Riemann problems compared to the vanilla version. It also enables us to interpret the results physically as the hierarchical data-driven produced basis reflects all the flow features that would otherwise be introduced using ad hoc feature expansion layers. We also compare the results with another neural operator based on the U-Net for low, intermediate, and very high-pressure ratios that are very accurate for Riemann problems, especially for large pressure ratios, due to their multiscale nature but computationally more expensive. Overall, our study demonstrates that simple neural network architectures, if properly pre-trained, can achieve very accurate solutions of Riemann problems for real-time forecasting. ",
    "url": "https://arxiv.org/abs/2401.08886",
    "authors": [
      "Ahmad Peyvan",
      "Vivek Oommen",
      "Ameya D. Jagtap",
      "George Em Karniadakis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2401.08889",
    "title": "On the Effect of Data-Augmentation on Local Embedding Properties in the  Contrastive Learning of Music Audio Representations",
    "abstract": "Audio embeddings are crucial tools in understanding large catalogs of music. Typically embeddings are evaluated on the basis of the performance they provide in a wide range of downstream tasks, however few studies have investigated the local properties of the embedding spaces themselves which are important in nearest neighbor algorithms, commonly used in music search and recommendation. In this work we show that when learning audio representations on music datasets via contrastive learning, musical properties that are typically homogeneous within a track (e.g., key and tempo) are reflected in the locality of neighborhoods in the resulting embedding space. By applying appropriate data augmentation strategies, localisation of such properties can not only be reduced but the localisation of other attributes is increased. For example, locality of features such as pitch and tempo that are less relevant to non-expert listeners, may be mitigated while improving the locality of more salient features such as genre and mood, achieving state-of-the-art performance in nearest neighbor retrieval accuracy. Similarly, we show that the optimal selection of data augmentation strategies for contrastive learning of music audio embeddings is dependent on the downstream task, highlighting this as an important embedding design decision. ",
    "url": "https://arxiv.org/abs/2401.08889",
    "authors": [
      "Matthew C. McCallum",
      "Matthew E. P. Davies",
      "Florian Henkel",
      "Jaehun Kim",
      "Samuel E. Sandberg"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2401.08891",
    "title": "Tempo estimation as fully self-supervised binary classification",
    "abstract": "This paper addresses the problem of global tempo estimation in musical audio. Given that annotating tempo is time-consuming and requires certain musical expertise, few publicly available data sources exist to train machine learning models for this task. Towards alleviating this issue, we propose a fully self-supervised approach that does not rely on any human labeled data. Our method builds on the fact that generic (music) audio embeddings already encode a variety of properties, including information about tempo, making them easily adaptable for downstream tasks. While recent work in self-supervised tempo estimation aimed to learn a tempo specific representation that was subsequently used to train a supervised classifier, we reformulate the task into the binary classification problem of predicting whether a target track has the same or a different tempo compared to a reference. While the former still requires labeled training data for the final classification model, our approach uses arbitrary unlabeled music data in combination with time-stretching for model training as well as a small set of synthetically created reference samples for predicting the final tempo. Evaluation of our approach in comparison with the state-of-the-art reveals highly competitive performance when the constraint of finding the precise tempo octave is relaxed. ",
    "url": "https://arxiv.org/abs/2401.08891",
    "authors": [
      "Florian Henkel",
      "Jaehun Kim",
      "Matthew C. McCallum",
      "Samuel E. Sandberg",
      "Matthew E. P. Davies"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2401.08902",
    "title": "Similar but Faster: Manipulation of Tempo in Music Audio Embeddings for  Tempo Prediction and Search",
    "abstract": "Audio embeddings enable large scale comparisons of the similarity of audio files for applications such as search and recommendation. Due to the subjectivity of audio similarity, it can be desirable to design systems that answer not only whether audio is similar, but similar in what way (e.g., wrt. tempo, mood or genre). Previous works have proposed disentangled embedding spaces where subspaces representing specific, yet possibly correlated, attributes can be weighted to emphasize those attributes in downstream tasks. However, no research has been conducted into the independence of these subspaces, nor their manipulation, in order to retrieve tracks that are similar but different in a specific way. Here, we explore the manipulation of tempo in embedding spaces as a case-study towards this goal. We propose tempo translation functions that allow for efficient manipulation of tempo within a pre-existing embedding space whilst maintaining other properties such as genre. As this translation is specific to tempo it enables retrieval of tracks that are similar but have specifically different tempi. We show that such a function can be used as an efficient data augmentation strategy for both training of downstream tempo predictors, and improved nearest neighbor retrieval of properties largely independent of tempo. ",
    "url": "https://arxiv.org/abs/2401.08902",
    "authors": [
      "Matthew C. McCallum",
      "Florian Henkel",
      "Jaehun Kim",
      "Samuel E. Sandberg",
      "Matthew E. P. Davies"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Digital Libraries (cs.DL)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2401.08903",
    "title": "PPR: Enhancing Dodging Attacks while Maintaining Impersonation Attacks  on Face Recognition Systems",
    "abstract": "Adversarial Attacks on Face Recognition (FR) encompass two types: impersonation attacks and evasion attacks. We observe that achieving a successful impersonation attack on FR does not necessarily ensure a successful dodging attack on FR in the black-box setting. Introducing a novel attack method named Pre-training Pruning Restoration Attack (PPR), we aim to enhance the performance of dodging attacks whilst avoiding the degradation of impersonation attacks. Our method employs adversarial example pruning, enabling a portion of adversarial perturbations to be set to zero, while tending to maintain the attack performance. By utilizing adversarial example pruning, we can prune the pre-trained adversarial examples and selectively free up certain adversarial perturbations. Thereafter, we embed adversarial perturbations in the pruned area, which enhances the dodging performance of the adversarial face examples. The effectiveness of our proposed attack method is demonstrated through our experimental results, showcasing its superior performance. ",
    "url": "https://arxiv.org/abs/2401.08903",
    "authors": [
      "Fengfan Zhou",
      "Heifei Ling"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08913",
    "title": "Efficient Image Super-Resolution via Symmetric Visual Attention Network",
    "abstract": "An important development direction in the Single-Image Super-Resolution (SISR) algorithms is to improve the efficiency of the algorithms. Recently, efficient Super-Resolution (SR) research focuses on reducing model complexity and improving efficiency through improved deep small kernel convolution, leading to a small receptive field. The large receptive field obtained by large kernel convolution can significantly improve image quality, but the computational cost is too high. To improve the reconstruction details of efficient super-resolution reconstruction, we propose a Symmetric Visual Attention Network (SVAN) by applying large receptive fields. The SVAN decomposes a large kernel convolution into three different combinations of convolution operations and combines them with an attention mechanism to form a Symmetric Large Kernel Attention Block (SLKAB), which forms a symmetric attention block with a bottleneck structure by the size of the receptive field in the convolution combination to extract depth features effectively as the basic component of the SVAN. Our network gets a large receptive field while minimizing the number of parameters and improving the perceptual ability of the model. The experimental results show that the proposed SVAN can obtain high-quality super-resolution reconstruction results using only about 30% of the parameters of existing SOTA methods. ",
    "url": "https://arxiv.org/abs/2401.08913",
    "authors": [
      "Chengxu Wu",
      "Qinrui Fan",
      "Shu Hu",
      "Xi Wu",
      "Xin Wang",
      "Jing Hu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2401.08925",
    "title": "RandOhm: Mitigating Impedance Side-channel Attacks using Randomized  Circuit Configurations",
    "abstract": "Physical side-channel attacks can compromise the security of integrated circuits. Most of the physical side-channel attacks (e.g., power or electromagnetic) exploit the dynamic behavior of a chip, typically manifesting as changes in current consumption or voltage fluctuations where algorithmic countermeasures, such as masking, can effectively mitigate the attacks. However, as demonstrated recently, these mitigation techniques are not entirely effective against backscattered side-channel attacks such as impedance analysis. In the case of an impedance attack, an adversary exploits the data-dependent impedance variations of chip power delivery network (PDN) to extract secret information. In this work, we introduce RandOhm, which exploits moving target defense (MTD) strategy based on partial reconfiguration of mainstream FPGAs, to defend against impedance side-channel attacks. We demonstrate that the information leakage through the PDN impedance could be reduced via run-time reconfiguration of the secret-sensitive parts of the circuitry. Hence, by constantly randomizing the placement and routing of the circuit, one can decorrelate the data-dependent computation from the impedance value. To validate our claims, we present a systematic approach equipped with two different partial reconfiguration strategies on implementations of the AES cipher realized on 28-nm FPGAs. We investigate the overhead of our mitigation in terms of delay and performance and provide security analysis by performing non-profiled and profiled impedance analysis attacks against these implementations to demonstrate the resiliency of our approach. ",
    "url": "https://arxiv.org/abs/2401.08925",
    "authors": [
      "Saleh Khalaj Monfared",
      "Domenic Forte",
      "Shahin Tajik"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.08940",
    "title": "CEL: A Continual Learning Model for Disease Outbreak Prediction by  Leveraging Domain Adaptation via Elastic Weight Consolidation",
    "abstract": "Continual learning, the ability of a model to learn over time without forgetting previous knowledge and, therefore, be adaptive to new data, is paramount in dynamic fields such as disease outbreak prediction. Deep neural networks, i.e., LSTM, are prone to error due to catastrophic forgetting. This study introduces a novel CEL model for continual learning by leveraging domain adaptation via Elastic Weight Consolidation (EWC). This model aims to mitigate the catastrophic forgetting phenomenon in a domain incremental setting. The Fisher Information Matrix (FIM) is constructed with EWC to develop a regularization term that penalizes changes to important parameters, namely, the important previous knowledge. CEL's performance is evaluated on three distinct diseases, Influenza, Mpox, and Measles, with different metrics. The high R-squared values during evaluation and reevaluation outperform the other state-of-the-art models in several contexts, indicating that CEL adapts to incremental data well. CEL's robustness and reliability are underscored by its minimal 65% forgetting rate and 18% higher memory stability compared to existing benchmark studies. This study highlights CEL's versatility in disease outbreak prediction, addressing evolving data with temporal patterns. It offers a valuable model for proactive disease control with accurate, timely predictions. ",
    "url": "https://arxiv.org/abs/2401.08940",
    "authors": [
      "Saba Aslam",
      "Abdur Rasool",
      "Hongyan Wu",
      "Xiaoli Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.08947",
    "title": "AntiPhishStack: LSTM-based Stacked Generalization Model for Optimized  Phishing URLs Detection",
    "abstract": "The escalating reliance on revolutionary online web services has introduced heightened security risks, with persistent challenges posed by phishing despite extensive security measures. Traditional phishing systems, reliant on machine learning and manual features, struggle with evolving tactics. Recent advances in deep learning offer promising avenues for tackling novel phishing challenges and malicious URLs. This paper introduces a two-phase stack generalized model named AntiPhishStack, designed to detect phishing sites. The model leverages the learning of URLs and character-level TF-IDF features symmetrically, enhancing its ability to combat emerging phishing threats. In Phase I, features are trained on a base machine learning classifier, employing K-fold cross-validation for robust mean prediction. Phase II employs a two-layered stacked-based LSTM network with five adaptive optimizers for dynamic compilation, ensuring premier prediction on these features. Additionally, the symmetrical predictions from both phases are optimized and integrated to train a meta-XGBoost classifier, contributing to a final robust prediction. The significance of this work lies in advancing phishing detection with AntiPhishStack, operating without prior phishing-specific feature knowledge. Experimental validation on two benchmark datasets, comprising benign and phishing or malicious URLs, demonstrates the model's exceptional performance, achieving a notable 96.04% accuracy compared to existing studies. This research adds value to the ongoing discourse on symmetry and asymmetry in information security and provides a forward-thinking solution for enhancing network security in the face of evolving cyber threats. ",
    "url": "https://arxiv.org/abs/2401.08947",
    "authors": [
      "Saba Aslam",
      "Hafsa Aslam",
      "Arslan Manzoor",
      "Chen Hui",
      "Abdur Rasool"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08948",
    "title": "PINSAT: Parallelized Interleaving of Graph Search and Trajectory  Optimization for Kinodynamic Motion Planning",
    "abstract": "Trajectory optimization is a widely used technique in robot motion planning for letting the dynamics and constraints on the system shape and synthesize complex behaviors. Several previous works have shown its benefits in high-dimensional continuous state spaces and under differential constraints. However, long time horizons and planning around obstacles in non-convex spaces pose challenges in guaranteeing convergence or finding optimal solutions. As a result, discrete graph search planners and sampling-based planers are preferred when facing obstacle-cluttered environments. A recently developed algorithm called INSAT effectively combines graph search in the low-dimensional subspace and trajectory optimization in the full-dimensional space for global kinodynamic planning over long horizons. Although INSAT successfully reasoned about and solved complex planning problems, the numerous expensive calls to an optimizer resulted in large planning times, thereby limiting its practical use. Inspired by the recent work on edge-based parallel graph search, we present PINSAT, which introduces systematic parallelization in INSAT to achieve lower planning times and higher success rates, while maintaining significantly lower costs over relevant baselines. We demonstrate PINSAT by evaluating it on 6 DoF kinodynamic manipulation planning with obstacles. ",
    "url": "https://arxiv.org/abs/2401.08948",
    "authors": [
      "Ramkumar Natarajan",
      "Shohin Mukherjee",
      "Howie Choset",
      "Maxim Likhachev"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2401.08972",
    "title": "Hearing Loss Detection from Facial Expressions in One-on-one  Conversations",
    "abstract": "Individuals with impaired hearing experience difficulty in conversations, especially in noisy environments. This difficulty often manifests as a change in behavior and may be captured via facial expressions, such as the expression of discomfort or fatigue. In this work, we build on this idea and introduce the problem of detecting hearing loss from an individual's facial expressions during a conversation. Building machine learning models that can represent hearing-related facial expression changes is a challenge. In addition, models need to disentangle spurious age-related correlations from hearing-driven expressions. To this end, we propose a self-supervised pre-training strategy tailored for the modeling of expression variations. We also use adversarial representation learning to mitigate the age bias. We evaluate our approach on a large-scale egocentric dataset with real-world conversational scenarios involving subjects with hearing loss and show that our method for hearing loss detection achieves superior performance over baselines. ",
    "url": "https://arxiv.org/abs/2401.08972",
    "authors": [
      "Yufeng Yin",
      "Ishwarya Ananthabhotla",
      "Vamsi Krishna Ithapu",
      "Stavros Petridis",
      "Yu-Hsiang Wu",
      "Christi Miller"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.08976",
    "title": "ACT-GAN: Radio map construction based on generative adversarial networks  with ACT blocks",
    "abstract": "The radio map, serving as a visual representation of electromagnetic spatial characteristics, plays a pivotal role in assessment of wireless communication networks and radio monitoring coverage. Addressing the issue of low accuracy existing in the current radio map construction, this paper presents a novel radio map construction method based on generative adversarial network (GAN) in which the Aggregated Contextual-Transformation (AOT) block, Convolutional Block Attention Module (CBAM), and Transposed Convolution (T-Conv) block are applied to the generator, and we name it as ACT-GAN. It significantly improves the reconstruction accuracy and local texture of the radio maps. The performance of ACT-GAN across three different scenarios is demonstrated. Experiment results reveal that in the scenario without sparse discrete observations, the proposed method reduces the root mean square error (RMSE) by 14.6% in comparison to the state-of-the-art models. In the scenario with sparse discrete observations, the RMSE is diminished by 13.2%. Furthermore, the predictive results of the proposed model show a more lucid representation of electromagnetic spatial field distribution. To verify the universality of this model in radio map construction tasks, the scenario of unknown radio emission source is investigated. The results indicate that the proposed model is robust radio map construction and accurate in predicting the location of the emission source. ",
    "url": "https://arxiv.org/abs/2401.08976",
    "authors": [
      "Chen Qi",
      "Yang Jingjing",
      "Huang Ming",
      "Zhou Qiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2401.08984",
    "title": "A GAN-based data poisoning framework against anomaly detection in  vertical federated learning",
    "abstract": "In vertical federated learning (VFL), commercial entities collaboratively train a model while preserving data privacy. However, a malicious participant's poisoning attack may degrade the performance of this collaborative model. The main challenge in achieving the poisoning attack is the absence of access to the server-side top model, leaving the malicious participant without a clear target model. To address this challenge, we introduce an innovative end-to-end poisoning framework P-GAN. Specifically, the malicious participant initially employs semi-supervised learning to train a surrogate target model. Subsequently, this participant employs a GAN-based method to produce adversarial perturbations to degrade the surrogate target model's performance. Finally, the generator is obtained and tailored for VFL poisoning. Besides, we develop an anomaly detection algorithm based on a deep auto-encoder (DAE), offering a robust defense mechanism to VFL scenarios. Through extensive experiments, we evaluate the efficacy of P-GAN and DAE, and further analyze the factors that influence their performance. ",
    "url": "https://arxiv.org/abs/2401.08984",
    "authors": [
      "Xiaolin Chen",
      "Daoguang Zan",
      "Wei Li",
      "Bei Guan",
      "Yongji Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.08986",
    "title": "Rigid Protein-Protein Docking via Equivariant Elliptic-Paraboloid  Interface Prediction",
    "abstract": "The study of rigid protein-protein docking plays an essential role in a variety of tasks such as drug design and protein engineering. Recently, several learning-based methods have been proposed for the task, exhibiting much faster docking speed than those computational methods. In this paper, we propose a novel learning-based method called ElliDock, which predicts an elliptic paraboloid to represent the protein-protein docking interface. To be specific, our model estimates elliptic paraboloid interfaces for the two input proteins respectively, and obtains the roto-translation transformation for docking by making two interfaces coincide. By its design, ElliDock is independently equivariant with respect to arbitrary rotations/translations of the proteins, which is an indispensable property to ensure the generalization of the docking process. Experimental evaluations show that ElliDock achieves the fastest inference time among all compared methods and is strongly competitive with current state-of-the-art learning-based models such as DiffDock-PP and Multimer particularly for antibody-antigen docking. ",
    "url": "https://arxiv.org/abs/2401.08986",
    "authors": [
      "Ziyang Yu",
      "Wenbing Huang",
      "Yang Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2401.08996",
    "title": "MicroNAS: Zero-Shot Neural Architecture Search for MCUs",
    "abstract": "Neural Architecture Search (NAS) effectively discovers new Convolutional Neural Network (CNN) architectures, particularly for accuracy optimization. However, prior approaches often require resource-intensive training on super networks or extensive architecture evaluations, limiting practical applications. To address these challenges, we propose MicroNAS, a hardware-aware zero-shot NAS framework designed for microcontroller units (MCUs) in edge computing. MicroNAS considers target hardware optimality during the search, utilizing specialized performance indicators to identify optimal neural architectures without high computational costs. Compared to previous works, MicroNAS achieves up to 1104x improvement in search efficiency and discovers models with over 3.23x faster MCU inference while maintaining similar accuracy ",
    "url": "https://arxiv.org/abs/2401.08996",
    "authors": [
      "Ye Qiao",
      "Haocheng Xu",
      "Yifan Zhang",
      "Sitao Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.08998",
    "title": "Attack and Reset for Unlearning: Exploiting Adversarial Noise toward  Machine Unlearning through Parameter Re-initialization",
    "abstract": "With growing concerns surrounding privacy and regulatory compliance, the concept of machine unlearning has gained prominence, aiming to selectively forget or erase specific learned information from a trained model. In response to this critical need, we introduce a novel approach called Attack-and-Reset for Unlearning (ARU). This algorithm leverages meticulously crafted adversarial noise to generate a parameter mask, effectively resetting certain parameters and rendering them unlearnable. ARU outperforms current state-of-the-art results on two facial machine-unlearning benchmark datasets, MUFAC and MUCAC. In particular, we present the steps involved in attacking and masking that strategically filter and re-initialize network parameters biased towards the forget set. Our work represents a significant advancement in rendering data unexploitable to deep learning models through parameter re-initialization, achieved by harnessing adversarial noise to craft a mask. ",
    "url": "https://arxiv.org/abs/2401.08998",
    "authors": [
      "Yoonhwa Jung",
      "Ikhyun Cho",
      "Shun-Hsiang Hsu",
      "Julia Hockenmaier"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.09002",
    "title": "AttackEval: How to Evaluate the Effectiveness of Jailbreak Attacking on  Large Language Models",
    "abstract": "In our research, we pioneer a novel approach to evaluate the effectiveness of jailbreak attacks on Large Language Models (LLMs), such as GPT-4 and LLaMa2, diverging from traditional robustness-focused binary evaluations. Our study introduces two distinct evaluation frameworks: a coarse-grained evaluation and a fine-grained evaluation. Each framework, using a scoring range from 0 to 1, offers a unique perspective, enabling a more comprehensive and nuanced evaluation of attack effectiveness and empowering attackers to refine their attack prompts with greater understanding. Furthermore, we have developed a comprehensive ground truth dataset specifically tailored for jailbreak tasks. This dataset not only serves as a crucial benchmark for our current study but also establishes a foundational resource for future research, enabling consistent and comparative analyses in this evolving field. Upon meticulous comparison with traditional evaluation methods, we discovered that our evaluation aligns with the baseline's trend while offering a more profound and detailed assessment. We believe that by accurately evaluating the effectiveness of attack prompts in the Jailbreak task, our work lays a solid foundation for assessing a wider array of similar or even more complex tasks in the realm of prompt injection, potentially revolutionizing this field. ",
    "url": "https://arxiv.org/abs/2401.09002",
    "authors": [
      "Dong shu",
      "Mingyu Jin",
      "Suiyuan Zhu",
      "Beichen Wang",
      "Zihao Zhou",
      "Chong Zhang",
      "Yongfeng Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.09006",
    "title": "Generalized Face Liveness Detection via De-spoofing Face Generator",
    "abstract": "Previous Face Anti-spoofing (FAS) works face the challenge of generalizing in unseen domains. One of the major problems is that most existing FAS datasets are relatively small and lack data diversity. However, we find that there are numerous real faces that can be easily achieved under various conditions, which are neglected by previous FAS works. In this paper, we conduct an Anomalous cue Guided FAS (AG-FAS) method, which leverages real faces for improving model generalization via a De-spoofing Face Generator (DFG). Specifically, the DFG trained only on the real faces gains the knowledge of what a real face should be like and can generate a \"real\" version of the face corresponding to any given input face. The difference between the generated \"real\" face and the input face can provide an anomalous cue for the downstream FAS task. We then propose an Anomalous cue Guided FAS feature extraction Network (AG-Net) to further improve the FAS feature generalization via a cross-attention transformer. Extensive experiments on a total of nine public datasets show our method achieves state-of-the-art results under cross-domain evaluations with unseen scenarios and unknown presentation attacks. ",
    "url": "https://arxiv.org/abs/2401.09006",
    "authors": [
      "Xingming Long",
      "Shiguang Shan",
      "Jie Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.09008",
    "title": "Hybrid of DiffStride and Spectral Pooling in Convolutional Neural  Networks",
    "abstract": "Stride determines the distance between adjacent filter positions as the filter moves across the input. A fixed stride causes important information contained in the image can not be captured, so that important information is not classified. Therefore, in previous research, the DiffStride Method was applied, namely the Strided Convolution Method with which it can learn its own stride value. Severe Quantization and a constraining lower bound on preserved information are arises with Max Pooling Downsampling Method. Spectral Pooling reduce the constraint lower bound on preserved information by cutting off the representation in the frequency domain. In this research a CNN Model is proposed with the Downsampling Learnable Stride Technique performed by Backpropagation combined with the Spectral Pooling Technique. Diffstride and Spectral Pooling techniques are expected to maintain most of the information contained in the image. In this study, we compare the Hybrid Method, which is a combined implementation of Spectral Pooling and DiffStride against the Baseline Method, which is the DiffStride implementation on ResNet 18. The accuracy result of the DiffStride combination with Spectral Pooling improves over DiffStride which is baseline method by 0.0094. This shows that the Hybrid Method can maintain most of the information by cutting of the representation in the frequency domain and determine the stride of the learning result through Backpropagation. ",
    "url": "https://arxiv.org/abs/2401.09008",
    "authors": [
      "Sulthan Rafif",
      "Mochamad Arfan Ravy Wahyu Pratama",
      "Mohammad Faris Azhar",
      "Ahmad Mustafidul Ibad",
      "Lailil Muflikhah",
      "Novanto Yudistira"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.09018",
    "title": "Residual Alignment: Uncovering the Mechanisms of Residual Networks",
    "abstract": "The ResNet architecture has been widely adopted in deep learning due to its significant boost to performance through the use of simple skip connections, yet the underlying mechanisms leading to its success remain largely unknown. In this paper, we conduct a thorough empirical study of the ResNet architecture in classification tasks by linearizing its constituent residual blocks using Residual Jacobians and measuring their singular value decompositions. Our measurements reveal a process called Residual Alignment (RA) characterized by four properties: (RA1) intermediate representations of a given input are equispaced on a line, embedded in high dimensional space, as observed by Gai and Zhang [2021]; (RA2) top left and right singular vectors of Residual Jacobians align with each other and across different depths; (RA3) Residual Jacobians are at most rank C for fully-connected ResNets, where C is the number of classes; and (RA4) top singular values of Residual Jacobians scale inversely with depth. RA consistently occurs in models that generalize well, in both fully-connected and convolutional architectures, across various depths and widths, for varying numbers of classes, on all tested benchmark datasets, but ceases to occur once the skip connections are removed. It also provably occurs in a novel mathematical model we propose. This phenomenon reveals a strong alignment between residual branches of a ResNet (RA2+4), imparting a highly rigid geometric structure to the intermediate representations as they progress linearly through the network (RA1) up to the final layer, where they undergo Neural Collapse. ",
    "url": "https://arxiv.org/abs/2401.09018",
    "authors": [
      "Jianing Li",
      "Vardan Papyan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.09023",
    "title": "Explain Thyself Bully: Sentiment Aided Cyberbullying Detection with  Explanation",
    "abstract": "Cyberbullying has become a big issue with the popularity of different social media networks and online communication apps. While plenty of research is going on to develop better models for cyberbullying detection in monolingual language, there is very little research on the code-mixed languages and explainability aspect of cyberbullying. Recent laws like \"right to explanations\" of General Data Protection Regulation, have spurred research in developing interpretable models rather than focusing on performance. Motivated by this we develop the first interpretable multi-task model called {\\em mExCB} for automatic cyberbullying detection from code-mixed languages which can simultaneously solve several tasks, cyberbullying detection, explanation/rationale identification, target group detection and sentiment analysis. We have introduced {\\em BullyExplain}, the first benchmark dataset for explainable cyberbullying detection in code-mixed language. Each post in {\\em BullyExplain} dataset is annotated with four labels, i.e., {\\em bully label, sentiment label, target and rationales (explainability)}, i.e., which phrases are being responsible for annotating the post as a bully. The proposed multitask framework (mExCB) based on CNN and GRU with word and sub-sentence (SS) level attention is able to outperform several baselines and state of the art models when applied on {\\em BullyExplain} dataset. ",
    "url": "https://arxiv.org/abs/2401.09023",
    "authors": [
      "Krishanu Maity",
      "Prince Jha",
      "Raghav Jain",
      "Sriparna Saha",
      "Pushpak Bhattacharyya"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.09036",
    "title": "IRS-Enhanced Anti-Jamming Precoding Against DISCO Physical Layer Jamming  Attacks",
    "abstract": "Illegitimate intelligent reflective surfaces (IRSs) can pose significant physical layer security risks on multi-user multiple-input single-output (MU-MISO) systems. Recently, a DISCO approach has been proposed an illegitimate IRS with random and time-varying reflection coefficients, referred to as a \"disco\" IRS (DIRS). Such DIRS can attack MU-MISO systems without relying on either jamming power or channel state information (CSI), and classical anti-jamming techniques are ineffective for the DIRS-based fully-passive jammers (DIRS-based FPJs). In this paper, we propose an IRS-enhanced anti-jamming precoder against DIRS-based FPJs that requires only statistical rather than instantaneous CSI of the DIRS-jammed channels. Specifically, a legitimate IRS is introduced to reduce the strength of the DIRS-based jamming relative to the transmit signals at a legitimate user (LU). In addition, the active beamforming at the legitimate access point (AP) is designed to maximize the signal-to-jamming-plus-noise ratios (SJNRs). Numerical results are presented to evaluate the effectiveness of the proposed IRS-enhanced anti-jamming precoder against DIRS-based FPJs. ",
    "url": "https://arxiv.org/abs/2401.09036",
    "authors": [
      "Huan Huang",
      "Hongliang Zhang",
      "Yi Cai",
      "Yunjing Zhang",
      "A. Lee Swindlehurst",
      "Zhu Han"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2401.09049",
    "title": "Enhancing Lidar-based Object Detection in Adverse Weather using Offset  Sequences in Time",
    "abstract": "Automated vehicles require an accurate perception of their surroundings for safe and efficient driving. Lidar-based object detection is a widely used method for environment perception, but its performance is significantly affected by adverse weather conditions such as rain and fog. In this work, we investigate various strategies for enhancing the robustness of lidar-based object detection by processing sequential data samples generated by lidar sensors. Our approaches leverage temporal information to improve a lidar object detection model, without the need for additional filtering or pre-processing steps. We compare $10$ different neural network architectures that process point cloud sequences including a novel augmentation strategy introducing a temporal offset between frames of a sequence during training and evaluate the effectiveness of all strategies on lidar point clouds under adverse weather conditions through experiments. Our research provides a comprehensive study of effective methods for mitigating the effects of adverse weather on the reliability of lidar-based object detection using sequential data that are evaluated using public datasets such as nuScenes, Dense, and the Canadian Adverse Driving Conditions Dataset. Our findings demonstrate that our novel method, involving temporal offset augmentation through randomized frame skipping in sequences, enhances object detection accuracy compared to both the baseline model (Pillar-based Object Detection) and no augmentation. ",
    "url": "https://arxiv.org/abs/2401.09049",
    "authors": [
      "Raphael van Kempen",
      "Tim Rehbronn",
      "Abin Jose",
      "Johannes Stegmaier",
      "Bastian Lampe",
      "Timo Woopen",
      "Lutz Eckstein"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2401.09057",
    "title": "CrossVideo: Self-supervised Cross-modal Contrastive Learning for Point  Cloud Video Understanding",
    "abstract": "This paper introduces a novel approach named CrossVideo, which aims to enhance self-supervised cross-modal contrastive learning in the field of point cloud video understanding. Traditional supervised learning methods encounter limitations due to data scarcity and challenges in label acquisition. To address these issues, we propose a self-supervised learning method that leverages the cross-modal relationship between point cloud videos and image videos to acquire meaningful feature representations. Intra-modal and cross-modal contrastive learning techniques are employed to facilitate effective comprehension of point cloud video. We also propose a multi-level contrastive approach for both modalities. Through extensive experiments, we demonstrate that our method significantly surpasses previous state-of-the-art approaches, and we conduct comprehensive ablation studies to validate the effectiveness of our proposed designs. ",
    "url": "https://arxiv.org/abs/2401.09057",
    "authors": [
      "Yunze Liu",
      "Changxi Chen",
      "Zifan Wang",
      "Li Yi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.09060",
    "title": "Joint Route Selection and Power Allocation in Multi-hop Cache-enabled  Networks",
    "abstract": "The caching paradigm has been introduced to alleviate backhaul traffic load and to reduce latencies due to massive never ending increase in data traffic. To fully exploit the benefits offered by caching, unmanned aerial vehicles (UAVs) and device-to-device (D2D) communication can be further utilized. In contrast to prior works, that strictly limits the content delivery routes up to two hops, we explore a multi-hop communications scenario, where the UAVs, the UEs, or both can relay the content to individual users. In this context, we formulate the problem for joint route selection and power allocation to minimize the overall system content delivery duration. First, motivated by the limitations of existing works, we consider the case where the nodes may transmit content simultaneously rather than sequentially and propose simple yet effective approach to allocate the transmission power. Second, we design a low-complexity greedy algorithm jointly handling route selection and power allocation. The simulation results demonstrate that the proposed greedy algorithm outperforms the benchmark algorithm by up to 56.98% in terms of content delivery duration while it achieves close-to-optimal performance. ",
    "url": "https://arxiv.org/abs/2401.09060",
    "authors": [
      "Emre Gures",
      "Pavel Mach"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2401.09062",
    "title": "On Optimization of Next-Generation Microservice-Based Core Networks",
    "abstract": "Next-generation mobile core networks are required to be scalable and capable of efficiently utilizing heterogeneous bare metal resources that may include edge servers. To this end, microservice-based solutions where control plane procedures are deconstructed in their fundamental building blocks are gaining momentum. This letter proposes an optimization framework delivering the partitioning and mapping of large-scale microservice graphs onto heterogeneous bare metal deployments while minimizing the total network traffic among servers. An efficient heuristic strategy for solving the optimization problem is also provided. Simulation results show that, with the proposed framework, a microservice-based core can consistently support the requested load in heterogeneous bare metal deployments even when alternative architecture fails. Besides, our framework ensures an overall reduction in the control plane-related network traffic if compared to current core architectures. ",
    "url": "https://arxiv.org/abs/2401.09062",
    "authors": [
      "Andrea Tassi",
      "Daniel Warren",
      "Yue Wang",
      "Deval Bhamare",
      "Rasoul Behravesh"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2401.09067",
    "title": "Towards Continual Learning Desiderata via HSIC-Bottleneck  Orthogonalization and Equiangular Embedding",
    "abstract": "Deep neural networks are susceptible to catastrophic forgetting when trained on sequential tasks. Various continual learning (CL) methods often rely on exemplar buffers or/and network expansion for balancing model stability and plasticity, which, however, compromises their practical value due to privacy and memory concerns. Instead, this paper considers a strict yet realistic setting, where the training data from previous tasks is unavailable and the model size remains relatively constant during sequential training. To achieve such desiderata, we propose a conceptually simple yet effective method that attributes forgetting to layer-wise parameter overwriting and the resulting decision boundary distortion. This is achieved by the synergy between two key components: HSIC-Bottleneck Orthogonalization (HBO) implements non-overwritten parameter updates mediated by Hilbert-Schmidt independence criterion in an orthogonal space and EquiAngular Embedding (EAE) enhances decision boundary adaptation between old and new tasks with predefined basis vectors. Extensive experiments demonstrate that our method achieves competitive accuracy performance, even with absolute superiority of zero exemplar buffer and 1.02x the base model. ",
    "url": "https://arxiv.org/abs/2401.09067",
    "authors": [
      "Depeng Li",
      "Tianqi Wang",
      "Junwei Chen",
      "Qining Ren",
      "Kenji Kawaguchi",
      "Zhigang Zeng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.09070",
    "title": "Knowledge Pyramid: A Novel Hierarchical Reasoning Structure for  Generalized Knowledge Augmentation and Inference",
    "abstract": "Knowledge graph (KG) based reasoning has been regarded as an effective means for the analysis of semantic networks and is of great usefulness in areas of information retrieval, recommendation, decision-making, and man-machine interaction. It is widely used in recommendation, decision-making, question-answering, search, and other fields. However, previous studies mainly used low-level knowledge in the KG for reasoning, which may result in insufficient generalization and poor robustness of reasoning. To this end, this paper proposes a new inference approach using a novel knowledge augmentation strategy to improve the generalization capability of KG. This framework extracts high-level pyramidal knowledge from low-level knowledge and applies it to reasoning in a multi-level hierarchical KG, called knowledge pyramid in this paper. We tested some medical data sets using the proposed approach, and the experimental results show that the proposed knowledge pyramid has improved the knowledge inference performance with better generalization. Especially, when there are fewer training samples, the inference accuracy can be significantly improved. ",
    "url": "https://arxiv.org/abs/2401.09070",
    "authors": [
      "Qinghua Huang",
      "Yongzhen Wang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2401.09071",
    "title": "Rethinking Spectral Graph Neural Networks with Spatially Adaptive  Filtering",
    "abstract": "Whilst spectral Graph Neural Networks (GNNs) are theoretically well-founded in the spectral domain, their practical reliance on polynomial approximation implies a profound linkage to the spatial domain. As previous studies rarely examine spectral GNNs from the spatial perspective, their spatial-domain interpretability remains elusive, e.g., what information is essentially encoded by spectral GNNs in the spatial domain? In this paper, to answer this question, we establish a theoretical connection between spectral filtering and spatial aggregation, unveiling an intrinsic interaction that spectral filtering implicitly leads the original graph to an adapted new graph, explicitly computed for spatial aggregation. Both theoretical and empirical investigations reveal that the adapted new graph not only exhibits non-locality but also accommodates signed edge weights to reflect label consistency between nodes. These findings thus highlight the interpretable role of spectral GNNs in the spatial domain and inspire us to rethink graph spectral filters beyond the fixed-order polynomials, which neglect global information. Built upon the theoretical findings, we revisit the state-of-the-art spectral GNNs and propose a novel Spatially Adaptive Filtering (SAF) framework, which leverages the adapted new graph by spectral filtering for an auxiliary non-local aggregation. Notably, our proposed SAF comprehensively models both node similarity and dissimilarity from a global perspective, therefore alleviating persistent deficiencies of GNNs related to long-range dependencies and graph heterophily. Extensive experiments over 13 node classification benchmarks demonstrate the superiority of our proposed framework to the state-of-the-art models. ",
    "url": "https://arxiv.org/abs/2401.09071",
    "authors": [
      "Jingwei Guo",
      "Kaizhu Huang",
      "Xinping Yi",
      "Zixian Su",
      "Rui Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.09074",
    "title": "Code Simulation Challenges for Large Language Models",
    "abstract": "We investigate the extent to which Large Language Models (LLMs) can simulate the execution of computer code and algorithms. We begin by looking straight line programs, and show that current LLMs demonstrate poor performance even with such simple programs -- performance rapidly degrades with the length of code. We then investigate the ability of LLMs to simulate programs that contain critical paths and redundant instructions. We also go beyond straight line program simulation with sorting algorithms and nested loops, and we show the computational complexity of a routine directly affects the ability of an LLM to simulate its execution. We observe that LLMs execute instructions sequentially and with a low error margin only for short programs or standard procedures. LLMs' code simulation is in tension with their pattern recognition and memorisation capabilities: on tasks where memorisation is detrimental, we propose a novel prompting method to simulate code execution line by line. Empirically, our new Chain of Simulation (CoSm) method improves on the standard Chain of Thought prompting approach by avoiding the pitfalls of memorisation. ",
    "url": "https://arxiv.org/abs/2401.09074",
    "authors": [
      "Emanuele La Malfa",
      "Christoph Weinhuber",
      "Orazio Torre",
      "Fangru Lin",
      "Anthony Cohn",
      "Nigel Shadbolt",
      "Michael Wooldridge"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2401.09082",
    "title": "What makes for a 'good' social actor? Using respect as a lens to  evaluate interactions with language agents",
    "abstract": "With the growing popularity of dialogue agents based on large language models (LLMs), urgent attention has been drawn to finding ways to ensure their behaviour is ethical and appropriate. These are largely interpreted in terms of the 'HHH' criteria: making outputs more helpful and honest, and avoiding harmful (biased, toxic, or inaccurate) statements. Whilst this semantic focus is useful from the perspective of viewing LLM agents as mere mediums for information, it fails to account for pragmatic factors that can make the same utterance seem more or less offensive or tactless in different social situations. We propose an approach to ethics that is more centred on relational and situational factors, exploring what it means for a system, as a social actor, to treat an individual respectfully in a (series of) interaction(s). Our work anticipates a set of largely unexplored risks at the level of situated interaction, and offers practical suggestions to help LLM technologies behave as 'good' social actors and treat people respectfully. ",
    "url": "https://arxiv.org/abs/2401.09082",
    "authors": [
      "Lize Alberts",
      "Geoff Keeling",
      "Amanda McCroskery"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2401.09093",
    "title": "RWKV-TS: Beyond Traditional Recurrent Neural Network for Time Series  Tasks",
    "abstract": "Traditional Recurrent Neural Network (RNN) architectures, such as LSTM and GRU, have historically held prominence in time series tasks. However, they have recently seen a decline in their dominant position across various time series tasks. As a result, recent advancements in time series forecasting have seen a notable shift away from RNNs towards alternative architectures such as Transformers, MLPs, and CNNs. To go beyond the limitations of traditional RNNs, we design an efficient RNN-based model for time series tasks, named RWKV-TS, with three distinctive features: (i) A novel RNN architecture characterized by $O(L)$ time complexity and memory usage. (ii) An enhanced ability to capture long-term sequence information compared to traditional RNNs. (iii) High computational efficiency coupled with the capacity to scale up effectively. Through extensive experimentation, our proposed RWKV-TS model demonstrates competitive performance when compared to state-of-the-art Transformer-based or CNN-based models. Notably, RWKV-TS exhibits not only comparable performance but also demonstrates reduced latency and memory utilization. The success of RWKV-TS encourages further exploration and innovation in leveraging RNN-based approaches within the domain of Time Series. The combination of competitive performance, low latency, and efficient memory usage positions RWKV-TS as a promising avenue for future research in time series tasks. Code is available at:\\href{https://github.com/howard-hou/RWKV-TS}{ https://github.com/howard-hou/RWKV-TS} ",
    "url": "https://arxiv.org/abs/2401.09093",
    "authors": [
      "Haowen Hou",
      "F. Richard Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.09101",
    "title": "PIN-SLAM: LiDAR SLAM Using a Point-Based Implicit Neural Representation  for Achieving Global Map Consistency",
    "abstract": "Accurate and robust localization and mapping are essential components for most autonomous robots. In this paper, we propose a SLAM system for building globally consistent maps, called PIN-SLAM, that is based on an elastic and compact point-based implicit neural map representation. Taking range measurements as input, our approach alternates between incremental learning of the local implicit signed distance field and the pose estimation given the current local map using a correspondence-free, point-to-implicit model registration. Our implicit map is based on sparse optimizable neural points, which are inherently elastic and deformable with the global pose adjustment when closing a loop. Loops are also detected using the neural point features. Extensive experiments validate that PIN-SLAM is robust to various environments and versatile to different range sensors such as LiDAR and RGB-D cameras. PIN-SLAM achieves pose estimation accuracy better or on par with the state-of-the-art LiDAR odometry or SLAM systems and outperforms the recent neural implicit SLAM approaches while maintaining a more consistent, and highly compact implicit map that can be reconstructed as accurate and complete meshes. Finally, thanks to the voxel hashing for efficient neural points indexing and the fast implicit map-based registration without closest point association, PIN-SLAM can run at the sensor frame rate on a moderate GPU. Codes will be available at: https://github.com/PRBonn/PIN_SLAM. ",
    "url": "https://arxiv.org/abs/2401.09101",
    "authors": [
      "Yue Pan",
      "Xingguang Zhong",
      "Louis Wiesmann",
      "Thorbjörn Posewsky",
      "Jens Behley",
      "Cyrill Stachniss"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.09102",
    "title": "SendingNetwork: Advancing the Future of Decentralized Messaging Networks",
    "abstract": "In the evolving landscape of Internet technologies, where decentralized systems, especially blockchain-based computation and storage like Ethereum Virtual Machine (EVM), Arweave, and IPFS, are gaining prominence, there remains a stark absence of a holistic decentralized communication framework. This gap underlines the pressing necessity for a protocol that not only enables seamless cross-platform messaging but also allows direct messaging to wallet addresses, fostering interoperability and privacy across diverse platforms. SendingNetwork addresses this need by creating a reliable and secure decentralized communication network, targeting essential challenges like privacy protection, scalability, efficiency, and composability. Central to our approach is the incorporation of edge computing to form an adaptive relay network with the modular libp2p library. We introduce a dynamic group chat encryption mechanism based on the Double Ratchet algorithm for secure communication and propose a Delegation scheme for efficient message processing in large group chats, enhancing both resilience and scalability. Our theoretical analyses affirm the Delegation scheme's superior performance. To bolster system stability and encourage node participation, we integrate two innovative consensus mechanisms: \"Proof of Relay\" for validating message relay workload based on the novel KZG commitment, and \"Proof of Availability\" for ensuring network consistency and managing incentives through Verkle trees. Our whitepaper details the network's key components and architecture, concluding with a roadmap and a preview of future enhancements to SendingNetwork. ",
    "url": "https://arxiv.org/abs/2401.09102",
    "authors": [
      "Mason Yeung"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.09125",
    "title": "Understanding Heterophily for Graph Neural Networks",
    "abstract": "Graphs with heterophily have been regarded as challenging scenarios for Graph Neural Networks (GNNs), where nodes are connected with dissimilar neighbors through various patterns. In this paper, we present theoretical understandings of the impacts of different heterophily patterns for GNNs by incorporating the graph convolution (GC) operations into fully connected networks via the proposed Heterophilous Stochastic Block Models (HSBM), a general random graph model that can accommodate diverse heterophily patterns. Firstly, we show that by applying a GC operation, the separability gains are determined by two factors, i.e., the Euclidean distance of the neighborhood distributions and $\\sqrt{\\mathbb{E}\\left[\\operatorname{deg}\\right]}$, where $\\mathbb{E}\\left[\\operatorname{deg}\\right]$ is the averaged node degree. It reveals that the impact of heterophily on classification needs to be evaluated alongside the averaged node degree. Secondly, we show that the topological noise has a detrimental impact on separability, which is equivalent to degrading $\\mathbb{E}\\left[\\operatorname{deg}\\right]$. Finally, when applying multiple GC operations, we show that the separability gains are determined by the normalized distance of the $l$-powered neighborhood distributions. It indicates that the nodes still possess separability as $l$ goes to infinity in a wide range of regimes. Extensive experiments on both synthetic and real-world data verify the effectiveness of our theory. ",
    "url": "https://arxiv.org/abs/2401.09125",
    "authors": [
      "Junfu Wang",
      "Yuanfang Guo",
      "Liang Yang",
      "Yunhong Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.09127",
    "title": "AI Empowered Channel Semantic Acquisition for 6G Integrated Sensing and  Communication Networks",
    "abstract": "Motivated by the need for increased spectral efficiency and the proliferation of intelligent applications, the sixth-generation (6G) mobile network is anticipated to integrate the dual-functions of communication and sensing (C&S). Although the millimeter wave (mmWave) communication and mmWave radar share similar multiple-input multiple-output (MIMO) architecture for integration, the full potential of dual-function synergy remains to be exploited. In this paper, we commence by overviewing state-of-the-art schemes from the aspects of waveform design and signal processing. Nevertheless, these approaches face the dilemma of mutual compromise between C&S performance. To this end, we reveal and exploit the synergy between C&S. In the proposed framework, we introduce a two-stage frame structure and resort artificial intelligence (AI) to achieve the synergistic gain by designing a joint C&S channel semantic extraction and reconstruction network (JCASCasterNet). With just a cost-effective and energy-efficient single sensing antenna, the proposed scheme achieves enhanced overall performance while requiring only limited pilot and feedback signaling overhead. In the end, we outline the challenges that lie ahead in the future development of integrated sensing and communication networks, along with promising directions for further research. ",
    "url": "https://arxiv.org/abs/2401.09127",
    "authors": [
      "Yifei Zhang",
      "Zhen Gao",
      "Jingjing Zhao",
      "Ziming He",
      "Yunsheng Zhang",
      "Chen Lu",
      "Pei Xiao"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2401.09133",
    "title": "SM$^3$: Self-Supervised Multi-task Modeling with Multi-view 2D Images  for Articulated Objects",
    "abstract": "Reconstructing real-world objects and estimating their movable joint structures are pivotal technologies within the field of robotics. Previous research has predominantly focused on supervised approaches, relying on extensively annotated datasets to model articulated objects within limited categories. However, this approach falls short of effectively addressing the diversity present in the real world. To tackle this issue, we propose a self-supervised interaction perception method, referred to as SM$^3$, which leverages multi-view RGB images captured before and after interaction to model articulated objects, identify the movable parts, and infer the parameters of their rotating joints. By constructing 3D geometries and textures from the captured 2D images, SM$^3$ achieves integrated optimization of movable part and joint parameters during the reconstruction process, obviating the need for annotations. Furthermore, we introduce the MMArt dataset, an extension of PartNet-Mobility, encompassing multi-view and multi-modal data of articulated objects spanning diverse categories. Evaluations demonstrate that SM$^3$ surpasses existing benchmarks across various categories and objects, while its adaptability in real-world scenarios has been thoroughly validated. ",
    "url": "https://arxiv.org/abs/2401.09133",
    "authors": [
      "Haowen Wang",
      "Zhen Zhao",
      "Zhao Jin",
      "Zhengping Che",
      "Liang Qiao",
      "Yakun Huang",
      "Zhipeng Fan",
      "Xiuquan Qiao",
      "Jian Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2401.09190",
    "title": "Exploring the Role of Convolutional Neural Networks (CNN) in Dental  Radiography Segmentation: A Comprehensive Systematic Literature Review",
    "abstract": "In the field of dentistry, there is a growing demand for increased precision in diagnostic tools, with a specific focus on advanced imaging techniques such as computed tomography, cone beam computed tomography, magnetic resonance imaging, ultrasound, and traditional intra-oral periapical X-rays. Deep learning has emerged as a pivotal tool in this context, enabling the implementation of automated segmentation techniques crucial for extracting essential diagnostic data. This integration of cutting-edge technology addresses the urgent need for effective management of dental conditions, which, if left undetected, can have a significant impact on human health. The impressive track record of deep learning across various domains, including dentistry, underscores its potential to revolutionize early detection and treatment of oral health issues. Objective: Having demonstrated significant results in diagnosis and prediction, deep convolutional neural networks (CNNs) represent an emerging field of multidisciplinary research. The goals of this study were to provide a concise overview of the state of the art, standardize the current debate, and establish baselines for future research. Method: In this study, a systematic literature review is employed as a methodology to identify and select relevant studies that specifically investigate the deep learning technique for dental imaging analysis. This study elucidates the methodological approach, including the systematic collection of data, statistical analysis, and subsequent dissemination of outcomes. Conclusion: This work demonstrates how Convolutional Neural Networks (CNNs) can be employed to analyze images, serving as effective tools for detecting dental pathologies. Although this research acknowledged some limitations, CNNs utilized for segmenting and categorizing teeth exhibited their highest level of performance overall. ",
    "url": "https://arxiv.org/abs/2401.09190",
    "authors": [
      "Walid Brahmi",
      "Imen Jdey",
      "Fadoua Drira"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.09191",
    "title": "An Optimal Transport Approach for Computing Adversarial Training Lower  Bounds in Multiclass Classification",
    "abstract": "Despite the success of deep learning-based algorithms, it is widely known that neural networks may fail to be robust. A popular paradigm to enforce robustness is adversarial training (AT), however, this introduces many computational and theoretical difficulties. Recent works have developed a connection between AT in the multiclass classification setting and multimarginal optimal transport (MOT), unlocking a new set of tools to study this problem. In this paper, we leverage the MOT connection to propose computationally tractable numerical algorithms for computing universal lower bounds on the optimal adversarial risk and identifying optimal classifiers. We propose two main algorithms based on linear programming (LP) and entropic regularization (Sinkhorn). Our key insight is that one can harmlessly truncate the higher order interactions between classes, preventing the combinatorial run times typically encountered in MOT problems. We validate these results with experiments on MNIST and CIFAR-$10$, which demonstrate the tractability of our approach. ",
    "url": "https://arxiv.org/abs/2401.09191",
    "authors": [
      "Nicolas Garcia Trillos",
      "Matt Jacobs",
      "Jakwang Kim",
      "Matthew Werenski"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.09193",
    "title": "GNN-LoFI: a Novel Graph Neural Network through Localized Feature-based  Histogram Intersection",
    "abstract": "Graph neural networks are increasingly becoming the framework of choice for graph-based machine learning. In this paper, we propose a new graph neural network architecture that substitutes classical message passing with an analysis of the local distribution of node features. To this end, we extract the distribution of features in the egonet for each local neighbourhood and compare them against a set of learned label distributions by taking the histogram intersection kernel. The similarity information is then propagated to other nodes in the network, effectively creating a message passing-like mechanism where the message is determined by the ensemble of the features. We perform an ablation study to evaluate the network's performance under different choices of its hyper-parameters. Finally, we test our model on standard graph classification and regression benchmarks, and we find that it outperforms widely used alternative approaches, including both graph kernels and graph neural networks. ",
    "url": "https://arxiv.org/abs/2401.09193",
    "authors": [
      "Alessandro Bicciato",
      "Luca Cosmo",
      "Giorgia Minello",
      "Luca Rossi",
      "Andrea Torsello"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.09204",
    "title": "Cross-Domain AI for Early Attack Detection and Defense Against Malicious  Flows in O-RAN",
    "abstract": "Only the chairs can edit In the fight against cyber attacks, Network Softwarization (NS) is a flexible and adaptable shield, using advanced software to spot malicious activity in regular network traffic. However, the availability of comprehensive datasets for mobile networks, which are fundamental for the development of Machine Learning (ML) solutions for attack detection near their source, is still limited. Cross-Domain Artificial Intelligence (AI) can be the key to address this, although its application in Open Radio Access Network (O-RAN) is still at its infancy. To address these challenges, we deployed an end-to-end O-RAN network, that was used to collect data from the RAN and the transport network. These datasets allow us to combine the knowledge from an in-network ML traffic classifier for attack detection to bolster the training of an ML-based traffic classifier specifically tailored for the RAN. Our results demonstrate the potential of the proposed approach, achieving an accuracy rate of 93%. This approach not only bridges critical gaps in mobile network security but also showcases the potential of cross-domain AI in enhancing the efficacy of network security measures. ",
    "url": "https://arxiv.org/abs/2401.09204",
    "authors": [
      "Bruno Missi Xavier",
      "Merim Dzaferagic",
      "Irene Vilà",
      "Magnos Martinello",
      "Marco Ruffini"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2401.09209",
    "title": "Username Squatting on Online Social Networks: A Study on X",
    "abstract": "Adversaries have been targeting unique identifiers to launch typo-squatting, mobile app squatting and even voice squatting attacks. Anecdotal evidence suggest that online social networks (OSNs) are also plagued with accounts that use similar usernames. This can be confusing to users but can also be exploited by adversaries. However, to date no study characterizes this problem on OSNs. In this work, we define the username squatting problem and design the first multi-faceted measurement study to characterize it on X. We develop a username generation tool (UsernameCrazy) to help us analyze hundreds of thousands of username variants derived from celebrity accounts. Our study reveals that thousands of squatted usernames have been suspended by X, while tens of thousands that still exist on the network are likely bots. Out of these, a large number share similar profile pictures and profile names to the original account signalling impersonation attempts. We found that squatted accounts are being mentioned by mistake in tweets hundreds of thousands of times and are even being prioritized in searches by the network's search recommendation algorithm exacerbating the negative impact squatted accounts can have in OSNs. We use our insights and take the first step to address this issue by designing a framework (SQUAD) that combines UsernameCrazy with a new classifier to efficiently detect suspicious squatted accounts. Our evaluation of SQUAD's prototype implementation shows that it can achieve 94% F1-score when trained on a small dataset. ",
    "url": "https://arxiv.org/abs/2401.09209",
    "authors": [
      "Anastasios Lepipas",
      "Anastasia Borovykh",
      "Soteris Demetriou"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.09217",
    "title": "Neural Network Equalizers and Successive Interference Cancellation for  Bandlimited Channels with a Nonlinearity",
    "abstract": "Neural networks (NNs) inspired by the forward-backward algorithm (FBA) are used as equalizers for bandlimited channels with a memoryless nonlinearity. The NN-equalizers are combined with successive interference cancellation (SIC) to approach the information rates of joint detection and decoding (JDD) with considerably less complexity than JDD and other existing equalizers. Simulations for short-haul optical fiber links with square-law detection illustrate the gains of NNs as compared to the complexity-limited FBA and Gibbs sampling. ",
    "url": "https://arxiv.org/abs/2401.09217",
    "authors": [
      "Daniel Plabst",
      "Tobias Prinz",
      "Francesca Diedolo",
      "Thomas Wiegart",
      "Georg Böcherer",
      "Norbert Hanik",
      "Gerhard Kramer"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2401.09229",
    "title": "Information flow and Laplacian dynamics on local optima networks",
    "abstract": "We propose a new way of looking at local optima networks (LONs). LONs represent fitness landscapes; the nodes are local optima, and the edges are search transitions between them. Many metrics computed on LONs have been proposed and shown to be linked to metaheuristic search difficulty. These have typically considered LONs as describing static structures. In contrast to this, Laplacian dynamics (LD) is an approach to consider the information flow across a network as a dynamical process. We adapt and apply LD to the context of LONs. As a testbed, we consider instances from the quadratic assignment problem (QAP) library. Metrics related to LD are proposed and these are compared with existing LON metrics. The results show that certain LD metrics are strong predictors of metaheuristic performance for iterated local search and tabu search. ",
    "url": "https://arxiv.org/abs/2401.09229",
    "authors": [
      "Hendrik Richter",
      "Sarah L. Thomson"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2401.09231",
    "title": "Scalable Resource Provisioning for Multi-user Communications in Next  Generation Networks",
    "abstract": "The great demand for real-time multimedia sessions encompassing groups of users (multi-user), associated with the limitations of the current Internet in providing quality assurance, has raised challenges for defining the best mechanisms to deploy the Next Generation of Networks (NGN). There is a consensus that an efficient and scalable provisioning of network resources is crucial for the success of the NGN, mainly in what concerns access networks. Previous solutions for the control of multi-user sessions rely mostly on uncoordinated actions to allocate per-flow bandwidth and multicast trees. This paper introduces a Multiuser Aggregated Resource Allocation mechanism (MARA) that coordinates the control of class-based bandwidth and multicast resources in a scalable manner. In comparison with previous work, MARA significantly reduces signaling, state and processing overhead. The performance benefits of MARA are analyzed though simulations, which successfully demonstrated the significant optimization in the network performance. ",
    "url": "https://arxiv.org/abs/2401.09231",
    "authors": [
      "Augusto Neto",
      "Eduardo Cerqueira",
      "Marilia Curado",
      "Edmundo Monteiro",
      "Paulo Mendes"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2401.09232",
    "title": "Dynamic Relation Transformer for Contextual Text Block Detection",
    "abstract": "Contextual Text Block Detection (CTBD) is the task of identifying coherent text blocks within the complexity of natural scenes. Previous methodologies have treated CTBD as either a visual relation extraction challenge within computer vision or as a sequence modeling problem from the perspective of natural language processing. We introduce a new framework that frames CTBD as a graph generation problem. This methodology consists of two essential procedures: identifying individual text units as graph nodes and discerning the sequential reading order relationships among these units as graph edges. Leveraging the cutting-edge capabilities of DQ-DETR for node detection, our framework innovates further by integrating a novel mechanism, a Dynamic Relation Transformer (DRFormer), dedicated to edge generation. DRFormer incorporates a dual interactive transformer decoder that deftly manages a dynamic graph structure refinement process. Through this iterative process, the model systematically enhances the graph's fidelity, ultimately resulting in improved precision in detecting contextual text blocks. Comprehensive experimental evaluations conducted on both SCUT-CTW-Context and ReCTS-Context datasets substantiate that our method achieves state-of-the-art results, underscoring the effectiveness and potential of our graph generation framework in advancing the field of CTBD. ",
    "url": "https://arxiv.org/abs/2401.09232",
    "authors": [
      "Jiawei Wang",
      "Shunchi Zhang",
      "Kai Hu",
      "Chixiang Ma",
      "Zhuoyao Zhong",
      "Lei Sun",
      "Qiang Huo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.09235",
    "title": "A Characterization Theorem for Equivariant Networks with Point-wise  Activations",
    "abstract": "Equivariant neural networks have shown improved performance, expressiveness and sample complexity on symmetrical domains. But for some specific symmetries, representations, and choice of coordinates, the most common point-wise activations, such as ReLU, are not equivariant, hence they cannot be employed in the design of equivariant neural networks. The theorem we present in this paper describes all possible combinations of finite-dimensional representations, choice of coordinates and point-wise activations to obtain an exactly equivariant layer, generalizing and strengthening existing characterizations. Notable cases of practical relevance are discussed as corollaries. Indeed, we prove that rotation-equivariant networks can only be invariant, as it happens for any network which is equivariant with respect to connected compact groups. Then, we discuss implications of our findings when applied to important instances of exactly equivariant networks. First, we completely characterize permutation equivariant networks such as Invariant Graph Networks with point-wise nonlinearities and their geometric counterparts, highlighting a plethora of models whose expressive power and performance are still unknown. Second, we show that feature spaces of disentangled steerable convolutional neural networks are trivial representations. ",
    "url": "https://arxiv.org/abs/2401.09235",
    "authors": [
      "Marco Pacini",
      "Xiaowen Dong",
      "Bruno Lepri",
      "Gabriele Santin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.09240",
    "title": "A Blockchain-based Model for Securing Data Pipeline in a Heterogeneous  Information System",
    "abstract": "In our digital world, access to personal and public data has become an item of concern, with challenging security and privacy aspects. Modern information systems are heterogeneous in nature and have an inherent security vulnerability, which is susceptible to data interception and data modification due to unsecured communication data pipelines between connected endpoints. This re-search article presents a blockchain-based model for securing data pipelines in a heterogeneous information system using an integrated multi-hazard early warning system (MHEWS) as a case study. The proposed model utilizes the inherent security features of blockchain technology to address the security and privacy concerns that arise in data pipelines. The model is designed to ensure data integrity, confidentiality, and authenticity in a decentralized manner. The model is evaluated in a hybrid environment using a prototype implementation and simulation experiments with outcomes that demonstrate advantages over traditional approaches for a tamper-proof and immutable data pipeline for data authenticity and integrity using a confidential ledger. ",
    "url": "https://arxiv.org/abs/2401.09240",
    "authors": [
      "MN Ramahlosi",
      "Y Madani",
      "A Akanbi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2401.09258",
    "title": "An Efficient Generalizable Framework for Visuomotor Policies via  Control-aware Augmentation and Privilege-guided Distillation",
    "abstract": "Visuomotor policies, which learn control mechanisms directly from high-dimensional visual observations, confront challenges in adapting to new environments with intricate visual variations. Data augmentation emerges as a promising method for bridging these generalization gaps by enriching data variety. However, straightforwardly augmenting the entire observation shall impose excessive burdens on policy learning and may even result in performance degradation. In this paper, we propose to improve the generalization ability of visuomotor policies as well as preserve training stability from two aspects: 1) We learn a control-aware mask through a self-supervised reconstruction task with three auxiliary losses and then apply strong augmentation only to those control-irrelevant regions based on the mask to reduce the generalization gaps. 2) To address training instability issues prevalent in visual reinforcement learning (RL), we distill the knowledge from a pretrained RL expert processing low-level environment states, to the student visuomotor policy. The policy is subsequently deployed to unseen environments without any further finetuning. We conducted comparison and ablation studies across various benchmarks: the DMControl Generalization Benchmark (DMC-GB), the enhanced Robot Manipulation Distraction Benchmark (RMDB), and a specialized long-horizontal drawer-opening robotic task. The extensive experimental results well demonstrate the effectiveness of our method, e.g., showing a 17\\% improvement over previous methods in the video-hard setting of DMC-GB. ",
    "url": "https://arxiv.org/abs/2401.09258",
    "authors": [
      "Yinuo Zhao",
      "Kun Wu",
      "Tianjiao Yi",
      "Zhiyuan Xu",
      "Xiaozhu Ju",
      "Zhengping Che",
      "Qinru Qiu",
      "Chi Harold Liu",
      "Jian Tang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.09267",
    "title": "Risk-Aware Accelerated Wireless Federated Learning with Heterogeneous  Clients",
    "abstract": "Wireless Federated Learning (FL) is an emerging distributed machine learning paradigm, particularly gaining momentum in domains with confidential and private data on mobile clients. However, the location-dependent performance, in terms of transmission rates and susceptibility to transmission errors, poses major challenges for wireless FL's convergence speed and accuracy. The challenge is more acute for hostile environments without a metric that authenticates the data quality and security profile of the clients. In this context, this paper proposes a novel risk-aware accelerated FL framework that accounts for the clients heterogeneity in the amount of possessed data, transmission rates, transmission errors, and trustworthiness. Classifying clients according to their location-dependent performance and trustworthiness profiles, we propose a dynamic risk-aware global model aggregation scheme that allows clients to participate in descending order of their transmission rates and an ascending trustworthiness constraint. In particular, the transmission rate is the dominant participation criterion for initial rounds to accelerate the convergence speed. Our model then progressively relaxes the transmission rate restriction to explore more training data at cell-edge clients. The aggregation rounds incorporate a debiasing factor that accounts for transmission errors. Risk-awareness is enabled by a validation set, where the base station eliminates non-trustworthy clients at the fine-tuning stage. The proposed scheme is benchmarked against a conservative scheme (i.e., only allowing trustworthy devices) and an aggressive scheme (i.e., oblivious to the trust metric). The numerical results highlight the superiority of the proposed scheme in terms of accuracy and convergence speed when compared to both benchmarks. ",
    "url": "https://arxiv.org/abs/2401.09267",
    "authors": [
      "Mohamed Ads",
      "Hesham ElSawy",
      "Hossam S. Hassanein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.09323",
    "title": "BENO: Boundary-embedded Neural Operators for Elliptic PDEs",
    "abstract": "Elliptic partial differential equations (PDEs) are a major class of time-independent PDEs that play a key role in many scientific and engineering domains such as fluid dynamics, plasma physics, and solid mechanics. Recently, neural operators have emerged as a promising technique to solve elliptic PDEs more efficiently by directly mapping the input to solutions. However, existing networks typically cannot handle complex geometries and inhomogeneous boundary values present in the real world. Here we introduce Boundary-Embedded Neural Operators (BENO), a novel neural operator architecture that embeds the complex geometries and inhomogeneous boundary values into the solving of elliptic PDEs. Inspired by classical Green's function, BENO consists of two branches of Graph Neural Networks (GNNs) for interior source term and boundary values, respectively. Furthermore, a Transformer encoder maps the global boundary geometry into a latent vector which influences each message passing layer of the GNNs. We test our model extensively in elliptic PDEs with various boundary conditions. We show that all existing baseline methods fail to learn the solution operator. In contrast, our model, endowed with boundary-embedded architecture, outperforms state-of-the-art neural operators and strong baselines by an average of 60.96\\%. Our source code can be found https://github.com/AI4Science-WestlakeU/beno.git. ",
    "url": "https://arxiv.org/abs/2401.09323",
    "authors": [
      "Haixin Wang",
      "Jiaxin Li",
      "Anubhav Dwivedi",
      "Kentaro Hara",
      "Tailin Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.09325",
    "title": "Siamese Meets Diffusion Network: SMDNet for Enhanced Change Detection in  High-Resolution RS Imagery",
    "abstract": "Recently, the application of deep learning to change detection (CD) has significantly progressed in remote sensing images. In recent years, CD tasks have mostly used architectures such as CNN and Transformer to identify these changes. However, these architectures have shortcomings in representing boundary details and are prone to false alarms and missed detections under complex lighting and weather conditions. For that, we propose a new network, Siamese Meets Diffusion Network (SMDNet). This network combines the Siam-U2Net Feature Differential Encoder (SU-FDE) and the denoising diffusion implicit model to improve the accuracy of image edge change detection and enhance the model's robustness under environmental changes. First, we propose an innovative SU-FDE module that utilizes shared weight features to capture differences between time series images and identify similarities between features to enhance edge detail detection. Furthermore, we add an attention mechanism to identify key coarse features to improve the model's sensitivity and accuracy. Finally, the diffusion model of progressive sampling is used to fuse key coarse features, and the noise reduction ability of the diffusion model and the advantages of capturing the probability distribution of image data are used to enhance the adaptability of the model in different environments. Our method's combination of feature extraction and diffusion models demonstrates effectiveness in change detection in remote sensing images. The performance evaluation of SMDNet on LEVIR-CD, DSIFN-CD, and CDD datasets yields validated F1 scores of 90.99%, 88.40%, and 88.47%, respectively. This substantiates the advanced capabilities of our model in accurately identifying variations and intricate details. ",
    "url": "https://arxiv.org/abs/2401.09325",
    "authors": [
      "Jia Jia",
      "Geunho Lee",
      "Zhibo Wang",
      "Lyu Zhi",
      "Yuchu He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.09352",
    "title": "Neural Contractive Dynamical Systems",
    "abstract": "Stability guarantees are crucial when ensuring a fully autonomous robot does not take undesirable or potentially harmful actions. Unfortunately, global stability guarantees are hard to provide in dynamical systems learned from data, especially when the learned dynamics are governed by neural networks. We propose a novel methodology to learn neural contractive dynamical systems, where our neural architecture ensures contraction, and hence, global stability. To efficiently scale the method to high-dimensional dynamical systems, we develop a variant of the variational autoencoder that learns dynamics in a low-dimensional latent representation space while retaining contractive stability after decoding. We further extend our approach to learning contractive systems on the Lie group of rotations to account for full-pose end-effector dynamic motions. The result is the first highly flexible learning architecture that provides contractive stability guarantees with capability to perform obstacle avoidance. Empirically, we demonstrate that our approach encodes the desired dynamics more accurately than the current state-of-the-art, which provides less strong stability guarantees. ",
    "url": "https://arxiv.org/abs/2401.09352",
    "authors": [
      "Hadi Beik-Mohammadi",
      "Søren Hauberg",
      "Georgios Arvanitidis",
      "Nadia Figueroa",
      "Gerhard Neumann",
      "Leonel Rozo"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.09358",
    "title": "Detection of Distributed Denial of Service Attacks Carried Out by  Botnets in Software-Defined Networks",
    "abstract": "Recent years witnessed a surge in network traffic due to the emergence of new online services, causing periodic saturation and complexity problems. Additionally, the growing number of IoT devices further compounds the problem. Software Defined Network (SDN) is a new architecture which offers innovative advantages that help to reduce saturation problems. Despite its benefits, SDNs not only can be affected by traditional attacks but also introduce new security challenges. In this context, Distributed Denial of Service (DDoS) is one of the most important attacks that can damage an SDN network's normal operation. Furthermore, if these attacks are executed using botnets, they can use thousands of compromised devices to disrupt critical online services. This paper proposes a framework for detecting DDoS attacks generated by a group of botnets in an SDN network. The framework is implemented using open-source tools such as Mininet and OpenDaylight and tested in a centralized network topology using BYOB and SNORT. The results demonstrate real-time attack identification by implementing an intrusion detection mechanism in the victim client. Our proposed solution offers quick and effective detection of DDoS attacks in SDN networks. The framework can successfully differentiate the type of attack with high accuracy in a short time ",
    "url": "https://arxiv.org/abs/2401.09358",
    "authors": [
      "Jaime Tamayo",
      "Lorena Isabel Barona López",
      "Ángel Leonardo Valdivieso Caraguay"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2401.09387",
    "title": "A Multi-Agent Security Testbed for the Analysis of Attacks and Defenses  in Collaborative Sensor Fusion",
    "abstract": "The performance and safety of autonomous vehicles (AVs) deteriorates under adverse environments and adversarial actors. The investment in multi-sensor, multi-agent (MSMA) AVs is meant to promote improved efficiency of travel and mitigate safety risks. Unfortunately, minimal investment has been made to develop security-aware MSMA sensor fusion pipelines leaving them vulnerable to adversaries. To advance security analysis of AVs, we develop the Multi-Agent Security Testbed, MAST, in the Robot Operating System (ROS2). Our framework is scalable for general AV scenarios and is integrated with recent multi-agent datasets. We construct the first bridge between AVstack and ROS and develop automated AV pipeline builds to enable rapid AV prototyping. We tackle the challenge of deploying variable numbers of agent/adversary nodes at launch-time with dynamic topic remapping. Using this testbed, we motivate the need for security-aware AV architectures by exposing the vulnerability of centralized multi-agent fusion pipelines to (un)coordinated adversary models in case studies and Monte Carlo analysis. ",
    "url": "https://arxiv.org/abs/2401.09387",
    "authors": [
      "R. Spencer Hallyburton",
      "David Hunt",
      "Shaocheng Luo",
      "Miroslav Pajic"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2401.09413",
    "title": "POP-3D: Open-Vocabulary 3D Occupancy Prediction from Images",
    "abstract": "We describe an approach to predict open-vocabulary 3D semantic voxel occupancy map from input 2D images with the objective of enabling 3D grounding, segmentation and retrieval of free-form language queries. This is a challenging problem because of the 2D-3D ambiguity and the open-vocabulary nature of the target tasks, where obtaining annotated training data in 3D is difficult. The contributions of this work are three-fold. First, we design a new model architecture for open-vocabulary 3D semantic occupancy prediction. The architecture consists of a 2D-3D encoder together with occupancy prediction and 3D-language heads. The output is a dense voxel map of 3D grounded language embeddings enabling a range of open-vocabulary tasks. Second, we develop a tri-modal self-supervised learning algorithm that leverages three modalities: (i) images, (ii) language and (iii) LiDAR point clouds, and enables training the proposed architecture using a strong pre-trained vision-language model without the need for any 3D manual language annotations. Finally, we demonstrate quantitatively the strengths of the proposed model on several open-vocabulary tasks: Zero-shot 3D semantic segmentation using existing datasets; 3D grounding and retrieval of free-form language queries, using a small dataset that we propose as an extension of nuScenes. You can find the project page here https://vobecant.github.io/POP3D. ",
    "url": "https://arxiv.org/abs/2401.09413",
    "authors": [
      "Antonin Vobecky",
      "Oriane Siméoni",
      "David Hurych",
      "Spyros Gidaris",
      "Andrei Bursuc",
      "Patrick Pérez",
      "Josef Sivic"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.09417",
    "title": "Vision Mamba: Efficient Visual Representation Learning with  Bidirectional State Space Model",
    "abstract": "Recently the state space models (SSMs) with efficient hardware-aware designs, i.e., Mamba, have shown great potential for long sequence modeling. Building efficient and generic vision backbones purely upon SSMs is an appealing direction. However, representing visual data is challenging for SSMs due to the position-sensitivity of visual data and the requirement of global context for visual understanding. In this paper, we show that the reliance of visual representation learning on self-attention is not necessary and propose a new generic vision backbone with bidirectional Mamba blocks (Vim), which marks the image sequences with position embeddings and compresses the visual representation with bidirectional state space models. On ImageNet classification, COCO object detection, and ADE20k semantic segmentation tasks, Vim achieves higher performance compared to well-established vision transformers like DeiT, while also demonstrating significantly improved computation & memory efficiency. For example, Vim is 2.8$\\times$ faster than DeiT and saves 86.8% GPU memory when performing batch inference to extract features on images with a resolution of 1248$\\times$1248. The results demonstrate that Vim is capable of overcoming the computation & memory constraints on performing Transformer-style understanding for high-resolution images and it has great potential to become the next-generation backbone for vision foundation models. Code is available at https://github.com/hustvl/Vim. ",
    "url": "https://arxiv.org/abs/2401.09417",
    "authors": [
      "Lianghui Zhu",
      "Bencheng Liao",
      "Qian Zhang",
      "Xinlong Wang",
      "Wenyu Liu",
      "Xinggang Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.09420",
    "title": "LionHeart: A Layer-based Mapping Framework for Heterogeneous Systems  with Analog In-Memory Computing Tiles",
    "abstract": "When arranged in a crossbar configuration, resistive memory devices can be used to execute MVM, the most dominant operation of many ML algorithms, in constant time complexity. Nonetheless, when performing computations in the analog domain, novel challenges are introduced in terms of arithmetic precision and stochasticity, due to non-ideal circuit and device behaviour. Moreover, these non-idealities have a temporal dimension, resulting in a degrading application accuracy over time. Facing these challenges, we propose a novel framework, named LionHeart, to obtain hybrid analog-digital mappings to execute DL inference workloads using heterogeneous accelerators. The accuracy-constrained mappings derived by LionHeart showcase, across different DNNs and datasets, high accuracy and potential for speedup. The results of the full system simulations highlight run-time reductions and energy efficiency gains that exceed 6X, with a user-defined accuracy threshold with respect to a fully digital floating point implementation. ",
    "url": "https://arxiv.org/abs/2401.09420",
    "authors": [
      "Corey Lammie",
      "Flavio Ponzina",
      "Yuxuan Wang",
      "Joshua Klein",
      "Marina Zapater",
      "Irem Boybat",
      "Abu Sebastian",
      "Giovanni Ansaloni",
      "David Atienza"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2311.18042",
    "title": "Compilation for Surface Code Quantum Computers",
    "abstract": "Practical applications of quantum computing depend on fault-tolerant devices with error correction. Today, the most promising approach is a class of error-correcting codes called surface codes. In this paper, we study the problem of compiling quantum circuits for quantum computers implementing surface codes. The problem involves (1) mapping circuit qubits to the device qubits and (2) routing execution paths between pairs of interacting qubits. We call this the surface code mapping and routing problem (SCMR). Solving SCMR near-optimally is critical for both efficiency and correctness. An optimal solution limits the cost of a computation in terms of precious quantum resources and also minimizes the probability of incurring an undetected logical error, which increases with each additional time step. We study SCMR from a theoretical and practical perspective. First, we prove that SCMR, as well as a constrained version of the problem, is NP-complete. Second, we present a optimal algorithm for solving SCMR that is based on a SAT encoding. Third, we present a spectrum of efficient relaxations of SCMR, for example, by exploiting greedy algorithms for solving the problem of node-disjoint paths. Finally, we implement and evaluate our algorithms on a large suite of real and synthetic circuits. Our results suggest that our relaxations are a powerful tool for compiling realistic workloads. The relaxation-based algorithms are orders of magnitude faster than the optimal algorithm (solving instances with tens of thousands of gates in minutes), while still finding high-quality solutions, achieving the theoretical lower bound on up to 55 out of 168 circuits from a diverse benchmark suite. ",
    "url": "https://arxiv.org/abs/2311.18042",
    "authors": [
      "Abtin Molavi",
      "Amanda Xu",
      "Swamit Tannu",
      "Aws Albarghouthi"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2401.08627",
    "title": "Predicting and Interpreting Energy Barriers of Metallic Glasses with  Graph Neural Networks",
    "abstract": "Metallic Glasses (MGs) are widely used disordered materials. Understanding the relationship between the local structure and physical properties of MGs is one of the greatest challenges for both material science and condensed matter physics. In this work, we utilize Graph Neural Networks (GNNs) to model the atomic graph structure and study the connection between the structure and the corresponding local energy barrier, which is believed to govern many critical physical properties in MGs. One of our key contributions is to propose a novel Symmetrized GNN (SymGNN) model for predicting the energy barriers, which is invariant under orthogonal transformations of the structure, e.g., rotations and reflections. Such invariance is a desired property that standard GNNs like Graph Convolutional Networks cannot capture. SymGNNs handle the invariance by aggregating over orthogonal transformations of the graph structure for representation learning, and an optimal distribution over all 3D orthogonal transformations $\\mathcal{O}_3$ is learned to maximize the benefit of invariance. We demonstrate in our experiments that SymGNN can significantly improve the energy barrier prediction over other GNNs and non-graph machine learning models. With such an accurate model, we also apply graph explanation algorithms to better reveal the structure-property relationship of MGs. Our GNN framework allows effective prediction of material physical properties and bolsters material science research through the use of AI models. ",
    "url": "https://arxiv.org/abs/2401.08627",
    "authors": [
      "Haoyu Li",
      "Shichang Zhang",
      "Longwen Tang",
      "Mathieu Bauchy",
      "Yizhou Sun"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08667",
    "title": "Data-Driven Physics-Informed Neural Networks: A Digital Twin Perspective",
    "abstract": "This study explores the potential of physics-informed neural networks (PINNs) for the realization of digital twins (DT) from various perspectives. First, various adaptive sampling approaches for collocation points are investigated to verify their effectiveness in the mesh-free framework of PINNs, which allows automated construction of virtual representation without manual mesh generation. Then, the overall performance of the data-driven PINNs (DD-PINNs) framework is examined, which can utilize the acquired datasets in DT scenarios. Its scalability to more general physics is validated within parametric Navier-Stokes equations, where PINNs do not need to be retrained as the Reynolds number varies. In addition, since datasets can be often collected from different fidelity/sparsity in practice, multi-fidelity DD-PINNs are also proposed and evaluated. They show remarkable prediction performance even in the extrapolation tasks, with $42\\sim62\\%$ improvement over the single-fidelity approach. Finally, the uncertainty quantification performance of multi-fidelity DD-PINNs is investigated by the ensemble method to verify their potential in DT, where an accurate measure of predictive uncertainty is critical. The DD-PINN frameworks explored in this study are found to be more suitable for DT scenarios than traditional PINNs from the above perspectives, bringing engineers one step closer to seamless DT realization. ",
    "url": "https://arxiv.org/abs/2401.08667",
    "authors": [
      "Sunwoong Yang",
      "Hojin Kim",
      "Yoonpyo Hong",
      "Kwanjung Yee",
      "Romit Maulik",
      "Namwoo Kang"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08684",
    "title": "A Physics-informed machine learning model for time-dependent wave runup  prediction",
    "abstract": "Wave runup is a critical factor affecting coastal flooding, shoreline changes, and damage to coastal structures. Climate change is also expected to amplify wave runup's impact on coastal areas. Therefore, fast and accurate wave runup estimation is essential for effective coastal engineering design and management. However, predicting the time-dependent wave runup is challenging due to the intrinsic nonlinearities and non-stationarity of the process, even with the use of the most advanced machine learning techniques. In this study, a physics-informed machine learning-based approach is proposed to efficiently and accurately simulate time-series wave runup. The methodology combines the computational efficiency of the Surfbeat (XBSB) mode with the accuracy of the nonhydrostatic (XBNH) mode of the XBeach model. Specifically, a conditional generative adversarial network (cGAN) is used to map the image representation of wave runup from XBSB to the corresponding image from XBNH. These images are generated by first converting wave runup signals into time-frequency scalograms and then transforming them into image representations. The cGAN model achieves improved performance in image-to-image mapping tasks by incorporating physics-based knowledge from XBSB. After training the model, the high-fidelity XBNH-based scalograms can be predicted, which are then employed to reconstruct the time-series wave runup using the inverse wavelet transform. The simulation results underscore the efficiency and robustness of the proposed model in predicting wave runup, suggesting its potential value for applications in risk assessment and management. ",
    "url": "https://arxiv.org/abs/2401.08684",
    "authors": [
      "Saeed Saviz Naeini",
      "Reda Snaiki"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)"
    ]
  },
  {
    "id": "arXiv:2401.08700",
    "title": "Computationally Efficient Optimisation of Elbow-Type Draft Tube Using  Neural Network Surrogates",
    "abstract": "This study aims to provide a comprehensive assessment of single-objective and multi-objective optimisation algorithms for the design of an elbow-type draft tube, as well as to introduce a computationally efficient optimisation workflow. The proposed workflow leverages deep neural network surrogates trained on data obtained from numerical simulations. The use of surrogates allows for a more flexible and faster evaluation of novel designs. The success history-based adaptive differential evolution with linear reduction and the multi-objective evolutionary algorithm based on decomposition were identified as the best-performing algorithms and used to determine the influence of different objectives in the single-objective optimisation and their combined impact on the draft tube design in the multi-objective optimisation. The results for the single-objective algorithm are consistent with those of the multi-objective algorithm when the objectives are considered separately. Multi-objective approach, however, should typically be chosen, especially for computationally inexpensive surrogates. A multi-criteria decision analysis method was used to obtain optimal multi-objective results, showing an improvement of 1.5% and 17% for the pressure recovery factor and drag coefficient, respectively. The difference between the predictions and the numerical results is less than 0.5% for the pressure recovery factor and 3% for the drag coefficient. As the demand for renewable energy continues to increase, the relevance of data-driven optimisation workflows, as discussed in this study, will become increasingly important, especially in the context of global sustainability efforts. ",
    "url": "https://arxiv.org/abs/2401.08700",
    "authors": [
      "Ante Sikirica",
      "Ivana Lučin",
      "Marta Alvir",
      "Lado Kranjčević",
      "Zoran Čarija"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2401.08777",
    "title": "Robust Anomaly Detection for Particle Physics Using Multi-Background  Representation Learning",
    "abstract": "Anomaly, or out-of-distribution, detection is a promising tool for aiding discoveries of new particles or processes in particle physics. In this work, we identify and address two overlooked opportunities to improve anomaly detection for high-energy physics. First, rather than train a generative model on the single most dominant background process, we build detection algorithms using representation learning from multiple background types, thus taking advantage of more information to improve estimation of what is relevant for detection. Second, we generalize decorrelation to the multi-background setting, thus directly enforcing a more complete definition of robustness for anomaly detection. We demonstrate the benefit of the proposed robust multi-background anomaly detection algorithms on a high-dimensional dataset of particle decays at the Large Hadron Collider. ",
    "url": "https://arxiv.org/abs/2401.08777",
    "authors": [
      "Abhijith Gandrakota",
      "Lily Zhang",
      "Aahlad Puli",
      "Kyle Cranmer",
      "Jennifer Ngadiuba",
      "Rajesh Ranganath",
      "Nhan Tran"
    ],
    "subjectives": [
      "High Energy Physics - Experiment (hep-ex)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2401.08833",
    "title": "Revisiting Self-supervised Learning of Speech Representation from a  Mutual Information Perspective",
    "abstract": "Existing studies on self-supervised speech representation learning have focused on developing new training methods and applying pre-trained models for different applications. However, the quality of these models is often measured by the performance of different downstream tasks. How well the representations access the information of interest is less studied. In this work, we take a closer look into existing self-supervised methods of speech from an information-theoretic perspective. We aim to develop metrics using mutual information to help practical problems such as model design and selection. We use linear probes to estimate the mutual information between the target information and learned representations, showing another insight into the accessibility to the target information from speech representations. Further, we explore the potential of evaluating representations in a self-supervised fashion, where we estimate the mutual information between different parts of the data without using any labels. Finally, we show that both supervised and unsupervised measures echo the performance of the models on layer-wise linear probing and speech recognition. ",
    "url": "https://arxiv.org/abs/2401.08833",
    "authors": [
      "Alexander H. Liu",
      "Sung-Lin Yeh",
      "James Glass"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2401.08864",
    "title": "Binaural Angular Separation Network",
    "abstract": "We propose a neural network model that can separate target speech sources from interfering sources at different angular regions using two microphones. The model is trained with simulated room impulse responses (RIRs) using omni-directional microphones without needing to collect real RIRs. By relying on specific angular regions and multiple room simulations, the model utilizes consistent time difference of arrival (TDOA) cues, or what we call delay contrast, to separate target and interference sources while remaining robust in various reverberation environments. We demonstrate the model is not only generalizable to a commercially available device with a slightly different microphone geometry, but also outperforms our previous work which uses one additional microphone on the same device. The model runs in real-time on-device and is suitable for low-latency streaming applications such as telephony and video conferencing. ",
    "url": "https://arxiv.org/abs/2401.08864",
    "authors": [
      "Yang Yang",
      "George Sung",
      "Shao-Fu Shih",
      "Hakan Erdogan",
      "Chehung Lee",
      "Matthias Grundmann"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2401.08916",
    "title": "Two-pass Endpoint Detection for Speech Recognition",
    "abstract": "Endpoint (EP) detection is a key component of far-field speech recognition systems that assist the user through voice commands. The endpoint detector has to trade-off between accuracy and latency, since waiting longer reduces the cases of users being cut-off early. We propose a novel two-pass solution for endpointing, where the utterance endpoint detected from a first pass endpointer is verified by a 2nd-pass model termed EP Arbitrator. Our method improves the trade-off between early cut-offs and latency over a baseline endpointer, as tested on datasets including voice-assistant transactional queries, conversational speech, and the public SLURP corpus. We demonstrate that our method shows improvements regardless of the first-pass EP model used. ",
    "url": "https://arxiv.org/abs/2401.08916",
    "authors": [
      "Anirudh Raju",
      "Aparna Khare",
      "Di He",
      "Ilya Sklyar",
      "Long Chen",
      "Sam Alptekin",
      "Viet Anh Trinh",
      "Zhe Zhang",
      "Colin Vaz",
      "Venkatesh Ravichandran",
      "Roland Maas",
      "Ariya Rastrow"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2401.09019",
    "title": "Change Detection Between Optical Remote Sensing Imagery and Map Data via  Segment Anything Model (SAM)",
    "abstract": "Unsupervised multimodal change detection is pivotal for time-sensitive tasks and comprehensive multi-temporal Earth monitoring. In this study, we explore unsupervised multimodal change detection between two key remote sensing data sources: optical high-resolution imagery and OpenStreetMap (OSM) data. Specifically, we propose to utilize the vision foundation model Segmentation Anything Model (SAM), for addressing our task. Leveraging SAM's exceptional zero-shot transfer capability, high-quality segmentation maps of optical images can be obtained. Thus, we can directly compare these two heterogeneous data forms in the so-called segmentation domain. We then introduce two strategies for guiding SAM's segmentation process: the 'no-prompt' and 'box/mask prompt' methods. The two strategies are designed to detect land-cover changes in general scenarios and to identify new land-cover objects within existing backgrounds, respectively. Experimental results on three datasets indicate that the proposed approach can achieve more competitive results compared to representative unsupervised multimodal change detection methods. ",
    "url": "https://arxiv.org/abs/2401.09019",
    "authors": [
      "Hongruixuan Chen",
      "Jian Song",
      "Naoto Yokoya"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2401.09108",
    "title": "Reproducibility via neural fields of visual illusions induced by  localized stimuli",
    "abstract": "This paper investigates the replication of experiments by Billock and Tsou [PNAS, 2007] using the controllability of neural fields of Amari-type modelling the cortical activity in the primary visual cortex (V1), focusing on a regular funnel pattern localised in the fovea or the peripheral visual field. The aim is to understand and model the visual phenomena observed in these experiments, emphasising their nonlinear nature. The study involves designing sensory inputs simulating the visual stimuli from Billock and Tsou's experiments. The after-images induced by these inputs are then theoretically and numerically studied to determine their capacity to replicate the experimentally observed visual effects. A key aspect of this research is investigating the effects induced by the nonlinear nature of neural responses. In particular, by highlighting the importance of both excitatory and inhibitory neurons in the emergence of certain visual phenomena, this study suggests that an interplay of both types of neuronal activities plays an essential role in visual processes, challenging the assumption that the latter is mainly driven by excitatory activities alone. ",
    "url": "https://arxiv.org/abs/2401.09108",
    "authors": [
      "Cyprien Tamekue",
      "Dario Prandi",
      "Yacine Chitour"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Analysis of PDEs (math.AP)",
      "Numerical Analysis (math.NA)",
      "Pattern Formation and Solitons (nlin.PS)"
    ]
  },
  {
    "id": "arXiv:2401.09336",
    "title": "To deform or not: treatment-aware longitudinal registration for breast  DCE-MRI during neoadjuvant chemotherapy via unsupervised keypoints detection",
    "abstract": "Clinicians compare breast DCE-MRI after neoadjuvant chemotherapy (NAC) with pre-treatment scans to evaluate the response to NAC. Clinical evidence supports that accurate longitudinal deformable registration without deforming treated tumor regions is key to quantifying tumor changes. We propose a conditional pyramid registration network based on unsupervised keypoint detection and selective volume-preserving to quantify changes over time. In this approach, we extract the structural and the abnormal keypoints from DCE-MRI, apply the structural keypoints for the registration algorithm to restrict large deformation, and employ volume-preserving loss based on abnormal keypoints to keep the volume of the tumor unchanged after registration. We use a clinical dataset with 1630 MRI scans from 314 patients treated with NAC. The results demonstrate that our method registers with better performance and better volume preservation of the tumors. Furthermore, a local-global-combining biomarker based on the proposed method achieves high accuracy in pathological complete response (pCR) prediction, indicating that predictive information exists outside tumor regions. The biomarkers could potentially be used to avoid unnecessary surgeries for certain patients. It may be valuable for clinicians and/or computer systems to conduct follow-up tumor segmentation and response prediction on images registered by our method. Our code is available on \\url{https://github.com/fiy2W/Treatment-aware-Longitudinal-Registration}. ",
    "url": "https://arxiv.org/abs/2401.09336",
    "authors": [
      "Luyi Han",
      "Tao Tan",
      "Tianyu Zhang",
      "Yuan Gao",
      "Xin Wang",
      "Valentina Longo",
      "Sofía Ventura-Díaz",
      "Anna D'Angelo",
      "Jonas Teuwen",
      "Ritse Mann"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.09368",
    "title": "Feature-aware ultra-low dimensional reduction of real networks",
    "abstract": "In existing models and embedding methods of networked systems, node features describing their qualities are usually overlooked in favor of focusing solely on node connectivity. This study introduces $FiD$-Mercator, a model-based ultra-low dimensional reduction technique that integrates node features with network structure to create $D$-dimensional maps of complex networks in a hyperbolic space. This embedding method efficiently uses features as an initial condition, guiding the search of nodes' coordinates towards an optimal solution. The research reveals that downstream task performance improves with the correlation between network connectivity and features, emphasizing the importance of such correlation for enhancing the description and predictability of real networks. Simultaneously, hyperbolic embedding's ability to reproduce local network properties remains unaffected by the inclusion of features. The findings highlight the necessity for developing novel network embedding techniques capable of exploiting such correlations to optimize both network structure and feature association jointly in the future. ",
    "url": "https://arxiv.org/abs/2401.09368",
    "authors": [
      "Robert Jankowski",
      "Pegah Hozhabrierdi",
      "Marián Boguñá",
      "M. Ángeles Serrano"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2206.01864",
    "title": "Model-Informed Generative Adversarial Network (MI-GAN) for Learning  Optimal Power Flow",
    "abstract": " Title: Model-Informed Generative Adversarial Network (MI-GAN) for Learning  Optimal Power Flow ",
    "url": "https://arxiv.org/abs/2206.01864",
    "authors": [
      "Yuxuan Li",
      "Chaoyue Zhao",
      "Chenang Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2206.05276",
    "title": "Game-Theoretic Neyman-Pearson Detection to Combat Strategic Evasion",
    "abstract": " Title: Game-Theoretic Neyman-Pearson Detection to Combat Strategic Evasion ",
    "url": "https://arxiv.org/abs/2206.05276",
    "authors": [
      "Yinan Hu",
      "Quanyan Zhu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Science and Game Theory (cs.GT)",
      "Information Theory (cs.IT)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.05764",
    "title": "The dynamics of belief: continuously monitoring and visualising complex  systems",
    "abstract": " Comments: Comments welcome ",
    "url": "https://arxiv.org/abs/2208.05764",
    "authors": [
      "Edwin J. Beggs",
      "John V. Tucker"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.10973",
    "title": "Robust and Large-Payload DNN Watermarking via Fixed,  Distribution-Optimized, Weights",
    "abstract": " Comments: 14 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2208.10973",
    "authors": [
      "Benedetta Tondi",
      "Andrea Costanzo",
      "Mauro Barni"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2210.02612",
    "title": "Lyapunov Function Consistent Adaptive Network Signal Control with Back  Pressure and Reinforcement Learning",
    "abstract": " Title: Lyapunov Function Consistent Adaptive Network Signal Control with Back  Pressure and Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2210.02612",
    "authors": [
      "Chaolun Ma",
      "Bruce Wang",
      "Zihao Li",
      "Ahmadreza Mahmoudzadeh",
      "Yunlong Zhang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2210.06758",
    "title": "Exploring Contextual Representation and Multi-Modality for End-to-End  Autonomous Driving",
    "abstract": " Title: Exploring Contextual Representation and Multi-Modality for End-to-End  Autonomous Driving ",
    "url": "https://arxiv.org/abs/2210.06758",
    "authors": [
      "Shoaib Azam",
      "Farzeen Munir",
      "Ville Kyrki",
      "Moongu Jeon",
      "Witold Pedrycz"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.07996",
    "title": "Degeneracy is OK: Logarithmic Regret for Network Revenue Management with  Indiscrete Distributions",
    "abstract": " Title: Degeneracy is OK: Logarithmic Regret for Network Revenue Management with  Indiscrete Distributions ",
    "url": "https://arxiv.org/abs/2210.07996",
    "authors": [
      "Jiashuo Jiang",
      "Will Ma",
      "Jiawei Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2211.13118",
    "title": "Decision Diagram-Based Branch-and-Bound with Caching for Dominance and  Suboptimality Detection",
    "abstract": " Comments: Submitted to INFORMS Journal on Computing ",
    "url": "https://arxiv.org/abs/2211.13118",
    "authors": [
      "Vianney Coppé",
      "Xavier Gillard",
      "Pierre Schaus"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Artificial Intelligence (cs.AI)",
      "Discrete Mathematics (cs.DM)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2211.13944",
    "title": "DMIS: Dynamic Mesh-based Importance Sampling for Training  Physics-Informed Neural Networks",
    "abstract": " Comments: Accepted to AAAl-23 ",
    "url": "https://arxiv.org/abs/2211.13944",
    "authors": [
      "Zijiang Yang",
      "Zhongwei Qiu",
      "Dongmei Fu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2212.04749",
    "title": "Validating quantum-supremacy experiments with exact and fast tensor  network contraction",
    "abstract": " Comments: 5 pages, 3 figures, comments are welcome! ",
    "url": "https://arxiv.org/abs/2212.04749",
    "authors": [
      "Yong Liu",
      "Yaojian Chen",
      "Chu Guo",
      "Jiawei Song",
      "Xinmin Shi",
      "Lin Gan",
      "Wenzhao Wu",
      "Wei Wu",
      "Haohuan Fu",
      "Xin Liu",
      "Dexun Chen",
      "Zhifeng Zhao",
      "Guangwen Yang",
      "Jiangang Gao"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2302.05109",
    "title": "Adjacent-Level Feature Cross-Fusion With 3-D CNN for Remote Sensing  Image Change Detection",
    "abstract": " Comments: 13 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2302.05109",
    "authors": [
      "Yuanxin Ye",
      "Mengmeng Wang",
      "Liang Zhou",
      "Guangyang Lei",
      "Jianwei Fan",
      "Yao Qin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.11563",
    "title": "Self-supervised network distillation: an effective approach to  exploration in sparse reward environments",
    "abstract": " Title: Self-supervised network distillation: an effective approach to  exploration in sparse reward environments ",
    "url": "https://arxiv.org/abs/2302.11563",
    "authors": [
      "Matej Pecháč",
      "Michal Chovanec",
      "Igor Farkaš"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.03678",
    "title": "A Comparative Study of Deep Learning and Iterative Algorithms for Joint  Channel Estimation and Signal Detection",
    "abstract": " Comments: Code is available at this https URL ",
    "url": "https://arxiv.org/abs/2303.03678",
    "authors": [
      "Haocheng Ju",
      "Haimiao Zhang",
      "Lin Li",
      "Xiao Li",
      "Bin Dong"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.06920",
    "title": "Pixel-wise Gradient Uncertainty for Convolutional Neural Networks  applied to Out-of-Distribution Segmentation",
    "abstract": " Title: Pixel-wise Gradient Uncertainty for Convolutional Neural Networks  applied to Out-of-Distribution Segmentation ",
    "url": "https://arxiv.org/abs/2303.06920",
    "authors": [
      "Kira Maag",
      "Tobias Riedlinger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.14751",
    "title": "Matrix-Scaled Consensus over Undirected Networks",
    "abstract": " Comments: 10 pages, 5 figures, preprint ",
    "url": "https://arxiv.org/abs/2303.14751",
    "authors": [
      "Minh Hoang Trinh",
      "Hoang Huy Vu",
      "Nhat-Minh Le-Phan",
      "Quyen Ngoc Nguyen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2303.17510",
    "title": "Hybrid Dealiasing of Complex Convolutions",
    "abstract": " Comments: 19 pages, 17 figures, to appear in the SIAM Journal on Scientific Computing. Code can be found at this https URL ",
    "url": "https://arxiv.org/abs/2303.17510",
    "authors": [
      "Noel Murasko",
      "John C. Bowman"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2304.00987",
    "title": "Equilibrium-Independent Passivity of Power Systems: A Link Between  Classical and Two-Axis Synchronous Generator Models",
    "abstract": " Title: Equilibrium-Independent Passivity of Power Systems: A Link Between  Classical and Two-Axis Synchronous Generator Models ",
    "url": "https://arxiv.org/abs/2304.00987",
    "authors": [
      "Takayuki Ishizaki",
      "Taku Nishino",
      "Aranya Chakrabortty"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.02811",
    "title": "HomPINNs: homotopy physics-informed neural networks for solving the  inverse problems of nonlinear differential equations with multiple solutions",
    "abstract": " Comments: 20 pages, 15 figures, 7 tables ",
    "url": "https://arxiv.org/abs/2304.02811",
    "authors": [
      "Haoyang Zheng",
      "Yao Huang",
      "Ziyang Huang",
      "Wenrui Hao",
      "Guang Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2304.10045",
    "title": "ID-MixGCL: Identity Mixup for Graph Contrastive Learning",
    "abstract": " Comments: 10 pages, 7 figures, accepted by IEEE BigData 2023 ",
    "url": "https://arxiv.org/abs/2304.10045",
    "authors": [
      "Gehang Zhang",
      "Bowen Yu",
      "Jiangxia Cao",
      "Xinghua Zhang",
      "Jiawei Sheng",
      "Chuan Zhou",
      "Tingwen Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.10829",
    "title": "Deep Attention Unet: A Network Model with Global Feature Perception  Ability",
    "abstract": " Comments: The experiment was inadequate and the experimental method needed major changes ",
    "url": "https://arxiv.org/abs/2304.10829",
    "authors": [
      "Jiacheng Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2304.14455",
    "title": "Bearing-Based Network Localization Under Randomized Gossip Protocol",
    "abstract": " Comments: preprint, 6 pages, 2 figures. Published in the Proceeding of the 12th International Conference on Control, Automation and Information Sciences (ICCAIS) ",
    "url": "https://arxiv.org/abs/2304.14455",
    "authors": [
      "Nhat-Minh Le-Phan",
      "Minh Hoang Trinh",
      "Phuoc Doan Nguyen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.12162",
    "title": "A Scalable Neural Network for DSIC Affine Maximizer Auction Design",
    "abstract": " Comments: NeurIPS 2023 (spotlight) ",
    "url": "https://arxiv.org/abs/2305.12162",
    "authors": [
      "Zhijian Duan",
      "Haoran Sun",
      "Yurong Chen",
      "Xiaotie Deng"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2305.16102",
    "title": "Demystifying Oversmoothing in Attention-Based Graph Neural Networks",
    "abstract": " Comments: NeurIPS 2023 spotlight. Camera-ready version. Fixed an error in the previous draft ",
    "url": "https://arxiv.org/abs/2305.16102",
    "authors": [
      "Xinyi Wu",
      "Amir Ajorlou",
      "Zihui Wu",
      "Ali Jadbabaie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.16494",
    "title": "Diffusion-Based Adversarial Sample Generation for Improved Stealthiness  and Controllability",
    "abstract": " Comments: Accepted as a conference paper in NeurIPS'2023. Code repo: this https URL ",
    "url": "https://arxiv.org/abs/2305.16494",
    "authors": [
      "Haotian Xue",
      "Alexandre Araujo",
      "Bin Hu",
      "Yongxin Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.17225",
    "title": "Causal Component Analysis",
    "abstract": " Comments: NeurIPS 2023 final camera-ready version ",
    "url": "https://arxiv.org/abs/2305.17225",
    "authors": [
      "Liang Wendong",
      "Armin Kekić",
      "Julius von Kügelgen",
      "Simon Buchholz",
      "Michel Besserve",
      "Luigi Gresele",
      "Bernhard Schölkopf"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.19858",
    "title": "Enhancing image quality prediction with self-supervised visual masking",
    "abstract": " Comments: 11 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2305.19858",
    "authors": [
      "Uğur Çoğalan",
      "Mojtaba Bemana",
      "Hans-Peter Seidel",
      "Karol Myszkowski"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2306.04998",
    "title": "Exploring Unsupervised Anomaly Detection with Quantum Boltzmann Machines  in Fraud Detection",
    "abstract": " Title: Exploring Unsupervised Anomaly Detection with Quantum Boltzmann Machines  in Fraud Detection ",
    "url": "https://arxiv.org/abs/2306.04998",
    "authors": [
      "Jonas Stein",
      "Daniëlle Schuman",
      "Magdalena Benkard",
      "Thomas Holger",
      "Wanja Sajko",
      "Michael Kölle",
      "Jonas Nüßlein",
      "Leo Sünkel",
      "Olivier Salomon",
      "Claudia Linnhoff-Popien"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2306.06155",
    "title": "Intensity Profile Projection: A Framework for Continuous-Time  Representation Learning for Dynamic Networks",
    "abstract": " Comments: 38 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2306.06155",
    "authors": [
      "Alexander Modell",
      "Ian Gallagher",
      "Emma Ceccherini",
      "Nick Whiteley",
      "Patrick Rubin-Delanchy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2306.06755",
    "title": "CoTran: An LLM-based Code Translator using Reinforcement Learning with  Feedback from Compiler and Symbolic Execution",
    "abstract": " Title: CoTran: An LLM-based Code Translator using Reinforcement Learning with  Feedback from Compiler and Symbolic Execution ",
    "url": "https://arxiv.org/abs/2306.06755",
    "authors": [
      "Prithwish Jana",
      "Piyush Jha",
      "Haoyang Ju",
      "Gautham Kishore",
      "Aryan Mahajan",
      "Vijay Ganesh"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Artificial Intelligence (cs.AI)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2307.08177",
    "title": "Using an LLM to Help With Code Understanding",
    "abstract": " Title: Using an LLM to Help With Code Understanding ",
    "url": "https://arxiv.org/abs/2307.08177",
    "authors": [
      "Daye Nam",
      "Andrew Macvean",
      "Vincent Hellendoorn",
      "Bogdan Vasilescu",
      "Brad Myers"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.04613",
    "title": "Shallow Encounters' Impact on Asteroid Deflection Prediction and  Implications on Trajectory Design",
    "abstract": " Comments: Accepted for publication in the AIAA's Journal of Guidance, Control, and Dynamics. DOI: soon ",
    "url": "https://arxiv.org/abs/2308.04613",
    "authors": [
      "Rodolfo Batista Negri",
      "Antônio Fernando Bertachini de Almeida Prado"
    ],
    "subjectives": [
      "Earth and Planetary Astrophysics (astro-ph.EP)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.09487",
    "title": "DFB: A Data-Free, Low-Budget, and High-Efficacy Clean-Label Backdoor  Attack",
    "abstract": " Title: DFB: A Data-Free, Low-Budget, and High-Efficacy Clean-Label Backdoor  Attack ",
    "url": "https://arxiv.org/abs/2308.09487",
    "authors": [
      "Binhao Ma",
      "Jiahui Wang",
      "Dejun Wang",
      "Bo Meng"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.12143",
    "title": "A Probabilistic Fluctuation based Membership Inference Attack for  Diffusion Models",
    "abstract": " Title: A Probabilistic Fluctuation based Membership Inference Attack for  Diffusion Models ",
    "url": "https://arxiv.org/abs/2308.12143",
    "authors": [
      "Wenjie Fu",
      "Huandong Wang",
      "Chen Gao",
      "Guanghua Liu",
      "Yong Li",
      "Tao Jiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.12252",
    "title": "How Safe Am I Given What I See? Calibrated Prediction of Safety Chances  for Image-Controlled Autonomy",
    "abstract": " Title: How Safe Am I Given What I See? Calibrated Prediction of Safety Chances  for Image-Controlled Autonomy ",
    "url": "https://arxiv.org/abs/2308.12252",
    "authors": [
      "Zhenjiang Mao",
      "Carson Sobolewski",
      "Ivan Ruchkin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.08748",
    "title": "Wasserstein Distributionally Robust Policy Evaluation and Learning for  Contextual Bandits",
    "abstract": " Title: Wasserstein Distributionally Robust Policy Evaluation and Learning for  Contextual Bandits ",
    "url": "https://arxiv.org/abs/2309.08748",
    "authors": [
      "Yi Shen",
      "Pan Xu",
      "Michael M. Zavlanos"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.08971",
    "title": "Regularized Contrastive Pre-training for Few-shot Bioacoustic Sound  Detection",
    "abstract": " Title: Regularized Contrastive Pre-training for Few-shot Bioacoustic Sound  Detection ",
    "url": "https://arxiv.org/abs/2309.08971",
    "authors": [
      "Ilyass Moummad",
      "Romain Serizel",
      "Nicolas Farrugia"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2309.12697",
    "title": "Semantic similarity prediction is better than other semantic similarity  measures",
    "abstract": " Comments: Accepted at TMLR: this https URL ",
    "url": "https://arxiv.org/abs/2309.12697",
    "authors": [
      "Steffen Herbold"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.16746",
    "title": "Implicit Gaussian process representation of vector fields over arbitrary  latent manifolds",
    "abstract": " Comments: ICLR 2024 conference paper. Associated code: this https URL ",
    "url": "https://arxiv.org/abs/2309.16746",
    "authors": [
      "Robert L. Peach",
      "Matteo Vinao-Carl",
      "Nir Grossman",
      "Michael David",
      "Emma Mallas",
      "David Sharp",
      "Paresh A. Malhotra",
      "Pierre Vandergheynst",
      "Adam Gosztolai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Mathematical Software (cs.MS)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.01113",
    "title": "HyperGraphDis: Leveraging Hypergraphs for Contextual and Social-Based  Disinformation Detection",
    "abstract": " Comments: We have extensively updated the experimental evaluation, discussion, and overall presentation of the results ",
    "url": "https://arxiv.org/abs/2310.01113",
    "authors": [
      "Nikos Salamanos",
      "Pantelitsa Leonidou",
      "Nikolaos Laoutaris",
      "Michael Sirivianos",
      "Maria Aspri",
      "Marius Paraschiv"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2310.03455",
    "title": "Performance and energy balance: a comprehensive study of  state-of-the-art sound event detection systems",
    "abstract": " Comments: Accepted to ICASSP 2024 ",
    "url": "https://arxiv.org/abs/2310.03455",
    "authors": [
      "Francesca Ronchini",
      "Romain Serizel"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2310.03838",
    "title": "Chameleon: Increasing Label-Only Membership Leakage with Adaptive  Poisoning",
    "abstract": " Comments: To appear at International Conference on Learning Representations (ICLR) 2024 ",
    "url": "https://arxiv.org/abs/2310.03838",
    "authors": [
      "Harsh Chaudhari",
      "Giorgio Severi",
      "Alina Oprea",
      "Jonathan Ullman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10224",
    "title": "Generalizing Medical Image Representations via Quaternion Wavelet  Networks",
    "abstract": " Comments: This paper is currently under review ",
    "url": "https://arxiv.org/abs/2310.10224",
    "authors": [
      "Luigi Sigillo",
      "Eleonora Grassucci",
      "Aurelio Uncini",
      "Danilo Comminiello"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.14076",
    "title": "On the Relationship Between Relevance and Conflict in Online Social Link  Recommendations",
    "abstract": " Comments: Accepted at NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2310.14076",
    "authors": [
      "Yanbang Wang",
      "Jon Kleinberg"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2311.01146",
    "title": "Building for Speech: Designing the Next Generation of Social Robots for  Audio Interaction",
    "abstract": " Comments: In WTF Workshop Proceedings (arXiv:2401.04108) held in conjunction with the ACM conference on Conversational User Interfaces (CUI), 19 - 21/07 2023, in Eindhoven, The Netherlands ",
    "url": "https://arxiv.org/abs/2311.01146",
    "authors": [
      "Angus Addlesee",
      "Ioannis Papaioannou",
      "Oliver Lemon"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2311.01475",
    "title": "Patch-Based Deep Unsupervised Image Segmentation using Graph Cuts",
    "abstract": " Title: Patch-Based Deep Unsupervised Image Segmentation using Graph Cuts ",
    "url": "https://arxiv.org/abs/2311.01475",
    "authors": [
      "Isaac Wasserman",
      "Jeova Farias Sales Rocha Neto"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2311.02992",
    "title": "NEURO HAND: A weakly supervised Hierarchical Attention Network for  interpretable neuroimaging abnormality Detection",
    "abstract": " Title: NEURO HAND: A weakly supervised Hierarchical Attention Network for  interpretable neuroimaging abnormality Detection ",
    "url": "https://arxiv.org/abs/2311.02992",
    "authors": [
      "David A. Wood"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.08747",
    "title": "Improved Dense Nested Attention Network Based on Transformer for  Infrared Small Target Detection",
    "abstract": " Title: Improved Dense Nested Attention Network Based on Transformer for  Infrared Small Target Detection ",
    "url": "https://arxiv.org/abs/2311.08747",
    "authors": [
      "Chun Bao",
      "Jie Cao",
      "Yaqian Ning",
      "Tianhua Zhao",
      "Zhijun Li",
      "Zechen Wang",
      "Li Zhang",
      "Qun Hao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.11500",
    "title": "Predictions of Transient Vector Solution Fields with Sequential Deep  Operator Network",
    "abstract": " Title: Predictions of Transient Vector Solution Fields with Sequential Deep  Operator Network ",
    "url": "https://arxiv.org/abs/2311.11500",
    "authors": [
      "Junyan He",
      "Shashank Kushwaha",
      "Jaewan Park",
      "Seid Koric",
      "Diab Abueidda",
      "Iwona Jasiuk"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2311.13708",
    "title": "Dynamic Fault Analysis in Substations Based on Knowledge Graphs",
    "abstract": " Title: Dynamic Fault Analysis in Substations Based on Knowledge Graphs ",
    "url": "https://arxiv.org/abs/2311.13708",
    "authors": [
      "Weiwei Li",
      "Xing Liu",
      "Wei Wang",
      "Lu Chen",
      "Sizhe Li",
      "Hui Fan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.18672",
    "title": "A Comparison Between Invariant and Equivariant Classical and Quantum  Graph Neural Networks",
    "abstract": " Comments: 14 pages, 7 figures, 3 appendices ",
    "url": "https://arxiv.org/abs/2311.18672",
    "authors": [
      "Roy T. Forestano",
      "Marçal Comajoan Cara",
      "Gopal Ramesh Dahale",
      "Zhongtian Dong",
      "Sergei Gleyzer",
      "Daniel Justice",
      "Kyoungchul Kong",
      "Tom Magorsch",
      "Konstantin T. Matchev",
      "Katia Matcheva",
      "Eyup B. Unlu"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2312.01689",
    "title": "Fast and accurate sparse-view CBCT reconstruction using meta-learned  neural attenuation field and hash-encoding regularization",
    "abstract": " Title: Fast and accurate sparse-view CBCT reconstruction using meta-learned  neural attenuation field and hash-encoding regularization ",
    "url": "https://arxiv.org/abs/2312.01689",
    "authors": [
      "Heejun Shin",
      "Taehee Kim",
      "Jongho Lee",
      "Se Young Chun",
      "Seungryung Cho",
      "Dongmyung Shin"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.03996",
    "title": "Stable Diffusion for Data Augmentation in COCO and Weed Datasets",
    "abstract": " Title: Stable Diffusion for Data Augmentation in COCO and Weed Datasets ",
    "url": "https://arxiv.org/abs/2312.03996",
    "authors": [
      "Boyang Deng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.04350",
    "title": "CLadder: Assessing Causal Reasoning in Language Models",
    "abstract": " Comments: NeurIPS 2023; updated with CLadder dataset v1.5 ",
    "url": "https://arxiv.org/abs/2312.04350",
    "authors": [
      "Zhijing Jin",
      "Yuen Chen",
      "Felix Leeb",
      "Luigi Gresele",
      "Ojasv Kamal",
      "Zhiheng Lyu",
      "Kevin Blin",
      "Fernando Gonzalez Adauto",
      "Max Kleiman-Weiner",
      "Mrinmaya Sachan",
      "Bernhard Schölkopf"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.04864",
    "title": "Critical Analysis of 5G Networks Traffic Intrusion using PCA, t-SNE and  UMAP Visualization and Classifying Attacks",
    "abstract": " Title: Critical Analysis of 5G Networks Traffic Intrusion using PCA, t-SNE and  UMAP Visualization and Classifying Attacks ",
    "url": "https://arxiv.org/abs/2312.04864",
    "authors": [
      "Humera Ghani",
      "Shahram Salekzamankhani",
      "Bal Virdee"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.04960",
    "title": "MIMIR: Masked Image Modeling for Mutual Information-based Adversarial  Robustness",
    "abstract": " Title: MIMIR: Masked Image Modeling for Mutual Information-based Adversarial  Robustness ",
    "url": "https://arxiv.org/abs/2312.04960",
    "authors": [
      "Xiaoyun Xu",
      "Shujian Yu",
      "Jingzheng Wu",
      "Stjepan Picek"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.10209",
    "title": "Beyond Empirical Windowing: An Attention-Based Approach for Trust  Prediction in Autonomous Vehicles",
    "abstract": " Title: Beyond Empirical Windowing: An Attention-Based Approach for Trust  Prediction in Autonomous Vehicles ",
    "url": "https://arxiv.org/abs/2312.10209",
    "authors": [
      "Minxue Niu",
      "Zhaobo Zheng",
      "Kumar Akash",
      "Teruhisa Misu"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.13066",
    "title": "PPEA-Depth: Progressive Parameter-Efficient Adaptation for  Self-Supervised Monocular Depth Estimation",
    "abstract": " Comments: Accepted by AAAI 2024 Project homepage: this https URL ",
    "url": "https://arxiv.org/abs/2312.13066",
    "authors": [
      "Yue-Jiang Dong",
      "Yuan-Chen Guo",
      "Ying-Tian Liu",
      "Fang-Lue Zhang",
      "Song-Hai Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.15824",
    "title": "Self-Supervised Learning for Few-Shot Bird Sound Classification",
    "abstract": " Title: Self-Supervised Learning for Few-Shot Bird Sound Classification ",
    "url": "https://arxiv.org/abs/2312.15824",
    "authors": [
      "Ilyass Moummad",
      "Romain Serizel",
      "Nicolas Farrugia"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2401.00828",
    "title": "Multi-Lattice Sampling of Quantum Field Theories via Neural  Operator-based Flows",
    "abstract": " Title: Multi-Lattice Sampling of Quantum Field Theories via Neural  Operator-based Flows ",
    "url": "https://arxiv.org/abs/2401.00828",
    "authors": [
      "Bálint Máté",
      "François Fleuret"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "High Energy Physics - Lattice (hep-lat)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.01783",
    "title": "Approximating Numerical Fluxes Using Fourier Neural Operators for  Hyperbolic Conservation Laws",
    "abstract": " Comments: 26 pages, 28 figures ",
    "url": "https://arxiv.org/abs/2401.01783",
    "authors": [
      "Taeyoung Kim",
      "Myungjoo Kang"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.03145",
    "title": "Self-supervised Feature Adaptation for 3D Industrial Anomaly Detection",
    "abstract": " Title: Self-supervised Feature Adaptation for 3D Industrial Anomaly Detection ",
    "url": "https://arxiv.org/abs/2401.03145",
    "authors": [
      "Yuanpeng Tu",
      "Boshen Zhang",
      "Liang Liu",
      "Yuxi Li",
      "Xuhai Chen",
      "Jiangning Zhang",
      "Yabiao Wang",
      "Chengjie Wang",
      "Cai Rong Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.05686",
    "title": "Self Expanding Convolutional Neural Networks",
    "abstract": " Title: Self Expanding Convolutional Neural Networks ",
    "url": "https://arxiv.org/abs/2401.05686",
    "authors": [
      "Blaise Appolinary",
      "Alex Deaconu",
      "Sophia Yang",
      "Qingze"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.06506",
    "title": "Frequency Masking for Universal Deepfake Detection",
    "abstract": " Comments: Accepted to IEEE ICASSP-2024 ",
    "url": "https://arxiv.org/abs/2401.06506",
    "authors": [
      "Chandler Timm Doloriel",
      "Ngai-Man Cheung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.06637",
    "title": "Adversarial Examples are Misaligned in Diffusion Model Manifolds",
    "abstract": " Comments: under review ",
    "url": "https://arxiv.org/abs/2401.06637",
    "authors": [
      "Peter Lorenz",
      "Ricard Durall",
      "Janis Keuper"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.06855",
    "title": "Fine-grained Hallucination Detection and Editing for Language Models",
    "abstract": " Title: Fine-grained Hallucination Detection and Editing for Language Models ",
    "url": "https://arxiv.org/abs/2401.06855",
    "authors": [
      "Abhika Mishra",
      "Akari Asai",
      "Vidhisha Balachandran",
      "Yizhong Wang",
      "Graham Neubig",
      "Yulia Tsvetkov",
      "Hannaneh Hajishirzi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.06874",
    "title": "A Joint Code and Belief Propagation Decoder Design for Quantum LDPC  Codes",
    "abstract": " Comments: submitted to IEEE ",
    "url": "https://arxiv.org/abs/2401.06874",
    "authors": [
      "Sisi Miao",
      "Jonathan Mandelbaum",
      "Holger Jäkel",
      "Laurent Schmalen"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2401.07231",
    "title": "Use of Prior Knowledge to Discover Causal Additive Models with  Unobserved Variables and its Application to Time Series Data",
    "abstract": " Title: Use of Prior Knowledge to Discover Causal Additive Models with  Unobserved Variables and its Application to Time Series Data ",
    "url": "https://arxiv.org/abs/2401.07231",
    "authors": [
      "Takashi Nicholas Maeda",
      "Shohei Shohei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.07343",
    "title": "Privacy-Preserving Intrusion Detection in Software-defined VANET using  Federated Learning with BERT",
    "abstract": " Title: Privacy-Preserving Intrusion Detection in Software-defined VANET using  Federated Learning with BERT ",
    "url": "https://arxiv.org/abs/2401.07343",
    "authors": [
      "Shakil Ibne Ahsan",
      "Phil Legg",
      "S M Iftekharul Alam"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.07769",
    "title": "Deep Evolutional Instant Interest Network for CTR Prediction in  Trigger-Induced Recommendation",
    "abstract": " Comments: 7 pages, 3 figures, accepted by the 17th ACM International Conference on Web Search and Data Mining(WSDM'2024) ",
    "url": "https://arxiv.org/abs/2401.07769",
    "authors": [
      "Zhibo Xiao",
      "Luwei Yang",
      "Tao Zhang",
      "Wen Jiang",
      "Wei Ning",
      "Yujiu Yang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08332",
    "title": "Generative Denoise Distillation: Simple Stochastic Noises Induce  Efficient Knowledge Transfer for Dense Prediction",
    "abstract": " Title: Generative Denoise Distillation: Simple Stochastic Noises Induce  Efficient Knowledge Transfer for Dense Prediction ",
    "url": "https://arxiv.org/abs/2401.08332",
    "authors": [
      "Zhaoge Liu",
      "Xiaohao Xu",
      "Yunkang Cao",
      "Weiming Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]