[
  {
    "id": "arXiv:2201.07798",
    "title": "Cognitive Explainers of Graph Neural Networks Based on Medical Concepts",
    "abstract": "Although deep neural networks (DNN) have achieved state-of-the-art performance in various fields, some unexpected errors are often found in the neural network, which is very dangerous for some tasks requiring high reliability and high security.The non-transparency and unexplainably of CNN still limit its application in many fields, such as medical care and finance. Despite current studies that have been committed to visualizing the decision process of DNN, most of these methods focus on the low level and do not take into account the prior knowledge of medicine.In this work, we propose an interpretable framework based on key medical concepts, enabling CNN to explain from the perspective of doctors' cognition.We propose an interpretable automatic recognition framework for the ultrasonic standard plane, which uses a concept-based graph convolutional neural network to construct the relationships between key medical concepts, to obtain an interpretation consistent with a doctor's cognition. ",
    "url": "https://arxiv.org/abs/2201.07798",
    "authors": [
      "Yingni Wang",
      "Kehong Yuan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.07835",
    "title": "Correlated-informed neural networks: a new machine learning framework to  predict pressure drop in micro-channels",
    "abstract": "Accurate pressure drop estimation in forced boiling phenomena is important during the thermal analysis and the geometric design of cryogenic heat exchangers. However, current methods to predict the pressure drop have one of two problems: lack of accuracy or generalization to different situations. In this work, we present the correlated-informed neural networks (CoINN), a new paradigm in applying the artificial neural network (ANN) technique combined with a successful pressure drop correlation as a mapping tool to predict the pressure drop of zeotropic mixtures in micro-channels. The proposed approach is inspired by Transfer Learning, highly used in deep learning problems with reduced datasets. Our method improves the ANN performance by transferring the knowledge of the Sun & Mishima correlation for the pressure drop to the ANN. The correlation having physical and phenomenological implications for the pressure drop in micro-channels considerably improves the performance and generalization capabilities of the ANN. The final architecture consists of three inputs: the mixture vapor quality, the micro-channel inner diameter, and the available pressure drop correlation. The results show the benefits gained using the correlated-informed approach predicting experimental data used for training and a posterior test with a mean relative error (mre) of 6%, lower than the Sun & Mishima correlation of 13%. Additionally, this approach can be extended to other mixtures and experimental settings, a missing feature in other approaches for mapping correlations using ANNs for heat transfer applications. ",
    "url": "https://arxiv.org/abs/2201.07835",
    "authors": [
      "J.A. Montanez-Barrera",
      "J.M. Barroso-Maldonado",
      "A.F. Bedoya-Santacruz",
      "Adrian Mota-Babiloni"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2201.07839",
    "title": "Critic Algorithms using Cooperative Networks",
    "abstract": "An algorithm is proposed for policy evaluation in Markov Decision Processes which gives good empirical results with respect to convergence rates. The algorithm tracks the Projected Bellman Error and is implemented as a true gradient based algorithm. In this respect this algorithm differs from TD($\\lambda$) class of algorithms. This algorithm tracks the Projected Bellman Algorithm and is therefore different from the class of residual algorithms. Further the convergence of this algorithm is empirically much faster than GTD2 class of algorithms which aim at tracking the Projected Bellman Error. We implemented proposed algorithm in DQN and DDPG framework and found that our algorithm achieves comparable results in both of these experiments ",
    "url": "https://arxiv.org/abs/2201.07839",
    "authors": [
      "Debangshu Banerjee",
      "Kavita Wagh"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.07843",
    "title": "CRC-Aided List Decoding of Convolutional and Polar Codes for Short  Messages in 5G",
    "abstract": "This paper explores list decoding of convolutional and polar codes for short messages such as those found in the 5G physical broadcast channel. A cyclic redundancy check (CRC) is used to select a codeword from a list of likely codewords. One example in the 5G standard encodes a 32-bit message with a 24-bit CRC and a 512-bit polar code with additional bits added by repetition to achieve a very low rate of 32/864. This paper shows that optimizing the CRC length improves the $E_b/N_0$ performance of this polar code, where $E_b/N_0$ is the ratio of the energy per data bit to the noise power spectral density. Furthermore, even better $E_b/N_0$ performance is achieved by replacing the polar code with a tail-biting convolutional code (TBCC) with a distance-spectrum-optimal (DSO) CRC. This paper identifies the optimal CRC length to minimize the frame error rate (FER) of a rate-1/5 TBCC at a specific value of $E_b/N_0$. We also show that this optimized TBCC/CRC can attain the same excellent $E_b/N_0$ performance with the very low rate of 32/864 of the 5G polar code, where the low rate is achieved through repetition. We show that the proposed TBCC/CRC concatenated code outperforms the PBCH polar code described in the 5G standard both in terms of FER and decoding run time. We also explore the tradeoff between undetected error rate and erasure rate as the CRC size varies. ",
    "url": "https://arxiv.org/abs/2201.07843",
    "authors": [
      "Jacob King",
      "Alexandra Kwon",
      "Hengjie Yang",
      "William Ryan",
      "Richard D. Wesel"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2201.07858",
    "title": "Decoupling the Depth and Scope of Graph Neural Networks",
    "abstract": "State-of-the-art Graph Neural Networks (GNNs) have limited scalability with respect to the graph and model sizes. On large graphs, increasing the model depth often means exponential expansion of the scope (i.e., receptive field). Beyond just a few layers, two fundamental challenges emerge: 1. degraded expressivity due to oversmoothing, and 2. expensive computation due to neighborhood explosion. We propose a design principle to decouple the depth and scope of GNNs -- to generate representation of a target entity (i.e., a node or an edge), we first extract a localized subgraph as the bounded-size scope, and then apply a GNN of arbitrary depth on top of the subgraph. A properly extracted subgraph consists of a small number of critical neighbors, while excluding irrelevant ones. The GNN, no matter how deep it is, smooths the local neighborhood into informative representation rather than oversmoothing the global graph into \"white noise\". Theoretically, decoupling improves the GNN expressive power from the perspectives of graph signal processing (GCN), function approximation (GraphSAGE) and topological learning (GIN). Empirically, on seven graphs (with up to 110M nodes) and six backbone GNN architectures, our design achieves significant accuracy improvement with orders of magnitude reduction in computation and hardware cost. ",
    "url": "https://arxiv.org/abs/2201.07858",
    "authors": [
      "Hanqing Zeng",
      "Muhan Zhang",
      "Yinglong Xia",
      "Ajitesh Srivastava",
      "Andrey Malevich",
      "Rajgopal Kannan",
      "Viktor Prasanna",
      "Long Jin",
      "Ren Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.07894",
    "title": "Enhanced Performance of Pre-Trained Networks by Matched Augmentation  Distributions",
    "abstract": "There exists a distribution discrepancy between training and testing, in the way images are fed to modern CNNs. Recent work tried to bridge this gap either by fine-tuning or re-training the network at different resolutions. However re-training a network is rarely cheap and not always viable. To this end, we propose a simple solution to address the train-test distributional shift and enhance the performance of pre-trained models -- which commonly ship as a package with deep learning platforms \\eg, PyTorch. Specifically, we demonstrate that running inference on the center crop of an image is not always the best as important discriminatory information may be cropped-off. Instead we propose to combine results for multiple random crops for a test image. This not only matches the train time augmentation but also provides the full coverage of the input image. We explore combining representation of random crops through averaging at different levels \\ie, deep feature level, logit level, and softmax level. We demonstrate that, for various families of modern deep networks, such averaging results in better validation accuracy compared to using a single central crop per image. The softmax averaging results in the best performance for various pre-trained networks without requiring any re-training or fine-tuning whatsoever. On modern GPUs with batch processing, the paper's approach to inference of pre-trained networks, is essentially free as all images in a batch can all be processed at once. ",
    "url": "https://arxiv.org/abs/2201.07894",
    "authors": [
      "Touqeer Ahmad",
      "Mohsen Jafarzadeh",
      "Akshay Raj Dhamija",
      "Ryan Rabinowitz",
      "Steve Cruz",
      "Chunchun Li",
      "Terrance E. Boult"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.07915",
    "title": "Sensing Method for Two-Target Detection in Time-Constrained Vector  Poisson Channel",
    "abstract": "It is an experimental design problem in which there are two Poisson sources with two possible and known rates, and one counter. Through a switch, the counter can observe the sources individually or the counts can be combined so that the counter observes the sum of the two. The sensor scheduling problem is to determine an optimal proportion of the available time to be allocated toward individual and joint sensing, under a total time constraint. Two different metrics are used for optimization: mutual information between the sources and the observed counts, and probability of detection for the associated source detection problem. Our results, which are primarily computational, indicate similar but not identical results under the two cost functions. ",
    "url": "https://arxiv.org/abs/2201.07915",
    "authors": [
      "Muhammad Fahad",
      "Daniel R. Fuhrmann"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:2201.07917",
    "title": "Similarity search on neighbor's graphs with automatic Pareto optimal  performance and minimum expected quality setups based on hyperparameter  optimization",
    "abstract": "This manuscript introduces an autotuned algorithm for searching nearest neighbors based on neighbor graphs and optimization metaheuristics to produce Pareto-optimal searches for quality and search speed automatically; the same strategy is also used to produce indexes that achieve a minimum quality. Our approach is described and benchmarked with other state-of-the-art similarity search methods, showing convenience and competitiveness. ",
    "url": "https://arxiv.org/abs/2201.07917",
    "authors": [
      "Eric S. Tellez",
      "Guillermo Ruiz"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.07925",
    "title": "Derivative-informed projected neural network for large-scale Bayesian  optimal experimental design",
    "abstract": "We address the solution of large-scale Bayesian optimal experimental design (OED) problems governed by partial differential equations (PDEs) with infinite-dimensional parameter fields. The OED problem seeks to find sensor locations that maximize the expected information gain (EIG) in the solution of the underlying Bayesian inverse problem. Computation of the EIG is usually prohibitive for PDE-based OED problems. To make the evaluation of the EIG tractable, we approximate the (PDE-based) parameter-to-observable map with a derivative-informed projected neural network (DIPNet) surrogate, which exploits the geometry, smoothness, and intrinsic low-dimensionality of the map using a small and dimension-independent number of PDE solves. The surrogate is then deployed within a greedy algorithm-based solution of the OED problem such that no further PDE solves are required. We analyze the EIG approximation error in terms of the generalization error of the DIPNet, and demonstrate the efficiency and accuracy of the method via numerical experiments involving inverse scattering and inverse reactive transport. ",
    "url": "https://arxiv.org/abs/2201.07925",
    "authors": [
      "Keyi Wu",
      "Thomas O'Leary-Roseberry",
      "Peng Chen",
      "Omar Ghattas"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2201.07928",
    "title": "Complex In-Hand Manipulation via Compliance-Enabled Finger Gaiting and  Multi-Modal Planning",
    "abstract": "Constraining contacts to remain fixed on an object during manipulation limits the potential workspace size, as motion is subject to the hand's kinematic topology. Finger gaiting is one way to alleviate such restraints. It allows contacts to be freely broken and remade so as to operate on different manipulation manifolds. This capability, however, has traditionally been difficult or impossible to practically realize. A finger gaiting system must simultaneously plan for and control forces on the object while maintaining stability during contact switching. This work alleviates the traditional requirement by taking advantage of system compliance, allowing the hand to more easily switch contacts while maintaining a stable grasp. Our method achieves complete SO(3) finger gaiting control of grasped objects against gravity by developing a manipulation planner that operates via orthogonal safe modes of a compliant, underactuated hand absent of tactile sensors or joint encoders. During manipulation, a low-latency 6D pose object tracker provides feedback via vision, allowing the planner to update its plan online so as to adaptively recover from trajectory deviations. The efficacy of this method is showcased by manipulating both convex and non-convex objects on a real robot. Its robustness is evaluated via perturbation rejection and long trajectory goals. To the best of the authors' knowledge, this is the first work that has autonomously achieved full SO(3) control of objects within-hand via finger gaiting and without a support surface, elucidating a valuable step towards realizing true robot in-hand manipulation capabilities. ",
    "url": "https://arxiv.org/abs/2201.07928",
    "authors": [
      "Andrew S. Morgan",
      "Kaiyu Hang",
      "Bowen Wen",
      "Kostas Bekris",
      "Aaron M. Dollar"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2201.07934",
    "title": "Complexity from Adaptive-Symmetries Breaking: Global Minima in the  Statistical Mechanics of Deep Neural Networks",
    "abstract": "An antithetical concept, adaptive symmetry, to conservative symmetry in physics is proposed to understand the deep neural networks (DNNs). It characterizes the invariance of variance, where a biotic system explores different pathways of evolution with equal probability in absence of feedback signals, and complex functional structure emerges from quantitative accumulation of adaptive-symmetries breaking in response to feedback signals. Theoretically and experimentally, we characterize the optimization process of a DNN system as an extended adaptive-symmetry-breaking process. One particular finding is that a hierarchically large DNN would have a large reservoir of adaptive symmetries, and when the information capacity of the reservoir exceeds the complexity of the dataset, the system could absorb all perturbations of the examples and self-organize into a functional structure of zero training errors measured by a certain surrogate risk. More specifically, this process is characterized by a statistical-mechanical model that could be appreciated as a generalization of statistics physics to the DNN organized complex system, and characterizes regularities in higher dimensionality. The model consists of three constitutes that could be appreciated as the counterparts of Boltzmann distribution, Ising model, and conservative symmetry, respectively: (1) a stochastic definition/interpretation of DNNs that is a multilayer probabilistic graphical model, (2) a formalism of circuits that perform biological computation, (3) a circuit symmetry from which self-similarity between the microscopic and the macroscopic adaptability manifests. The model is analyzed with a method referred as the statistical assembly method that analyzes the coarse-grained behaviors (over a symmetry group) of the heterogeneous hierarchical many-body interaction in DNNs. ",
    "url": "https://arxiv.org/abs/2201.07934",
    "authors": [
      "Shawn W. M. Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Biological Physics (physics.bio-ph)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2201.07936",
    "title": "How Do Socio-Demographic Patterns Define Digital Privacy Divide?",
    "abstract": "Digital privacy has become an essential component of information and communications technology (ICT) systems. There are many existing methods for digital privacy protection, including network security, cryptography, and access control. However, there is still a gap in the digital privacy protection levels available for users. This paper studies the digital privacy divide (DPD) problem in ICT systems. First, we introduce an online DPD study for understanding the DPD problem by collecting responses from 776 ICT users using crowdsourcing task assignments. Second, we propose a factor analysis-based statistical method for generating the DPD index from a set of observable DPD question variables. In particular, the DPD index provides one scaled measure for the DPD gap by exploring the dimensionality of the eight questions in the DPD survey. Third, we introduce a DPD proportional odds model for analyzing the relationship between the DPD status and the socio-demographic patterns of the users. Our results show that the DPD survey meets the internal consistency reliability with rigorous statistical measures, e.g., Cronbach's $\\alpha=0.92$. Furthermore, the DPD index is shown to capture the underlying communality of all DPD variables. Finally, the DPD proportional odds model indicates a strong statistical correlation between the DPD status and the age groups of the ICT users. For example, we find that young users (15-32 years) are generally more concerned about their digital privacy than senior ones (33 years and over). ",
    "url": "https://arxiv.org/abs/2201.07936",
    "authors": [
      "Hamoud Alhazmi",
      "Ahmed Imran",
      "Mohammad Abu Alsheikh"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2201.07937",
    "title": "GASCN: Graph Attention Shape Completion Network",
    "abstract": "Shape completion, the problem of inferring the complete geometry of an object given a partial point cloud, is an important problem in robotics and computer vision. This paper proposes the Graph Attention Shape Completion Network (GASCN), a novel neural network model that solves this problem. This model combines a graph-based model for encoding local point cloud information with an MLP-based architecture for encoding global information. For each completed point, our model infers the normal and extent of the local surface patch which is used to produce dense yet precise shape completions. We report experiments that demonstrate that GASCN outperforms standard shape completion methods on a standard benchmark drawn from the Shapenet dataset. ",
    "url": "https://arxiv.org/abs/2201.07937",
    "authors": [
      "Haojie Huang",
      "Ziyi Yang",
      "Robert Platt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.07944",
    "title": "Cost-Effective Algorithms for Average-Case Interactive Graph Search",
    "abstract": "Interactive graph search (IGS) uses human intelligence to locate the target node in hierarchy, which can be applied for image classification, product categorization and searching a database. Specifically, IGS aims to categorize an object from a given category hierarchy via several rounds of interactive queries. In each round of query, the search algorithm picks a category and receives a boolean answer on whether the object is under the chosen category. The main efficiency goal asks for the minimum number of queries to identify the correct hierarchical category for the object. In this paper, we study the average-case interactive graph search (AIGS) problem that aims to minimize the expected number of queries when the objects follow a probability distribution. We propose a greedy search policy that splits the candidate categories as evenly as possible with respect to the probability weights, which offers an approximation guarantee of $O(\\log n)$ for AIGS given the category hierarchy is a directed acyclic graph (DAG), where $n$ is the total number of categories. Meanwhile, if the input hierarchy is a tree, we show that a constant approximation factor of $(1+\\sqrt{5})/2$ can be achieved. Furthermore, we present efficient implementations of the greedy policy, namely GreedyTree and GreedyDAG, that can quickly categorize the object in practice. Extensive experiments in real-world scenarios are carried out to demonstrate the superiority of our proposed methods. ",
    "url": "https://arxiv.org/abs/2201.07944",
    "authors": [
      "Qianhao Cong",
      "Jing Tang",
      "Yuming Huang",
      "Lei Chen",
      "Yeow Meng Chee"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2201.07946",
    "title": "Babylon: Reusing Bitcoin Mining to Enhance Proof-of-Stake Security",
    "abstract": "Bitcoin is the most secure blockchain in the world, supported by the immense hash power of its Proof-of-Work miners, but consumes huge amount of energy. Proof-of-Stake chains are energy-efficient, have fast finality and accountability, but face several fundamental security issues: susceptibility to non-slashable long-range safety attacks, non-slashable transaction censorship and stalling attacks and difficulty to bootstrap new PoS chains from low token valuation. We propose Babylon, a blockchain platform which combines the best of both worlds by reusing the immense Bitcoin hash power to enhance the security of PoS chains. Babylon provides a data-available timestamping service, securing PoS chains by allowing them to timestamp data-available block checkpoints, fraud proofs and censored transactions on Babylon. Babylon miners merge mine with Bitcoin and thus the platform has zero additional energy cost. The security of a Babylon-enhanced PoS protocol is formalized by a cryptoeconomic security theorem which shows slashable safety and liveness guarantees. ",
    "url": "https://arxiv.org/abs/2201.07946",
    "authors": [
      "Ertem Nusret Tas",
      "David Tse",
      "Fisher Yu",
      "Sreeram Kannan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2201.07949",
    "title": "Distributed Stochastic Model Predictive Control for an Urban Traffic  Network",
    "abstract": "In this paper, we design a stochastic Model Predictive Control (MPC) traffic signal control method for an urban traffic network when the uncertainties in the estimation of the exogenous (in/out)-flows and the turning ratios of downstream traffic flows are taken into account. Assuming that the traffic model parameters are random variables with known expectations and variance, the traffic signal control and coordination problem is formulated as a quadratic program with linear and second-order cone constraints. In order to reduce computational complexity, we suggest a way to decompose the optimization problem corresponding to the whole traffic network into multiple subproblems. By applying Alternating Direction Method of Multipliers (ADMM), the optimal stochastic traffic signal splits are found in distributed manner. The effectiveness of the designed control method is validated via some simulations using VISSIM and MATLAB. ",
    "url": "https://arxiv.org/abs/2201.07949",
    "authors": [
      "Viet Hoang Pham",
      "Hyo-Sung Ahn"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2201.07951",
    "title": "Informative Pseudo-Labeling for Graph Neural Networks with Few Labels",
    "abstract": "Graph Neural Networks (GNNs) have achieved state-of-the-art results for semi-supervised node classification on graphs. Nevertheless, the challenge of how to effectively learn GNNs with very few labels is still under-explored. As one of the prevalent semi-supervised methods, pseudo-labeling has been proposed to explicitly address the label scarcity problem. It aims to augment the training set with pseudo-labeled unlabeled nodes with high confidence so as to re-train a supervised model in a self-training cycle. However, the existing pseudo-labeling approaches often suffer from two major drawbacks. First, they tend to conservatively expand the label set by selecting only high-confidence unlabeled nodes without assessing their informativeness. Unfortunately, those high-confidence nodes often convey overlapping information with given labels, leading to minor improvements for model re-training. Second, these methods incorporate pseudo-labels to the same loss function with genuine labels, ignoring their distinct contributions to the classification task. In this paper, we propose a novel informative pseudo-labeling framework, called InfoGNN, to facilitate learning of GNNs with extremely few labels. Our key idea is to pseudo label the most informative nodes that can maximally represent the local neighborhoods via mutual information maximization. To mitigate the potential label noise and class-imbalance problem arising from pseudo labeling, we also carefully devise a generalized cross entropy loss with a class-balanced regularization to incorporate generated pseudo labels into model re-training. Extensive experiments on six real-world graph datasets demonstrate that our proposed approach significantly outperforms state-of-the-art baselines and strong self-supervised methods on graphs. ",
    "url": "https://arxiv.org/abs/2201.07951",
    "authors": [
      "Yayong Li",
      "Jie Yin",
      "Ling Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.07954",
    "title": "Effective Anomaly Detection in Smart Home by Integrating Event Time  Intervals",
    "abstract": "Smart home IoT systems and devices are susceptible to attacks and malfunctions. As a result, users' concerns about their security and safety issues arise along with the prevalence of smart home deployments. In a smart home, various anomalies (such as fire or flooding) could happen, due to cyber attacks, device malfunctions, or human mistakes. These concerns motivate researchers to propose various anomaly detection approaches. Existing works on smart home anomaly detection focus on checking the sequence of IoT devices' events but leave out the temporal information of events. This limitation prevents them to detect anomalies that cause delay rather than missing/injecting events. To fill this gap, in this paper, we propose a novel anomaly detection method that takes the inter-event intervals into consideration. We propose an innovative metric to quantify the temporal similarity between two event sequences. We design a mechanism to learn the temporal patterns of event sequences of common daily activities. Delay-caused anomalies are detected by comparing the sequence with the learned patterns. We collect device events from a real-world testbed for training and testing. The experiment results show that our proposed method achieves accuracies of 93%, 88%, 89% for three daily activities. ",
    "url": "https://arxiv.org/abs/2201.07954",
    "authors": [
      "Chenxu Jiang",
      "Chenglong Fu",
      "Zhenyu Zhao",
      "Xiaojiang Du",
      "Yuede Ji"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.07955",
    "title": "Numerical simulation of singularity propagation modeled by linear  convection equations with spatially heterogeneous nonlocal interactions",
    "abstract": "We study the propagation of singularities in solutions of linear convection equations with spatially heterogeneous nonlocal interactions. A spatially varying nonlocal horizon parameter is adopted in the model, which measures the range of nonlocal interactions. Via heterogeneous localization, this can lead to the seamless coupling of the local and nonlocal models. We are interested in understanding the impact on singularity propagation due to the heterogeneities of nonlocal horizon and the local and nonlocal transition. We first analytically derive equations to characterize the propagation of different types of singularities for various forms of nonlocal horizon parameters in the nonlocal regime. We then use asymptotically compatible schemes to discretize the equations and carry out numerical simulations to illustrate the propagation patterns in different scenarios. ",
    "url": "https://arxiv.org/abs/2201.07955",
    "authors": [
      "Xiaoxuan Yu",
      "Yan Xu",
      "Qiang Du"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2201.07978",
    "title": "Network-based link prediction of scientific concepts -- a Science4Cast  competition entry",
    "abstract": "We report on a model built to predict links in a complex network of scientific concepts, in the context of the Science4Cast 2021 competition. We show that the network heavily favours linking nodes of high degree, indicating that new scientific connections are primarily made between popular concepts, which constitutes the main feature of our model. Besides this notion of popularity, we use a measure of similarity between nodes quantified by a normalized count of their common neighbours to improve the model. Finally, we show that the model can be further improved by considering a time-weighted adjacency matrix with both older and newer links having higher impact in the predictions, representing rooted concepts and state of the art research, respectively. ",
    "url": "https://arxiv.org/abs/2201.07978",
    "authors": [
      "Joao P. Moutinho",
      "Bruno Coutinho",
      "Lorenzo Buffoni"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2201.07980",
    "title": "Caring Without Sharing: A Federated Learning Crowdsensing Framework for  Diversifying Representation of Cities",
    "abstract": "Mobile Crowdsensing has become main stream paradigm for researchers to collect behavioral data from citizens in large scales. This valuable data can be leveraged to create centralized repositories that can be used to train advanced Artificial Intelligent (AI) models for various services that benefit society in all aspects. Although decades of research has explored the viability of Mobile Crowdsensing in terms of incentives and many attempts have been made to reduce the participation barriers, the overshadowing privacy concerns regarding sharing personal data still remain. Recently a new pathway has emerged to enable to shift MCS paradigm towards a more privacy-preserving collaborative learning, namely Federated Learning. In this paper, we posit a first of its kind framework for this emerging paradigm. We demonstrate the functionalities of our framework through a case study of diversifying two vision algorithms through to learn the representation of ordinary sidewalk obstacles as part of enhancing visually impaired navigation. ",
    "url": "https://arxiv.org/abs/2201.07980",
    "authors": [
      "Michael Cho",
      "Afra Mashhadi"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.07984",
    "title": "AstBERT: Enabling Language Model for Code Understanding with Abstract  Syntax Tree",
    "abstract": "Using a pre-trained language model (i.e. BERT) to apprehend source codes has attracted increasing attention in the natural language processing community. However, there are several challenges when it comes to applying these language models to solve programming language (PL) related problems directly, the significant one of which is the lack of domain knowledge issue that substantially deteriorates the model's performance. To this end, we propose the AstBERT model, a pre-trained language model aiming to better understand the PL using the abstract syntax tree (AST). Specifically, we collect a colossal amount of source codes (both java and python) from GitHub and incorporate the contextual code knowledge into our model through the help of code parsers, in which AST information of the source codes can be interpreted and integrated. We verify the performance of the proposed model on code information extraction and code search tasks, respectively. Experiment results show that our AstBERT model achieves state-of-the-art performance on both downstream tasks (with 96.4% for code information extraction task, and 57.12% for code search task). ",
    "url": "https://arxiv.org/abs/2201.07984",
    "authors": [
      "Rong Liang",
      "Yujie Lu",
      "Zhen Huang",
      "Tiehua Zhang",
      "Yuze Liu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.07986",
    "title": "Unsupervised Graph Poisoning Attack via Contrastive Loss  Back-propagation",
    "abstract": "Graph contrastive learning is the state-of-the-art unsupervised graph representation learning framework and has shown comparable performance with supervised approaches. However, evaluating whether the graph contrastive learning is robust to adversarial attacks is still an open problem because most existing graph adversarial attacks are supervised models, which means they heavily rely on labels and can only be used to evaluate the graph contrastive learning in a specific scenario. For unsupervised graph representation methods such as graph contrastive learning, it is difficult to acquire labels in real-world scenarios, making traditional supervised graph attack methods difficult to be applied to test their robustness. In this paper, we propose a novel unsupervised gradient-based adversarial attack that does not rely on labels for graph contrastive learning. We compute the gradients of the adjacency matrices of the two views and flip the edges with gradient ascent to maximize the contrastive loss. In this way, we can fully use multiple views generated by the graph contrastive learning models and pick the most informative edges without knowing their labels, and therefore can promisingly support our model adapted to more kinds of downstream tasks. Extensive experiments show that our attack outperforms unsupervised baseline attacks and has comparable performance with supervised attacks in multiple downstream tasks including node classification and link prediction. We further show that our attack can be transferred to other graph representation models as well. ",
    "url": "https://arxiv.org/abs/2201.07986",
    "authors": [
      "Sixiao Zhang",
      "Hongxu Chen",
      "Xiangguo Sun",
      "Yicong Li",
      "Guandong Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2201.07988",
    "title": "Identifying critical nodes in complex networks by graph representation  learning",
    "abstract": "Because of its wide application, critical nodes identification has become an important research topic at the micro level of network science. Influence maximization is one of the main problems in critical nodes mining and is usually handled with heuristics. In this paper, a deep graph learning framework IMGNN is proposed and the corresponding training sample generation scheme is designed. The framework takes centralities of nodes in a network as input and the probability that nodes in the optimal initial spreaders as output. By training on a large number of small synthetic networks, IMGNN is more efficient than human-based heuristics in minimizing the size of initial spreaders under the fixed infection scale. The experimental results on one synthetic and five real networks show that, compared with traditional non-iterative node ranking algorithms, IMGNN has the smallest proportion of initial spreaders under different infection probabilities when the final infection scale is fixed. And the reordered version of IMGNN outperforms all the latest critical nodes mining algorithms. ",
    "url": "https://arxiv.org/abs/2201.07988",
    "authors": [
      "Enyu Yu",
      "Duanbing Chen",
      "Yan Fu",
      "Yuanyuan Xu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.07989",
    "title": "Self-supervised Video Representation Learning with Cascade Positive  Retrieval",
    "abstract": "Self-supervised video representation learning has been shown to effectively improve downstream tasks such as video retrieval and action recognition.In this paper, we present the Cascade Positive Retrieval (CPR) that successively mines positive examples w.r.t. the query for contrastive learning in a cascade of stages. Specifically, CPR exploits multiple views of a query example in different modalities, where an alternative view may help find another positive example dissimilar in the query view. We explore the effects of possible CPR configurations in ablations including the number of mining stages, the top similar example selection ratio in each stage, and progressive training with an incremental number of the final Top-k selection. The overall mining quality is measured to reflect the recall across training set classes. CPR reaches a median class mining recall of 83.3%, outperforming previous work by 5.5%. Implementation-wise, CPR is complementary to pretext tasks and can be easily applied to previous work. In the evaluation of pretraining on UCF101, CPR consistently improves existing work and even achieves state-of-the-art R@1 of 56.7% and 24.4% in video retrieval as well as 83.8% and 54.8% in action recognition on UCF101 and HMDB51. For transfer from large video dataset Kinetics400 to UCF101 and HDMB, CPR benefits existing work, showing competitive Top-1 accuracies of 85.1% and 57.4% despite pretraining at a lower resolution and frame sampling rate. The code will be released soon for reproducing the results. The code is available at https://github.com/necla-ml/CPR. ",
    "url": "https://arxiv.org/abs/2201.07989",
    "authors": [
      "Cheng-En Wu",
      "Farley Lai",
      "Yu Hen Hu",
      "Asim Kadav"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.07996",
    "title": "Evaluating the Performance of Clone Detection Tools in Detecting Cloned  Co-change Candidates",
    "abstract": "Co-change candidates are the group of code fragments that require a change if any of these fragments experience a modification in a commit operation during software evolution. The cloned co-change candidates are a subset of the co-change candidates, and the members in this subset are clones of one another. The cloned co-change candidates are usually created by reusing existing code fragments in a software system. Detecting cloned co-change candidates is essential for clone-tracking, and studies have shown that we can use clone detection tools to find cloned co-change candidates. However, although several studies evaluate clone detection tools for their accuracy in detecting cloned fragments, we found no study that evaluates clone detection tools for detecting cloned co-change candidates. In this study, we explore the dimension of code clone research for detecting cloned co-change candidates. We compare the performance of 12 different configurations of nine promising clone detection tools in identifying cloned co-change candidates from eight open-source C and Java-based subject systems of various sizes and application domains. A ranked list and analysis of the results provides valuable insights and guidelines into selecting and configuring a clone detection tool for identifying co-change candidates and leads to a new dimension of code clone research into change impact analysis. ",
    "url": "https://arxiv.org/abs/2201.07996",
    "authors": [
      "Md Nadim",
      "Manishankar Mondal",
      "Chanchal K. Roy",
      "Kevin Schneider"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2201.08001",
    "title": "CELESTIAL: Classification Enabled via Labelless Embeddings with  Self-supervised Telescope Image Analysis Learning",
    "abstract": "A common class of problems in remote sensing is scene classification, a fundamentally important task for natural hazards identification, geographic image retrieval, and environment monitoring. Recent developments in this field rely label-dependent supervised learning techniques which is antithetical to the 35 petabytes of unlabelled satellite imagery in NASA GIBS. To solve this problem, we establish CELESTIAL-a self-supervised learning pipeline for effectively leveraging sparsely-labeled satellite imagery. This pipeline successfully adapts SimCLR, an algorithm that first learns image representations on unlabelled data and then fine-tunes this knowledge on the provided labels. Our results show CELESTIAL requires only a third of the labels that the supervised method needs to attain the same accuracy on an experimental dataset. The first unsupervised tier can enable applications such as reverse image search for NASA Worldview (i.e. searching similar atmospheric phenomenon over years of unlabelled data with minimal samples) and the second supervised tier can lower the necessity of expensive data annotation significantly. In the future, we hope we can generalize the CELESTIAL pipeline to other data types, algorithms, and applications. ",
    "url": "https://arxiv.org/abs/2201.08001",
    "authors": [
      "Suhas Kotha",
      "Anirudh Koul",
      "Siddha Ganju",
      "Meher Kasam"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.08005",
    "title": "FreSCo: Mining Frequent Patterns in Simplicial Complexes",
    "abstract": "Simplicial complexes are a generalization of graphs that model higher-order relations. In this paper, we introduce simplicial patterns -- that we call simplets -- and generalize the task of frequent pattern mining from the realm of graphs to that of simplicial complexes. Our task is particularly challenging due to the enormous search space and the need for higher-order isomorphism. We show that finding the occurrences of simplets in a complex can be reduced to a bipartite graph isomorphism problem, in linear time and at most quadratic space. We then propose an anti-monotonic frequency measure that allows us to start the exploration from small simplets and stop expanding a simplet as soon as its frequency falls below the minimum frequency threshold. Equipped with these ideas and a clever data structure, we develop a memory-conscious algorithm that, by carefully exploiting the relationships among the simplices in the complex and among the simplets, achieves efficiency and scalability for our complex mining task. Our algorithm, FreSCo, comes in two flavors: it can compute the exact frequency of the simplets or, more quickly, it can determine whether a simplet is frequent, without having to compute the exact frequency. Experimental results prove the ability of FreSCo to mine frequent simplets in complexes of various size and dimension, and the significance of the simplets with respect to the traditional graph patterns. ",
    "url": "https://arxiv.org/abs/2201.08005",
    "authors": [
      "Giulia Preti",
      "Gianmarco De Francisci Morales",
      "Francesco Bonchi"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2201.08022",
    "title": "HEAM: High-Efficiency Approximate Multiplier Optimization for Deep  Neural Networks",
    "abstract": "Deep neural networks (DNNs) are widely applied to artificial intelligence applications, achieving promising performance at the cost of massive computation, large power consumption, and high latency. Diverse solutions have been proposed to cope with the challenge of latency and power consumption, including light-weight neural networks and efficient hardware accelerators. Moreover, research on quantization reduces the cost of computation and shows the error resiliency of DNNs. To improve the latency and power efficiency of hardware accelerators by exploiting the error resiliency, we propose an application-specific optimization method for the automatic design of approximate multipliers for DNNs. The proposed method optimizes an approximate multiplier by minimizing the error according to the probability distributions extracted from DNNs. By applying the optimized approximate multiplier to a DNN, we obtain 1.60%, 15.32%, and 20.19% higher accuracies than the best reproduced approximate multiplier on the widely used MNIST, FashionMNIST, and CIFAR-10 datasets, respectively, with 12.17% smaller area, 23.38% less power consumption, and 16.53% lower latency. Compared with an exact multiplier, the optimized multiplier reduces the area, power consumption, and latency by 36.88%, 52.45%, and 26.63%, respectively. Applied to FPGA-based and ASIC-based DNN accelerator modules, our approximate multiplier obtains low LUT utilization and small area respectively with competitive max frequency and power consumption, which shows the effectiveness of the proposed method in reducing the hardware cost of DNN accelerators. ",
    "url": "https://arxiv.org/abs/2201.08022",
    "authors": [
      "Su Zheng",
      "Zhen Li",
      "Yao Lu",
      "Jingbo Gao",
      "Jide Zhang",
      "Lingli Wang"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.08027",
    "title": "A Joint Morphological Profiles and Patch Tensor Change Detection for  Hyperspectral Imagery",
    "abstract": "Multi-temporal hyperspectral images can be used to detect changed information, which has gradually attracted researchers' attention. However, traditional change detection algorithms have not deeply explored the relevance of spatial and spectral changed features, which leads to low detection accuracy. To better excavate both spectral and spatial information of changed features, a joint morphology and patch-tensor change detection (JMPT) method is proposed. Initially, a patch-based tensor strategy is adopted to exploit similar property of spatial structure, where the non-overlapping local patch image is reshaped into a new tensor cube, and then three-order Tucker decompositon and image reconstruction strategies are adopted to obtain more robust multi-temporal hyperspectral datasets. Meanwhile, multiple morphological profiles including max-tree and min-tree are applied to extract different attributes of multi-temporal images. Finally, these results are fused to general a final change detection map. Experiments conducted on two real hyperspectral datasets demonstrate that the proposed detector achieves better detection performance. ",
    "url": "https://arxiv.org/abs/2201.08027",
    "authors": [
      "Zengfu Hou",
      "Wei Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2201.08032",
    "title": "Combining Machine Learning with Knowledge Engineering to detect Fake  News in Social Networks-a survey",
    "abstract": "Due to extensive spread of fake news on social and news media it became an emerging research topic now a days that gained attention. In the news media and social media the information is spread highspeed but without accuracy and hence detection mechanism should be able to predict news fast enough to tackle the dissemination of fake news. It has the potential for negative impacts on individuals and society. Therefore, detecting fake news on social media is important and also a technically challenging problem these days. We knew that Machine learning is helpful for building Artificial intelligence systems based on tacit knowledge because it can help us to solve complex problems due to real word data. On the other side we knew that Knowledge engineering is helpful for representing experts knowledge which people aware of that knowledge. Due to this we proposed that integration of Machine learning and knowledge engineering can be helpful in detection of fake news. In this paper we present what is fake news, importance of fake news, overall impact of fake news on different areas, different ways to detect fake news on social media, existing detections algorithms that can help us to overcome the issue, similar application areas and at the end we proposed combination of data driven and engineered knowledge to combat fake news. We studied and compared three different modules text classifiers, stance detection applications and fact checking existing techniques that can help to detect fake news. Furthermore, we investigated the impact of fake news on society. Experimental evaluation of publically available datasets and our proposed fake news detection combination can serve better in detection of fake news. ",
    "url": "https://arxiv.org/abs/2201.08032",
    "authors": [
      "Sajjad Ahmed",
      "Knut Hinkelmann",
      "Flavio Corradini"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.08049",
    "title": "Lightweight Salient Object Detection in Optical Remote Sensing Images  via Feature Correlation",
    "abstract": "Salient object detection in optical remote sensing images (ORSI-SOD) has been widely explored for understanding ORSIs. However, previous methods focus mainly on improving the detection accuracy while neglecting the cost in memory and computation, which may hinder their real-world applications. In this paper, we propose a novel lightweight ORSI-SOD solution, named CorrNet, to address these issues. In CorrNet, we first lighten the backbone (VGG-16) and build a lightweight subnet for feature extraction. Then, following the coarse-to-fine strategy, we generate an initial coarse saliency map from high-level semantic features in a Correlation Module (CorrM). The coarse saliency map serves as the location guidance for low-level features. In CorrM, we mine the object location information between high-level semantic features through the cross-layer correlation operation. Finally, based on low-level detailed features, we refine the coarse saliency map in the refinement subnet equipped with Dense Lightweight Refinement Blocks, and produce the final fine saliency map. By reducing the parameters and computations of each component, CorrNet ends up having only 4.09M parameters and running with 21.09G FLOPs. Experimental results on two public datasets demonstrate that our lightweight CorrNet achieves competitive or even better performance compared with 26 state-of-the-art methods (including 16 large CNN-based methods and 2 lightweight methods), and meanwhile enjoys the clear memory and run time efficiency. The code and results of our method are available at https://github.com/MathLee/CorrNet. ",
    "url": "https://arxiv.org/abs/2201.08049",
    "authors": [
      "Gongyang Li",
      "Zhi Liu",
      "Zhen Bai",
      "Weisi Lin",
      "and Haibin Ling"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.08052",
    "title": "Adversarial Jamming for a More Effective Constellation Attack",
    "abstract": "The common jamming mode in wireless communication is band barrage jamming, which is controllable and difficult to resist. Although this method is simple to implement, it is obviously not the best jamming waveform. Therefore, based on the idea of adversarial examples, we propose the adversarial jamming waveform, which can independently optimize and find the best jamming waveform. We attack QAM with adversarial jamming and find that the optimal jamming waveform is equivalent to the amplitude and phase between the nearest constellation points. Furthermore, by verifying the jamming performance on a hardware platform, it is shown that our method significantly improves the bit error rate compared to other methods. ",
    "url": "https://arxiv.org/abs/2201.08052",
    "authors": [
      "Haidong Xie",
      "Yizhou Xu",
      "Yuanqing Chen",
      "Nan Ji",
      "Shuai Yuan",
      "Naijin Liu",
      "Xueshuang Xiang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2201.08066",
    "title": "NLP Methods in Host-based Intrusion Detection Systems: A Systematic  Review and Future Directions",
    "abstract": "The Host-Based Intrusion Detection Systems (HIDS) are widely used for defending against cybersecurity attacks. An increasing number of HIDS have started leveraging the advances in Natural Language Processing (NLP) technologies that have shown promising results in precisely detecting low footprint, zero-day attacks and predict attacker's next steps. We conduct a systematic review of the literature on NLP-based HIDS in order to build a systematized body of knowledge. We develop an NLP-based HIDS taxonomy for comparing the features, techniques, attacks, datasets, and metrics found from the reviewed papers. We highlight the prevalent practices and the future research areas. ",
    "url": "https://arxiv.org/abs/2201.08066",
    "authors": [
      "Zarrin Tasnim Sworna",
      "Zahra Mousavi",
      "Muhammad Ali Babar"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2201.08070",
    "title": "Linguistically-driven Multi-task Pre-training for Low-resource Neural  Machine Translation",
    "abstract": "In the present study, we propose novel sequence-to-sequence pre-training objectives for low-resource machine translation (NMT): Japanese-specific sequence to sequence (JASS) for language pairs involving Japanese as the source or target language, and English-specific sequence to sequence (ENSS) for language pairs involving English. JASS focuses on masking and reordering Japanese linguistic units known as bunsetsu, whereas ENSS is proposed based on phrase structure masking and reordering tasks. Experiments on ASPEC Japanese--English & Japanese--Chinese, Wikipedia Japanese--Chinese, News English--Korean corpora demonstrate that JASS and ENSS outperform MASS and other existing language-agnostic pre-training methods by up to +2.9 BLEU points for the Japanese--English tasks, up to +7.0 BLEU points for the Japanese--Chinese tasks and up to +1.3 BLEU points for English--Korean tasks. Empirical analysis, which focuses on the relationship between individual parts in JASS and ENSS, reveals the complementary nature of the subtasks of JASS and ENSS. Adequacy evaluation using LASER, human evaluation, and case studies reveals that our proposed methods significantly outperform pre-training methods without injected linguistic knowledge and they have a larger positive impact on the adequacy as compared to the fluency. We release codes here: https://github.com/Mao-KU/JASS/tree/master/linguistically-driven-pretraining. ",
    "url": "https://arxiv.org/abs/2201.08070",
    "authors": [
      "Zhuoyuan Mao",
      "Chenhui Chu",
      "Sadao Kurohashi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2201.08087",
    "title": "DeepGalaxy: Testing Neural Network Verifiers via Two-Dimensional Input  Space Exploration",
    "abstract": "Deep neural networks (DNNs) are widely developed and applied in many areas, and the quality assurance of DNNs is critical. Neural network verification (NNV) aims to provide formal guarantees to DNN models. Similar to traditional software, neural network verifiers could also contain bugs, which would have a critical and serious impact, especially in safety-critical areas. However, little work exists on validating neural network verifiers. In this work, we propose DeepGalaxy, an automated approach based on differential testing to tackle this problem. Specifically, we (1) propose a line of mutation rules, including model level mutation and specification level mutation, to effectively explore the two-dimensional input space of neural network verifiers; and (2) propose heuristic strategies to select test cases. We leveraged our implementation of DeepGalaxy to test three state-of-the-art neural network verifies, Marabou, Eran, and Neurify. The experimental results support the efficiency and effectiveness of DeepGalaxy. Moreover, five unique unknown bugs were discovered ",
    "url": "https://arxiv.org/abs/2201.08087",
    "authors": [
      "Xuan Xie",
      "Fuyuan Zhang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2201.08093",
    "title": "AirPose: Multi-View Fusion Network for Aerial 3D Human Pose and Shape  Estimation",
    "abstract": "In this letter, we present a novel markerless 3D human motion capture (MoCap) system for unstructured, outdoor environments that uses a team of autonomous unmanned aerial vehicles (UAVs) with on-board RGB cameras and computation. Existing methods are limited by calibrated cameras and off-line processing. Thus, we present the first method (AirPose) to estimate human pose and shape using images captured by multiple extrinsically uncalibrated flying cameras. AirPose itself calibrates the cameras relative to the person instead of relying on any pre-calibration. It uses distributed neural networks running on each UAV that communicate viewpoint-independent information with each other about the person (i.e., their 3D shape and articulated pose). The person's shape and pose are parameterized using the SMPL-X body model, resulting in a compact representation, that minimizes communication between the UAVs. The network is trained using synthetic images of realistic virtual environments, and fine-tuned on a small set of real images. We also introduce an optimization-based post-processing method (AirPose$^{+}$) for offline applications that require higher MoCap quality. We make our method's code and data available for research at https://github.com/robot-perception-group/AirPose. A video describing the approach and results is available at https://youtu.be/xLYe1TNHsfs. ",
    "url": "https://arxiv.org/abs/2201.08093",
    "authors": [
      "Nitin Saini",
      "Elia Bonetto",
      "Eric Price",
      "Aamir Ahmad",
      "Michael J. Black"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.08117",
    "title": "Learning robust perceptive locomotion for quadrupedal robots in the wild",
    "abstract": "Legged robots that can operate autonomously in remote and hazardous environments will greatly increase opportunities for exploration into under-explored areas. Exteroceptive perception is crucial for fast and energy-efficient locomotion: perceiving the terrain before making contact with it enables planning and adaptation of the gait ahead of time to maintain speed and stability. However, utilizing exteroceptive perception robustly for locomotion has remained a grand challenge in robotics. Snow, vegetation, and water visually appear as obstacles on which the robot cannot step~-- or are missing altogether due to high reflectance. Additionally, depth perception can degrade due to difficult lighting, dust, fog, reflective or transparent surfaces, sensor occlusion, and more. For this reason, the most robust and general solutions to legged locomotion to date rely solely on proprioception. This severely limits locomotion speed, because the robot has to physically feel out the terrain before adapting its gait accordingly. Here we present a robust and general solution to integrating exteroceptive and proprioceptive perception for legged locomotion. We leverage an attention-based recurrent encoder that integrates proprioceptive and exteroceptive input. The encoder is trained end-to-end and learns to seamlessly combine the different perception modalities without resorting to heuristics. The result is a legged locomotion controller with high robustness and speed. The controller was tested in a variety of challenging natural and urban environments over multiple seasons and completed an hour-long hike in the Alps in the time recommended for human hikers. ",
    "url": "https://arxiv.org/abs/2201.08117",
    "authors": [
      "Takahiro Miki",
      "Joonho Lee",
      "Jemin Hwangbo",
      "Lorenz Wellhausen",
      "Vladlen Koltun",
      "Marco Hutter"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2201.08131",
    "title": "GeoFill: Reference-Based Image Inpainting of Scenes with Complex  Geometry",
    "abstract": "Reference-guided image inpainting restores image pixels by leveraging the content from another reference image. The previous state-of-the-art, TransFill, warps the source image with multiple homographies, and fuses them together for hole filling. Inspired by structure from motion pipelines and recent progress in monocular depth estimation, we propose a more principled approach that does not require heuristic planar assumptions. We leverage a monocular depth estimate and predict relative pose between cameras, then align the reference image to the target by a differentiable 3D reprojection and a joint optimization of relative pose and depth map scale and offset. Our approach achieves state-of-the-art performance on both RealEstate10K and MannequinChallenge dataset with large baselines, complex geometry and extreme camera motions. We experimentally verify our approach is also better at handling large holes. ",
    "url": "https://arxiv.org/abs/2201.08131",
    "authors": [
      "Yunhan Zhao",
      "Connelly Barnes",
      "Yuqian Zhou",
      "Eli Shechtman",
      "Sohrab Amirghodsi",
      "Charless Fowlkes"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.08135",
    "title": "Survey on Federated Learning Threats: concepts, taxonomy on attacks and  defences, experimental study and challenges",
    "abstract": "Federated learning is a machine learning paradigm that emerges as a solution to the privacy-preservation demands in artificial intelligence. As machine learning, federated learning is threatened by adversarial attacks against the integrity of the learning model and the privacy of data via a distributed approach to tackle local and global learning. This weak point is exacerbated by the inaccessibility of data in federated learning, which makes harder the protection against adversarial attacks and evidences the need to furtherance the research on defence methods to make federated learning a real solution for safeguarding data privacy. In this paper, we present an extensive review of the threats of federated learning, as well as as their corresponding countermeasures, attacks versus defences. This survey provides a taxonomy of adversarial attacks and a taxonomy of defence methods that depict a general picture of this vulnerability of federated learning and how to overcome it. Likewise, we expound guidelines for selecting the most adequate defence method according to the category of the adversarial attack. Besides, we carry out an extensive experimental study from which we draw further conclusions about the behaviour of attacks and defences and the guidelines for selecting the most adequate defence method according to the category of the adversarial attack. This study is finished leading to meditated learned lessons and challenges. ",
    "url": "https://arxiv.org/abs/2201.08135",
    "authors": [
      "Nuria Rodríguez-Barroso",
      "Daniel Jiménez López",
      "M. Victoria Luzón",
      "Francisco Herrera",
      "Eugenio Martínez-Cámara"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.08137",
    "title": "DRTCI: Learning Disentangled Representations for Temporal Causal  Inference",
    "abstract": "Medical professionals evaluating alternative treatment plans for a patient often encounter time varying confounders, or covariates that affect both the future treatment assignment and the patient outcome. The recently proposed Counterfactual Recurrent Network (CRN) accounts for time varying confounders by using adversarial training to balance recurrent historical representations of patient data. However, this work assumes that all time varying covariates are confounding and thus attempts to balance the full state representation. Given that the actual subset of covariates that may in fact be confounding is in general unknown, recent work on counterfactual evaluation in the static, non-temporal setting has suggested that disentangling the covariate representation into separate factors, where each either influence treatment selection, patient outcome or both can help isolate selection bias and restrict balancing efforts to factors that influence outcome, allowing the remaining factors which predict treatment without needlessly being balanced. ",
    "url": "https://arxiv.org/abs/2201.08137",
    "authors": [
      "Garima Gupta",
      "Lovekesh Vig",
      "Gautam Shroff"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.08174",
    "title": "Knowledge Graph Question Answering Leaderboard: A Community Resource to  Prevent a Replication Crisis",
    "abstract": "Data-driven systems need to be evaluated to establish trust in the scientific approach and its applicability. In particular, this is true for Knowledge Graph (KG) Question Answering (QA), where complex data structures are made accessible via natural-language interfaces. Evaluating the capabilities of these systems has been a driver for the community for more than ten years while establishing different KGQA benchmark datasets. However, comparing different approaches is cumbersome. The lack of existing and curated leaderboards leads to a missing global view over the research field and could inject mistrust into the results. In particular, the latest and most-used datasets in the KGQA community, LC-QuAD and QALD, miss providing central and up-to-date points of trust. In this paper, we survey and analyze a wide range of evaluation results with significant coverage of 100 publications and 98 systems from the last decade. We provide a new central and open leaderboard for any KGQA benchmark dataset as a focal point for the community - https://kgqa.github.io/leaderboard. Our analysis highlights existing problems during the evaluation of KGQA systems. Thus, we will point to possible improvements for future evaluations. ",
    "url": "https://arxiv.org/abs/2201.08174",
    "authors": [
      "Aleksandr Perevalov",
      "Xi Yan",
      "Liubov Kovriguina",
      "Longquan Jiang",
      "Andreas Both",
      "Ricardo Usbeck"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2201.08193",
    "title": "Learning-based Hybrid Local Search for the Hard-label Textual Attack",
    "abstract": "Deep neural networks are vulnerable to adversarial examples in Natural Language Processing. However, existing textual adversarial attacks usually utilize the gradient or prediction confidence to generate adversarial examples, making it hard to be deployed in real-world applications. To this end, we consider a rarely investigated but more rigorous setting, namely hard-label attack, in which the attacker could only access the prediction label. In particular, we find that the changes on prediction label caused by word substitutions on the adversarial example could precisely reflect the importance of different words. Based on this observation, we propose a novel hard-label attack, called Learning-based Hybrid Local Search (LHLS) algorithm, which effectively estimates word importance with the prediction label from the attack history and integrate such information into hybrid local search algorithm to optimize the adversarial perturbation. Extensive evaluations for text classification and textual entailment using various datasets and models show that our LHLS significantly outperforms existing hard-label attacks regarding the attack performance as well as adversary quality. ",
    "url": "https://arxiv.org/abs/2201.08193",
    "authors": [
      "Zhen Yu",
      "Xiaosen Wang",
      "Wanxiang Che",
      "Kun He"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.08201",
    "title": "Providing Upgrade Plans for Third-party Libraries: A Recommender System  using Migration Graphs",
    "abstract": "During the development of a software project, developers often need to upgrade third-party libraries (TPLs), aiming to keep their code up-to-date with the newest functionalities offered by the used libraries. In most cases, upgrading used TPLs is a complex and error-prone activity that must be carefully carried out to limit the ripple effects on the software project that depends on the libraries being upgraded. In this paper, we propose EvoPlan as a novel approach to the recommendation of different upgrade plans given a pair of library-version as input. In particular, among the different paths that can be possibly followed to upgrade the current library version to the desired updated one, EvoPlan is able to suggest the plan that can potentially minimize the efforts being needed to migrate the code of the clients from the library's current release to the target one. The approach has been evaluated on a curated dataset using conventional metrics used in Information Retrieval, i.e., precision, recall, and F-measure. The experimental results show that EvoPlan obtains an encouraging prediction performance considering two different criteria in the plan specification, i.e., the popularity of migration paths and the number of open and closed issues in GitHub for those projects that have already followed the recommended migration paths. ",
    "url": "https://arxiv.org/abs/2201.08201",
    "authors": [
      "Riccardo Rubei",
      "Davide Di Ruscio",
      "Claudio Di Sipio",
      "Juri Di Rocco",
      "Phuong T. Nguyen"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2201.08202",
    "title": "Active Connectivity Fundamentals for TSCH Networks of Mobile Robots",
    "abstract": "Time Slotted Channel Hopping (TSCH) is a medium access protocol defined in the IEEE 802.15.4 standard which have been proven to be one of the most reliable options when it comes to industrial applications. TSCH has been designed to be utilized in static network topologies. Thus, if an application scenario requires a mobile network topology, TSCH does not perform reliably. In this paper we introduce active connectivity for mobile application scenarios, such as mobile robots. This is a feature that enables the option to regulate physical characteristics such as the speed of a node as it moves, in order to keep being connected to the TSCH network. We model the active connectivity approach through a basic example where two nodes are moving towards the same direction to infer the main principles of the introduced approach. We evaluate the active connectivity feature through simulations and quantify trade-off between connectivity and application-layer performance. ",
    "url": "https://arxiv.org/abs/2201.08202",
    "authors": [
      "Charalampos Orfanidis",
      "Paul Pop",
      "Xenofon Fafoutis"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.08215",
    "title": "CP-Net: Contour-Perturbed Reconstruction Network for Self-Supervised  Point Cloud Learning",
    "abstract": "Self-supervised learning has not been fully explored for point cloud analysis. Current frameworks are mainly based on point cloud reconstruction. Given only 3D coordinates, such approaches tend to learn local geometric structures and contours, while failing in understanding high level semantic content. Consequently, they achieve unsatisfactory performance in downstream tasks such as classification, segmentation, etc. To fill this gap, we propose a generic Contour-Perturbed Reconstruction Network (CP-Net), which can effectively guide self-supervised reconstruction to learn semantic content in the point cloud, and thus promote discriminative power of point cloud representation. First, we introduce a concise contour-perturbed augmentation module for point cloud reconstruction. With guidance of geometry disentangling, we divide point cloud into contour and content components. Subsequently, we perturb the contour components and preserve the content components on the point cloud. As a result, self supervisor can effectively focus on semantic content, by reconstructing the original point cloud from such perturbed one. Second, we use this perturbed reconstruction as an assistant branch, to guide the learning of basic reconstruction branch via a distinct dual-branch consistency loss. In this case, our CP-Net not only captures structural contour but also learn semantic content for discriminative downstream tasks. Finally, we perform extensive experiments on a number of point cloud benchmarks. Part segmentation results demonstrate that our CP-Net (81.5% of mIoU) outperforms the previous self-supervised models, and narrows the gap with the fully-supervised methods. For classification, we get a competitive result with the fully-supervised methods on ModelNet40 (92.5% accuracy) and ScanObjectNN (87.9% accuracy). The codes and models will be released afterwards. ",
    "url": "https://arxiv.org/abs/2201.08215",
    "authors": [
      "Mingye Xu",
      "Zhipeng Zhou",
      "Hongbin Xu",
      "Yali Wang",
      "Yu Qiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.08227",
    "title": "Multi-agent Covering Option Discovery based on Kronecker Product of  Factor Graphs",
    "abstract": "Covering option discovery has been developed to improve the exploration of reinforcement learning in single-agent scenarios with sparse reward signals, through connecting the most distant states in the embedding space provided by the Fiedler vector of the state transition graph. However, these option discovery methods cannot be directly extended to multi-agent scenarios, since the joint state space grows exponentially with the number of agents in the system. Thus, existing researches on adopting options in multi-agent scenarios still rely on single-agent option discovery and fail to directly discover the joint options that can improve the connectivity of the joint state space of agents. In this paper, we show that it is indeed possible to directly compute multi-agent options with collaborative exploratory behaviors among the agents, while still enjoying the ease of decomposition. Our key idea is to approximate the joint state space as a Kronecker graph -- the Kronecker product of individual agents' state transition graphs, based on which we can directly estimate the Fiedler vector of the joint state space using the Laplacian spectrum of individual agents' transition graphs. This decomposition enables us to efficiently construct multi-agent joint options by encouraging agents to connect the sub-goal joint states which are corresponding to the minimum or maximum values of the estimated joint Fiedler vector. The evaluation based on multi-agent collaborative tasks shows that the proposed algorithm can successfully identify multi-agent options, and significantly outperforms prior works using single-agent options or no options, in terms of both faster exploration and higher cumulative rewards. ",
    "url": "https://arxiv.org/abs/2201.08227",
    "authors": [
      "Jiayu Chen",
      "Jingdi Chen",
      "Tian Lan",
      "Vaneet Aggarwal"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.08236",
    "title": "Temporal Knowledge Graph Completion: A Survey",
    "abstract": "Knowledge graph completion (KGC) can predict missing links and is crucial for real-world knowledge graphs, which widely suffer from incompleteness. KGC methods assume a knowledge graph is static, but that may lead to inaccurate prediction results because many facts in the knowledge graphs change over time. Recently, emerging methods have shown improved predictive results by further incorporating the timestamps of facts; namely, temporal knowledge graph completion (TKGC). With this temporal information, TKGC methods can learn the dynamic evolution of the knowledge graph that KGC methods fail to capture. In this paper, for the first time, we summarize the recent advances in TKGC research. First, we detail the background of TKGC, including the problem definition, benchmark datasets, and evaluation metrics. Then, we summarize existing TKGC methods based on how timestamps of facts are used to capture the temporal dynamics. Finally, we conclude the paper and present future research directions of TKGC. ",
    "url": "https://arxiv.org/abs/2201.08236",
    "authors": [
      "Borui Cai",
      "Yong Xiang",
      "Longxiang Gao",
      "He Zhang",
      "Yunfeng Li",
      "Jianxin Li"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.08261",
    "title": "Optimization of a Reed-Solomon code-based protocol against blockchain  data availability attacks",
    "abstract": "ASBK (named after the authors' initials) is a recent blockchain protocol tackling data availability attacks against light nodes, employing two-dimensional Reed-Solomon codes to encode the list of transactions and a random sampling phase where adversaries are forced to reveal information. In its original formulation, only codes with rate $1/4$ are considered, and a theoretical analysis requiring computationally demanding formulas is provided. This makes ASBK difficult to optimize in situations of practical interest. In this paper, we introduce a much simpler model for such a protocol, which additionally supports the use of codes with arbitrary rate. This makes blockchains implementing ASBK much easier to design and optimize. Furthermore, disposing of a clearer view of the protocol, some general features and considerations can be derived (e.g., nodes behaviour in largely participated networks). As a concrete application of our analysis, we consider relevant blockchain parameters and find network settings that minimize the amount of data downloaded by light nodes. Our results show that the protocol benefits from the use of codes defined over large finite fields, with code rates that may be even significantly different from the originally proposed ones. ",
    "url": "https://arxiv.org/abs/2201.08261",
    "authors": [
      "Paolo Santini",
      "Giulia Rafaiani",
      "Massimo Battaglioni",
      "Franco Chiaraluce",
      "Marco Baldi"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2201.08262",
    "title": "Generalizing Off-Policy Evaluation From a Causal Perspective For  Sequential Decision-Making",
    "abstract": "Assessing the effects of a policy based on observational data from a different policy is a common problem across several high-stake decision-making domains, and several off-policy evaluation (OPE) techniques have been proposed. However, these methods largely formulate OPE as a problem disassociated from the process used to generate the data (i.e. structural assumptions in the form of a causal graph). We argue that explicitly highlighting this association has important implications on our understanding of the fundamental limits of OPE. First, this implies that current formulation of OPE corresponds to a narrow set of tasks, i.e. a specific causal estimand which is focused on prospective evaluation of policies over populations or sub-populations. Second, we demonstrate how this association motivates natural desiderata to consider a general set of causal estimands, particularly extending the role of OPE for counterfactual off-policy evaluation at the level of individuals of the population. A precise description of the causal estimand highlights which OPE estimands are identifiable from observational data under the stated generative assumptions. For those OPE estimands that are not identifiable, the causal perspective further highlights where more experimental data is necessary, and highlights situations where human expertise can aid identification and estimation. Furthermore, many formalisms of OPE overlook the role of uncertainty entirely in the estimation process.We demonstrate how specifically characterising the causal estimand highlights the different sources of uncertainty and when human expertise can naturally manage this uncertainty. We discuss each of these aspects as actionable desiderata for future OPE research at scale and in-line with practical utility. ",
    "url": "https://arxiv.org/abs/2201.08262",
    "authors": [
      "Sonali Parbhoo",
      "Shalmali Joshi",
      "Finale Doshi-Velez"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2201.08265",
    "title": "Cross-Domain Few-Shot Graph Classification",
    "abstract": "We study the problem of few-shot graph classification across domains with nonequivalent feature spaces by introducing three new cross-domain benchmarks constructed from publicly available datasets. We also propose an attention-based graph encoder that uses three congruent views of graphs, one contextual and two topological views, to learn representations of task-specific information for fast adaptation, and task-agnostic information for knowledge transfer. We run exhaustive experiments to evaluate the performance of contrastive and meta-learning strategies. We show that when coupled with metric-based meta-learning frameworks, the proposed encoder achieves the best average meta-test classification accuracy across all benchmarks. The source code and data will be released here: https://github.com/kavehhassani/metagrl ",
    "url": "https://arxiv.org/abs/2201.08265",
    "authors": [
      "Kaveh Hassani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2201.08267",
    "title": "Statistical detection of format dialects using the weighted Dowker  complex",
    "abstract": "This paper provides an experimentally validated, probabilistic model of file behavior when consumed by a set of pre-existing parsers. File behavior is measured by way of a standardized set of Boolean \"messages\" produced as the files are read. By thresholding the posterior probability that a file exhibiting a particular set of messages is from a particular dialect, our model yields a practical classification algorithm for two dialects. We demonstrate that this thresholding algorithm for two dialects can be bootstrapped from a training set consisting primarily of one dialect. Both the (parametric) theoretical and the (non-parametric) empirical distributions of file behaviors for one dialect yield good classification performance, and outperform classification based on simply counting messages. Our theoretical framework relies on statistical independence of messages within each dialect. Violations of this assumption are detectable and allow a format analyst to identify \"boundaries\" between dialects. A format analyst can therefore greatly reduce the number of files they need to consider when crafting new criteria for dialect detection, since they need only consider the files that exhibit ambiguous message patterns. ",
    "url": "https://arxiv.org/abs/2201.08267",
    "authors": [
      "Michael Robinson",
      "Letitia W. Li",
      "Cory Anderson",
      "Steve Huntsman"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Algebraic Topology (math.AT)"
    ]
  },
  {
    "id": "arXiv:2201.08270",
    "title": "Towards Energy Efficient Distributed Federated Learning for 6G Networks",
    "abstract": "The provision of communication services via portable and mobile devices, such as aerial base stations, is a crucial concept to be realized in 5G/6G networks. Conventionally, IoT/edge devices need to transmit the data directly to the base station for training the model using machine learning techniques. The data transmission introduces privacy issues that might lead to security concerns and monetary losses. Recently, Federated learning was proposed to partially solve privacy issues via model-sharing with base station. However, the centralized nature of federated learning only allow the devices within the vicinity of base stations to share the trained models. Furthermore, the long-range communication compels the devices to increase transmission power, which raises the energy efficiency concerns. In this work, we propose distributed federated learning (DBFL) framework that overcomes the connectivity and energy efficiency issues for distant devices. The DBFL framework is compatible with mobile edge computing architecture that connects the devices in a distributed manner using clustering protocols. Experimental results show that the framework increases the classification performance by 7.4\\% in comparison to conventional federated learning while reducing the energy consumption. ",
    "url": "https://arxiv.org/abs/2201.08270",
    "authors": [
      "Sunder Ali Khowaja",
      "Kapal Dev",
      "Parus Khuwaja",
      "Paolo Bellavista"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.08279",
    "title": "Modeling and hexahedral meshing of arterial networks from centerlines",
    "abstract": "Computational fluid dynamics (CFD) simulation provides valuable information on blood flow from the vascular geometry. However, it requires to extract accurate models of arteries from low resolution medical images, which remains challenging. Centerline-based representation is widely used to model large vascular networks with small vessels, as it enables manual editing and encodes the topological information. In this work, we propose an automatic method to generate an hexahedral mesh suitable for CFD directly from centerlines. The proposed method is an improvement of the state-of-the-art in terms of robustness, mesh quality and reproductibility. Both the modeling and meshing tasks are addressed. A new vessel model based on penalized splines is proposed to overcome the limitations inherent to the centerline representation, such as noise and sparsity. Bifurcations are reconstructed using a physiologically accurate parametric model that we extended to planar n-furcations. Finally, a volume mesh with structured, hexahedral and flow oriented cells is produced from the proposed vascular network model. The proposed method offers a better robustness and mesh quality than the state-of-the-art methods. As it combines both modeling and meshing techniques, it can be applied to edit the geometry and topology of vascular models effortlessly to study the impact on hemodynamics. We demonstrate the efficiency of our method by entirely meshing a dataset of 60 cerebral vascular networks. 92\\% of the vessels and 83\\% of the bifurcations where mesh without defects needing manual intervention, despite the challenging aspect of the input data. The source code will be released publicly. ",
    "url": "https://arxiv.org/abs/2201.08279",
    "authors": [
      "Méghane Decroocq",
      "Carole Frindel",
      "Makoto Ohta",
      "Guillaume Lavoué"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.08281",
    "title": "Symplectic Momentum Neural Networks -- Using Discrete Variational  Mechanics as a prior in Deep Learning",
    "abstract": "With deep learning being gaining attention from the research community for prediction and control of real physical systems, learning important representations is becoming now more than ever mandatory. It is of extremely importance that deep learning representations are coherent with physics. When learning from discrete data this can be guaranteed by including some sort of prior into the learning, however not all discretization priors preserve important structures from the physics. In this paper we introduce Symplectic Momentum Neural Networks (SyMo) as models from a discrete formulation of mechanics for non-separable mechanical systems. The combination of such formulation leads SyMos to be constrained towards preserving important geometric structures such as momentum and a symplectic form and learn from limited data. Furthermore, it allows to learn dynamics only from the poses as training data. We extend SyMos to include variational integrators within the learning framework by developing an implicit root-find layer which leads to End-to-End Symplectic Momentum Neural Networks (E2E-SyMo). Through experimental results, using the pendulum and cartpole we show that such combination not only allows these models tol earn from limited data but also provides the models with the capability of preserving the symplectic form and show better long-term behaviour. ",
    "url": "https://arxiv.org/abs/2201.08281",
    "authors": [
      "Saul Santos",
      "Monica Ekal",
      "Rodrigo Ventura"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.08306",
    "title": "An Information Theory Approach to Network Evolution Models",
    "abstract": "A novel Markovian network evolution model is introduced and analysed by means of information theory. It will be proved that the model, called Network Evolution Chain, is a stationary and ergodic stochastic process. Therefore, the Asymptotic Equipartition Property can be applied to it. The model's entropy rate and typical sequences are also explored. Extracting particular information from the network and methods to simulate network evolution in the continuous time domain are discussed. Additionally, the Erdos-Renyi Network Evolution Chain is introduced as a subset of our model with the additional property of its stationary distribution matching the Erdos-Renyi random graph model. The stationary distributions of nodes and graphs are calculated for this subset alongside its entropy rate. The simulation results at the end of the paper back up the proved theorems and calculated values. ",
    "url": "https://arxiv.org/abs/2201.08306",
    "authors": [
      "Amirmohammad Farzaneh",
      "Justin P. Coon"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.08310",
    "title": "Meta Learning for Code Summarization",
    "abstract": "Source code summarization is the task of generating a high-level natural language description for a segment of programming language code. Current neural models for the task differ in their architecture and the aspects of code they consider. In this paper, we show that three SOTA models for code summarization work well on largely disjoint subsets of a large code-base. This complementarity motivates model combination: We propose three meta-models that select the best candidate summary for a given code segment. The two neural models improve significantly over the performance of the best individual model, obtaining an improvement of 2.1 BLEU points on a dataset of code segments where at least one of the individual models obtains a non-zero BLEU. ",
    "url": "https://arxiv.org/abs/2201.08310",
    "authors": [
      "Moiz Rauf",
      "Sebastian Padó",
      "Michael Pradel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2201.08318",
    "title": "Cheating Automatic Short Answer Grading: On the Adversarial Usage of  Adjectives and Adverbs",
    "abstract": "Automatic grading models are valued for the time and effort saved during the instruction of large student bodies. Especially with the increasing digitization of education and interest in large-scale standardized testing, the popularity of automatic grading has risen to the point where commercial solutions are widely available and used. However, for short answer formats, automatic grading is challenging due to natural language ambiguity and versatility. While automatic short answer grading models are beginning to compare to human performance on some datasets, their robustness, especially to adversarially manipulated data, is questionable. Exploitable vulnerabilities in grading models can have far-reaching consequences ranging from cheating students receiving undeserved credit to undermining automatic grading altogether - even when most predictions are valid. In this paper, we devise a black-box adversarial attack tailored to the educational short answer grading scenario to investigate the grading models' robustness. In our attack, we insert adjectives and adverbs into natural places of incorrect student answers, fooling the model into predicting them as correct. We observed a loss of prediction accuracy between 10 and 22 percentage points using the state-of-the-art models BERT and T5. While our attack made answers appear less natural to humans in our experiments, it did not significantly increase the graders' suspicions of cheating. Based on our experiments, we provide recommendations for utilizing automatic grading systems more safely in practice. ",
    "url": "https://arxiv.org/abs/2201.08318",
    "authors": [
      "Anna Filighera",
      "Sebastian Ochs",
      "Tim Steuer",
      "Thomas Tregel"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2201.08321",
    "title": "TOAST: Trajectory Optimization and Simultaneous Tracking using Shared  Neural Network Dynamics",
    "abstract": "Neural networks have been increasingly employed in Model Predictive Controller (MPC) to control nonlinear dynamic systems. However, MPC still poses a problem that an achievable update rate is insufficient to cope with model uncertainty and external disturbances. In this paper, we present a novel control scheme that can design an optimal tracking controller using the neural network dynamics of the MPC, making it possible to be applied as a plug-and-play extension for any existing model-based feedforward controller. We also describe how our method handles a neural network containing historical information, which does not follow a general form of dynamics. The proposed method is evaluated by its performance in classical control benchmarks with external disturbances. We also extend our control framework to be applied in an aggressive autonomous driving task with unknown friction. In all experiments, our method outperformed the compared methods by a large margin. Our controller also showed low control chattering levels, demonstrating that our feedback controller does not interfere with the optimal command of MPC. ",
    "url": "https://arxiv.org/abs/2201.08321",
    "authors": [
      "Taekyung Kim",
      "Hojin Lee",
      "Seongil Hong",
      "Wonsuk Lee"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2201.08336",
    "title": "Influences of social media usage on public attitudes and behavior  towards COVID-19 vaccine in the Arab world",
    "abstract": "Background: Vaccination programs are effective only when a significant percentage of people are vaccinated. However, vaccine acceptance varies among communities around the world. Social media usage is arguably one of the factors affecting public attitudes towards vaccines. Objective: This study aims to identify if the social media usages factors can be used to predict attitudes and behavior towards the COVID-19 vaccines among the people in the Arab world. Methods: An online survey was conducted in the Arab countries and 217 Arab people participated in this study. Logistic regression was applied to identify what demographics and social media usage factors predict public attitudes and behavior towards the COVID-19 vaccines. Results: Of the 217 participants, 56.22% of them were willing to accept the vaccine and 41.47% of them were hesitant. This study shows that none of the social media usages factors were significant enough to predict the actual vaccine acceptance behavior. Whereas the analysis showed few of the social media usage factors can predict public attitudes towards the COVID-19 vaccines. For example, frequent social media users were 2.85 times more likely to agree that the risk of COVID-19 is being exaggerated (OR=2.85, 95% CI=0.86-9.45, p=0.046) than infrequent social media users. Whereas participants having more trust in vaccine information shared by their contacts are less likely to agree that decision-makers have verified that vaccines are safe (OR=0.528, 95% CI= 0.276-1.012, p=0.05). Conclusion: The use of social media and information shared on it may affect public attitudes towards COVID-19 vaccines. Therefore, disseminating correct and validated information about COVID-19 and other vaccines on social media is important for increasing public trust and countering the impact of incorrect and misinformation. ",
    "url": "https://arxiv.org/abs/2201.08336",
    "authors": [
      "Md. Rafiul Biswas",
      "Hazrat Ali",
      "Raian Ali",
      "Zubair Shah"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2201.08357",
    "title": "The Specialized High-Performance Network on Anton 3",
    "abstract": "Molecular dynamics (MD) simulation, a computationally intensive method that provides invaluable insights into the behavior of biomolecules, typically requires large-scale parallelization. Implementation of fast parallel MD simulation demands both high bandwidth and low latency for inter-node communication, but in current semiconductor technology, neither of these properties is scaling as quickly as intra-node computational capacity. This disparity in scaling necessitates architectural innovations to maximize the utilization of computational units. For Anton 3, the latest in a family of highly successful special-purpose supercomputers designed for MD simulations, we thus designed and built a completely new specialized network as part of our ASIC. Tightly integrating this network with specialized computation pipelines enables Anton 3 to perform simulations orders of magnitude faster than any general-purpose supercomputer, and to outperform its predecessor, Anton 2 (the state of the art prior to Anton 3), by an order of magnitude. In this paper, we present the three key features of the network that contribute to the high performance of Anton 3. First, through architectural optimizations, the network achieves very low end-to-end inter-node communication latency for fine-grained messages, allowing for better overlap of computation and communication. Second, novel application-specific compression techniques reduce the size of most messages sent between nodes, thereby increasing effective inter-node bandwidth. Lastly, a new hardware synchronization primitive, called a network fence, supports fast fine-grained synchronization tailored to the data flow within a parallel MD application. These application-driven specializations to the network are critical for Anton 3's MD simulation performance advantage over all other machines. ",
    "url": "https://arxiv.org/abs/2201.08357",
    "authors": [
      "Keun Sup Shim",
      "Brian Greskamp",
      "Brian Towles",
      "Bruce Edwards",
      "J.P. Grossman",
      "David E. Shaw"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2201.08373",
    "title": "TweetBoost: Influence of Social Media on NFT Valuation",
    "abstract": "NFT or Non-Fungible Token is a token that certifies a digital asset to be unique. A wide range of assets including, digital art, music, tweets, memes, are being sold as NFTs. NFT-related content has been widely shared on social media sites such as Twitter. We aim to understand the dominant factors that influence NFT asset valuation. Towards this objective, we create a first-of-its-kind dataset linking Twitter and OpenSea (the largest NFT marketplace) to capture social media profiles and linked NFT assets. Our dataset contains 245,159 tweets posted by 17,155 unique users, directly linking 62,997 NFT assets on OpenSea worth 19 Million USD. We have made the dataset public. We analyze the growth of NFTs, characterize the Twitter users promoting NFT assets, and gauge the impact of Twitter features on the virality of an NFT. Further, we investigate the effectiveness of different social media and NFT platform features by experimenting with multiple machine learning and deep learning models to predict an asset's value. Our results show that social media features improve the accuracy by 6% over baseline models that use only NFT platform features. Among social media features, count of user membership lists, number of likes and retweets are important features. ",
    "url": "https://arxiv.org/abs/2201.08373",
    "authors": [
      "Arnav Kapoor",
      "Dipanwita Guhathakurta",
      "Mehul Mathur",
      "Rupanshu Yadav",
      "Manish Gupta",
      "Ponnurungam Kumaraguru"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2201.06072",
    "title": "Dynamics of Bitcoin mining",
    "abstract": "What happens to mining when the Bitcoin price changes, when there are mining supply shocks, the price of energy changes, or hardware technology evolves? We give precise answers based on the technical forces and incentives in the system. We then build on these dynamics to consider value: what is the cost and purpose of mining, and is it worth it? Does it use too much energy, is it bad for the environment? Finally we extend our analysis to the long term: is mining economically feasible forever? What will the global hash rate be in 40 years? How is mining impacted by the limits of computation and energy? Is it physically sustainable in the long run? From first principles, we derive a fundamental scale-invariant feasibility constraint, which enables us to analyze the interlocking dynamics, find key invariants, and answer these questions mathematically. ",
    "url": "https://arxiv.org/abs/2201.06072",
    "authors": [
      "Nemo Semret"
    ],
    "subjectives": [
      "General Economics (econ.GN)",
      "Computer Science and Game Theory (cs.GT)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2201.07890",
    "title": "Convolutional Neural Networks for Spherical Signal Processing via  Spherical Haar Tight Framelets",
    "abstract": "In this paper, we develop a general theoretical framework for constructing Haar-type tight framelets on any compact set with a hierarchical partition. In particular, we construct a novel area-regular hierarchical partition on the 2-sphere and establish its corresponding spherical Haar tight framelets with directionality. We conclude by evaluating and illustrating the effectiveness of our area-regular spherical Haar tight framelets in several denoising experiments. Furthermore, we propose a convolutional neural network (CNN) model for spherical signal denoising which employs the fast framelet decomposition and reconstruction algorithms. Experiment results show that our proposed CNN model outperforms threshold methods, and processes strong generalization and robustness properties. ",
    "url": "https://arxiv.org/abs/2201.07890",
    "authors": [
      "Jianfei Li",
      "Han Feng",
      "Xiaosheng Zhuang"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Functional Analysis (math.FA)"
    ]
  },
  {
    "id": "arXiv:2201.08218",
    "title": "Long Short-Term Memory Neural Network for Financial Time Series",
    "abstract": "Performance forecasting is an age-old problem in economics and finance. Recently, developments in machine learning and neural networks have given rise to non-linear time series models that provide modern and promising alternatives to traditional methods of analysis. In this paper, we present an ensemble of independent and parallel long short-term memory (LSTM) neural networks for the prediction of stock price movement. LSTMs have been shown to be especially suited for time series data due to their ability to incorporate past information, while neural network ensembles have been found to reduce variability in results and improve generalization. A binary classification problem based on the median of returns is used, and the ensemble's forecast depends on a threshold value, which is the minimum number of LSTMs required to agree upon the result. The model is applied to the constituents of the smaller, less efficient Stockholm OMX30 instead of other major market indices such as the DJIA and S&P500 commonly found in literature. With a straightforward trading strategy, comparisons with a randomly chosen portfolio and a portfolio containing all the stocks in the index show that the portfolio resulting from the LSTM ensemble provides better average daily returns and higher cumulative returns over time. Moreover, the LSTM portfolio also exhibits less volatility, leading to higher risk-return ratios. ",
    "url": "https://arxiv.org/abs/2201.08218",
    "authors": [
      "Carmina Fjellström"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.08283",
    "title": "Lead-lag detection and network clustering for multivariate time series  with an application to the US equity market",
    "abstract": "In multivariate time series systems, it has been observed that certain groups of variables partially lead the evolution of the system, while other variables follow this evolution with a time delay; the result is a lead-lag structure amongst the time series variables. In this paper, we propose a method for the detection of lead-lag clusters of time series in multivariate systems. We demonstrate that the web of pairwise lead-lag relationships between time series can be helpfully construed as a directed network, for which there exist suitable algorithms for the detection of pairs of lead-lag clusters with high pairwise imbalance. Within our framework, we consider a number of choices for the pairwise lead-lag metric and directed network clustering components. Our framework is validated on both a synthetic generative model for multivariate lead-lag time series systems and daily real-world US equity prices data. We showcase that our method is able to detect statistically significant lead-lag clusters in the US equity market. We study the nature of these clusters in the context of the empirical finance literature on lead-lag relations and demonstrate how these can be used for the construction of predictive financial signals. ",
    "url": "https://arxiv.org/abs/2201.08283",
    "authors": [
      "Stefanos Bennett",
      "Mihai Cucuringu",
      "Gesine Reinert"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistical Finance (q-fin.ST)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2201.08294",
    "title": "Statistical prediction of extreme events from small datasets",
    "abstract": "We propose Echo State Networks (ESNs) to predict the statistics of extreme events in a turbulent flow. We train the ESNs on small datasets that lack information about the extreme events. We asses whether the networks are able to extrapolate from the small imperfect datasets and predict the heavy-tail statistics that describe the events. We find that the networks correctly predict the events and improve the statistics of the system with respect to the training data in almost all cases analysed. This opens up new possibilities for the statistical prediction of extreme events in turbulence. ",
    "url": "https://arxiv.org/abs/2201.08294",
    "authors": [
      "Alberto Racca",
      "Luca Magri"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)",
      "Chaotic Dynamics (nlin.CD)"
    ]
  },
  {
    "id": "arXiv:2201.08326",
    "title": "Learning with latent group sparsity via heat flow dynamics on networks",
    "abstract": "Group or cluster structure on explanatory variables in machine learning problems is a very general phenomenon, which has attracted broad interest from practitioners and theoreticians alike. In this work we contribute an approach to learning under such group structure, that does not require prior information on the group identities. Our paradigm is motivated by the Laplacian geometry of an underlying network with a related community structure, and proceeds by directly incorporating this into a penalty that is effectively computed via a heat flow-based local network dynamics. In fact, we demonstrate a procedure to construct such a network based on the available data. Notably, we dispense with computationally intensive pre-processing involving clustering of variables, spectral or otherwise. Our technique is underpinned by rigorous theorems that guarantee its effective performance and provide bounds on its sample complexity. In particular, in a wide range of settings, it provably suffices to run the heat flow dynamics for time that is only logarithmic in the problem dimensions. We explore in detail the interfaces of our approach with key statistical physics models in network science, such as the Gaussian Free Field and the Stochastic Block Model. We validate our approach by successful applications to real-world data from a wide array of application domains, including computer science, genetics, climatology and economics. Our work raises the possibility of applying similar diffusion-based techniques to classical learning tasks, exploiting the interplay between geometric, dynamical and stochastic structures underlying the data. ",
    "url": "https://arxiv.org/abs/2201.08326",
    "authors": [
      "Subhroshekhar Ghosh",
      "Soumendu Sundar Mukherjee"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Econometrics (econ.EM)",
      "Statistics Theory (math.ST)",
      "Computation (stat.CO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2201.08348",
    "title": "Prediction of the electron density of states for crystalline compounds  with Atomistic Line Graph Neural Networks (ALIGNN)",
    "abstract": "Machine learning (ML) based models have greatly enhanced the traditional materials discovery and design pipeline. Specifically, in recent years, surrogate ML models for material property prediction have demonstrated success in predicting discrete scalar-valued target properties to within reasonable accuracy of their DFT-computed values. However, accurate prediction of spectral targets such as the electron Density of States (DOS) poses a much more challenging problem due to the complexity of the target, and the limited amount of available training data. In this study, we present an extension of the recently developed Atomistic Line Graph Neural Network (ALIGNN) to accurately predict DOS of a large set of material unit cell structures, trained to the publicly available JARVIS-DFT dataset. Furthermore, we evaluate two methods of representation of the target quantity - a direct discretized spectrum, and a compressed low-dimensional representation obtained using an autoencoder. Through this work, we demonstrate the utility of graph-based featurization and modeling methods in the prediction of complex targets that depend on both chemistry and directional characteristics of material structures. ",
    "url": "https://arxiv.org/abs/2201.08348",
    "authors": [
      "Prathik R Kaundinya",
      "Kamal Choudhary",
      "Surya R. Kalidindi"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)",
      "Atomic and Molecular Clusters (physics.atm-clus)"
    ]
  },
  {
    "id": "arXiv:2201.08363",
    "title": "Physics-informed neural networks for modeling rate- and  temperature-dependent plasticity",
    "abstract": "This work presents a physics-informed neural network based framework to model the strain-rate and temperature dependence of the deformation fields (displacement, stress, plastic strain) in elastic-viscoplastic solids. A detailed discussion on the construction of the physics-based loss criterion along with a brief outline on ways to avoid unbalanced back-propagated gradients during training is also presented. We also present a simple strategy with no added computational complexity for choosing scalar weights that balance the interplay between different terms in the composite loss. Moreover, we also highlight a fundamental challenge involving selection of appropriate model outputs so that the mechanical problem can be faithfully solved using neural networks. Finally, the effectiveness of the proposed framework is demonstrated by studying two test problems modeling the elastic-viscoplastic deformation in solids at different strain-rates and temperatures, respectively. ",
    "url": "https://arxiv.org/abs/2201.08363",
    "authors": [
      "Rajat Arora",
      "Pratik Kakkar",
      "Biswadip Dey",
      "Amit Chakraborty"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1903.09668",
    "title": "Data Augmentation for Bayesian Deep Learning",
    "abstract": " Title: Data Augmentation for Bayesian Deep Learning ",
    "url": "https://arxiv.org/abs/1903.09668",
    "authors": [
      "Yuexi Wang",
      "Nicholas G. Polson",
      "Vadim O. Sokolov"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2003.00470",
    "title": "Dimensionality reduction to maximize prediction generalization  capability",
    "abstract": " Title: Dimensionality reduction to maximize prediction generalization  capability ",
    "url": "https://arxiv.org/abs/2003.00470",
    "authors": [
      "Takuya Isomura",
      "Taro Toyoizumi"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2006.14221",
    "title": "Modeling Baroque Two-Part Counterpoint with Neural Machine Translation",
    "abstract": " Comments: International Computer Music Conference 2021, 5 pages ",
    "url": "https://arxiv.org/abs/2006.14221",
    "authors": [
      "Eric P. Nichols",
      "Stefano Kalonaris",
      "Gianluca Micchi",
      "Anna Aljanaki"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2008.09004",
    "title": "Solving Problems on Generalized Convex Graphs via Mim-Width",
    "abstract": " Title: Solving Problems on Generalized Convex Graphs via Mim-Width ",
    "url": "https://arxiv.org/abs/2008.09004",
    "authors": [
      "Flavia Bonomo-Braberman",
      "Nick Brettell",
      "Andrea Munaro",
      "Daniël Paulusma"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2012.06737",
    "title": "Computer Vision and Normalizing Flow-Based Defect Detection",
    "abstract": " Title: Computer Vision and Normalizing Flow-Based Defect Detection ",
    "url": "https://arxiv.org/abs/2012.06737",
    "authors": [
      "Zijian Kuang",
      "Xinran Tie",
      "Lihang Ying",
      "Shi Jin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2102.08573",
    "title": "Robust Mean Estimation in High Dimensions: An Outlier Fraction Agnostic  and Efficient Algorithm",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2008.09239 ",
    "url": "https://arxiv.org/abs/2102.08573",
    "authors": [
      "Aditya Deshmukh",
      "Jing Liu",
      "Venugopal V. Veeravalli"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2103.04710",
    "title": "Cluster-based Input Weight Initialization for Echo State Networks",
    "abstract": " Comments: Accepted for publication in IEEE Transactions on Neural Network and Learning System (TNNLS), 2022 ",
    "url": "https://arxiv.org/abs/2103.04710",
    "authors": [
      "Peter Steiner",
      "Azarakhsh Jalalvand",
      "Peter Birkholz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2103.06417",
    "title": "3D Head-Position Prediction in First-Person View by Considering Head  Pose for Human-Robot Eye Contact",
    "abstract": " Comments: Accepted to the 17th ACM/IEEE International Conference on Human-Robot Interaction Late-Breaking Reports (HRI 2022 LBR) ",
    "url": "https://arxiv.org/abs/2103.06417",
    "authors": [
      "Yuki Tamaru",
      "Yasunori Ozaki",
      "Yuki Okafuji",
      "Junya Nakanishi",
      "Yuichiro Yoshikawa",
      "Jun Baba"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2103.06725",
    "title": "Duplex Contextual Relation Network for Polyp Segmentation",
    "abstract": " Comments: Accepted to ISBI2022 ",
    "url": "https://arxiv.org/abs/2103.06725",
    "authors": [
      "Zijin Yin",
      "Kongming Liang",
      "Zhanyu Ma",
      "Jun Guo"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2103.09660",
    "title": "Scalable Hypergraph Embedding System",
    "abstract": " Comments: Accepted for publication at NetSciX 2022 ",
    "url": "https://arxiv.org/abs/2103.09660",
    "authors": [
      "Sepideh Maleki",
      "Donya Saless",
      "Dennis P. Wall",
      "Keshav Pingali"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.13239",
    "title": "What's Kooking? Characterizing India's Emerging Social Network, Koo",
    "abstract": " Comments: 9 pages, 11 figures, 6 tables ",
    "url": "https://arxiv.org/abs/2103.13239",
    "authors": [
      "Asmit Kumar Singh",
      "Chirag Jain",
      "Jivitesh Jain",
      "Rishi Raj Jain",
      "Shradha Sehgal",
      "Tanisha Pandey",
      "Ponnurangam Kumaraguru"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2103.16201",
    "title": "MT3: Meta Test-Time Training for Self-Supervised Test-Time Adaption",
    "abstract": " Title: MT3: Meta Test-Time Training for Self-Supervised Test-Time Adaption ",
    "url": "https://arxiv.org/abs/2103.16201",
    "authors": [
      "Alexander Bartler",
      "Andre Bühler",
      "Felix Wiewel",
      "Mario Döbler",
      "Bin Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2106.01282",
    "title": "Spectral embedding for dynamic networks with stability guarantees",
    "abstract": " Comments: NeurIPS 2021 ",
    "url": "https://arxiv.org/abs/2106.01282",
    "authors": [
      "Ian Gallagher",
      "Andrew Jones",
      "Patrick Rubin-Delanchy"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.09659",
    "title": "Robustness and Consistency in Linear Quadratic Control with Predictions",
    "abstract": " Comments: 34 pages, 8 figures, ACM SIGMETRICS 2022 ",
    "url": "https://arxiv.org/abs/2106.09659",
    "authors": [
      "Tongxin Li",
      "Ruixiao Yang",
      "Guannan Qu",
      "Guanya Shi",
      "Chenkai Yu",
      "Adam Wierman",
      "Steven Low"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2107.02612",
    "title": "Combining EfficientNet and Vision Transformers for Video Deepfake  Detection",
    "abstract": " Title: Combining EfficientNet and Vision Transformers for Video Deepfake  Detection ",
    "url": "https://arxiv.org/abs/2107.02612",
    "authors": [
      "Davide Coccomini",
      "Nicola Messina",
      "Claudio Gennaro",
      "Fabrizio Falchi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.04267",
    "title": "Can We Replicate Real Human Behaviour Using Artificial Neural Networks?",
    "abstract": " Title: Can We Replicate Real Human Behaviour Using Artificial Neural Networks? ",
    "url": "https://arxiv.org/abs/2107.04267",
    "authors": [
      "Georg Jäger",
      "Daniel Reisinger"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2107.06621",
    "title": "Rough McKean-Vlasov dynamics for robust ensemble Kalman filtering",
    "abstract": " Comments: 44 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2107.06621",
    "authors": [
      "Michele Coghi",
      "Torstein Nilssen",
      "Nikolas Nüsken",
      "Sebastian Reich"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Numerical Analysis (math.NA)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2107.12612",
    "title": "Poisoning Online Learning Filters: DDoS Attacks and Countermeasures",
    "abstract": " Title: Poisoning Online Learning Filters: DDoS Attacks and Countermeasures ",
    "url": "https://arxiv.org/abs/2107.12612",
    "authors": [
      "Wesley Joon-Wie Tann",
      "Ee-Chien Chang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2108.00687",
    "title": "Efficient simulation of coupled gas and power networks under uncertain  demands",
    "abstract": " Comments: 32 pages, 18 figures ",
    "url": "https://arxiv.org/abs/2108.00687",
    "authors": [
      "E. Fokken",
      "S. Göttlich",
      "M. Herty"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2108.01110",
    "title": "Batch Normalization Preconditioning for Neural Network Training",
    "abstract": " Title: Batch Normalization Preconditioning for Neural Network Training ",
    "url": "https://arxiv.org/abs/2108.01110",
    "authors": [
      "Susanna Lange",
      "Kyle Helfrich",
      "Qiang Ye"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2108.01192",
    "title": "MOHAQ: Multi-Objective Hardware-Aware Quantization of Recurrent Neural  Networks",
    "abstract": " Title: MOHAQ: Multi-Objective Hardware-Aware Quantization of Recurrent Neural  Networks ",
    "url": "https://arxiv.org/abs/2108.01192",
    "authors": [
      "Nesma M. Rezk",
      "Tomas Nordström",
      "Dimitrios Stathis",
      "Zain Ul-Abdin",
      "Eren Erdal Aksoy",
      "Ahmed Hemani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2108.04729",
    "title": "Spectral Robustness for Correlation Clustering Reconstruction in  Semi-Adversarial Models",
    "abstract": " Title: Spectral Robustness for Correlation Clustering Reconstruction in  Semi-Adversarial Models ",
    "url": "https://arxiv.org/abs/2108.04729",
    "authors": [
      "Flavio Chierichetti",
      "Alessandro Panconesi",
      "Giuseppe Re",
      "Luca Trevisan"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.13400",
    "title": "Nonlinear material identification of heterogeneous isogeometric  Kirchhoff-Love shells",
    "abstract": " Comments: 37 pages, 18 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2108.13400",
    "authors": [
      "Bartosz Borzeszkowski",
      "Izabela Lubowiecka",
      "Roger A. Sauer"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2109.00909",
    "title": "Sparsifying the Update Step in Graph Neural Networks",
    "abstract": " Comments: 14 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2109.00909",
    "authors": [
      "Johannes F. Lutzeyer",
      "Changmin Wu",
      "Michalis Vazirgiannis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2109.01485",
    "title": "MitoDet: Simple and robust mitosis detection",
    "abstract": " Comments: Corrected typos ",
    "url": "https://arxiv.org/abs/2109.01485",
    "authors": [
      "Jakob Dexl",
      "Michaela Benz",
      "Volker Bruns",
      "Petr Kuritcyn",
      "Thomas Wittenberg"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.01785",
    "title": "Node Feature Kernels Increase Graph Convolutional Network Robustness",
    "abstract": " Comments: 16 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2109.01785",
    "authors": [
      "Mohamed El Amine Seddik",
      "Changmin Wu",
      "Johannes F. Lutzeyer",
      "Michalis Vazirgiannis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2109.04353",
    "title": "Cross DQN: Cross Deep Q Network for Ads Allocation in Feed",
    "abstract": " Comments: Accepted by WWW-22 ",
    "url": "https://arxiv.org/abs/2109.04353",
    "authors": [
      "Guogang Liao",
      "Ze Wang",
      "Xiaoxu Wu",
      "Xiaowen Shi",
      "Chuheng Zhang",
      "Yongkang Wang",
      "Xingxing Wang",
      "Dong Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.04797",
    "title": "Mesh convolutional neural networks for wall shear stress estimation in  3D artery models",
    "abstract": " Comments: (MICCAI 2021) Workshop on Statistical Atlases and Computational Modelling of the Heart (STACOM). The final authenticated version is available on SpringerLink ",
    "url": "https://arxiv.org/abs/2109.04797",
    "authors": [
      "Julian Suk",
      "Pim de Haan",
      "Phillip Lippe",
      "Christoph Brune",
      "Jelmer M. Wolterink"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2110.02128",
    "title": "NeurWIN: Neural Whittle Index Network For Restless Bandits Via Deep RL",
    "abstract": " Comments: Accepted for publication in NeurIPS 2021 ",
    "url": "https://arxiv.org/abs/2110.02128",
    "authors": [
      "Khaled Nakhleh",
      "Santosh Ganji",
      "Ping-Chun Hsieh",
      "I-Hong Hou",
      "Srinivas Shakkottai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.02670",
    "title": "S-Extension Patch: A simple and efficient way to extend an object  detection model",
    "abstract": " Comments: Accepted and presented at ICDSMLA 2021. Proceedings to be published with Springer ",
    "url": "https://arxiv.org/abs/2110.02670",
    "authors": [
      "Dishant Parikh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.03234",
    "title": "Self-Supervised Depth Completion for Active Stereo",
    "abstract": " Comments: Accepted to RAL-ICRA 21 ",
    "url": "https://arxiv.org/abs/2110.03234",
    "authors": [
      "Frederik Warburg",
      "Daniel Hernandez-Juarez",
      "Juan Tarrio",
      "Alexander Vakhitov",
      "Ujwal Bonde",
      "Pablo F. Alcantarilla"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.04699",
    "title": "Toward Ubiquitous and Flexible Coverage of UAV-IRS-Assisted NOMA  Networks",
    "abstract": " Comments: 6 pages; 3 figures; conference ",
    "url": "https://arxiv.org/abs/2110.04699",
    "authors": [
      "Chun-Hung Liu",
      "Md Asif Syed",
      "Lu Wei"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2110.06623",
    "title": "SSSNET: Semi-Supervised Signed Network Clustering",
    "abstract": " Comments: 14 pages ",
    "url": "https://arxiv.org/abs/2110.06623",
    "authors": [
      "Yixuan He",
      "Gesine Reinert",
      "Songchao Wang",
      "Mihai Cucuringu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.06991",
    "title": "Scalable Graph Embedding LearningOn A Single GPU",
    "abstract": " Comments: Co-authors whose names were not included have asked for withdrawal ",
    "url": "https://arxiv.org/abs/2110.06991",
    "authors": [
      "Azita Nouri",
      "Philip E. Davis",
      "Pradeep Subedi",
      "Manish Parashar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2110.12399",
    "title": "BINAS: Bilinear Interpretable Neural Architecture Search",
    "abstract": " Comments: The full code is released at this https URL ",
    "url": "https://arxiv.org/abs/2110.12399",
    "authors": [
      "Niv Nayman",
      "Yonathan Aflalo",
      "Asaf Noy",
      "Rong Jin",
      "Lihi Zelnik-Manor"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.13716",
    "title": "HIST: A Graph-based Framework for Stock Trend Forecasting via Mining  Concept-Oriented Shared Information",
    "abstract": " Title: HIST: A Graph-based Framework for Stock Trend Forecasting via Mining  Concept-Oriented Shared Information ",
    "url": "https://arxiv.org/abs/2110.13716",
    "authors": [
      "Wentao Xu",
      "Weiqing Liu",
      "Lewen Wang",
      "Yingce Xia",
      "Jiang Bian",
      "Jian Yin",
      "Tie-Yan Liu"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.08118",
    "title": "Neuro-Hotnet: A Graph Theoretic Approach for Brain FC Estimation",
    "abstract": " Comments: 36 pages, 10 figures, 3 tables, 2 algorithms ",
    "url": "https://arxiv.org/abs/2111.08118",
    "authors": [
      "Nathan Tung",
      "Eli Upfal",
      "Jerome Sanes",
      "Ani Eloyan"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Social and Information Networks (cs.SI)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2111.11430",
    "title": "Multi-modal Transformers Excel at Class-agnostic Object Detection",
    "abstract": " Title: Multi-modal Transformers Excel at Class-agnostic Object Detection ",
    "url": "https://arxiv.org/abs/2111.11430",
    "authors": [
      "Muhammad Maaz",
      "Hanoona Rasheed",
      "Salman Khan",
      "Fahad Shahbaz Khan",
      "Rao Muhammad Anwer",
      "Ming-Hsuan Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.11966",
    "title": "Social Graph Restoration via Random Walk Sampling",
    "abstract": " Comments: 17 pages, 4 figures, 5 tables. To appear in 38th IEEE International Conference on Data Engineering (IEEE ICDE 2022) ",
    "url": "https://arxiv.org/abs/2111.11966",
    "authors": [
      "Kazuki Nakajima",
      "Kazuyuki Shudo"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2112.07611",
    "title": "Speeding up Learning Quantum States through Group Equivariant  Convolutional Quantum Ansätze",
    "abstract": " Comments: 16 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2112.07611",
    "authors": [
      "Han Zheng",
      "Zimu Li",
      "Junyu Liu",
      "Sergii Strelchuk",
      "Risi Kondor"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Mathematical Physics (math-ph)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.08055",
    "title": "Building separable approximations for quantum states via neural networks",
    "abstract": " Comments: 12 pages, 5 figures We welcome any comments on references for Tables 1 and 2. Comments on update: added more results to the figures, more precise numerical results in table 1 and 2, added references and comparison with previous work ",
    "url": "https://arxiv.org/abs/2112.08055",
    "authors": [
      "Antoine Girardin",
      "Nicolas Brunner",
      "Tamás Kriváchy"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.11644",
    "title": "Reconstructing public engagement from social media content volume",
    "abstract": " Title: Reconstructing public engagement from social media content volume ",
    "url": "https://arxiv.org/abs/2112.11644",
    "authors": [
      "Sebastián Pinto",
      "Marcos Trevisan",
      "Pablo Balenzuela"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2201.01815",
    "title": "An Evaluation Study of Generative Adversarial Networks for Collaborative  Filtering",
    "abstract": " Title: An Evaluation Study of Generative Adversarial Networks for Collaborative  Filtering ",
    "url": "https://arxiv.org/abs/2201.01815",
    "authors": [
      "Fernando Benjamín Pérez Maurera",
      "Maurizio Ferrari Dacrema",
      "Paolo Cremonesi"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.04286",
    "title": "Evolutionary Action Selection for Gradient-based Policy Learning",
    "abstract": " Title: Evolutionary Action Selection for Gradient-based Policy Learning ",
    "url": "https://arxiv.org/abs/2201.04286",
    "authors": [
      "Yan Ma",
      "Tianxing Liu",
      "Bingsheng Wei",
      "Yi Liu",
      "Kang Xu",
      "Wei Li"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.04569",
    "title": "Get your Foes Fooled: Proximal Gradient Split Learning for Defense  against Model Inversion Attacks on IoMT data",
    "abstract": " Comments: 9 pages, 5 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2201.04569",
    "authors": [
      "Sunder Ali Khowaja",
      "Ik Hyun Lee",
      "Kapal Dev",
      "Muhammad Aslam Jarwar",
      "Nawab Muhammad Faseeh Qureshi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.04812",
    "title": "Unsupervised Domain Adaptation for Cross-Modality Retinal Vessel  Segmentation via Disentangling Representation Style Transfer and  Collaborative Consistency Learning",
    "abstract": " Comments: To be published in ISBI 2022 ",
    "url": "https://arxiv.org/abs/2201.04812",
    "authors": [
      "Linkai Peng",
      "Li Lin",
      "Pujin Cheng",
      "Ziqi Huang",
      "Xiaoying Tang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.05773",
    "title": "Automated causal inference in application to randomized controlled  clinical trials",
    "abstract": " Comments: Submitted to Nature Machine Intelligence. The code is publicly available via this https URL ",
    "url": "https://arxiv.org/abs/2201.05773",
    "authors": [
      "Jiqing Wu",
      "Nanda Horeweg",
      "Marco de Bruyn",
      "Remi A. Nout",
      "Ina M. Jürgenliemk-Schulz",
      "Ludy C.H.W. Lutgens",
      "Jan J. Jobsen",
      "Elzbieta M. van der Steen-Banasik",
      "Hans W. Nijman",
      "Vincent T.H.B.M. Smit",
      "Tjalling Bosse",
      "Carien L. Creutzberg",
      "Viktor H. Koelzer"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.06321",
    "title": "Landscape of Neural Architecture Search across sensors: how much do they  differ ?",
    "abstract": " Comments: This work is under review for a conference publication ",
    "url": "https://arxiv.org/abs/2201.06321",
    "authors": [
      "Kalifou René Traoré",
      "Andrés Camero",
      "Xiao Xiang Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2201.07263",
    "title": "Health Advertising on Facebook: Privacy & Policy Considerations",
    "abstract": " Comments: 21 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2201.07263",
    "authors": [
      "Andrea Downing",
      "Eric Perakslis"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2201.07365",
    "title": "Improving Neural Machine Translation by Denoising Training",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2109.07780 ",
    "url": "https://arxiv.org/abs/2201.07365",
    "authors": [
      "Liang Ding",
      "Keqin Peng",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2201.07521",
    "title": "ThorFI: A Novel Approach for Network Fault Injection as a Service",
    "abstract": " Comments: 21 pages, accepted for publication in Elsevier Journal of Networking and Computer Applications ",
    "url": "https://arxiv.org/abs/2201.07521",
    "authors": [
      "Domenico Cotroneo",
      "Luigi De Simone",
      "Roberto Natella"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2201.07537",
    "title": "Graph Neural Network-based Android Malware Classification with Jumping  Knowledge",
    "abstract": " Comments: 9 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2201.07537",
    "authors": [
      "Wai Weng Lo",
      "Siamak Layeghy",
      "Mohanad Sarhan",
      "Marcus Gallagher",
      "Marius Portmann"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  }
]