[
  {
    "id": "arXiv:2107.08194",
    "title": "Towards autonomic orchestration of machine learning pipelines in future  networks",
    "abstract": "Machine learning (ML) techniques are being increasingly used in mobile networks for network planning, operation, management, optimisation and much more. These techniques are realised using a set of logical nodes known as ML pipeline. A single network operator might have thousands of such ML pipelines distributed across its network. These pipelines need to be managed and orchestrated across network domains. Thus it is essential to have autonomic multi-domain orchestration of ML pipelines in mobile networks. International Telecommunications Union (ITU) has provided an architectural framework for management and orchestration of ML pipelines in future networks. We extend this framework to enable autonomic orchestration of ML pipelines across multiple network domains. We present our system architecture and describe its application using a smart factory use case. Our work allows autonomic orchestration of multi-domain ML pipelines in a standardised, technology agnostic, privacy preserving fashion. ",
    "url": "https://arxiv.org/abs/2107.08194",
    "authors": [
      "Abhishek Dandekar"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.08347",
    "title": "Beyond a binary of (non)racist tweets: A four-dimensional categorical  detection and analysis of racist and xenophobic opinions on Twitter in early  Covid-19",
    "abstract": "Transcending the binary categorization of racist and xenophobic texts, this research takes cues from social science theories to develop a four dimensional category for racism and xenophobia detection, namely stigmatization, offensiveness, blame, and exclusion. With the aid of deep learning techniques, this categorical detection enables insights into the nuances of emergent topics reflected in racist and xenophobic expression on Twitter. Moreover, a stage wise analysis is applied to capture the dynamic changes of the topics across the stages of early development of Covid-19 from a domestic epidemic to an international public health emergency, and later to a global pandemic. The main contributions of this research include, first the methodological advancement. By bridging the state-of-the-art computational methods with social science perspective, this research provides a meaningful approach for future research to gain insight into the underlying subtlety of racist and xenophobic discussion on digital platforms. Second, by enabling a more accurate comprehension and even prediction of public opinions and actions, this research paves the way for the enactment of effective intervention policies to combat racist crimes and social exclusion under Covid-19. ",
    "url": "https://arxiv.org/abs/2107.08347",
    "authors": [
      "Xin Pei",
      "Deval Mehta"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2107.08399",
    "title": "A method for estimating the entropy of time series using artificial  neural network",
    "abstract": "Measuring the predictability and complexity of time series is an essential tool in designing and controlling the nonlinear system. There exist different entropy measures in the literature to analyze the predictability and complexity of time series. However, these measures have some drawbacks especially in short time series. To overcome the difficulties, this paper proposes a new method for estimating the entropy of a time series using the LogNNet 784:25:10 neural network model. The LogNNet reservoir matrix consists of 19625 elements which is filled with the time series elements. After that, the network is trained on MNIST-10 dataset and the classification accuracy is calculated. The accuracy is considered as the entropy measure and denoted by NNetEn. A more complex transformation of the input information by the time series in the reservoir leads to higher NNetEn values. Many practical time series data have less than 19625 elements. Some duplicating or stretching methods are investigated to overcome this difficulty and the most successful method is identified for practical applications. The epochs number in the training process of LogNNet is considered as the input parameter. A new time series characteristic called time series learning inertia is introduced to investigate the effect of epochs number in the efficiency of neural network. To show the robustness and efficiency of the proposed method, it is applied on some chaotic, periodic, random, binary and constant time series. The NNetEn is compared with some existing entropy measures. The results show that the proposed method is more robust and accurate than existing methods. ",
    "url": "https://arxiv.org/abs/2107.08399",
    "authors": [
      "Andrei Velichko",
      "Hanif Heidari"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Chaotic Dynamics (nlin.CD)"
    ]
  },
  {
    "id": "arXiv:2107.08471",
    "title": "A stepped sampling method for video detection using LSTM",
    "abstract": "Artificial neural networks that simulate human achieves great successes. From the perspective of simulating human memory method, we propose a stepped sampler based on the \"repeated input\". We repeatedly inputted data to the LSTM model stepwise in a batch. The stepped sampler is used to strengthen the ability of fusing the temporal information in LSTM. We tested the stepped sampler on the LSTM built-in in PyTorch. Compared with the traditional sampler of PyTorch, such as sequential sampler, batch sampler, the training loss of the proposed stepped sampler converges faster in the training of the model, and the training loss after convergence is more stable. Meanwhile, it can maintain a higher test accuracy. We quantified the algorithm of the stepped sampler. ",
    "url": "https://arxiv.org/abs/2107.08471",
    "authors": [
      "Dengshan Li",
      "Rujing Wang",
      "Chengjun Xie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.08480",
    "title": "Efficient algorithms for maximum induced matching problem in permutation  and trapezoid graphs",
    "abstract": "We first design an $\\mathcal{O}(n^2)$ solution for finding a maximum induced matching in permutation graphs given their permutation models, based on a dynamic programming algorithm with the aid of the sweep line technique. With the support of the disjoint-set data structure, we improve the complexity to $\\mathcal{O}(m + n)$. Consequently, we extend this result to give an $\\mathcal{O}(m + n)$ algorithm for the same problem in trapezoid graphs. By combining our algorithms with the current best graph identification algorithms, we can solve the MIM problem in permutation and trapezoid graphs in linear and $\\mathcal{O}(n^2)$ time, respectively. Our results are far better than the best known $\\mathcal{O}(mn)$ algorithm for the maximum induced matching problem in both graph classes, which was proposed by Habib et al. ",
    "url": "https://arxiv.org/abs/2107.08480",
    "authors": [
      "Viet Dung Nguyen",
      "Ba Thai Pham",
      "Phan Thuan Do"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2107.08517",
    "title": "Decentralized federated learning of deep neural networks on non-iid data",
    "abstract": "We tackle the non-convex problem of learning a personalized deep learning model in a decentralized setting. More specifically, we study decentralized federated learning, a peer-to-peer setting where data is distributed among many clients and where there is no central server to orchestrate the training. In real world scenarios, the data distributions are often heterogeneous between clients. Therefore, in this work we study the problem of how to efficiently learn a model in a peer-to-peer system with non-iid client data. We propose a method named Performance-Based Neighbor Selection (PENS) where clients with similar data distributions detect each other and cooperate by evaluating their training losses on each other's data to learn a model suitable for the local data distribution. Our experiments on benchmark datasets show that our proposed method is able to achieve higher accuracies as compared to strong baselines. ",
    "url": "https://arxiv.org/abs/2107.08517",
    "authors": [
      "Noa Onoszko",
      "Gustav Karlsson",
      "Olof Mogren",
      "Edvin Listo Zec"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.08565",
    "title": "Learning point embedding for 3D data processing",
    "abstract": "Among 2D convolutional networks on point clouds, point-based approaches consume point clouds of fixed size directly. By analysis of PointNet, a pioneer in introducing deep learning into point sets, we reveal that current point-based methods are essentially spatial relationship processing networks. In this paper, we take a different approach. Our architecture, named PE-Net, learns the representation of point clouds in high-dimensional space, and encodes the unordered input points to feature vectors, which standard 2D CNNs can be applied to. The recommended network can adapt to changes in the number of input points which is the limit of current methods. Experiments show that in the tasks of classification and part segmentation, PE-Net achieves the state-of-the-art performance in multiple challenging datasets, such as ModelNet and ShapeNetPart. ",
    "url": "https://arxiv.org/abs/2107.08565",
    "authors": [
      "Zhenpeng Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.08610",
    "title": "Design of robust controller applied for series elastic actuators in  controlling humanoid's joint",
    "abstract": "Although the application of Series elastic actuators (SEAs) in the biomechatronic field has proved its appropriation in many aspects so far, the problems of maintaining the stability for the SEAs still remains. This paper proposes a robust controller so that to overcome the drawbacks of the previous researches. Firstly, a mathematical model considering both the SEAs and the hip joint of humanoid UXA-90 is obtained. Secondly, a reference input of the proposed controller that is achieved from desired hip joint's angle in a walking cycle is utilized. Then, a backstepping based sliding mode force control approach is employed to ensure the precise movement of robot's link as well as meeting the requirement of robustness for the whole system, which is significant for the task of walking of a humanoid. Finally, some simulations are carried out to verify the quality and effectiveness of the proposed controller. ",
    "url": "https://arxiv.org/abs/2107.08610",
    "authors": [
      "Anh Khoa Lanh Luu",
      "Van Tu Duong",
      "Huy Hung Nguyen",
      "Sang Bong Kim",
      "Tan Tien Nguyen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2107.08715",
    "title": "RECIST-Net: Lesion detection via grouping keypoints on RECIST-based  annotation",
    "abstract": "Universal lesion detection in computed tomography (CT) images is an important yet challenging task due to the large variations in lesion type, size, shape, and appearance. Considering that data in clinical routine (such as the DeepLesion dataset) are usually annotated with a long and a short diameter according to the standard of Response Evaluation Criteria in Solid Tumors (RECIST) diameters, we propose RECIST-Net, a new approach to lesion detection in which the four extreme points and center point of the RECIST diameters are detected. By detecting a lesion as keypoints, we provide a more conceptually straightforward formulation for detection, and overcome several drawbacks (e.g., requiring extensive effort in designing data-appropriate anchors and losing shape information) of existing bounding-box-based methods while exploring a single-task, one-stage approach compared to other RECIST-based approaches. Experiments show that RECIST-Net achieves a sensitivity of 92.49% at four false positives per image, outperforming other recent methods including those using multi-task learning. ",
    "url": "https://arxiv.org/abs/2107.08715",
    "authors": [
      "Cong Xie",
      "Shilei Cao",
      "Dong Wei",
      "Hongyu Zhou",
      "Kai Ma",
      "Xianli Zhang",
      "Buyue Qian",
      "Liansheng Wang",
      "Yefeng Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.08745",
    "title": "Global random walk solvers for reactive transport and biodegradation  processes in heterogeneous porous media",
    "abstract": "Flow and multicomponent reactive transport in saturated/unsaturated porous media are modeled by ensembles of computational particles moving on regular lattices according to specific random walk rules. The occupation number of the lattice sites is updated with a global random walk (GRW) procedure which simulates the evolution of the ensemble with computational costs comparable to those for a single random walk simulation in sequential procedures. To cope with the nonlinearity and the degeneracy of the Richards equation the GRW flow solver uses linearization techniques similar to the $L$-scheme developed in finite element/volume approaches. Numerical schemes for reactive transport, coupled with the flow solver via numerical solutions for saturation and water flux, are implemented in splitting procedures. Diffusion-advection steps are solved by GRW algorithms using either biased or unbiased random walk probabilities. Since the number of particles in GRW simulations can be as large as the number of molecules involved in chemical reactions, one avoids the cumbersome problem of rescaling particle densities to approximate concentrations. Reaction steps are therefore formulated in terms of concentrations, as in deterministic approaches. The numerical convergence of the new schemes is demonstrated by comparisons with manufactured analytical solutions. Coupled flow and reactive transport problems of contaminant biodegradation described by the Monod model are further solved and the influence of flow nonlinearity/degeneracy and of the spatial heterogeneity of the medium is investigated numerically. ",
    "url": "https://arxiv.org/abs/2107.08745",
    "authors": [
      "Nicolae Suciu",
      "Florin A. Radu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2107.08805",
    "title": "How does a robot's social credibility relate to its perceived  trustworthiness?",
    "abstract": "This position paper aims to highlight and discuss the role of a robot's social credibility in interaction with humans. In particular, I want to explore a potential relation between social credibility and a robot's acceptability and ultimately its trustworthiness. I thereby also review and expand the notion of social credibility as a measure of how well the robot obeys social norms during interaction with the concept of conscious acknowledgement. ",
    "url": "https://arxiv.org/abs/2107.08805",
    "authors": [
      "Patrick Holthaus"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2107.08819",
    "title": "Model-free prediction of emergence of extreme events in a parametrically  driven nonlinear dynamical system by Deep Learning",
    "abstract": "We predict the emergence of extreme events in a parametrically driven nonlinear dynamical system using three Deep Learning models, namely Multi-Layer Perceptron, Convolutional Neural Network and Long Short-Term Memory. The Deep Learning models are trained using the training set and are allowed to predict the test set data. After prediction, the time series of the actual and the predicted values are plotted one over the other in order to visualize the performance of the models. Upon evaluating the Root Mean Square Error value between predicted and the actual values of all three models, we find that the Long Short-Term Memory model can serve as the best model to forecast the chaotic time series and to predict the emergence of extreme events for the considered system. ",
    "url": "https://arxiv.org/abs/2107.08819",
    "authors": [
      "J.Meiyazhagan",
      "S. Sudharsan",
      "M. Senthilvelan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Chaotic Dynamics (nlin.CD)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2107.08849",
    "title": "Exploring the efficacy of neural networks for trajectory compression and  the inverse problem",
    "abstract": "In this document, a neural network is employed in order to estimate the solution of the initial value problem in the context of non linear trajectories. Such trajectories can be subject to gravity, thrust, drag, centrifugal force, temperature, ambient air density and pressure. First, we generate a grid of trajectory points given a specified uniform density as a design parameter and then we investigate the performance of a neural network in a compression and inverse problem task: the network is trained to predict the initial conditions of the dynamics model we used in the simulation, given a target point in space. We investigate this as a regression task, with error propagation in consideration. For target points, up to a radius of 2 kilometers, the model is able to accurately predict the initial conditions of the trajectories, with sub-meter deviation. This simulation-based training process and novel real-world evaluation method is capable of computing trajectories of arbitrary dimensions. ",
    "url": "https://arxiv.org/abs/2107.08849",
    "authors": [
      "Theodoros Ntakouris"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.08946",
    "title": "Using automated decision-making (ADM) to allocate Covid-19 vaccinations?  Exploring the roles of trust and social group preference on the legitimacy of  ADM vs. human decision-making",
    "abstract": "In combating the ongoing global health threat of the Covid-19 pandemic, decision-makers have to take actions based on a multitude of relevant health data with severe potential consequences for the affected patients. Because of their presumed advantages in handling and analyzing vast amounts of data, computer systems of automated decision-making (ADM) are implemented and substitute humans in decision-making processes. In this study, we focus on a specific application of ADM in contrast to human decision-making (HDM), namely the allocation of Covid-19 vaccines to the public. In particular, we elaborate on the role of trust and social group preference on the legitimacy of vaccine allocation. We conducted a survey with a 2x2 randomized factorial design among n=1602 German respondents, in which we utilized distinct decision-making agents (HDM vs. ADM) and prioritization of a specific social group (teachers vs. prisoners) as design factors. Our findings show that general trust in ADM systems and preference for vaccination of a specific social group influence the legitimacy of vaccine allocation. However, contrary to our expectations, trust in the agent making the decision did not moderate the link between social group preference and legitimacy. Moreover, the effect was also not moderated by the type of decision-maker (human vs. algorithm). We conclude that trustworthy ADM systems must not necessarily lead to the legitimacy of ADM systems. ",
    "url": "https://arxiv.org/abs/2107.08946",
    "authors": [
      "Marco Lünich",
      "Kimon Kieslich"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:1910.10562",
    "title": "Nested conformal prediction and quantile out-of-bag ensemble methods",
    "abstract": "Conformal prediction is a popular tool for providing valid prediction sets for classification and regression problems, without relying on any distributional assumptions on the data. While the traditional description of conformal prediction starts with a nonconformity score, we provide an alternate (but equivalent) view that starts with a sequence of nested sets and calibrates them to find a valid prediction set. The nested framework subsumes all nonconformity scores, including recent proposals based on quantile regression and density estimation. While these ideas were originally derived based on sample splitting, our framework seamlessly extends them to other aggregation schemes like cross-conformal, jackknife+ and out-of-bag methods. We use the framework to derive a new algorithm (QOOB, pronounced cube) that combines four ideas: quantile regression, cross-conformalization, ensemble methods and out-of-bag predictions. We develop a computationally efficient implementation of cross-conformal, that is also used by QOOB. In a detailed numerical investigation, QOOB performs either the best or close to the best on all simulated and real datasets. ",
    "url": "https://arxiv.org/abs/1910.10562",
    "authors": [
      "Chirag Gupta",
      "Arun K. Kuchibhotla",
      "Aaditya K. Ramdas"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Artificial Intelligence (cs.AI)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2006.10564",
    "title": "Distribution-free binary classification: prediction sets, confidence  intervals and calibration",
    "abstract": "We study three notions of uncertainty quantification -- calibration, confidence intervals and prediction sets -- for binary classification in the distribution-free setting, that is without making any distributional assumptions on the data. With a focus towards calibration, we establish a 'tripod' of theorems that connect these three notions for score-based classifiers. A direct implication is that distribution-free calibration is only possible, even asymptotically, using a scoring function whose level sets partition the feature space into at most countably many sets. Parametric calibration schemes such as variants of Platt scaling do not satisfy this requirement, while nonparametric schemes based on binning do. To close the loop, we derive distribution-free confidence intervals for binned probabilities for both fixed-width and uniform-mass binning. As a consequence of our 'tripod' theorems, these confidence intervals for binned probabilities lead to distribution-free calibration. We also derive extensions to settings with streaming data and covariate shift. ",
    "url": "https://arxiv.org/abs/2006.10564",
    "authors": [
      "Chirag Gupta",
      "Aleksandr Podkopaev",
      "Aaditya Ramdas"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2107.08649",
    "title": "Non-asymptotic estimates for TUSLA algorithm for non-convex learning  with applications to neural networks with ReLU activation function",
    "abstract": "We consider non-convex stochastic optimization problems where the objective functions have super-linearly growing and discontinuous stochastic gradients. In such a setting, we provide a non-asymptotic analysis for the tamed unadjusted stochastic Langevin algorithm (TUSLA) introduced in Lovas et al. (2021). In particular, we establish non-asymptotic error bounds for the TUSLA algorithm in Wasserstein-1 and Wasserstein-2 distances. The latter result enables us to further derive non-asymptotic estimates for the expected excess risk. To illustrate the applicability of the main results, we consider an example from transfer learning with ReLU neural networks, which represents a key paradigm in machine learning. Numerical experiments are presented for the aforementioned example which supports our theoretical findings. Hence, in this setting, we demonstrate both theoretically and numerically that the TUSLA algorithm can solve the optimization problem involving neural networks with ReLU activation function. Besides, we provide simulation results for synthetic examples where popular algorithms, e.g. ADAM, AMSGrad, RMSProp, and (vanilla) SGD, may fail to find the minimizer of the objective functions due to the super-linear growth and the discontinuity of the corresponding stochastic gradient, while the TUSLA algorithm converges rapidly to the optimal solution. ",
    "url": "https://arxiv.org/abs/2107.08649",
    "authors": [
      "Dong-Young Lim",
      "Ariel Neufeld",
      "Sotirios Sabanis",
      "Ying Zhang"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Probability (math.PR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.09019",
    "title": "A symbiotic relationship: the feasibility of community-scale energy  storage deployed with local network tariffs",
    "abstract": "Distribution networks (DNs) that contain large amounts of distributed energy resources (DER) may experience peer-to-peer power flows between customers. These power flows can create technical challenges and their pricing poses socio-economic questions regarding fairness and equity. This paper demonstrates how these challenges can be addressed in unison by deploying Community-scale Energy Storage (CES) and updating DN pricing structures with a tier of local network tariffs. While both of these interventions have been studied in isolation, we for the first time show how their combination can be symbiotic and resolve the shortcomings that each faces when deployed in isolation - the feasibility of CES is no longer blocked by network tariffs and local network tariffs are no longer a zero-sum trade off between DN operators and customer segments. Our study simulates the operation of a CES under a range of local network tariff models, using current Australian electricity prices and current network prices as a reference. We assess the financial outcomes for solar and non-solar owning customers and the DN operator, as well as the self-sufficiency of the local network and self-consumption of locally generated solar power. Our results establish that it is critical for local network tariffs to be set to less than half the standard distribution network tariff in order for the CES to achieve its full potential and for all stakeholders to benefit. This finding provides clear guidance to regulators and policy makers and promises to make both innovations financially and politically feasible. ",
    "url": "https://arxiv.org/abs/2107.09019",
    "authors": [
      "B. C. P. Sturmberg",
      "M. E. Shaw",
      "C. P. Mediwaththe",
      "H. Ransan-Cooper",
      "B. Weise",
      "M. Thomas",
      "L. Blackhall"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:1810.01161",
    "title": "Sharp bounds for the chromatic number of random Kneser graphs",
    "abstract": " Comments: Thanks to a recent result of Kaiser and Stehlik, Theorem 2 is now in a stronger and essentially sharp form ",
    "url": "https://arxiv.org/abs/1810.01161",
    "authors": [
      "Sergei Kiselev",
      "Andrey Kupavskii"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2004.05410",
    "title": "A lower bound on the saturation number, and graphs for which it is sharp",
    "abstract": " Comments: 10 pages, 2 figures. Fixed a few minor typos from the first version ",
    "url": "https://arxiv.org/abs/2004.05410",
    "authors": [
      "Alex Cameron",
      "Gregory J. Puleo"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2004.09238",
    "title": "The complexity of approximating averages on bounded-degree graphs",
    "abstract": " Comments: Minor update to make \"field gadgets\" bipartite (Lemma 30) ",
    "url": "https://arxiv.org/abs/2004.09238",
    "authors": [
      "Andreas Galanis",
      "Daniel Stefankovic",
      "Eric Vigoda"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2011.07334",
    "title": "Using noise to probe recurrent neural network structure and prune  synapses",
    "abstract": " Title: Using noise to probe recurrent neural network structure and prune  synapses ",
    "url": "https://arxiv.org/abs/2011.07334",
    "authors": [
      "Eli Moore",
      "Rishidev Chaudhuri"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2011.10934",
    "title": "CORAL: Colored structural representation for bi-modal place recognition",
    "abstract": " Title: CORAL: Colored structural representation for bi-modal place recognition ",
    "url": "https://arxiv.org/abs/2011.10934",
    "authors": [
      "Yiyuan Pan",
      "Xuecheng Xu",
      "Weijie Li",
      "Yunxiang Cui",
      "Yue Wang",
      "Rong Xiong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2012.11589",
    "title": "Making transport more robust and interpretable by moving data through a  small number of anchor points",
    "abstract": " Title: Making transport more robust and interpretable by moving data through a  small number of anchor points ",
    "url": "https://arxiv.org/abs/2012.11589",
    "authors": [
      "Chi-Heng Lin",
      "Mehdi Azabou",
      "Eva L. Dyer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.13870",
    "title": "A novel weighted approach for time series forecasting based on  visibility graph",
    "abstract": " Title: A novel weighted approach for time series forecasting based on  visibility graph ",
    "url": "https://arxiv.org/abs/2103.13870",
    "authors": [
      "Tianxiang Zhan",
      "Fuyuan Xiao"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2104.00138",
    "title": "Rapid quantification of COVID-19 pneumonia burden from computed  tomography with convolutional LSTM networks",
    "abstract": " Comments: Fixed some typing mistakes in v2. No other results changed ",
    "url": "https://arxiv.org/abs/2104.00138",
    "authors": [
      "Kajetan Grodecki",
      "Aditya Killekar",
      "Andrew Lin",
      "Sebastien Cadet",
      "Priscilla McElhinney",
      "Aryabod Razipour",
      "Cato Chan",
      "Barry D. Pressman",
      "Peter Julien",
      "Judit Simon",
      "Pal Maurovich-Horvat",
      "Nicola Gaibazzi",
      "Udit Thakur",
      "Elisabetta Mancini",
      "Cecilia Agalbato",
      "Jiro Munechika",
      "Hidenari Matsumoto",
      "Roberto Menè",
      "Gianfranco Parati",
      "Franco Cernigliaro",
      "Nitesh Nerlekar",
      "Camilla Torlasco",
      "Gianluca Pontone",
      "Damini Dey",
      "Piotr J. Slomka"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.00524",
    "title": "Fast mixing via polymers for random graphs with unbounded degree",
    "abstract": " Title: Fast mixing via polymers for random graphs with unbounded degree ",
    "url": "https://arxiv.org/abs/2105.00524",
    "authors": [
      "Andreas Galanis",
      "Leslie Ann Goldberg",
      "James Stewart"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2106.07868",
    "title": "Voting for the right answer: Adversarial defense for speaker  verification",
    "abstract": " Comments: Accepted by Interspeech 2021. Code is available at this https URL ",
    "url": "https://arxiv.org/abs/2106.07868",
    "authors": [
      "Haibin Wu",
      "Yang Zhang",
      "Zhiyong Wu",
      "Dong Wang",
      "Hung-yi Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2106.13155",
    "title": "Splitting EUD graphs into trees: A quick and clatty approach",
    "abstract": " Comments: IWPT 2021 Shared Task system description. To be published in proceedings of the 17th International Conference on Parsing Technologies ",
    "url": "https://arxiv.org/abs/2106.13155",
    "authors": [
      "Mark Anderson",
      "Carlos Gómez-Rodríguez"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2107.05595",
    "title": "Coloring graphs with forbidden bipartite subgraphs",
    "abstract": " Comments: 21 pp ",
    "url": "https://arxiv.org/abs/2107.05595",
    "authors": [
      "James Anderson",
      "Anton Bernshteyn",
      "Abhishek Dhawan"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  }
]