[
  {
    "id": "arXiv:2106.10319",
    "title": "A system of vision sensor based deep neural networks for complex driving  scene analysis in support of crash risk assessment and prevention",
    "abstract": "To assist human drivers and autonomous vehicles in assessing crash risks, driving scene analysis using dash cameras on vehicles and deep learning algorithms is of paramount importance. Although these technologies are increasingly available, driving scene analysis for this purpose still remains a challenge. This is mainly due to the lack of annotated large image datasets for analyzing crash risk indicators and crash likelihood, and the lack of an effective method to extract lots of required information from complex driving scenes. To fill the gap, this paper develops a scene analysis system. The Multi-Net of the system includes two multi-task neural networks that perform scene classification to provide four labels for each scene. The DeepLab v3 and YOLO v3 are combined by the system to detect and locate risky pedestrians and the nearest vehicles. All identified information can provide the situational awareness to autonomous vehicles or human drivers for identifying crash risks from the surrounding traffic. To address the scarcity of annotated image datasets for studying traffic crashes, two completely new datasets have been developed by this paper and made available to the public, which were proved to be effective in training the proposed deep neural networks. The paper further evaluates the performance of the Multi-Net and the efficiency of the developed system. Comprehensive scene analysis is further illustrated with representative examples. Results demonstrate the effectiveness of the developed system and datasets for driving scene analysis, and their supportiveness for crash risk assessment and crash prevention. ",
    "url": "https://arxiv.org/abs/2106.10319",
    "authors": [
      "Muhammad Monjurul Karim",
      "Yu Li",
      "Ruwen Qin",
      "Zhaozheng Yin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2106.10406",
    "title": "Improving robustness of one-shot voice conversion with deep  discriminative speaker encoder",
    "abstract": "One-shot voice conversion has received significant attention since only one utterance from source speaker and target speaker respectively is required. Moreover, source speaker and target speaker do not need to be seen during training. However, available one-shot voice conversion approaches are not stable for unseen speakers as the speaker embedding extracted from one utterance of an unseen speaker is not reliable. In this paper, we propose a deep discriminative speaker encoder to extract speaker embedding from one utterance more effectively. Specifically, the speaker encoder first integrates residual network and squeeze-and-excitation network to extract discriminative speaker information in frame level by modeling frame-wise and channel-wise interdependence in features. Then attention mechanism is introduced to further emphasize speaker related information via assigning different weights to frame level speaker information. Finally a statistic pooling layer is used to aggregate weighted frame level speaker information to form utterance level speaker embedding. The experimental results demonstrate that our proposed speaker encoder can improve the robustness of one-shot voice conversion for unseen speakers and outperforms baseline systems in terms of speech quality and speaker similarity. ",
    "url": "https://arxiv.org/abs/2106.10406",
    "authors": [
      "Hongqiang Du",
      "Lei Xie"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2106.10420",
    "title": "Finding critical edges in complex networks through local information",
    "abstract": "In transportation, communication, social and other real networks, there are some critical edges play an important role in the delivery of traffic flow and information packets. Identifying critical edges in complex networks is of great significance in both theoretical studies and practical applications. Considering the overlap of communities in the neighborhood of edges, a novel and effective index named subgraph overlap (SO) is proposed in this paper. Experimental results on one synthetic and eight real networks show that SO outperforms five benchmark methods in identifying critical edges which are crucial in maintaining the integrity of the structure and functions of networks. ",
    "url": "https://arxiv.org/abs/2106.10420",
    "authors": [
      "En-Yu Yu",
      "Yan Fu",
      "Jun-Lin Zhou",
      "Hong-Liang Sun",
      "Duan-Bing Chen"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2106.10470",
    "title": "Isogeometric de Rham complex discretization in solid toroidal domains",
    "abstract": "In this work we define a spline complex preserving the cohomological structure of the continuous de Rham complex when the underlying physical domain is a toroidal solid. In the spirit of the isogeometric analysis, the spaces involved will be defined as pushforward of suitable spline spaces on a parametric domain. The singularity of the parametrization of the solid will demand the imposition of smoothness constraints on the full tensor product spline spaces in the parametric domain to properly set up the discrete complex on the physical domain. ",
    "url": "https://arxiv.org/abs/2106.10470",
    "authors": [
      "Francesco Patrizi"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2106.10476",
    "title": "Neural network interpretability for forecasting of aggregated renewable  generatiion",
    "abstract": "With the rapid growth of renewable energy, lots of small photovoltaic (PV) prosumers emerge. Due to the uncertainty of solar power generation, there is a need for aggregated prosumers to predict solar power generation and whether solar power generation will be larger than load. This paper presents two interpretable neural networks to solve the problem: one binary classification neural network and one regression neural network. The neural networks are built using TensorFlow. The global feature importance and local feature contributions are examined by three gradient-based methods: Integrated Gradients, Expected Gradients, and DeepLIFT. Moreover, we detect abnormal cases when predictions might fail by estimating the prediction uncertainty using Bayesian neural networks. Neural networks, which are interpreted by gradient-based methods and complemented with uncertainty estimation, provide robust and explainable forecasting for decision-makers. ",
    "url": "https://arxiv.org/abs/2106.10476",
    "authors": [
      "Yucun Lu",
      "Ilgiz Murzakhanov",
      "Spyros Chatzivasileiadis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.10485",
    "title": "Hybrid approach to detecting symptoms of depression in social media  entries",
    "abstract": "Sentiment and lexical analyses are widely used to detect depression or anxiety disorders. It has been documented that there are significant differences in the language used by a person with emotional disorders in comparison to a healthy individual. Still, the effectiveness of these lexical approaches could be improved further because the current analysis focuses on what the social media entries are about, and not how they are written. In this study, we focus on aspects in which these short texts are similar to each other, and how they were created. We present an innovative approach to the depression screening problem by applying Collgram analysis, which is a known effective method of obtaining linguistic information from texts. We compare these results with sentiment analysis based on the BERT architecture. Finally, we create a hybrid model achieving a diagnostic accuracy of 71%. ",
    "url": "https://arxiv.org/abs/2106.10485",
    "authors": [
      "Agnieszka Wołk",
      "Karol Chlasta",
      "Paweł Holas"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.10592",
    "title": "ExplorerTree: a focus+context exploration approach for 2D embedding",
    "abstract": "In exploratory tasks involving high-dimensional datasets, dimensionality reduction (DR) techniques help analysts to discover patterns and other useful information. Although scatter plot representations of DR results allow for cluster identification and similarity analysis, such a visual metaphor presents problems when the number of instances of the dataset increases, resulting in cluttered visualizations. In this work, we propose a scatter plot-based multilevel approach to display DR results and address clutter-related problems when visualizing large datasets, together with the definition of a methodology to use focus+context interaction on non-hierarchical embeddings. The proposed technique, called ExplorerTree, uses a sampling selection technique on scatter plots to reduce visual clutter and guide users through exploratory tasks. We demonstrate ExplorerTree's effectiveness through a use case, where we visually explore activation images of the convolutional layers of a neural network. Finally, we also conducted a user experiment to evaluate ExplorerTree's ability to convey embedding structures using different sampling strategies. ",
    "url": "https://arxiv.org/abs/2106.10592",
    "authors": [
      "Wilson E. Marcílio-Jr",
      "Danilo M. Eler",
      "Fernando V. Paulovich",
      "José F. Rodrigues-Jr",
      "Almir O. Artero"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2106.10685",
    "title": "MILP, pseudo-boolean, and OMT solvers for optimal fault-tolerant  placements of relay nodes in mission critical wireless networks",
    "abstract": "In critical infrastructures like airports, much care has to be devoted in protecting radio communication networks from external electromagnetic interference. Protection of such mission-critical radio communication networks is usually tackled by exploiting radiogoniometers: at least three suitably deployed radiogoniometers, and a gateway gathering information from them, permit to monitor and localise sources of electromagnetic emissions that are not supposed to be present in the monitored area. Typically, radiogoniometers are connected to the gateway through relay nodes. As a result, some degree of fault-tolerance for the network of relay nodes is essential in order to offer a reliable monitoring. On the other hand, deployment of relay nodes is typically quite expensive. As a result, we have two conflicting requirements: minimise costs while guaranteeing a given fault-tolerance. In this paper, we address the problem of computing a deployment for relay nodes that minimises the relay node network cost while at the same time guaranteeing proper working of the network even when some of the relay nodes (up to a given maximum number) become faulty (fault-tolerance). We show that, by means of a computation-intensive pre-processing on a HPC infrastructure, the above optimisation problem can be encoded as a 0/1 Linear Program, becoming suitable to be approached with standard Artificial Intelligence reasoners like MILP, PB-SAT, and SMT/OMT solvers. Our problem formulation enables us to present experimental results comparing the performance of these three solving technologies on a real case study of a relay node network deployment in areas of the Leonardo da Vinci Airport in Rome, Italy. ",
    "url": "https://arxiv.org/abs/2106.10685",
    "authors": [
      "Quian Matteo Chen",
      "Alberto Finzi",
      "Toni Mancini",
      "Igor Melatti",
      "Enrico Tronci"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Logic in Computer Science (cs.LO)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2106.10716",
    "title": "Machine learning in the social and health sciences",
    "abstract": "The uptake of machine learning (ML) approaches in the social and health sciences has been rather slow, and research using ML for social and health research questions remains fragmented. This may be due to the separate development of research in the computational/data versus social and health sciences as well as a lack of accessible overviews and adequate training in ML techniques for non data science researchers. This paper provides a meta-mapping of research questions in the social and health sciences to appropriate ML approaches, by incorporating the necessary requirements to statistical analysis in these disciplines. We map the established classification into description, prediction, and causal inference to common research goals, such as estimating prevalence of adverse health or social outcomes, predicting the risk of an event, and identifying risk factors or causes of adverse outcomes. This meta-mapping aims at overcoming disciplinary barriers and starting a fluid dialogue between researchers from the social and health sciences and methodologically trained researchers. Such mapping may also help to fully exploit the benefits of ML while considering domain-specific aspects relevant to the social and health sciences, and hopefully contribute to the acceleration of the uptake of ML applications to advance both basic and applied social and health sciences research. ",
    "url": "https://arxiv.org/abs/2106.10716",
    "authors": [
      "Anja K. Leist",
      "Matthias Klee",
      "Jung Hyun Kim",
      "David H. Rehkopf",
      "Stéphane P. A. Bordas",
      "Graciela Muniz-Terrera",
      "Sara Wade"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.10753",
    "title": "Opportunities and challenges in partitioning the graph measure space of  real-world networks",
    "abstract": "Based on a large dataset containing thousands of real-world networks ranging from genetic, protein interaction, and metabolic networks to brain, language, ecology, and social networks we search for defining structural measures of the different complex network domains (CND). We calculate 208 measures for all networks and using a comprehensive and scrupulous workflow of statistical and machine learning methods we investigated the limitations and possibilities of identifying the key graph measures of CNDs. Our approach managed to identify well distinguishable groups of network domains and confer their relevant features. These features turn out to be CND specific and not unique even at the level of individual CNDs. The presented methodology may be applied to other similar scenarios involving highly unbalanced and skewed datasets. ",
    "url": "https://arxiv.org/abs/2106.10753",
    "authors": [
      "Máté Józsa",
      "Alpár S. Lázár",
      "Zsolt I. Lázár"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2106.10775",
    "title": "Covariance Matching based robust Adaptive Cubature Kalman Filter",
    "abstract": "This letter explores covariance matching-based adaptive robust cubature Kalman filter (CMRACKF). In this method, the innovation sequence is used to determine the covariance matrix of measurement noise that can overcome the limitation of conventional CKF. In the proposed algorithm, weights are adaptively adjusted and used for updating the measurement noise covariance matrices online. It can also enhance the adaptive capability of the ACKF. The simulation results are illustrated to evaluate the performance of the proposed algorithm. ",
    "url": "https://arxiv.org/abs/2106.10775",
    "authors": [
      "Mundla Narasimhappa",
      "Sesham Srinu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2106.10811",
    "title": "DiGS : Divergence guided shape implicit neural representation for  unoriented point clouds",
    "abstract": "Neural shape representations have recently shown to be effective in shape analysis and reconstruction tasks. Existing neural network methods require point coordinates and corresponding normal vectors to learn the implicit level sets of the shape. Normal vectors are often not provided as raw data, therefore, approximation and reorientation are required as pre-processing stages, both of which can introduce noise. In this paper, we propose a divergence guided shape representation learning approach that does not require normal vectors as input. We show that incorporating a soft constraint on the divergence of the distance function favours smooth solutions that reliably orients gradients to match the unknown normal at each point, in some cases even better than approaches that use ground truth normal vectors directly. Additionally, we introduce a novel geometric initialization method for sinusoidal shape representation networks that further improves convergence to the desired solution. We evaluate the effectiveness of our approach on the task of surface reconstruction and show state-of-the-art performance compared to other unoriented methods and on-par performance compared to oriented methods. ",
    "url": "https://arxiv.org/abs/2106.10811",
    "authors": [
      "Yizhak Ben-Shabat",
      "Chamin Hewa Koneputugodage",
      "Stephen Gould"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.10911",
    "title": "Approximation capabilities of measure-preserving neural networks",
    "abstract": "Measure-preserving neural networks are well-developed invertible models, however, the approximation capabilities remain unexplored. This paper rigorously establishes the general sufficient conditions for approximating measure-preserving maps using measure-preserving neural networks. It is shown that for compact $U \\subset \\R^D$ with $D\\geq 2$, every measure-preserving map $\\psi: U\\to \\R^D$ which is injective and bounded can be approximated in the $L^p$-norm by measure-preserving neural networks. Specifically, the differentiable maps with $\\pm 1$ determinants of Jacobians are measure-preserving, injective and bounded on $U$, thus hold the approximation property. ",
    "url": "https://arxiv.org/abs/2106.10911",
    "authors": [
      "Aiqing Zhu",
      "Pengzhan Jin",
      "Yifa Tang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.10912",
    "title": "A probabilistic parallel modular algorithm for rational univariate  representation",
    "abstract": "This article does not introduce new mathematical ideas, it is more a state of the art June 2021 picture about solving polynomial systems efficiently by reconstructing a rational univariate representation with a very high probability of correctness using Groebner revlex computation, Berlekamp-Massey algorithm and Hankel linear system solving modulo several primes in parallel. This algorithm is implemented in Giac/Xcas since version 1.7.0-13, it has (June 2021) leading performances on multiple CPU, at least for an open-source software. ",
    "url": "https://arxiv.org/abs/2106.10912",
    "authors": [
      "Bernard Parisse"
    ],
    "subjectives": [
      "Symbolic Computation (cs.SC)"
    ]
  },
  {
    "id": "arXiv:2106.10944",
    "title": "Hard hat wearing detection based on head keypoint localization",
    "abstract": "In recent years, a lot of attention is paid to deep learning methods in the context of vision-based construction site safety systems, especially regarding personal protective equipment. However, despite all this attention, there is still no reliable way to establish the relationship between workers and their hard hats. To answer this problem a combination of deep learning, object detection and head keypoint localization, with simple rule-based reasoning is proposed in this article. In tests, this solution surpassed the previous methods based on the relative bounding box position of different instances, as well as direct detection of hard hat wearers and non-wearers. The results show that the conjunction of novel deep learning methods with humanly-interpretable rule-based systems can result in a solution that is both reliable and can successfully mimic manual, on-site supervision. This work is the next step in the development of fully autonomous construction site safety systems and shows that there is still room for improvement in this area. ",
    "url": "https://arxiv.org/abs/2106.10944",
    "authors": [
      "Bartosz Wójcik",
      "Mateusz Żarski",
      "Kamil Książek",
      "Jarosław Adam Miszczak",
      "Mirosław Jan Skibniewski"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2106.10955",
    "title": "Extractive approach for text summarisation using graphs",
    "abstract": "Natural language processing is an important discipline with the aim of understanding text by its digital representation, that due to the diverse way we write and speak, is often not accurate enough. Our paper explores different graph-related algorithms that can be used in solving the text summarization problem using an extractive approach. We consider two metrics: sentence overlap and edit distance for measuring sentence similarity. ",
    "url": "https://arxiv.org/abs/2106.10955",
    "authors": [
      "Kastriot Kadriu",
      "Milenko Obradovic"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.10996",
    "title": "Delving into the pixels of adversarial samples",
    "abstract": "Despite extensive research into adversarial attacks, we do not know how adversarial attacks affect image pixels. Knowing how image pixels are affected by adversarial attacks has the potential to lead us to better adversarial defenses. Motivated by instances that we find where strong attacks do not transfer, we delve into adversarial examples at pixel level to scrutinize how adversarial attacks affect image pixel values. We consider several ImageNet architectures, InceptionV3, VGG19 and ResNet50, as well as several strong attacks. We find that attacks can have different effects at pixel level depending on classifier architecture. In particular, input pre-processing plays a previously overlooked role in the effect that attacks have on pixels. Based on the insights of pixel-level examination, we find new ways to detect some of the strongest current attacks. ",
    "url": "https://arxiv.org/abs/2106.10996",
    "authors": [
      "Blerta Lindqvist"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.11026",
    "title": "An interpretable prediction model for longitudinal dispersion  coefficient in natural streams based on evolutionary symbolic regression  network",
    "abstract": "A better understanding of dispersion in natural streams requires knowledge of longitudinal dispersion coefficient(LDC). Various methods have been proposed for predictions of LDC. Those studies can be grouped into three types: analytical, statistical and ML-driven researches(Implicit and explicit). However, a comprehensive evaluation of them is still lacking. In this paper, we first present an in-depth analysis of those methods and find out their defects. This is carried out on an extensive database composed of 660 samples of hydraulic and channel properties worldwide. The reliability and representativeness of utilized data are enhanced through the deployment of the Subset Selection of Maximum Dissimilarity(SSMD) for testing set selection and the Inter Quartile Range(IQR) for removal of the outlier. The evaluation reveals the rank of those methods as: ML-driven method > the statistical method > the analytical method. Whereas implicit ML-driven methods are black-boxes in nature, explicit ML-driven methods have more potential in prediction of LDC. Besides, overfitting is a universal problem in existing models. Those models also suffer from a fixed parameter combination. To establish an interpretable model for LDC prediction with higher performance, we then design a novel symbolic regression method called evolutionary symbolic regression network(ESRN). It is a combination of genetic algorithms and neural networks. Strategies are introduced to avoid overfitting and explore more parameter combinations. Results show that the ESRN model has superiorities over other existing symbolic models in performance. The proposed model is suitable for practical engineering problems due to its advantage in low requirement of parameters (only w and U* are required). It can provide convincing solutions for situations where the field test cannot be carried out or limited field information can be obtained. ",
    "url": "https://arxiv.org/abs/2106.11026",
    "authors": [
      "Yifeng Zhao",
      "Zicheng Liu",
      "Pei Zhang",
      "Stan Z. Li",
      "S.A. Galindo-Torres"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2106.11040",
    "title": "An exploratory study of skill requirements for social media positions: A  content analysis of job advertisements",
    "abstract": "There has been considerable debate about the comparative advantages of marketing education emphasizing theoretical knowledge and applied skills. The current study investigated the skills necessary for entry-level marketing positions, specifically that of Social Media Manager (SMMgr) and Social Media Marketer (SMMkt). Data was collected from Indeed.com using a web crawler to extract job postings for SMMgr and SMMkt. A total of 766 and 654 entry-level jobs for SMMgr and SMMkt, respectively, across the entire United States, was collected. Independent raters separately analyzed the data for keywords and categories. Findings suggest that the most desired skills are occupational digital marketing skills. Other relevant skill categories included communication, employee attributes, problem-solving, and information technology skills. This study extends the current literature by highlighting the desired skills prevalent across the social media industry. The findings also have relevance in designing the marketing education curriculum, specifically in isolating core skills that could be integrated into the marketing courses. ",
    "url": "https://arxiv.org/abs/2106.11040",
    "authors": [
      "Amit Verma",
      "Phillip Frank",
      "Kamal Lamsal"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2106.11050",
    "title": "A photonic complex perceptron for ultrafast data processing",
    "abstract": "In photonic neural network a key building block is the perceptron. Here, we describe and demonstrate a complex-valued photonic perceptron that combines time and space multiplexing in a fully passive silicon photonics integrated circuit. An input time dependent bit sequence is broadcasted into a few delay lines where the relative phases are trained by particle swarm algorithms toward the given task. Since only the phases of the propagating optical modes are trained, signal attenuation in the perceptron due to amplitude modulation is avoided. The perceptron performs binary pattern recognition and few bit delayed XOR operations up to 16 Gbps (limited by the used electronics) with Bit Error Rates as low as $10^{-6}$. The perceptron is fully integrated, silicon based, scalable, and can be used as a building block in large neural networks. ",
    "url": "https://arxiv.org/abs/2106.11050",
    "authors": [
      "Mattia Mancinelli",
      "Davide Bazzanella",
      "Paolo Bettotti",
      "Lorenzo Pavesi"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2106.11099",
    "title": "Distilling effective supervision for robust medical image segmentation  with noisy labels",
    "abstract": "Despite the success of deep learning methods in medical image segmentation tasks, the human-level performance relies on massive training data with high-quality annotations, which are expensive and time-consuming to collect. The fact is that there exist low-quality annotations with label noise, which leads to suboptimal performance of learned models. Two prominent directions for segmentation learning with noisy labels include pixel-wise noise robust training and image-level noise robust training. In this work, we propose a novel framework to address segmenting with noisy labels by distilling effective supervision information from both pixel and image levels. In particular, we explicitly estimate the uncertainty of every pixel as pixel-wise noise estimation, and propose pixel-wise robust learning by using both the original labels and pseudo labels. Furthermore, we present an image-level robust learning method to accommodate more information as the complements to pixel-level learning. We conduct extensive experiments on both simulated and real-world noisy datasets. The results demonstrate the advantageous performance of our method compared to state-of-the-art baselines for medical image segmentation with noisy labels. ",
    "url": "https://arxiv.org/abs/2106.11099",
    "authors": [
      "Jialin Shi",
      "Ji Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.11160",
    "title": "Effects of boundary conditions in fully convolutional networks for  learning spatio-temporal dynamics",
    "abstract": "Accurate modeling of boundary conditions is crucial in computational physics. The ever increasing use of neural networks as surrogates for physics-related problems calls for an improved understanding of boundary condition treatment, and its influence on the network accuracy. In this paper, several strategies to impose boundary conditions (namely padding, improved spatial context, and explicit encoding of physical boundaries) are investigated in the context of fully convolutional networks applied to recurrent tasks. These strategies are evaluated on two spatio-temporal evolving problems modeled by partial differential equations: the 2D propagation of acoustic waves (hyperbolic PDE) and the heat equation (parabolic PDE). Results reveal a high sensitivity of both accuracy and stability on the boundary implementation in such recurrent tasks. It is then demonstrated that the choice of the optimal padding strategy is directly linked to the data semantics. Furthermore, the inclusion of additional input spatial context or explicit physics-based rules allows a better handling of boundaries in particular for large number of recurrences, resulting in more robust and stable neural networks, while facilitating the design and versatility of such networks. ",
    "url": "https://arxiv.org/abs/2106.11160",
    "authors": [
      "Antonio Alguacil andr Gonçalves Pinto",
      "Michael Bauerheim",
      "Marc C. Jacob",
      "Stéphane Moreau"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2106.11234",
    "title": "A causal view on compositional data",
    "abstract": "Many scientific datasets are compositional in nature. Important examples include species abundances in ecology, rock compositions in geology, topic compositions in large-scale text corpora, and sequencing count data in molecular biology. Here, we provide a causal view on compositional data in an instrumental variable setting where the composition acts as the cause. Throughout, we pay particular attention to the interpretation of compositional causes from the viewpoint of interventions and crisply articulate potential pitfalls for practitioners. Focusing on modern high-dimensional microbiome sequencing data as a timely illustrative use case, our analysis first reveals that popular one-dimensional information-theoretic summary statistics, such as diversity and richness, may be insufficient for drawing causal conclusions from ecological data. Instead, we advocate for multivariate alternatives using statistical data transformations and regression techniques that take the special structure of the compositional sample space into account. In a comparative analysis on synthetic and semi-synthetic data we show the advantages and limitations of our proposal. We posit that our framework may provide a useful starting point for cause-effect estimation in the context of compositional data. ",
    "url": "https://arxiv.org/abs/2106.11234",
    "authors": [
      "Elisabeth Ailer",
      "Christian L. Müller",
      "Niki Kilbertus"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)",
      "Applications (stat.AP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.08609",
    "title": "Reinforcement learning for pursuit and evasion of microswimmers at low  Reynolds number",
    "abstract": "Aquatic organisms can use hydrodynamic cues to navigate, find their preys and escape from predators. We consider a model of two competing microswimmers engaged in a pursue-evasion task while immersed in a low-Reynolds-number environment. The players have limited abilities: they can only sense hydrodynamic disturbances, which provide some cue about the opponent's position, and perform simple manoeuvres. The goal of the pursuer is to capturethe evader in the shortest possible time. Conversely the evader aims at deferring capture as much as possible. We show that by means of Reinforcement Learning the players find efficient and physically explainable strategies which non-trivially exploit the hydrodynamic environment. This Letter offers a proof-of-concept for the use of Reinforcement Learning to discover prey-predator strategies in aquatic environments, with potential applications to underwater robotics. ",
    "url": "https://arxiv.org/abs/2106.08609",
    "authors": [
      "Francesco Borra",
      "Luca Biferale",
      "Massimo Cencini",
      "Antonio Celani"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)",
      "Chaotic Dynamics (nlin.CD)"
    ]
  },
  {
    "id": "arXiv:2106.10401",
    "title": "Parallel frequency function-deep neural network for efficient complex  broadband signal approximation",
    "abstract": "A neural network is essentially a high-dimensional complex mapping model by adjusting network weights for feature fitting. However, the spectral bias in network training leads to unbearable training epochs for fitting the high-frequency components in broadband signals. To improve the fitting efficiency of high-frequency components, the PhaseDNN was proposed recently by combining complex frequency band extraction and frequency shift techniques [Cai et al. SIAM J. SCI. COMPUT. 42, A3285 (2020)]. Our paper is devoted to an alternative candidate for fitting complex signals with high-frequency components. Here, a parallel frequency function-deep neural network (PFF-DNN) is proposed to suppress computational overhead while ensuring fitting accuracy by utilizing fast Fourier analysis of broadband signals and the spectral bias nature of neural networks. The effectiveness and efficiency of the proposed PFF-DNN method are verified based on detailed numerical experiments for six typical broadband signals. ",
    "url": "https://arxiv.org/abs/2106.10401",
    "authors": [
      "Zhi Zeng",
      "Pengpeng Shi",
      "Fulei Ma",
      "Peihan Qi"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.10480",
    "title": "Cumulative structure and path length in networks of knowledge",
    "abstract": "An important knowledge dimension of science and technology is the extent to which their development is cumulative, that is, the extent to which later findings build on earlier ones. Cumulative knowledge structures can be studied using a network approach, in which nodes represent findings and links represent knowledge flows. Of particular interest to those studies is the notion of network paths and path length. Starting from the Price model of network growth, we derive an exact solution for the path length distribution of all unique paths from a given initial node to each node in the network. We study the relative importance of the average in-degree and cumulative advantage effect and implement a generalization where the in-degree depends on the number of nodes. The cumulative advantage effect is found to fundamentally slow down path length growth. As the collection of all unique paths may contain many redundancies, we additionally consider the subset of the longest paths to each node in the network. As this case is more complicated, we only approximate the longest path length distribution in a simple context. Where the number of all unique paths of a given length grows unbounded, the number of longest paths of a given length converges to a finite limit, which depends exponentially on the given path length. Fundamental network properties and dynamics therefore characteristically shape cumulative structures in those networks, and should therefore be taken into account when studying those structures. ",
    "url": "https://arxiv.org/abs/2106.10480",
    "authors": [
      "P.G.J. Persoon"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2106.10751",
    "title": "Routing by matching on convex pieces of grid graphs",
    "abstract": "The routing number is a graph invariant introduced by Alon, Chung, and Graham in 1994, and it has been studied for trees and other classes of graphs such as hypercubes. It gives the minimum number of routing steps needed to sort a set of distinct tokens, placed one on each vertex, where each routing step swaps a set of disjoint pairs of adjacent tokens. Our main theorem generalizes the known estimate that a rectangular grid graph R with width w(R) and height h(R) has routing number rt(R) in O(w(R)+h(R)). We show that for the subgraph P of the infinite square lattice enclosed by any convex polygon, its routing number rt(P) is in O(w(P)+h(P)). ",
    "url": "https://arxiv.org/abs/2106.10751",
    "authors": [
      "H. Alpert",
      "R. Barnes",
      "S. Bell",
      "A. Mauro",
      "N. Nevo",
      "N. Tucker",
      "H. Yang"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2106.11064",
    "title": "$α$-Stable convergence of heavy-tailed infinitely-wide neural  networks",
    "abstract": "We consider infinitely-wide multi-layer perceptrons (MLPs) which are limits of standard deep feed-forward neural networks. We assume that, for each layer, the weights of an MLP are initialized with i.i.d. samples from either a light-tailed (finite variance) or heavy-tailed distribution in the domain of attraction of a symmetric $\\alpha$-stable distribution, where $\\alpha\\in(0,2]$ may depend on the layer. For the bias terms of the layer, we assume i.i.d. initializations with a symmetric $\\alpha$-stable distribution having the same $\\alpha$ parameter of that layer. We then extend a recent result of Favaro, Fortini, and Peluchetti (2020), to show that the vector of pre-activation values at all nodes of a given hidden layer converges in the limit, under a suitable scaling, to a vector of i.i.d. random variables with symmetric $\\alpha$-stable distributions. ",
    "url": "https://arxiv.org/abs/2106.11064",
    "authors": [
      "Paul Jung",
      "Hoil Lee",
      "Jiho Lee",
      "Hongseok Yang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2106.11087",
    "title": "Recolouring co-bipartite and weakly chordal graphs",
    "abstract": "For a graph $G$, the $k$-recolouring graph $\\mathcal{R}_k(G)$ is the graph whose vertices are the $k$-colourings of $G$ and two colourings are joined by an edge if they differ in colour on exactly one vertex. We prove that for all $n \\ge 1$, there exists a $k$-colourable weakly chordal $G$ graph where $\\mathcal{R}_{k+n}(G)$ is disconnected, answering an open question of Feghali and Fiala. We also show that for every $k$-colourable co-bipartite graph $G$, $\\mathcal{R}_{k+1}(G)$ is connected with diameter at most $4|V(G)|$. ",
    "url": "https://arxiv.org/abs/2106.11087",
    "authors": [
      "Owen Merkel"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:1910.10174",
    "title": "Leveraging directed causal discovery to detect latent common causes",
    "abstract": " Comments: Presented at Frontiers of AI-Assisted Care 2019 (Scientific Symposium, Stanford Medicine). 13 pages, 5 figures, 4 tables. Comments welcome ",
    "url": "https://arxiv.org/abs/1910.10174",
    "authors": [
      "Ciarán M. Lee",
      "Christopher Hart",
      "Jonathan G. Richens",
      "Saurabh Johri"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2001.09590",
    "title": "Energy conserving SUPG methods for compatible finite element schemes in  numerical weather prediction",
    "abstract": " Comments: 32 pages, 12 figures; main differences to first version: simplified formulation for auxiliary SUPG operator, improved numerical results section ",
    "url": "https://arxiv.org/abs/2001.09590",
    "authors": [
      "Golo A. Wimmer",
      "Colin J. Cotter",
      "Werner Bauer"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2004.09928",
    "title": "Principled approach to the selection of the embedding dimension of  networks",
    "abstract": " Comments: 13 pages, 5 figures, Supplementary Information available this this http URL ",
    "url": "https://arxiv.org/abs/2004.09928",
    "authors": [
      "Weiwei Gu",
      "Aditya Tandon",
      "Yong-Yeol Ahn",
      "Filippo Radicchi"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2005.11949",
    "title": "Approximation in shift-invariant spaces with deep ReLU neural networks",
    "abstract": " Title: Approximation in shift-invariant spaces with deep ReLU neural networks ",
    "url": "https://arxiv.org/abs/2005.11949",
    "authors": [
      "Yunfei Yang",
      "Zhen Li",
      "Yang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2006.10159",
    "title": "Automatic heterogeneous quantization of deep neural networks for  low-latency inference on the edge for particle detectors",
    "abstract": " Title: Automatic heterogeneous quantization of deep neural networks for  low-latency inference on the edge for particle detectors ",
    "url": "https://arxiv.org/abs/2006.10159",
    "authors": [
      "Claudionor N. Coelho Jr.",
      "Aki Kuusela",
      "Shan Li",
      "Hao Zhuang",
      "Thea Aarrestad",
      "Vladimir Loncar",
      "Jennifer Ngadiuba",
      "Maurizio Pierini",
      "Adrian Alan Pol",
      "Sioni Summers"
    ],
    "subjectives": [
      "Instrumentation and Detectors (physics.ins-det)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)",
      "Signal Processing (eess.SP)",
      "High Energy Physics - Experiment (hep-ex)"
    ]
  },
  {
    "id": "arXiv:2010.13570",
    "title": "On the intrinsic robustness to noise of some leading classifiers and  symmetric loss function -- an empirical evaluation",
    "abstract": " Comments: 10 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2010.13570",
    "authors": [
      "Hugo Le Baher",
      "Vincent Lemaire",
      "Romain Trinquart"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2012.13138",
    "title": "A non-alternating graph hashing algorithm for large scale image search",
    "abstract": " Comments: The paper is under consideration at Computer Vision and Image Understanding journal ",
    "url": "https://arxiv.org/abs/2012.13138",
    "authors": [
      "Sobhan Hemati",
      "Mohammad Hadi Mehdizavareh",
      "Shojaeddin Chenouri",
      "Hamid R Tizhoosh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2101.01167",
    "title": "Scale-free networks may not necessarily witness cooperation",
    "abstract": " Comments: Accepted to Europhysics Letters (EPL) ",
    "url": "https://arxiv.org/abs/2101.01167",
    "authors": [
      "Deep Nath",
      "Saptarshi Sinha",
      "Soumen Roy"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Social and Information Networks (cs.SI)",
      "Populations and Evolution (q-bio.PE)"
    ]
  },
  {
    "id": "arXiv:2101.05592",
    "title": "Dynamic network analysis of a target defense differential game with  limited observations",
    "abstract": " Comments: 8 figures ",
    "url": "https://arxiv.org/abs/2101.05592",
    "authors": [
      "Sharad Kumar Singh",
      "Puduru Viswanadha Reddy"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2101.08886",
    "title": "A co-Design approach to develop a smart cooking appliance. Applying a  Domain Specific Language for a community supported appliance",
    "abstract": " Comments: 9 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2101.08886",
    "authors": [
      "Matteo Zallio",
      "Paula Kelly",
      "Barry Cryan",
      "Damon Berry"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2103.01750",
    "title": "Nonparametric estimation of the preferential attachment function from  one network snapshot",
    "abstract": " Comments: 26 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2103.01750",
    "authors": [
      "Thong Pham",
      "Paul Sheridan",
      "Hidetoshi Shimodaira"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Physics and Society (physics.soc-ph)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2103.03285",
    "title": "A vertex scheme for two-phase flow in heterogeneous media",
    "abstract": " Comments: 25 pages, 17 figures; added reference ",
    "url": "https://arxiv.org/abs/2103.03285",
    "authors": [
      "M. S. Joshaghani",
      "V. Girault",
      "B. Riviere"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2103.06219",
    "title": "Why flatness does and does not correlate with generalization for deep  neural networks",
    "abstract": " Title: Why flatness does and does not correlate with generalization for deep  neural networks ",
    "url": "https://arxiv.org/abs/2103.06219",
    "authors": [
      "Shuofeng Zhang",
      "Isaac Reid",
      "Guillermo Valle Pérez",
      "Ard Louis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2103.08143",
    "title": "Constrained plasticity reserve as a natural way to control frequency and  weights in spiking neural networks",
    "abstract": " Comments: 24 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2103.08143",
    "authors": [
      "Oleg Nikitin",
      "Olga Lukyanova",
      "Alex Kunin"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2106.02221",
    "title": "Specular reflections removal in colposcopic images based on neural  networks: Supervised training with no ground truth previous knowledge",
    "abstract": " Comments: This new version corrects typos and adds references ",
    "url": "https://arxiv.org/abs/2106.02221",
    "authors": [
      "Lauren Jimenez-Martin",
      "Daniel A. Valdés Pérez",
      "Ana M. Solares Asteasuainzarra",
      "Ludwig Leonard",
      "Marta L. Baguer Díaz-Romañach"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.09303",
    "title": "A Multi-task convolutional neural network for blind stereoscopic image  quality assessment using naturalness analysis",
    "abstract": " Title: A Multi-task convolutional neural network for blind stereoscopic image  quality assessment using naturalness analysis ",
    "url": "https://arxiv.org/abs/2106.09303",
    "authors": [
      "Salima Bourbia",
      "Ayoub Karine",
      "Aladine Chetouani",
      "Mohammed El Hassouni"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]