[
  {
    "id": "arXiv:2310.10655",
    "title": "Enhancing Trustworthiness in ML-Based Network Intrusion Detection with  Uncertainty Quantification",
    "abstract": "The evolution of Internet and its related communication technologies have consistently increased the risk of cyber-attacks. In this context, a crucial role is played by Intrusion Detection Systems (IDSs), which are security devices designed to identify and mitigate attacks to modern networks. In the last decade, data-driven approaches based on Machine Learning (ML) have gained more and more popularity for executing the classification tasks required by IDSs. However, typical ML models adopted for this purpose do not properly take into account the uncertainty associated with their own prediction. This poses significant challenges, as they tend to produce misleadingly high classification scores for both misclassified inputs and inputs belonging to unknown classes (e.g. novel attacks), limiting the trustworthiness of existing ML-based solutions. In this paper we argue that ML-based IDSs should always provide accurate uncertainty quantification to avoid overconfident predictions. In fact, an uncertainty-aware classification would be beneficial to enhance closed-set classification performance, would make it possible to efficiently carry out Active Learning, and would help recognize inputs of unknown classes as truly unknowns (i.e., not belonging to any known class), unlocking open-set classification capabilities and Out-of-Distribution (OoD) detection. To verify it, we compare various ML-based methods for uncertainty quantification and for OoD detection, either specifically designed for or tailored to the domain of network intrusion detection, showing how a proper estimation of the model uncertainty can be exploited to significantly enhance the trustworthiness of ML-based IDSs. Our results also confirm that conventional ML-based approaches to network intrusion detection (e.g. based on traditional feed-forward Neural Networks) may not be appropriate and should be adopted with caution. ",
    "url": "https://arxiv.org/abs/2310.10655",
    "authors": [
      "Jacopo Talpini",
      "Fabio Sartori",
      "Marco Savi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10656",
    "title": "VeriDIP: Verifying Ownership of Deep Neural Networks through Privacy  Leakage Fingerprints",
    "abstract": "Deploying Machine Learning as a Service gives rise to model plagiarism, leading to copyright infringement. Ownership testing techniques are designed to identify model fingerprints for verifying plagiarism. However, previous works often rely on overfitting or robustness features as fingerprints, lacking theoretical guarantees and exhibiting under-performance on generalized models. In this paper, we propose a novel ownership testing method called VeriDIP, which verifies a DNN model's intellectual property. VeriDIP makes two major contributions. (1) It utilizes membership inference attacks to estimate the lower bound of privacy leakage, which reflects the fingerprint of a given model. The privacy leakage fingerprints highlight the unique patterns through which the models memorize sensitive training datasets. (2) We introduce a novel approach using less private samples to enhance the performance of ownership testing. Extensive experimental results confirm that VeriDIP is effective and efficient in validating the ownership of deep learning models trained on both image and tabular datasets. VeriDIP achieves comparable performance to state-of-the-art methods on image datasets while significantly reducing computation and communication costs. Enhanced VeriDIP demonstrates superior verification performance on generalized deep learning models, particularly on table-trained models. Additionally, VeriDIP exhibits similar effectiveness on utility-preserving differentially private models compared to non-differentially private baselines. ",
    "url": "https://arxiv.org/abs/2310.10656",
    "authors": [
      "Aoting Hu",
      "Zhigang Lu",
      "Renjie Xie",
      "Minhui Xue"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10659",
    "title": "Backdoor Attack through Machine Unlearning",
    "abstract": "In recent years, the security issues of artificial intelligence have become increasingly prominent due to the rapid development of deep learning research and applications. Backdoor attack is an attack targeting the vulnerability of deep learning models, where hidden backdoors are activated by triggers embedded by the attacker, thereby outputting malicious predictions that may not align with the intended output for a given input. In this work, we propose a novel black-box backdoor attack based on machine unlearning. The attacker first augments the training set with carefully designed samples, including poison and mitigation data, to train a 'benign' model. Then, the attacker posts unlearning requests for the mitigation samples to remove the impact of relevant data on the model, gradually activating the hidden backdoor. Since backdoors are implanted during the iterative unlearning process, it significantly increases the computational overhead of existing defense methods for backdoor detection or mitigation. To address this new security threat, we propose two methods for detecting or mitigating such malicious unlearning requests. We conduct the experiment in both naive unlearning and SISA settings. Experimental results show that: 1) our attack can successfully implant backdoor into the model, and sharding increases the difficulty of attack; 2) our detection algorithms are effective in identifying the mitigation samples, while sharding reduces the effectiveness of our detection algorithms. ",
    "url": "https://arxiv.org/abs/2310.10659",
    "authors": [
      "Peixin Zhang",
      "Jun Sun",
      "Mingtian Tan",
      "Xinyu Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10660",
    "title": "Analysis and Detection against Network Attacks in the Overlapping  Phenomenon of Behavior Attribute",
    "abstract": "The proliferation of network attacks poses a significant threat. Researchers propose datasets for network attacks to support research in related fields. Then, many attack detection methods based on these datasets are proposed. These detection methods, whether two-classification or multi-classification, belong to single-label learning, i.e., only one label is given to each sample. However, we discover that there is a noteworthy phenomenon of behavior attribute overlap between attacks, The presentation of this phenomenon in a dataset is that there are multiple samples with the same features but different labels. In this paper, we verify the phenomenon in well-known datasets(UNSW-NB15, CCCS-CIC-AndMal-2020) and re-label these data. In addition, detecting network attacks in a multi-label manner can obtain more information, providing support for tracing the attack source and building IDS. Therefore, we propose a multi-label detection model based on deep learning, MLD-Model, in which Wasserstein-Generative-Adversarial- Network-with-Gradient-Penalty (WGAN-GP) with improved loss performs data enhancement to alleviate the class imbalance problem, and Auto-Encoder (AE) performs classifier parameter pre-training. Experimental results demonstrate that MLD-Model can achieve excellent classification performance. It can achieve F1=80.06% in UNSW-NB15 and F1=83.63% in CCCS-CIC-AndMal-2020. Especially, MLD-Model is 5.99%-7.97% higher in F1 compared with the related single-label methods. ",
    "url": "https://arxiv.org/abs/2310.10660",
    "authors": [
      "Jiang Xie",
      "Shuhao Li",
      "Yongzheng Zhanga",
      "Peishuai Sun",
      "Hongbo Xu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2310.10661",
    "title": "TII-SSRC-23 Dataset: Typological Exploration of Diverse Traffic Patterns  for Intrusion Detection",
    "abstract": "The effectiveness of network intrusion detection systems, predominantly based on machine learning, are highly influenced by the dataset they are trained on. Ensuring an accurate reflection of the multifaceted nature of benign and malicious traffic in these datasets is essential for creating models capable of recognizing and responding to a wide array of intrusion patterns. However, existing datasets often fall short, lacking the necessary diversity and alignment with the contemporary network environment, thereby limiting the effectiveness of intrusion detection. This paper introduces TII-SSRC-23, a novel and comprehensive dataset designed to overcome these challenges. Comprising a diverse range of traffic types and subtypes, our dataset is a robust and versatile tool for the research community. Additionally, we conduct a feature importance analysis, providing vital insights into critical features for intrusion detection tasks. Through extensive experimentation, we also establish firm baselines for supervised and unsupervised intrusion detection methodologies using our dataset, further contributing to the advancement and adaptability of intrusion detection models in the rapidly changing landscape of network security. Our dataset is available at https://kaggle.com/datasets/daniaherzalla/tii-ssrc-23. ",
    "url": "https://arxiv.org/abs/2310.10661",
    "authors": [
      "Dania Herzalla",
      "Willian T. Lunardi",
      "Martin Andreoni Lopez"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10662",
    "title": "Assessing the Influence of Different Types of Probing on Adversarial  Decision-Making in a Deception Game",
    "abstract": "Deception, which includes leading cyber-attackers astray with false information, has shown to be an effective method of thwarting cyber-attacks. There has been little investigation of the effect of probing action costs on adversarial decision-making, despite earlier studies on deception in cybersecurity focusing primarily on variables like network size and the percentage of honeypots utilized in games. Understanding human decision-making when prompted with choices of various costs is essential in many areas such as in cyber security. In this paper, we will use a deception game (DG) to examine different costs of probing on adversarial decisions. To achieve this we utilized an IBLT model and a delayed feedback mechanism to mimic knowledge of human actions. Our results were taken from an even split of deception and no deception to compare each influence. It was concluded that probing was slightly taken less as the cost of probing increased. The proportion of attacks stayed relatively the same as the cost of probing increased. Although a constant cost led to a slight decrease in attacks. Overall, our results concluded that the different probing costs do not have an impact on the proportion of attacks whereas it had a slightly noticeable impact on the proportion of probing. ",
    "url": "https://arxiv.org/abs/2310.10662",
    "authors": [
      "Md Abu Sayed",
      "Mohammad Ariful Islam Khan",
      "Bryant A Allsup",
      "Joshua Zamora",
      "Palvi Aggarwal"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.10663",
    "title": "Data privacy for Mobility as a Service",
    "abstract": "Mobility as a Service (MaaS) is revolutionizing the transportation industry by offering convenient, efficient and integrated transportation solutions. However, the extensive use of user data as well as the integration of multiple service providers raises significant privacy concerns. The objective of this survey paper is to provide a comprehensive analysis of the current state of data privacy in MaaS, in particular by discussing the associated challenges, existing solutions as well as potential future directions to ensure user privacy while maintaining the benefits of MaaS systems for society. ",
    "url": "https://arxiv.org/abs/2310.10663",
    "authors": [
      "Zineb Garroussi",
      "Antoine Legrain",
      "Sébastien Gambs",
      "Vincent Gautrais",
      "Brunilde Sansò"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.10665",
    "title": "Privacy Preservation in Artificial Intelligence and Extended Reality  (AI-XR) Metaverses: A Survey",
    "abstract": "The metaverse is a nascent concept that envisions a virtual universe, a collaborative space where individuals can interact, create, and participate in a wide range of activities. Privacy in the metaverse is a critical concern as the concept evolves and immersive virtual experiences become more prevalent. The metaverse privacy problem refers to the challenges and concerns surrounding the privacy of personal information and data within Virtual Reality (VR) environments as the concept of a shared VR space becomes more accessible. Metaverse will harness advancements from various technologies such as Artificial Intelligence (AI), Extended Reality (XR), Mixed Reality (MR), and 5G/6G-based communication to provide personalized and immersive services to its users. Moreover, to enable more personalized experiences, the metaverse relies on the collection of fine-grained user data that leads to various privacy issues. Therefore, before the potential of the metaverse can be fully realized, privacy concerns related to personal information and data within VR environments must be addressed. This includes safeguarding users' control over their data, ensuring the security of their personal information, and protecting in-world actions and interactions from unauthorized sharing. In this paper, we explore various privacy challenges that future metaverses are expected to face, given their reliance on AI for tracking users, creating XR and MR experiences, and facilitating interactions. Moreover, we thoroughly analyze technical solutions such as differential privacy, Homomorphic Encryption (HE), and Federated Learning (FL) and discuss related sociotechnical issues regarding privacy. ",
    "url": "https://arxiv.org/abs/2310.10665",
    "authors": [
      "Mahdi Alkaeed",
      "Adnan Qayyum",
      "Junaid Qadir"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10666",
    "title": "Extracting Physical Causality from Measurements to Detect and Localize  False Data Injection Attacks",
    "abstract": "False Data Injection Attack (FDIA) has become a growing concern in modern cyber-physical power systems. Most existing FDIA detection techniques project the raw measurement data into a high-dimensional latent space to separate normal and attacked samples. These approaches focus more on the statistical correlations of data values and are therefore susceptible to data distribution drifts induced by changes in system operating points or changes in FDIA types and strengths, especially for FDIA localization tasks. Causal inference, on the other hand, extracts the causality behind the coordinated fluctuations of different measurements. The causality patterns are determined by fundamental physical laws such as Ohm's Law and Kirchhoff's Law. They are sensitive to the violation of physical laws caused by FDIA, but tend to remain stable with the drift of system operating points. Leveraging this advantage, this paper proposes a joint FDIA detection and localization framework based on causal inference and the Graph Attention Network (GAT) to identify the attacked system nodes. The proposed framework consists of two levels. The lower level uses the X-learner algorithm to estimate the causality strength between measurements and generate Measurement Causality Graphs (MCGs). The upper level then applies a GAT to identify the anomaly patterns in the MCGs. Since the extracted causality patterns are intrinsically related to the measurements, it is easier for the upper level to figure out the attacked nodes than the existing FDIA localization approaches. The performance of the proposed framework is evaluated on the IEEE 39-bus system. Experimental results show that the causality-based FDIA detection and localization mechanism is highly interpretable and robust. ",
    "url": "https://arxiv.org/abs/2310.10666",
    "authors": [
      "Shengyang Wu",
      "Jingyu Wang",
      "Dongyuan Shi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10667",
    "title": "Enhancing Network Resilience through Machine Learning-powered Graph  Combinatorial Optimization: Applications in Cyber Defense and Information  Diffusion",
    "abstract": "With the burgeoning advancements of computing and network communication technologies, network infrastructures and their application environments have become increasingly complex. Due to the increased complexity, networks are more prone to hardware faults and highly susceptible to cyber-attacks. Therefore, for rapidly growing network-centric applications, network resilience is essential to minimize the impact of attacks and to ensure that the network provides an acceptable level of services during attacks, faults or disruptions. In this regard, this thesis focuses on developing effective approaches for enhancing network resilience. Existing approaches for enhancing network resilience emphasize on determining bottleneck nodes and edges in the network and designing proactive responses to safeguard the network against attacks. However, existing solutions generally consider broader application domains and possess limited applicability when applied to specific application areas such as cyber defense and information diffusion, which are highly popular application domains among cyber attackers. This thesis aims to design effective, efficient and scalable techniques for discovering bottleneck nodes and edges in the network to enhance network resilience in cyber defense and information diffusion application domains. We first investigate a cyber defense graph optimization problem, i.e., hardening active directory systems by discovering bottleneck edges in the network. We then study the problem of identifying bottleneck structural hole spanner nodes, which are crucial for information diffusion in the network. We transform both problems into graph-combinatorial optimization problems and design machine learning based approaches for discovering bottleneck points vital for enhancing network resilience. ",
    "url": "https://arxiv.org/abs/2310.10667",
    "authors": [
      "Diksha Goel"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10693",
    "title": "Network Analysis of the iNaturalist Citizen Science Community",
    "abstract": "In recent years, citizen science has become a larger and larger part of the scientific community. Its ability to crowd source data and expertise from thousands of citizen scientists makes it invaluable. Despite the field's growing popularity, the interactions and structure of citizen science projects are still poorly understood and under analyzed. We use the iNaturalist citizen science platform as a case study to analyze the structure of citizen science projects. We frame the data from iNaturalist as a bipartite network and use visualizations as well as established network science techniques to gain insights into the structure and interactions between users in citizen science projects. Finally, we propose a novel unique benchmark for network science research by using the iNaturalist data to create a network which has an unusual structure relative to other common benchmark networks. We demonstrate using a link prediction task that this network can be used to gain novel insights into a variety of network science methods. ",
    "url": "https://arxiv.org/abs/2310.10693",
    "authors": [
      "Yu Lu Liu",
      "Thomas Jiralerspong"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10696",
    "title": "Robust Collaborative Filtering to Popularity Distribution Shift",
    "abstract": "In leading collaborative filtering (CF) models, representations of users and items are prone to learn popularity bias in the training data as shortcuts. The popularity shortcut tricks are good for in-distribution (ID) performance but poorly generalized to out-of-distribution (OOD) data, i.e., when popularity distribution of test data shifts w.r.t. the training one. To close the gap, debiasing strategies try to assess the shortcut degrees and mitigate them from the representations. However, there exist two deficiencies: (1) when measuring the shortcut degrees, most strategies only use statistical metrics on a single aspect (i.e., item frequency on item and user frequency on user aspect), failing to accommodate the compositional degree of a user-item pair; (2) when mitigating shortcuts, many strategies assume that the test distribution is known in advance. This results in low-quality debiased representations. Worse still, these strategies achieve OOD generalizability with a sacrifice on ID performance. In this work, we present a simple yet effective debiasing strategy, PopGo, which quantifies and reduces the interaction-wise popularity shortcut without any assumptions on the test data. It first learns a shortcut model, which yields a shortcut degree of a user-item pair based on their popularity representations. Then, it trains the CF model by adjusting the predictions with the interaction-wise shortcut degrees. By taking both causal- and information-theoretical looks at PopGo, we can justify why it encourages the CF model to capture the critical popularity-agnostic features while leaving the spurious popularity-relevant patterns out. We use PopGo to debias two high-performing CF models (MF, LightGCN) on four benchmark datasets. On both ID and OOD test sets, PopGo achieves significant gains over the state-of-the-art debiasing strategies (e.g., DICE, MACR). ",
    "url": "https://arxiv.org/abs/2310.10696",
    "authors": [
      "An Zhang",
      "Wenchang Ma",
      "Jingnan Zheng",
      "Xiang Wang",
      "Tat-seng Chua"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.10698",
    "title": "Bridging Code Semantic and LLMs: Semantic Chain-of-Thought Prompting for  Code Generation",
    "abstract": "Large language models (LLMs) have showcased remarkable prowess in code generation. However, automated code generation is still challenging since it requires a high-level semantic mapping between natural language requirements and codes. Most existing LLMs-based approaches for code generation rely on decoder-only causal language models often treate codes merely as plain text tokens \\ie feeding the requirements as a prompt input, and outputing code as flat sequence of tokens, potentially missing the rich semantic features inherent in source code. To bridge this gap, this paper proposes the \"Semantic Chain-of-Thought\" approach to intruduce semantic information of code, named SeCoT. Our motivation is that the semantic information of the source code (\\eg data flow and control flow) describes more precise program execution behavior, intention and function. By guiding LLM consider and integrate semantic information, we can achieve a more granular understanding and representation of code, enhancing code generation accuracy. Meanwhile, while traditional techniques leveraging such semantic information require complex static or dynamic code analysis to obtain features such as data flow and control flow, SeCoT demonstrates that this process can be fully automated via the intrinsic capabilities of LLMs (\\ie in-context learning), while being generalizable and applicable to challenging domains. While SeCoT can be applied with different LLMs, this paper focuses on the powerful GPT-style models: ChatGPT(close-source model) and WizardCoder(open-source model). The experimental study on three popular DL benchmarks (\\ie HumanEval, HumanEval-ET and MBPP) shows that SeCoT can achieves state-of-the-art performance, greatly improving the potential for large models and code generation. ",
    "url": "https://arxiv.org/abs/2310.10698",
    "authors": [
      "Yingwei Ma",
      "Yue Yu",
      "Shanshan Li",
      "Yu Jiang",
      "Yong Guo",
      "Yuanliang Zhang",
      "Yutao Xie",
      "Xiangke Liao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.10702",
    "title": "Transparent Anomaly Detection via Concept-based Explanations",
    "abstract": "Advancements in deep learning techniques have given a boost to the performance of anomaly detection. However, real-world and safety-critical applications demand a level of transparency and reasoning beyond accuracy. The task of anomaly detection (AD) focuses on finding whether a given sample follows the learned distribution. Existing methods lack the ability to reason with clear explanations for their outcomes. Hence to overcome this challenge, we propose Transparent {A}nomaly Detection {C}oncept {E}xplanations (ACE). ACE is able to provide human interpretable explanations in the form of concepts along with anomaly prediction. To the best of our knowledge, this is the first paper that proposes interpretable by-design anomaly detection. In addition to promoting transparency in AD, it allows for effective human-model interaction. Our proposed model shows either higher or comparable results to black-box uninterpretable models. We validate the performance of ACE across three realistic datasets - bird classification on CUB-200-2011, challenging histopathology slide image classification on TIL-WSI-TCGA, and gender classification on CelebA. We further demonstrate that our concept learning paradigm can be seamlessly integrated with other classification-based AD methods. ",
    "url": "https://arxiv.org/abs/2310.10702",
    "authors": [
      "Laya Rafiee Sevyeri",
      "Ivaxi Sheth",
      "Farhood Farahnak",
      "Shirin Abbasinejad Enger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10744",
    "title": "Fast Adversarial Label-Flipping Attack on Tabular Data",
    "abstract": "Machine learning models are increasingly used in fields that require high reliability such as cybersecurity. However, these models remain vulnerable to various attacks, among which the adversarial label-flipping attack poses significant threats. In label-flipping attacks, the adversary maliciously flips a portion of training labels to compromise the machine learning model. This paper raises significant concerns as these attacks can camouflage a highly skewed dataset as an easily solvable classification problem, often misleading machine learning practitioners into lower defenses and miscalculations of potential risks. This concern amplifies in tabular data settings, where identifying true labels requires expertise, allowing malicious label-flipping attacks to easily slip under the radar. To demonstrate this risk is inherited in the adversary's objective, we propose FALFA (Fast Adversarial Label-Flipping Attack), a novel efficient attack for crafting adversarial labels. FALFA is based on transforming the adversary's objective and employs linear programming to reduce computational complexity. Using ten real-world tabular datasets, we demonstrate FALFA's superior attack potential, highlighting the need for robust defenses against such threats. ",
    "url": "https://arxiv.org/abs/2310.10744",
    "authors": [
      "Xinglong Chang",
      "Gillian Dobbie",
      "Jörg Wicker"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10755",
    "title": "IDRNet: Intervention-Driven Relation Network for Semantic Segmentation",
    "abstract": "Co-occurrent visual patterns suggest that pixel relation modeling facilitates dense prediction tasks, which inspires the development of numerous context modeling paradigms, \\emph{e.g.}, multi-scale-driven and similarity-driven context schemes. Despite the impressive results, these existing paradigms often suffer from inadequate or ineffective contextual information aggregation due to reliance on large amounts of predetermined priors. To alleviate the issues, we propose a novel \\textbf{I}ntervention-\\textbf{D}riven \\textbf{R}elation \\textbf{Net}work (\\textbf{IDRNet}), which leverages a deletion diagnostics procedure to guide the modeling of contextual relations among different pixels. Specifically, we first group pixel-level representations into semantic-level representations with the guidance of pseudo labels and further improve the distinguishability of the grouped representations with a feature enhancement module. Next, a deletion diagnostics procedure is conducted to model relations of these semantic-level representations via perceiving the network outputs and the extracted relations are utilized to guide the semantic-level representations to interact with each other. Finally, the interacted representations are utilized to augment original pixel-level representations for final predictions. Extensive experiments are conducted to validate the effectiveness of IDRNet quantitatively and qualitatively. Notably, our intervention-driven context scheme brings consistent performance improvements to state-of-the-art segmentation frameworks and achieves competitive results on popular benchmark datasets, including ADE20K, COCO-Stuff, PASCAL-Context, LIP, and Cityscapes. Code is available at \\url{https://github.com/SegmentationBLWX/sssegmentation}. ",
    "url": "https://arxiv.org/abs/2310.10755",
    "authors": [
      "Zhenchao Jin",
      "Xiaowei Hu",
      "Lingting Zhu",
      "Luchuan Song",
      "Li Yuan",
      "Lequan Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.10762",
    "title": "Exploring hyperelastic material model discovery for human brain cortex:  multivariate analysis vs. artificial neural network approaches",
    "abstract": "Traditional computational methods, such as the finite element analysis, have provided valuable insights into uncovering the underlying mechanisms of brain physical behaviors. However, precise predictions of brain physics require effective constitutive models to represent the intricate mechanical properties of brain tissue. In this study, we aimed to identify the most favorable constitutive material model for human brain tissue. To achieve this, we applied artificial neural network and multiple regression methods to a generalization of widely accepted classic models, and compared the results obtained from these two approaches. To evaluate the applicability and efficacy of the model, all setups were kept consistent across both methods, except for the approach to prevent potential overfitting. Our results demonstrate that artificial neural networks are capable of automatically identifying accurate constitutive models from given admissible estimators. Nonetheless, the five-term and two-term neural network models trained under single-mode and multi-mode loading scenarios, were found to be suboptimal and could be further simplified into two-term and single-term, respectively, with higher accuracy using multiple regression. Our findings highlight the importance of hyperparameters for the artificial neural network and emphasize the necessity for detailed cross-validations of regularization parameters to ensure optimal selection at a global level in the development of material constitutive models. This study validates the applicability and accuracy of artificial neural network to automatically discover constitutive material models with proper regularization as well as the benefits in model simplification without compromising accuracy for traditional multivariable regression. ",
    "url": "https://arxiv.org/abs/2310.10762",
    "authors": [
      "Jixin Hou",
      "Nicholas Filla",
      "Xianyan Chen",
      "Mir Jalil Razavi",
      "Tianming Liu",
      "Xianqiao Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10766",
    "title": "Nearly Optimal Approximation Rates for Deep Super ReLU Networks on  Sobolev Spaces",
    "abstract": "This paper introduces deep super ReLU networks (DSRNs) as a method for approximating functions in Sobolev spaces measured by Sobolev norms $W^{m,p}$ for $m\\in\\mathbb{N}$ with $m\\ge 2$ and $1\\le p\\le +\\infty$. Standard ReLU deep neural networks (ReLU DNNs) cannot achieve this goal. DSRNs consist primarily of ReLU DNNs, and several layers of the square of ReLU added at the end to smooth the networks output. This approach retains the advantages of ReLU DNNs, leading to the straightforward training. The paper also proves the optimality of DSRNs by estimating the VC-dimension of higher-order derivatives of DNNs, and obtains the generalization error in Sobolev spaces via an estimate of the pseudo-dimension of higher-order derivatives of DNNs. ",
    "url": "https://arxiv.org/abs/2310.10766",
    "authors": [
      "Yahong Yang",
      "Yue Wu",
      "Haizhao Yang",
      "Yang Xiang"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2310.10767",
    "title": "Wide Neural Networks as Gaussian Processes: Lessons from Deep  Equilibrium Models",
    "abstract": "Neural networks with wide layers have attracted significant attention due to their equivalence to Gaussian processes, enabling perfect fitting of training data while maintaining generalization performance, known as benign overfitting. However, existing results mainly focus on shallow or finite-depth networks, necessitating a comprehensive analysis of wide neural networks with infinite-depth layers, such as neural ordinary differential equations (ODEs) and deep equilibrium models (DEQs). In this paper, we specifically investigate the deep equilibrium model (DEQ), an infinite-depth neural network with shared weight matrices across layers. Our analysis reveals that as the width of DEQ layers approaches infinity, it converges to a Gaussian process, establishing what is known as the Neural Network and Gaussian Process (NNGP) correspondence. Remarkably, this convergence holds even when the limits of depth and width are interchanged, which is not observed in typical infinite-depth Multilayer Perceptron (MLP) networks. Furthermore, we demonstrate that the associated Gaussian vector remains non-degenerate for any pairwise distinct input data, ensuring a strictly positive smallest eigenvalue of the corresponding kernel matrix using the NNGP kernel. These findings serve as fundamental elements for studying the training and generalization of DEQs, laying the groundwork for future research in this area. ",
    "url": "https://arxiv.org/abs/2310.10767",
    "authors": [
      "Tianxiang Gao",
      "Xiaokai Huo",
      "Hailiang Liu",
      "Hongyang Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.10776",
    "title": "Correcting model misspecification in physics-informed neural networks  (PINNs)",
    "abstract": "Data-driven discovery of governing equations in computational science has emerged as a new paradigm for obtaining accurate physical models and as a possible alternative to theoretical derivations. The recently developed physics-informed neural networks (PINNs) have also been employed to learn governing equations given data across diverse scientific disciplines. Despite the effectiveness of PINNs for discovering governing equations, the physical models encoded in PINNs may be misspecified in complex systems as some of the physical processes may not be fully understood, leading to the poor accuracy of PINN predictions. In this work, we present a general approach to correct the misspecified physical models in PINNs for discovering governing equations, given some sparse and/or noisy data. Specifically, we first encode the assumed physical models, which may be misspecified, then employ other deep neural networks (DNNs) to model the discrepancy between the imperfect models and the observational data. Due to the expressivity of DNNs, the proposed method is capable of reducing the computational errors caused by the model misspecification and thus enables the applications of PINNs in complex systems where the physical processes are not exactly known. Furthermore, we utilize the Bayesian PINNs (B-PINNs) and/or ensemble PINNs to quantify uncertainties arising from noisy and/or gappy data in the discovered governing equations. A series of numerical examples including non-Newtonian channel and cavity flows demonstrate that the added DNNs are capable of correcting the model misspecification in PINNs and thus reduce the discrepancy between the physical models and the observational data. We envision that the proposed approach will extend the applications of PINNs for discovering governing equations in problems where the physico-chemical or biological processes are not well understood. ",
    "url": "https://arxiv.org/abs/2310.10776",
    "authors": [
      "Zongren Zou",
      "Xuhui Meng",
      "George Em Karniadakis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2310.10778",
    "title": "Is there a Trojan! : Literature survey and critical evaluation of the  latest ML based modern intrusion detection systems in IoT environments",
    "abstract": "IoT as a domain has grown so much in the last few years that it rivals that of the mobile network environments in terms of data volumes as well as cybersecurity threats. The confidentiality and privacy of data within IoT environments have become very important areas of security research within the last few years. More and more security experts are interested in designing robust IDS systems to protect IoT environments as a supplement to the more traditional security methods. Given that IoT devices are resource-constrained and have a heterogeneous protocol stack, most traditional intrusion detection approaches don't work well within these schematic boundaries. This has led security researchers to innovate at the intersection of Machine Learning and IDS to solve the shortcomings of non-learning based IDS systems in the IoT ecosystem. Despite various ML algorithms already having high accuracy with IoT datasets, we can see a lack of sufficient production grade models. This survey paper details a comprehensive summary of the latest learning-based approaches used in IoT intrusion detection systems, and conducts a thorough critical review of these systems, potential pitfalls in ML pipelines, challenges from an ML perspective, and discusses future research scope and recommendations. ",
    "url": "https://arxiv.org/abs/2310.10778",
    "authors": [
      "Vishal Karanam"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10780",
    "title": "Demystifying Poisoning Backdoor Attacks from a Statistical Perspective",
    "abstract": "The growing dependence on machine learning in real-world applications emphasizes the importance of understanding and ensuring its safety. Backdoor attacks pose a significant security risk due to their stealthy nature and potentially serious consequences. Such attacks involve embedding triggers within a learning model with the intention of causing malicious behavior when an active trigger is present while maintaining regular functionality without it. This paper evaluates the effectiveness of any backdoor attack incorporating a constant trigger, by establishing tight lower and upper boundaries for the performance of the compromised model on both clean and backdoor test data. The developed theory answers a series of fundamental but previously underexplored problems, including (1) what are the determining factors for a backdoor attack's success, (2) what is the direction of the most effective backdoor attack, and (3) when will a human-imperceptible trigger succeed. Our derived understanding applies to both discriminative and generative models. We also demonstrate the theory by conducting experiments using benchmark datasets and state-of-the-art backdoor attack scenarios. ",
    "url": "https://arxiv.org/abs/2310.10780",
    "authors": [
      "Xun Xian",
      "Ganghua Wang",
      "Jayanth Srinivasa",
      "Ashish Kundu",
      "Xuan Bi",
      "Mingyi Hong",
      "Jie Ding"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10781",
    "title": "BanglaNLP at BLP-2023 Task 1: Benchmarking different Transformer Models  for Violence Inciting Text Detection in Bengali",
    "abstract": "This paper presents the system that we have developed while solving this shared task on violence inciting text detection in Bangla. We explain both the traditional and the recent approaches that we have used to make our models learn. Our proposed system helps to classify if the given text contains any threat. We studied the impact of data augmentation when there is a limited dataset available. Our quantitative results show that finetuning a multilingual-e5-base model performed the best in our task compared to other transformer-based architectures. We obtained a macro F1 of 68.11\\% in the test set and our performance in this shared task is ranked at 23 in the leaderboard. ",
    "url": "https://arxiv.org/abs/2310.10781",
    "authors": [
      "Saumajit Saha",
      "Albert Nanda"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.10791",
    "title": "Neural Tangent Kernels Motivate Graph Neural Networks with  Cross-Covariance Graphs",
    "abstract": "Neural tangent kernels (NTKs) provide a theoretical regime to analyze the learning and generalization behavior of over-parametrized neural networks. For a supervised learning task, the association between the eigenvectors of the NTK kernel and given data (a concept referred to as alignment in this paper) can govern the rate of convergence of gradient descent, as well as generalization to unseen data. Building upon this concept, we investigate NTKs and alignment in the context of graph neural networks (GNNs), where our analysis reveals that optimizing alignment translates to optimizing the graph representation or the graph shift operator in a GNN. Our results further establish the theoretical guarantees on the optimality of the alignment for a two-layer GNN and these guarantees are characterized by the graph shift operator being a function of the cross-covariance between the input and the output data. The theoretical insights drawn from the analysis of NTKs are validated by our experiments focused on a multi-variate time series prediction task for a publicly available dataset. Specifically, they demonstrate that GNNs with cross-covariance as the graph shift operator indeed outperform those that operate on the covariance matrix from only the input data. ",
    "url": "https://arxiv.org/abs/2310.10791",
    "authors": [
      "Shervin Khalafi",
      "Saurabh Sihag",
      "Alejandro Ribeiro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.10810",
    "title": "Robust Multi-Agent Reinforcement Learning via Adversarial  Regularization: Theoretical Foundation and Stable Algorithms",
    "abstract": "Multi-Agent Reinforcement Learning (MARL) has shown promising results across several domains. Despite this promise, MARL policies often lack robustness and are therefore sensitive to small changes in their environment. This presents a serious concern for the real world deployment of MARL algorithms, where the testing environment may slightly differ from the training environment. In this work we show that we can gain robustness by controlling a policy's Lipschitz constant, and under mild conditions, establish the existence of a Lipschitz and close-to-optimal policy. Based on these insights, we propose a new robust MARL framework, ERNIE, that promotes the Lipschitz continuity of the policies with respect to the state observations and actions by adversarial regularization. The ERNIE framework provides robustness against noisy observations, changing transition dynamics, and malicious actions of agents. However, ERNIE's adversarial regularization may introduce some training instability. To reduce this instability, we reformulate adversarial regularization as a Stackelberg game. We demonstrate the effectiveness of the proposed framework with extensive experiments in traffic light control and particle environments. In addition, we extend ERNIE to mean-field MARL with a formulation based on distributionally robust optimization that outperforms its non-robust counterpart and is of independent interest. Our code is available at https://github.com/abukharin3/ERNIE. ",
    "url": "https://arxiv.org/abs/2310.10810",
    "authors": [
      "Alexander Bukharin",
      "Yan Li",
      "Yue Yu",
      "Qingru Zhang",
      "Zhehui Chen",
      "Simiao Zuo",
      "Chao Zhang",
      "Songan Zhang",
      "Tuo Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10815",
    "title": "Streaming Algorithms for Graph k-Matching with Optimal or Near-Optimal  Update Time",
    "abstract": "We present streaming algorithms for the graph $k$-matching problem in both the insert-only and dynamic models. Our algorithms, with space complexity matching the best upper bounds, have optimal or near-optimal update time, significantly improving on previous results. More specifically, for the insert-only streaming model, we present a one-pass algorithm with optimal space complexity $O(k^2)$ and optimal update time $O(1)$, that with high probability computes a maximum weighted $k$-matching of a given weighted graph. The update time of our algorithm significantly improves the previous upper bound of $O(\\log k)$, which was derived only for $k$-matching on unweighted graphs. For the dynamic streaming model, we present a one-pass algorithm that with high probability computes a maximum weighted $k$-matching in $O(Wk^2 \\cdot \\mbox{polylog}(n)$ space and with $O(\\mbox{polylog}(n))$ update time, where $W$ is the number of distinct edge weights. Again the update time of our algorithm improves the previous upper bound of $O(k^2 \\cdot \\mbox{polylog}(n))$. This algorithm, when applied to unweighted graphs, gives a streaming algorithm on the dynamic model whose space and update time complexities are both near-optimal. Our results also imply a streaming approximation algorithm for maximum weighted $k$-matching whose space complexity matches the best known upper bound with a significantly improved update time. ",
    "url": "https://arxiv.org/abs/2310.10815",
    "authors": [
      "Jianer Chen",
      "Qin Huang",
      "Iyad Kanj",
      "Qian Li",
      "Ge Xia"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2310.10828",
    "title": "Robustness and Approximation of Discrete-time Mean-field Games under  Discounted Cost Criterion",
    "abstract": "In this paper, we investigate the robustness of stationary mean-field equilibria in the presence of model uncertainties, specifically focusing on infinite-horizon discounted cost functions. To achieve this, we initially establish convergence conditions for value iteration-based algorithms in mean-field games. Subsequently, utilizing these results, we demonstrate that the mean-field equilibrium obtained through this value iteration algorithm remains robust even in the face of system dynamics misspecifications. We then apply these robustness findings to the finite model approximation problem in mean-field games, showing that if the state space quantization is fine enough, the mean-field equilibrium for the finite model closely approximates the nominal one. ",
    "url": "https://arxiv.org/abs/2310.10828",
    "authors": [
      "Uğur Aydın",
      "Naci Saldi"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2310.10830",
    "title": "Fake News in Sheep's Clothing: Robust Fake News Detection Against  LLM-Empowered Style Attacks",
    "abstract": "It is commonly perceived that online fake news and reliable news exhibit stark differences in writing styles, such as the use of sensationalist versus objective language. However, we emphasize that style-related features can also be exploited for style-based attacks. Notably, the rise of powerful Large Language Models (LLMs) has enabled malicious users to mimic the style of trustworthy news outlets at minimal cost. Our analysis reveals that LLM-camouflaged fake news content leads to substantial performance degradation of state-of-the-art text-based detectors (up to 38% decrease in F1 Score), posing a significant challenge for automated detection in online ecosystems. To address this, we introduce SheepDog, a style-agnostic fake news detector robust to news writing styles. SheepDog achieves this adaptability through LLM-empowered news reframing, which customizes each article to match different writing styles using style-oriented reframing prompts. By employing style-agnostic training, SheepDog enhances its resilience to stylistic variations by maximizing prediction consistency across these diverse reframings. Furthermore, SheepDog extracts content-focused veracity attributions from LLMs, where the news content is evaluated against a set of fact-checking rationales. These attributions provide supplementary information and potential interpretability that assist veracity prediction. On three benchmark datasets, empirical results show that SheepDog consistently yields significant improvements over competitive baselines and enhances robustness against LLM-empowered style attacks. ",
    "url": "https://arxiv.org/abs/2310.10830",
    "authors": [
      "Jiaying Wu",
      "Bryan Hooi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.10833",
    "title": "Proper Laplacian Representation Learning",
    "abstract": "The ability to learn good representations of states is essential for solving large reinforcement learning problems, where exploration, generalization, and transfer are particularly challenging. The Laplacian representation is a promising approach to address these problems by inducing intrinsic rewards for temporally-extended action discovery and reward shaping, and informative state encoding. To obtain the Laplacian representation one needs to compute the eigensystem of the graph Laplacian, which is often approximated through optimization objectives compatible with deep learning approaches. These approximations, however, depend on hyperparameters that are impossible to tune efficiently, converge to arbitrary rotations of the desired eigenvectors, and are unable to accurately recover the corresponding eigenvalues. In this paper we introduce a theoretically sound objective and corresponding optimization algorithm for approximating the Laplacian representation. Our approach naturally recovers both the true eigenvectors and eigenvalues while eliminating the hyperparameter dependence of previous approximations. We provide theoretical guarantees for our method and we show that those results translate empirically into robust learning across multiple environments. ",
    "url": "https://arxiv.org/abs/2310.10833",
    "authors": [
      "Diego Gomez",
      "Michael Bowling",
      "Marlos C. Machado"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.10836",
    "title": "Gaussian processes based data augmentation and expected signature for  time series classification",
    "abstract": "The signature is a fundamental object that describes paths (that is, continuous functions from an interval to a Euclidean space). Likewise, the expected signature provides a statistical description of the law of stochastic processes. We propose a feature extraction model for time series built upon the expected signature. This is computed through a Gaussian processes based data augmentation. One of the main features is that an optimal feature extraction is learnt through the supervised task that uses the model. ",
    "url": "https://arxiv.org/abs/2310.10836",
    "authors": [
      "Marco Romito",
      "Francesco Triggiano"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10837",
    "title": "Approximating Two-Layer Feedforward Networks for Efficient Transformers",
    "abstract": "How to reduce compute and memory requirements of neural networks (NNs) without sacrificing performance? Many recent works use sparse Mixtures of Experts (MoEs) to build resource-efficient large language models (LMs). Here we introduce several novel perspectives on MoEs, presenting a general framework that unifies various methods to approximate two-layer NNs (e.g., feedforward blocks of Transformers), including product-key memories (PKMs). Leveraging insights from this framework, we propose methods to improve both MoEs and PKMs. Unlike prior work that compares MoEs with dense baselines under the compute-equal condition, our evaluation condition is parameter-equal, which is crucial to properly evaluate LMs. We show that our MoEs are competitive with the dense Transformer-XL on both the WikiText-103 and enwiki8 datasets at two different scales, while being much more resource efficient. This demonstrates that MoEs are relevant not only to extremely large LMs but also to any-scale resource-efficient LMs. Our code is public. ",
    "url": "https://arxiv.org/abs/2310.10837",
    "authors": [
      "Róbert Csordás",
      "Kazuki Irie",
      "Jürgen Schmidhuber"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2310.10841",
    "title": "A Machine Learning-based Algorithm for Automated Detection of  Frequency-based Events in Recorded Time Series of Sensor Data",
    "abstract": "Automated event detection has emerged as one of the fundamental practices to monitor the behavior of technical systems by means of sensor data. In the automotive industry, these methods are in high demand for tracing events in time series data. For assessing the active vehicle safety systems, a diverse range of driving scenarios is conducted. These scenarios involve the recording of the vehicle's behavior using external sensors, enabling the evaluation of operational performance. In such setting, automated detection methods not only accelerate but also standardize and objectify the evaluation by avoiding subjective, human-based appraisals in the data inspection. This work proposes a novel event detection method that allows to identify frequency-based events in time series data. To this aim, the time series data is mapped to representations in the time-frequency domain, known as scalograms. After filtering scalograms to enhance relevant parts of the signal, an object detection model is trained to detect the desired event objects in the scalograms. For the analysis of unseen time series data, events can be detected in their scalograms with the trained object detection model and are thereafter mapped back to the time series data to mark the corresponding time interval. The algorithm, evaluated on unseen datasets, achieves a precision rate of 0.97 in event detection, providing sharp time interval boundaries whose accurate indication by human visual inspection is challenging. Incorporating this method into the vehicle development process enhances the accuracy and reliability of event detection, which holds major importance for rapid testing analysis. ",
    "url": "https://arxiv.org/abs/2310.10841",
    "authors": [
      "Bahareh Medghalchi",
      "Andreas Vogel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2310.10844",
    "title": "Survey of Vulnerabilities in Large Language Models Revealed by  Adversarial Attacks",
    "abstract": "Large Language Models (LLMs) are swiftly advancing in architecture and capability, and as they integrate more deeply into complex systems, the urgency to scrutinize their security properties grows. This paper surveys research in the emerging interdisciplinary field of adversarial attacks on LLMs, a subfield of trustworthy ML, combining the perspectives of Natural Language Processing and Security. Prior work has shown that even safety-aligned LLMs (via instruction tuning and reinforcement learning through human feedback) can be susceptible to adversarial attacks, which exploit weaknesses and mislead AI systems, as evidenced by the prevalence of `jailbreak' attacks on models like ChatGPT and Bard. In this survey, we first provide an overview of large language models, describe their safety alignment, and categorize existing research based on various learning structures: textual-only attacks, multi-modal attacks, and additional attack methods specifically targeting complex systems, such as federated learning or multi-agent systems. We also offer comprehensive remarks on works that focus on the fundamental sources of vulnerabilities and potential defenses. To make this field more accessible to newcomers, we present a systematic review of existing works, a structured typology of adversarial attack concepts, and additional resources, including slides for presentations on related topics at the 62nd Annual Meeting of the Association for Computational Linguistics (ACL'24). ",
    "url": "https://arxiv.org/abs/2310.10844",
    "authors": [
      "Erfan Shayegani",
      "Md Abdullah Al Mamun",
      "Yu Fu",
      "Pedram Zaree",
      "Yue Dong",
      "Nael Abu-Ghazaleh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10851",
    "title": "Tracking China's cross-strait bot networks against Taiwan",
    "abstract": "The cross-strait relationship between China and Taiwan is marked by increasing hostility around potential reunification. We analyze an unattributed bot network and how repeater bots engaged in an influence campaign against Taiwan following US House Speaker Nancy Pelosi's visit to Taiwan in 2022. We examine the message amplification tactics employed by four key bot sub-communities, the widespread dissemination of information across multiple platforms through URLs, and the potential targeted audiences of this bot network. We find that URL link sharing reveals circumvention around YouTube suspensions, in addition to the potential effectiveness of algorithmic bot connectivity to appear less bot-like, and detail a sequence of coordination within a sub-community for message amplification. We additionally find the narratives and targeted audience potentially shifting after account activity discrepancies, demonstrating how dynamic these bot networks can operate. ",
    "url": "https://arxiv.org/abs/2310.10851",
    "authors": [
      "Charity S. Jacobs",
      "Lynnette Hui Xian Ng",
      "Kathleen M. Carley"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2310.10856",
    "title": "Joint Optimization of Traffic Signal Control and Vehicle Routing in  Signalized Road Networks using Multi-Agent Deep Reinforcement Learning",
    "abstract": "Urban traffic congestion is a critical predicament that plagues modern road networks. To alleviate this issue and enhance traffic efficiency, traffic signal control and vehicle routing have proven to be effective measures. In this paper, we propose a joint optimization approach for traffic signal control and vehicle routing in signalized road networks. The objective is to enhance network performance by simultaneously controlling signal timings and route choices using Multi-Agent Deep Reinforcement Learning (MADRL). Signal control agents (SAs) are employed to establish signal timings at intersections, whereas vehicle routing agents (RAs) are responsible for selecting vehicle routes. By establishing relevance between agents and enabling them to share observations and rewards, interaction and cooperation among agents are fostered, which enhances individual training. The Multi-Agent Advantage Actor-Critic algorithm is used to handle multi-agent environments, and Deep Neural Network (DNN) structures are designed to facilitate the algorithm's convergence. Notably, our work is the first to utilize MADRL in determining the optimal joint policy for signal control and vehicle routing. Numerical experiments conducted on the modified Sioux network demonstrate that our integration of signal control and vehicle routing outperforms controlling signal timings or vehicles' routes alone in enhancing traffic efficiency. ",
    "url": "https://arxiv.org/abs/2310.10856",
    "authors": [
      "Xianyue Peng",
      "Hang Gao",
      "Gengyue Han",
      "Hao Wang",
      "Michael Zhang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2310.10861",
    "title": "SoybeanNet: Transformer-Based Convolutional Neural Network for Soybean  Pod Counting from Unmanned Aerial Vehicle (UAV) Images",
    "abstract": "Soybeans are a critical source of food, protein and oil, and thus have received extensive research aimed at enhancing their yield, refining cultivation practices, and advancing soybean breeding techniques. Within this context, soybean pod counting plays an essential role in understanding and optimizing production. Despite recent advancements, the development of a robust pod-counting algorithm capable of performing effectively in real-field conditions remains a significant challenge This paper presents a pioneering work of accurate soybean pod counting utilizing unmanned aerial vehicle (UAV) images captured from actual soybean fields in Michigan, USA. Specifically, this paper presents SoybeanNet, a novel point-based counting network that harnesses powerful transformer backbones for simultaneous soybean pod counting and localization with high accuracy. In addition, a new dataset of UAV-acquired images for soybean pod counting was created and open-sourced, consisting of 113 drone images with more than 260k manually annotated soybean pods captured under natural lighting conditions. Through comprehensive evaluations, SoybeanNet demonstrated superior performance over five state-of-the-art approaches when tested on the collected images. Remarkably, SoybeanNet achieved a counting accuracy of $84.51\\%$ when tested on the testing dataset, attesting to its efficacy in real-world scenarios. The publication also provides both the source code (\\url{https://github.com/JiajiaLi04/Soybean-Pod-Counting-from-UAV-Images}) and the labeled soybean dataset (\\url{https://www.kaggle.com/datasets/jiajiali/uav-based-soybean-pod-images}), offering a valuable resource for future research endeavors in soybean pod counting and related fields. ",
    "url": "https://arxiv.org/abs/2310.10861",
    "authors": [
      "Jiajia Li",
      "Raju Thada Magar",
      "Dong Chen",
      "Feng Lin",
      "Dechun Wang",
      "Xiang Yin",
      "Weichao Zhuang",
      "Zhaojian Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.10878",
    "title": "Eco-Driving Control of Connected and Automated Vehicles using Neural  Network based Rollout",
    "abstract": "Connected and autonomous vehicles have the potential to minimize energy consumption by optimizing the vehicle velocity and powertrain dynamics with Vehicle-to-Everything info en route. Existing deterministic and stochastic methods created to solve the eco-driving problem generally suffer from high computational and memory requirements, which makes online implementation challenging. This work proposes a hierarchical multi-horizon optimization framework implemented via a neural network. The neural network learns a full-route value function to account for the variability in route information and is then used to approximate the terminal cost in a receding horizon optimization. Simulations over real-world routes demonstrate that the proposed approach achieves comparable performance to a stochastic optimization solution obtained via reinforcement learning, while requiring no sophisticated training paradigm and negligible on-board memory. ",
    "url": "https://arxiv.org/abs/2310.10878",
    "authors": [
      "Jacob Paugh",
      "Zhaoxuan Zhu",
      "Shobhit Gupta",
      "Marcello Canova",
      "Stephanie Stockar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10879",
    "title": "BLoad: Enhancing Neural Network Training with Efficient Sequential Data  Handling",
    "abstract": "The increasing complexity of modern deep neural network models and the expanding sizes of datasets necessitate the development of optimized and scalable training methods. In this white paper, we addressed the challenge of efficiently training neural network models using sequences of varying sizes. To address this challenge, we propose a novel training scheme that enables efficient distributed data-parallel training on sequences of different sizes with minimal overhead. By using this scheme we were able to reduce the padding amount by more than 100$x$ while not deleting a single frame, resulting in an overall increased performance on both training time and Recall in our experiments. ",
    "url": "https://arxiv.org/abs/2310.10879",
    "authors": [
      "Raphael Ruschel",
      "A. S. M. Iftekhar",
      "B. S. Manjunath",
      "Suya You"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2310.10898",
    "title": "Analyzing Modularity Maximization in Approximation, Heuristic, and Graph  Neural Network Algorithms for Community Detection",
    "abstract": "Community detection, a fundamental problem in computational sciences, finds applications in various domains. Heuristics are often employed to detect communities through maximizing an objective function, modularity, over partitions of network nodes. Our research delves into the performance of different modularity maximization algorithms in achieving optimal partitions. We use 104 networks, comprising real-world instances from diverse contexts and synthetic graphs with modular structures. We analyze ten inexact modularity-based algorithms against an exact baseline which is an exact integer programming method that globally optimizes modularity. The ten algorithms analyzed include eight heuristics, two variations of a graph neural network algorithm, and several variations of the Bayan approximation algorithm. Our analysis uncovers substantial dissimilarities between the partitions obtained by most commonly used modularity-based methods and any optimal partition of the networks, as indicated by both adjusted and reduced mutual information metrics. Importantly, our results show that near-optimal partitions are often disproportionately dissimilar to any optimal partition. Taken together, our analysis points to a crucial limitation of the commonly used unguaranteed modularity-based methods for discovering communities: they rarely produce an optimal partition or a partition resembling an optimal partition even on networks with modular structures. If modularity is to be used for detecting communities, approximate optimization algorithms are recommendable for a more methodologically sound usage of modularity within its applicability limits. ",
    "url": "https://arxiv.org/abs/2310.10898",
    "authors": [
      "Samin Aref",
      "Mahdi Mostajabdaveh"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2310.10909",
    "title": "Heterogenous Memory Augmented Neural Networks",
    "abstract": "It has been shown that semi-parametric methods, which combine standard neural networks with non-parametric components such as external memory modules and data retrieval, are particularly helpful in data scarcity and out-of-distribution (OOD) scenarios. However, existing semi-parametric methods mostly depend on independent raw data points - this strategy is difficult to scale up due to both high computational costs and the incapacity of current attention mechanisms with a large number of tokens. In this paper, we introduce a novel heterogeneous memory augmentation approach for neural networks which, by introducing learnable memory tokens with attention mechanism, can effectively boost performance without huge computational overhead. Our general-purpose method can be seamlessly combined with various backbones (MLP, CNN, GNN, and Transformer) in a plug-and-play manner. We extensively evaluate our approach on various image and graph-based tasks under both in-distribution (ID) and OOD conditions and show its competitive performance against task-specific state-of-the-art methods. Code is available at \\url{https://github.com/qiuzh20/HMA}. ",
    "url": "https://arxiv.org/abs/2310.10909",
    "authors": [
      "Zihan Qiu",
      "Zhen Liu",
      "Shuicheng Yan",
      "Shanghang Zhang",
      "Jie Fu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10922",
    "title": "Spatial HuBERT: Self-supervised Spatial Speech Representation Learning  for a Single Talker from Multi-channel Audio",
    "abstract": "Self-supervised learning has been used to leverage unlabelled data, improving accuracy and generalisation of speech systems through the training of representation models. While many recent works have sought to produce effective representations across a variety of acoustic domains, languages, modalities and even simultaneous speakers, these studies have all been limited to single-channel audio recordings. This paper presents Spatial HuBERT, a self-supervised speech representation model that learns both acoustic and spatial information pertaining to a single speaker in a potentially noisy environment by using multi-channel audio inputs. Spatial HuBERT learns representations that outperform state-of-the-art single-channel speech representations on a variety of spatial downstream tasks, particularly in reverberant and noisy environments. We also demonstrate the utility of the representations learned by Spatial HuBERT on a speech localisation downstream task. Along with this paper, we publicly release a new dataset of 100 000 simulated first-order ambisonics room impulse responses. ",
    "url": "https://arxiv.org/abs/2310.10922",
    "authors": [
      "Antoni Dimitriadis",
      "Siqi Pan",
      "Vidhyasaharan Sethu",
      "Beena Ahmed"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2310.10935",
    "title": "Intent Detection and Slot Filling for Home Assistants: Dataset and  Analysis for Bangla and Sylheti",
    "abstract": "As voice assistants cement their place in our technologically advanced society, there remains a need to cater to the diverse linguistic landscape, including colloquial forms of low-resource languages. Our study introduces the first-ever comprehensive dataset for intent detection and slot filling in formal Bangla, colloquial Bangla, and Sylheti languages, totaling 984 samples across 10 unique intents. Our analysis reveals the robustness of large language models for tackling downstream tasks with inadequate data. The GPT-3.5 model achieves an impressive F1 score of 0.94 in intent detection and 0.51 in slot filling for colloquial Bangla. ",
    "url": "https://arxiv.org/abs/2310.10935",
    "authors": [
      "Fardin Ahsan Sakib",
      "A H M Rezaul Karim",
      "Saadat Hasan Khan",
      "Md Mushfiqur Rahman"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10941",
    "title": "MASON-NLP at eRisk 2023: Deep Learning-Based Detection of Depression  Symptoms from Social Media Texts",
    "abstract": "Depression is a mental health disorder that has a profound impact on people's lives. Recent research suggests that signs of depression can be detected in the way individuals communicate, both through spoken words and written texts. In particular, social media posts are a rich and convenient text source that we may examine for depressive symptoms. The Beck Depression Inventory (BDI) Questionnaire, which is frequently used to gauge the severity of depression, is one instrument that can aid in this study. We can narrow our study to only those symptoms since each BDI question is linked to a particular depressive symptom. It's important to remember that not everyone with depression exhibits all symptoms at once, but rather a combination of them. Therefore, it is extremely useful to be able to determine if a sentence or a piece of user-generated content is pertinent to a certain condition. With this in mind, the eRisk 2023 Task 1 was designed to do exactly that: assess the relevance of different sentences to the symptoms of depression as outlined in the BDI questionnaire. This report is all about how our team, Mason-NLP, participated in this subtask, which involved identifying sentences related to different depression symptoms. We used a deep learning approach that incorporated MentalBERT, RoBERTa, and LSTM. Despite our efforts, the evaluation results were lower than expected, underscoring the challenges inherent in ranking sentences from an extensive dataset about depression, which necessitates both appropriate methodological choices and significant computational resources. We anticipate that future iterations of this shared task will yield improved results as our understanding and techniques evolve. ",
    "url": "https://arxiv.org/abs/2310.10941",
    "authors": [
      "Fardin Ahsan Sakib",
      "Ahnaf Atef Choudhury",
      "Ozlem Uzuner"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10948",
    "title": "Combat Urban Congestion via Collaboration: Heterogeneous GNN-based MARL  for Coordinated Platooning and Traffic Signal Control",
    "abstract": "Over the years, reinforcement learning has emerged as a popular approach to develop signal control and vehicle platooning strategies either independently or in a hierarchical way. However, jointly controlling both in real-time to alleviate traffic congestion presents new challenges, such as the inherent physical and behavioral heterogeneity between signal control and platooning, as well as coordination between them. This paper proposes an innovative solution to tackle these challenges based on heterogeneous graph multi-agent reinforcement learning and traffic theories. Our approach involves: 1) designing platoon and signal control as distinct reinforcement learning agents with their own set of observations, actions, and reward functions to optimize traffic flow; 2) designing coordination by incorporating graph neural networks within multi-agent reinforcement learning to facilitate seamless information exchange among agents on a regional scale. We evaluate our approach through SUMO simulation, which shows a convergent result in terms of various transportation metrics and better performance over sole signal or platooning control. ",
    "url": "https://arxiv.org/abs/2310.10948",
    "authors": [
      "Xianyue Peng",
      "Hang Gao",
      "Hao Wang",
      "H. Michael Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2310.10949",
    "title": "Network-aware EV charging and discharging in unbalanced distribution  grids: A distributed, robust approach against communication failures",
    "abstract": "This paper proposes a distributed optimization-based algorithm for electric vehicle (EV) charging and discharging, incorporating EV customer economics and distribution network constraints enforced on an unbalanced distribution grid. Building on a consensus-based alternating direction method of multipliers (ADMM), the algorithm is designed such that EVs coordinate by means of exchanging limited information with their neighboring EVs in a connected communication network. Specifically, an iterative routine is executed, whereby EVs cooperatively determine their charge-discharge profiles that maintain the distribution grid voltages and transformer core temperatures within safe operating limits. Importantly, the algorithm is robust against communication failures potentially arising in real-world implementations. Numerical simulations are conducted to verify the efficacy of the proposed EV charging algorithm in terms of network-aware operation and communication-failure tolerant operation. ",
    "url": "https://arxiv.org/abs/2310.10949",
    "authors": [
      "Nanduni Nimalsiri",
      "Elizabeth Ratnam"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.10953",
    "title": "A Local Graph Limits Perspective on Sampling-Based GNNs",
    "abstract": "We propose a theoretical framework for training Graph Neural Networks (GNNs) on large input graphs via training on small, fixed-size sampled subgraphs. This framework is applicable to a wide range of models, including popular sampling-based GNNs, such as GraphSAGE and FastGCN. Leveraging the theory of graph local limits, we prove that, under mild assumptions, parameters learned from training sampling-based GNNs on small samples of a large input graph are within an $\\epsilon$-neighborhood of the outcome of training the same architecture on the whole graph. We derive bounds on the number of samples, the size of the graph, and the training steps required as a function of $\\epsilon$. Our results give a novel theoretical understanding for using sampling in training GNNs. They also suggest that by training GNNs on small samples of the input graph, practitioners can identify and select the best models, hyperparameters, and sampling algorithms more efficiently. We empirically illustrate our results on a node classification task on large citation graphs, observing that sampling-based GNNs trained on local subgraphs 12$\\times$ smaller than the original graph achieve comparable performance to those trained on the input graph. ",
    "url": "https://arxiv.org/abs/2310.10953",
    "authors": [
      "Yeganeh Alimohammadi",
      "Luana Ruiz",
      "Amin Saberi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.10958",
    "title": "Enhancing Deep Neural Network Training Efficiency and Performance  through Linear Prediction",
    "abstract": "Deep neural networks (DNN) have achieved remarkable success in various fields, including computer vision and natural language processing. However, training an effective DNN model still poses challenges. This paper aims to propose a method to optimize the training effectiveness of DNN, with the goal of improving model performance. Firstly, based on the observation that the DNN parameters change in certain laws during training process, the potential of parameter prediction for improving model training efficiency and performance is discovered. Secondly, considering the magnitude of DNN model parameters, hardware limitations and characteristics of Stochastic Gradient Descent (SGD) for noise tolerance, a Parameter Linear Prediction (PLP) method is exploit to perform DNN parameter prediction. Finally, validations are carried out on some representative backbones. Experiment results show that compare to the normal training ways, under the same training conditions and epochs, by employing proposed PLP method, the optimal model is able to obtain average about 1% accuracy improvement and 0.01 top-1/top-5 error reduction for Vgg16, Resnet18 and GoogLeNet based on CIFAR-100 dataset, which shown the effectiveness of the proposed method on different DNN structures, and validated its capacity in enhancing DNN training efficiency and performance. ",
    "url": "https://arxiv.org/abs/2310.10958",
    "authors": [
      "Hejie Ying",
      "Mengmeng Song",
      "Yaohong Tang",
      "Shungen Xiao",
      "Zimin Xiao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.10962",
    "title": "Semantic-Aware Contrastive Sentence Representation Learning with Large  Language Models",
    "abstract": "Contrastive learning has been proven to be effective in learning better sentence representations. However, to train a contrastive learning model, large numbers of labeled sentences are required to construct positive and negative pairs explicitly, such as those in natural language inference (NLI) datasets. Unfortunately, acquiring sufficient high-quality labeled data can be both time-consuming and resource-intensive, leading researchers to focus on developing methods for learning unsupervised sentence representations. As there is no clear relationship between these unstructured randomly-sampled sentences, building positive and negative pairs over them is tricky and problematic. To tackle these challenges, in this paper, we propose SemCSR, a semantic-aware contrastive sentence representation framework. By leveraging the generation and evaluation capabilities of large language models (LLMs), we can automatically construct a high-quality NLI-style corpus without any human annotation, and further incorporate the generated sentence pairs into learning a contrastive sentence representation model. Extensive experiments and comprehensive analyses demonstrate the effectiveness of our proposed framework for learning a better sentence representation with LLMs. ",
    "url": "https://arxiv.org/abs/2310.10962",
    "authors": [
      "Huiming Wang",
      "Liying Cheng",
      "Zhaodonghui Li",
      "De Wen Soh",
      "Lidong Bing"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.10975",
    "title": "NICE: Improving Panoptic Narrative Detection and Segmentation with  Cascading Collaborative Learning",
    "abstract": "Panoptic Narrative Detection (PND) and Segmentation (PNS) are two challenging tasks that involve identifying and locating multiple targets in an image according to a long narrative description. In this paper, we propose a unified and effective framework called NICE that can jointly learn these two panoptic narrative recognition tasks. Existing visual grounding tasks use a two-branch paradigm, but applying this directly to PND and PNS can result in prediction conflict due to their intrinsic many-to-many alignment property. To address this, we introduce two cascading modules based on the barycenter of the mask, which are Coordinate Guided Aggregation (CGA) and Barycenter Driven Localization (BDL), responsible for segmentation and detection, respectively. By linking PNS and PND in series with the barycenter of segmentation as the anchor, our approach naturally aligns the two tasks and allows them to complement each other for improved performance. Specifically, CGA provides the barycenter as a reference for detection, reducing BDL's reliance on a large number of candidate boxes. BDL leverages its excellent properties to distinguish different instances, which improves the performance of CGA for segmentation. Extensive experiments demonstrate that NICE surpasses all existing methods by a large margin, achieving 4.1% for PND and 2.9% for PNS over the state-of-the-art. These results validate the effectiveness of our proposed collaborative learning strategy. The project of this work is made publicly available at https://github.com/Mr-Neko/NICE. ",
    "url": "https://arxiv.org/abs/2310.10975",
    "authors": [
      "Haowei Wang",
      "Jiayi Ji",
      "Tianyu Guo",
      "Yilong Yang",
      "Yiyi Zhou",
      "Xiaoshuai Sun",
      "Rongrong Ji"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.10987",
    "title": "Why Do Students Drop Out? University Dropout Prediction and Associated  Factor Analysis Using Machine Learning Techniques",
    "abstract": "Graduation and dropout rates have always been a serious consideration for educational institutions and students. High dropout rates negatively impact both the lives of individual students and institutions. To address this problem, this study examined university dropout prediction using academic, demographic, socioeconomic, and macroeconomic data types. Additionally, we performed associated factor analysis to analyze which type of data would be most influential on the performance of machine learning models in predicting graduation and dropout status. These features were used to train four binary classifiers to determine if students would graduate or drop out. The overall performance of the classifiers in predicting dropout status had an average ROC-AUC score of 0.935. The data type most influential to the model performance was found to be academic data, with the average ROC-AUC score dropping from 0.935 to 0.811 when excluding all academic-related features from the data set. Preliminary results indicate that a correlation does exist between data types and dropout status. ",
    "url": "https://arxiv.org/abs/2310.10987",
    "authors": [
      "Sean Kim",
      "Eliot Yoo",
      "Samuel Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2310.10992",
    "title": "A High Fidelity and Low Complexity Neural Audio Coding",
    "abstract": "Audio coding is an essential module in the real-time communication system. Neural audio codecs can compress audio samples with a low bitrate due to the strong modeling and generative capabilities of deep neural networks. To address the poor high-frequency expression and high computational cost and storage consumption, we proposed an integrated framework that utilizes a neural network to model wide-band components and adopts traditional signal processing to compress high-band components according to psychological hearing knowledge. Inspired by auditory perception theory, a perception-based loss function is designed to improve harmonic modeling. Besides, generative adversarial network (GAN) compression is proposed for the first time for neural audio codecs. Our method is superior to prior advanced neural codecs across subjective and objective metrics and allows real-time inference on desktop and mobile. ",
    "url": "https://arxiv.org/abs/2310.10992",
    "authors": [
      "Wenzhe Liu",
      "Wei Xiao",
      "Meng Wang",
      "Shan Yang",
      "Yupeng Shi",
      "Yuyong Kang",
      "Dan Su",
      "Shidong Shang",
      "Dong Yu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2310.10996",
    "title": "ClarifyGPT: Empowering LLM-based Code Generation with Intention  Clarification",
    "abstract": "We introduce a novel framework named ClarifyGPT, which aims to enhance code generation by empowering LLMs with the ability to identify ambiguous requirements and ask targeted clarifying questions. In particular, ClarifyGPT first detects whether a given requirement is ambiguous by performing a code consistency check. If it is ambiguous, ClarifyGPT prompts an LLM to generate targeted clarifying questions. After receiving question responses, ClarifyGPT refines the ambiguous requirement and inputs it into the same LLM to generate a final code solution. To evaluate our ClarifyGPT, we first conduct a human evaluation involving ten participants who use ClarifyGPT for code generation on two publicly available benchmarks: MBPP-sanitized and MBPP-ET. The results show that ClarifyGPT elevates the performance (Pass@1) of GPT-4 from 70.96% to 80.80% on MBPP-sanitized. Furthermore, to perform large-scale automated evaluations of ClarifyGPT across different LLMs and benchmarks without requiring user participation, we introduce a high-fidelity simulation method to simulate user responses. The automated evaluation results also demonstrate that ClarifyGPT can significantly enhance code generation performance compared to the baselines. In particular, ClarifyGPT improves the average performance of GPT-4 and ChatGPT across four benchmarks from 68.02% to 75.75% and from 58.55% to 67.22%, respectively. We believe that ClarifyGPT can effectively facilitate the practical application of LLMs in real-world development environments. ",
    "url": "https://arxiv.org/abs/2310.10996",
    "authors": [
      "Fangwen Mu",
      "Lin Shi",
      "Song Wang",
      "Zhuohao Yu",
      "Binquan Zhang",
      "Chenxue Wang",
      "Shichao Liu",
      "Qing Wang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2310.10997",
    "title": "Cooperative Dispatch of Microgrids Community Using Risk-Sensitive  Reinforcement Learning with Monotonously Improved Performance",
    "abstract": "The integration of individual microgrids (MGs) into Microgrid Clusters (MGCs) significantly improves the reliability and flexibility of energy supply, through resource sharing and ensuring backup during outages. The dispatch of MGCs is the key challenge to be tackled to ensure their secure and economic operation. Currently, there is a lack of optimization method that can achieve a trade-off among top-priority requirements of MGCs' dispatch, including fast computation speed, optimality, multiple objectives, and risk mitigation against uncertainty. In this paper, a novel Multi-Objective, Risk-Sensitive, and Online Trust Region Policy Optimization (RS-TRPO) Algorithm is proposed to tackle this problem. First, a dispatch paradigm for autonomous MGs in the MGC is proposed, enabling them sequentially implement their self-dispatch to mitigate potential conflicts. This dispatch paradigm is then formulated as a Markov Game model, which is finally solved by the RS-TRPO algorithm. This online algorithm enables MGs to spontaneously search for the Pareto Frontier considering multiple objectives and risk mitigation. The outstanding computational performance of this algorithm is demonstrated in comparison with mathematical programming methods and heuristic algorithms in a modified IEEE 30-Bus Test System integrated with four autonomous MGs. ",
    "url": "https://arxiv.org/abs/2310.10997",
    "authors": [
      "Ziqing Zhu",
      "Xiang Gao",
      "Siqi Bu",
      "Ka Wing Chan",
      "Bin Zhou",
      "Shiwei Xia"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.10998",
    "title": "Accelerating Scalable Graph Neural Network Inference with Node-Adaptive  Propagation",
    "abstract": "Graph neural networks (GNNs) have exhibited exceptional efficacy in a diverse array of applications. However, the sheer size of large-scale graphs presents a significant challenge to real-time inference with GNNs. Although existing Scalable GNNs leverage linear propagation to preprocess the features and accelerate the training and inference procedure, these methods still suffer from scalability issues when making inferences on unseen nodes, as the feature preprocessing requires the graph to be known and fixed. To further accelerate Scalable GNNs inference in this inductive setting, we propose an online propagation framework and two novel node-adaptive propagation methods that can customize the optimal propagation depth for each node based on its topological information and thereby avoid redundant feature propagation. The trade-off between accuracy and latency can be flexibly managed through simple hyper-parameters to accommodate various latency constraints. Moreover, to compensate for the inference accuracy loss caused by the potential early termination of propagation, we further propose Inception Distillation to exploit the multi-scale receptive field information within graphs. The rigorous and comprehensive experimental study on public datasets with varying scales and characteristics demonstrates that the proposed inference acceleration framework outperforms existing state-of-the-art graph inference acceleration methods in terms of accuracy and efficiency. Particularly, the superiority of our approach is notable on datasets with larger scales, yielding a 75x inference speedup on the largest Ogbn-products dataset. ",
    "url": "https://arxiv.org/abs/2310.10998",
    "authors": [
      "Xinyi Gao",
      "Wentao Zhang",
      "Junliang Yu",
      "Yingxia Shao",
      "Quoc Viet Hung Nguyen",
      "Bin Cui",
      "Hongzhi Yin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.11001",
    "title": "Spatially-resolved hyperlocal weather prediction and anomaly detection  using IoT sensor networks and machine learning techniques",
    "abstract": "Accurate and timely hyperlocal weather predictions are essential for various applications, ranging from agriculture to disaster management. In this paper, we propose a novel approach that combines hyperlocal weather prediction and anomaly detection using IoT sensor networks and advanced machine learning techniques. Our approach leverages data from multiple spatially-distributed yet relatively close locations and IoT sensors to create high-resolution weather models capable of predicting short-term, localized weather conditions such as temperature, pressure, and humidity. By monitoring changes in weather parameters across these locations, our system is able to enhance the spatial resolution of predictions and effectively detect anomalies in real-time. Additionally, our system employs unsupervised learning algorithms to identify unusual weather patterns, providing timely alerts. Our findings indicate that this system has the potential to enhance decision-making. ",
    "url": "https://arxiv.org/abs/2310.11001",
    "authors": [
      "Anita B. Agarwal",
      "Rohit Rajesh",
      "Nitin Arul"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.11009",
    "title": "Adaptive Pairwise Encodings for Link Prediction",
    "abstract": "Link prediction is a common task on graph-structured data that has seen applications in a variety of domains. Classically, hand-crafted heuristics were used for this task. Heuristic measures are chosen such that they correlate well with the underlying factors related to link formation. In recent years, a new class of methods has emerged that combines the advantages of message-passing neural networks (MPNN) and heuristics methods. These methods perform predictions by using the output of an MPNN in conjunction with a \"pairwise encoding\" that captures the relationship between nodes in the candidate link. They have been shown to achieve strong performance on numerous datasets. However, current pairwise encodings often contain a strong inductive bias, using the same underlying factors to classify all links. This limits the ability of existing methods to learn how to properly classify a variety of different links that may form from different factors. To address this limitation, we propose a new method, LPFormer, which attempts to adaptively learn the pairwise encodings for each link. LPFormer models the link factors via an attention module that learns the pairwise encoding that exists between nodes by modeling multiple factors integral to link prediction. Extensive experiments demonstrate that LPFormer can achieve SOTA performance on numerous datasets while maintaining efficiency. ",
    "url": "https://arxiv.org/abs/2310.11009",
    "authors": [
      "Harry Shomer",
      "Yao Ma",
      "Haitao Ma",
      "Juanhui Li",
      "Bo Wu",
      "Jiliang Tang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.11011",
    "title": "From Identifiable Causal Representations to Controllable Counterfactual  Generation: A Survey on Causal Generative Modeling",
    "abstract": "Deep generative models have shown tremendous success in data density estimation and data generation from finite samples. While these models have shown impressive performance by learning correlations among features in the data, some fundamental shortcomings are their lack of explainability, the tendency to induce spurious correlations, and poor out-of-distribution extrapolation. In an effort to remedy such challenges, one can incorporate the theory of causality in deep generative modeling. Structural causal models (SCMs) describe data-generating processes and model complex causal relationships and mechanisms among variables in a system. Thus, SCMs can naturally be combined with deep generative models. Causal models offer several beneficial properties to deep generative models, such as distribution shift robustness, fairness, and interoperability. We provide a technical survey on causal generative modeling categorized into causal representation learning and controllable counterfactual generation methods. We focus on fundamental theory, formulations, drawbacks, datasets, metrics, and applications of causal generative models in fairness, privacy, out-of-distribution generalization, and precision medicine. We also discuss open problems and fruitful research directions for future work in the field. ",
    "url": "https://arxiv.org/abs/2310.11011",
    "authors": [
      "Aneesh Komanduri",
      "Xintao Wu",
      "Yongkai Wu",
      "Feng Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.11016",
    "title": "Reading Order Matters: Information Extraction from Visually-rich  Documents by Token Path Prediction",
    "abstract": "Recent advances in multimodal pre-trained models have significantly improved information extraction from visually-rich documents (VrDs), in which named entity recognition (NER) is treated as a sequence-labeling task of predicting the BIO entity tags for tokens, following the typical setting of NLP. However, BIO-tagging scheme relies on the correct order of model inputs, which is not guaranteed in real-world NER on scanned VrDs where text are recognized and arranged by OCR systems. Such reading order issue hinders the accurate marking of entities by BIO-tagging scheme, making it impossible for sequence-labeling methods to predict correct named entities. To address the reading order issue, we introduce Token Path Prediction (TPP), a simple prediction head to predict entity mentions as token sequences within documents. Alternative to token classification, TPP models the document layout as a complete directed graph of tokens, and predicts token paths within the graph as entities. For better evaluation of VrD-NER systems, we also propose two revised benchmark datasets of NER on scanned documents which can reflect real-world scenarios. Experiment results demonstrate the effectiveness of our method, and suggest its potential to be a universal solution to various information extraction tasks on documents. ",
    "url": "https://arxiv.org/abs/2310.11016",
    "authors": [
      "Chong Zhang",
      "Ya Guo",
      "Yi Tu",
      "Huan Chen",
      "Jinyang Tang",
      "Huijia Zhu",
      "Qi Zhang",
      "Tao Gui"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.11025",
    "title": "SignGT: Signed Attention-based Graph Transformer for Graph  Representation Learning",
    "abstract": "The emerging graph Transformers have achieved impressive performance for graph representation learning over graph neural networks (GNNs). In this work, we regard the self-attention mechanism, the core module of graph Transformers, as a two-step aggregation operation on a fully connected graph. Due to the property of generating positive attention values, the self-attention mechanism is equal to conducting a smooth operation on all nodes, preserving the low-frequency information. However, only capturing the low-frequency information is inefficient in learning complex relations of nodes on diverse graphs, such as heterophily graphs where the high-frequency information is crucial. To this end, we propose a Signed Attention-based Graph Transformer (SignGT) to adaptively capture various frequency information from the graphs. Specifically, SignGT develops a new signed self-attention mechanism (SignSA) that produces signed attention values according to the semantic relevance of node pairs. Hence, the diverse frequency information between different node pairs could be carefully preserved. Besides, SignGT proposes a structure-aware feed-forward network (SFFN) that introduces the neighborhood bias to preserve the local topology information. In this way, SignGT could learn informative node representations from both long-range dependencies and local topology information. Extensive empirical results on both node-level and graph-level tasks indicate the superiority of SignGT against state-of-the-art graph Transformers as well as advanced GNNs. ",
    "url": "https://arxiv.org/abs/2310.11025",
    "authors": [
      "Jinsong Chen",
      "Gaichao Li",
      "John E. Hopcroft",
      "Kun He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2310.11033",
    "title": "Slicenet: a Simple and Scalable Flow-Level Simulator for Network Slice  Provisioning and Management",
    "abstract": "Network slicing plays a crucial role in the progression of 5G and beyond, facilitating dedicated logical networks to meet diverse and specific service requirements. The principle of End-to-End (E2E) slice includes not only a service chain of physical or virtual functions for the radio and core of 5G/6G networks but also the full path to the application servers that might be running at some edge computing or at central cloud. Nonetheless, the development and optimization of E2E network slice management systems necessitate a reliable simulation tool for evaluating different aspects at large-scale network topologies such as resource allocation and function placement models. This paper introduces Slicenet, a mininetlike simulator crafted for E2E network slicing experimentation at the flow level. Slicenet aims at facilitating the investigation of a wide range of slice optimization techniques, delivering measurable, reproducible results without the need for physical resources or complex integration tools. It provides a well-defined process for conducting experiments, which includes the creation and implementation of policies for various components such as edge and central cloud resources, network functions of multiple slices of different characteristics. Furthermore, Slicenet effortlessly produces meaningful visualizations from simulation results, aiding in comprehensive understanding. Utilizing Slicenet, service providers can derive invaluable insights into resource optimization, capacity planning, Quality of Service (QoS) assessment, cost optimization, performance comparison, risk mitigation, and Service Level Agreement (SLA) compliance, thereby fortifying network resource management and slice orchestration. ",
    "url": "https://arxiv.org/abs/2310.11033",
    "authors": [
      "Viswanath KumarSkandPriya",
      "Abdulhalim Dandoush",
      "Gladys Diaz"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2310.11042",
    "title": "Diagrammatic Modelling of Causality and Causal Relations",
    "abstract": "It has been stated that the notion of cause and effect is one object of study that sciences and engineering revolve around. Lately, in software engineering, diagrammatic causal inference methods (e.g., Pearl s model) have gained popularity (e.g., analyzing causes and effects of change in software requirement development). This paper concerns diagrammatical (graphic) models of causal relationships. Specifically, we experiment with using the conceptual language of thinging machines (TMs) as a tool in this context. This would benefit works on causal relationships in requirements engineering, enhance our understanding of the TM modeling, and contribute to the study of the philosophical notion of causality. To specify the causality in a system s description is to constrain the system s behavior and thus exclude some possible chronologies of events. The notion of causality has been studied based on tools to express causal questions in diagrammatic and algebraic forms. Causal models deploy diagrammatic models, structural equations, and counterfactual and interventional logic. Diagrammatic models serve as a language for representing what we know about the world. The research methodology in the paper focuses on converting causal graphs into TM models and contrasts the two types of representation. The results show that the TM depiction of causality is more complete and therefore can provide a foundation for causal graphs. ",
    "url": "https://arxiv.org/abs/2310.11042",
    "authors": [
      "Sabah Al-Fedaghi"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2310.11046",
    "title": "Fast Graph Condensation with Structure-based Neural Tangent Kernel",
    "abstract": "The rapid development of Internet technology has given rise to a vast amount of graph-structured data. Graph Neural Networks (GNNs), as an effective method for various graph mining tasks, incurs substantial computational resource costs when dealing with large-scale graph data. A data-centric manner solution is proposed to condense the large graph dataset into a smaller one without sacrificing the predictive performance of GNNs. However, existing efforts condense graph-structured data through a computational intensive bi-level optimization architecture also suffer from massive computation costs. In this paper, we propose reforming the graph condensation problem as a Kernel Ridge Regression (KRR) task instead of iteratively training GNNs in the inner loop of bi-level optimization. More specifically, We propose a novel dataset condensation framework (GC-SNTK) for graph-structured data, where a Structure-based Neural Tangent Kernel (SNTK) is developed to capture the topology of graph and serves as the kernel function in KRR paradigm. Comprehensive experiments demonstrate the effectiveness of our proposed model in accelerating graph condensation while maintaining high prediction performance. ",
    "url": "https://arxiv.org/abs/2310.11046",
    "authors": [
      "Lin Wang",
      "Wenqi Fan",
      "Jiatong Li",
      "Yao Ma",
      "Qing Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.11048",
    "title": "Understanding Contrastive Learning via Distributionally Robust  Optimization",
    "abstract": "This study reveals the inherent tolerance of contrastive learning (CL) towards sampling bias, wherein negative samples may encompass similar semantics (\\eg labels). However, existing theories fall short in providing explanations for this phenomenon. We bridge this research gap by analyzing CL through the lens of distributionally robust optimization (DRO), yielding several key insights: (1) CL essentially conducts DRO over the negative sampling distribution, thus enabling robust performance across a variety of potential distributions and demonstrating robustness to sampling bias; (2) The design of the temperature $\\tau$ is not merely heuristic but acts as a Lagrange Coefficient, regulating the size of the potential distribution set; (3) A theoretical connection is established between DRO and mutual information, thus presenting fresh evidence for ``InfoNCE as an estimate of MI'' and a new estimation approach for $\\phi$-divergence-based generalized mutual information. We also identify CL's potential shortcomings, including over-conservatism and sensitivity to outliers, and introduce a novel Adjusted InfoNCE loss (ADNCE) to mitigate these issues. It refines potential distribution, improving performance and accelerating convergence. Extensive experiments on various domains (image, sentence, and graphs) validate the effectiveness of the proposal. The code is available at \\url{https://github.com/junkangwu/ADNCE}. ",
    "url": "https://arxiv.org/abs/2310.11048",
    "authors": [
      "Junkang Wu",
      "Jiawei Chen",
      "Jiancan Wu",
      "Wentao Shi",
      "Xiang Wang",
      "Xiangnan He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.11059",
    "title": "Causal Feature Selection via Transfer Entropy",
    "abstract": "Machine learning algorithms are designed to capture complex relationships between features. In this context, the high dimensionality of data often results in poor model performance, with the risk of overfitting. Feature selection, the process of selecting a subset of relevant and non-redundant features, is, therefore, an essential step to mitigate these issues. However, classical feature selection approaches do not inspect the causal relationship between selected features and target, which can lead to misleading results in real-world applications. Causal discovery, instead, aims to identify causal relationships between features with observational data. In this paper, we propose a novel methodology at the intersection between feature selection and causal discovery, focusing on time series. We introduce a new causal feature selection approach that relies on the forward and backward feature selection procedures and leverages transfer entropy to estimate the causal flow of information from the features to the target in time series. Our approach enables the selection of features not only in terms of mere model performance but also captures the causal information flow. In this context, we provide theoretical guarantees on the regression and classification errors for both the exact and the finite-sample cases. Finally, we present numerical validations on synthetic and real-world regression problems, showing results competitive w.r.t. the considered baselines. ",
    "url": "https://arxiv.org/abs/2310.11059",
    "authors": [
      "Paolo Bonetti",
      "Alberto Maria Metelli",
      "Marcello Restelli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.11060",
    "title": "Locally Differentially Private Graph Embedding",
    "abstract": "Graph embedding has been demonstrated to be a powerful tool for learning latent representations for nodes in a graph. However, despite its superior performance in various graph-based machine learning tasks, learning over graphs can raise significant privacy concerns when graph data involves sensitive information. To address this, in this paper, we investigate the problem of developing graph embedding algorithms that satisfy local differential privacy (LDP). We propose LDP-GE, a novel privacy-preserving graph embedding framework, to protect the privacy of node data. Specifically, we propose an LDP mechanism to obfuscate node data and adopt personalized PageRank as the proximity measure to learn node representations. Then, we theoretically analyze the privacy guarantees and utility of the LDP-GE framework. Extensive experiments conducted over several real-world graph datasets demonstrate that LDP-GE achieves favorable privacy-utility trade-offs and significantly outperforms existing approaches in both node classification and link prediction tasks. ",
    "url": "https://arxiv.org/abs/2310.11060",
    "authors": [
      "Zening Li",
      "Rong-Hua Li",
      "Meihao Liao",
      "Fusheng Jin",
      "Guoren Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2310.11069",
    "title": "VoxArabica: A Robust Dialect-Aware Arabic Speech Recognition System",
    "abstract": "Arabic is a complex language with many varieties and dialects spoken by over 450 millions all around the world. Due to the linguistic diversity and variations, it is challenging to build a robust and generalized ASR system for Arabic. In this work, we address this gap by developing and demoing a system, dubbed VoxArabica, for dialect identification (DID) as well as automatic speech recognition (ASR) of Arabic. We train a wide range of models such as HuBERT (DID), Whisper, and XLS-R (ASR) in a supervised setting for Arabic DID and ASR tasks. Our DID models are trained to identify 17 different dialects in addition to MSA. We finetune our ASR models on MSA, Egyptian, Moroccan, and mixed data. Additionally, for the remaining dialects in ASR, we provide the option to choose various models such as Whisper and MMS in a zero-shot setting. We integrate these models into a single web interface with diverse features such as audio recording, file upload, model selection, and the option to raise flags for incorrect outputs. Overall, we believe VoxArabica will be useful for a wide range of audiences concerned with Arabic research. Our system is currently running at https://cdce-206-12-100-168.ngrok.io/. ",
    "url": "https://arxiv.org/abs/2310.11069",
    "authors": [
      "Abdul Waheed",
      "Bashar Talafha",
      "Peter Suvellin",
      "Abdelrahman Elmadney",
      "Muhammad Abdul-Mageed"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2310.11081",
    "title": "Understanding writing style in social media with a supervised  contrastively pre-trained transformer",
    "abstract": "Online Social Networks serve as fertile ground for harmful behavior, ranging from hate speech to the dissemination of disinformation. Malicious actors now have unprecedented freedom to misbehave, leading to severe societal unrest and dire consequences, as exemplified by events such as the Capitol assault during the US presidential election and the Antivaxx movement during the COVID-19 pandemic. Understanding online language has become more pressing than ever. While existing works predominantly focus on content analysis, we aim to shift the focus towards understanding harmful behaviors by relating content to their respective authors. Numerous novel approaches attempt to learn the stylistic features of authors in texts, but many of these approaches are constrained by small datasets or sub-optimal training losses. To overcome these limitations, we introduce the Style Transformer for Authorship Representations (STAR), trained on a large corpus derived from public sources of 4.5 x 10^6 authored texts involving 70k heterogeneous authors. Our model leverages Supervised Contrastive Loss to teach the model to minimize the distance between texts authored by the same individual. This author pretext pre-training task yields competitive performance at zero-shot with PAN challenges on attribution and clustering. Additionally, we attain promising results on PAN verification challenges using a single dense layer, with our model serving as an embedding encoder. Finally, we present results from our test partition on Reddit. Using a support base of 8 documents of 512 tokens, we can discern authors from sets of up to 1616 authors with at least 80\\% accuracy. We share our pre-trained model at huggingface (https://huggingface.co/AIDA-UPM/star) and our code is available at (https://github.com/jahuerta92/star) ",
    "url": "https://arxiv.org/abs/2310.11081",
    "authors": [
      "Javier Huertas-Tato",
      "Alejandro Martin",
      "David Camacho"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.11082",
    "title": "Multi-omics Sampling-based Graph Transformer for Synthetic Lethality  Prediction",
    "abstract": "Synthetic lethality (SL) prediction is used to identify if the co-mutation of two genes results in cell death. The prevalent strategy is to abstract SL prediction as an edge classification task on gene nodes within SL data and achieve it through graph neural networks (GNNs). However, GNNs suffer from limitations in their message passing mechanisms, including over-smoothing and over-squashing issues. Moreover, harnessing the information of non-SL gene relationships within large-scale multi-omics data to facilitate SL prediction poses a non-trivial challenge. To tackle these issues, we propose a new multi-omics sampling-based graph transformer for SL prediction (MSGT-SL). Concretely, we introduce a shallow multi-view GNN to acquire local structural patterns from both SL and multi-omics data. Further, we input gene features that encode multi-view information into the standard self-attention to capture long-range dependencies. Notably, starting with batch genes from SL data, we adopt parallel random walk sampling across multiple omics gene graphs encompassing them. Such sampling effectively and modestly incorporates genes from omics in a structure-aware manner before using self-attention. We showcase the effectiveness of MSGT-SL on real-world SL tasks, demonstrating the empirical benefits gained from the graph transformer and multi-omics data. ",
    "url": "https://arxiv.org/abs/2310.11082",
    "authors": [
      "Xusheng Zhao",
      "Hao Liu",
      "Qiong Dai",
      "Hao Peng",
      "Xu Bai",
      "Huailiang Peng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2310.11083",
    "title": "CSG: Curriculum Representation Learning for Signed Graph",
    "abstract": "Signed graphs are valuable for modeling complex relationships with positive and negative connections, and Signed Graph Neural Networks (SGNNs) have become crucial tools for their analysis. However, prior to our work, no specific training plan existed for SGNNs, and the conventional random sampling approach did not address varying learning difficulties within the graph's structure. We proposed a curriculum-based training approach, where samples progress from easy to complex, inspired by human learning. To measure learning difficulty, we introduced a lightweight mechanism and created the Curriculum representation learning framework for Signed Graphs (CSG). This framework optimizes the order in which samples are presented to the SGNN model. Empirical validation across six real-world datasets showed impressive results, enhancing SGNN model accuracy by up to 23.7% in link sign prediction (AUC) and significantly improving stability with an up to 8.4 reduction in the standard deviation of AUC scores. ",
    "url": "https://arxiv.org/abs/2310.11083",
    "authors": [
      "Zeyu Zhang",
      "Jiamou Liu",
      "Kaiqi Zhao",
      "Yifei Wang",
      "Pengqian Han",
      "Xianda Zheng",
      "Qiqi Wang",
      "Zijian Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.11087",
    "title": "Feature Pyramid biLSTM: Using Smartphone Sensors for Transportation Mode  Detection",
    "abstract": "The widespread utilization of smartphones has provided extensive availability to Inertial Measurement Units, providing a wide range of sensory data that can be advantageous for the detection of transportation modes. The objective of this study is to propose a novel end-to-end approach to effectively explore a reduced amount of sensory data collected from a smartphone to achieve accurate mode detection in common daily traveling activities. Our approach, called Feature Pyramid biLSTM (FPbiLSTM), is characterized by its ability to reduce the number of sensors required and processing demands, resulting in a more efficient modeling process without sacrificing the quality of the outcomes than the other current models. FPbiLSTM extends an existing CNN biLSTM model with the Feature Pyramid Network, leveraging the advantages of both shallow layer richness and deeper layer feature resilience for capturing temporal moving patterns in various transportation modes. It exhibits an excellent performance by employing the data collected from only three out of seven sensors, i.e. accelerometers, gyroscopes, and magnetometers, in the 2018 Sussex-Huawei Locomotion (SHL) challenge dataset, attaining a noteworthy accuracy of 95.1% and an F1-score of 94.7% in detecting eight different transportation modes. ",
    "url": "https://arxiv.org/abs/2310.11087",
    "authors": [
      "Qinrui Tang",
      "Hao Cheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2310.11088",
    "title": "MeKB-Rec: Personal Knowledge Graph Learning for Cross-Domain  Recommendation",
    "abstract": "It is a long-standing challenge in modern recommender systems to effectively make recommendations for new users, namely the cold-start problem. Cross-Domain Recommendation (CDR) has been proposed to address this challenge, but current ways to represent users' interests across systems are still severely limited. We introduce Personal Knowledge Graph (PKG) as a domain-invariant interest representation, and propose a novel CDR paradigm named MeKB-Rec. We first link users and entities in a knowledge base to construct a PKG of users' interests, named MeKB. Then we learn a semantic representation of MeKB for the cross-domain recommendation. To efficiently utilize limited training data in CDR, MeKB-Rec employs Pretrained Language Models to inject world knowledge into understanding users' interests. Beyond most existing systems, our approach builds a semantic mapping across domains which breaks the requirement for in-domain user behaviors, enabling zero-shot recommendations for new users in a low-resource domain. We experiment MeKB-Rec on well-established public CDR datasets, and demonstrate that the new formulation % is more powerful than previous approaches, achieves a new state-of-the-art that significantly improves HR@10 and NDCG@10 metrics over best previous approaches by 24\\%--91\\%, with a 105\\% improvement for HR@10 of zero-shot users with no behavior in the target domain. We deploy MeKB-Rec in WeiXin recommendation scenarios and achieve significant gains in core online metrics. MeKB-Rec is now serving hundreds of millions of users in real-world products. ",
    "url": "https://arxiv.org/abs/2310.11088",
    "authors": [
      "Xin Su",
      "Yao Zhou",
      "Zifei Shan",
      "Qian Chen"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.11092",
    "title": "DORec: Decomposed Object Reconstruction Utilizing 2D Self-Supervised  Features",
    "abstract": "Decomposing a target object from a complex background while reconstructing is challenging. Most approaches acquire the perception for object instances through the use of manual labels, but the annotation procedure is costly. The recent advancements in 2D self-supervised learning have brought new prospects to object-aware representation, yet it remains unclear how to leverage such noisy 2D features for clean decomposition. In this paper, we propose a Decomposed Object Reconstruction (DORec) network based on neural implicit representations. Our key idea is to transfer 2D self-supervised features into masks of two levels of granularity to supervise the decomposition, including a binary mask to indicate the foreground regions and a K-cluster mask to indicate the semantically similar regions. These two masks are complementary to each other and lead to robust decomposition. Experimental results show the superiority of DORec in segmenting and reconstructing the foreground object on various datasets. ",
    "url": "https://arxiv.org/abs/2310.11092",
    "authors": [
      "Jun Wu",
      "Sicheng Li",
      "Sihui Ji",
      "Yue Wang",
      "Rong Xiong",
      "Yiyi Liao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.11093",
    "title": "SODA: Robust Training of Test-Time Data Adaptors",
    "abstract": "Adapting models deployed to test distributions can mitigate the performance degradation caused by distribution shifts. However, privacy concerns may render model parameters inaccessible. One promising approach involves utilizing zeroth-order optimization (ZOO) to train a data adaptor to adapt the test data to fit the deployed models. Nevertheless, the data adaptor trained with ZOO typically brings restricted improvements due to the potential corruption of data features caused by the data adaptor. To address this issue, we revisit ZOO in the context of test-time data adaptation. We find that the issue directly stems from the unreliable estimation of the gradients used to optimize the data adaptor, which is inherently due to the unreliable nature of the pseudo-labels assigned to the test data. Based on this observation, we propose pseudo-label-robust data adaptation (SODA) to improve the performance of data adaptation. Specifically, SODA leverages high-confidence predicted labels as reliable labels to optimize the data adaptor with ZOO for label prediction. For data with low-confidence predictions, SODA encourages the adaptor to preserve data information to mitigate data corruption. Empirical results indicate that SODA can significantly enhance the performance of deployed models in the presence of distribution shifts without requiring access to model parameters. ",
    "url": "https://arxiv.org/abs/2310.11093",
    "authors": [
      "Zige Wang",
      "Yonggang Zhang",
      "Zhen Fang",
      "Long Lan",
      "Wenjing Yang",
      "Bo Han"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.11102",
    "title": "HGCVAE: Integrating Generative and Contrastive Learning for  Heterogeneous Graph Learning",
    "abstract": "Generative self-supervised learning (SSL) has exhibited significant potential and garnered increasing interest in graph learning. In this study, we aim to explore the problem of generative SSL in the context of heterogeneous graph learning (HGL). The previous SSL approaches for heterogeneous graphs have primarily relied on contrastive learning, necessitating the design of complex views to capture heterogeneity. However, existing generative SSL methods have not fully leveraged the capabilities of generative models to address the challenges of HGL. In this paper, we present HGCVAE, a novel contrastive variational graph auto-encoder that liberates HGL from the burden of intricate heterogeneity capturing. Instead of focusing on complicated heterogeneity, HGCVAE harnesses the full potential of generative SSL. HGCVAE innovatively consolidates contrastive learning with generative SSL, introducing several key innovations. Firstly, we employ a progressive mechanism to generate high-quality hard negative samples for contrastive learning, utilizing the power of variational inference. Additionally, we present a dynamic mask strategy to ensure effective and stable learning. Moreover, we propose an enhanced scaled cosine error as the criterion for better attribute reconstruction. As an initial step in combining generative and contrastive SSL, HGCVAE achieves remarkable results compared to various state-of-the-art baselines, confirming its superiority. ",
    "url": "https://arxiv.org/abs/2310.11102",
    "authors": [
      "Yulan Hu",
      "Zhirui Yang",
      "Sheng Ouyang",
      "Yong Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.11105",
    "title": "Generalizability of CNN Architectures for Face Morph Presentation Attack",
    "abstract": "Automatic border control systems are wide spread in modern airports worldwide. Morphing attacks on face biometrics is a serious threat that undermines the security and reliability of face recognition systems deployed in airports and border controls. Therefore, developing a robust Machine Learning (ML) system is necessary to prevent criminals crossing borders with fake identifications especially since it has been shown that security officers cannot detect morphs better than machines. In this study, we investigate the generalization power of Convolutional Neural Network (CNN) architectures against morphing attacks. The investigation utilizes 5 distinct CNNs namely ShuffleNet, DenseNet201, VGG16, EffecientNet-B0 and InceptionResNet-v2. Each CNN architecture represents a well-known family of CNN models in terms of number of parameters, architectural design and performance across various computer vision applications. To ensure robust evaluation, we employ 4 different datasets (Utrecht, London, Defacto and KurdFace) that contain a diverse range of digital face images which cover variations in ethnicity, gender, age, lighting condition and camera setting. One of the fundamental concepts of ML system design is the ability to generalize effectively to previously unseen data, hence not only we evaluate the performance of CNN models within individual datasets but also explore their performance across combined datasets and investigating each dataset in testing phase only. Experimental results on more than 8 thousand images (genuine and morph) from the 4 datasets show that InceptionResNet-v2 generalizes better to unseen data and outperforms the other 4 CNN models. ",
    "url": "https://arxiv.org/abs/2310.11105",
    "authors": [
      "Sherko R. HmaSalah",
      "Aras Asaad"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.11106",
    "title": "3D Structure-guided Network for Tooth Alignment in 2D Photograph",
    "abstract": "Orthodontics focuses on rectifying misaligned teeth (i.e., malocclusions), affecting both masticatory function and aesthetics. However, orthodontic treatment often involves complex, lengthy procedures. As such, generating a 2D photograph depicting aligned teeth prior to orthodontic treatment is crucial for effective dentist-patient communication and, more importantly, for encouraging patients to accept orthodontic intervention. In this paper, we propose a 3D structure-guided tooth alignment network that takes 2D photographs as input (e.g., photos captured by smartphones) and aligns the teeth within the 2D image space to generate an orthodontic comparison photograph featuring aesthetically pleasing, aligned teeth. Notably, while the process operates within a 2D image space, our method employs 3D intra-oral scanning models collected in clinics to learn about orthodontic treatment, i.e., projecting the pre- and post-orthodontic 3D tooth structures onto 2D tooth contours, followed by a diffusion model to learn the mapping relationship. Ultimately, the aligned tooth contours are leveraged to guide the generation of a 2D photograph with aesthetically pleasing, aligned teeth and realistic textures. We evaluate our network on various facial photographs, demonstrating its exceptional performance and strong applicability within the orthodontic industry. ",
    "url": "https://arxiv.org/abs/2310.11106",
    "authors": [
      "Yulong Dou",
      "Lanzhuju Mei",
      "Dinggang Shen",
      "Zhiming Cui"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.11116",
    "title": "Cross-Platform Social Dynamics: An Analysis of ChatGPT and COVID-19  Vaccine Conversations",
    "abstract": "The role of social media in information dissemination and agenda-setting has significantly expanded in recent years. By offering real-time interactions, online platforms have become invaluable tools for studying societal responses to significant events as they unfold. However, online reactions to external developments are influenced by various factors, including the nature of the event and the online environment. This study examines the dynamics of public discourse on digital platforms to shed light on this issue. We analyzed over 12 million posts and news articles related to two significant events: the release of ChatGPT in 2022 and the global discussions about COVID-19 vaccines in 2021. Data was collected from multiple platforms, including Twitter, Facebook, Instagram, Reddit, YouTube, and GDELT. We employed topic modeling techniques to uncover the distinct thematic emphases on each platform, which reflect their specific features and target audiences. Additionally, sentiment analysis revealed various public perceptions regarding the topics studied. Lastly, we compared the evolution of engagement across platforms, unveiling unique patterns for the same topic. Notably, discussions about COVID-19 vaccines spread more rapidly due to the immediacy of the subject, while discussions about ChatGPT, despite its technological importance, propagated more gradually. ",
    "url": "https://arxiv.org/abs/2310.11116",
    "authors": [
      "Shayan Alipour",
      "Alessandro Galeazzi",
      "Emanuele Sangiorgio",
      "Michele Avalle",
      "Ljubisa Bojic",
      "Matteo Cinelli",
      "Walter Quattrociocchi"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2310.11130",
    "title": "Topological Expressivity of ReLU Neural Networks",
    "abstract": "We study the expressivity of ReLU neural networks in the setting of a binary classification problem from a topological perspective. Recently, empirical studies showed that neural networks operate by changing topology, transforming a topologically complicated data set into a topologically simpler one as it passes through the layers. This topological simplification has been measured by Betti numbers, which are algebraic invariants of a topological space. We use the same measure to establish lower and upper bounds on the topological simplification a ReLU neural network can achieve with a given architecture. We therefore contribute to a better understanding of the expressivity of ReLU neural networks in the context of binary classification problems by shedding light on their ability to capture the underlying topological structure of the data. In particular the results show that deep ReLU neural networks are exponentially more powerful than shallow ones in terms of topological simplification. This provides a mathematically rigorous explanation why deeper networks are better equipped to handle complex and topologically rich datasets. ",
    "url": "https://arxiv.org/abs/2310.11130",
    "authors": [
      "Ekin Ergen",
      "Moritz Grillo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.11154",
    "title": "Causal discovery using dynamically requested knowledge",
    "abstract": "Causal Bayesian Networks (CBNs) are an important tool for reasoning under uncertainty in complex real-world systems. Determining the graphical structure of a CBN remains a key challenge and is undertaken either by eliciting it from humans, using machine learning to learn it from data, or using a combination of these two approaches. In the latter case, human knowledge is generally provided to the algorithm before it starts, but here we investigate a novel approach where the structure learning algorithm itself dynamically identifies and requests knowledge for relationships that the algorithm identifies as uncertain during structure learning. We integrate this approach into the Tabu structure learning algorithm and show that it offers considerable gains in structural accuracy, which are generally larger than those offered by existing approaches for integrating knowledge. We suggest that a variant which requests only arc orientation information may be particularly useful where the practitioner has little preexisting knowledge of the causal relationships. As well as offering improved accuracy, the approach can use human expertise more effectively and contributes to making the structure learning process more transparent. ",
    "url": "https://arxiv.org/abs/2310.11154",
    "authors": [
      "Neville K Kitson",
      "Anthony C Constantinou"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.11161",
    "title": "Accurate prediction of international trade flows: Leveraging knowledge  graphs and their embeddings",
    "abstract": "Knowledge representation (KR) is vital in designing symbolic notations to represent real-world facts and facilitate automated decision-making tasks. Knowledge graphs (KGs) have emerged so far as a popular form of KR, offering a contextual and human-like representation of knowledge. In international economics, KGs have proven valuable in capturing complex interactions between commodities, companies, and countries. By putting the gravity model, which is a common economic framework, into the process of building KGs, important factors that affect trade relationships can be taken into account, making it possible to predict international trade patterns. This paper proposes an approach that leverages Knowledge Graph embeddings for modeling international trade, focusing on link prediction using embeddings. Thus, valuable insights are offered to policymakers, businesses, and economists, enabling them to anticipate the effects of changes in the international trade system. Moreover, the integration of traditional machine learning methods with KG embeddings, such as decision trees and graph neural networks are also explored. The research findings demonstrate the potential for improving prediction accuracy and provide insights into embedding explainability in knowledge representation. The paper also presents a comprehensive analysis of the influence of embedding methods on other intelligent algorithms. ",
    "url": "https://arxiv.org/abs/2310.11161",
    "authors": [
      "Diego Rincon-Yanez",
      "Chahinez Ounoughi",
      "Bassem Sellami",
      "Tarmo Kalvet",
      "Marek Tiits",
      "Sabrina Senatore",
      "Sadok Ben Yahia"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Symbolic Computation (cs.SC)"
    ]
  },
  {
    "id": "arXiv:2310.11166",
    "title": "ViSoBERT: A Pre-Trained Language Model for Vietnamese Social Media Text  Processing",
    "abstract": "English and Chinese, known as resource-rich languages, have witnessed the strong development of transformer-based language models for natural language processing tasks. Although Vietnam has approximately 100M people speaking Vietnamese, several pre-trained models, e.g., PhoBERT, ViBERT, and vELECTRA, performed well on general Vietnamese NLP tasks, including POS tagging and named entity recognition. These pre-trained language models are still limited to Vietnamese social media tasks. In this paper, we present the first monolingual pre-trained language model for Vietnamese social media texts, ViSoBERT, which is pre-trained on a large-scale corpus of high-quality and diverse Vietnamese social media texts using XLM-R architecture. Moreover, we explored our pre-trained model on five important natural language downstream tasks on Vietnamese social media texts: emotion recognition, hate speech detection, sentiment analysis, spam reviews detection, and hate speech spans detection. Our experiments demonstrate that ViSoBERT, with far fewer parameters, surpasses the previous state-of-the-art models on multiple Vietnamese social media tasks. Our ViSoBERT model is available\\footnote{\\url{https://huggingface.co/uitnlp/visobert}} only for research purposes. ",
    "url": "https://arxiv.org/abs/2310.11166",
    "authors": [
      "Quoc-Nam Nguyen",
      "Thang Chau Phan",
      "Duc-Vu Nguyen",
      "Kiet Van Nguyen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.11169",
    "title": "MST-GAT: A Multimodal Spatial-Temporal Graph Attention Network for Time  Series Anomaly Detection",
    "abstract": "Multimodal time series (MTS) anomaly detection is crucial for maintaining the safety and stability of working devices (e.g., water treatment system and spacecraft), whose data are characterized by multivariate time series with diverse modalities. Although recent deep learning methods show great potential in anomaly detection, they do not explicitly capture spatial-temporal relationships between univariate time series of different modalities, resulting in more false negatives and false positives. In this paper, we propose a multimodal spatial-temporal graph attention network (MST-GAT) to tackle this problem. MST-GAT first employs a multimodal graph attention network (M-GAT) and a temporal convolution network to capture the spatial-temporal correlation in multimodal time series. Specifically, M-GAT uses a multi-head attention module and two relational attention modules (i.e., intra- and inter-modal attention) to model modal correlations explicitly. Furthermore, MST-GAT optimizes the reconstruction and prediction modules simultaneously. Experimental results on four multimodal benchmarks demonstrate that MST-GAT outperforms the state-of-the-art baselines. Further analysis indicates that MST-GAT strengthens the interpretability of detected anomalies by locating the most anomalous univariate time series. ",
    "url": "https://arxiv.org/abs/2310.11169",
    "authors": [
      "Chaoyue Ding",
      "Shiliang Sun",
      "Jing Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.11186",
    "title": "Efficiently Visualizing Large Graphs",
    "abstract": "Most existing graph visualization methods based on dimension reduction are limited to relatively small graphs due to performance issues. In this work, we propose a novel dimension reduction method for graph visualization, called t-Distributed Stochastic Graph Neighbor Embedding (t-SGNE). t-SGNE is specifically designed to visualize cluster structures in the graph. As a variant of the standard t-SNE method, t-SGNE avoids the time-consuming computations of pairwise similarity. Instead, it uses the neighbor structures of the graph to reduce the time complexity from quadratic to linear, thus supporting larger graphs. In addition, to suit t-SGNE, we combined Laplacian Eigenmaps with the shortest path algorithm in graphs to form the graph embedding algorithm ShortestPath Laplacian Eigenmaps Embedding (SPLEE). Performing SPLEE to obtain a high-dimensional embedding of the large-scale graph and then using t-SGNE to reduce its dimension for visualization, we are able to visualize graphs with up to 300K nodes and 1M edges within 5 minutes and achieve approximately 10% improvement in visualization quality. Codes and data are available at https://github.com/Charlie-XIAO/embedding-visualization-test. ",
    "url": "https://arxiv.org/abs/2310.11186",
    "authors": [
      "Xinyu Li",
      "Yao Xiao",
      "Yuchen Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.11188",
    "title": "A Modified EXP3 and Its Adaptive Variant in Adversarial Bandits with  Multi-User Delayed Feedback",
    "abstract": "For the adversarial multi-armed bandit problem with delayed feedback, we consider that the delayed feedback results are from multiple users and are unrestricted on internal distribution. As the player picks an arm, feedback from multiple users may not be received instantly yet after an arbitrary delay of time which is unknown to the player in advance. For different users in a round, the delays in feedback have no latent correlation. Thus, we formulate an adversarial multi-armed bandit problem with multi-user delayed feedback and design a modified EXP3 algorithm named MUD-EXP3, which makes a decision at each round by considering the importance-weighted estimator of the received feedback from different users. On the premise of known terminal round index $T$, the number of users $M$, the number of arms $N$, and upper bound of delay $d_{max}$, we prove a regret of $\\mathcal{O}(\\sqrt{TM^2\\ln{N}(N\\mathrm{e}+4d_{max})})$. Furthermore, for the more common case of unknown $T$, an adaptive algorithm named AMUD-EXP3 is proposed with a sublinear regret with respect to $T$. Finally, extensive experiments are conducted to indicate the correctness and effectiveness of our algorithms. ",
    "url": "https://arxiv.org/abs/2310.11188",
    "authors": [
      "Yandi Li",
      "Jianxiong Guo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.11220",
    "title": "KG-GPT: A General Framework for Reasoning on Knowledge Graphs Using  Large Language Models",
    "abstract": "While large language models (LLMs) have made considerable advancements in understanding and generating unstructured text, their application in structured data remains underexplored. Particularly, using LLMs for complex reasoning tasks on knowledge graphs (KGs) remains largely untouched. To address this, we propose KG-GPT, a multi-purpose framework leveraging LLMs for tasks employing KGs. KG-GPT comprises three steps: Sentence Segmentation, Graph Retrieval, and Inference, each aimed at partitioning sentences, retrieving relevant graph components, and deriving logical conclusions, respectively. We evaluate KG-GPT using KG-based fact verification and KGQA benchmarks, with the model showing competitive and robust performance, even outperforming several fully-supervised models. Our work, therefore, marks a significant step in unifying structured and unstructured data processing within the realm of LLMs. ",
    "url": "https://arxiv.org/abs/2310.11220",
    "authors": [
      "Jiho Kim",
      "Yeonsu Kwon",
      "Yohan Jo",
      "Edward Choi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.11246",
    "title": "Query2Triple: Unified Query Encoding for Answering Diverse Complex  Queries over Knowledge Graphs",
    "abstract": "Complex Query Answering (CQA) is a challenge task of Knowledge Graph (KG). Due to the incompleteness of KGs, query embedding (QE) methods have been proposed to encode queries and entities into the same embedding space, and treat logical operators as neural set operators to obtain answers. However, these methods train KG embeddings and neural set operators concurrently on both simple (one-hop) and complex (multi-hop and logical) queries, which causes performance degradation on simple queries and low training efficiency. In this paper, we propose Query to Triple (Q2T), a novel approach that decouples the training for simple and complex queries. Q2T divides the training into two stages: (1) Pre-training a neural link predictor on simple queries to predict tail entities based on the head entity and relation. (2) Training a query encoder on complex queries to encode diverse complex queries into a unified triple form that can be efficiently solved by the pretrained neural link predictor. Our proposed Q2T is not only efficient to train, but also modular, thus easily adaptable to various neural link predictors that have been studied well. Extensive experiments demonstrate that, even without explicit modeling for neural set operators, Q2T still achieves state-of-the-art performance on diverse complex queries over three public benchmarks. ",
    "url": "https://arxiv.org/abs/2310.11246",
    "authors": [
      "Yao Xu",
      "Shizhu He",
      "Cunguang Wang",
      "Li Cai",
      "Kang Liu",
      "Jun Zhao"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.11248",
    "title": "CrossCodeEval: A Diverse and Multilingual Benchmark for Cross-File Code  Completion",
    "abstract": "Code completion models have made significant progress in recent years, yet current popular evaluation datasets, such as HumanEval and MBPP, predominantly focus on code completion tasks within a single file. This over-simplified setting falls short of representing the real-world software development scenario where repositories span multiple files with numerous cross-file dependencies, and accessing and understanding cross-file context is often required to complete the code correctly. To fill in this gap, we propose CrossCodeEval, a diverse and multilingual code completion benchmark that necessitates an in-depth cross-file contextual understanding to complete the code accurately. CrossCodeEval is built on a diverse set of real-world, open-sourced, permissively-licensed repositories in four popular programming languages: Python, Java, TypeScript, and C#. To create examples that strictly require cross-file context for accurate completion, we propose a straightforward yet efficient static-analysis-based approach to pinpoint the use of cross-file context within the current file. Extensive experiments on state-of-the-art code language models like CodeGen and StarCoder demonstrate that CrossCodeEval is extremely challenging when the relevant cross-file context is absent, and we see clear improvements when adding these context into the prompt. However, despite such improvements, the pinnacle of performance remains notably unattained even with the highest-performing model, indicating that CrossCodeEval is also capable of assessing model's capability in leveraging extensive context to make better code completion. Finally, we benchmarked various methods in retrieving cross-file context, and show that CrossCodeEval can also be used to measure the capability of code retrievers. ",
    "url": "https://arxiv.org/abs/2310.11248",
    "authors": [
      "Yangruibo Ding",
      "Zijian Wang",
      "Wasi Uddin Ahmad",
      "Hantian Ding",
      "Ming Tan",
      "Nihal Jain",
      "Murali Krishna Ramanathan",
      "Ramesh Nallapati",
      "Parminder Bhatia",
      "Dan Roth",
      "Bing Xiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2310.11257",
    "title": "An empirical study of automatic wildlife detection using drone thermal  imaging and object detection",
    "abstract": "Artificial intelligence has the potential to make valuable contributions to wildlife management through cost-effective methods for the collection and interpretation of wildlife data. Recent advances in remotely piloted aircraft systems (RPAS or ``drones'') and thermal imaging technology have created new approaches to collect wildlife data. These emerging technologies could provide promising alternatives to standard labourious field techniques as well as cover much larger areas. In this study, we conduct a comprehensive review and empirical study of drone-based wildlife detection. Specifically, we collect a realistic dataset of drone-derived wildlife thermal detections. Wildlife detections, including arboreal (for instance, koalas, phascolarctos cinereus) and ground dwelling species in our collected data are annotated via bounding boxes by experts. We then benchmark state-of-the-art object detection algorithms on our collected dataset. We use these experimental results to identify issues and discuss future directions in automatic animal monitoring using drones. ",
    "url": "https://arxiv.org/abs/2310.11257",
    "authors": [
      "Miao Chang",
      "Tan Vuong",
      "Manas Palaparthi",
      "Lachlan Howell",
      "Alessio Bonti",
      "Mohamed Abdelrazek",
      "Duc Thanh Nguyen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.11270",
    "title": "Graph Neural Networks for Recommendation: Reproducibility, Graph  Topology, and Node Representation",
    "abstract": "Graph neural networks (GNNs) have gained prominence in recommendation systems in recent years. By representing the user-item matrix as a bipartite and undirected graph, GNNs have demonstrated their potential to capture short- and long-distance user-item interactions, thereby learning more accurate preference patterns than traditional recommendation approaches. In contrast to previous tutorials on the same topic, this tutorial aims to present and examine three key aspects that characterize GNNs for recommendation: (i) the reproducibility of state-of-the-art approaches, (ii) the potential impact of graph topological characteristics on the performance of these models, and (iii) strategies for learning node representations when training features from scratch or utilizing pre-trained embeddings as additional item information (e.g., multimodal features). The goal is to provide three novel theoretical and practical perspectives on the field, currently subject to debate in graph learning but long been overlooked in the context of recommendation systems. ",
    "url": "https://arxiv.org/abs/2310.11270",
    "authors": [
      "Daniele Malitesta",
      "Claudio Pomo",
      "Tommaso Di Noia"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2310.11271",
    "title": "Error analysis for hybrid finite element/neural network discretizations",
    "abstract": "We describe and analyze a hybrid finite element/neural network method for predicting solutions of partial differential equations. The methodology is designed for obtaining fine scale fluctuations from neural networks in a local manner. The network is capable of locally correcting a coarse finite element solution towards a fine solution taking the source term and the coarse approximation as input. Key observation is the dependency between quality of predictions and the size of training set which consists of different source terms and corresponding fine & coarse solutions. We provide the a priori error analysis of the method together with the stability analysis of the neural network. The numerical experiments confirm the capability of the network predicting fine finite element solutions. We also illustrate the generalization of the method to problems where test and training domains differ from each other. ",
    "url": "https://arxiv.org/abs/2310.11271",
    "authors": [
      "Uladzislau Kapustsin",
      "Utku Kaya",
      "Thomas Richter"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2310.11281",
    "title": "Self-supervision meets kernel graph neural models: From architecture to  augmentations",
    "abstract": "Graph representation learning has now become the de facto standard when handling graph-structured data, with the framework of message-passing graph neural networks (MPNN) being the most prevailing algorithmic tool. Despite its popularity, the family of MPNNs suffers from several drawbacks such as transparency and expressivity. Recently, the idea of designing neural models on graphs using the theory of graph kernels has emerged as a more transparent as well as sometimes more expressive alternative to MPNNs known as kernel graph neural networks (KGNNs). Developments on KGNNs are currently a nascent field of research, leaving several challenges from algorithmic design and adaptation to other learning paradigms such as self-supervised learning. In this paper, we improve the design and learning of KGNNs. Firstly, we extend the algorithmic formulation of KGNNs by allowing a more flexible graph-level similarity definition that encompasses former proposals like random walk graph kernel, as well as providing a smoother optimization objective that alleviates the need of introducing combinatorial learning procedures. Secondly, we enhance KGNNs through the lens of self-supervision via developing a novel structure-preserving graph data augmentation method called latent graph augmentation (LGA). Finally, we perform extensive empirical evaluations to demonstrate the efficacy of our proposed mechanisms. Experimental results over benchmark datasets suggest that our proposed model achieves competitive performance that is comparable to or sometimes outperforming state-of-the-art graph representation learning frameworks with or without self-supervision on graph classification tasks. Comparisons against other previously established graph data augmentation methods verify that the proposed LGA augmentation scheme captures better semantics of graph-level invariance. ",
    "url": "https://arxiv.org/abs/2310.11281",
    "authors": [
      "Jiawang Dan",
      "Ruofan Wu",
      "Yunpeng Liu",
      "Baokun Wang",
      "Changhua Meng",
      "Tengfei Liu",
      "Tianyi Zhang",
      "Ningtao Wang",
      "Xing Fu",
      "Qi Li",
      "Weiqiang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.11283",
    "title": "Separator Theorem and Algorithms for Planar Hyperbolic Graphs",
    "abstract": "The hyperbolicity of a graph, informally, measures how close a graph is (metrically) to a tree. Hence, it is intuitively similar to treewidth, but the measures are formally incomparable. Motivated by the broad study of algorithms and separators on planar graphs and their relation to treewidth, we initiate the study of planar graphs of bounded hyperbolicity. Our main technical contribution is a novel balanced separator theorem for planar $\\delta$-hyperbolic graphs that is substantially stronger than the classic planar separator theorem. For any fixed $\\delta \\geq 0$, we can find balanced separator that induces either a single geodesic (shortest) path or a single geodesic cycle in the graph. An important advantage of our separator is that the union of our separator (vertex set $Z$) with any subset of the connected components of $G - Z$ induces again a planar $\\delta$-hyperbolic graph, which would not be guaranteed with an arbitrary separator. Our construction runs in near-linear time and guarantees that size of separator is $\\mathrm{poly}(\\delta) \\cdot \\log n$. As an application of our separator theorem and its strong properties, we obtain two novel approximation schemes on planar $\\delta$-hyperbolic graphs. We prove that Maximum Independent Set and the Traveling Salesperson problem have a near-linear time FPTAS for any constant $\\delta$, running in $n\\, \\mathrm{polylog}(n) \\cdot 2^{\\mathcal{O}(\\delta^2)} \\cdot \\varepsilon^{-\\mathcal{O}(\\delta)}$ time. We also show that our approximation scheme for Maximum Independent Set has essentially the best possible running time under the Exponential Time Hypothesis (ETH). This immediately follows from our third contribution: we prove that Maximum Independent Set has no $n^{o(\\delta)}$-time algorithm on planar $\\delta$-hyperbolic graphs, unless ETH fails. ",
    "url": "https://arxiv.org/abs/2310.11283",
    "authors": [
      "Sándor Kisfaludi-Bak",
      "Jana Masaříková",
      "Erik Jan van Leeuwen",
      "Bartosz Walczak",
      "Karol Węgrzycki"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Geometry (cs.CG)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2310.11284",
    "title": "Self-Supervised 3D Scene Flow Estimation and Motion Prediction using  Local Rigidity Prior",
    "abstract": "In this article, we investigate self-supervised 3D scene flow estimation and class-agnostic motion prediction on point clouds. A realistic scene can be well modeled as a collection of rigidly moving parts, therefore its scene flow can be represented as a combination of the rigid motion of these individual parts. Building upon this observation, we propose to generate pseudo scene flow labels for self-supervised learning through piecewise rigid motion estimation, in which the source point cloud is decomposed into local regions and each region is treated as rigid. By rigidly aligning each region with its potential counterpart in the target point cloud, we obtain a region-specific rigid transformation to generate its pseudo flow labels. To mitigate the impact of potential outliers on label generation, when solving the rigid registration for each region, we alternately perform three steps: establishing point correspondences, measuring the confidence for the correspondences, and updating the rigid transformation based on the correspondences and their confidence. As a result, confident correspondences will dominate label generation and a validity mask will be derived for the generated pseudo labels. By using the pseudo labels together with their validity mask for supervision, models can be trained in a self-supervised manner. Extensive experiments on FlyingThings3D and KITTI datasets demonstrate that our method achieves new state-of-the-art performance in self-supervised scene flow learning, without any ground truth scene flow for supervision, even performing better than some supervised counterparts. Additionally, our method is further extended to class-agnostic motion prediction and significantly outperforms previous state-of-the-art self-supervised methods on nuScenes dataset. ",
    "url": "https://arxiv.org/abs/2310.11284",
    "authors": [
      "Ruibo Li",
      "Chi Zhang",
      "Zhe Wang",
      "Chunhua Shen",
      "Guosheng Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.11290",
    "title": "Signal Temporal Logic-Guided Model Predictive Control for Robust Bipedal  Locomotion Resilient to Runtime External Perturbations",
    "abstract": "This study investigates formal-method-based trajectory optimization (TO) for bipedal locomotion, focusing on scenarios where the robot encounters external perturbations at unforeseen times. Our key research question centers around the assurance of task specification correctness and the maximization of specification robustness for a bipedal robot in the presence of external perturbations. Our contribution includes the design of an optimization-based task and motion planning framework that generates optimal control sequences with formal guarantees of external perturbation recovery. As a core component of the framework, a model predictive controller (MPC) encodes signal temporal logic (STL)-based task specifications as a cost function. In particular, we investigate challenging scenarios where the robot is subjected to lateral perturbations that increase the risk of failure due to leg self-collision. To address this, we synthesize agile and safe crossed-leg maneuvers to enhance locomotion stability. This work marks the first study to incorporate formal guarantees offered by STL into a TO for perturbation recovery of bipedal locomotion. We demonstrate the efficacy of the framework via perturbation experiments in simulations. ",
    "url": "https://arxiv.org/abs/2310.11290",
    "authors": [
      "Zhaoyuan Gu",
      "Rongming Guo",
      "William Yates",
      "Yipu Chen",
      "Ye Zhao"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.11292",
    "title": "Two subspace methods for frequency sparse graph signals",
    "abstract": "We study signals that are sparse in graph spectral domain and develop explicit algorithms to reconstruct the support set as well as partial components from samples on few vertices of the graph. The number of required samples is independent of the total size of the graph and takes only local properties of the graph into account. Our results rely on an operator based framework for subspace methods and become effective when the spectral eigenfunctions are zero-free or linear independent on small sets of the vertices. The latter has recently been adressed using algebraic methods by the first author. ",
    "url": "https://arxiv.org/abs/2310.11292",
    "authors": [
      "Tarek Emmrich",
      "Martina Juhnke-Kubitzke",
      "Stefan Kunis"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2310.11301",
    "title": "Source Code Comprehension: A Contemporary Definition and Conceptual  Model for Empirical Investigation",
    "abstract": "Be it in debugging, testing, code review or, more recently, pair programming with AI assistance: in all these activities, software engineers need to understand source code. Accordingly, plenty of research is taking place in the field to find out, for example, what makes code easy to understand and which tools can best support developers in their comprehension process. And while any code comprehension researcher certainly has a rough idea of what they mean when they mention a developer having a good understanding of a piece of code, to date, the research community has not managed to define source code comprehension as a concept. Instead, in primary research on code comprehension, an implicit definition by task prevails, i.e., code comprehension is what the experimental tasks measure. This approach has two negative consequences. First, it makes it difficult to conduct secondary research. Currently, each code comprehension primary study uses different comprehension tasks and measures, and thus it is not clear whether different studies intend to measure the same construct. Second, authors of a primary study run into the difficulty of justifying their design decisions without a definition of what they attempt to measure. An operationalization of an insufficiently described construct occurs, which poses a threat to construct validity. The task of defining code comprehension considering the theory of the past fifty years is not an easy one. Nor is it a task that every author of a primary study must accomplish on their own. Therefore, this paper constitutes a reference work that defines source code comprehension and presents a conceptual framework in which researchers can anchor their empirical code comprehension research. ",
    "url": "https://arxiv.org/abs/2310.11301",
    "authors": [
      "Marvin Wyrich"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2310.11307",
    "title": "Multi Self-supervised Pre-fine-tuned Transformer Fusion for Better  Intelligent Transportation Detection",
    "abstract": "Intelligent transportation system combines advanced information technology to provide intelligent services such as monitoring, detection, and early warning for modern transportation. Intelligent transportation detection is the cornerstone of many intelligent traffic services by identifying task targets through object detection methods. However existing detection methods in intelligent transportation are limited by two aspects. First, there is a difference between the model knowledge pre-trained on large-scale datasets and the knowledge required for target task. Second, most detection models follow the pattern of single-source learning, which limits the learning ability. To address these problems, we propose a Multi Self-supervised Pre-fine-tuned Transformer Fusion (MSPTF) network, consisting of two steps: unsupervised pre-fine-tune domain knowledge learning and multi-model fusion target task learning. In the first step, we introduced self-supervised learning methods into transformer model pre-fine-tune which could reduce data costs and alleviate the knowledge gap between pre-trained model and target task. In the second step, we take feature information differences between different model architectures and different pre-fine-tune tasks into account and propose Multi-model Semantic Consistency Cross-attention Fusion (MSCCF) network to combine different transformer model features by considering channel semantic consistency and feature vector semantic consistency, which obtain more complete and proper fusion features for detection task. We experimented the proposed method on vehicle recognition dataset and road disease detection dataset and achieved 1.1%, 5.5%, 4.2% improvement compared with baseline and 0.7%, 1.8%, 1.7% compared with sota, which proved the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2310.11307",
    "authors": [
      "Juwu Zheng",
      "Jiangtao Ren"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.11316",
    "title": "MonoSKD: General Distillation Framework for Monocular 3D Object  Detection via Spearman Correlation Coefficient",
    "abstract": "Monocular 3D object detection is an inherently ill-posed problem, as it is challenging to predict accurate 3D localization from a single image. Existing monocular 3D detection knowledge distillation methods usually project the LiDAR onto the image plane and train the teacher network accordingly. Transferring LiDAR-based model knowledge to RGB-based models is more complex, so a general distillation strategy is needed. To alleviate cross-modal prob-lem, we propose MonoSKD, a novel Knowledge Distillation framework for Monocular 3D detection based on Spearman correlation coefficient, to learn the relative correlation between cross-modal features. Considering the large gap between these features, strict alignment of features may mislead the training, so we propose a looser Spearman loss. Furthermore, by selecting appropriate distillation locations and removing redundant modules, our scheme saves more GPU resources and trains faster than existing methods. Extensive experiments are performed to verify the effectiveness of our framework on the challenging KITTI 3D object detection benchmark. Our method achieves state-of-the-art performance until submission with no additional inference computational cost. Our codes are available at https://github.com/Senwang98/MonoSKD ",
    "url": "https://arxiv.org/abs/2310.11316",
    "authors": [
      "Sen Wang",
      "Jin Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.11325",
    "title": "Detection of Malicious DNS-over-HTTPS Traffic: An Anomaly Detection  Approach using Autoencoders",
    "abstract": "To maintain the privacy of users' web browsing history, popular browsers encrypt their DNS traffic using the DNS-over-HTTPS (DoH) protocol. Unfortunately, encrypting DNS packets prevents many existing intrusion detection systems from using plaintext domain names to detect malicious traffic. In this paper, we design an autoencoder that is capable of detecting malicious DNS traffic by only observing the encrypted DoH traffic. Compared to previous works, the proposed autoencoder looks for anomalies in DoH traffic, and thus can detect malicious traffic that has not been previously observed, i.e., zero-day attacks. We run extensive experiments to evaluate the performance of our proposed autoencoder and compare it to that of other anomaly detection algorithms, namely, local outlier factor, one-class support vector machine, isolation forest, and variational autoencoders. We find that our proposed autoencoder achieves the highest detection performance, with a median F-1 score of 99\\% over several types of malicious traffic. ",
    "url": "https://arxiv.org/abs/2310.11325",
    "authors": [
      "Sergio Salinas Monroy",
      "Aman Kumar Gupta",
      "Garrett Wahlstedt"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.11335",
    "title": "Non-ergodicity in reinforcement learning: robustness via ergodicity  transformations",
    "abstract": "Envisioned application areas for reinforcement learning (RL) include autonomous driving, precision agriculture, and finance, which all require RL agents to make decisions in the real world. A significant challenge hindering the adoption of RL methods in these domains is the non-robustness of conventional algorithms. In this paper, we argue that a fundamental issue contributing to this lack of robustness lies in the focus on the expected value of the return as the sole \"correct\" optimization objective. The expected value is the average over the statistical ensemble of infinitely many trajectories. For non-ergodic returns, this average differs from the average over a single but infinitely long trajectory. Consequently, optimizing the expected value can lead to policies that yield exceptionally high returns with probability zero but almost surely result in catastrophic outcomes. This problem can be circumvented by transforming the time series of collected returns into one with ergodic increments. This transformation enables learning robust policies by optimizing the long-term return for individual agents rather than the average across infinitely many trajectories. We propose an algorithm for learning ergodicity transformations from data and demonstrate its effectiveness in an instructive, non-ergodic environment and on standard RL benchmarks. ",
    "url": "https://arxiv.org/abs/2310.11335",
    "authors": [
      "Dominik Baumann",
      "Erfaun Noorani",
      "James Price",
      "Ole Peters",
      "Colm Connaughton",
      "Thomas B. Schön"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.11346",
    "title": "Towards Generalizable Multi-Camera 3D Object Detection via Perspective  Debiasing",
    "abstract": "Detecting objects in 3D space using multiple cameras, known as Multi-Camera 3D Object Detection (MC3D-Det), has gained prominence with the advent of bird's-eye view (BEV) approaches. However, these methods often struggle when faced with unfamiliar testing environments due to the lack of diverse training data encompassing various viewpoints and environments. To address this, we propose a novel method that aligns 3D detection with 2D camera plane results, ensuring consistent and accurate detections. Our framework, anchored in perspective debiasing, helps the learning of features resilient to domain shifts. In our approach, we render diverse view maps from BEV features and rectify the perspective bias of these maps, leveraging implicit foreground volumes to bridge the camera and BEV planes. This two-step process promotes the learning of perspective- and context-independent features, crucial for accurate object detection across varying viewpoints, camera parameters and environment conditions. Notably, our model-agnostic approach preserves the original network structure without incurring additional inference costs, facilitating seamless integration across various models and simplifying deployment. Furthermore, we also show our approach achieves satisfactory results in real data when trained only with virtual datasets, eliminating the need for real scene annotations. Experimental results on both Domain Generalization (DG) and Unsupervised Domain Adaptation (UDA) clearly demonstrate its effectiveness. Our code will be released. ",
    "url": "https://arxiv.org/abs/2310.11346",
    "authors": [
      "Hao Lu",
      "Yunpeng Zhang",
      "Qing Lian",
      "Dalong Du",
      "Yingcong Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.11349",
    "title": "A robust and high precision algorithm for elastic scattering problems  from cornered domains",
    "abstract": "The Navier equation is the governing equation of elastic waves, and computing its solution accurately and rapidly has a wide range of applications in geophysical exploration, materials science, etc. In this paper, we focus on the efficient and high-precision numerical algorithm for the time harmonic elastic wave scattering problems from cornered domains via the boundary integral equations in two dimensions. The approach is based on the combination of Nystr\\\"om discretization, analytical singular integrals and kernel-splitting method, which results in a high-order solver for smooth boundaries. It is then combined with the recursively compressed inverse preconditioning (RCIP) method to solve elastic scattering problems from cornered domains. Numerical experiments demonstrate that the proposed approach achieves high accuracy, with stabilized errors close to machine precision in various geometric configurations. The algorithm is further applied to investigate the asymptotic behavior of density functions associated with boundary integral operators near corners, and the numerical results are highly consistent with the theoretical formulas. ",
    "url": "https://arxiv.org/abs/2310.11349",
    "authors": [
      "Jianan Yao",
      "Baoling Xie",
      "Jun Lai"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2310.11360",
    "title": "Enhancing Neural Machine Translation with Semantic Units",
    "abstract": "Conventional neural machine translation (NMT) models typically use subwords and words as the basic units for model input and comprehension. However, complete words and phrases composed of several tokens are often the fundamental units for expressing semantics, referred to as semantic units. To address this issue, we propose a method Semantic Units for Machine Translation (SU4MT) which models the integral meanings of semantic units within a sentence, and then leverages them to provide a new perspective for understanding the sentence. Specifically, we first propose Word Pair Encoding (WPE), a phrase extraction method to help identify the boundaries of semantic units. Next, we design an Attentive Semantic Fusion (ASF) layer to integrate the semantics of multiple subwords into a single vector: the semantic unit representation. Lastly, the semantic-unit-level sentence representation is concatenated to the token-level one, and they are combined as the input of encoder. Experimental results demonstrate that our method effectively models and leverages semantic-unit-level information and outperforms the strong baselines. The code is available at https://github.com/ictnlp/SU4MT. ",
    "url": "https://arxiv.org/abs/2310.11360",
    "authors": [
      "Langlin Huang",
      "Shuhao Gu",
      "Zhuocheng Zhang",
      "Yang Feng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.11366",
    "title": "Lie Group Decompositions for Equivariant Neural Networks",
    "abstract": "Invariance and equivariance to geometrical transformations have proven to be very useful inductive biases when training (convolutional) neural network models, especially in the low-data regime. Much work has focused on the case where the symmetry group employed is compact or abelian, or both. Recent work has explored enlarging the class of transformations used to the case of Lie groups, principally through the use of their Lie algebra, as well as the group exponential and logarithm maps. The applicability of such methods to larger transformation groups is limited by the fact that depending on the group of interest $G$, the exponential map may not be surjective. Further limitations are encountered when $G$ is neither compact nor abelian. Using the structure and geometry of Lie groups and their homogeneous spaces, we present a framework by which it is possible to work with such groups primarily focusing on the Lie groups $G = \\text{GL}^{+}(n, \\mathbb{R})$ and $G = \\text{SL}(n, \\mathbb{R})$, as well as their representation as affine transformations $\\mathbb{R}^{n} \\rtimes G$. Invariant integration as well as a global parametrization is realized by decomposing the `larger` groups into subgroups and submanifolds which can be handled individually. Under this framework, we show how convolution kernels can be parametrized to build models equivariant with respect to affine transformations. We evaluate the robustness and out-of-distribution generalisation capability of our model on the standard affine-invariant benchmark classification task, where we outperform all previous equivariant models as well as all Capsule Network proposals. ",
    "url": "https://arxiv.org/abs/2310.11366",
    "authors": [
      "Mircea Mironenco",
      "Patrick Forré"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.11368",
    "title": "VECHR: A Dataset for Explainable and Robust Classification of  Vulnerability Type in the European Court of Human Rights",
    "abstract": "Recognizing vulnerability is crucial for understanding and implementing targeted support to empower individuals in need. This is especially important at the European Court of Human Rights (ECtHR), where the court adapts Convention standards to meet actual individual needs and thus ensures effective human rights protection. However, the concept of vulnerability remains elusive at the ECtHR and no prior NLP research has dealt with it. To enable future research in this area, we present VECHR, a novel expert-annotated multi-label dataset comprising of vulnerability type classification and explanation rationale. We benchmark the performance of state-of-the-art models on VECHR from both prediction and explainability perspectives. Our results demonstrate the challenging nature of the task with lower prediction performance and limited agreement between models and experts. Further, we analyze the robustness of these models in dealing with out-of-domain (OOD) data and observe overall limited performance. Our dataset poses unique challenges offering significant room for improvement regarding performance, explainability, and robustness. ",
    "url": "https://arxiv.org/abs/2310.11368",
    "authors": [
      "Shanshan Xu",
      "Leon Staufer",
      "Santosh T.Y.S.S",
      "Oana Ichim",
      "Corina Heri",
      "Matthias Grabmair"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.11379",
    "title": "Robust Wake-Up Word Detection by Two-stage Multi-resolution Ensembles",
    "abstract": "Voice-based interfaces rely on a wake-up word mechanism to initiate communication with devices. However, achieving a robust, energy-efficient, and fast detection remains a challenge. This paper addresses these real production needs by enhancing data with temporal alignments and using detection based on two phases with multi-resolution. It employs two models: a lightweight on-device model for real-time processing of the audio stream and a verification model on the server-side, which is an ensemble of heterogeneous architectures that refine detection. This scheme allows the optimization of two operating points. To protect privacy, audio features are sent to the cloud instead of raw audio. The study investigated different parametric configurations for feature extraction to select one for on-device detection and another for the verification model. Furthermore, thirteen different audio classifiers were compared in terms of performance and inference time. The proposed ensemble outperforms our stronger classifier in every noise condition. ",
    "url": "https://arxiv.org/abs/2310.11379",
    "authors": [
      "Fernando López",
      "Jordi Luque",
      "Carlos Segura",
      "Pablo Gómez"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2310.11386",
    "title": "Towards Operationalizing Social Bonding in Human-Robot Dyads",
    "abstract": "With momentum increasing in the use of social robots as long-term assistive and collaborative partners, humans developing social bonds with these artificial agents appears to be inevitable. In human-human dyads, social bonding plays a powerful role in regulating behaviours, emotions, and even health. If this is to extend to human-robot dyads, the phenomenology of such relationships (including their emergence and stability) must be better understood. In this paper, we discuss potential approaches towards operationalizing the phenomenon of social bonding between human-robot dyads. We will discuss a number of biobehavioural proxies of social bonding, moving away from existing approaches that use subjective, psychological measures, and instead grounding our approach in some of the evolutionary, neurobiological and physiological correlates of social bond formation in natural systems: (a) reductions in physiological stress (the ''social buffering'' phenomenon), (b) narrowing of spatial proximity between dyads, and (c) inter-dyad behavioural synchrony. We provide relevant evolutionary support for each proposed component, with suggestions and considerations for how they can be recorded in (real-time) human-robot interaction scenarios. With this, we aim to inspire more robust operationalisation of ''social bonding'' between human and artificial (robotic) agents. ",
    "url": "https://arxiv.org/abs/2310.11386",
    "authors": [
      "Imran Khan"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2310.11397",
    "title": "Last One Standing: A Comparative Analysis of Security and Privacy of  Soft Prompt Tuning, LoRA, and In-Context Learning",
    "abstract": "Large Language Models (LLMs) are powerful tools for natural language processing, enabling novel applications and user experiences. However, to achieve optimal performance, LLMs often require adaptation with private data, which poses privacy and security challenges. Several techniques have been proposed to adapt LLMs with private data, such as Low-Rank Adaptation (LoRA), Soft Prompt Tuning (SPT), and In-Context Learning (ICL), but their comparative privacy and security properties have not been systematically investigated. In this work, we fill this gap by evaluating the robustness of LoRA, SPT, and ICL against three types of well-established attacks: membership inference, which exposes data leakage (privacy); backdoor, which injects malicious behavior (security); and model stealing, which can violate intellectual property (privacy and security). Our results show that there is no silver bullet for privacy and security in LLM adaptation and each technique has different strengths and weaknesses. ",
    "url": "https://arxiv.org/abs/2310.11397",
    "authors": [
      "Rui Wen",
      "Tianhao Wang",
      "Michael Backes",
      "Yang Zhang",
      "Ahmed Salem"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.11398",
    "title": "Neural Attention: Enhancing QKV Calculation in Self-Attention Mechanism  with Neural Networks",
    "abstract": "In the realm of deep learning, the self-attention mechanism has substantiated its pivotal role across a myriad of tasks, encompassing natural language processing and computer vision. Despite achieving success across diverse applications, the traditional self-attention mechanism primarily leverages linear transformations for the computation of query, key, and value (QKV), which may not invariably be the optimal choice under specific circumstances. This paper probes into a novel methodology for QKV computation-implementing a specially-designed neural network structure for the calculation. Utilizing a modified Marian model, we conducted experiments on the IWSLT 2017 German-English translation task dataset and juxtaposed our method with the conventional approach. The experimental results unveil a significant enhancement in BLEU scores with our method. Furthermore, our approach also manifested superiority when training the Roberta model with the Wikitext-103 dataset, reflecting a notable reduction in model perplexity compared to its original counterpart. These experimental outcomes not only validate the efficacy of our method but also reveal the immense potential in optimizing the self-attention mechanism through neural network-based QKV computation, paving the way for future research and practical applications. The source code and implementation details for our proposed method can be accessed at https://github.com/ocislyjrti/NeuralAttention. ",
    "url": "https://arxiv.org/abs/2310.11398",
    "authors": [
      "Muhan Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.11405",
    "title": "On Coherence-based Predictors for Dense Query Performance Prediction",
    "abstract": "Query Performance Prediction (QPP) estimates the effectiveness of a search engine's results in response to a query without relevance judgments. Traditionally, post-retrieval predictors have focused upon either the distribution of the retrieval scores, or the coherence of the top-ranked documents using traditional bag-of-words index representations. More recently, BERT-based models using dense embedded document representations have been used to create new predictors, but mostly applied to predict the performance of rankings created by BM25. Instead, we aim to predict the effectiveness of rankings created by single-representation dense retrieval models (ANCE & TCT-ColBERT). Therefore, we propose a number of variants of existing unsupervised coherence-based predictors that employ neural embedding representations. In our experiments on the TREC Deep Learning Track datasets, we demonstrate improved accuracy upon dense retrieval (up to 92% compared to sparse variants for TCT-ColBERT and 188% for ANCE). Going deeper, we select the most representative and best performing predictors to study the importance of differences among predictors and query types on query performance. Using existing distribution-based evaluation QPP measures and a particular type of linear mixed models, we find that query types further significantly influence query performance (and are up to 35% responsible for the unstable performance of QPP predictors), and that this sensitivity is unique to dense retrieval models. Our approach introduces a new setting for obtaining richer information on query differences in dense QPP that can explain potential unstable performance of existing predictors and outlines the unique characteristics of different query types on dense retrieval models. ",
    "url": "https://arxiv.org/abs/2310.11405",
    "authors": [
      "Maria Vlachou",
      "Craig Macdonald"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2310.11406",
    "title": "GreenNFV: Energy-Efficient Network Function Virtualization with Service  Level Agreement Constraints",
    "abstract": "Network Function Virtualization (NFV) platforms consume significant energy, introducing high operational costs in edge and data centers. This paper presents a novel framework called GreenNFV that optimizes resource usage for network function chains using deep reinforcement learning. GreenNFV optimizes resource parameters such as CPU sharing ratio, CPU frequency scaling, last-level cache (LLC) allocation, DMA buffer size, and packet batch size. GreenNFV learns the resource scheduling model from the benchmark experiments and takes Service Level Agreements (SLAs) into account to optimize resource usage models based on the different throughput and energy consumption requirements. Our evaluation shows that GreenNFV models achieve high transfer throughput and low energy consumption while satisfying various SLA constraints. Specifically, GreenNFV with Throughput SLA can achieve $4.4\\times$ higher throughput and $1.5\\times$ better energy efficiency over the baseline settings, whereas GreenNFV with Energy SLA can achieve $3\\times$ higher throughput while reducing energy consumption by 50%. ",
    "url": "https://arxiv.org/abs/2310.11406",
    "authors": [
      "MD S Q Zulkar Nine",
      "Tevfik Kosar",
      "Fatih Bulut",
      "Jinho Hwang"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2310.11417",
    "title": "VcT: Visual change Transformer for Remote Sensing Image Change Detection",
    "abstract": "Existing visual change detectors usually adopt CNNs or Transformers for feature representation learning and focus on learning effective representation for the changed regions between images. Although good performance can be obtained by enhancing the features of the change regions, however, these works are still limited mainly due to the ignorance of mining the unchanged background context information. It is known that one main challenge for change detection is how to obtain the consistent representations for two images involving different variations, such as spatial variation, sunlight intensity, etc. In this work, we demonstrate that carefully mining the common background information provides an important cue to learn the consistent representations for the two images which thus obviously facilitates the visual change detection problem. Based on this observation, we propose a novel Visual change Transformer (VcT) model for visual change detection problem. To be specific, a shared backbone network is first used to extract the feature maps for the given image pair. Then, each pixel of feature map is regarded as a graph node and the graph neural network is proposed to model the structured information for coarse change map prediction. Top-K reliable tokens can be mined from the map and refined by using the clustering algorithm. Then, these reliable tokens are enhanced by first utilizing self/cross-attention schemes and then interacting with original features via an anchor-primary attention learning module. Finally, the prediction head is proposed to get a more accurate change map. Extensive experiments on multiple benchmark datasets validated the effectiveness of our proposed VcT model. ",
    "url": "https://arxiv.org/abs/2310.11417",
    "authors": [
      "Bo Jiang",
      "Zitian Wang",
      "Xixi Wang",
      "Ziyan Zhang",
      "Lan Chen",
      "Xiao Wang",
      "Bin Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.11439",
    "title": "Understanding deep neural networks through the lens of their  non-linearity",
    "abstract": "The remarkable success of deep neural networks (DNN) is often attributed to their high expressive power and their ability to approximate functions of arbitrary complexity. Indeed, DNNs are highly non-linear models, and activation functions introduced into them are largely responsible for this. While many works studied the expressive power of DNNs through the lens of their approximation capabilities, quantifying the non-linearity of DNNs or of individual activation functions remains an open problem. In this paper, we propose the first theoretically sound solution to track non-linearity propagation in deep neural networks with a specific focus on computer vision applications. Our proposed affinity score allows us to gain insights into the inner workings of a wide range of different architectures and learning paradigms. We provide extensive experimental results that highlight the practical utility of the proposed affinity score and its potential for long-reaching applications. ",
    "url": "https://arxiv.org/abs/2310.11439",
    "authors": [
      "Quentin Bouniot",
      "Ievgen Redko",
      "Anton Mallasto",
      "Charlotte Laclau",
      "Karol Arndt",
      "Oliver Struckmeier",
      "Markus Heinonen",
      "Ville Kyrki",
      "Samuel Kaski"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.11450",
    "title": "Explaining Deep Neural Networks for Bearing Fault Detection with  Vibration Concepts",
    "abstract": "Concept-based explanation methods, such as Concept Activation Vectors, are potent means to quantify how abstract or high-level characteristics of input data influence the predictions of complex deep neural networks. However, applying them to industrial prediction problems is challenging as it is not immediately clear how to define and access appropriate concepts for individual use cases and specific data types. In this work, we investigate how to leverage established concept-based explanation techniques in the context of bearing fault detection with deep neural networks trained on vibration signals. Since bearings are prevalent in almost every rotating equipment, ensuring the reliability of intransparent fault detection models is crucial to prevent costly repairs and downtimes of industrial machinery. Our evaluations demonstrate that explaining opaque models in terms of vibration concepts enables human-comprehensible and intuitive insights about their inner workings, but the underlying assumptions need to be carefully validated first. ",
    "url": "https://arxiv.org/abs/2310.11450",
    "authors": [
      "Thomas Decker",
      "Michael Lebacher",
      "Volker Tresp"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.11451",
    "title": "Seeking Neural Nuggets: Knowledge Transfer in Large Language Models from  a Parametric Perspective",
    "abstract": "Large Language Models (LLMs) inherently encode a wealth of knowledge within their parameters through pre-training on extensive corpora. While prior research has delved into operations on these parameters to manipulate the underlying implicit knowledge (encompassing detection, editing, and merging), there remains an ambiguous understanding regarding their transferability across models with varying scales. In this paper, we seek to empirically investigate knowledge transfer from larger to smaller models through a parametric perspective. To achieve this, we employ sensitivity-based techniques to extract and align knowledge-specific parameters between different LLMs. Moreover, the LoRA module is used as the intermediary mechanism for injecting the extracted knowledge into smaller models. Evaluations across four benchmarks validate the efficacy of our proposed method. Our findings highlight the critical factors contributing to the process of parametric knowledge transfer, underscoring the transferability of model parameters across LLMs of different scales. We release code and data at \\url{https://github.com/maszhongming/ParaKnowTransfer}. ",
    "url": "https://arxiv.org/abs/2310.11451",
    "authors": [
      "Ming Zhong",
      "Chenxin An",
      "Weizhu Chen",
      "Jiawei Han",
      "Pengcheng He"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10717",
    "title": "A representation learning approach to probe for dynamical dark energy in  matter power spectra",
    "abstract": "We present DE-VAE, a variational autoencoder (VAE) architecture to search for a compressed representation of dynamical dark energy (DE) models in observational studies of the cosmic large-scale structure. DE-VAE is trained on matter power spectra boosts generated at wavenumbers $k\\in(0.01-2.5) \\ h/\\rm{Mpc}$ and at four redshift values $z\\in(0.1,0.48,0.78,1.5)$ for the most typical dynamical DE parametrization with two extra parameters describing an evolving DE equation of state. The boosts are compressed to a lower-dimensional representation, which is concatenated with standard cold dark matter (CDM) parameters and then mapped back to reconstructed boosts; both the compression and the reconstruction components are parametrized as neural networks. Remarkably, we find that a single latent parameter is sufficient to predict 95% (99%) of DE power spectra generated over a broad range of cosmological parameters within $1\\sigma$ ($2\\sigma$) of a Gaussian error which includes cosmic variance, shot noise and systematic effects for a Stage IV-like survey. This single parameter shows a high mutual information with the two DE parameters, and these three variables can be linked together with an explicit equation through symbolic regression. Considering a model with two latent variables only marginally improves the accuracy of the predictions, and adding a third latent variable has no significant impact on the model's performance. We discuss how the DE-VAE architecture can be extended from a proof of concept to a general framework to be employed in the search for a common lower-dimensional parametrization of a wide range of beyond-$\\Lambda$CDM models and for different cosmological datasets. Such a framework could then both inform the development of cosmological surveys by targeting optimal probes, and provide theoretical insight into the common phenomenological aspects of beyond-$\\Lambda$CDM models. ",
    "url": "https://arxiv.org/abs/2310.10717",
    "authors": [
      "Davide Piras",
      "Lucas Lombriser"
    ],
    "subjectives": [
      "Cosmology and Nongalactic Astrophysics (astro-ph.CO)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10788",
    "title": "Self-Supervised Models of Speech Infer Universal Articulatory Kinematics",
    "abstract": "Self-Supervised Learning (SSL) based models of speech have shown remarkable performance on a range of downstream tasks. These state-of-the-art models have remained blackboxes, but many recent studies have begun \"probing\" models like HuBERT, to correlate their internal representations to different aspects of speech. In this paper, we show \"inference of articulatory kinematics\" as fundamental property of SSL models, i.e., the ability of these models to transform acoustics into the causal articulatory dynamics underlying the speech signal. We also show that this abstraction is largely overlapping across the language of the data used to train the model, with preference to the language with similar phonological system. Furthermore, we show that with simple affine transformations, Acoustic-to-Articulatory inversion (AAI) is transferrable across speakers, even across genders, languages, and dialects, showing the generalizability of this property. Together, these results shed new light on the internals of SSL models that are critical to their superior performance, and open up new avenues into language-agnostic universal models for speech engineering, that are interpretable and grounded in speech science. ",
    "url": "https://arxiv.org/abs/2310.10788",
    "authors": [
      "Cheol Jun Cho",
      "Abdelrahman Mohamed",
      "Alan W Black",
      "Gopala K. Anumanchipalli"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.10806",
    "title": "Convolutional Neural Network Model for Diabetic Retinopathy Feature  Extraction and Classification",
    "abstract": "The application of Artificial Intelligence in the medical market brings up increasing concerns but aids in more timely diagnosis of silent progressing diseases like Diabetic Retinopathy. In order to diagnose Diabetic Retinopathy (DR), ophthalmologists use color fundus images, or pictures of the back of the retina, to identify small distinct features through a difficult and time-consuming process. Our work creates a novel CNN model and identifies the severity of DR through fundus image input. We classified 4 known DR features, including micro-aneurysms, cotton wools, exudates, and hemorrhages, through convolutional layers and were able to provide an accurate diagnostic without additional user input. The proposed model is more interpretable and robust to overfitting. We present initial results with a sensitivity of 97% and an accuracy of 71%. Our contribution is an interpretable model with similar accuracy to more complex models. With that, our model advances the field of DR detection and proves to be a key step towards AI-focused medical diagnosis. ",
    "url": "https://arxiv.org/abs/2310.10806",
    "authors": [
      "Sharan Subramanian",
      "Leilani H. Gilpin"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10893",
    "title": "Active Learning Framework for Cost-Effective TCR-Epitope Binding  Affinity Prediction",
    "abstract": "T cell receptors (TCRs) are critical components of adaptive immune systems, responsible for responding to threats by recognizing epitope sequences presented on host cell surface. Computational prediction of binding affinity between TCRs and epitope sequences using machine/deep learning has attracted intense attention recently. However, its success is hindered by the lack of large collections of annotated TCR-epitope pairs. Annotating their binding affinity requires expensive and time-consuming wet-lab evaluation. To reduce annotation cost, we present ActiveTCR, a framework that incorporates active learning and TCR-epitope binding affinity prediction models. Starting with a small set of labeled training pairs, ActiveTCR iteratively searches for unlabeled TCR-epitope pairs that are ''worth'' for annotation. It aims to maximize performance gains while minimizing the cost of annotation. We compared four query strategies with a random sampling baseline and demonstrated that ActiveTCR reduces annotation costs by approximately 40%. Furthermore, we showed that providing ground truth labels of TCR-epitope pairs to query strategies can help identify and reduce more than 40% redundancy among already annotated pairs without compromising model performance, enabling users to train equally powerful prediction models with less training data. Our work is the first systematic investigation of data optimization for TCR-epitope binding affinity prediction. ",
    "url": "https://arxiv.org/abs/2310.10893",
    "authors": [
      "Pengfei Zhang",
      "Seojin Bang",
      "Heewook Lee"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10965",
    "title": "The neural network models with delays for solving absolute value  equations",
    "abstract": "An inverse-free neural network model with mixed delays is proposed for solving the absolute value equation (AVE) $Ax -|x| - b =0$, which includes an inverse-free neural network model with discrete delay as a special case. By using the Lyapunov-Krasovskii theory and the linear matrix inequality (LMI) method, the developed neural network models are proved to be exponentially convergent to the solution of the AVE. Compared with the existing neural network models for solving the AVE, the proposed models feature the ability of solving a class of AVE with $\\|A^{-1}\\|>1$. Numerical simulations are given to show the effectiveness of the two delayed neural network models. ",
    "url": "https://arxiv.org/abs/2310.10965",
    "authors": [
      "Dongmei Yu",
      "Gehao Zhang",
      "Cairong Chen",
      "Deren Han"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2310.11043",
    "title": "Spoofing Attack Detection in the Physical Layer with Robustness to User  Movement",
    "abstract": "In a spoofing attack, an attacker impersonates a legitimate user to access or modify data belonging to the latter. Typical approaches for spoofing detection in the physical layer declare an attack when a change is observed in certain channel features, such as the received signal strength (RSS) measured by spatially distributed receivers. However, since channels change over time, for example due to user movement, such approaches are impractical. To sidestep this limitation, this paper proposes a scheme that combines the decisions of a position-change detector based on a deep neural network to distinguish spoofing from movement. Building upon community detection on graphs, the sequence of received frames is partitioned into subsequences to detect concurrent transmissions from distinct locations. The scheme can be easily deployed in practice since it just involves collecting a small dataset of measurements at a few tens of locations that need not even be computed or recorded. The scheme is evaluated on real data collected for this purpose. ",
    "url": "https://arxiv.org/abs/2310.11043",
    "authors": [
      "Daniel Romero",
      "Tien Ngoc Ha",
      "Peter Gerstoft"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.11265",
    "title": "Image Compression using only Attention based Neural Networks",
    "abstract": "In recent research, Learned Image Compression has gained prominence for its capacity to outperform traditional handcrafted pipelines, especially at low bit-rates. While existing methods incorporate convolutional priors with occasional attention blocks to address long-range dependencies, recent advances in computer vision advocate for a transformative shift towards fully transformer-based architectures grounded in the attention mechanism. This paper investigates the feasibility of image compression exclusively using attention layers within our novel model, QPressFormer. We introduce the concept of learned image queries to aggregate patch information via cross-attention, followed by quantization and coding techniques. Through extensive evaluations, our work demonstrates competitive performance achieved by convolution-free architectures across the popular Kodak, DIV2K, and CLIC datasets. ",
    "url": "https://arxiv.org/abs/2310.11265",
    "authors": [
      "Natacha Luka",
      "Romain Negrel",
      "David Picard"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.11276",
    "title": "Video Super-Resolution Using a Grouped Residual in Residual Network",
    "abstract": "Super-resolution (SR) is the technique of increasing the nominal resolution of image / video content accompanied with quality improvement. Video super-resolution (VSR) can be considered as the generalization of single image super-resolution (SISR). This generalization should be such that more detail is created in the output using adjacent input frames. In this paper, we propose a grouped residual in residual network (GRRN) for VSR. By adjusting the hyperparameters of the proposed structure, we train three networks with different numbers of parameters and compare their quantitative and qualitative results with the existing methods. Although based on some quantitative criteria, GRRN does not provide better results than the existing methods, in terms of the quality of the output image it has acceptable performance. ",
    "url": "https://arxiv.org/abs/2310.11276",
    "authors": [
      "MohammadHossein Ashoori",
      "Arash Amini"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.11404",
    "title": "Synthesis of constrained robust feedback policies and model predictive  control",
    "abstract": "In this work, we develop a method based on robust control techniques to synthesize robust time-varying state-feedback policies for finite, infinite, and receding horizon control problems subject to convex quadratic state and input constraints. To ensure constraint satisfaction of our policy, we employ (initial state)-to-peak gain techniques. Based on this idea, we formulate linear matrix inequality conditions, which are simultaneously convex in the parameters of an affine control policy, a Lyapunov function along the trajectory and multiplier variables for the uncertainties in a time-varying linear fractional transformation model. In our experiments this approach is less conservative than standard tube-based robust model predictive control methods. ",
    "url": "https://arxiv.org/abs/2310.11404",
    "authors": [
      "Dennis Gramlich",
      "Carsten W. Scherer",
      "Hannah Häring",
      "Christian Ebenbauer"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.11431",
    "title": "Identifying Interpretable Visual Features in Artificial and Biological  Neural Systems",
    "abstract": "Single neurons in neural networks are often ``interpretable'' in that they represent individual, intuitively meaningful features. However, many neurons exhibit $\\textit{mixed selectivity}$, i.e., they represent multiple unrelated features. A recent hypothesis proposes that features in deep networks may be represented in $\\textit{superposition}$, i.e., on non-orthogonal axes by multiple neurons, since the number of possible interpretable features in natural data is generally larger than the number of neurons in a given network. Accordingly, we should be able to find meaningful directions in activation space that are not aligned with individual neurons. Here, we propose (1) an automated method for quantifying visual interpretability that is validated against a large database of human psychophysics judgments of neuron interpretability, and (2) an approach for finding meaningful directions in network activation space. We leverage these methods to discover directions in convolutional neural networks that are more intuitively meaningful than individual neurons, as we confirm and investigate in a series of analyses. Moreover, we apply the same method to two recent datasets of visual neural responses in the brain and find that our conclusions largely transfer to real neural data, suggesting that superposition might be deployed by the brain. This also provides a link with disentanglement and raises fundamental questions about robust, efficient and factorized representations in both artificial and biological neural systems. ",
    "url": "https://arxiv.org/abs/2310.11431",
    "authors": [
      "David Klindt",
      "Sophia Sanborn",
      "Francisco Acosta",
      "Frédéric Poitevin",
      "Nina Miolane"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1804.09133",
    "title": "Improving Native Ads CTR Prediction by Large Scale Event Embedding and  Recurrent Networks",
    "abstract": " Title: Improving Native Ads CTR Prediction by Large Scale Event Embedding and  Recurrent Networks ",
    "url": "https://arxiv.org/abs/1804.09133",
    "authors": [
      "Mehul Parsana",
      "Krishna Poola",
      "Yajun Wang",
      "Zhiguang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:1907.04585",
    "title": "Quasi-polynomial time approximation schemes for the Maximum Weight  Independent Set Problem in H-free graphs",
    "abstract": " Comments: v2: added results on subexponential algorithms, v3: revision after reviewers' remarks ",
    "url": "https://arxiv.org/abs/1907.04585",
    "authors": [
      "Maria Chudnovsky",
      "Marcin Pilipczuk",
      "Michał Pilipczuk",
      "Stéphan Thomassé"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2105.01331",
    "title": "BLM-17m: A Large-Scale Dataset for Black Lives Matter Topic Detection on  Twitter",
    "abstract": " Title: BLM-17m: A Large-Scale Dataset for Black Lives Matter Topic Detection on  Twitter ",
    "url": "https://arxiv.org/abs/2105.01331",
    "authors": [
      "Hasan Kemik",
      "Nusret Özateş",
      "Meysam Asgari-Chenaghlu",
      "Yang Li",
      "Erik Cambria"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.07101",
    "title": "Delay-aware Robust Control for Safe Autonomous Driving",
    "abstract": " Comments: Accepted at IV 2022 ",
    "url": "https://arxiv.org/abs/2109.07101",
    "authors": [
      "Dvij Kalaria",
      "Qin Lin",
      "John M. Dolan"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.04793",
    "title": "Fake news detection using parallel BERT deep neural networks",
    "abstract": " Comments: Multimed Tools Appl (2023) ",
    "url": "https://arxiv.org/abs/2204.04793",
    "authors": [
      "Mahmood Farokhian",
      "Vahid Rafe",
      "Hadi Veisi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2206.06299",
    "title": "An adversarially robust data-market for spatial, crowd-sourced data",
    "abstract": " Comments: 13 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2206.06299",
    "authors": [
      "Aida Manzano Kharman",
      "Christian Jursitzky",
      "Quan Zhou",
      "Pietro Ferraro",
      "Jakub Marecek",
      "Pierre Pinson",
      "Robert Shorten"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2206.07940",
    "title": "PROFHIT: Probabilistic Robust Forecasting for Hierarchical Time-series",
    "abstract": " Comments: Submitted a new version ",
    "url": "https://arxiv.org/abs/2206.07940",
    "authors": [
      "Harshavardhan Kamarthi",
      "Lingkai Kong",
      "Alexander Rodríguez",
      "Chao Zhang",
      "B. Aditya Prakash"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.09818",
    "title": "SSM-DTA: Breaking the Barriers of Data Scarcity in Drug-Target Affinity  Prediction",
    "abstract": " Comments: Accepted by Briefings in Bioinformatics 2023 ",
    "url": "https://arxiv.org/abs/2206.09818",
    "authors": [
      "Qizhi Pei",
      "Lijun Wu",
      "Jinhua Zhu",
      "Yingce Xia",
      "Shufang Xie",
      "Tao Qin",
      "Haiguang Liu",
      "Tie-Yan Liu",
      "Rui Yan"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.10745",
    "title": "Derivative-Informed Neural Operator: An Efficient Framework for  High-Dimensional Parametric Derivative Learning",
    "abstract": " Title: Derivative-Informed Neural Operator: An Efficient Framework for  High-Dimensional Parametric Derivative Learning ",
    "url": "https://arxiv.org/abs/2206.10745",
    "authors": [
      "Thomas O'Leary-Roseberry",
      "Peng Chen",
      "Umberto Villa",
      "Omar Ghattas"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2207.07173",
    "title": "Deep Image Clustering with Contrastive Learning and Multi-scale Graph  Convolutional Networks",
    "abstract": " Comments: To appear in the Pattern Recognition journal ",
    "url": "https://arxiv.org/abs/2207.07173",
    "authors": [
      "Yuankun Xu",
      "Dong Huang",
      "Chang-Dong Wang",
      "Jian-Huang Lai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.08610",
    "title": "Rapid and robust synchronization via weak synaptic coupling Extended  arXiv version",
    "abstract": " Comments: 20 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2207.08610",
    "authors": [
      "Jin Gyu Lee",
      "Rodolphe Sepulchre"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2207.12547",
    "title": "The BUTTER Zone: An Empirical Study of Training Dynamics in Fully  Connected Neural Networks",
    "abstract": " Title: The BUTTER Zone: An Empirical Study of Training Dynamics in Fully  Connected Neural Networks ",
    "url": "https://arxiv.org/abs/2207.12547",
    "authors": [
      "Charles Edison Tripp",
      "Jordan Perr-Sauer",
      "Lucas Hayne",
      "Monte Lunacek",
      "Jamil Gafur"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.01387",
    "title": "Differential Privacy on Dynamic Data",
    "abstract": " Title: Differential Privacy on Dynamic Data ",
    "url": "https://arxiv.org/abs/2209.01387",
    "authors": [
      "Yuan Qiu",
      "Ke Yi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2210.05521",
    "title": "Hybrid Inverted Index Is a Robust Accelerator for Dense Retrieval",
    "abstract": " Title: Hybrid Inverted Index Is a Robust Accelerator for Dense Retrieval ",
    "url": "https://arxiv.org/abs/2210.05521",
    "authors": [
      "Peitian Zhang",
      "Zheng Liu",
      "Shitao Xiao",
      "Zhicheng Dou",
      "Jing Yao"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.05412",
    "title": "Desire Backpropagation: A Lightweight Training Algorithm for Multi-Layer  Spiking Neural Networks based on Spike-Timing-Dependent Plasticity",
    "abstract": " Title: Desire Backpropagation: A Lightweight Training Algorithm for Multi-Layer  Spiking Neural Networks based on Spike-Timing-Dependent Plasticity ",
    "url": "https://arxiv.org/abs/2211.05412",
    "authors": [
      "Daniel Gerlinghoff",
      "Tao Luo",
      "Rick Siow Mong Goh",
      "Weng-Fai Wong"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2212.10230",
    "title": "A Comprehensive Study of the Robustness for LiDAR-based 3D Object  Detectors against Adversarial Attacks",
    "abstract": " Comments: 30 pages, 14 figures. Accepted by IJCV ",
    "url": "https://arxiv.org/abs/2212.10230",
    "authors": [
      "Yifan Zhang",
      "Junhui Hou",
      "Yixuan Yuan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.00434",
    "title": "Cops and robbers pebbling in graphs",
    "abstract": " Title: Cops and robbers pebbling in graphs ",
    "url": "https://arxiv.org/abs/2301.00434",
    "authors": [
      "Nancy Clarke",
      "Joshua Forkin",
      "Glenn Hurlbert"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2301.04900",
    "title": "How accurate are neural approximations of complex network dynamics?",
    "abstract": " Title: How accurate are neural approximations of complex network dynamics? ",
    "url": "https://arxiv.org/abs/2301.04900",
    "authors": [
      "Vaiva Vasiliauskaite",
      "Nino Antulov-Fantulin"
    ],
    "subjectives": [
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.05856",
    "title": "EARL: An Elliptical Distribution aided Adaptive Rotation Label  Assignment for Oriented Object Detection in Remote Sensing Images",
    "abstract": " Title: EARL: An Elliptical Distribution aided Adaptive Rotation Label  Assignment for Oriented Object Detection in Remote Sensing Images ",
    "url": "https://arxiv.org/abs/2301.05856",
    "authors": [
      "Jian Guan",
      "Mingjie Xie",
      "Youtian Lin",
      "Guangjun He",
      "Pengming Feng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09749",
    "title": "A Data-Efficient Visual-Audio Representation with Intuitive Fine-tuning  for Voice-Controlled Robots",
    "abstract": " Comments: Published at Conference on Robot Learning (CoRL), 2023 ",
    "url": "https://arxiv.org/abs/2301.09749",
    "authors": [
      "Peixin Chang",
      "Shuijing Liu",
      "Tianchen Ji",
      "Neeloy Chakraborty",
      "Kaiwen Hong",
      "Katherine Driggs-Campbell"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.12892",
    "title": "Quantifying and maximizing the information flux in recurrent neural  networks",
    "abstract": " Title: Quantifying and maximizing the information flux in recurrent neural  networks ",
    "url": "https://arxiv.org/abs/2301.12892",
    "authors": [
      "Claus Metzner",
      "Marius E. Yamakou",
      "Dennis Voelkl",
      "Achim Schilling",
      "Patrick Krauss"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2302.03246",
    "title": "CDANs: Temporal Causal Discovery from Autocorrelated and Non-Stationary  Time Series Data",
    "abstract": " Title: CDANs: Temporal Causal Discovery from Autocorrelated and Non-Stationary  Time Series Data ",
    "url": "https://arxiv.org/abs/2302.03246",
    "authors": [
      "Muhammad Hasan Ferdous",
      "Uzma Hasan",
      "Md Osman Gani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2302.04264",
    "title": "Nerfstudio: A Modular Framework for Neural Radiance Field Development",
    "abstract": " Comments: Project page at this https URL ",
    "url": "https://arxiv.org/abs/2302.04264",
    "authors": [
      "Matthew Tancik",
      "Ethan Weber",
      "Evonne Ng",
      "Ruilong Li",
      "Brent Yi",
      "Justin Kerr",
      "Terrance Wang",
      "Alexander Kristoffersen",
      "Jake Austin",
      "Kamyar Salahi",
      "Abhik Ahuja",
      "David McAllister",
      "Angjoo Kanazawa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2302.05372",
    "title": "Towards Minimax Optimality of Model-based Robust Reinforcement Learning",
    "abstract": " Title: Towards Minimax Optimality of Model-based Robust Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2302.05372",
    "authors": [
      "Pierre Clavier",
      "Erwan Le Pennec",
      "Matthieu Geist"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2303.04238",
    "title": "Patch of Invisibility: Naturalistic Physical Black-Box Adversarial  Attacks on Object Detectors",
    "abstract": " Title: Patch of Invisibility: Naturalistic Physical Black-Box Adversarial  Attacks on Object Detectors ",
    "url": "https://arxiv.org/abs/2303.04238",
    "authors": [
      "Raz Lapid",
      "Eylon Mizrahi",
      "Moshe Sipper"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2303.04614",
    "title": "Densely Connected $G$-invariant Deep Neural Networks with Signed  Permutation Representations",
    "abstract": " Comments: 40 pages, 2 figures, 4 tables. For associated code repository see this https URL ",
    "url": "https://arxiv.org/abs/2303.04614",
    "authors": [
      "Devanshu Agrawal",
      "James Ostrowski"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2303.09767",
    "title": "It Is All About Data: A Survey on the Effects of Data on Adversarial  Robustness",
    "abstract": " Comments: Accepted to ACM Computing Surveys, 40 pages, 24 figures ",
    "url": "https://arxiv.org/abs/2303.09767",
    "authors": [
      "Peiyu Xiong",
      "Michael Tegegn",
      "Jaskeerat Singh Sarin",
      "Shubhraneel Pal",
      "Julia Rubin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2303.09806",
    "title": "DexRepNet: Learning Dexterous Robotic Grasping Network with Geometric  and Spatial Hand-Object Representations",
    "abstract": " Comments: accepted by IROS 2023 ",
    "url": "https://arxiv.org/abs/2303.09806",
    "authors": [
      "Qingtao Liu",
      "Yu Cui",
      "Qi Ye",
      "Zhengnan Sun",
      "Haoming Li",
      "Gaofeng Li",
      "Lin Shao",
      "Jiming Chen"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2303.13827",
    "title": "Efficient Mixed-Type Wafer Defect Pattern Recognition Using Compact  Deformable Convolutional Transformers",
    "abstract": " Comments: Study is not relevant ",
    "url": "https://arxiv.org/abs/2303.13827",
    "authors": [
      "Nitish Shukla"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.17806",
    "title": "Neural Microfacet Fields for Inverse Rendering",
    "abstract": " Comments: Project page: this https URL ",
    "url": "https://arxiv.org/abs/2303.17806",
    "authors": [
      "Alexander Mai",
      "Dor Verbin",
      "Falko Kuester",
      "Sara Fridovich-Keil"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2304.01492",
    "title": "A Unified Contrastive Transfer Framework with Propagation Structure for  Boosting Low-Resource Rumor Detection",
    "abstract": " Comments: An extension of the first contrastive approach for low-resource rumor detection (arXiv:2204.08143) ",
    "url": "https://arxiv.org/abs/2304.01492",
    "authors": [
      "Hongzhan Lin",
      "Jing Ma",
      "Ruichao Yang",
      "Zhiwei Yang",
      "Mingfei Cheng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.02806",
    "title": "Graph Mixture of Experts: Learning on Large-Scale Graphs with Explicit  Diversity Modeling",
    "abstract": " Comments: NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2304.02806",
    "authors": [
      "Haotao Wang",
      "Ziyu Jiang",
      "Yuning You",
      "Yan Han",
      "Gaowen Liu",
      "Jayanth Srinivasa",
      "Ramana Rao Kompella",
      "Zhangyang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06547",
    "title": "Neural Lyapunov Control for Discrete-Time Systems",
    "abstract": " Comments: NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2305.06547",
    "authors": [
      "Junlin Wu",
      "Andrew Clark",
      "Yiannis Kantaros",
      "Yevgeniy Vorobeychik"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.07089",
    "title": "Hierarchically Coherent Multivariate Mixture Networks",
    "abstract": " Title: Hierarchically Coherent Multivariate Mixture Networks ",
    "url": "https://arxiv.org/abs/2305.07089",
    "authors": [
      "Kin G. Olivares",
      "David Luo",
      "Cristian Challu",
      "Stefania La Vattiata",
      "Max Mergenthaler",
      "Artur Dubrawski"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2305.07845",
    "title": "Understanding and Improving Model Averaging in Federated Learning on  Heterogeneous Data",
    "abstract": " Title: Understanding and Improving Model Averaging in Federated Learning on  Heterogeneous Data ",
    "url": "https://arxiv.org/abs/2305.07845",
    "authors": [
      "Tailin Zhou",
      "Zehong Lin",
      "Jun Zhang",
      "Danny H.K. Tsang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.10664",
    "title": "Posterior Inference on Shallow Infinitely Wide Bayesian Neural Networks  under Weights with Unbounded Variance",
    "abstract": " Title: Posterior Inference on Shallow Infinitely Wide Bayesian Neural Networks  under Weights with Unbounded Variance ",
    "url": "https://arxiv.org/abs/2305.10664",
    "authors": [
      "Jorge Loría",
      "Anindya Bhadra"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.16283",
    "title": "CommonScenes: Generating Commonsense 3D Indoor Scenes with Scene Graphs",
    "abstract": " Comments: NeurIPS 2023 accepted ",
    "url": "https://arxiv.org/abs/2305.16283",
    "authors": [
      "Guangyao Zhai",
      "Evin Pınar Örnek",
      "Shun-Cheng Wu",
      "Yan Di",
      "Federico Tombari",
      "Nassir Navab",
      "Benjamin Busam"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.19130",
    "title": "Adaptation of Tongue Ultrasound-Based Silent Speech Interfaces Using  Spatial Transformer Networks",
    "abstract": " Comments: 5 pages, 3 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2305.19130",
    "authors": [
      "László Tóth",
      "Amin Honarmandi Shandiz",
      "Gábor Gosztolya",
      "Csapó Tamás Gábor"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2306.02256",
    "title": "Less is More: Revisiting the Gaussian Mechanism for Differential Privacy",
    "abstract": " Comments: Accepted at USENIX Security '24 ",
    "url": "https://arxiv.org/abs/2306.02256",
    "authors": [
      "Tianxi Ji",
      "Pan Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2306.02602",
    "title": "ReContrast: Domain-Specific Anomaly Detection via Contrastive  Reconstruction",
    "abstract": " Comments: NeurIPS 2023 Poster ",
    "url": "https://arxiv.org/abs/2306.02602",
    "authors": [
      "Jia Guo",
      "Shuai Lu",
      "Lize Jia",
      "Weihang Zhang",
      "Huiqi Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.04265",
    "title": "Permutation Equivariant Graph Framelets for Heterophilous Graph Learning",
    "abstract": " Title: Permutation Equivariant Graph Framelets for Heterophilous Graph Learning ",
    "url": "https://arxiv.org/abs/2306.04265",
    "authors": [
      "Jianfei Li",
      "Ruigang Zheng",
      "Han Feng",
      "Ming Li",
      "Xiaosheng Zhuang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)",
      "Functional Analysis (math.FA)"
    ]
  },
  {
    "id": "arXiv:2306.04607",
    "title": "GeoDiffusion: Text-Prompted Geometric Control for Object Detection Data  Generation",
    "abstract": " Comments: Project Page: this https URL ",
    "url": "https://arxiv.org/abs/2306.04607",
    "authors": [
      "Kai Chen",
      "Enze Xie",
      "Zhe Chen",
      "Yibo Wang",
      "Lanqing Hong",
      "Zhenguo Li",
      "Dit-Yan Yeung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.04810",
    "title": "Correlative Information Maximization: A Biologically Plausible Approach  to Supervised Deep Neural Networks without Weight Symmetry",
    "abstract": " Comments: Preprint, 38 pages ",
    "url": "https://arxiv.org/abs/2306.04810",
    "authors": [
      "Bariscan Bozkurt",
      "Cengiz Pehlevan",
      "Alper T Erdogan"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2306.06081",
    "title": "CARSO: Blending Adversarial Training and Purification Improves  Adversarial Robustness",
    "abstract": " Comments: 19 pages, 1 figure, 9 tables ",
    "url": "https://arxiv.org/abs/2306.06081",
    "authors": [
      "Emanuele Ballarin",
      "Alessio Ansuini",
      "Luca Bortolussi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.09896",
    "title": "Is Self-Repair a Silver Bullet for Code Generation?",
    "abstract": " Comments: Added experiments for HumanEval (dataset) and Code Llama (model) ",
    "url": "https://arxiv.org/abs/2306.09896",
    "authors": [
      "Theo X. Olausson",
      "Jeevana Priya Inala",
      "Chenglong Wang",
      "Jianfeng Gao",
      "Armando Solar-Lezama"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Programming Languages (cs.PL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2306.17181",
    "title": "Unsupervised Text Embedding Space Generation Using Generative  Adversarial Networks for Text Synthesis",
    "abstract": " Comments: NEJLT accpeted ",
    "url": "https://arxiv.org/abs/2306.17181",
    "authors": [
      "Jun-Min Lee",
      "Tae-Bin Ha"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.01998",
    "title": "Zero-Shot Neural Architecture Search: Challenges, Solutions, and  Opportunities",
    "abstract": " Title: Zero-Shot Neural Architecture Search: Challenges, Solutions, and  Opportunities ",
    "url": "https://arxiv.org/abs/2307.01998",
    "authors": [
      "Guihong Li",
      "Duc Hoang",
      "Kartikeya Bhardwaj",
      "Ming Lin",
      "Zhangyang Wang",
      "Radu Marculescu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09052",
    "title": "Connections between Operator-splitting Methods and Deep Neural Networks  with Applications in Image Segmentation",
    "abstract": " Title: Connections between Operator-splitting Methods and Deep Neural Networks  with Applications in Image Segmentation ",
    "url": "https://arxiv.org/abs/2307.09052",
    "authors": [
      "Hao Liu",
      "Xue-Cheng Tai",
      "Raymond Chan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.14494",
    "title": "Finding roots of complex analytic functions via generalized colleague  matrices",
    "abstract": " Title: Finding roots of complex analytic functions via generalized colleague  matrices ",
    "url": "https://arxiv.org/abs/2307.14494",
    "authors": [
      "Hanwen Zhang",
      "Vladimir Rokhlin"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2307.16189",
    "title": "Stable Optimization: A Novel Approach to Counter Numerical Instability  in 16-bit Neural Network Training",
    "abstract": " Title: Stable Optimization: A Novel Approach to Counter Numerical Instability  in 16-bit Neural Network Training ",
    "url": "https://arxiv.org/abs/2307.16189",
    "authors": [
      "Juyoung Yun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.10335",
    "title": "Can ChatGPT replace StackOverflow? A Study on Robustness and Reliability  of Large Language Model Code Generation",
    "abstract": " Title: Can ChatGPT replace StackOverflow? A Study on Robustness and Reliability  of Large Language Model Code Generation ",
    "url": "https://arxiv.org/abs/2308.10335",
    "authors": [
      "Li Zhong",
      "Zilong Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.16470",
    "title": "Domain-adaptive Message Passing Graph Neural Network",
    "abstract": " Comments: This version rectifies the numerical inaccuracies of Table 3 and 4 in the printed version (this https URL). See our corrigendum at this https URL ",
    "url": "https://arxiv.org/abs/2308.16470",
    "authors": [
      "Xiao Shen",
      "Shirui Pan",
      "Kup-Sze Choi",
      "Xi Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.12128",
    "title": "Convergence and Recovery Guarantees of Unsupervised Neural Networks for  Inverse Problems",
    "abstract": " Title: Convergence and Recovery Guarantees of Unsupervised Neural Networks for  Inverse Problems ",
    "url": "https://arxiv.org/abs/2309.12128",
    "authors": [
      "Nathan Buskulic",
      "Jalal Fadili",
      "Yvain Quéau"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.14080",
    "title": "Analysis and Detection of Pathological Voice using Glottal Source  Features",
    "abstract": " Comments: Copyright 2020 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses, in any current or future media, including reprinting/republishing this material for advertising or promotional purposes, creating new collective works, for resale or redistribution to servers or lists, or reuse of any copyrighted component of this work in other works ",
    "url": "https://arxiv.org/abs/2309.14080",
    "authors": [
      "Sudarsana Reddy Kadiri",
      "Paavo Alku"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2309.14107",
    "title": "Wav2vec-based Detection and Severity Level Classification of Dysarthria  from Speech",
    "abstract": " Comments: copyright 2023 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses, in any current or future media, including reprinting/republishing this material for advertising or promotional purposes, creating new collective works, for resale or redistribution to servers or lists, or reuse of any copyrighted component of this work in other works ",
    "url": "https://arxiv.org/abs/2309.14107",
    "authors": [
      "Farhad Javanmardi",
      "Saska Tirronen",
      "Manila Kodali",
      "Sudarsana Reddy Kadiri",
      "Paavo Alku"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2309.15714",
    "title": "Integrating LLM, EEG, and Eye-Tracking Biomarker Analysis for Word-Level  Neural State Classification in Semantic Inference Reading Comprehension",
    "abstract": " Title: Integrating LLM, EEG, and Eye-Tracking Biomarker Analysis for Word-Level  Neural State Classification in Semantic Inference Reading Comprehension ",
    "url": "https://arxiv.org/abs/2309.15714",
    "authors": [
      "Yuhong Zhang",
      "Qin Li",
      "Sujal Nahata",
      "Tasnia Jamal",
      "Shih-kuen Cheng",
      "Gert Cauwenberghs",
      "Tzyy-Ping Jung"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.01152",
    "title": "Large Language Model-Powered Smart Contract Vulnerability Detection: New  Perspectives",
    "abstract": " Comments: 10 pages ",
    "url": "https://arxiv.org/abs/2310.01152",
    "authors": [
      "Sihao Hu",
      "Tiansheng Huang",
      "Fatih İlhan",
      "Selim Furkan Tekin",
      "Ling Liu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.04633",
    "title": "Unbiased and Robust: External Attention-enhanced Graph Contrastive  Learning for Cross-domain Sequential Recommendation",
    "abstract": " Comments: 9 pages, 4 figures, accepted by ICDM 2023 (workshop-GML4Rec) ",
    "url": "https://arxiv.org/abs/2310.04633",
    "authors": [
      "Xinhua Wang",
      "Houping Yue",
      "Zizheng Wang",
      "Liancheng Xu",
      "Jinyu Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2310.04780",
    "title": "IPMix: Label-Preserving Data Augmentation Method for Training Robust  Classifiers",
    "abstract": " Title: IPMix: Label-Preserving Data Augmentation Method for Training Robust  Classifiers ",
    "url": "https://arxiv.org/abs/2310.04780",
    "authors": [
      "Zhenglin Huang",
      "Xianan Bao",
      "Na Zhang",
      "Qingqi Zhang",
      "Xiaomei Tu",
      "Biao Wu",
      "Xi Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.05136",
    "title": "InstructDET: Diversifying Referring Object Detection with Generalized  Instructions",
    "abstract": " Comments: 27 pages (include Appendix) Technical Report ",
    "url": "https://arxiv.org/abs/2310.05136",
    "authors": [
      "Ronghao Dang",
      "Jiangyan Feng",
      "Haodong Zhang",
      "Chongjian Ge",
      "Lin Song",
      "Lijun Gong",
      "Chengju Liu",
      "Qijun Chen",
      "Feng Zhu",
      "Rui Zhao",
      "Yibing Song"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.08008",
    "title": "Effects of Human Adversarial and Affable Samples on BERT  Generalizability",
    "abstract": " Comments: To appear at EMNLP Findings 2023 ",
    "url": "https://arxiv.org/abs/2310.08008",
    "authors": [
      "Aparna Elangovan",
      "Jiayuan He",
      "Yuan Li",
      "Karin Verspoor"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.08868",
    "title": "SeCoNet: A Heterosexual Contact Network Growth Model for Human  Papillomavirus Disease Simulation",
    "abstract": " Title: SeCoNet: A Heterosexual Contact Network Growth Model for Human  Papillomavirus Disease Simulation ",
    "url": "https://arxiv.org/abs/2310.08868",
    "authors": [
      "Weiyi Wang",
      "Mahendra Piraveenan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2310.09234",
    "title": "ClickPrompt: CTR Models are Strong Prompt Generators for Adapting  Language Models to CTR Prediction",
    "abstract": " Comments: under review ",
    "url": "https://arxiv.org/abs/2310.09234",
    "authors": [
      "Jianghao Lin",
      "Bo Chen",
      "Hangyu Wang",
      "Yunjia Xi",
      "Yanru Qu",
      "Xinyi Dai",
      "Kangning Zhang",
      "Ruiming Tang",
      "Yong Yu",
      "Weinan Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.09486",
    "title": "Mirage: Model-Agnostic Graph Distillation for Graph Classification",
    "abstract": " Comments: 14 pages, 14 figures ",
    "url": "https://arxiv.org/abs/2310.09486",
    "authors": [
      "Mridul Gupta",
      "Sahil Manchanda",
      "Hariprasad Kodamana",
      "Sayan Ranu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.09759",
    "title": "Prototype-oriented Unsupervised Change Detection for Disaster Management",
    "abstract": " Comments: 4page, 2 figures ",
    "url": "https://arxiv.org/abs/2310.09759",
    "authors": [
      "Youngtack Oh",
      "Minseok Seo",
      "Doyi Kim",
      "Junghoon Seo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.09903",
    "title": "Evaluation of feature selection performance for identification of best  effective technical indicators on stock market price prediction",
    "abstract": " Comments: 18 pages, 8 figures,4 tables,45 references ",
    "url": "https://arxiv.org/abs/2310.09903",
    "authors": [
      "Fatemeh Moodi",
      "Amir Jahangard-Rafsanjani"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Machine Learning (cs.LG)"
    ]
  }
]