[
  {
    "id": "arXiv:2305.06357",
    "title": "SWDPM: A Social Welfare-Optimized Data Pricing Mechanism",
    "abstract": "Data trading has been hindered by privacy concerns associated with user-owned data and the infinite reproducibility of data, making it challenging for data owners to retain exclusive rights over their data once it has been disclosed. Traditional data pricing models relied on uniform pricing or subscription-based models. However, with the development of Privacy-Preserving Computing techniques, the market can now protect the privacy and complete transactions using progressively disclosed information, which creates a technical foundation for generating greater social welfare through data usage. In this study, we propose a novel approach to modeling multi-round data trading with progressively disclosed information using a matchmaking-based Markov Decision Process (MDP) and introduce a Social Welfare-optimized Data Pricing Mechanism (SWDPM) to find optimal pricing strategies. To the best of our knowledge, this is the first study to model multi-round data trading with progressively disclosed information. Numerical experiments demonstrate that the SWDPM can increase social welfare 3 times by up to 54\\% in trading feasibility, 43\\% in trading efficiency, and 25\\% in trading fairness by encouraging better matching of demand and price negotiation among traders. ",
    "url": "https://arxiv.org/abs/2305.06357",
    "authors": [
      "Yi Yu",
      "Shengyue Yao",
      "Juanjuan Li",
      "Fei-Yue Wang",
      "Yilun Lin"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2305.06361",
    "title": "Efficient Training of Multi-task Neural Solver with Multi-armed Bandits",
    "abstract": "Efficiently training a multi-task neural solver for various combinatorial optimization problems (COPs) has been less studied so far. In this paper, we propose a general and efficient training paradigm based on multi-armed bandits to deliver a unified multi-task neural solver. To this end, we resort to the theoretical loss decomposition for multiple tasks under an encoder-decoder framework, which enables more efficient training via proper bandit task-sampling algorithms through an intra-task influence matrix. Our method achieves much higher overall performance with either limited training budgets or the same training epochs, compared to standard training schedules, which can be promising for advising efficient training of other multi-task large models. Additionally, the influence matrix can provide empirical evidence of some common practices in the area of learning to optimize, which in turn supports the validity of our approach. ",
    "url": "https://arxiv.org/abs/2305.06361",
    "authors": [
      "Chenguang Wang",
      "Tianshu Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06395",
    "title": "ACTC: Active Threshold Calibration for Cold-Start Knowledge Graph  Completion",
    "abstract": "Self-supervised knowledge-graph completion (KGC) relies on estimating a scoring model over (entity, relation, entity)-tuples, for example, by embedding an initial knowledge graph. Prediction quality can be improved by calibrating the scoring model, typically by adjusting the prediction thresholds using manually annotated examples. In this paper, we attempt for the first time cold-start calibration for KGC, where no annotated examples exist initially for calibration, and only a limited number of tuples can be selected for annotation. Our new method ACTC finds good per-relation thresholds efficiently based on a limited set of annotated tuples. Additionally to a few annotated tuples, ACTC also leverages unlabeled tuples by estimating their correctness with Logistic Regression or Gaussian Process classifiers. We also experiment with different methods for selecting candidate tuples for annotation: density-based and random selection. Experiments with five scoring models and an oracle annotator show an improvement of 7% points when using ACTC in the challenging setting with an annotation budget of only 10 tuples, and an average improvement of 4% points over different budgets. ",
    "url": "https://arxiv.org/abs/2305.06395",
    "authors": [
      "Anastasiia Sedova",
      "Benjamin Roth"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.06398",
    "title": "Towards Scalable Adaptive Learning with Graph Neural Networks and  Reinforcement Learning",
    "abstract": "Adaptive learning is an area of educational technology that consists in delivering personalized learning experiences to address the unique needs of each learner. An important subfield of adaptive learning is learning path personalization: it aims at designing systems that recommend sequences of educational activities to maximize students' learning outcomes. Many machine learning approaches have already demonstrated significant results in a variety of contexts related to learning path personalization. However, most of them were designed for very specific settings and are not very reusable. This is accentuated by the fact that they often rely on non-scalable models, which are unable to integrate new elements after being trained on a specific set of educational resources. In this paper, we introduce a flexible and scalable approach towards the problem of learning path personalization, which we formalize as a reinforcement learning problem. Our model is a sequential recommender system based on a graph neural network, which we evaluate on a population of simulated learners. Our results demonstrate that it can learn to make good recommendations in the small-data regime. ",
    "url": "https://arxiv.org/abs/2305.06398",
    "authors": [
      "Jean Vassoyan",
      "Jill-Jênn Vie",
      "Pirmin Lemberger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.06422",
    "title": "An Empirical Study on the Robustness of the Segment Anything Model (SAM)",
    "abstract": "The Segment Anything Model (SAM) is a foundation model for general image segmentation. Although it exhibits impressive performance predominantly on natural images, understanding its robustness against various image perturbations and domains is critical for real-world applications where such challenges frequently arise. In this study we conduct a comprehensive robustness investigation of SAM under diverse real-world conditions. Our experiments encompass a wide range of image perturbations. Our experimental results demonstrate that SAM's performance generally declines under perturbed images, with varying degrees of vulnerability across different perturbations. By customizing prompting techniques and leveraging domain knowledge based on the unique characteristics of each dataset, the model's resilience to these perturbations can be enhanced, addressing dataset-specific challenges. This work sheds light on the limitations and strengths of SAM in real-world applications, promoting the development of more robust and versatile image segmentation solutions. ",
    "url": "https://arxiv.org/abs/2305.06422",
    "authors": [
      "Yuqing Wang",
      "Yun Zhao",
      "Linda Petzold"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06426",
    "title": "Planning a Community Approach to Diabetes Care in Low- and Middle-Income  Countries Using Optimization",
    "abstract": "Diabetes is a global health priority, especially in low- and-middle-income countries, where over 50% of premature deaths are attributed to high blood glucose. Several studies have demonstrated the feasibility of using Community Health Worker (CHW) programs to provide affordable and culturally tailored solutions for early detection and management of diabetes. Yet, scalable models to design and implement CHW programs while accounting for screening, management, and patient enrollment decisions have not been proposed. We introduce an optimization framework to determine personalized CHW visits that maximize glycemic control at a community-level. Our framework explicitly models the trade-off between screening new patients and providing management visits to individuals who are already enrolled in treatment. We account for patients' motivational states, which affect their decisions to enroll or drop out of treatment and, therefore, the effectiveness of the intervention. We incorporate these decisions by modeling patients as utility-maximizing agents within a bi-level provider problem that we solve using approximate dynamic programming. By estimating patients' health and motivational states, our model builds visit plans that account for patients' tradeoffs when deciding to enroll in treatment, leading to reduced dropout rates and improved resource allocation. We apply our approach to generate CHW visit plans using operational data from a social enterprise serving low-income neighborhoods in urban areas of India. Through extensive simulation experiments, we find that our framework requires up to 73.4% less capacity than the best naive policy to achieve the same performance in terms of glycemic control. Our experiments also show that our solution algorithm can improve upon naive policies by up to 124.5% using the same CHW capacity. ",
    "url": "https://arxiv.org/abs/2305.06426",
    "authors": [
      "Katherine B. Adams",
      "Justin J. Boutilier",
      "Sarang Deo",
      "Yonatan Mintz"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2305.06429",
    "title": "Mispronunciation Detection of Basic Quranic Recitation Rules using Deep  Learning",
    "abstract": "In Islam, readers must apply a set of pronunciation rules called Tajweed rules to recite the Quran in the same way that the angel Jibrael taught the Prophet, Muhammad. The traditional process of learning the correct application of these rules requires a human who must have a license and great experience to detect mispronunciation. Due to the increasing number of Muslims around the world, the number of Tajweed teachers is not enough nowadays for daily recitation practice for every Muslim. Therefore, lots of work has been done for automatic Tajweed rules' mispronunciation detection to help readers recite Quran correctly in an easier way and shorter time than traditional learning ways. All previous works have three common problems. First, most of them focused on machine learning algorithms only. Second, they used private datasets with no benchmark to compare with. Third, they did not take into consideration the sequence of input data optimally, although the speech signal is time series. To overcome these problems, we proposed a solution that consists of Mel-Frequency Cepstral Coefficient (MFCC) features with Long Short-Term Memory (LSTM) neural networks which use the time series, to detect mispronunciation in Tajweed rules. In addition, our experiments were performed on a public dataset, the QDAT dataset, which contains more than 1500 voices of the correct and incorrect recitation of three Tajweed rules (Separate stretching , Tight Noon , and Hide ). To the best of our knowledge, the QDAT dataset has not been used by any research paper yet. We compared the performance of the proposed LSTM model with traditional machine learning algorithms used in SoTA. The LSTM model with time series showed clear superiority over traditional machine learning. The accuracy achieved by LSTM on the QDAT dataset was 96%, 95%, and 96% for the three rules (Separate stretching, Tight Noon, and Hide), respectively. ",
    "url": "https://arxiv.org/abs/2305.06429",
    "authors": [
      "Ahmad Al Harere",
      "Khloud Al Jallad"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2305.06434",
    "title": "Word Grounded Graph Convolutional Network",
    "abstract": "Graph Convolutional Networks (GCNs) have shown strong performance in learning text representations for various tasks such as text classification, due to its expressive power in modeling graph structure data (e.g., a literature citation network). Most existing GCNs are limited to deal with documents included in a pre-defined graph, i.e., it cannot be generalized to out-of-graph documents. To address this issue, we propose to transform the document graph into a word graph, to decouple data samples (i.e., documents in training and test sets) and a GCN model by using a document-independent graph. Such word-level GCN could therefore naturally inference out-of-graph documents in an inductive way. The proposed Word-level Graph (WGraph) can not only implicitly learning word presentation with commonly-used word co-occurrences in corpora, but also incorporate extra global semantic dependency derived from inter-document relationships (e.g., literature citations). An inductive Word-grounded Graph Convolutional Network (WGCN) is proposed to learn word and document representations based on WGraph in a supervised manner. Experiments on text classification with and without citation networks evidence that the proposed WGCN model outperforms existing methods in terms of effectiveness and efficiency. ",
    "url": "https://arxiv.org/abs/2305.06434",
    "authors": [
      "Zhibin Lu",
      "Qianqian Xie",
      "Benyou Wang",
      "Jian-yun Nie"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06437",
    "title": "Self-Supervised Video Representation Learning via Latent Time Navigation",
    "abstract": "Self-supervised video representation learning aimed at maximizing similarity between different temporal segments of one video, in order to enforce feature persistence over time. This leads to loss of pertinent information related to temporal relationships, rendering actions such as `enter' and `leave' to be indistinguishable. To mitigate this limitation, we propose Latent Time Navigation (LTN), a time-parameterized contrastive learning strategy that is streamlined to capture fine-grained motions. Specifically, we maximize the representation similarity between different video segments from one video, while maintaining their representations time-aware along a subspace of the latent representation code including an orthogonal basis to represent temporal changes. Our extensive experimental analysis suggests that learning video representations by LTN consistently improves performance of action classification in fine-grained and human-oriented tasks (e.g., on Toyota Smarthome dataset). In addition, we demonstrate that our proposed model, when pre-trained on Kinetics-400, generalizes well onto the unseen real world video benchmark datasets UCF101 and HMDB51, achieving state-of-the-art performance in action recognition. ",
    "url": "https://arxiv.org/abs/2305.06437",
    "authors": [
      "Di Yang",
      "Yaohui Wang",
      "Quan Kong",
      "Antitza Dantcheva",
      "Lorenzo Garattoni",
      "Gianpiero Francesca",
      "Francois Bremond"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.06439",
    "title": "Measuring the Runtime Performance of Code Produced with GitHub Copilot",
    "abstract": "GitHub Copilot is an artificially intelligent programming assistant used by many developers. While a few studies have evaluated the security risks of using Copilot, there has not been any study to show if it aids developers in producing code with better runtime performance. We evaluate the runtime performance of code produced when developers use GitHub Copilot versus when they do not. To this end, we conducted a user study with 32 participants where each participant solved two C++ programming problems, one with Copilot and the other without it and measured the runtime performance of the participants' solutions on our test data. Our results suggest that using Copilot may produce code with a significantly slower runtime performance. ",
    "url": "https://arxiv.org/abs/2305.06439",
    "authors": [
      "Daniel Erhabor",
      "Sreeharsha Udayashankar",
      "Meiyappan Nagappan",
      "Samer Al-Kiswany"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2305.06447",
    "title": "Dynamic Graph Representation Learning for Depression Screening with  Transformer",
    "abstract": "Early detection of mental disorder is crucial as it enables prompt intervention and treatment, which can greatly improve outcomes for individuals suffering from debilitating mental affliction. The recent proliferation of mental health discussions on social media platforms presents research opportunities to investigate mental health and potentially detect instances of mental illness. However, existing depression detection methods are constrained due to two major limitations: (1) the reliance on feature engineering and (2) the lack of consideration for time-varying factors. Specifically, these methods require extensive feature engineering and domain knowledge, which heavily rely on the amount, quality, and type of user-generated content. Moreover, these methods ignore the important impact of time-varying factors on depression detection, such as the dynamics of linguistic patterns and interpersonal interactive behaviors over time on social media (e.g., replies, mentions, and quote-tweets). To tackle these limitations, we propose an early depression detection framework, ContrastEgo treats each user as a dynamic time-evolving attributed graph (ego-network) and leverages supervised contrastive learning to maximize the agreement of users' representations at different scales while minimizing the agreement of users' representations to differentiate between depressed and control groups. ContrastEgo embraces four modules, (1) constructing users' heterogeneous interactive graphs, (2) extracting the representations of users' interaction snapshots using graph neural networks, (3) modeling the sequences of snapshots using attention mechanism, and (4) depression detection using contrastive learning. Extensive experiments on Twitter data demonstrate that ContrastEgo significantly outperforms the state-of-the-art methods in terms of all the effectiveness metrics in various experimental settings. ",
    "url": "https://arxiv.org/abs/2305.06447",
    "authors": [
      "Ai-Te Kuo",
      "Haiquan Chen",
      "Yu-Hsuan Kuo",
      "Wei-Shinn Ku"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.06474",
    "title": "Do LLMs Understand User Preferences? Evaluating LLMs On User Rating  Prediction",
    "abstract": "Large Language Models (LLMs) have demonstrated exceptional capabilities in generalizing to new tasks in a zero-shot or few-shot manner. However, the extent to which LLMs can comprehend user preferences based on their previous behavior remains an emerging and still unclear research question. Traditionally, Collaborative Filtering (CF) has been the most effective method for these tasks, predominantly relying on the extensive volume of rating data. In contrast, LLMs typically demand considerably less data while maintaining an exhaustive world knowledge about each item, such as movies or products. In this paper, we conduct a thorough examination of both CF and LLMs within the classic task of user rating prediction, which involves predicting a user's rating for a candidate item based on their past ratings. We investigate various LLMs in different sizes, ranging from 250M to 540B parameters and evaluate their performance in zero-shot, few-shot, and fine-tuning scenarios. We conduct comprehensive analysis to compare between LLMs and strong CF methods, and find that zero-shot LLMs lag behind traditional recommender models that have the access to user interaction data, indicating the importance of user interaction data. However, through fine-tuning, LLMs achieve comparable or even better performance with only a small fraction of the training data, demonstrating their potential through data efficiency. ",
    "url": "https://arxiv.org/abs/2305.06474",
    "authors": [
      "Wang-Cheng Kang",
      "Jianmo Ni",
      "Nikhil Mehta",
      "Maheswaran Sathiamoorthy",
      "Lichan Hong",
      "Ed Chi",
      "Derek Zhiyuan Cheng"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06477",
    "title": "SENDD: Sparse Efficient Neural Depth and Deformation for Tissue Tracking",
    "abstract": "Deformable tracking and real-time estimation of 3D tissue motion is essential to enable automation and image guidance applications in robotically assisted surgery. Our model, Sparse Efficient Neural Depth and Deformation (SENDD), extends prior 2D tracking work to estimate flow in 3D space. SENDD introduces novel contributions of learned detection, and sparse per-point depth and 3D flow estimation, all with less than half a million parameters. SENDD does this by using graph neural networks of sparse keypoint matches to estimate both depth and 3D flow. We quantify and benchmark SENDD on a comprehensively labelled tissue dataset, and compare it to an equivalent 2D flow model. SENDD performs comparably while enabling applications that 2D flow cannot. SENDD can track points and estimate depth at 10fps on an NVIDIA RTX 4000 for 1280 tracked (query) points and its cost scales linearly with an increasing/decreasing number of points. SENDD enables multiple downstream applications that require 3D motion estimation. ",
    "url": "https://arxiv.org/abs/2305.06477",
    "authors": [
      "Adam Schmidt",
      "Omid Mohareri",
      "Simon DiMaio",
      "Septimiu E. Salcudean"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06480",
    "title": "ST-GIN: An Uncertainty Quantification Approach in Traffic Data  Imputation with Spatio-temporal Graph Attention and Bidirectional Recurrent  United Neural Networks",
    "abstract": "Traffic data serves as a fundamental component in both research and applications within intelligent transportation systems. However, real-world transportation data, collected from loop detectors or similar sources, often contain missing values (MVs), which can adversely impact associated applications and research. Instead of discarding this incomplete data, researchers have sought to recover these missing values through numerical statistics, tensor decomposition, and deep learning techniques. In this paper, we propose an innovative deep-learning approach for imputing missing data. A graph attention architecture is employed to capture the spatial correlations present in traffic data, while a bidirectional neural network is utilized to learn temporal information. Experimental results indicate that our proposed method outperforms all other benchmark techniques, thus demonstrating its effectiveness. ",
    "url": "https://arxiv.org/abs/2305.06480",
    "authors": [
      "Zepu Wang",
      "Dingyi Zhuang",
      "Yankai Li",
      "Jinhua Zhao",
      "Peng Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06485",
    "title": "Multimodal Contextualized Plan Prediction for Embodied Task Completion",
    "abstract": "Task planning is an important component of traditional robotics systems enabling robots to compose fine grained skills to perform more complex tasks. Recent work building systems for translating natural language to executable actions for task completion in simulated embodied agents is focused on directly predicting low level action sequences that would be expected to be directly executable by a physical robot. In this work, we instead focus on predicting a higher level plan representation for one such embodied task completion dataset - TEACh, under the assumption that techniques for high-level plan prediction from natural language are expected to be more transferable to physical robot systems. We demonstrate that better plans can be predicted using multimodal context, and that plan prediction and plan execution modules are likely dependent on each other and hence it may not be ideal to fully decouple them. Further, we benchmark execution of oracle plans to quantify the scope for improvement in plan prediction models. ",
    "url": "https://arxiv.org/abs/2305.06485",
    "authors": [
      "Mert İnan",
      "Aishwarya Padmakumar",
      "Spandana Gella",
      "Patrick Lange",
      "Dilek Hakkani-Tur"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2305.06492",
    "title": "Treasure What You Have: Exploiting Similarity in Deep Neural Networks  for Efficient Video Processing",
    "abstract": "Deep learning has enabled various Internet of Things (IoT) applications. Still, designing models with high accuracy and computational efficiency remains a significant challenge, especially in real-time video processing applications. Such applications exhibit high inter- and intra-frame redundancy, allowing further improvement. This paper proposes a similarity-aware training methodology that exploits data redundancy in video frames for efficient processing. Our approach introduces a per-layer regularization that enhances computation reuse by increasing the similarity of weights during training. We validate our methodology on two critical real-time applications, lane detection and scene parsing. We observe an average compression ratio of approximately 50% and a speedup of \\sim 1.5x for different models while maintaining the same accuracy. ",
    "url": "https://arxiv.org/abs/2305.06492",
    "authors": [
      "Hadjer Benmeziane",
      "Halima Bouzidi",
      "Hamza Ouarnoughi",
      "Ozcan Ozturk",
      "Smail Niar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06505",
    "title": "A tight upper bound on the number of non-zero weights of a constacyclic  code",
    "abstract": "For a simple-root $\\lambda$-constacyclic code $\\mathcal{C}$ over $\\mathbb{F}_q$, let $\\langle\\rho\\rangle$ and $\\langle\\rho,M\\rangle$ be the subgroups of the automorphism group of $\\mathcal{C}$ generated by the cyclic shift $\\rho$, and by the cyclic shift $\\rho$ and the scalar multiplication $M$, respectively. Let $N_G(\\mathcal{C}^\\ast)$ be the number of orbits of a subgroup $G$ of automorphism group of $\\mathcal{C}$ acting on $\\mathcal{C}^\\ast=\\mathcal{C}\\backslash\\{0\\}$. In this paper, we establish explicit formulas for $N_{\\langle\\rho\\rangle}(\\mathcal{C}^\\ast)$ and $N_{\\langle\\rho,M\\rangle}(\\mathcal{C}^\\ast)$. Consequently, we derive a upper bound on the number of nonzero weights of $\\mathcal{C}$. We present some irreducible and reducible $\\lambda$-constacyclic codes, which show that the upper bound is tight. A sufficient condition to guarantee $N_{\\langle\\rho\\rangle}(\\mathcal{C}^\\ast)=N_{\\langle\\rho,M\\rangle}(\\mathcal{C}^\\ast)$ is presented. ",
    "url": "https://arxiv.org/abs/2305.06505",
    "authors": [
      "Hanglong Zhang",
      "Xiwang Cao"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2305.06509",
    "title": "PriGen: Towards Automated Translation of Android Applications' Code to  Privacy Captions",
    "abstract": "Mobile applications are required to give privacy notices to the users when they collect or share personal information. Creating consistent and concise privacy notices can be a challenging task for developers. Previous work has attempted to help developers create privacy notices through a questionnaire or predefined templates. In this paper, we propose a novel approach and a framework, called PriGen, that extends these prior work. PriGen uses static analysis to identify Android applications' code segments which process sensitive information (i.e. permission-requiring code segments) and then leverages a Neural Machine Translation model to translate them into privacy captions. We present the initial evaluation of our translation task for $\\sim$300,000 code segments. ",
    "url": "https://arxiv.org/abs/2305.06509",
    "authors": [
      "Vijayanta Jain",
      "Sanonda Datta Gupta",
      "Sepideh Ghanavati",
      "Sai Teja Peddinti"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2305.06518",
    "title": "Demand Privacy in Hotplug Caching Systems",
    "abstract": "Coded caching, introduced by Maddah-Ali and Niesen (MAN), is a model where a server broadcasts multicast packets to users with a local cache that is leveraged so as to reduce the peak network communication load. The original MAN model does not consider missing demands (i.e., some users may not request a file) or privacy issues (i.e., decoding the multicast packets may expose the users' demands). The former issue was captured by the hotplug model with offline users, where the server starts sending multicast packets after having received a certain number of file requests. The latter issue was addressed by devoting part of the cache to store privacy keys to help users decode their requested file while remaining completely ignorant about the demands of the remaining users. This paper investigates the problem of private demands against colluding users in the hotplug model with offline users. Two achievable schemes are proposed based on Maximum Distance Separable (MDS) codes. They achieve lower subpacketization, and lower load in the small memory regime compared to baseline schemes that trivially include demand privacy or offline users in known schemes. ",
    "url": "https://arxiv.org/abs/2305.06518",
    "authors": [
      "Yinbin Ma",
      "Daniela Tuninetti"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2305.06522",
    "title": "Randomized Smoothing with Masked Inference for Adversarially Robust Text  Classifications",
    "abstract": "Large-scale pre-trained language models have shown outstanding performance in a variety of NLP tasks. However, they are also known to be significantly brittle against specifically crafted adversarial examples, leading to increasing interest in probing the adversarial robustness of NLP systems. We introduce RSMI, a novel two-stage framework that combines randomized smoothing (RS) with masked inference (MI) to improve the adversarial robustness of NLP systems. RS transforms a classifier into a smoothed classifier to obtain robust representations, whereas MI forces a model to exploit the surrounding context of a masked token in an input sequence. RSMI improves adversarial robustness by 2 to 3 times over existing state-of-the-art methods on benchmark datasets. We also perform in-depth qualitative analysis to validate the effectiveness of the different stages of RSMI and probe the impact of its components through extensive ablations. By empirically proving the stability of RSMI, we put it forward as a practical method to robustly train large-scale NLP models. Our code and datasets are available at https://github.com/Han8931/rsmi_nlp ",
    "url": "https://arxiv.org/abs/2305.06522",
    "authors": [
      "Han Cheol Moon",
      "Shafiq Joty",
      "Ruochen Zhao",
      "Megh Thakkar",
      "Xu Chi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.06523",
    "title": "A fast topological approach for predicting anomalies in time-varying  graphs",
    "abstract": "Large time-varying graphs are increasingly common in financial, social and biological settings. Feature extraction that efficiently encodes the complex structure of sparse, multi-layered, dynamic graphs presents computational and methodological challenges. In the past decade, a persistence diagram (PD) from topological data analysis (TDA) has become a popular descriptor of shape of data with a well-defined distance between points. However, applications of TDA to graphs, where there is no intrinsic concept of distance between the nodes, remain largely unexplored. This paper addresses this gap in the literature by introducing a computationally efficient framework to extract shape information from graph data. Our framework has two main steps: first, we compute a PD using the so-called lower-star filtration which utilizes quantitative node attributes, and then vectorize it by averaging the associated Betti function over successive scale values on a one-dimensional grid. Our approach avoids embedding a graph into a metric space and has stability properties against input noise. In simulation studies, we show that the proposed vector summary leads to improved change point detection rate in time-varying graphs. In a real data application, our approach provides up to 22% gain in anomalous price prediction for the Ethereum cryptocurrency transaction networks. ",
    "url": "https://arxiv.org/abs/2305.06523",
    "authors": [
      "Umar Islambekov",
      "Hasani Pathirana",
      "Omid Khormali",
      "Cuneyt Akcora",
      "Ekaterina Smirnova"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06531",
    "title": "Semantic Random Walk for Graph Representation Learning in Attributed  Graphs",
    "abstract": "In this study, we focus on the graph representation learning (a.k.a. network embedding) in attributed graphs. Different from existing embedding methods that treat the incorporation of graph structure and semantic as the simple combination of two optimization objectives, we propose a novel semantic graph representation (SGR) method to formulate the joint optimization of the two heterogeneous sources into a common high-order proximity based framework. Concretely, we first construct an auxiliary weighted graph, where the complex homogeneous and heterogeneous relations among nodes and attributes in the original graph are comprehensively encoded. Conventional embedding methods that consider high-order topology proximities can then be easily applied to the newly constructed graph to learn the representations of both node and attribute while capturing the nonlinear high-order intrinsic correlation inside or among graph structure and semantic. The learned attribute embeddings can also effectively support some semantic-oriented inference tasks (e.g., semantic community detection), helping to reveal the graph's deep semantic. The effectiveness of SGR is further verified on a series of real graphs, where it achieves impressive performance over other baselines. ",
    "url": "https://arxiv.org/abs/2305.06531",
    "authors": [
      "Meng Qin"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06540",
    "title": "Inter-frame Accelerate Attack against Video Interpolation Models",
    "abstract": "Deep learning based video frame interpolation (VIF) method, aiming to synthesis the intermediate frames to enhance video quality, have been highly developed in the past few years. This paper investigates the adversarial robustness of VIF models. We apply adversarial attacks to VIF models and find that the VIF models are very vulnerable to adversarial examples. To improve attack efficiency, we suggest to make full use of the property of video frame interpolation task. The intuition is that the gap between adjacent frames would be small, leading to the corresponding adversarial perturbations being similar as well. Then we propose a novel attack method named Inter-frame Accelerate Attack (IAA) that initializes the perturbation as the perturbation for the previous adjacent frame and reduces the number of attack iterations. It is shown that our method can improve attack efficiency greatly while achieving comparable attack performance with traditional methods. Besides, we also extend our method to video recognition models which are higher level vision tasks and achieves great attack efficiency. ",
    "url": "https://arxiv.org/abs/2305.06540",
    "authors": [
      "Junpei Liao",
      "Zhikai Chen",
      "Liang Yi",
      "Wenyuan Yang",
      "Baoyuan Wu",
      "Xiaochun Cao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06543",
    "title": "QoE-based Semantic-Aware Resource Allocation for Multi-Task Networks",
    "abstract": "In semantic communications, only task-relevant information is transmitted, yielding significant performance gains over conventional communications. To satisfy user requirements for different tasks, we investigate the semantic-aware resource allocation in a multi-cell network for serving multiple tasks in this paper. First, semantic entropy is defined and quantified to measure the semantic information for different tasks. Then, we develop a novel quality-of-experience (QoE) model to formulate the semantic-aware resource allocation problem in terms of semantic compression, channel assignment, and transmit power allocation. To solve the formulated problem, we first decouple it into two subproblems. The first one is to optimize semantic compression with given channel assignment and power allocation results, which is solved by a developed deep Q-network (DQN) based method. The second one is to optimize the channel assignment and transmit power, which is modeled as a many-to-one matching game and solved by a proposed low-complexity matching algorithm. Simulation results validate the effectiveness and superiority of the proposed semantic-aware resource allocation method, as well as its compatibility with conventional and semantic communications. ",
    "url": "https://arxiv.org/abs/2305.06543",
    "authors": [
      "Lei Yan",
      "Zhijin Qin",
      "Rui Zhang",
      "Yongzhao Li",
      "Xiaoming Tao",
      "Geoffrey Ye Li"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.06547",
    "title": "Neural Lyapunov Control for Discrete-Time Systems",
    "abstract": "While ensuring stability for linear systems is well understood, it remains a major challenge for systems with nonlinear dynamics. A general approach in such cases is to leverage Lyapunov stability theory to compute a combination of a Lyapunov control function and an associated control policy. However, finding Lyapunov functions for general nonlinear systems is a challenging task. To address this challenge, several methods have been recently proposed that represent Lyapunov functions using neural networks. However, such approaches have been designed exclusively for continuous-time systems. We propose the first approach for learning neural Lyapunov control in discrete-time systems. Three key ingredients enable us to effectively learn provably stable control policies. The first is a novel mixed-integer linear programming approach for verifying the stability conditions in discrete-time systems. The second is a novel approach for computing sub-level sets which characterize the region of attraction. Finally, we rely on a heuristic gradient-based approach for quickly finding counterexamples to significantly speed up Lyapunov function learning. Our experiments on four standard benchmarks demonstrate that our approach significantly outperforms state-of-the-art baselines. For example, on the path tracking benchmark, we outperform recent neural Lyapunov control baselines by an order of magnitude in both running time and the size of the region of attraction, and on two of the four benchmarks (cartpole and PVTOL), ours is the first automated approach to return a provably stable controller. ",
    "url": "https://arxiv.org/abs/2305.06547",
    "authors": [
      "Junlin Wu",
      "Andrew Clark",
      "Yiannis Kantaros",
      "Yevgeniy Vorobeychik"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.06549",
    "title": "Prevention of shoulder-surfing attacks using shifting condition using  digraph substitution rules",
    "abstract": "Graphical passwords are implemented as an alternative scheme to replace alphanumeric passwords to help users to memorize their password. However, most of the graphical password systems are vulnerable to shoulder-surfing attack due to the usage of the visual interface. In this research, a method that uses shifting condition with digraph substitution rules is proposed to address shoulder-surfing attack problem. The proposed algorithm uses both password images and decoy images throughout the user authentication procedure to confuse adversaries from obtaining the password images via direct observation or watching from a recorded session. The pass-images generated by this suggested algorithm are random and can only be generated if the algorithm is fully understood. As a result, adversaries will have no clue to obtain the right password images to log in. A user study was undertaken to assess the proposed method's effectiveness to avoid shoulder-surfing attacks. The results of the user study indicate that the proposed approach can withstand shoulder-surfing attacks (both direct observation and video recording method).The proposed method was tested and the results showed that it is able to resist shoulder-surfing and frequency of occurrence analysis attacks. Moreover, the experience gained in this research can be pervaded the gap on the realm of knowledge of the graphical password. ",
    "url": "https://arxiv.org/abs/2305.06549",
    "authors": [
      "Amanul Islam",
      "Fazidah Othman",
      "Nazmus Sakib",
      "Hafiz Md. Hasan Babu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2305.06553",
    "title": "WeLayout: WeChat Layout Analysis System for the ICDAR 2023 Competition  on Robust Layout Segmentation in Corporate Documents",
    "abstract": "In this paper, we introduce WeLayout, a novel system for segmenting the layout of corporate documents, which stands for WeChat Layout Analysis System. Our approach utilizes a sophisticated ensemble of DINO and YOLO models, specifically developed for the ICDAR 2023 Competition on Robust Layout Segmentation. Our method significantly surpasses the baseline, securing a top position on the leaderboard with a mAP of 70.0. To achieve this performance, we concentrated on enhancing various aspects of the task, such as dataset augmentation, model architecture, bounding box refinement, and model ensemble techniques. Additionally, we trained the data separately for each document category to ensure a higher mean submission score. We also developed an algorithm for cell matching to further improve our performance. To identify the optimal weights and IoU thresholds for our model ensemble, we employed a Bayesian optimization algorithm called the Tree-Structured Parzen Estimator. Our approach effectively demonstrates the benefits of combining query-based and anchor-free models for achieving robust layout segmentation in corporate documents. ",
    "url": "https://arxiv.org/abs/2305.06553",
    "authors": [
      "Mingliang Zhang",
      "Zhen Cao",
      "Juntao Liu",
      "Liqiang Niu",
      "Fandong Meng",
      "Jie Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06568",
    "title": "Convolutional Neural Networks Rarely Learn Shape for Semantic  Segmentation",
    "abstract": "Shape learning, or the ability to leverage shape information, could be a desirable property of convolutional neural networks (CNNs) when target objects have specific shapes. While some research on the topic is emerging, there is no systematic study to conclusively determine whether and under what circumstances CNNs learn shape. Here, we present such a study in the context of segmentation networks where shapes are particularly important. We define shape and propose a new behavioral metric to measure the extent to which a CNN utilizes shape information. We then execute a set of experiments with synthetic and real-world data to progressively uncover under which circumstances CNNs learn shape and what can be done to encourage such behavior. We conclude that (i) CNNs do not learn shape in typical settings but rather rely on other features available to identify the objects of interest, (ii) CNNs can learn shape, but only if the shape is the only feature available to identify the object, (iii) sufficiently large receptive field size relative to the size of target objects is necessary for shape learning; (iv) a limited set of augmentations can encourage shape learning; (v) learning shape is indeed useful in the presence of out-of-distribution data. ",
    "url": "https://arxiv.org/abs/2305.06568",
    "authors": [
      "Yixin Zhang",
      "Maciej A. Mazurowski"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06574",
    "title": "A Fused Gromov-Wasserstein Framework for Unsupervised Knowledge Graph  Entity Alignment",
    "abstract": "Entity alignment is the task of identifying corresponding entities across different knowledge graphs (KGs). Although recent embedding-based entity alignment methods have shown significant advancements, they still struggle to fully utilize KG structural information. In this paper, we introduce FGWEA, an unsupervised entity alignment framework that leverages the Fused Gromov-Wasserstein (FGW) distance, allowing for a comprehensive comparison of entity semantics and KG structures within a joint optimization framework. To address the computational challenges associated with optimizing FGW, we devise a three-stage progressive optimization algorithm. It starts with a basic semantic embedding matching, proceeds to approximate cross-KG structural and relational similarity matching based on iterative updates of high-confidence entity links, and ultimately culminates in a global structural comparison between KGs. We perform extensive experiments on four entity alignment datasets covering 14 distinct KGs across five languages. Without any supervision or hyper-parameter tuning, FGWEA surpasses 21 competitive baselines, including cutting-edge supervised entity alignment methods. Our code is available at https://github.com/squareRoot3/FusedGW-Entity-Alignment. ",
    "url": "https://arxiv.org/abs/2305.06574",
    "authors": [
      "Jianheng Tang",
      "Kangfei Zhao",
      "Jia Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.06576",
    "title": "Clustering of Time-Varying Graphs Based on Temporal Label Smoothness",
    "abstract": "We propose a node clustering method for time-varying graphs based on the assumption that the cluster labels are changed smoothly over time. Clustering is one of the fundamental tasks in many science and engineering fields including signal processing, machine learning, and data mining. Although most existing studies focus on the clustering of nodes in static graphs, we often encounter time-varying graphs for time-series data, e.g., social networks, brain functional connectivity, and point clouds. In this paper, we formulate a node clustering of time-varying graphs as an optimization problem based on spectral clustering, with a smoothness constraint of the node labels. We solve the problem with a primal-dual splitting algorithm. Experiments on synthetic and real-world time-varying graphs are performed to validate the effectiveness of the proposed approach. ",
    "url": "https://arxiv.org/abs/2305.06576",
    "authors": [
      "Katsuki Fukumoto",
      "Koki Yamada",
      "Yuichi Tanaka",
      "Hoi-To Wai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.06587",
    "title": "How Expressive are Spectral-Temporal Graph Neural Networks for Time  Series Forecasting?",
    "abstract": "Spectral-temporal graph neural network is a promising abstraction underlying most time series forecasting models that are based on graph neural networks (GNNs). However, more is needed to know about the underpinnings of this branch of methods. In this paper, we establish a theoretical framework that unravels the expressive power of spectral-temporal GNNs. Our results show that linear spectral-temporal GNNs are universal under mild assumptions, and their expressive power is bounded by our extended first-order Weisfeiler-Leman algorithm on discrete-time dynamic graphs. To make our findings useful in practice on valid instantiations, we discuss related constraints in detail and outline a theoretical blueprint for designing spatial and temporal modules in spectral domains. Building on these insights and to demonstrate how powerful spectral-temporal GNNs are based on our framework, we propose a simple instantiation named Temporal Graph GegenConv (TGC), which significantly outperforms most existing models with only linear components and shows better model efficiency. ",
    "url": "https://arxiv.org/abs/2305.06587",
    "authors": [
      "Ming Jin",
      "Guangsi Shi",
      "Yuan-Fang Li",
      "Qingsong Wen",
      "Bo Xiong",
      "Tian Zhou",
      "Shirui Pan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.06588",
    "title": "HAHE: Hierarchical Attention for Hyper-Relational Knowledge Graphs in  Global and Local Level",
    "abstract": "Link Prediction on Hyper-relational Knowledge Graphs (HKG) is a worthwhile endeavor. HKG consists of hyper-relational facts (H-Facts), composed of a main triple and several auxiliary attribute-value qualifiers, which can effectively represent factually comprehensive information. The internal structure of HKG can be represented as a hypergraph-based representation globally and a semantic sequence-based representation locally. However, existing research seldom simultaneously models the graphical and sequential structure of HKGs, limiting HKGs' representation. To overcome this limitation, we propose a novel Hierarchical Attention model for HKG Embedding (HAHE), including global-level and local-level attention. The global-level attention can model the graphical structure of HKG using hypergraph dual-attention layers, while the local-level attention can learn the sequential structure inside H-Facts via heterogeneous self-attention layers. Experiment results indicate that HAHE achieves state-of-the-art performance in link prediction tasks on HKG standard datasets. In addition, HAHE addresses the issue of HKG multi-position prediction for the first time, increasing the applicability of the HKG link prediction task. Our code is publicly available. ",
    "url": "https://arxiv.org/abs/2305.06588",
    "authors": [
      "Haoran Luo",
      "Haihong E",
      "Yuhao Yang",
      "Yikai Guo",
      "Mingzhi Sun",
      "Tianyu Yao",
      "Zichen Tang",
      "Kaiyang Wan",
      "Meina Song",
      "Wei Lin"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06590",
    "title": "FactKG: Fact Verification via Reasoning on Knowledge Graphs",
    "abstract": "In real world applications, knowledge graphs (KG) are widely used in various domains (e.g. medical applications and dialogue agents). However, for fact verification, KGs have not been adequately utilized as a knowledge source. KGs can be a valuable knowledge source in fact verification due to their reliability and broad applicability. A KG consists of nodes and edges which makes it clear how concepts are linked together, allowing machines to reason over chains of topics. However, there are many challenges in understanding how these machine-readable concepts map to information in text. To enable the community to better use KGs, we introduce a new dataset, FactKG: Fact Verification via Reasoning on Knowledge Graphs. It consists of 108k natural language claims with five types of reasoning: One-hop, Conjunction, Existence, Multi-hop, and Negation. Furthermore, FactKG contains various linguistic patterns, including colloquial style claims as well as written style claims to increase practicality. Lastly, we develop a baseline approach and analyze FactKG over these reasoning types. We believe FactKG can advance both reliability and practicality in KG-based fact verification. ",
    "url": "https://arxiv.org/abs/2305.06590",
    "authors": [
      "Jiho Kim",
      "Sungjin Park",
      "Yeonsu Kwon",
      "Yohan Jo",
      "James Thorne",
      "Edward Choi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.06599",
    "title": "Enabling Programming Thinking in Large Language Models Toward Code  Generation",
    "abstract": "Large Language Models (LLMs) (e.g., ChatGPT) have shown impressive performance in code generation. A large-scale study released that writing programs requires programming thinking, i.e., analyzing and implementing requirements in programming logic (e.g., sequence, branch, loop). Existing studies use LLMs to generate programs from requirements directly and do not explicitly introduce the programming thinking. This paper explores how to unlock the programming thinking of LLMs in code generation and proposes an approach named TiP. Our idea is to decompose code generation into two steps and progressively lead LLMs to analyze&implement requirements in programming logic. Specifically, TiP first generates a code sketch, which provides a high-level solving process using programming logic but omits implementation details (e.g., APIs). Then, TiP implements the sketch into a program using specific programming languages. We conduct extensive experiments on three public benchmarks (i.e., HumanEval, MBPP, and MBCPP). (1) TiP outperforms the state-of-the-art baseline - ChatGPT by up to 17.5% in Pass@1, 11.02% in Pass@3, and 9.84% in Pass@5. (2) Human evaluation shows that TiP outperforms ChatGPT in three aspects (i.e., correctness, code quality, and maintainability). (3) TiP is effective for different LLMs. (4) We explore multiple choices (e.g., chain-of-thought) for the code sketch and validate the superiority of our design. (5) We discuss the complementarity between TiP and post-processing approaches (e.g., CodeT). ",
    "url": "https://arxiv.org/abs/2305.06599",
    "authors": [
      "Jia Li",
      "Ge Li",
      "Yongmin Li",
      "Zhi Jin"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.06614",
    "title": "Robust stability of moving horizon estimation for continuous-time  systems",
    "abstract": "We consider a moving horizon estimation (MHE) scheme involving a discounted least squares objective for general nonlinear continuous-time systems. Provided that the system is detectable (incrementally integral input/output-to-state stable, i-iIOSS), we show that there exists a sufficiently long estimation horizon that guarantees robust global exponential stability of the estimation error in an $L^2$-to-$L^\\infty$ sense. In addition, we show that i-iIOSS Lyapunov functions can be efficiently constructed by verifying certain linear matrix inequality conditions. In combination, we propose a flexible Lyapunov-based MHE framework in continuous time, which particularly offers more tuning possibilities than its discrete-time analog, and provide sufficient conditions for stability that can be easily verified in practice. Our results are illustrated by a numerical example. ",
    "url": "https://arxiv.org/abs/2305.06614",
    "authors": [
      "Julian D. Schiller",
      "Matthias A. Müller"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.06622",
    "title": "PerFedRec++: Enhancing Personalized Federated Recommendation with  Self-Supervised Pre-Training",
    "abstract": "Federated recommendation systems employ federated learning techniques to safeguard user privacy by transmitting model parameters instead of raw user data between user devices and the central server. Nevertheless, the current federated recommender system faces challenges such as heterogeneity and personalization, model performance degradation, and communication bottleneck. Previous studies have attempted to address these issues, but none have been able to solve them simultaneously. In this paper, we propose a novel framework, named PerFedRec++, to enhance the personalized federated recommendation with self-supervised pre-training. Specifically, we utilize the privacy-preserving mechanism of federated recommender systems to generate two augmented graph views, which are used as contrastive tasks in self-supervised graph learning to pre-train the model. Pre-training enhances the performance of federated models by improving the uniformity of representation learning. Also, by providing a better initial state for federated training, pre-training makes the overall training converge faster, thus alleviating the heavy communication burden. We then construct a collaborative graph to learn the client representation through a federated graph neural network. Based on these learned representations, we cluster users into different user groups and learn personalized models for each cluster. Each user learns a personalized model by combining the global federated model, the cluster-level federated model, and its own fine-tuned local model. Experiments on three real-world datasets show that our proposed method achieves superior performance over existing methods. ",
    "url": "https://arxiv.org/abs/2305.06622",
    "authors": [
      "Sichun Luo",
      "Yuanzhang Xiao",
      "Xinyi Zhang",
      "Yang Liu",
      "Wenbo Ding",
      "Linqi Song"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2305.06630",
    "title": "Predictive change point detection for heterogeneous data",
    "abstract": "A change point detection (CPD) framework assisted by a predictive machine learning model called ''Predict and Compare'' is introduced and characterised in relation to other state-of-the-art online CPD routines which it outperforms in terms of false positive rate and out-of-control average run length. The method's focus is on improving standard methods from sequential analysis such as the CUSUM rule in terms of these quality measures. This is achieved by replacing typically used trend estimation functionals such as the running mean with more sophisticated predictive models (Predict step), and comparing their prognosis with actual data (Compare step). The two models used in the Predict step are the ARIMA model and the LSTM recursive neural network. However, the framework is formulated in general terms, so as to allow the use of other prediction or comparison methods than those tested here. The power of the method is demonstrated in a tribological case study in which change points separating the run-in, steady-state, and divergent wear phases are detected in the regime of very few false positives. ",
    "url": "https://arxiv.org/abs/2305.06630",
    "authors": [
      "Anna-Christina Glock",
      "Florian Sobieczky",
      "Johannes Fürnkranz",
      "Peter Filzmoser",
      "Martin Jech"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06657",
    "title": "On practical robust reinforcement learning: adjacent uncertainty set and  double-agent algorithm",
    "abstract": "Robust reinforcement learning (RL) aims at learning a policy that optimizes the worst-case performance over an uncertainty set. Given nominal Markov decision process (N-MDP) that generates samples for training, the set contains MDPs obtained by some perturbations from N-MDP. In this paper, we introduce a new uncertainty set containing more realistic MDPs in practice than the existing sets. Using this uncertainty set, we present a robust RL, named ARQ-Learning, for tabular cases. Also, we characterize the finite-time error bounds and prove that it converges as fast as Q-Learning and robust Q-Learning (i.e., the state-of-the-art robust RL method) while providing better robustness for real applications. We propose {\\em pessimistic agent} that efficiently tackles the key bottleneck for the extension of ARQ-Learning into large or continuous state spaces. Using this technique, we first propose PRQ-Learning. To the next, combining this with DQN and DDPG, we develop PR-DQN and PR-DDPG, respectively. We emphasize that our technique can be easily combined with the other popular model-free methods. Via experiments, we demonstrate the superiority of the proposed methods in various RL applications with model uncertainties. ",
    "url": "https://arxiv.org/abs/2305.06657",
    "authors": [
      "Ukjo Hwang",
      "Songnam Hong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.06673",
    "title": "Minor-Universal Graph for Graphs on Surfaces",
    "abstract": "We show that, for every n and every surface $\\Sigma$, there is a graph U embeddable on $\\Sigma$ with at most cn^2 vertices that contains as minor every graph embeddable on $\\Sigma$ with n vertices. The constant c depends polynomially on the Euler genus of $\\Sigma$. This generalizes a well-known result for planar graphs due to Robertson, Seymour, and Thomas [Quickly Excluding a Planar Graph. J. Comb. Theory B, 1994] which states that the square grid on 4n^2 vertices contains as minor every planar graph with n vertices. ",
    "url": "https://arxiv.org/abs/2305.06673",
    "authors": [
      "Cyril Gavoille",
      "Claire Hilaire"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2305.06683",
    "title": "Cost-efficient Crowdsourcing for Span-based Sequence Labeling: Worker  Selection and Data Augmentation",
    "abstract": "This paper introduces a novel worker selection algorithm, enhancing annotation quality and reducing costs in challenging span-based sequence labeling tasks in Natural Language Processing (NLP). Unlike previous studies targeting simpler tasks, this study contends with the complexities of label interdependencies in sequence labeling tasks. The proposed algorithm utilizes a Combinatorial Multi-Armed Bandit (CMAB) approach for worker selection. The challenge of dealing with imbalanced and small-scale datasets, which hinders offline simulation of worker selection, is tackled using an innovative data augmentation method termed shifting, expanding, and shrinking (SES). The SES method is designed specifically for sequence labeling tasks. Rigorous testing on CoNLL 2003 NER and Chinese OEI datasets showcased the algorithm's efficiency, with an increase in F1 score up to 100.04% of the expert-only baseline, alongside cost savings up to 65.97%. The paper also encompasses a dataset-independent test emulating annotation evaluation through a Bernoulli distribution, which still led to an impressive 97.56% F1 score of the expert baseline and 59.88% cost savings. This research addresses and overcomes numerous obstacles in worker selection for complex NLP tasks. ",
    "url": "https://arxiv.org/abs/2305.06683",
    "authors": [
      "Yujie Wang",
      "Chao Huang",
      "Liner Yang",
      "Zhixuan Fang",
      "Yaping Huang",
      "Yang Liu",
      "Erhong Yang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.06703",
    "title": "Neural Fine-Gray: Monotonic neural networks for competing risks",
    "abstract": "Time-to-event modelling, known as survival analysis, differs from standard regression as it addresses censoring in patients who do not experience the event of interest. Despite competitive performances in tackling this problem, machine learning methods often ignore other competing risks that preclude the event of interest. This practice biases the survival estimation. Extensions to address this challenge often rely on parametric assumptions or numerical estimations leading to sub-optimal survival approximations. This paper leverages constrained monotonic neural networks to model each competing survival distribution. This modelling choice ensures the exact likelihood maximisation at a reduced computational cost by using automatic differentiation. The effectiveness of the solution is demonstrated on one synthetic and three medical datasets. Finally, we discuss the implications of considering competing risks when developing risk scores for medical practice. ",
    "url": "https://arxiv.org/abs/2305.06703",
    "authors": [
      "Vincent Jeanselme",
      "Chang Ho Yoon",
      "Brian Tom",
      "Jessica Barrett"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.06707",
    "title": "A data-driven rutting depth short-time prediction model with  metaheuristic optimization for asphalt pavements based on RIOHTrack",
    "abstract": "Rutting of asphalt pavements is a crucial design criterion in various pavement design guides. A good road transportation base can provide security for the transportation of oil and gas in road transportation. This study attempts to develop a robust artificial intelligence model to estimate different asphalt pavements' rutting depth clips, temperature, and load axes as primary characteristics. The experiment data were obtained from 19 asphalt pavements with different crude oil sources on a 2.038 km long full-scale field accelerated pavement test track (RIOHTrack, Road Track Institute) in Tongzhou, Beijing. In addition, this paper also proposes to build complex networks with different pavement rutting depths through complex network methods and the Louvain algorithm for community detection. The most critical structural elements can be selected from different asphalt pavement rutting data, and similar structural elements can be found. An extreme learning machine algorithm with residual correction (RELM) is designed and optimized using an independent adaptive particle swarm algorithm. The experimental results of the proposed method are compared with several classical machine learning algorithms, with predictions of Average Root Mean Squared Error, Average Mean Absolute Error, and Average Mean Absolute Percentage Error for 19 asphalt pavements reaching 1.742, 1.363, and 1.94\\% respectively. The experiments demonstrate that the RELM algorithm has an advantage over classical machine learning methods in dealing with non-linear problems in road engineering. Notably, the method ensures the adaptation of the simulated environment to different levels of abstraction through the cognitive analysis of the production environment parameters. ",
    "url": "https://arxiv.org/abs/2305.06707",
    "authors": [
      "Zhuoxuan Li",
      "Iakov Korovin",
      "Xinli Shi",
      "Sergey Gorbachev",
      "Nadezhda Gorbacheva",
      "Wei Huang",
      "Jinde Cao"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2305.06715",
    "title": "Backpropagation-Free 4D Continuous Ant-Based Neural Topology Search",
    "abstract": "Continuous Ant-based Topology Search (CANTS) is a previously introduced novel nature-inspired neural architecture search (NAS) algorithm that is based on ant colony optimization (ACO). CANTS utilizes a continuous search space to indirectly-encode a neural architecture search space. Synthetic ant agents explore CANTS' continuous search space based on the density and distribution of pheromones, strongly inspired by how ants move in the real world. This continuous search space allows CANTS to automate the design of artificial neural networks (ANNs) of any size, removing a key limitation inherent to many current NAS algorithms that must operate within structures of a size that is predetermined by the user. This work expands CANTS by adding a fourth dimension to its search space representing potential neural synaptic weights. Adding this extra dimension allows CANTS agents to optimize both the architecture as well as the weights of an ANN without applying backpropagation (BP), which leads to a significant reduction in the time consumed in the optimization process. The experiments of this study - using real-world data - demonstrate that the BP-Free~CANTS algorithm exhibits highly competitive performance compared to both CANTS and ANTS while requiring significantly less operation time. ",
    "url": "https://arxiv.org/abs/2305.06715",
    "authors": [
      "AbdElRahman ElSaid",
      "Karl Ricanek",
      "Zeming Lyu",
      "Alexander Ororbia",
      "Travis Desell"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2305.06716",
    "title": "Distracting Downpour: Adversarial Weather Attacks for Motion Estimation",
    "abstract": "Current adversarial attacks on motion estimation, or optical flow, optimize small per-pixel perturbations, which are unlikely to appear in the real world. In contrast, adverse weather conditions constitute a much more realistic threat scenario. Hence, in this work, we present a novel attack on motion estimation that exploits adversarially optimized particles to mimic weather effects like snowflakes, rain streaks or fog clouds. At the core of our attack framework is a differentiable particle rendering system that integrates particles (i) consistently over multiple time steps (ii) into the 3D space (iii) with a photo-realistic appearance. Through optimization, we obtain adversarial weather that significantly impacts the motion estimation. Surprisingly, methods that previously showed good robustness towards small per-pixel perturbations are particularly vulnerable to adversarial weather. At the same time, augmenting the training with non-optimized weather increases a method's robustness towards weather effects and improves generalizability at almost no additional cost. ",
    "url": "https://arxiv.org/abs/2305.06716",
    "authors": [
      "Jenny Schmalfuss",
      "Lukas Mehl",
      "Andrés Bruhn"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06721",
    "title": "Advancing Neural Encoding of Portuguese with Transformer Albertina PT-*",
    "abstract": "To advance the neural encoding of Portuguese (PT), and a fortiori the technological preparation of this language for the digital age, we developed a Transformer-based foundation model that sets a new state of the art in this respect for two of its variants, namely European Portuguese from Portugal (PT-PT) and American Portuguese from Brazil (PT-BR). To develop this encoder, which we named Albertina PT-*, a strong model was used as a starting point, DeBERTa, and its pre-training was done over data sets of Portuguese, namely over a data set we gathered for PT-PT and over the brWaC corpus for PT-BR. The performance of Albertina and competing models was assessed by evaluating them on prominent downstream language processing tasks adapted for Portuguese. Both Albertina PT-PT and PT-BR versions are distributed free of charge and under the most permissive license possible and can be run on consumer-grade hardware, thus seeking to contribute to the advancement of research and innovation in language technology for Portuguese. ",
    "url": "https://arxiv.org/abs/2305.06721",
    "authors": [
      "João Rodrigues",
      "Luís Gomes",
      "João Silva",
      "António Branco",
      "Rodrigo Santos",
      "Henrique Lopes Cardoso",
      "Tomás Osório"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.06745",
    "title": "Investigating the generative dynamics of energy-based neural networks",
    "abstract": "Generative neural networks can produce data samples according to the statistical properties of their training distribution. This feature can be used to test modern computational neuroscience hypotheses suggesting that spontaneous brain activity is partially supported by top-down generative processing. A widely studied class of generative models is that of Restricted Boltzmann Machines (RBMs), which can be used as building blocks for unsupervised deep learning architectures. In this work, we systematically explore the generative dynamics of RBMs, characterizing the number of states visited during top-down sampling and investigating whether the heterogeneity of visited attractors could be increased by starting the generation process from biased hidden states. By considering an RBM trained on a classic dataset of handwritten digits, we show that the capacity to produce diverse data prototypes can be increased by initiating top-down sampling from chimera states, which encode high-level visual features of multiple digits. We also found that the model is not capable of transitioning between all possible digit states within a single generation trajectory, suggesting that the top-down dynamics is heavily constrained by the shape of the energy function. ",
    "url": "https://arxiv.org/abs/2305.06745",
    "authors": [
      "Lorenzo Tausani",
      "Alberto Testolin",
      "Marco Zorzi"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06754",
    "title": "COCKATIEL: COntinuous Concept ranKed ATtribution with Interpretable  ELements for explaining neural net classifiers on NLP tasks",
    "abstract": "Transformer architectures are complex and their use in NLP, while it has engendered many successes, makes their interpretability or explainability challenging. Recent debates have shown that attention maps and attribution methods are unreliable (Pruthi et al., 2019; Brunner et al., 2019). In this paper, we present some of their limitations and introduce COCKATIEL, which successfully addresses some of them. COCKATIEL is a novel, post-hoc, concept-based, model-agnostic XAI technique that generates meaningful explanations from the last layer of a neural net model trained on an NLP classification task by using Non-Negative Matrix Factorization (NMF) to discover the concepts the model leverages to make predictions and by exploiting a Sensitivity Analysis to estimate accurately the importance of each of these concepts for the model. It does so without compromising the accuracy of the underlying model or requiring a new one to be trained. We conduct experiments in single and multi-aspect sentiment analysis tasks and we show COCKATIEL's superior ability to discover concepts that align with humans' on Transformer models without any supervision, we objectively verify the faithfulness of its explanations through fidelity metrics, and we showcase its ability to provide meaningful explanations in two different datasets. ",
    "url": "https://arxiv.org/abs/2305.06754",
    "authors": [
      "Fanny Jourdan",
      "Agustin Picard",
      "Thomas Fel",
      "Laurent Risser",
      "Jean Michel Loubes",
      "Nicholas Asher"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.06773",
    "title": "Towards a Better Understanding of the Computer Vision Research Community  in Africa",
    "abstract": "Computer vision is a broad field of study that encompasses different tasks (e.g., object detection, semantic segmentation, 3D reconstruction). Although computer vision is relevant to the African communities in various applications, yet computer vision research is under-explored in the continent and constructs only 0.06% of top-tier publications in the last 10 years. In this paper, our goal is to have a better understanding of the computer vision research conducted in Africa and provide pointers on whether there is equity in research or not. We do this through an empirical analysis of the African computer vision publications that are Scopus indexed. We first study the opportunities available for African institutions to publish in top-tier computer vision venues. We show that African publishing trends in top-tier venues over the years do not exhibit consistent growth. We also devise a novel way to retrieve African authors through their affiliation history to have a better understanding of their contributions in top-tier venues. Moreover, we study all computer vision publications beyond top-tier venues in different African regions to find that mainly Northern and Southern Africa are publishing in computer vision with more than 85% of African publications. Finally, we present the most recurring keywords in computer vision publications. In summary, our analysis reveals that African researchers are key contributors to African research, yet there exists multiple barriers to publish in top-tier venues and the current trend of topics published in the continent might not necessarily reflect the communities' needs. This work is part of a community based effort that is focused on improving computer vision research in Africa. ",
    "url": "https://arxiv.org/abs/2305.06773",
    "authors": [
      "Abdul-Hakeem Omotayo",
      "Mai Gamal",
      "Eman Ehab",
      "Gbetondji Dovonon",
      "Zainab Akinjobi",
      "Ismaila Lukman",
      "Houcemeddine Turki",
      "Mahmod Abdien",
      "Idriss Tondji",
      "Abigail Oppong",
      "Yvan Pimi",
      "Karim Gamal",
      "Ro'ya-CV4Africa",
      "Mennatullah Siam"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06782",
    "title": "A Data-Driven Approach to Lightweight DVFS-Aware Counter-Based Power  Modeling for Heterogeneous Platforms",
    "abstract": "Computing systems have shifted towards highly parallel and heterogeneous architectures to tackle the challenges imposed by limited power budgets. These architectures must be supported by novel power management paradigms addressing the increasing design size, parallelism, and heterogeneity while ensuring high accuracy and low overhead. In this work, we propose a systematic, automated, and architecture-agnostic approach to accurate and lightweight DVFS-aware statistical power modeling of the CPU and GPU sub-systems of a heterogeneous platform, driven by the sub-systems' local performance monitoring counters (PMCs). Counter selection is guided by a generally applicable statistical method that identifies the minimal subsets of counters robustly correlating to power dissipation. Based on the selected counters, we train a set of lightweight, linear models characterizing each sub-system over a range of frequencies. Such models compose a lookup-table-based system-level model that efficiently captures the non-linearity of power consumption, showing desirable responsiveness and decomposability. We validate the system-level model on real hardware by measuring the total energy consumption of an NVIDIA Jetson AGX Xavier platform over a set of benchmarks. The resulting average estimation error is 1.3%, with a maximum of 3.1%. Furthermore, the model shows a maximum evaluation runtime of 500 ns, thus implying a negligible impact on system utilization and applicability to online dynamic power management (DPM). ",
    "url": "https://arxiv.org/abs/2305.06782",
    "authors": [
      "Sergio Mazzola",
      "Thomas Benz",
      "Björn Forsberg",
      "Luca Benini"
    ],
    "subjectives": [
      "Performance (cs.PF)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2305.06786",
    "title": "ReMark: Receptive Field based Spatial WaterMark Embedding Optimization  using Deep Network",
    "abstract": "Watermarking is one of the most important copyright protection tools for digital media. The most challenging type of watermarking is the imperceptible one, which embeds identifying information in the data while retaining the latter's original quality. To fulfill its purpose, watermarks need to withstand various distortions whose goal is to damage their integrity. In this study, we investigate a novel deep learning-based architecture for embedding imperceptible watermarks. The key insight guiding our architecture design is the need to correlate the dimensions of our watermarks with the sizes of receptive fields (RF) of modules of our architecture. This adaptation makes our watermarks more robust, while also enabling us to generate them in a way that better maintains image quality. Extensive evaluations on a wide variety of distortions show that the proposed method is robust against most common distortions on watermarks including collusive distortion. ",
    "url": "https://arxiv.org/abs/2305.06786",
    "authors": [
      "Natan Semyonov",
      "Rami Puzis",
      "Asaf Shabtai",
      "Gilad Katz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2305.06801",
    "title": "Detecting Idiomatic Multiword Expressions in Clinical Terminology using  Definition-Based Representation Learning",
    "abstract": "This paper shines a light on the potential of definition-based semantic models for detecting idiomatic and semi-idiomatic multiword expressions (MWEs) in clinical terminology. Our study focuses on biomedical entities defined in the UMLS ontology and aims to help prioritize the translation efforts of these entities. In particular, we develop an effective tool for scoring the idiomaticity of biomedical MWEs based on the degree of similarity between the semantic representations of those MWEs and a weighted average of the representation of their constituents. We achieve this using a biomedical language model trained to produce similar representations for entity names and their definitions, called BioLORD. The importance of this definition-based approach is highlighted by comparing the BioLORD model to two other state-of-the-art biomedical language models based on Transformer: SapBERT and CODER. Our results show that the BioLORD model has a strong ability to identify idiomatic MWEs, not replicated in other models. Our corpus-free idiomaticity estimation helps ontology translators to focus on more challenging MWEs. ",
    "url": "https://arxiv.org/abs/2305.06801",
    "authors": [
      "François Remy",
      "Alfiya Khabibullina",
      "Thomas Demeester"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.06827",
    "title": "A Generic Approach to Integrating Time into Spatial-Temporal Forecasting  via Conditional Neural Fields",
    "abstract": "Self-awareness is the key capability of autonomous systems, e.g., autonomous driving network, which relies on highly efficient time series forecasting algorithm to enable the system to reason about the future state of the environment, as well as its effect on the system behavior as time progresses. Recently, a large number of forecasting algorithms using either convolutional neural networks or graph neural networks have been developed to exploit the complex temporal and spatial dependencies present in the time series. While these solutions have shown significant advantages over statistical approaches, one open question is to effectively incorporate the global information which represents the seasonality patterns via the time component of time series into the forecasting models to improve their accuracy. This paper presents a general approach to integrating the time component into forecasting models. The main idea is to employ conditional neural fields to represent the auxiliary features extracted from the time component to obtain the global information, which will be effectively combined with the local information extracted from autoregressive neural networks through a layer-wise gated fusion module. Extensive experiments on road traffic and cellular network traffic datasets prove the effectiveness of the proposed approach. ",
    "url": "https://arxiv.org/abs/2305.06827",
    "authors": [
      "Minh-Thanh Bui",
      "Duc-Thinh Ngo",
      "Zonghua Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06841",
    "title": "Think Twice: Measuring the Efficiency of Eliminating Prediction  Shortcuts of Question Answering Models",
    "abstract": "While the Large Language Models (LLMs) dominate a majority of language understanding tasks, previous work shows that some of these results are supported by modelling spurious correlations of training datasets. Authors commonly assess model robustness by evaluating their models on out-of-distribution (OOD) datasets of the same task, but these datasets might share the bias of the training dataset. We propose a simple method for measuring a scale of models' reliance on any identified spurious feature and assess the robustness towards a large set of known and newly found prediction biases for various pre-trained models and debiasing methods in Question Answering (QA). We find that the reported OOD gains of debiasing methods can not be explained by mitigated reliance on biased features, suggesting that biases are shared among QA datasets. We further evidence this by measuring that performance of OOD models depends on bias features comparably to the ID model, motivating future work to refine the reports of LLMs' robustness to a level of known spurious features. ",
    "url": "https://arxiv.org/abs/2305.06841",
    "authors": [
      "Lukáš Mikula",
      "Michal Štefánik",
      "Marek Petrovič",
      "Petr Sojka"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.06842",
    "title": "Emotion Recognition for Challenged People Facial Appearance in Social  using Neural Network",
    "abstract": "Human communication is the vocal and non verbal signal to communicate with others. Human expression is a significant biometric object in picture and record databases of surveillance systems. Face appreciation has a serious role in biometric methods and is good-looking for plentiful applications, including visual scrutiny and security. Facial expressions are a form of nonverbal communication; recognizing them helps improve the human machine interaction. This paper proposes an idea for face and enlightenment invariant credit of facial expressions by the images. In order on, the person's face can be computed. Face expression is used in CNN classifier to categorize the acquired picture into different emotion categories. It is a deep, feed-forward artificial neural network. Outcome surpasses human presentation and shows poses alternate performance. Varying lighting conditions can influence the fitting process and reduce recognition precision. Results illustrate that dependable facial appearance credited with changing lighting conditions for separating reasonable facial terminology display emotions is an efficient representation of clean and assorted moving expressions. This process can also manage the proportions of dissimilar basic affecting expressions of those mixed jointly to produce sensible emotional facial expressions. Our system contains a pre-defined data set, which was residential by a statistics scientist and includes all pure and varied expressions. On average, a data set has achieved 92.4% exact validation of the expressions synthesized by our technique. These facial expressions are compared through the pre-defined data-position inside our system. If it recognizes the person in an abnormal condition, an alert will be passed to the nearby hospital/doctor seeing that a message. ",
    "url": "https://arxiv.org/abs/2305.06842",
    "authors": [
      "P. Deivendran",
      "P. Suresh Babu",
      "G. Malathi",
      "K. Anbazhagan",
      "R. Senthil Kumar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.06845",
    "title": "Detection and Classification of Pole-like Landmarks for Domain-invariant  3D Point Cloud Map Matching",
    "abstract": "In 3D point cloud-based visual self-localization, pole landmarks have a great potential as landmarks for accurate and reliable localization due to their long-term stability under seasonal and weather changes. In this study, we aim to explore the use of recently developed deep learning models for pole classification in the context of pole landmark-based self-localization. Specifically, the proposed scheme consists of two main modules: pole map matching and pole class matching. In the former module, local pole map is constructed and its configuration is compared against a precomputed global pole map. An efficient RANSAC map matching is employed to achieve a good tradeoff between computational efficiency and accuracy. In the latter pole class matching module, the local and global poles paired by the RANSAC map-matching are further compared by means of pole attribute class. To this end, a predefined set of pseudo pole classes is learned via k-means clustering in a self-supervised manner. Experiments using publicly available NCLT dataset showed that the pole-like landmark classification method has an improved effect on the visual self-localization system compared with the baseline method. ",
    "url": "https://arxiv.org/abs/2305.06845",
    "authors": [
      "Sun Yifei",
      "Li Dingrui",
      "Ye Minying",
      "Tanaka Kanji"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06864",
    "title": "Fair Division of a Graph into Compact Bundles",
    "abstract": "We study the computational complexity of fair division of indivisible items in an enriched model: there is an underlying graph on the set of items. And we have to allocate the items (i.e., the vertices of the graph) to a set of agents in such a way that (a) the allocation is fair (for appropriate notions of fairness) and (b) each agent receives a bundle of items (i.e., a subset of vertices) that induces a subgraph with a specific \"nice structure.\" This model has previously been studied in the literature with the nice structure being a connected subgraph. In this paper, we propose an alternative for connectivity in fair division. We introduce what we call compact graphs, and look for fair allocations in which each agent receives a compact bundle of items. Through compactness, we try to capture the idea that every agent must receive a set of \"closely related\" items. We prove a host of hardness and tractability results for restricted input settings with respect to fairness concepts such as proportionality, envy-freeness and maximin share guarantee. ",
    "url": "https://arxiv.org/abs/2305.06864",
    "authors": [
      "Jayakrishnan Madathil"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2305.06865",
    "title": "Multi-Tier Client Selection for Mobile Federated Learning Networks",
    "abstract": "Federated learning (FL), which addresses data privacy issues by training models on resource-constrained mobile devices in a distributed manner, has attracted significant research attention. However, the problem of optimizing FL client selection in mobile federated learning networks (MFLNs), where devices move in and out of each others' coverage and no FL server knows all the data owners, remains open. To bridge this gap, we propose a first-of-its-kind \\underline{Soc}ially-aware \\underline{Fed}erated \\underline{C}lient \\underline{S}election (SocFedCS) approach to minimize costs and train high-quality FL models. SocFedCS enriches the candidate FL client pool by enabling data owners to propagate FL task information through their local networks of trust, even as devices are moving into and out of each others' coverage. Based on Lyapunov optimization, we first transform this time-coupled problem into a step-by-step optimization problem. Then, we design a method based on alternating minimization and self-adaptive global best harmony search to solve this mixed-integer optimization problem. Extensive experiments comparing SocFedCS against five state-of-the-art approaches based on four real-world multimedia datasets demonstrate that it achieves 2.06\\% higher test accuracy and 12.24\\% lower cost on average than the best-performing baseline. ",
    "url": "https://arxiv.org/abs/2305.06865",
    "authors": [
      "Yulan Gao",
      "Yansong Zhao",
      "Han Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2305.06898",
    "title": "Identifying vital nodes through augmented random walks on higher-order  networks",
    "abstract": "Empirical networks possess considerable heterogeneity of node connections, resulting in a small portion of nodes playing crucial roles in network structure and function. Yet, how to characterize nodes' influence and identify vital nodes is by far still unclear in the study of networks with higher-order interactions. In this paper, we introduce a multi-order graph obtained by incorporating the higher-order bipartite graph and the classical pairwise graph, and propose a Higher-order Augmented Random Walk (HoRW) model through random walking on it. This representation preserves as much information about the higher-interacting network as possible. The results indicate that the proposed method effectively addresses the localization problem of certain classical centralities. In contrast to random walks along pairwise interactions only, performing more walks along higher-order interactions assists in not only identifying the most important nodes but also distinguishing nodes that ranked in the middle and bottom. Our method outperforms classical centralities in identifying vital nodes and can scale to various tasks in networks, including information spread maximization and network dismantling problems. The proposed higher-order representation and the random walk model provide novel insights and potent tools for studying higher-order mechanisms and functionality. ",
    "url": "https://arxiv.org/abs/2305.06898",
    "authors": [
      "Yujie Zeng",
      "Yiming Huang",
      "Xiao-Long Ren",
      "Linyuan Lü"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:2305.06901",
    "title": "Assault and Battery: Evaluating the Security of Power Conversion Systems  Against Electromagnetic Injection Attacks",
    "abstract": "Many modern devices, including critical infrastructures, depend on the reliable operation of electrical power conversion systems. The small size and versatility of switched-mode power converters has resulted in their widespread adoption. Whereas transformer-based systems passively convert voltage, switched-mode converters feature an actively regulated feedback loop, which relies on accurate sensor measurements. Previous academic work has shown that many types of sensors are vulnerable to Intentional Electromagnetic Interference (IEMI) attacks, and it has been postulated that power converters, too, are affected. In this paper, we present the first detailed study on switched-mode power converters by targeting their voltage and current sensors through IEMI attacks. We present a theoretical framework for evaluating IEMI attacks against feedback-based power supplies in the general case. We experimentally validate our theoretical predictions by analyzing multiple AC-DC and DC-DC converters, automotive grade current sensors, and dedicated battery chargers, and demonstrate the systematic vulnerability of all examined categories under real-world conditions. Finally, we demonstrate that sensor attacks on power converters can cause permanent damage to Li-Ion batteries during the charging process. ",
    "url": "https://arxiv.org/abs/2305.06901",
    "authors": [
      "Marcell Szakály",
      "Sebastian Köhler",
      "Martin Strohmeier",
      "Ivan Martinovic"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.06923",
    "title": "EAML: Ensemble Self-Attention-based Mutual Learning Network for Document  Image Classification",
    "abstract": "In the recent past, complex deep neural networks have received huge interest in various document understanding tasks such as document image classification and document retrieval. As many document types have a distinct visual style, learning only visual features with deep CNNs to classify document images have encountered the problem of low inter-class discrimination, and high intra-class structural variations between its categories. In parallel, text-level understanding jointly learned with the corresponding visual properties within a given document image has considerably improved the classification performance in terms of accuracy. In this paper, we design a self-attention-based fusion module that serves as a block in our ensemble trainable network. It allows to simultaneously learn the discriminant features of image and text modalities throughout the training stage. Besides, we encourage mutual learning by transferring the positive knowledge between image and text modalities during the training stage. This constraint is realized by adding a truncated-Kullback-Leibler divergence loss Tr-KLD-Reg as a new regularization term, to the conventional supervised setting. To the best of our knowledge, this is the first time to leverage a mutual learning approach along with a self-attention-based fusion module to perform document image classification. The experimental results illustrate the effectiveness of our approach in terms of accuracy for the single-modal and multi-modal modalities. Thus, the proposed ensemble self-attention-based mutual learning model outperforms the state-of-the-art classification results based on the benchmark RVL-CDIP and Tobacco-3482 datasets. ",
    "url": "https://arxiv.org/abs/2305.06923",
    "authors": [
      "Souhail Bakkali",
      "Ziheng Ming",
      "Mickael Coustaty",
      "Marçal Rusiñol"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06939",
    "title": "Deep Multi-View Subspace Clustering with Anchor Graph",
    "abstract": "Deep multi-view subspace clustering (DMVSC) has recently attracted increasing attention due to its promising performance. However, existing DMVSC methods still have two issues: (1) they mainly focus on using autoencoders to nonlinearly embed the data, while the embedding may be suboptimal for clustering because the clustering objective is rarely considered in autoencoders, and (2) existing methods typically have a quadratic or even cubic complexity, which makes it challenging to deal with large-scale data. To address these issues, in this paper we propose a novel deep multi-view subspace clustering method with anchor graph (DMCAG). To be specific, DMCAG firstly learns the embedded features for each view independently, which are used to obtain the subspace representations. To significantly reduce the complexity, we construct an anchor graph with small size for each view. Then, spectral clustering is performed on an integrated anchor graph to obtain pseudo-labels. To overcome the negative impact caused by suboptimal embedded features, we use pseudo-labels to refine the embedding process to make it more suitable for the clustering task. Pseudo-labels and embedded features are updated alternately. Furthermore, we design a strategy to keep the consistency of the labels based on contrastive learning to enhance the clustering performance. Empirical studies on real-world datasets show that our method achieves superior clustering performance over other state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2305.06939",
    "authors": [
      "Chenhang Cui",
      "Yazhou Ren",
      "Jingyu Pu",
      "Xiaorong Pu",
      "Lifang He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06940",
    "title": "SalienDet: A Saliency-based Feature Enhancement Algorithm for Object  Detection for Autonomous Driving",
    "abstract": "Object detection (OD) is crucial to autonomous driving. Unknown objects are one of the reasons that hinder autonomous vehicles from driving beyond the operational domain. We propose a saliency-based OD algorithm (SalienDet) to detect objects that do not appear in the training sample set. SalienDet utilizes a saliency-based algorithm to enhance image features for object proposal generation. Then, we design a dataset relabeling approach to differentiate the unknown objects from all objects to achieve open-world detection. We evaluate SalienDet on KITTI, NuScenes, and BDD datasets, and the result indicates that it outperforms existing algorithms for unknown object detection. Additionally, SalienDet can be easily adapted for incremental learning in open-world detection tasks. ",
    "url": "https://arxiv.org/abs/2305.06940",
    "authors": [
      "Ning Ding",
      "Ce Zhang",
      "Azim Eskandarian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06963",
    "title": "Cascaded Cross-Attention Networks for Data-Efficient Whole-Slide Image  Classification Using Transformers",
    "abstract": "Whole-Slide Imaging allows for the capturing and digitization of high-resolution images of histological specimen. An automated analysis of such images using deep learning models is therefore of high demand. The transformer architecture has been proposed as a possible candidate for effectively leveraging the high-resolution information. Here, the whole-slide image is partitioned into smaller image patches and feature tokens are extracted from these image patches. However, while the conventional transformer allows for a simultaneous processing of a large set of input tokens, the computational demand scales quadratically with the number of input tokens and thus quadratically with the number of image patches. To address this problem we propose a novel cascaded cross-attention network (CCAN) based on the cross-attention mechanism that scales linearly with the number of extracted patches. Our experiments demonstrate that this architecture is at least on-par with and even outperforms other attention-based state-of-the-art methods on two public datasets: On the use-case of lung cancer (TCGA NSCLC) our model reaches a mean area under the receiver operating characteristic (AUC) of 0.970 $\\pm$ 0.008 and on renal cancer (TCGA RCC) reaches a mean AUC of 0.985 $\\pm$ 0.004. Furthermore, we show that our proposed model is efficient in low-data regimes, making it a promising approach for analyzing whole-slide images in resource-limited settings. To foster research in this direction, we make our code publicly available on GitHub: XXX. ",
    "url": "https://arxiv.org/abs/2305.06963",
    "authors": [
      "Firas Khader",
      "Jakob Nikolas Kather",
      "Tianyu Han",
      "Sven Nebelung",
      "Christiane Kuhl",
      "Johannes Stegmaier",
      "Daniel Truhn"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06986",
    "title": "Provable Guarantees for Nonlinear Feature Learning in Three-Layer Neural  Networks",
    "abstract": "One of the central questions in the theory of deep learning is to understand how neural networks learn hierarchical features. The ability of deep networks to extract salient features is crucial to both their outstanding generalization ability and the modern deep learning paradigm of pretraining and finetuneing. However, this feature learning process remains poorly understood from a theoretical perspective, with existing analyses largely restricted to two-layer networks. In this work we show that three-layer neural networks have provably richer feature learning capabilities than two-layer networks. We analyze the features learned by a three-layer network trained with layer-wise gradient descent, and present a general purpose theorem which upper bounds the sample complexity and width needed to achieve low test error when the target has specific hierarchical structure. We instantiate our framework in specific statistical learning settings -- single-index models and functions of quadratic features -- and show that in the latter setting three-layer networks obtain a sample complexity improvement over all existing guarantees for two-layer networks. Crucially, this sample complexity improvement relies on the ability of three-layer networks to efficiently learn nonlinear features. We then establish a concrete optimization-based depth separation by constructing a function which is efficiently learnable via gradient descent on a three-layer network, yet cannot be learned efficiently by a two-layer network. Our work makes progress towards understanding the provable benefit of three-layer neural networks over two-layer networks in the feature learning regime. ",
    "url": "https://arxiv.org/abs/2305.06986",
    "authors": [
      "Eshaan Nichani",
      "Alex Damian",
      "Jason D. Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.06993",
    "title": "SMATCH++: Standardized and Extended Evaluation of Semantic Graphs",
    "abstract": "The Smatch metric is a popular method for evaluating graph distances, as is necessary, for instance, to assess the performance of semantic graph parsing systems. However, we observe some issues in the metric that jeopardize meaningful evaluation. E.g., opaque pre-processing choices can affect results, and current graph-alignment solvers do not provide us with upper-bounds. Without upper-bounds, however, fair evaluation is not guaranteed. Furthermore, adaptions of Smatch for extended tasks (e.g., fine-grained semantic similarity) are spread out, and lack a unifying framework. For better inspection, we divide the metric into three modules: pre-processing, alignment, and scoring. Examining each module, we specify its goals and diagnose potential issues, for which we discuss and test mitigation strategies. For pre-processing, we show how to fully conform to annotation guidelines that allow structurally deviating but valid graphs. For safer and enhanced alignment, we show the feasibility of optimal alignment in a standard evaluation setup, and develop a lossless graph compression method that shrinks the search space and significantly increases efficiency. For improved scoring, we propose standardized and extended metric calculation of fine-grained sub-graph meaning aspects. Our code is available at https://github.com/flipz357/smatchpp ",
    "url": "https://arxiv.org/abs/2305.06993",
    "authors": [
      "Juri Opitz"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07011",
    "title": "Region-Aware Pretraining for Open-Vocabulary Object Detection with  Vision Transformers",
    "abstract": "We present Region-aware Open-vocabulary Vision Transformers (RO-ViT) - a contrastive image-text pretraining recipe to bridge the gap between image-level pretraining and open-vocabulary object detection. At the pretraining phase, we propose to randomly crop and resize regions of positional embeddings instead of using the whole image positional embeddings. This better matches the use of positional embeddings at region-level in the detection finetuning phase. In addition, we replace the common softmax cross entropy loss in contrastive learning with focal loss to better learn the informative yet difficult examples. Finally, we leverage recent advances in novel object proposals to improve open-vocabulary detection finetuning. We evaluate our full model on the LVIS and COCO open-vocabulary detection benchmarks and zero-shot transfer. RO-ViT achieves a state-of-the-art 32.1 $AP_r$ on LVIS, surpassing the best existing approach by +5.8 points in addition to competitive zero-shot transfer detection. Surprisingly, RO-ViT improves the image-level representation as well and achieves the state of the art on 9 out of 12 metrics on COCO and Flickr image-text retrieval benchmarks, outperforming competitive approaches with larger models. ",
    "url": "https://arxiv.org/abs/2305.07011",
    "authors": [
      "Dahun Kim",
      "Anelia Angelova",
      "Weicheng Kuo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.06435",
    "title": "Phase transitions in the mini-batch size for sparse and dense neural  networks",
    "abstract": "The use of mini-batches of data in training artificial neural networks is nowadays very common. Despite its broad usage, theories explaining quantitatively how large or small the optimal mini-batch size should be are missing. This work presents a systematic attempt at understanding the role of the mini-batch size in training two-layer neural networks. Working in the teacher-student scenario, with a sparse teacher, and focusing on tasks of different complexity, we quantify the effects of changing the mini-batch size $m$. We find that often the generalization performances of the student strongly depend on $m$ and may undergo sharp phase transitions at a critical value $m_c$, such that for $m<m_c$ the training process fails, while for $m>m_c$ the student learns perfectly or generalizes very well the teacher. Phase transitions are induced by collective phenomena firstly discovered in statistical mechanics and later observed in many fields of science. Finding a phase transition varying the mini-batch size raises several important questions on the role of a hyperparameter which have been somehow overlooked until now. ",
    "url": "https://arxiv.org/abs/2305.06435",
    "authors": [
      "Raffaele Marino",
      "Federico Ricci-Tersenghi"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06511",
    "title": "ParamNet: A Parameter-variable Network for Fast Stain Normalization",
    "abstract": "In practice, digital pathology images are often affected by various factors, resulting in very large differences in color and brightness. Stain normalization can effectively reduce the differences in color and brightness of digital pathology images, thus improving the performance of computer-aided diagnostic systems. Conventional stain normalization methods rely on one or several reference images, but one or several images are difficult to represent the entire dataset. Although learning-based stain normalization methods are a general approach, they use complex deep networks, which not only greatly reduce computational efficiency, but also risk introducing artifacts. StainNet is a fast and robust stain normalization network, but it has not a sufficient capability for complex stain normalization due to its too simple network structure. In this study, we proposed a parameter-variable stain normalization network, ParamNet. ParamNet contains a parameter prediction sub-network and a color mapping sub-network, where the parameter prediction sub-network can automatically determine the appropriate parameters for the color mapping sub-network according to each input image. The feature of parameter variable ensures that our network has a sufficient capability for various stain normalization tasks. The color mapping sub-network is a fully 1x1 convolutional network with a total of 59 variable parameters, which allows our network to be extremely computationally efficient and does not introduce artifacts. The results on cytopathology and histopathology datasets show that our ParamNet outperforms state-of-the-art methods and can effectively improve the generalization of classifiers on pathology diagnosis tasks. The code has been available at https://github.com/khtao/ParamNet. ",
    "url": "https://arxiv.org/abs/2305.06511",
    "authors": [
      "Hongtao Kang",
      "Die Luo",
      "Li Chen",
      "Junbo Hu",
      "Shenghua Cheng",
      "Tingwei Quan",
      "Shaoqun Zeng",
      "Xiuli Liu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06593",
    "title": "A Robust Control Approach to Asymptotic Optimality of the Heavy Ball  Method for Optimization of Quadratic Functions",
    "abstract": "Among first order optimization methods, Polyak's heavy ball method has long been known to guarantee the asymptotic rate of convergence matching Nesterov's lower bound for functions defined in an infinite-dimensional space. In this paper, we use results on the robust gain margin of linear uncertain feedback control systems to show that the heavy ball method is provably worst-case asymptotically optimal when applied to quadratic functions in a finite dimensional space. ",
    "url": "https://arxiv.org/abs/2305.06593",
    "authors": [
      "V. Ugrinovskii",
      "I. R. Petersen",
      "I. Shames"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.06610",
    "title": "Backdoor to the Hidden Ground State: Planted Vertex Cover Example",
    "abstract": "We introduce a planted vertex cover problem on regular random graphs and study it by the cavity method. The equilibrium ordering phase transition of this binary-spin two-body interaction system is discontinuous in nature distinct from the continuous one of conventional Ising-like models, and it is dynamically blocked by an extensive free energy barrier. We discover that the disordered symmetric phase of this system may be locally stable with respect to the ordered phase at all inverse temperatures except for a unique eureka point $\\beta_b$ at which it is only marginally stable. The eureka point $\\beta_b$ serves as a backdoor to access the hidden ground state with vanishing free energy barrier. It exists in an infinite series of planted random graph ensembles and we determine their structural parameters analytically. The revealed new type of free energy landscape may also exist in other planted random-graph optimization problems at the interface of statistical physics and statistical inference. ",
    "url": "https://arxiv.org/abs/2305.06610",
    "authors": [
      "Xin-Yi Fan",
      "Hai-Jun Zhou"
    ],
    "subjectives": [
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2305.06648",
    "title": "Generalization bounds for neural ordinary differential equations and  deep residual networks",
    "abstract": "Neural ordinary differential equations (neural ODEs) are a popular family of continuous-depth deep learning models. In this work, we consider a large family of parameterized ODEs with continuous-in-time parameters, which include time-dependent neural ODEs. We derive a generalization bound for this class by a Lipschitz-based argument. By leveraging the analogy between neural ODEs and deep residual networks, our approach yields in particular a generalization bound for a class of deep residual networks. The bound involves the magnitude of the difference between successive weight matrices. We illustrate numerically how this quantity affects the generalization capability of neural networks. ",
    "url": "https://arxiv.org/abs/2305.06648",
    "authors": [
      "Pierre Marion"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06704",
    "title": "Robust Detection of Lead-Lag Relationships in Lagged Multi-Factor Models",
    "abstract": "In multivariate time series systems, key insights can be obtained by discovering lead-lag relationships inherent in the data, which refer to the dependence between two time series shifted in time relative to one another, and which can be leveraged for the purposes of control, forecasting or clustering. We develop a clustering-driven methodology for the robust detection of lead-lag relationships in lagged multi-factor models. Within our framework, the envisioned pipeline takes as input a set of time series, and creates an enlarged universe of extracted subsequence time series from each input time series, by using a sliding window approach. We then apply various clustering techniques (e.g, K-means++ and spectral clustering), employing a variety of pairwise similarity measures, including nonlinear ones. Once the clusters have been extracted, lead-lag estimates across clusters are aggregated to enhance the identification of the consistent relationships in the original universe. Since multivariate time series are ubiquitous in a wide range of domains, we demonstrate that our method is not only able to robustly detect lead-lag relationships in financial markets, but can also yield insightful results when applied to an environmental data set. ",
    "url": "https://arxiv.org/abs/2305.06704",
    "authors": [
      "Yichi Zhang",
      "Mihai Cucuringu",
      "Alexander Y. Shestopaloff",
      "Stefan Zohren"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Computational Finance (q-fin.CP)",
      "Portfolio Management (q-fin.PM)",
      "Statistical Finance (q-fin.ST)",
      "Trading and Market Microstructure (q-fin.TR)"
    ]
  },
  {
    "id": "arXiv:2305.06789",
    "title": "Integrating nearest neighbors on neural network models for treatment  effect estimation",
    "abstract": "Treatment effect estimation is of high-importance for both researchers and practitioners across many scientific and industrial domains. The abundance of observational data makes them increasingly used by researchers for the estimation of causal effects. However, these data suffer from biases, from several weaknesses, leading to inaccurate causal effect estimations, if not handled properly. Therefore, several machine learning techniques have been proposed, most of them focusing on leveraging the predictive power of neural network models to attain more precise estimation of causal effects. In this work, we propose a new methodology, named Nearest Neighboring Information for Causal Inference (NNCI), for integrating valuable nearest neighboring information on neural network-based models for estimating treatment effects. The proposed NNCI methodology is applied to some of the most well established neural network-based models for treatment effect estimation with the use of observational data. Numerical experiments and analysis provide empirical and statistical evidence that the integration of NNCI with state-of-the-art neural network models leads to considerably improved treatment effect estimations on a variety of well-known challenging benchmarks. ",
    "url": "https://arxiv.org/abs/2305.06789",
    "authors": [
      "Niki Kiriakidou",
      "Christos Diou"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06802",
    "title": "Physics-Informed Neural Networks for Discovering Localised Eigenstates  in Disordered Media",
    "abstract": "The Schr\\\"{o}dinger equation with random potentials is a fundamental model for understanding the behaviour of particles in disordered systems. Disordered media are characterised by complex potentials that lead to the localisation of wavefunctions, also called Anderson localisation. These wavefunctions may have similar scales of eigenenergies which poses difficulty in their discovery. It has been a longstanding challenge due to the high computational cost and complexity of solving the Schr\\\"{o}dinger equation. Recently, machine-learning tools have been adopted to tackle these challenges. In this paper, based upon recent advances in machine learning, we present a novel approach for discovering localised eigenstates in disordered media using physics-informed neural networks (PINNs). We focus on the spectral approximation of Hamiltonians in one dimension with potentials that are randomly generated according to the Bernoulli, normal, and uniform distributions. We introduce a novel feature to the loss function that exploits known physical phenomena occurring in these regions to scan across the domain and successfully discover these eigenstates, regardless of the similarity of their eigenenergies. We present various examples to demonstrate the performance of the proposed approach and compare it with isogeometric analysis. ",
    "url": "https://arxiv.org/abs/2305.06802",
    "authors": [
      "Liam Harcombe",
      "Quanling Deng"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2305.06822",
    "title": "Implicit Neural Networks with Fourier-Feature Inputs for Free-breathing  Cardiac MRI Reconstruction",
    "abstract": "In this paper, we propose an approach for cardiac magnetic resonance imaging (MRI), which aims to reconstruct a real-time video of a beating heart from continuous highly under-sampled measurements. This task is challenging since the object to be reconstructed (the heart) is continuously changing during signal acquisition. To address this challenge, we represent the beating heart with an implicit neural network and fit the network so that the representation of the heart is consistent with the measurements. The network in the form of a multi-layer perceptron with Fourier-feature inputs acts as an effective signal prior and enables adjusting the regularization strength in both the spatial and temporal dimensions of the signal. We examine the proposed approach for 2D free-breathing cardiac real-time MRI in different operating regimes, i.e., for different image resolutions, slice thicknesses, and acquisition lengths. Our method achieves reconstruction quality on par with or slightly better than state-of-the-art untrained convolutional neural networks and superior image quality compared to a recent method that fits an implicit representation directly to Fourier-domain measurements. However, this comes at a higher computational cost. Our approach does not require any additional patient data or biosensors including electrocardiography, making it potentially applicable in a wide range of clinical scenarios. ",
    "url": "https://arxiv.org/abs/2305.06822",
    "authors": [
      "Johannes F. Kunz",
      "Stefan Ruschke",
      "Reinhard Heckel"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06862",
    "title": "A General Framework for Visualizing Embedding Spaces of Neural Survival  Analysis Models Based on Angular Information",
    "abstract": "We propose a general framework for visualizing any intermediate embedding representation used by any neural survival analysis model. Our framework is based on so-called anchor directions in an embedding space. We show how to estimate these anchor directions using clustering or, alternatively, using user-supplied \"concepts\" defined by collections of raw inputs (e.g., feature vectors all from female patients could encode the concept \"female\"). For tabular data, we present visualization strategies that reveal how anchor directions relate to raw clinical features and to survival time distributions. We then show how these visualization ideas extend to handling raw inputs that are images. Our framework is built on looking at angles between vectors in an embedding space, where there could be \"information loss\" by ignoring magnitude information. We show how this loss results in a \"clumping\" artifact that appears in our visualizations, and how to reduce this information loss in practice. ",
    "url": "https://arxiv.org/abs/2305.06862",
    "authors": [
      "George H. Chen"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06894",
    "title": "Reinterpreting causal discovery as the task of predicting unobserved  joint statistics",
    "abstract": "If $X,Y,Z$ denote sets of random variables, two different data sources may contain samples from $P_{X,Y}$ and $P_{Y,Z}$, respectively. We argue that causal discovery can help inferring properties of the `unobserved joint distributions' $P_{X,Y,Z}$ or $P_{X,Z}$. The properties may be conditional independences (as in `integrative causal inference') or also quantitative statements about dependences. More generally, we define a learning scenario where the input is a subset of variables and the label is some statistical property of that subset. Sets of jointly observed variables define the training points, while unobserved sets are possible test points. To solve this learning task, we infer, as an intermediate step, a causal model from the observations that then entails properties of unobserved sets. Accordingly, we can define the VC dimension of a class of causal models and derive generalization bounds for the predictions. Here, causal discovery becomes more modest and better accessible to empirical tests than usual: rather than trying to find a causal hypothesis that is `true' a causal hypothesis is {\\it useful} whenever it correctly predicts statistical properties of unobserved joint distributions. This way, a sparse causal graph that omits weak influences may be more useful than a dense one (despite being less accurate) because it is able to reconstruct the full joint distribution from marginal distributions of smaller subsets. Within such a `pragmatic' application of causal discovery, some popular heuristic approaches become justified in retrospect. It is, for instance, allowed to infer DAGs from partial correlations instead of conditional independences if the DAGs are only used to predict partial correlations. ",
    "url": "https://arxiv.org/abs/2305.06894",
    "authors": [
      "Dominik Janzing",
      "Philipp M. Faller",
      "Leena Chennuru Vankadara"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.06989",
    "title": "Neural Wave Functions for Superfluids",
    "abstract": "Understanding superfluidity remains a major goal of condensed matter physics. Here we tackle this challenge utilizing the recently developed Fermionic neural network (FermiNet) wave function Ansatz for variational Monte Carlo calculations. We study the unitary Fermi gas, a system with strong, short-range, two-body interactions known to possess a superfluid ground state but difficult to describe quantitively. We demonstrate key limitations of the FermiNet Ansatz in studying the unitary Fermi gas and propose a simple modification that outperforms the original FermiNet significantly, giving highly accurate results. We prove mathematically that the new Ansatz is a strict generalization of the original FermiNet architecture, despite the use of fewer parameters. Our approach shares several advantanges with the FermiNet: the use of a neural network removes the need for an underlying basis set; and the flexiblity of the network yields extremely accurate results within a variational quantum Monte Carlo framework that provides access to unbiased estimates of arbitrary ground-state expectation values. We discuss how the method can be extended to study other superfluids. ",
    "url": "https://arxiv.org/abs/2305.06989",
    "authors": [
      "Wan Tong Lou",
      "Halvard Sutterud",
      "Gino Cassella",
      "W.M.C. Foulkes",
      "Johannes Knolle",
      "David Pfau",
      "James S. Spencer"
    ],
    "subjectives": [
      "Quantum Gases (cond-mat.quant-gas)",
      "Superconductivity (cond-mat.supr-con)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:1708.00743",
    "title": "Continuous Average Straightness in Spatial Graphs",
    "abstract": " Title: Continuous Average Straightness in Spatial Graphs ",
    "url": "https://arxiv.org/abs/1708.00743",
    "authors": [
      "Vincent Labatut"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2102.09057",
    "title": "Towards Adversarial-Resilient Deep Neural Networks for False Data  Injection Attack Detection in Power Grids",
    "abstract": " Comments: This paper has been accepted by the the 32nd International Conference on Computer Communications and Networks (ICCCN 2023) ",
    "url": "https://arxiv.org/abs/2102.09057",
    "authors": [
      "Jiangnan Li",
      "Yingyuan Yang",
      "Jinyuan Stella Sun",
      "Kevin Tomsovic",
      "Hairong Qi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.04623",
    "title": "Maximizing Influence with Graph Neural Networks",
    "abstract": " Comments: 16 ",
    "url": "https://arxiv.org/abs/2108.04623",
    "authors": [
      "George Panagopoulos",
      "Nikolaos Tziortziotis",
      "Fragkiskos D. Malliaros",
      "Michalis Vazirgiannis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2109.00923",
    "title": "Auctions and Peer Prediction for Academic Peer Review",
    "abstract": " Title: Auctions and Peer Prediction for Academic Peer Review ",
    "url": "https://arxiv.org/abs/2109.00923",
    "authors": [
      "Siddarth Srinivasan",
      "Jamie Morgenstern"
    ],
    "subjectives": [
      "General Economics (econ.GN)",
      "Computer Science and Game Theory (cs.GT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.04939",
    "title": "Modeling Human Sentence Processing with Left-Corner Recurrent Neural  Network Grammars",
    "abstract": " Comments: Accepted by EMNLP 2021 ",
    "url": "https://arxiv.org/abs/2109.04939",
    "authors": [
      "Ryo Yoshida",
      "Hiroshi Noji",
      "Yohei Oseki"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2111.10743",
    "title": "FMM-accelerated solvers for the Laplace-Beltrami problem on complex  surfaces in three dimensions",
    "abstract": " Comments: 18 pages, 5 tables, 3 figures ",
    "url": "https://arxiv.org/abs/2111.10743",
    "authors": [
      "Dhwanit Agarwal",
      "Michael O'Neil",
      "Manas Rachh"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2112.07133",
    "title": "CLIP-Lite: Information Efficient Visual Representation Learning with  Language Supervision",
    "abstract": " Title: CLIP-Lite: Information Efficient Visual Representation Learning with  Language Supervision ",
    "url": "https://arxiv.org/abs/2112.07133",
    "authors": [
      "Aman Shrivastava",
      "Ramprasaath R. Selvaraju",
      "Nikhil Naik",
      "Vicente Ordonez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.12501",
    "title": "Security Attacks and Solutions for Digital Twins",
    "abstract": " Comments: 7 pages, 1 figure ",
    "url": "https://arxiv.org/abs/2202.12501",
    "authors": [
      "Sabah Suhail",
      "Raja Jurdak",
      "Rasheed Hussain"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.00953",
    "title": "Computationally Efficient and Statistically Optimal Robust Low-rank  Matrix and Tensor Estimation",
    "abstract": " Comments: This manuscript is superseded by the new one (arXiv:2305.06199). There will be no further update of this manuscript and it will not be submitted for publications ",
    "url": "https://arxiv.org/abs/2203.00953",
    "authors": [
      "Yinan Shen",
      "Jingyang Li",
      "Jian-Feng Cai",
      "Dong Xia"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Information Theory (cs.IT)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.06355",
    "title": "EventFormer: AU Event Transformer for Facial Action Unit Event Detection",
    "abstract": " Title: EventFormer: AU Event Transformer for Facial Action Unit Event Detection ",
    "url": "https://arxiv.org/abs/2203.06355",
    "authors": [
      "Yingjie Chen",
      "Jiarui Zhang",
      "Tao Wang",
      "Yun Liang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.13089",
    "title": "Agreement-on-the-Line: Predicting the Performance of Neural Networks  under Distribution Shift",
    "abstract": " Comments: NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2206.13089",
    "authors": [
      "Christina Baek",
      "Yiding Jiang",
      "Aditi Raghunathan",
      "Zico Kolter"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.03798",
    "title": "The Impact of Cooperation in Bilateral Network Creation",
    "abstract": " Comments: Accepted at the 42th ACM Symposium on Principles of Distributed Computing (PODC 2023); full version ",
    "url": "https://arxiv.org/abs/2207.03798",
    "authors": [
      "Tobias Friedrich",
      "Hans Gawendowicz",
      "Pascal Lenzner",
      "Arthur Zahn"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2208.05174",
    "title": "FedOBD: Opportunistic Block Dropout for Efficiently Training Large-scale  Neural Networks through Federated Learning",
    "abstract": " Title: FedOBD: Opportunistic Block Dropout for Efficiently Training Large-scale  Neural Networks through Federated Learning ",
    "url": "https://arxiv.org/abs/2208.05174",
    "authors": [
      "Yuanyuan Chen",
      "Zichen Chen",
      "Pengcheng Wu",
      "Han Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2209.02399",
    "title": "SkeletonMAE: Spatial-Temporal Masked Autoencoders for Self-supervised  Skeleton Action Recognition",
    "abstract": " Comments: ICME 2023 Workshop ",
    "url": "https://arxiv.org/abs/2209.02399",
    "authors": [
      "Wenhan Wu",
      "Yilei Hua",
      "Ce Zheng",
      "Shiqian Wu",
      "Chen Chen",
      "Aidong Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07754",
    "title": "On the Robustness of Graph Neural Diffusion to Topology Perturbations",
    "abstract": " Title: On the Robustness of Graph Neural Diffusion to Topology Perturbations ",
    "url": "https://arxiv.org/abs/2209.07754",
    "authors": [
      "Yang Song",
      "Qiyu Kang",
      "Sijie Wang",
      "Zhao Kai",
      "Wee Peng Tay"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.10507",
    "title": "Gemino: Practical and Robust Neural Compression for Video Conferencing",
    "abstract": " Comments: 13 pages, 5 appendix ",
    "url": "https://arxiv.org/abs/2209.10507",
    "authors": [
      "Vibhaalakshmi Sivaraman",
      "Pantea Karimi",
      "Vedantha Venkatapathy",
      "Mehrdad Khani",
      "Sadjad Fouladi",
      "Mohammad Alizadeh",
      "Frédo Durand",
      "Vivienne Sze"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.00379",
    "title": "NeRF: Neural Radiance Field in 3D Vision, A Comprehensive Review",
    "abstract": " Title: NeRF: Neural Radiance Field in 3D Vision, A Comprehensive Review ",
    "url": "https://arxiv.org/abs/2210.00379",
    "authors": [
      "Kyle Gao",
      "Yina Gao",
      "Hongjie He",
      "Dening Lu",
      "Linlin Xu",
      "Jonathan Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.04490",
    "title": "Semantic Framework based Query Generation for Temporal Question  Answering over Knowledge Graphs",
    "abstract": " Comments: Accepted to EMNLP 2022, v3 is resubmitted to correct the misspelled author name ",
    "url": "https://arxiv.org/abs/2210.04490",
    "authors": [
      "Wentao Ding",
      "Hao Chen",
      "Huayu Li",
      "Yuzhong Qu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.07697",
    "title": "Multi-Task Learning based Video Anomaly Detection with Attention",
    "abstract": " Title: Multi-Task Learning based Video Anomaly Detection with Attention ",
    "url": "https://arxiv.org/abs/2210.07697",
    "authors": [
      "Mohammad Baradaran",
      "Robert Bergevin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.12497",
    "title": "Deep Linear Networks for Matrix Completion -- An Infinite Depth Limit",
    "abstract": " Title: Deep Linear Networks for Matrix Completion -- An Infinite Depth Limit ",
    "url": "https://arxiv.org/abs/2210.12497",
    "authors": [
      "Nadav Cohen",
      "Govind Menon",
      "Zsolt Veraszto"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.14410",
    "title": "Improving Adversarial Robustness via Joint Classification and Multiple  Explicit Detection Classes",
    "abstract": " Comments: 20 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2210.14410",
    "authors": [
      "Sina Baharlouei",
      "Fatemeh Sheikholeslami",
      "Meisam Razaviyayn",
      "Zico Kolter"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.14977",
    "title": "Knowledge Transfer For On-Device Speech Emotion Recognition with Neural  Structured Learning",
    "abstract": " Comments: Accepted by ICASSP 2023 ",
    "url": "https://arxiv.org/abs/2210.14977",
    "authors": [
      "Yi Chang",
      "Zhao Ren",
      "Thanh Tam Nguyen",
      "Kun Qian",
      "Björn W. Schuller"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2210.16346",
    "title": "Improving Hyperspectral Adversarial Robustness Under Multiple Attacks",
    "abstract": " Comments: 6 pages, 2 figures, 1 table, 1 algorithm ",
    "url": "https://arxiv.org/abs/2210.16346",
    "authors": [
      "Nicholas Soucy",
      "Salimeh Yasaei Sekeh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.01568",
    "title": "Fine-Tuning Language Models via Epistemic Neural Networks",
    "abstract": " Title: Fine-Tuning Language Models via Epistemic Neural Networks ",
    "url": "https://arxiv.org/abs/2211.01568",
    "authors": [
      "Ian Osband",
      "Seyed Mohammad Asghari",
      "Benjamin Van Roy",
      "Nat McAleese",
      "John Aslanides",
      "Geoffrey Irving"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.08316",
    "title": "FolkScope: Intention Knowledge Graph Construction for E-commerce  Commonsense Discovery",
    "abstract": " Comments: ACL Findings 2023 ",
    "url": "https://arxiv.org/abs/2211.08316",
    "authors": [
      "Changlong Yu",
      "Weiqi Wang",
      "Xin Liu",
      "Jiaxin Bai",
      "Yangqiu Song",
      "Zheng Li",
      "Yifan Gao",
      "Tianyu Cao",
      "Bing Yin"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2211.08726",
    "title": "Streaming Joint Speech Recognition and Disfluency Detection",
    "abstract": " Comments: Accepted at ICASSP2023 ",
    "url": "https://arxiv.org/abs/2211.08726",
    "authors": [
      "Hayato Futami",
      "Emiru Tsunoo",
      "Kentaro Shibata",
      "Yosuke Kashiwagi",
      "Takao Okuda",
      "Siddhant Arora",
      "Shinji Watanabe"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2211.08794",
    "title": "Towards Robust Low-Resource Fine-Tuning with Multi-View Compressed  Representations",
    "abstract": " Comments: Accepted by ACL 2023 ",
    "url": "https://arxiv.org/abs/2211.08794",
    "authors": [
      "Linlin Liu",
      "Xingxuan Li",
      "Megh Thakkar",
      "Xin Li",
      "Shafiq Joty",
      "Luo Si",
      "Lidong Bing"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.13993",
    "title": "Combating noisy labels in object detection datasets",
    "abstract": " Comments: 8 pages, 8 figures, submitted to ECAI 2023 Conference ",
    "url": "https://arxiv.org/abs/2211.13993",
    "authors": [
      "Krystian Chachuła",
      "Jakub Łyskawa",
      "Bartłomiej Olber",
      "Piotr Frątczak",
      "Adam Popowicz",
      "Krystian Radlak"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.02560",
    "title": "Cross-Domain Few-Shot Relation Extraction via Representation Learning  and Domain Adaptation",
    "abstract": " Title: Cross-Domain Few-Shot Relation Extraction via Representation Learning  and Domain Adaptation ",
    "url": "https://arxiv.org/abs/2212.02560",
    "authors": [
      "Zhongju Yuan",
      "Zhenkun Wang",
      "Genghui Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.08853",
    "title": "HyPe: Better Pre-trained Language Model Fine-tuning with Hidden  Representation Perturbation",
    "abstract": " Comments: Accepted by ACL 2023 ",
    "url": "https://arxiv.org/abs/2212.08853",
    "authors": [
      "Hongyi Yuan",
      "Zheng Yuan",
      "Chuanqi Tan",
      "Fei Huang",
      "Songfang Huang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2212.14264",
    "title": "Trajectory Smoothing Using GNSS/PDR Integration Via Factor Graph  Optimization in Urban Canyons",
    "abstract": " Comments: 11 pages, 14 figures ",
    "url": "https://arxiv.org/abs/2212.14264",
    "authors": [
      "Yihan Zhong",
      "Weisong Wen",
      "Li-Ta Hsu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.05421",
    "title": "Anti-aliasing Predictive Coding Network for Future Video Frame  Prediction",
    "abstract": " Title: Anti-aliasing Predictive Coding Network for Future Video Frame  Prediction ",
    "url": "https://arxiv.org/abs/2301.05421",
    "authors": [
      "Chaofan Ling",
      "Weihua Li",
      "Junpei Zhong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.12667",
    "title": "NeSyFOLD: Extracting Logic Programs from Convolutional Neural Networks",
    "abstract": " Title: NeSyFOLD: Extracting Logic Programs from Convolutional Neural Networks ",
    "url": "https://arxiv.org/abs/2301.12667",
    "authors": [
      "Parth Padalkar",
      "Huaduo Wang",
      "Gopal Gupta"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.00341",
    "title": "Reverse Ordering Techniques for Attention-Based Channel Prediction",
    "abstract": " Comments: Submitted to IEEE for publication ",
    "url": "https://arxiv.org/abs/2302.00341",
    "authors": [
      "Valentina Rizzello",
      "Benedikt Böck",
      "Michael Joham",
      "Wolfgang Utschick"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2302.02300",
    "title": "Run-Off Election: Improved Provable Defense against Data Poisoning  Attacks",
    "abstract": " Title: Run-Off Election: Improved Provable Defense against Data Poisoning  Attacks ",
    "url": "https://arxiv.org/abs/2302.02300",
    "authors": [
      "Keivan Rezaei",
      "Kiarash Banihashem",
      "Atoosa Chegini",
      "Soheil Feizi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09195",
    "title": "Data-Efficient Contrastive Self-supervised Learning: Easy Examples  Contribute the Most",
    "abstract": " Comments: Accepted to ICML 2023, Code: this https URL ",
    "url": "https://arxiv.org/abs/2302.09195",
    "authors": [
      "Siddharth Joshi",
      "Baharan Mirzasoleiman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09656",
    "title": "Imprecise Bayesian Neural Networks",
    "abstract": " Title: Imprecise Bayesian Neural Networks ",
    "url": "https://arxiv.org/abs/2302.09656",
    "authors": [
      "Michele Caprio",
      "Souradeep Dutta",
      "Kuk Jin Jang",
      "Vivian Lin",
      "Radoslav Ivanov",
      "Oleg Sokolsky",
      "Insup Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.12796",
    "title": "Revisiting Graph Persistence for Updates and Efficiency",
    "abstract": " Title: Revisiting Graph Persistence for Updates and Efficiency ",
    "url": "https://arxiv.org/abs/2302.12796",
    "authors": [
      "Tamal K. Dey",
      "Tao Hou",
      "Salman Parsa"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Algebraic Topology (math.AT)"
    ]
  },
  {
    "id": "arXiv:2303.09952",
    "title": "Single-view Neural Radiance Fields with Depth Teacher",
    "abstract": " Title: Single-view Neural Radiance Fields with Depth Teacher ",
    "url": "https://arxiv.org/abs/2303.09952",
    "authors": [
      "Yurui Chen",
      "Chun Gu",
      "Feihu Zhang",
      "Li Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.15245",
    "title": "Comparison between layer-to-layer network training and conventional  network training using Deep Convolutional Neural Networks",
    "abstract": " Comments: 7 pages, 1 table ",
    "url": "https://arxiv.org/abs/2303.15245",
    "authors": [
      "Kiran Kumar Ashish Bhyravabhottla",
      "WonSook Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.16519",
    "title": "From axioms over graphs to vectors, and back again: evaluating the  properties of graph-based ontology embeddings",
    "abstract": " Comments: Accepted in NeSy 2023, 17th International Workshop on Neural-Symbolic Learning and Reasoning, Certosa di Pontignano, Siena, Italy ",
    "url": "https://arxiv.org/abs/2303.16519",
    "authors": [
      "Fernando Zhapa-Camacho",
      "Robert Hoehndorf"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2304.01580",
    "title": "Untargeted Near-collision Attacks in Biometric Recognition",
    "abstract": " Comments: Addition of results and correction of typos ",
    "url": "https://arxiv.org/abs/2304.01580",
    "authors": [
      "Axel Durbet",
      "Paul-Marie Grollemund",
      "Kevin Thiry-Atighehchi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.11116",
    "title": "Graph-ToolFormer: To Empower LLMs with Graph Reasoning Ability via  Prompt Augmented by ChatGPT",
    "abstract": " Comments: 34 pages, 3 figures, 8 tables ",
    "url": "https://arxiv.org/abs/2304.11116",
    "authors": [
      "Jiawei Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.13761",
    "title": "Enhancing Robustness of Gradient-Boosted Decision Trees through One-Hot  Encoding and Regularization",
    "abstract": " Title: Enhancing Robustness of Gradient-Boosted Decision Trees through One-Hot  Encoding and Regularization ",
    "url": "https://arxiv.org/abs/2304.13761",
    "authors": [
      "Shijie Cui",
      "Agus Sudjianto",
      "Aijun Zhang",
      "Runze Li"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.00666",
    "title": "Part Aware Contrastive Learning for Self-Supervised Action Recognition",
    "abstract": " Comments: 7 pages, 4 figures, accepted by IJCAI 2023 ",
    "url": "https://arxiv.org/abs/2305.00666",
    "authors": [
      "Yilei Hua",
      "Wenhan Wu",
      "Ce Zheng",
      "Aidong Lu",
      "Mengyuan Liu",
      "Chen Chen",
      "Shiqian Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.01194",
    "title": "The Pipeline System of ASR and NLU with MLM-based Data Augmentation  toward STOP Low-resource Challenge",
    "abstract": " Comments: To appear at ICASSP2023 ",
    "url": "https://arxiv.org/abs/2305.01194",
    "authors": [
      "Hayato Futami",
      "Jessica Huynh",
      "Siddhant Arora",
      "Shih-Lun Wu",
      "Yosuke Kashiwagi",
      "Yifan Peng",
      "Brian Yan",
      "Emiru Tsunoo",
      "Shinji Watanabe"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2305.03866",
    "title": "Spiking neural networks with Hebbian plasticity for unsupervised  representation learning",
    "abstract": " Title: Spiking neural networks with Hebbian plasticity for unsupervised  representation learning ",
    "url": "https://arxiv.org/abs/2305.03866",
    "authors": [
      "Naresh Ravichandran",
      "Anders Lansner",
      "Pawel Herman"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.03888",
    "title": "Energy-Latency Attacks to On-Device Neural Networks via Sponge Poisoning",
    "abstract": " Comments: Accepted to AsiaCCS Workshop on Secure and Trustworthy Deep Learning Systems (SecTL 2023) ",
    "url": "https://arxiv.org/abs/2305.03888",
    "authors": [
      "Zijian Wang",
      "Shuo Huang",
      "Yujin Huang",
      "Helei Cui"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2305.03963",
    "title": "Beyond the Model: Data Pre-processing Attack to Deep Learning Models in  Android Apps",
    "abstract": " Comments: Accepted to AsiaCCS WorkShop on Secure and Trustworthy Deep Learning Systems (SecTL 2023) ",
    "url": "https://arxiv.org/abs/2305.03963",
    "authors": [
      "Ye Sang",
      "Yujin Huang",
      "Shuo Huang",
      "Helei Cui"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.03994",
    "title": "Embedding bifurcations into pneumatic artificial muscle",
    "abstract": " Title: Embedding bifurcations into pneumatic artificial muscle ",
    "url": "https://arxiv.org/abs/2305.03994",
    "authors": [
      "Nozomi Akashi",
      "Yasuo Kuniyoshi",
      "Taketomo Jo",
      "Mitsuhiro Nishida",
      "Ryo Sakurai",
      "Yasumichi Wakao",
      "Kohei Nakajima"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Chaotic Dynamics (nlin.CD)"
    ]
  },
  {
    "id": "arXiv:2305.04316",
    "title": "Synthesizing Conjunctive Queries for Code Search",
    "abstract": " Comments: 32 pages, 7 figures, and 1 table. Accepted by ECOOP 2023 ",
    "url": "https://arxiv.org/abs/2305.04316",
    "authors": [
      "Chengpeng Wang",
      "Peisen Yao",
      "Wensheng Tang",
      "Gang Fan",
      "Charles Zhang"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2305.04866",
    "title": "Causal Policy Gradient for Whole-Body Mobile Manipulation",
    "abstract": " Title: Causal Policy Gradient for Whole-Body Mobile Manipulation ",
    "url": "https://arxiv.org/abs/2305.04866",
    "authors": [
      "Jiaheng Hu",
      "Peter Stone",
      "Roberto Martín-Martín"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.05711",
    "title": "CodeIE: Large Code Generation Models are Better Few-Shot Information  Extractors",
    "abstract": " Comments: Accepted to ACL 2023 (main conference). Code and data are publicly available at this https URL ",
    "url": "https://arxiv.org/abs/2305.05711",
    "authors": [
      "Peng Li",
      "Tianxiang Sun",
      "Qiong Tang",
      "Hang Yan",
      "Yuanbin Wu",
      "Xuanjing Huang",
      "Xipeng Qiu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.06105",
    "title": "Differential Privacy for Protecting Private Patterns in Data Streams",
    "abstract": " Title: Differential Privacy for Protecting Private Patterns in Data Streams ",
    "url": "https://arxiv.org/abs/2305.06105",
    "authors": [
      "He Gu",
      "Thomas Plagemann",
      "Maik Benndorf",
      "Vera Goebel",
      "Boris Koldehofe"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.06341",
    "title": "Non-Euclidean Motion Planning with Graphs of Geodesically-Convex Sets",
    "abstract": " Comments: 14 pages, 11 figures. To appear at RSS 2023. Interactive results available at this https URL ",
    "url": "https://arxiv.org/abs/2305.06341",
    "authors": [
      "Thomas Cohn",
      "Mark Petersen",
      "Max Simchowitz",
      "Russ Tedrake"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.06356",
    "title": "HumanRF: High-Fidelity Neural Radiance Fields for Humans in Motion",
    "abstract": " Comments: Project webpage: this https URL Dataset webpage: this https URL Video: this https URL Code: this https URL ",
    "url": "https://arxiv.org/abs/2305.06356",
    "authors": [
      "Mustafa Işık",
      "Martin Rünz",
      "Markos Georgopoulos",
      "Taras Khakhulin",
      "Jonathan Starck",
      "Lourdes Agapito",
      "Matthias Nießner"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  }
]