[
  {
    "id": "arXiv:2302.06650",
    "title": "Surround-View Vision-based 3D Detection for Autonomous Driving: A Survey",
    "abstract": "Vision-based 3D Detection task is fundamental task for the perception of an autonomous driving system, which has peaked interest amongst many researchers and autonomous driving engineers. However achieving a rather good 3D BEV (Bird's Eye View) performance is not an easy task using 2D sensor input-data with cameras. In this paper we provide a literature survey for the existing Vision Based 3D detection methods, focused on autonomous driving. We have made detailed analysis of over $60$ papers leveraging Vision BEV detections approaches and highlighted different sub-groups for detailed understanding of common trends. Moreover, we have highlighted how the literature and industry trend have moved towards surround-view image based methods and note down thoughts on what special cases this method addresses. In conclusion, we provoke thoughts of 3D Vision techniques for future research based on shortcomings of the current techniques including the direction of collaborative perception. ",
    "url": "https://arxiv.org/abs/2302.06650",
    "authors": [
      "Apoorv Singh",
      "Varun Bankiti"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06653",
    "title": "Snapshot disjointness in temporal graphs",
    "abstract": "In the study of temporal graphs, only paths respecting the flow of time are relevant. In this context, many concepts of walks disjointness were proposed over the years, and the validity of Menger's Theorem, as well as the complexity of related problems, has been investigated. In this paper, we introduce and investigate a type of disjointness that is only time dependent. Two walks are said to be snapshot disjoint if they are not active in a same snapshot (also called timestep). The related paths and cut problems are then defined and proved to be W[1]-hard and XP-time solvable when parameterized by the size of the solution. Additionally, in the light of the definition of Mengerian graphs given by Kempe, Kleinberg and Kumar in their seminal paper (STOC'2000), we define a Mengerian graph for time as a graph $G$ that cannot form an example where Menger's Theorem does not hold in the context of snapshot disjointness. We then give a characterization in terms of forbidden structures and provide a polynomial-time recognition algorithm. Finally, we also prove that, given a temporal graph $(G,\\lambda)$ and a pair of vertices $s,z\\in V(G)$, deciding whether at most $h$ multiedges can separate $s$ from $z$ is NP-complete. ",
    "url": "https://arxiv.org/abs/2302.06653",
    "authors": [
      "Allen Ibiapina",
      "Ana Silva"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2302.06670",
    "title": "Towards Explainable Visual Anomaly Detection",
    "abstract": "Anomaly detection and localization of visual data, including images and videos, are of great significance in both machine learning academia and applied real-world scenarios. Despite the rapid development of visual anomaly detection techniques in recent years, the interpretations of these black-box models and reasonable explanations of why anomalies can be distinguished out are scarce. This paper provides the first survey concentrated on explainable visual anomaly detection methods. We first introduce the basic background of image-level anomaly detection and video-level anomaly detection, followed by the current explainable approaches for visual anomaly detection. Then, as the main content of this survey, a comprehensive and exhaustive literature review of explainable anomaly detection methods for both images and videos is presented. Finally, we discuss several promising future directions and open problems to explore on the explainability of visual anomaly detection. ",
    "url": "https://arxiv.org/abs/2302.06670",
    "authors": [
      "Yizhou Wang",
      "Dongliang Guo",
      "Sheng Li",
      "Yun Fu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.06671",
    "title": "GenAug: Retargeting behaviors to unseen situations via Generative  Augmentation",
    "abstract": "Robot learning methods have the potential for widespread generalization across tasks, environments, and objects. However, these methods require large diverse datasets that are expensive to collect in real-world robotics settings. For robot learning to generalize, we must be able to leverage sources of data or priors beyond the robot's own experience. In this work, we posit that image-text generative models, which are pre-trained on large corpora of web-scraped data, can serve as such a data source. We show that despite these generative models being trained on largely non-robotics data, they can serve as effective ways to impart priors into the process of robot learning in a way that enables widespread generalization. In particular, we show how pre-trained generative models can serve as effective tools for semantically meaningful data augmentation. By leveraging these pre-trained models for generating appropriate \"semantic\" data augmentations, we propose a system GenAug that is able to significantly improve policy generalization. We apply GenAug to tabletop manipulation tasks, showing the ability to re-target behavior to novel scenarios, while only requiring marginal amounts of real-world data. We demonstrate the efficacy of this system on a number of object manipulation problems in the real world, showing a 40% improvement in generalization to novel scenes and objects. ",
    "url": "https://arxiv.org/abs/2302.06671",
    "authors": [
      "Zoey Chen",
      "Sho Kiami",
      "Abhishek Gupta",
      "Vikash Kumar"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.06698",
    "title": "An Application of Deep Learning for Sweet Cherry Phenotyping using YOLO  Object Detection",
    "abstract": "Tree fruit breeding is a long-term activity involving repeated measurements of various fruit quality traits on a large number of samples. These traits are traditionally measured by manually counting the fruits, weighing to indirectly measure the fruit size, and fruit colour is classified subjectively into different color categories using visual comparison to colour charts. These processes are slow, expensive and subject to evaluators' bias and fatigue. Recent advancements in deep learning can help automate this process. A method was developed to automatically count the number of sweet cherry fruits in a camera's field of view in real time using YOLOv3. A system capable of analyzing the image data for other traits such as size and color was also developed using Python. The YOLO model obtained close to 99% accuracy in object detection and counting of cherries and 90% on the Intersection over Union metric for object localization when extracting size and colour information. The model surpasses human performance and offers a significant improvement compared to manual counting. ",
    "url": "https://arxiv.org/abs/2302.06698",
    "authors": [
      "Ritayu Nagpal",
      "Sam Long",
      "Shahid Jahagirdar",
      "Weiwei Liu",
      "Scott Fazackerley",
      "Ramon Lawrence",
      "Amritpal Singh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.06715",
    "title": "Estimation of Average Annual Daily Bicycle Count Using Bike-Share GPS  Data and Bike Counter Data for an Urban Active Transportation Network",
    "abstract": "In 2018, the City of Kelowna entered into a license agreement with Dropbike to operate a dockless bike-share pilot in and around the downtown core. The bikes were tracked by the user's cell phone GPS through the Dropbike app. The City's Active Transportation team recognized that this GPS data could help understand the routes used by cyclists which would then inform decision-making for infrastructure improvements. Using OSMnx and NetworkX, the map of Kelowna was converted into a graph network to map inaccurate, infrequent GPS points to the nearest street intersection, calculate the potential paths taken by cyclists and count the number of trips by street segment though the comparison of different path-finding models. Combined with the data from four counters around downtown, a mixed effects statistical model and a least squares optimization were used to estimate a relationship between the different traffic patterns of the bike-share and counter data. Using this relationship based on sparse data input from physical counting stations and bike share data, estimations and visualizations of the annual daily bicycle volume in downtown Kelowna were produced. The analysis, modelling and visualization helped to better understand how the bike network was being used in the urban center, including non-traditional routes such as laneways and highway crossings. ",
    "url": "https://arxiv.org/abs/2302.06715",
    "authors": [
      "Marzi Rafieenia",
      "Liza Wood",
      "Mohsen Zardadi",
      "Scott Fazackerley",
      "Ramon Lawrence"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2302.06719",
    "title": "A Worst-Case Approximate Analysis of Peak Age-of-Information Via Robust  Queueing Approach",
    "abstract": "A new timeliness metric, called Age-of-Information (AoI), has recently attracted a lot of research interests for real-time applications with information updates. It has been extensively studied for various queueing models based on the probabilistic approaches, where the analyses heavily depend on the properties of specific distributions (e.g., the memoryless property of the exponential distribution or the i.i.d. assumption). In this work, we take an alternative new approach, the robust queueing approach, to analyze the Peak Age-of-Information (PAoI). Specifically, we first model the uncertainty in the stochastic arrival and service processes using uncertainty sets. This enables us to approximate the expected PAoI performance for very general arrival and service processes, including those exhibiting heavy-tailed behaviors or correlations, where traditional probabilistic approaches cannot be applied. We then derive a new bound on the PAoI in the single-source single-server setting. Furthermore, we generalize our analysis to two-source single-server systems with symmetric arrivals, which involves new challenges (e.g., the service times of the updates from two sources are coupled in one single uncertainty set). Finally, through numerical experiments, we show that our new bounds provide a good approximation for the expected PAoI. Compared to some well-known bounds in the literature (e.g., one based on Kingman's bound under the i.i.d. assumption) that tends to be inaccurate under light load, our new approximation is accurate under both light and high loads, both of which are critical scenarios for the AoI performance. ",
    "url": "https://arxiv.org/abs/2302.06719",
    "authors": [
      "Zhongdong Liu",
      "Yu Sang",
      "Bin Li",
      "Bo Ji"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2302.06733",
    "title": "Robust Unsupervised StyleGAN Image Restoration",
    "abstract": "GAN-based image restoration inverts the generative process to repair images corrupted by known degradations. Existing unsupervised methods must be carefully tuned for each task and degradation level. In this work, we make StyleGAN image restoration robust: a single set of hyperparameters works across a wide range of degradation levels. This makes it possible to handle combinations of several degradations, without the need to retune. Our proposed approach relies on a 3-phase progressive latent space extension and a conservative optimizer, which avoids the need for any additional regularization terms. Extensive experiments demonstrate robustness on inpainting, upsampling, denoising, and deartifacting at varying degradations levels, outperforming other StyleGAN-based inversion techniques. Our approach also favorably compares to diffusion-based restoration by yielding much more realistic inversion results. Code will be released upon publication. ",
    "url": "https://arxiv.org/abs/2302.06733",
    "authors": [
      "Yohan Poirier-Ginter",
      "Jean-François Lalonde"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06736",
    "title": "Environment Semantic Aided Communication: A Real World Demonstration for  Beam Prediction",
    "abstract": "Millimeter-wave (mmWave) and terahertz (THz) communication systems adopt large antenna arrays to ensure adequate receive signal power. However, adjusting the narrow beams of these antenna arrays typically incurs high beam training overhead that scales with the number of antennas. Recently proposed vision-aided beam prediction solutions, which utilize \\textit{raw RGB images} captured at the basestation to predict the optimal beams, have shown initial promising results. However, they still have a considerable computational complexity, limiting their adoption in the real world. To address these challenges, this paper focuses on developing and comparing various approaches that extract lightweight semantic information from the visual data. The results show that the proposed solutions can significantly decrease the computational requirements while achieving similar beam prediction accuracy compared to the previously proposed vision-aided solutions. ",
    "url": "https://arxiv.org/abs/2302.06736",
    "authors": [
      "Shoaib Imran",
      "Gouranga Charan",
      "Ahmed Alkhateeb"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2302.06746",
    "title": "Workload-Balanced Pruning for Sparse Spiking Neural Networks",
    "abstract": "Pruning for Spiking Neural Networks (SNNs) has emerged as a fundamental methodology for deploying deep SNNs on resource-constrained edge devices. Though the existing pruning methods can provide extremely high weight sparsity for deep SNNs, the high weight sparsity brings a workload imbalance problem. Specifically, the workload imbalance happens when a different number of non-zero weights are assigned to hardware units running in parallel, which results in low hardware utilization and thus imposes longer latency and higher energy costs. In preliminary experiments, we show that sparse SNNs ($\\sim$98% weight sparsity) can suffer as low as $\\sim$59% utilization. To alleviate the workload imbalance problem, we propose u-Ticket, where we monitor and adjust the weight connections of the SNN during Lottery Ticket Hypothesis (LTH) based pruning, thus guaranteeing the final ticket gets optimal utilization when deployed onto the hardware. Experiments indicate that our u-Ticket can guarantee up to 100% hardware utilization, thus reducing up to 76.9% latency and 63.8% energy cost compared to the non-utilization-aware LTH method. ",
    "url": "https://arxiv.org/abs/2302.06746",
    "authors": [
      "Ruokai Yin",
      "Youngeun Kim",
      "Yuhang Li",
      "Abhishek Moitra",
      "Nitin Satpute",
      "Anna Hambitzer",
      "Priyadarshini Panda"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2302.06751",
    "title": "OpenHLS: High-Level Synthesis for Low-Latency Deep Neural Networks for  Experimental Science",
    "abstract": "In many experiment-driven scientific domains, such as high-energy physics, material science, and cosmology, high data rate experiments impose hard constraints on data acquisition systems: collected data must either be indiscriminately stored for post-processing and analysis, thereby necessitating large storage capacity, or accurately filtered in real-time, thereby necessitating low-latency processing. Deep neural networks, effective in other filtering tasks, have not been widely employed in such data acquisition systems, due to design and deployment difficulties. We present an open source, lightweight, compiler framework, without any proprietary dependencies, OpenHLS, based on high-level synthesis techniques, for translating high-level representations of deep neural networks to low-level representations, suitable for deployment to near-sensor devices such as field-programmable gate arrays. We evaluate OpenHLS on various workloads and present a case-study implementation of a deep neural network for Bragg peak detection in the context of high-energy diffraction microscopy. We show OpenHLS is able to produce an implementation of the network with a throughput 4.8 $\\mu$s/sample, which is approximately a 4$\\times$ improvement over the existing implementation ",
    "url": "https://arxiv.org/abs/2302.06751",
    "authors": [
      "Maksim Levental",
      "Arham Khan",
      "Kyle Chard",
      "Ian Foster",
      "Ryan Chard",
      "Kazutomo Yoshi"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.06752",
    "title": "Provable Detection of Propagating Sampling Bias in Prediction Models",
    "abstract": "With an increased focus on incorporating fairness in machine learning models, it becomes imperative not only to assess and mitigate bias at each stage of the machine learning pipeline but also to understand the downstream impacts of bias across stages. Here we consider a general, but realistic, scenario in which a predictive model is learned from (potentially biased) training data, and model predictions are assessed post-hoc for fairness by some auditing method. We provide a theoretical analysis of how a specific form of data bias, differential sampling bias, propagates from the data stage to the prediction stage. Unlike prior work, we evaluate the downstream impacts of data biases quantitatively rather than qualitatively and prove theoretical guarantees for detection. Under reasonable assumptions, we quantify how the amount of bias in the model predictions varies as a function of the amount of differential sampling bias in the data, and at what point this bias becomes provably detectable by the auditor. Through experiments on two criminal justice datasets -- the well-known COMPAS dataset and historical data from NYPD's stop and frisk policy -- we demonstrate that the theoretical results hold in practice even when our assumptions are relaxed. ",
    "url": "https://arxiv.org/abs/2302.06752",
    "authors": [
      "Pavan Ravishankar",
      "Qingyu Mo",
      "Edward McFowland III",
      "Daniel B. Neill"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2302.06769",
    "title": "Transaction Fee Mining and Mechanism Design",
    "abstract": "Transaction fees represent a major incentive in many blockchain systems as a way to incentivize processing transactions. Unfortunately, they also introduce an enormous amount of incentive asymmetry compared to alternatives like fixed block rewards. We analyze some of the incentive compatibility issues that arise from transaction fees, which relate to the bids that users submit, the allocation rules that miners use to choose which transactions to include, and where they choose to mine in the context of longest-chain consensus. We start by surveying a variety of mining attacks including undercutting, fee sniping, and fee-optimized selfish mining. Then, we move to analyzing mechanistic notions of user incentive compatibility, myopic miner incentive compatibility, and off-chain-agreement-proofness, as well as why they are provably incompatible in their full form. Then, we discuss weaker notions of nearly and $\\gamma$-weak incentive compatibility, and how all of these forms of incentive compatibility hold or fail in the trustless auctioneer setup of blockchains, examining classical mechanisms as well as more recent ones such as Ethereum's EIP-1559 mechanism and \\cite{chung}'s burning second-price auction. Throughout, we generalize and interrelate existing notions, provide new unifying perspectives and intuitions on analysis, and discuss both specific and overarching open problems for future work. ",
    "url": "https://arxiv.org/abs/2302.06769",
    "authors": [
      "Michael Tang",
      "Alex Zhang"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2302.06784",
    "title": "The Stable Entropy Hypothesis and Entropy-Aware Decoding: An Analysis  and Algorithm for Robust Natural Language Generation",
    "abstract": "State-of-the-art language generation models can degenerate when applied to open-ended generation problems such as text completion, story generation, or dialog modeling. This degeneration usually shows up in the form of incoherence, lack of vocabulary diversity, and self-repetition or copying from the context. In this paper, we postulate that ``human-like'' generations usually lie in a narrow and nearly flat entropy band, and violation of these entropy bounds correlates with degenerate behavior. Our experiments show that this stable narrow entropy zone exists across models, tasks, and domains and confirm the hypothesis that violations of this zone correlate with degeneration. We then use this insight to propose an entropy-aware decoding algorithm that respects these entropy bounds resulting in less degenerate, more contextual, and \"human-like\" language generation in open-ended text generation settings. ",
    "url": "https://arxiv.org/abs/2302.06784",
    "authors": [
      "Kushal Arora",
      "Timothy J. O'Donnell",
      "Doina Precup",
      "Jason Weston",
      "Jackie C.K.Cheung"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.06793",
    "title": "HR-NeuS: Recovering High-Frequency Surface Geometry via Neural Implicit  Surfaces",
    "abstract": "Recent advances in neural implicit surfaces for multi-view 3D reconstruction primarily focus on improving large-scale surface reconstruction accuracy, but often produce over-smoothed geometries that lack fine surface details. To address this, we present High-Resolution NeuS (HR-NeuS), a novel neural implicit surface reconstruction method that recovers high-frequency surface geometry while maintaining large-scale reconstruction accuracy. We achieve this by utilizing (i) multi-resolution hash grid encoding rather than positional encoding at high frequencies, which boosts our model's expressiveness of local geometry details; (ii) a coarse-to-fine algorithmic framework that selectively applies surface regularization to coarse geometry without smoothing away fine details; (iii) a coarse-to-fine grid annealing strategy to train the network. We demonstrate through experiments on DTU and BlendedMVS datasets that our approach produces 3D geometries that are qualitatively more detailed and quantitatively of similar accuracy compared to previous approaches. ",
    "url": "https://arxiv.org/abs/2302.06793",
    "authors": [
      "Erich Liang",
      "Kenan Deng",
      "Xi Zhang",
      "Chun-Kai Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06801",
    "title": "Backdoor Learning for NLP: Recent Advances, Challenges, and Future  Research Directions",
    "abstract": "Although backdoor learning is an active research topic in the NLP domain, the literature lacks studies that systematically categorize and summarize backdoor attacks and defenses. To bridge the gap, we present a comprehensive and unifying study of backdoor learning for NLP by summarizing the literature in a systematic manner. We first present and motivate the importance of backdoor learning for building robust NLP systems. Next, we provide a thorough account of backdoor attack techniques, their applications, defenses against backdoor attacks, and various mitigation techniques to remove backdoor attacks. We then provide a detailed review and analysis of evaluation metrics, benchmark datasets, threat models, and challenges related to backdoor learning in NLP. Ultimately, our work aims to crystallize and contextualize the landscape of existing literature in backdoor learning for the text domain and motivate further research in the field. To this end, we identify troubling gaps in the literature and offer insights and ideas into open challenges and future research directions. Finally, we provide a GitHub repository with a list of backdoor learning papers that will be continuously updated at https://github.com/marwanomar1/Backdoor-Learning-for-NLP. ",
    "url": "https://arxiv.org/abs/2302.06801",
    "authors": [
      "Marwan Omar"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.06804",
    "title": "Discovering Optimal Scoring Mechanisms in Causal Strategic Prediction",
    "abstract": "Faced with data-driven policies, individuals will manipulate their features to obtain favorable decisions. While earlier works cast these manipulations as undesirable gaming, recent works have adopted a more nuanced causal framing in which manipulations can improve outcomes of interest, and setting coherent mechanisms requires accounting for both predictive accuracy and improvement of the outcome. Typically, these works focus on known causal graphs, consisting only of an outcome and its parents. In this paper, we introduce a general framework in which an outcome and n observed features are related by an arbitrary unknown graph and manipulations are restricted by a fixed budget and cost structure. We develop algorithms that leverage strategic responses to discover the causal graph in a finite number of steps. Given this graph structure, we can then derive mechanisms that trade off between accuracy and improvement. Altogether, our work deepens links between causal discovery and incentive design and provides a more nuanced view of learning under causal strategic prediction. ",
    "url": "https://arxiv.org/abs/2302.06804",
    "authors": [
      "Tom Yan",
      "Shantanu Gupta",
      "Zachary Lipton"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2302.06805",
    "title": "Learning with Noisy labels via Self-supervised Adversarial Noisy Masking",
    "abstract": "Collecting large-scale datasets is crucial for training deep models, annotating the data, however, inevitably yields noisy labels, which poses challenges to deep learning algorithms. Previous efforts tend to mitigate this problem via identifying and removing noisy samples or correcting their labels according to the statistical properties (e.g., loss values) among training samples. In this paper, we aim to tackle this problem from a new perspective, delving into the deep feature maps, we empirically find that models trained with clean and mislabeled samples manifest distinguishable activation feature distributions. From this observation, a novel robust training approach termed adversarial noisy masking is proposed. The idea is to regularize deep features with a label quality guided masking scheme, which adaptively modulates the input data and label simultaneously, preventing the model to overfit noisy samples. Further, an auxiliary task is designed to reconstruct input data, it naturally provides noise-free self-supervised signals to reinforce the generalization ability of deep models. The proposed method is simple and flexible, it is tested on both synthetic and real-world noisy datasets, where significant improvements are achieved over previous state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2302.06805",
    "authors": [
      "Yuanpeng Tu",
      "Boshen Zhang",
      "Yuxi Li",
      "Liang Liu",
      "Jian Li",
      "Jiangning Zhang",
      "Yabiao Wang",
      "Chengjie Wang",
      "Cai Rong Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06815",
    "title": "Self-supervised Likelihood Estimation with Energy Guidance for Anomaly  Segmentation in Urban Scenes",
    "abstract": "Robust autonomous driving requires agents to accurately identify unexpected areas in urban scenes. To this end, some critical issues remain open: how to design advisable metric to measure anomalies, and how to properly generate training samples of anomaly data? Previous effort usually resorts to uncertainty estimation and sample synthesis from classification tasks, which ignore the context information and sometimes requires auxiliary datasets with fine-grained annotations. On the contrary, in this paper, we exploit the strong context-dependent nature of segmentation task and design an energy-guided self-supervised frameworks for anomaly segmentation, which optimizes an anomaly head by maximizing the likelihood of self-generated anomaly pixels. To this end, we design two estimators for anomaly likelihood estimation, one is a simple task-agnostic binary estimator and the other depicts anomaly likelihood as residual of task-oriented energy model. Based on proposed estimators, we further incorporate our framework with likelihood-guided mask refinement process to extract informative anomaly pixels for model training. We conduct extensive experiments on challenging Fishyscapes and Road Anomaly benchmarks, demonstrating that without any auxiliary data or synthetic models, our method can still achieves competitive performance to other SOTA schemes. ",
    "url": "https://arxiv.org/abs/2302.06815",
    "authors": [
      "Yuanpeng Tu",
      "Yuxi Li",
      "Boshen Zhang",
      "Liang Liu",
      "Jiangning Zhang",
      "Yabiao Wang",
      "Chengjie Wang",
      "Cai Rong Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06827",
    "title": "B-BACN: Bayesian Boundary-Aware Convolutional Network for Defect  Characterization",
    "abstract": "Detecting accurate crack boundaries is important for condition monitoring, prognostics, and maintenance scheduling. In this work, we propose a Bayesian Boundary-Aware Convolutional Network (B-BACN) to tackle this problem, that emphasizes the importance of both uncertainty quantification and boundary refinement for producing accurate and trustworthy detections of defect boundaries. We formulate the inspection model using multi-task learning. The epistemic uncertainty is learned using Monte Carlo Dropout, and the model also learns to predict each samples aleatoric uncertainty. A boundary refinement loss is added to improve the determination of defect boundaries. Experimental results demonstrate the effectiveness of the proposed method in accurately identifying crack boundaries, reducing misclassification and enhancing model calibration. ",
    "url": "https://arxiv.org/abs/2302.06827",
    "authors": [
      "Rahul Rathnakumar",
      "Yutian Pang",
      "Yongming Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.06834",
    "title": "Improved Regret Bounds for Linear Adversarial MDPs via Linear  Optimization",
    "abstract": "Learning Markov decision processes (MDP) in an adversarial environment has been a challenging problem. The problem becomes even more challenging with function approximation, since the underlying structure of the loss function and transition kernel are especially hard to estimate in a varying environment. In fact, the state-of-the-art results for linear adversarial MDP achieve a regret of $\\tilde{O}(K^{6/7})$ ($K$ denotes the number of episodes), which admits a large room for improvement. In this paper, we investigate the problem with a new view, which reduces linear MDP into linear optimization by subtly setting the feature maps of the bandit arms of linear optimization. This new technique, under an exploratory assumption, yields an improved bound of $\\tilde{O}(K^{4/5})$ for linear adversarial MDP without access to a transition simulator. The new view could be of independent interest for solving other MDP problems that possess a linear structure. ",
    "url": "https://arxiv.org/abs/2302.06834",
    "authors": [
      "Fang Kong",
      "Xiangcheng Zhang",
      "Baoxiang Wang",
      "Shuai Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.06846",
    "title": "Scheduling Coflows for Minimizing the Makespan in Identical Parallel  Networks",
    "abstract": "With the development of technology, parallel computing applications have been commonly executed in large data centers. These parallel computing applications include the computation phase and communication phase, and work is completed by repeatedly executing these two phases. However, due to the ever-increasing computing demands, large data centers are burdened with massive communication demands. Coflow is a recently proposed networking abstraction to capture communication patterns in data-parallel computing frameworks. This paper focuses on the coflow scheduling problem in identical parallel networks, where the goal is to minimize makespan, the maximum completion time of coflows. The coflow scheduling problem in huge data center is considered one of the most significant $NP$-hard problems. In this paper, coflow can be considered as either a divisible or an indivisible case. Distinct flows in a divisible coflow can be transferred through different network cores, while those in an indivisible coflow can only be transferred through the same network core. In the divisible coflow scheduling problem, this paper proposes a $(3-\\tfrac{2}{m})$-approximation algorithm, and a $(\\tfrac{8}{3}-\\tfrac{2}{3m})$-approximation algorithm, where $m$ is the number of network cores. In the indivisible coflow scheduling problem, this paper proposes a $(2m)$-approximation algorithm. Finally, we simulate our proposed algorithm and Weaver's [Huang \\textit{et al.}, In 2020 IEEE International Parallel and Distributed Processing Symposium (IPDPS), pages 1071-1081, 2020.] and compare the performance of our algorithms with that of Weaver's. ",
    "url": "https://arxiv.org/abs/2302.06846",
    "authors": [
      "Jun Chen",
      "Chi-Yeh Chen"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2302.06848",
    "title": "YOWOv2: A Stronger yet Efficient Multi-level Detection Framework for  Real-time Spatio-temporal Action Detection",
    "abstract": "Designing a real-time framework for the spatio-temporal action detection task is still a challenge. In this paper, we propose a novel real-time action detection framework, YOWOv2. In this new framework, YOWOv2 takes advantage of both the 3D backbone and 2D backbone for accurate action detection. A multi-level detection pipeline is designed to detect action instances of different scales. To achieve this goal, we carefully build a simple and efficient 2D backbone with a feature pyramid network to extract different levels of classification features and regression features. For the 3D backbone, we adopt the existing efficient 3D CNN to save development time. By combining 3D backbones and 2D backbones of different sizes, we design a YOWOv2 family including YOWOv2-Tiny, YOWOv2-Medium, and YOWOv2-Large. We also introduce the popular dynamic label assignment strategy and anchor-free mechanism to make the YOWOv2 consistent with the advanced model architecture design. With our improvement, YOWOv2 is significantly superior to YOWO, and can still keep real-time detection. Without any bells and whistles, YOWOv2 achieves 87.0 % frame mAP and 52.8 % video mAP with over 20 FPS on the UCF101-24. On the AVA, YOWOv2 achieves 21.7 % frame mAP with over 20 FPS. Our code is available on https://github.com/yjh0410/YOWOv2. ",
    "url": "https://arxiv.org/abs/2302.06848",
    "authors": [
      "Jianhua Yang",
      "Kun Dai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06854",
    "title": "Large-Scale Knowledge Synthesis and Complex Information Retrieval from  Biomedical Documents",
    "abstract": "Recent advances in the healthcare industry have led to an abundance of unstructured data, making it challenging to perform tasks such as efficient and accurate information retrieval at scale. Our work offers an all-in-one scalable solution for extracting and exploring complex information from large-scale research documents, which would otherwise be tedious. First, we briefly explain our knowledge synthesis process to extract helpful information from unstructured text data of research documents. Then, on top of the knowledge extracted from the documents, we perform complex information retrieval using three major components- Paragraph Retrieval, Triplet Retrieval from Knowledge Graphs, and Complex Question Answering (QA). These components combine lexical and semantic-based methods to retrieve paragraphs and triplets and perform faceted refinement for filtering these search results. The complexity of biomedical queries and documents necessitates using a QA system capable of handling queries more complex than factoid queries, which we evaluate qualitatively on the COVID-19 Open Research Dataset (CORD-19) to demonstrate the effectiveness and value-add. ",
    "url": "https://arxiv.org/abs/2302.06854",
    "authors": [
      "Shreya Saxena",
      "Raj Sangani",
      "Siva Prasad",
      "Shubham Kumar",
      "Mihir Athale",
      "Rohan Awhad",
      "Vishal Vaddina"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.06860",
    "title": "BLIAM: Literature-based Data Synthesis for Synergistic Drug Combination  Prediction",
    "abstract": "Language models pre-trained on scientific literature corpora have substantially advanced scientific discovery by offering high-quality feature representations for downstream applications. However, these features are often not interpretable, and thus can reveal limited insights to domain experts. Instead of obtaining features from language models, we propose BLIAM, a literature-based data synthesis approach to directly generate training data points that are interpretable and model-agnostic to downstream applications. The key idea of BLIAM is to create prompts using existing training data and then use these prompts to synthesize new data points. BLIAM performs these two steps iteratively as new data points will define more informative prompts and new prompts will in turn synthesize more accurate data points. Notably, literature-based data augmentation might introduce data leakage since labels of test data points in downstream applications might have already been mentioned in the language model corpus. To prevent such leakage, we introduce GDSC-combo, a large-scale drug combination discovery dataset that was published after the biomedical language model was trained. We found that BLIAM substantially outperforms a non-augmented approach and manual prompting in this rigorous data split setting. BLIAM can be further used to synthesize data points for novel drugs and cell lines that were not even measured in biomedical experiments. In addition to the promising prediction performance, the data points synthesized by BLIAM are interpretable and model-agnostic, enabling in silico augmentation for in vitro experiments. ",
    "url": "https://arxiv.org/abs/2302.06860",
    "authors": [
      "Cai Yang",
      "Addie Woicik",
      "Hoifung Poon",
      "Sheng Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.06874",
    "title": "Robust Representation Learning with Self-Distillation for Domain  Generalization",
    "abstract": "Domain generalization is a challenging problem in machine learning, where the goal is to train a model that can generalize well to unseen target domains without prior knowledge of these domains. Despite the recent success of deep neural networks, there remains a lack of effective methods for domain generalization using vision transformers. In this paper, we propose a novel domain generalization technique called Robust Representation Learning with Self-Distillation (RRLD) that utilizes a combination of i) intermediate-block self-distillation and ii) augmentation-guided self-distillation to improve the generalization capabilities of transformer-based models on unseen domains. This approach enables the network to learn robust and general features that are invariant to different augmentations and domain shifts while effectively mitigating overfitting to source domains. To evaluate the effectiveness of our proposed method, we perform extensive experiments on PACS [1] and OfficeHome [2] benchmark datasets, as well as a real-world wafer semiconductor defect dataset [3]. Our results demonstrate that RRLD achieves robust and accurate generalization performance. We observe an improvement in the range of 0.3% to 2.3% over the state-of-the-art on the three datasets. ",
    "url": "https://arxiv.org/abs/2302.06874",
    "authors": [
      "Ankur Singh",
      "Senthilnath Jayavelu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06878",
    "title": "Distributed Symmetry Breaking on Power Graphs via Sparsification",
    "abstract": "In this paper, we present efficient distributed algorithms for classical symmetry breaking problems, maximal independent sets (MIS) and ruling sets, in power graphs. We work in the standard CONGEST model of distributed message passing, where the communication network is abstracted as a graph $G$. Typically, the problem instance in CONGEST is identical to the communication network $G$, that is, we perform the symmetry breaking in $G$. In this work, we consider a setting where the problem instance corresponds to a power graph $G^k$, where each node of the communication network $G$ is connected to all of its $k$-hop neighbors. Our main contribution is a deterministic polylogarithmic time algorithm for computing $k$-ruling sets of $G^k$, which (for $k>1$) improves exponentially on the current state-of-the-art runtimes. The main technical ingredient for this result is a deterministic sparsification procedure which may be of independent interest. On top of being a natural family of problems, ruling sets (in power graphs) are well-motivated through their applications in the powerful shattering framework [BEPS JACM'16, Ghaffari SODA'19] (and others). We present randomized algorithms for computing maximal independent sets and ruling sets of $G^k$ in essentially the same time as they can be computed in $G$. We also revisit the shattering algorithm for MIS [BEPS JACM'16] and present different approaches for the post-shattering phase. Our solutions are algorithmically and analytically simpler (also in the LOCAL model) than existing solutions and obtain the same runtime as [Ghaffari SODA'16]. ",
    "url": "https://arxiv.org/abs/2302.06878",
    "authors": [
      "Yannic Maus",
      "Saku Peltonen",
      "Jara Uitto"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2302.06895",
    "title": "SpeckleNN: A unified embedding for real-time speckle pattern  classification in X-ray single-particle imaging with limited labeled examples",
    "abstract": "With X-ray free-electron lasers (XFELs), it is possible to determine the three-dimensional structure of noncrystalline nanoscale particles using X-ray single-particle imaging (SPI) techniques at room temperature. Classifying SPI scattering patterns, or \"speckles\", to extract single hits that are needed for real-time vetoing and three-dimensional reconstruction poses a challenge for high data rate facilities like European XFEL and LCLS-II-HE. Here, we introduce SpeckleNN, a unified embedding model for real-time speckle pattern classification with limited labeled examples that can scale linearly with dataset size. Trained with twin neural networks, SpeckleNN maps speckle patterns to a unified embedding vector space, where similarity is measured by Euclidean distance. We highlight its few-shot classification capability on new never-seen samples and its robust performance despite only tens of labels per classification category even in the presence of substantial missing detector areas. Without the need for excessive manual labeling or even a full detector image, our classification method offers a great solution for real-time high-throughput SPI experiments. ",
    "url": "https://arxiv.org/abs/2302.06895",
    "authors": [
      "Cong Wang",
      "Eric Florin",
      "Hsing-Yin Chang",
      "Jana Thayer",
      "Chun Hong Yoon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.06896",
    "title": "Message Passing Meets Graph Neural Networks: A New Paradigm for Massive  MIMO Systems",
    "abstract": "As one of the core technologies for 5G systems, massive multiple-input multiple-output (MIMO) introduces dramatic capacity improvements along with very high beamforming and spatial multiplexing gains. When developing efficient physical layer algorithms for massive MIMO systems, message passing is one promising candidate owing to the superior performance. However, as their computational complexity increases dramatically with the problem size, the state-of-the-art message passing algorithms cannot be directly applied to future 6G systems, where an exceedingly large number of antennas are expected to be deployed. To address this issue, we propose a model-driven deep learning (DL) framework, namely the AMP-GNN for massive MIMO transceiver design, by considering the low complexity of the AMP algorithm and adaptability of GNNs. Specifically, the structure of the AMP-GNN network is customized by unfolding the approximate message passing (AMP) algorithm and introducing a graph neural network (GNN) module into it. The permutation equivariance property of AMP-GNN is proved, which enables the AMP-GNN to learn more efficiently and to adapt to different numbers of users. We also reveal the underlying reason why GNNs improve the AMP algorithm from the perspective of expectation propagation, which motivates us to amalgamate various GNNs with different message passing algorithms. In the simulation, we take the massive MIMO detection to exemplify that the proposed AMP-GNN significantly improves the performance of the AMP detector, achieves comparable performance as the state-of-the-art DL-based MIMO detectors, and presents strong robustness to various mismatches. ",
    "url": "https://arxiv.org/abs/2302.06896",
    "authors": [
      "Hengtao He",
      "Xianghao Yu",
      "Jun Zhang",
      "Shenghui Song",
      "Khaled B. Letaief"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2302.06900",
    "title": "Over-Sampling Strategy in Feature Space for Graphs based  Class-imbalanced Bot Detection",
    "abstract": "The presence of a large number of bots in Online Social Networks (OSN) leads to undesirable social effects. Graph neural networks (GNNs) have achieved state-of-the-art performance in bot detection since they can effectively utilize user interaction. In most scenarios, the distribution of bots and humans is imbalanced, resulting in under-represent minority class samples and sub-optimal performance. However, previous GNN-based methods for bot detection seldom consider the impact of class-imbalanced issues. In this paper, we propose an over-sampling strategy for GNN (OS-GNN) that can mitigate the effect of class imbalance in bot detection. Compared with previous over-sampling methods for GNNs, OS-GNN does not call for edge synthesis, eliminating the noise inevitably introduced during the edge construction. Specifically, node features are first mapped to a feature space through neighborhood aggregation and then generated samples for the minority class in the feature space. Finally, the augmented features are fed into GNNs to train the classifiers. This framework is general and can be easily extended into different GNN architectures. The proposed framework is evaluated using three real-world bot detection benchmark datasets, and it consistently exhibits superiority over the baselines. ",
    "url": "https://arxiv.org/abs/2302.06900",
    "authors": [
      "Shuhao Shi",
      "Kai Qiao",
      "Jie Yang",
      "Baojie Song",
      "Jian Chen",
      "Bin Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06912",
    "title": "Robust Deep Reinforcement Learning through Regret Neighborhoods",
    "abstract": "Deep Reinforcement Learning (DRL) policies have been shown to be vulnerable to small adversarial noise in observations. Such adversarial noise can have disastrous consequences in safety-critical environments. For instance, a self-driving car receiving adversarially perturbed sensory observations about nearby signs (e.g., a stop sign physically altered to be perceived as a speed limit sign) or objects (e.g., cars altered to be recognized as trees) can be fatal. Existing approaches for making RL algorithms robust to an observation-perturbing adversary have focused on reactive approaches that iteratively improve against adversarial examples generated at each iteration. While such approaches have been shown to provide improvements over regular RL methods, they are reactive and can fare significantly worse if certain categories of adversarial examples are not generated during training. To that end, we pursue a more proactive approach that relies on directly optimizing a well-studied robustness measure, regret instead of expected value. We provide a principled approach that minimizes maximum regret over a \"neighborhood\" of observations to the received \"observation\". Our regret criterion can be used to modify existing value- and policy-based Deep RL methods. We demonstrate that our approaches provide a significant improvement in performance across a wide variety of benchmarks against leading approaches for robust Deep RL. ",
    "url": "https://arxiv.org/abs/2302.06912",
    "authors": [
      "Roman Belaire",
      "Pradeep Varakantham",
      "David Lo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.06914",
    "title": "Heterogeneous Anomaly Detection for Software Systems via Semi-supervised  Cross-modal Attention",
    "abstract": "Prompt and accurate detection of system anomalies is essential to ensure the reliability of software systems. Unlike manual efforts that exploit all available run-time information, existing approaches usually leverage only a single type of monitoring data (often logs or metrics) or fail to make effective use of the joint information among different types of data. Consequently, many false predictions occur. To better understand the manifestations of system anomalies, we conduct a systematical study on a large amount of heterogeneous data, i.e., logs and metrics. Our study demonstrates that logs and metrics can manifest system anomalies collaboratively and complementarily, and neither of them only is sufficient. Thus, integrating heterogeneous data can help recover the complete picture of a system's health status. In this context, we propose Hades, the first end-to-end semi-supervised approach to effectively identify system anomalies based on heterogeneous data. Our approach employs a hierarchical architecture to learn a global representation of the system status by fusing log semantics and metric patterns. It captures discriminative features and meaningful interactions from heterogeneous data via a cross-modal attention module, trained in a semi-supervised manner. We evaluate Hades extensively on large-scale simulated data and datasets from Huawei Cloud. The experimental results present the effectiveness of our model in detecting system anomalies. We also release the code and the annotated dataset for replication and future research. ",
    "url": "https://arxiv.org/abs/2302.06914",
    "authors": [
      "Cheryl Lee",
      "Tianyi Yang",
      "Zhuangbin Chen",
      "Yuxin Su",
      "Yongqiang Yang",
      "Michael R. Lyu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.06923",
    "title": "Do Neural Networks Generalize from Self-Averaging Sub-classifiers in the  Same Way As Adaptive Boosting?",
    "abstract": "In recent years, neural networks (NNs) have made giant leaps in a wide variety of domains. NNs are often referred to as black box algorithms due to how little we can explain their empirical success. Our foundational research seeks to explain why neural networks generalize. A recent advancement derived a mutual information measure for explaining the performance of deep NNs through a sequence of increasingly complex functions. We show deep NNs learn a series of boosted classifiers whose generalization is popularly attributed to self-averaging over an increasing number of interpolating sub-classifiers. To our knowledge, we are the first authors to establish the connection between generalization in boosted classifiers and generalization in deep NNs. Our experimental evidence and theoretical analysis suggest NNs trained with dropout exhibit similar self-averaging behavior over interpolating sub-classifiers as cited in popular explanations for the post-interpolation generalization phenomenon in boosting. ",
    "url": "https://arxiv.org/abs/2302.06923",
    "authors": [
      "Michael Sun",
      "Peter Chatain"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.06933",
    "title": "Evaluation of Link Traversal Query Execution over Decentralized  Environments with Structural Assumptions",
    "abstract": "To counter societal and economic problems caused by data silos on the Web, efforts such as Solid strive to reclaim private data by storing it in permissioned documents over a large number of personal vaults across the Web. Building applications on top of such a decentralized Knowledge Graph involves significant technical challenges: centralized aggregation prior to query processing is excluded for legal reasons, and current federated querying techniques cannot handle this large scale of distribution at the expected performance. We propose an extension to Link Traversal Query Processing (LTQP) that incorporates structural properties within decentralized environments to tackle their unprecedented scale. In this article, we analyze the structural properties of the Solid decentralization ecosystem that are relevant for query execution, and provide the SolidBench benchmark to simulate Solid environments representatively. We introduce novel LTQP algorithms leveraging these structural properties, and evaluate their effectiveness. Our experiments indicate that these new algorithms obtain accurate results in the order of seconds for non-complex queries, which existing algorithms cannot achieve. Furthermore, we discuss limitations with respect to more complex queries. This work reveals that a traversal-based querying method using structural assumptions can be effective for large-scale decentralization, but that advances are needed in the area of query planning for LTQP to handle more complex queries. These insights open the door to query-driven decentralized applications, in which declarative queries shield developers from the inherent complexity of a decentralized landscape. ",
    "url": "https://arxiv.org/abs/2302.06933",
    "authors": [
      "Ruben Taelman",
      "Ruben Verborgh"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2302.06939",
    "title": "Underwater target detection based on improved YOLOv7",
    "abstract": "Underwater target detection is a crucial aspect of ocean exploration. However, conventional underwater target detection methods face several challenges such as inaccurate feature extraction, slow detection speed and lack of robustness in complex underwater environments. To address these limitations, this study proposes an improved YOLOv7 network (YOLOv7-AC) for underwater target detection. The proposed network utilizes an ACmixBlock module to replace the 3x3 convolution block in the E-ELAN structure, and incorporates jump connections and 1x1 convolution architecture between ACmixBlock modules to improve feature extraction and network reasoning speed. Additionally, a ResNet-ACmix module is designed to avoid feature information loss and reduce computation, while a Global Attention Mechanism (GAM) is inserted in the backbone and head parts of the model to improve feature extraction. Furthermore, the K-means++ algorithm is used instead of K-means to obtain anchor boxes and enhance model accuracy. Experimental results show that the improved YOLOv7 network outperforms the original YOLOv7 model and other popular underwater target detection methods. The proposed network achieved a mean average precision (mAP) value of 89.6% and 97.4% on the URPC dataset and Brackish dataset, respectively, and demonstrated a higher frame per second (FPS) compared to the original YOLOv7 model. The source code for this study is publicly available at https://github.com/NZWANG/YOLOV7-AC. In conclusion, the improved YOLOv7 network proposed in this study represents a promising solution for underwater target detection and holds great potential for practical applications in various underwater tasks. ",
    "url": "https://arxiv.org/abs/2302.06939",
    "authors": [
      "Kaiyue Liu",
      "Qi Sun",
      "Daming Sun",
      "Mengduo Yang",
      "Nizhuan Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06942",
    "title": "Exploring Category Structure with Contextual Language Models and Lexical  Semantic Networks",
    "abstract": "Recent work on predicting category structure with distributional models, using either static word embeddings (Heyman and Heyman, 2019) or contextualized language models (CLMs) (Misra et al., 2021), report low correlations with human ratings, thus calling into question their plausibility as models of human semantic memory. In this work, we revisit this question testing a wider array of methods for probing CLMs for predicting typicality scores. Our experiments, using BERT (Devlin et al., 2018), show the importance of using the right type of CLM probes, as our best BERT-based typicality prediction methods substantially improve over previous works. Second, our results highlight the importance of polysemy in this task: our best results are obtained when using a disambiguation mechanism. Finally, additional experiments reveal that Information Contentbased WordNet (Miller, 1995), also endowed with disambiguation, match the performance of the best BERT-based method, and in fact capture complementary information, which can be combined with BERT to achieve enhanced typicality predictions. ",
    "url": "https://arxiv.org/abs/2302.06942",
    "authors": [
      "Joseph Renner",
      "Pascal Denis",
      "Rémi Gilleron",
      "Angèle Brunellière"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.06949",
    "title": "Camera Calibration without Camera Access -- A Robust Validation  Technique for Extended PnP Methods",
    "abstract": "A challenge in image based metrology and forensics is intrinsic camera calibration when the used camera is unavailable. The unavailability raises two questions. The first question is how to find the projection model that describes the camera, and the second is to detect incorrect models. In this work, we use off-the-shelf extended PnP-methods to find the model from 2D-3D correspondences, and propose a method for model validation. The most common strategy for evaluating a projection model is comparing different models' residual variances - however, this naive strategy cannot distinguish whether the projection model is potentially underfitted or overfitted. To this end, we model the residual errors for each correspondence, individually scale all residuals using a predicted variance and test if the new residuals are drawn from a standard normal distribution. We demonstrate the effectiveness of our proposed validation in experiments on synthetic data, simulating 2D detection and Lidar measurements. Additionally, we provide experiments using data from an actual scene and compare non-camera access and camera access calibrations. Last, we use our method to validate annotations in MegaDepth. ",
    "url": "https://arxiv.org/abs/2302.06949",
    "authors": [
      "Emil Brissman",
      "Per-Erik Forssén",
      "Johan Edstedt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06953",
    "title": "A Bandit Approach to Online Pricing for Heterogeneous Edge Resource  Allocation",
    "abstract": "Edge Computing (EC) offers a superior user experience by positioning cloud resources in close proximity to end users. The challenge of allocating edge resources efficiently while maximizing profit for the EC platform remains a sophisticated problem, especially with the added complexity of the online arrival of resource requests. To address this challenge, we propose to cast the problem as a multi-armed bandit problem and develop two novel online pricing mechanisms, the Kullback-Leibler Upper Confidence Bound (KL-UCB) algorithm and the Min-Max Optimal algorithm, for heterogeneous edge resource allocation. These mechanisms operate in real-time and do not require prior knowledge of demand distribution, which can be difficult to obtain in practice. The proposed posted pricing schemes allow users to select and pay for their preferred resources, with the platform dynamically adjusting resource prices based on observed historical data. Numerical results show the advantages of the proposed mechanisms compared to several benchmark schemes derived from traditional bandit algorithms, including the Epsilon-Greedy, basic UCB, and Thompson Sampling algorithms. ",
    "url": "https://arxiv.org/abs/2302.06953",
    "authors": [
      "Jiaming Cheng",
      "Duong Thuy Anh Nguyen",
      "Lele Wang",
      "Duong Tung Nguyen",
      "Vijay K. Bhargava"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.06967",
    "title": "Effects of Locality and Rule Language on Explanations for Knowledge  Graph Embeddings",
    "abstract": "Knowledge graphs (KGs) are key tools in many AI-related tasks such as reasoning or question answering. This has, in turn, propelled research in link prediction in KGs, the task of predicting missing relationships from the available knowledge. Solutions based on KG embeddings have shown promising results in this matter. On the downside, these approaches are usually unable to explain their predictions. While some works have proposed to compute post-hoc rule explanations for embedding-based link predictors, these efforts have mostly resorted to rules with unbounded atoms, e.g., bornIn(x,y) => residence(x,y), learned on a global scope, i.e., the entire KG. None of these works has considered the impact of rules with bounded atoms such as nationality(x,England) => speaks(x, English), or the impact of learning from regions of the KG, i.e., local scopes. We therefore study the effects of these factors on the quality of rule-based explanations for embedding-based link predictors. Our results suggest that more specific rules and local scopes can improve the accuracy of the explanations. Moreover, these rules can provide further insights about the inner-workings of KG embeddings for link prediction. ",
    "url": "https://arxiv.org/abs/2302.06967",
    "authors": [
      "Luis Galárraga"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.06975",
    "title": "A Review of the Role of Causality in Developing Trustworthy AI Systems",
    "abstract": "State-of-the-art AI models largely lack an understanding of the cause-effect relationship that governs human understanding of the real world. Consequently, these models do not generalize to unseen data, often produce unfair results, and are difficult to interpret. This has led to efforts to improve the trustworthiness aspects of AI models. Recently, causal modeling and inference methods have emerged as powerful tools. This review aims to provide the reader with an overview of causal methods that have been developed to improve the trustworthiness of AI models. We hope that our contribution will motivate future research on causality-based solutions for trustworthy AI. ",
    "url": "https://arxiv.org/abs/2302.06975",
    "authors": [
      "Niloy Ganguly",
      "Dren Fazlija",
      "Maryam Badar",
      "Marco Fisichella",
      "Sandipan Sikdar",
      "Johanna Schrader",
      "Jonas Wallat",
      "Koustav Rudra",
      "Manolis Koubarakis",
      "Gourab K. Patro",
      "Wadhah Zai El Amri",
      "Wolfgang Nejdl"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.06980",
    "title": "Deep Learning-Based Modeling of 5G Core Control Plane for 5G Network  Digital Twin",
    "abstract": "Digital twin is a key enabler to facilitate the development and implementation of new technologies in 5G and beyond networks. However, the complex structure and diverse functions of the current 5G core network, especially the control plane, lead to difficulties in building the core network of the digital twin. In this paper, we propose two novel data-driven architectures for modeling the 5G control plane and implement corresponding deep learning models, namely 5GC-Seq2Seq and 5GC-former, based on the Vanilla Seq2Seq model and Transformer decoder respectively. To train and test models, we also present a solution that allows the signaling messages to be interconverted with vectors, which can be utilized in dataset construction. The experiments are based on 5G core network signaling data collected by the Spirent C50 network tester, including various procedures related to registration, handover, PDU sessions, etc. Our results show that 5GC-Seq2Seq achieves over 99.98% F1-score (A metric to measure the accuracy of positive samples) with a relatively simple structure, while 5GC-former attains higher than 99.998% F1-score by establishing a more complex and highly parallel model, indicating that the method proposed in this paper reproduces the major functions of the core network control plane in 5G digital twin with high accuracy. ",
    "url": "https://arxiv.org/abs/2302.06980",
    "authors": [
      "Zhenyu Tao",
      "Yongliang Guo",
      "Guanghui He",
      "Yongming Huang",
      "Xiaohu You"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.07014",
    "title": "A Data Mining Approach for Detecting Collusion in Unproctored Online  Exams",
    "abstract": "Due to the precautionary measures during the COVID-19 pandemic many universities offered unproctored take-home exams. We propose methods to detect potential collusion between students and apply our approach on event log data from take-home exams during the pandemic. We find groups of students with suspiciously similar exams. In addition, we compare our findings to a proctored control group. By this, we establish a rule of thumb for evaluating which cases are \"outstandingly similar\", i.e., suspicious cases. ",
    "url": "https://arxiv.org/abs/2302.07014",
    "authors": [
      "Janine Langerbein",
      "Till Massing",
      "Jens Klenke",
      "Natalie Reckmann",
      "Michael Striewe",
      "Michael Goedicke",
      "Christoph Hanck"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07025",
    "title": "Optimal Transport for Change Detection on LiDAR Point Clouds",
    "abstract": "The detection of changes occurring in multi-temporal remote sensing data plays a crucial role in monitoring several aspects of real life, such as disasters, deforestation, and urban planning. In the latter context, identifying both newly built and demolished buildings is essential to help landscape and city managers to promote sustainable development. While the use of airborne LiDAR point clouds has become widespread in urban change detection, the most common approaches require the transformation of a point cloud into a regular grid of interpolated height measurements, i.e. Digital Elevation Model (DEM). However, the DEM's interpolation step causes an information loss related to the height of the objects, affecting the detection capability of building changes, where the high resolution of LiDAR point clouds in the third dimension would be the most beneficial. Notwithstanding recent attempts to detect changes directly on point clouds using either a distance-based computation method or a semantic segmentation pre-processing step, only the M3C2 distance computation-based approach can identify both positive and negative changes, which is of paramount importance in urban planning. Motivated by the previous arguments, we introduce a principled change detection pipeline, based on optimal transport, capable of distinguishing between newly built buildings (positive changes) and demolished ones (negative changes). In this work, we propose to use unbalanced optimal transport to cope with the creation and destruction of mass related to building changes occurring in a bi-temporal pair of LiDAR point clouds. We demonstrate the efficacy of our approach on the only publicly available airborne LiDAR dataset for change detection by showing superior performance over the M3C2 and the previous optimal transport-based method presented by Nicolas Courty et al.at IGARSS 2016. ",
    "url": "https://arxiv.org/abs/2302.07025",
    "authors": [
      "Marco Fiorucci",
      "Peter Naylor",
      "Makoto Yamada"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2302.07033",
    "title": "Model Checking Disjoint-Paths Logic on Topological-Minor-Free Graph  Classes",
    "abstract": "Disjoint-paths logic, denoted FO+DP, extends first-order logic (FO) with atomic predicates dp_k[(x_1,y_1),...,(x_k,y_k)], expressing the existence of internally vertex-disjoint paths between x_i and y_i, for 1<=i<=k. We prove that for every graph class excluding some fixed graph as a topological minor, the model checking problem for FO+DP is fixed-parameter tractable. This essentially settles the question of tractable model checking for this logic on subgraph-closed classes, since the problem is hard on subgraph-closed classes not excluding a topological minor (assuming a further mild condition of efficiency of encoding). ",
    "url": "https://arxiv.org/abs/2302.07033",
    "authors": [
      "Nicole Schirrmacher",
      "Sebastian Siebertz",
      "Giannos Stamoulis",
      "Dimitrios M. Thilikos",
      "Alexandre Vigny"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2302.07051",
    "title": "Adversarial Path Planning for Optimal Camera Positioning",
    "abstract": "The use of visual sensors is flourishing, driven among others by the several applications in detection and prevention of crimes or dangerous events. While the problem of optimal camera placement for total coverage has been solved for a decade or so, that of the arrangement of cameras maximizing the recognition of objects \"in-transit\" is still open. The objective of this paper is to attack this problem by providing an adversarial method of proven optimality based on the resolution of Hamilton-Jacobi equations. The problem is attacked by first assuming the perspective of an adversary, i.e. computing explicitly the path minimizing the probability of detection and the quality of reconstruction. Building on this result, we introduce an optimality measure for camera configurations and perform a simulated annealing algorithm to find the optimal camera placement. ",
    "url": "https://arxiv.org/abs/2302.07051",
    "authors": [
      "Gaia Carenini",
      "Alexandre Duplessis"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.07055",
    "title": "Developer-Intent Driven Code Comment Generation",
    "abstract": "Existing automatic code comment generators mainly focus on producing a general description of functionality for a given code snippet without considering developer intentions. However, in real-world practice, comments are complicated, which often contain information reflecting various intentions of developers, e.g., functionality summarization, design rationale, implementation details, code properties, etc. To bridge the gap between automatic code comment generation and real-world comment practice, we define Developer-Intent Driven Code Comment Generation, which can generate intent-aware comments for the same source code with different intents. To tackle this challenging task, we propose DOME, an approach that utilizes Intent-guided Selective Attention to explicitly select intent-relevant information from the source code, and produces various comments reflecting different intents. Our approach is evaluated on two real-world Java datasets, and the experimental results show that our approach outperforms the state-of-the-art baselines. A human evaluation also confirms the significant potential of applying DOME in practical usage, enabling developers to comment code effectively according to their own needs. ",
    "url": "https://arxiv.org/abs/2302.07055",
    "authors": [
      "Fangwen Mu",
      "Xiao Chen",
      "Lin Shi",
      "Song Wang",
      "Qing Wang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2302.07072",
    "title": "Differential privacy diffusion auction of homogeneous items",
    "abstract": "Diffusion auction refers to an emerging paradigm of online marketplace where an auctioneer utilises a social network to attract potential buyers. Diffusion auction poses significant privacy risks. From the auction outcome, it is possible to infer hidden, and potentially sensitive, preferences of buyers. To mitigate such risks, we initiate the study of differential privacy (DP) in diffusion auction mechanisms. DP is a well-established notion of privacy that protects a system against inference attacks. Achieving DP in diffusion auctions is non-trivial as the well-designed auction rules are required to incentivise the buyers to truthfully report their neighbourhood. We study the single-unit case and design two differentially private diffusion mechanisms (DPDMs): recursive DPDM and layered DPDM. We prove that these mechanisms guarantee differential privacy, incentive compatibility and individual rationality for both valuations and neighbourhood. We then empirically compare their performance on real and synthetic datasets. ",
    "url": "https://arxiv.org/abs/2302.07072",
    "authors": [
      "Fengjuan Jia",
      "Mengxiao Zhang",
      "Jiamou Liu",
      "Bakh Khoussainov"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2302.07084",
    "title": "Towards Lightweight and Automated Representation Learning System for  Networks",
    "abstract": "We propose LIGHTNE 2.0, a cost-effective, scalable, automated, and high-quality network embedding system that scales to graphs with hundreds of billions of edges on a single machine. In contrast to the mainstream belief that distributed architecture and GPUs are needed for large-scale network embedding with good quality, we prove that we can achieve higher quality, better scalability, lower cost, and faster runtime with shared-memory, CPU-only architecture. LIGHTNE 2.0 combines two theoretically grounded embedding methods NetSMF and ProNE. We introduce the following techniques to network embedding for the first time: (1) a newly proposed downsampling method to reduce the sample complexity of NetSMF while preserving its theoretical advantages; (2) a high-performance parallel graph processing stack GBBS to achieve high memory efficiency and scalability; (3) sparse parallel hash table to aggregate and maintain the matrix sparsifier in memory; (4) a fast randomized singular value decomposition (SVD) enhanced by power iteration and fast orthonormalization to improve vanilla randomized SVD in terms of both efficiency and effectiveness; (5) Intel MKL for proposed fast randomized SVD and spectral propagation; and (6) a fast and lightweight AutoML library FLAML for automated hyperparameter tuning. Experimental results show that LIGHTNE 2.0 can be up to 84X faster than GraphVite, 30X faster than PBG and 9X faster than NetSMF while delivering better performance. LIGHTNE 2.0 can embed very large graph with 1.7 billion nodes and 124 billion edges in half an hour on a CPU server, while other baselines cannot handle very large graphs of this scale. ",
    "url": "https://arxiv.org/abs/2302.07084",
    "authors": [
      "Yuyang Xie",
      "Jiezhong Qiu",
      "Laxman Dhulipala",
      "Wenjian Yu",
      "Jie Tang",
      "Richard Peng",
      "Chi Wang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2302.07100",
    "title": "Leveraging Diversity in Software Engineering Education through Community  Engaged Learning and a Supportive Network",
    "abstract": "While a lack of diversity is a longstanding problem in computer science and engineering, universities and organizations continue to look for solutions to this issue. Among the first of its kind, we launched INSPIRE: STEM for Social Impact, a program at the University of Victoria, Canada, aimed to motivate and empower students from underrepresented groups in computer science and engineering to develop digital solutions for society impactful projects by engaging in experiential learning projects with identified community-partners. The twenty-four students in the program came from diverse backgrounds in terms of academic areas of study, genders, ethnicities, and levels of technical and educational experience. Working with six community partners, these students spent four months learning and developing solutions for a societal and/or environmental problem with potential for local and global impacts. Our experiences indicate that working in a diverse team with real clients on solving pressing issues produces a sense of competence, relatedness, and autonomy which are the basis of self-determination theory. Due to the unique structure of this program, the three principles of self-determination theory emerged through different experiences, ultimately motivating the students to build a network of like-minded people. The importance of such a network is profound in empowering students to succeed and, in retrospect, remain in software engineering fields. We address the diversity problem by providing diverse, underrepresented students with a safe and like-minded environment where they can learn and realize their full potential. Hence, in this paper, we describe the program design, experiences, and lessons learned from this approach. We also provide recommendations for universities and organizations that may want to adapt our approach. ",
    "url": "https://arxiv.org/abs/2302.07100",
    "authors": [
      "Nowshin Nawar Arony",
      "Kezia Devathasan",
      "Ze Shi Li",
      "Daniela Damian"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2302.07106",
    "title": "Normalizing Flow based Feature Synthesis for Outlier-Aware Object  Detection",
    "abstract": "Real-world deployment of reliable object detectors is crucial for applications such as autonomous driving. However, general-purpose object detectors like Faster R-CNN are prone to providing overconfident predictions for outlier objects. Recent outlier-aware object detection approaches estimate the density of instance-wide features with class-conditional Gaussians and train on synthesized outlier features from their low-likelihood regions. However, this strategy does not guarantee that the synthesized outlier features will have a low likelihood according to the other class-conditional Gaussians. We propose a novel outlier-aware object detection framework that learns to distinguish outliers from inlier objects by learning the joint data distribution of all inlier classes with an invertible normalizing flow. The flow model ensures that the synthesized outliers have a lower likelihood than inliers of all object classes, thereby modeling a better decision boundary between inlier and outlier objects. Our approach significantly outperforms the state-of-the-art for outlier-aware object detection on both image and video datasets. ",
    "url": "https://arxiv.org/abs/2302.07106",
    "authors": [
      "Nishant Kumar",
      "Siniša Šegvić",
      "Abouzar Eslami",
      "Stefan Gumhold"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.07109",
    "title": "Reachability-Based Confidence-Aware Probabilistic Collision Detection in  Highway Driving",
    "abstract": "Risk assessment is a crucial component of collision warning and avoidance systems in intelligent vehicles. To accurately detect potential vehicle collisions, reachability-based formal approaches have been developed to ensure driving safety, but suffer from over-conservatism, potentially leading to false-positive risk events in complicated real-world applications. In this work, we combine two reachability analysis techniques, i.e., backward reachable set (BRS) and stochastic forward reachable set (FRS), and propose an integrated probabilistic collision detection framework in highway driving. Within the framework, we can firstly use a BRS to formally check whether a two-vehicle interaction is safe; otherwise, a prediction-based stochastic FRS is employed to estimate a collision probability at each future time step. In doing so, the framework can not only identify non-risky events with guaranteed safety, but also provide accurate collision risk estimation in safety-critical events. To construct the stochastic FRS, we develop a neural network-based acceleration model for surrounding vehicles, and further incorporate confidence-aware dynamic belief to improve the prediction accuracy. Extensive experiments are conducted to validate the performance of the acceleration prediction model based on naturalistic highway driving data, and the efficiency and effectiveness of the framework with the infused confidence belief are tested both in naturalistic and simulated highway scenarios. The proposed risk assessment framework is promising in real-world applications. ",
    "url": "https://arxiv.org/abs/2302.07109",
    "authors": [
      "Xinwei Wang",
      "Zirui Li",
      "Javier Alonso-Mora",
      "Meng Wang"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.07116",
    "title": "Team-DETR: Guide Queries as a Professional Team in Detection  Transformers",
    "abstract": "Recent proposed DETR variants have made tremendous progress in various scenarios due to their streamlined processes and remarkable performance. However, the learned queries usually explore the global context to generate the final set prediction, resulting in redundant burdens and unfaithful results. More specifically, a query is commonly responsible for objects of different scales and positions, which is a challenge for the query itself, and will cause spatial resource competition among queries. To alleviate this issue, we propose Team DETR, which leverages query collaboration and position constraints to embrace objects of interest more precisely. We also dynamically cater to each query member's prediction preference, offering the query better scale and spatial priors. In addition, the proposed Team DETR is flexible enough to be adapted to other existing DETR variants without increasing parameters and calculations. Extensive experiments on the COCO dataset show that Team DETR achieves remarkable gains, especially for small and large objects. Code is available at \\url{https://github.com/horrible-dong/TeamDETR}. ",
    "url": "https://arxiv.org/abs/2302.07116",
    "authors": [
      "Tian Qiu",
      "Linyun Zhou",
      "Wenxiang Xu",
      "Lechao Cheng",
      "Zunlei Feng",
      "Mingli Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.07120",
    "title": "PrefixMol: Target- and Chemistry-aware Molecule Design via Prefix  Embedding",
    "abstract": "Is there a unified model for generating molecules considering different conditions, such as binding pockets and chemical properties? Although target-aware generative models have made significant advances in drug design, they do not consider chemistry conditions and cannot guarantee the desired chemical properties. Unfortunately, merging the target-aware and chemical-aware models into a unified model to meet customized requirements may lead to the problem of negative transfer. Inspired by the success of multi-task learning in the NLP area, we use prefix embeddings to provide a novel generative model that considers both the targeted pocket's circumstances and a variety of chemical properties. All conditional information is represented as learnable features, which the generative model subsequently employs as a contextual prompt. Experiments show that our model exhibits good controllability in both single and multi-conditional molecular generation. The controllability enables us to outperform previous structure-based drug design methods. More interestingly, we open up the attention mechanism and reveal coupling relationships between conditions, providing guidance for multi-conditional molecule generation. ",
    "url": "https://arxiv.org/abs/2302.07120",
    "authors": [
      "Zhangyang Gao",
      "Yuqi Hu",
      "Cheng Tan",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2302.07139",
    "title": "Modeling Complex Event Scenarios via Simple Entity-focused Questions",
    "abstract": "Event scenarios are often complex and involve multiple event sequences connected through different entity participants. Exploring such complex scenarios requires an ability to branch through different sequences, something that is difficult to achieve with standard event language modeling. To address this, we propose a question-guided generation framework that models events in complex scenarios as answers to questions about participants. At any step in the generation process, the framework uses the previously generated events as context, but generates the next event as an answer to one of three questions: what else a participant did, what else happened to a participant, or what else happened. The participants and the questions themselves can be sampled or be provided as input from a user, allowing for controllable exploration. Our empirical evaluation shows that this question-guided generation provides better coverage of participants, diverse events within a domain, comparable perplexities for modeling event sequences, and more effective control for interactive schema generation. ",
    "url": "https://arxiv.org/abs/2302.07139",
    "authors": [
      "Mahnaz Koupaee",
      "Greg Durrett",
      "Nathanael Chambers",
      "Niranjan Balasubramanian"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.07145",
    "title": "Practical Cross-system Shilling Attacks with Limited Access to Data",
    "abstract": "In shilling attacks, an adversarial party injects a few fake user profiles into a Recommender System (RS) so that the target item can be promoted or demoted. Although much effort has been devoted to developing shilling attack methods, we find that existing approaches are still far from practical. In this paper, we analyze the properties a practical shilling attack method should have and propose a new concept of Cross-system Attack. With the idea of Cross-system Attack, we design a Practical Cross-system Shilling Attack (PC-Attack) framework that requires little information about the victim RS model and the target RS data for conducting attacks. PC-Attack is trained to capture graph topology knowledge from public RS data in a self-supervised manner. Then, it is fine-tuned on a small portion of target data that is easy to access to construct fake profiles. Extensive experiments have demonstrated the superiority of PC-Attack over state-of-the-art baselines. Our implementation of PC-Attack is available at https://github.com/KDEGroup/PC-Attack. ",
    "url": "https://arxiv.org/abs/2302.07145",
    "authors": [
      "Meifang Zeng",
      "Ke Li",
      "Bingchuan Jiang",
      "Liujuan Cao",
      "Hui Li"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.07155",
    "title": "EPISODE: Episodic Gradient Clipping with Periodic Resampled Corrections  for Federated Learning with Heterogeneous Data",
    "abstract": "Gradient clipping is an important technique for deep neural networks with exploding gradients, such as recurrent neural networks. Recent studies have shown that the loss functions of these networks do not satisfy the conventional smoothness condition, but instead satisfy a relaxed smoothness condition, i.e., the Lipschitz constant of the gradient scales linearly in terms of the gradient norm. Due to this observation, several gradient clipping algorithms have been developed for nonconvex and relaxed-smooth functions. However, the existing algorithms only apply to the single-machine or multiple-machine setting with homogeneous data across machines. It remains unclear how to design provably efficient gradient clipping algorithms in the general Federated Learning (FL) setting with heterogeneous data and limited communication rounds. In this paper, we design EPISODE, the very first algorithm to solve FL problems with heterogeneous data in the nonconvex and relaxed smoothness setting. The key ingredients of the algorithm are two new techniques called \\textit{episodic gradient clipping} and \\textit{periodic resampled corrections}. At the beginning of each round, EPISODE resamples stochastic gradients from each client and obtains the global averaged gradient, which is used to (1) determine whether to apply gradient clipping for the entire round and (2) construct local gradient corrections for each client. Notably, our algorithm and analysis provide a unified framework for both homogeneous and heterogeneous data under any noise level of the stochastic gradient, and it achieves state-of-the-art complexity results. In particular, we prove that EPISODE can achieve linear speedup in the number of machines, and it requires significantly fewer communication rounds. Experiments on several heterogeneous datasets show the superior performance of EPISODE over several strong baselines in FL. ",
    "url": "https://arxiv.org/abs/2302.07155",
    "authors": [
      "Michael Crawshaw",
      "Yajie Bao",
      "Mingrui Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2302.07162",
    "title": "Semiconductor Fab Scheduling with Self-Supervised and Reinforcement  Learning",
    "abstract": "Semiconductor manufacturing is a notoriously complex and costly multi-step process involving a long sequence of operations on expensive and quantity-limited equipment. Recent chip shortages and their impacts have highlighted the importance of semiconductors in the global supply chains and how reliant on those our daily lives are. Due to the investment cost, environmental impact, and time scale needed to build new factories, it is difficult to ramp up production when demand spikes. This work introduces a method to successfully learn to schedule a semiconductor manufacturing facility more efficiently using deep reinforcement and self-supervised learning. We propose the first adaptive scheduling approach to handle complex, continuous, stochastic, dynamic, modern semiconductor manufacturing models. Our method outperforms the traditional hierarchical dispatching strategies typically used in semiconductor manufacturing plants, substantially reducing each order's tardiness and time until completion. As a result, our method yields a better allocation of resources in the semiconductor manufacturing process. ",
    "url": "https://arxiv.org/abs/2302.07162",
    "authors": [
      "Pierre Tassel",
      "Benjamin Kovács",
      "Martin Gebser",
      "Konstantin Schekotihin",
      "Patrick Stöckermann",
      "Georg Seidel"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2302.07176",
    "title": "A Theory of Mind Approach as Test-Time Mitigation Against Emergent  Adversarial Communication",
    "abstract": "Multi-Agent Systems (MAS) is the study of multi-agent interactions in a shared environment. Communication for cooperation is a fundamental construct for sharing information in partially observable environments. Cooperative Multi-Agent Reinforcement Learning (CoMARL) is a learning framework where we learn agent policies either with cooperative mechanisms or policies that exhibit cooperative behavior. Explicitly, there are works on learning to communicate messages from CoMARL agents; however, non-cooperative agents, when capable of access a cooperative team's communication channel, have been shown to learn adversarial communication messages, sabotaging the cooperative team's performance particularly when objectives depend on finite resources. To address this issue, we propose a technique which leverages local formulations of Theory-of-Mind (ToM) to distinguish exhibited cooperative behavior from non-cooperative behavior before accepting messages from any agent. We demonstrate the efficacy and feasibility of the proposed technique in empirical evaluations in a centralized training, decentralized execution (CTDE) CoMARL benchmark. Furthermore, while we propose our explicit ToM defense for test-time, we emphasize that ToM is a construct for designing a cognitive defense rather than be the objective of the defense. ",
    "url": "https://arxiv.org/abs/2302.07176",
    "authors": [
      "Nancirose Piazza",
      "Vahid Behzadan"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2302.07187",
    "title": "Lessons from the Development of an Anomaly Detection Interface on the  Mars Perseverance Rover using the ISHMAP Framework",
    "abstract": "While anomaly detection stands among the most important and valuable problems across many scientific domains, anomaly detection research often focuses on AI methods that can lack the nuance and interpretability so critical to conducting scientific inquiry. In this application paper we present the results of utilizing an alternative approach that situates the mathematical framing of machine learning based anomaly detection within a participatory design framework. In a collaboration with NASA scientists working with the PIXL instrument studying Martian planetary geochemistry as a part of the search for extra-terrestrial life; we report on over 18 months of in-context user research and co-design to define the key problems NASA scientists face when looking to detect and interpret spectral anomalies. We address these problems and develop a novel spectral anomaly detection toolkit for PIXL scientists that is highly accurate while maintaining strong transparency to scientific interpretation. We also describe outcomes from a yearlong field deployment of the algorithm and associated interface. Finally we introduce a new design framework which we developed through the course of this collaboration for co-creating anomaly detection algorithms: Iterative Semantic Heuristic Modeling of Anomalous Phenomena (ISHMAP), which provides a process for scientists and researchers to produce natively interpretable anomaly detection models. This work showcases an example of successfully bridging methodologies from AI and HCI within a scientific domain, and provides a resource in ISHMAP which may be used by other researchers and practitioners looking to partner with other scientific teams to achieve better science through more effective and interpretable anomaly detection tools. ",
    "url": "https://arxiv.org/abs/2302.07187",
    "authors": [
      "Austin P. Wright",
      "Peter Nemere",
      "Adrian Galvin",
      "Duen Horng Chau",
      "Scott Davidoff"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07200",
    "title": "Neurosymbolic AI for Reasoning on Graph Structures: A Survey",
    "abstract": "Neurosymbolic AI is an increasingly active area of research which aims to combine symbolic reasoning methods with deep learning to generate models with both high predictive performance and some degree of human-level comprehensibility. As knowledge graphs are becoming a popular way to represent heterogeneous and multi-relational data, methods for reasoning on graph structures have attempted to follow this neurosymbolic paradigm. Traditionally, such approaches have utilized either rule-based inference or generated representative numerical embeddings from which patterns could be extracted. However, several recent studies have attempted to bridge this dichotomy in ways that facilitate interpretability, maintain performance, and integrate expert knowledge. Within this article, we survey a breadth of methods that perform neurosymbolic reasoning tasks on graph structures. To better compare the various methods, we propose a novel taxonomy by which we can classify them. Specifically, we propose three major categories: (1) logically-informed embedding approaches, (2) embedding approaches with logical constraints, and (3) rule-learning approaches. Alongside the taxonomy, we provide a tabular overview of the approaches and links to their source code, if available, for more direct comparison. Finally, we discuss the applications on which these methods were primarily used and propose several prospective directions toward which this new field of research could evolve. ",
    "url": "https://arxiv.org/abs/2302.07200",
    "authors": [
      "Lauren Nicole DeLong",
      "Ramon Fernández Mir",
      "Matthew Whyte",
      "Zonglin Ji",
      "Jacques D. Fleuriot"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Logic in Computer Science (cs.LO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.07208",
    "title": "$\\mathcal{L}_1$Quad: $\\mathcal{L}_1$ Adaptive Augmentation of Geometric  Control for Agile Quadrotors with Performance Guarantees",
    "abstract": "Quadrotors that can operate safely in the presence of imperfect model knowledge and external disturbances are crucial in safety-critical applications. We present L1Quad, a control architecture for quadrotors based on the L1 adaptive control. L1Quad enables safe tubes centered around a desired trajectory that the quadrotor is always guaranteed to remain inside. Our design applies to both the rotational and the translational dynamics of the quadrotor. We lump various types of uncertainties and disturbances as unknown nonlinear (time- and state-dependent) forces and moments. Without assuming or enforcing parametric structures, L1Quad can accurately estimate and compensate for these unknown forces and moments. Extensive experimental results demonstrate that L1Quad is able to significantly outperform baseline controllers under a variety of uncertainties with consistently small tracking errors. ",
    "url": "https://arxiv.org/abs/2302.07208",
    "authors": [
      "Zhuohuan Wu",
      "Sheng Cheng",
      "Pan Zhao",
      "Aditya Gahlawat",
      "Kasey A. Ackerman",
      "Arun Lakshmanan",
      "Chengyu Yang",
      "Jiahao Yu",
      "Naira Hovakimyan"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.07215",
    "title": "Multi-teacher knowledge distillation as an effective method for  compressing ensembles of neural networks",
    "abstract": "Deep learning has contributed greatly to many successes in artificial intelligence in recent years. Today, it is possible to train models that have thousands of layers and hundreds of billions of parameters. Large-scale deep models have achieved great success, but the enormous computational complexity and gigantic storage requirements make it extremely difficult to implement them in real-time applications. On the other hand, the size of the dataset is still a real problem in many domains. Data are often missing, too expensive, or impossible to obtain for other reasons. Ensemble learning is partially a solution to the problem of small datasets and overfitting. However, ensemble learning in its basic version is associated with a linear increase in computational complexity. We analyzed the impact of the ensemble decision-fusion mechanism and checked various methods of sharing the decisions including voting algorithms. We used the modified knowledge distillation framework as a decision-fusion mechanism which allows in addition compressing of the entire ensemble model into a weight space of a single model. We showed that knowledge distillation can aggregate knowledge from multiple teachers in only one student model and, with the same computational complexity, obtain a better-performing model compared to a model trained in the standard manner. We have developed our own method for mimicking the responses of all teachers at the same time, simultaneously. We tested these solutions on several benchmark datasets. In the end, we presented a wide application use of the efficient multi-teacher knowledge distillation framework. In the first example, we used knowledge distillation to develop models that could automate corrosion detection on aircraft fuselage. The second example describes detection of smoke on observation cameras in order to counteract wildfires in forests. ",
    "url": "https://arxiv.org/abs/2302.07215",
    "authors": [
      "Konrad Zuchniak"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07217",
    "title": "PolarStar: Expanding the Scalability Horizon of Diameter-3 Networks",
    "abstract": "In this paper, we present PolarStar, a novel family of diameter-3 network topologies derived from the star product of two low-diameter factor graphs. The proposed PolarStar construction gives the largest known diameter-3 network topologies for almost all radixes. When compared to state-of-the-art diameter-3 networks, PolarStar achieves 31% geometric mean increase in scale over Bundlefly, 91% over Dragonfly, and 690% over 3-D HyperX. PolarStar has many other desirable properties including a modular layout, large bisection, high resilience to link failures and a large number of feasible sizes for every radix. Our evaluation shows that it exhibits comparable or better performance than other diameter-3 networks under various traffic patterns. ",
    "url": "https://arxiv.org/abs/2302.07217",
    "authors": [
      "Kartik Lakhotia",
      "Laura Monroe",
      "Kelly Isham",
      "Maciej Besta",
      "Nils Blach",
      "Torsten Hoefler",
      "Fabrizio Petrini"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2302.07221",
    "title": "Randomization for adversarial robustness: the Good, the Bad and the Ugly",
    "abstract": "Deep neural networks are known to be vulnerable to adversarial attacks: A small perturbation that is imperceptible to a human can easily make a well-trained deep neural network misclassify. To defend against adversarial attacks, randomized classifiers have been proposed as a robust alternative to deterministic ones. In this work we show that in the binary classification setting, for any randomized classifier, there is always a deterministic classifier with better adversarial risk. In other words, randomization is not necessary for robustness. In many common randomization schemes, the deterministic classifiers with better risk are explicitly described: For example, we show that ensembles of classifiers are more robust than mixtures of classifiers, and randomized smoothing is more robust than input noise injection. Finally, experiments confirm our theoretical results with the two families of randomized classifiers we analyze. ",
    "url": "https://arxiv.org/abs/2302.07221",
    "authors": [
      "Lucas Gnecco-Heredia",
      "Yann Chevaleyre",
      "Benjamin Negrevergne",
      "Laurent Meunier"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07229",
    "title": "Moving on from the software engineers' gambit: an approach to support  the defense of software effort estimates",
    "abstract": "Pressure for higher productivity and faster delivery is increasingly pervading software organizations. This can lead software engineers to act like chess players playing a gambit -- making sacrifices of their technically sound estimates, thus submitting their teams to time pressure. In turn, time pressure can have varied detrimental effects, such as poor product quality and emotional distress, decreasing productivity, which leads to more time pressure and delays: a hard-to-stop vicious cycle. This reveals a need for moving on from the more passive strategy of yielding to pressure to a more active one of defending software estimates. Therefore, we propose an approach to support software estimators in acquiring knowledge on how to carry out such defense, by introducing negotiation principles encapsulated in a set of defense lenses, presented through a digital simulation. We evaluated the proposed approach through a controlled experiment with software practitioners from different companies. We collected data on participants' attitudes, subjective norms, perceived behavioral control, and intentions to perform the defense of their estimates in light of the Theory of Planned Behavior. We employed a frequentist and a bayesian approach to data analysis. Results show improved scores among experimental group participants after engaging with the digital simulation and learning about the lenses. They were also more inclined to choose a defense action when facing pressure scenarios than a control group exposed to questions to reflect on the reasons and outcomes of pressure over estimates. Qualitative evidence reveals that practitioners perceived the set of lenses as useful in their current work environments. Collectively, these results show the effectiveness of the proposed approach and its perceived relevance for the industry, despite the low amount of time required to engage with it. ",
    "url": "https://arxiv.org/abs/2302.07229",
    "authors": [
      "Patrícia Matsubara",
      "Igor Steinmacher",
      "Bruno Gadelha",
      "Tayana Conte"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2302.07238",
    "title": "Cauchy Loss Function: Robustness Under Gaussian and Cauchy Noise",
    "abstract": "In supervised machine learning, the choice of loss function implicitly assumes a particular noise distribution over the data. For example, the frequently used mean squared error (MSE) loss assumes a Gaussian noise distribution. The choice of loss function during training and testing affects the performance of artificial neural networks (ANNs). It is known that MSE may yield substandard performance in the presence of outliers. The Cauchy loss function (CLF) assumes a Cauchy noise distribution, and is therefore potentially better suited for data with outliers. This papers aims to determine the extent of robustness and generalisability of the CLF as compared to MSE. CLF and MSE are assessed on a few handcrafted regression problems, and a real-world regression problem with artificially simulated outliers, in the context of ANN training. CLF yielded results that were either comparable to or better than the results yielded by MSE, with a few notable exceptions. ",
    "url": "https://arxiv.org/abs/2302.07238",
    "authors": [
      "Thamsanqa Mlotshwa",
      "Heinrich van Deventer",
      "Anna Sergeevna Bosman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2302.07243",
    "title": "A Deep Probabilistic Spatiotemporal Framework for Dynamic Graph  Representation Learning with Application to Brain Disorder Identification",
    "abstract": "Recent applications of pattern recognition techniques on brain connectome classification using functional connectivity (FC) neglect the non-Euclidean topology and causal dynamics of brain connectivity across time. In this paper, a deep probabilistic spatiotemporal framework developed based on variational Bayes (DSVB) is proposed to learn time-varying topological structures in dynamic brain FC networks for autism spectrum disorder (ASD) identification. The proposed framework incorporates a spatial-aware recurrent neural network to capture rich spatiotemporal patterns across dynamic FC networks, followed by a fully-connected neural network to exploit these learned patterns for subject-level classification. To overcome model overfitting on limited training datasets, an adversarial training strategy is introduced to learn graph embedding models that generalize well to unseen brain networks. Evaluation on the ABIDE resting-state functional magnetic resonance imaging dataset shows that our proposed framework significantly outperformed state-of-the-art methods in identifying ASD. Dynamic FC analyses with DSVB learned embeddings reveal apparent group difference between ASD and healthy controls in network profiles and switching dynamics of brain states. ",
    "url": "https://arxiv.org/abs/2302.07243",
    "authors": [
      "Junn Yong Loo",
      "Sin-Yee Yap",
      "Fuad Noman",
      "Raphael CW Phan",
      "Chee-Ming Ting"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07248",
    "title": "Generation Probabilities Are Not Enough: Exploring the Effectiveness of  Uncertainty Highlighting in AI-Powered Code Completions",
    "abstract": "Large-scale generative models enabled the development of AI-powered code completion tools to assist programmers in writing code. However, much like other AI-powered tools, AI-powered code completions are not always accurate, potentially introducing bugs or even security vulnerabilities into code if not properly detected and corrected by a human programmer. One technique that has been proposed and implemented to help programmers identify potential errors is to highlight uncertain tokens. However, there have been no empirical studies exploring the effectiveness of this technique-- nor investigating the different and not-yet-agreed-upon notions of uncertainty in the context of generative models. We explore the question of whether conveying information about uncertainty enables programmers to more quickly and accurately produce code when collaborating with an AI-powered code completion tool, and if so, what measure of uncertainty best fits programmers' needs. Through a mixed-methods study with 30 programmers, we compare three conditions: providing the AI system's code completion alone, highlighting tokens with the lowest likelihood of being generated by the underlying generative model, and highlighting tokens with the highest predicted likelihood of being edited by a programmer. We find that highlighting tokens with the highest predicted likelihood of being edited leads to faster task completion and more targeted edits, and is subjectively preferred by study participants. In contrast, highlighting tokens according to their probability of being generated does not provide any benefit over the baseline with no highlighting. We further explore the design space of how to convey uncertainty in AI-powered code completion tools, and find that programmers prefer highlights that are granular, informative, interpretable, and not overwhelming. ",
    "url": "https://arxiv.org/abs/2302.07248",
    "authors": [
      "Helena Vasconcelos",
      "Gagan Bansal",
      "Adam Fourney",
      "Q. Vera Liao",
      "Jennifer Wortman Vaughan"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.07249",
    "title": "Graph subshifts",
    "abstract": "We propose a definition of graph subshifts of finite type that can be seen as extending both the notions of subshifts of finite type from classical symbolic dynamics and finitely presented groups from combinatorial group theory. These are sets of graphs that are defined by forbidding finitely many local patterns. In this paper, we focus on the question whether such local conditions can enforce a specific support graph, and thus relate the model to classical symbolic dynamics. We prove that the subshifts that contain only infinite graphs are either aperiodic, or feature no residual finiteness of their period group, yielding non-trivial examples as well as two natural undecidability theorems. ",
    "url": "https://arxiv.org/abs/2302.07249",
    "authors": [
      "Pablo Arrighi",
      "Amélia Durbec",
      "Pierre Guillon"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Formal Languages and Automata Theory (cs.FL)",
      "Group Theory (math.GR)"
    ]
  },
  {
    "id": "arXiv:2302.07260",
    "title": "Scalable Bayesian optimization with high-dimensional outputs using  randomized prior networks",
    "abstract": "Several fundamental problems in science and engineering consist of global optimization tasks involving unknown high-dimensional (black-box) functions that map a set of controllable variables to the outcomes of an expensive experiment. Bayesian Optimization (BO) techniques are known to be effective in tackling global optimization problems using a relatively small number objective function evaluations, but their performance suffers when dealing with high-dimensional outputs. To overcome the major challenge of dimensionality, here we propose a deep learning framework for BO and sequential decision making based on bootstrapped ensembles of neural architectures with randomized priors. Using appropriate architecture choices, we show that the proposed framework can approximate functional relationships between design variables and quantities of interest, even in cases where the latter take values in high-dimensional vector spaces or even infinite-dimensional function spaces. In the context of BO, we augmented the proposed probabilistic surrogates with re-parameterized Monte Carlo approximations of multiple-point (parallel) acquisition functions, as well as methodological extensions for accommodating black-box constraints and multi-fidelity information sources. We test the proposed framework against state-of-the-art methods for BO and demonstrate superior performance across several challenging tasks with high-dimensional outputs, including a constrained optimization task involving shape optimization of rotor blades in turbo-machinery. ",
    "url": "https://arxiv.org/abs/2302.07260",
    "authors": [
      "Mohamed Aziz Bhouri",
      "Michael Joly",
      "Robert Yu",
      "Soumalya Sarkar",
      "Paris Perdikaris"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.06616",
    "title": "Tensor Networks or Decision Diagrams? Guidelines for Classical Quantum  Circuit Simulation",
    "abstract": "Classically simulating quantum circuits is crucial when developing or testing quantum algorithms. Due to the underlying exponential complexity, efficient data structures are key for performing such simulations. To this end, tensor networks and decision diagrams have independently been developed with differing perspectives, terminologies, and backgrounds in mind. Although this left designers with two complementary data structures for quantum circuit simulation, thus far it remains unclear which one is the better choice for a given use case. In this work, we (1) consider how these techniques approach classical quantum circuit simulation, and (2) examine their (dis)similarities with regard to their most applicable abstraction level, the desired simulation output, the impact of the computation order, and the ease of distributing the workload. As a result, we provide guidelines for when to better use tensor networks and when to better use decision diagrams in classical quantum circuit simulation. ",
    "url": "https://arxiv.org/abs/2302.06616",
    "authors": [
      "Lukas Burgholzer",
      "Alexander Ploier",
      "Robert Wille"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Data Structures and Algorithms (cs.DS)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2302.06664",
    "title": "A characterization of quasi-transitive context-free inverse graphs",
    "abstract": "We extend the characterization of context-free groups of Muller and Schupp in two ways. We first show that for a quasi-transitive inverse graph $\\Gamma$, being context-free is equivalent to having the automorphism group $Aut(\\Gamma)$ that is virtually free, which in turn is also equivalent to being quasi-isometric to a tree. As a consequence of this result, we solve a weaker version of a conjecture of T. Brough by showing that the class of groups that are virtually finitely generated subgroups of direct product of free groups coincides with the class of finitely generated groups having the word problem in the class of languages that are intersections of finitely many languages accepted by quasi-transitive context-free inverse graphs. ",
    "url": "https://arxiv.org/abs/2302.06664",
    "authors": [
      "Emanuele Rodaro"
    ],
    "subjectives": [
      "Group Theory (math.GR)",
      "Formal Languages and Automata Theory (cs.FL)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2302.06677",
    "title": "System identification of neural systems: If we got it right, would we  know?",
    "abstract": "Artificial neural networks are being proposed as models of parts of the brain. The networks are compared to recordings of biological neurons, and good performance in reproducing neural responses is considered to support the model's validity. A key question is how much this system identification approach tells us about brain computation. Does it validate one model architecture over another? We evaluate the most commonly used comparison techniques, such as a linear encoding model and centered kernel alignment, to correctly identify a model by replacing brain recordings with known ground truth models. System identification performance is quite variable; it also depends significantly on factors independent of the ground truth architecture, such as stimuli images. In addition, we show the limitations of using functional similarity scores in identifying higher-level architectural motifs. ",
    "url": "https://arxiv.org/abs/2302.06677",
    "authors": [
      "Yena Han",
      "Tomaso Poggio",
      "Brian Cheung"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.06717",
    "title": "The Subgraph Isomorphism Problem for Port Graphs and Quantum Circuits",
    "abstract": "We study a variant of the subgraph isomorphism problem that is of high interest to the quantum computing community. Our results give an algorithm to perform pattern matching in quantum circuits for many patterns simultaneously, independently of the number of patterns. After a pre-computation step in which the patterns are compiled into a decision tree, the running time is linear in the size of the input quantum circuit. More generally, we consider connected port graphs, in which every edge $e$ incident to $v$ has a label $L_v(e)$ unique in $v$. Jiang and Bunke showed that the subgraph isomorphism problem $H \\subseteq G$ for such graphs can be solved in time $O(|V(G)| \\cdot |V(H)|)$. We show that if in addition the graphs are directed acyclic, then the subgraph isomorphism problem can be solved for an unbounded number of patterns simultaneously. We enumerate all $m$ pattern matches in time $O(P)^{P+3/2} \\cdot |V(G)| + O(m)$, where $P$ is the number of vertices of the largest pattern. In the case of quantum circuits, we can express the bound obtained in terms of the maximum number of qubits $N$ and depth $\\delta$ of the patterns : $O(N)^{N + 1/2} \\cdot \\delta \\log \\delta \\cdot |V(G)| + O(m)$. ",
    "url": "https://arxiv.org/abs/2302.06717",
    "authors": [
      "Luca Mondada",
      "Pablo Andrés-Martínez"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Computational Complexity (cs.CC)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2302.06800",
    "title": "Perfect divisibility and coloring of some fork-free graphs",
    "abstract": "A $hole$ is an induced cycle of length at least four, and an odd hole is a hole of odd length. A {\\em fork} is a graph obtained from $K_{1,3}$ by subdividing an edge once. An {\\em odd balloon} is a graph obtained from an odd hole by identifying respectively two consecutive vertices with two leaves of $K_{1, 3}$. A {\\em gem} is a graph that consists of a $P_4$ plus a vertex adjacent to all vertices of the $P_4$. A {\\em butterfly} is a graph obtained from two traingles by sharing exactly one vertex. A graph $G$ is perfectly divisible if for each induced subgraph $H$ of $G$, $V(H)$ can be partitioned into $A$ and $B$ such that $H[A]$ is perfect and $\\omega(H[B])<\\omega(H)$. In this paper, we show that (odd balloon, fork)-free graphs are perfectly divisible (this generalizes some results of Karthick {\\em et al}). As an application, we show that $\\chi(G)\\le\\binom{\\omega(G)+1}{2}$ if $G$ is (fork, gem)-free or (fork, butterfly)-free. ",
    "url": "https://arxiv.org/abs/2302.06800",
    "authors": [
      "Di Wu",
      "Baogang Xu"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2302.06887",
    "title": "Learning Graph ARMA Processes from Time-Vertex Spectra",
    "abstract": "The modeling of time-varying graph signals as stationary time-vertex stochastic processes permits the inference of missing signal values by efficiently employing the correlation patterns of the process across different graph nodes and time instants. In this study, we first propose an algorithm for computing graph autoregressive moving average (graph ARMA) processes based on learning the joint time-vertex power spectral density of the process from its incomplete realizations. Our solution relies on first roughly estimating the joint spectrum of the process from partially observed realizations and then refining this estimate by projecting it onto the spectrum manifold of the ARMA process. We then present a theoretical analysis of the sample complexity of learning graph ARMA processes. Experimental results show that the proposed approach achieves improvement in the time-vertex signal estimation performance in comparison with reference approaches in the literature. ",
    "url": "https://arxiv.org/abs/2302.06887",
    "authors": [
      "Eylem Tugce Guneyi",
      "Berkay Yaldiz",
      "Abdullah Canbolat",
      "Elif Vural"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.06960",
    "title": "Data pruning and neural scaling laws: fundamental limitations of  score-based algorithms",
    "abstract": "Data pruning algorithms are commonly used to reduce the memory and computational cost of the optimization process. Recent empirical results reveal that random data pruning remains a strong baseline and outperforms most existing data pruning methods in the high compression regime, i.e., where a fraction of $30\\%$ or less of the data is kept. This regime has recently attracted a lot of interest as a result of the role of data pruning in improving the so-called neural scaling laws; in [Sorscher et al.], the authors showed the need for high-quality data pruning algorithms in order to beat the sample power law. In this work, we focus on score-based data pruning algorithms and show theoretically and empirically why such algorithms fail in the high compression regime. We demonstrate ``No Free Lunch\" theorems for data pruning and present calibration protocols that enhance the performance of existing pruning algorithms in this high compression regime using randomization. ",
    "url": "https://arxiv.org/abs/2302.06960",
    "authors": [
      "Fadhel Ayed",
      "Soufiane Hayou"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07049",
    "title": "Multilevel Objective-Function-Free Optimization with an Application to  Neural Networks Training",
    "abstract": "A class of multi-level algorithms for unconstrained nonlinear optimization is presented which does not require the evaluation of the objective function. The class contains the momentum-less AdaGrad method as a particular (single-level) instance. The choice of avoiding the evaluation of the objective function is intended to make the algorithms of the class less sensitive to noise, while the multi-level feature aims at reducing their computational cost. The evaluation complexity of these algorithms is analyzed and their behaviour in the presence of noise is then illustrated in the context of training deep neural networks for supervised learning applications. ",
    "url": "https://arxiv.org/abs/2302.07049",
    "authors": [
      "S. Gratton",
      "A. Kopanicakova",
      "Ph. L. Toint"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Artificial Intelligence (cs.AI)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2302.07089",
    "title": "Novel Design of Quantum Circuits for Representation of Grayscale Images",
    "abstract": "The advent of Quantum Computing has influenced researchers around the world to solve multitudes of computational problems with the promising technology. Feasibility of solutions for computational problems, and representation of various information, may allow quantum computing to replace classical computer in near future. One such challenge is the representation of digital images in quantum computer. Several works have been done to make it possible. One such promising technique, named Quantum Probability Image Encoding, requires minimal number of qubits, where the intensity of n pixels is represented as the statevector of log_2(n) qubits. Though there exist quantum circuit design techniques to obtain arbitrary statevector, they consider statevector in general Hilbert space. But for image data, considering only real vector space is sufficient, that may constraint the circuit in smaller gate set, and possibly can reduce number of gates required. In this paper, construction of such quantum circuits has been proposed. ",
    "url": "https://arxiv.org/abs/2302.07089",
    "authors": [
      "Mayukh Sarkar"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2302.07099",
    "title": "Tetris-inspired detector with neural network for radiation mapping",
    "abstract": "In recent years, radiation mapping has attracted widespread research attention and increased public concerns on environmental monitoring. In terms of both materials and their configurations, radiation detectors have been developed to locate the directions and positions of the radiation sources. In this process, algorithm is essential in converting detector signals to radiation source information. However, due to the complex mechanisms of radiation-matter interaction and the current limitation of data collection, high-performance, low-cost radiation mapping is still challenging. Here we present a computational framework using Tetris-inspired detector pixels and machine learning for radiation mapping. Using inter-pixel padding to increase the contrast between pixels and neural network to analyze the detector readings, a detector with as few as four pixels can achieve high-resolution directional mapping. By further imposing Maximum a Posteriori (MAP) with a moving detector, further radiation position localization is achieved. Non-square, Tetris-shaped detector can further improve performance beyond the conventional grid-shaped detector. Our framework offers a new avenue for high quality radiation mapping with least number of detector pixels possible, and is anticipated to be capable to deploy for real-world radiation detection with moderate validation. ",
    "url": "https://arxiv.org/abs/2302.07099",
    "authors": [
      "Ryotaro Okabe",
      "Shangjie Xue",
      "Jiankai Yu",
      "Tongtong Liu",
      "Benoit Forget",
      "Stefanie Jegelka",
      "Gordon Kohse",
      "Lin-wen Hu",
      "Mingda Li"
    ],
    "subjectives": [
      "Instrumentation and Detectors (physics.ins-det)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07110",
    "title": "Non-empty intersection of longest paths in $H$-free graphs",
    "abstract": "We make progress toward a characterization of the graphs $H$ such that every connected $H$-free graph has a longest path transversal of size $1$. In particular, we show that the graphs $H$ on at most $4$ vertices satisfying this property are exactly the linear forests. We also show that if the order of a connected graph $G$ is large relative to its connectivity $\\kappa(G)$, and its independence number $\\alpha(G)$ satisfies $\\alpha(G) \\le \\kappa(G) + 2$, then each vertex of maximum degree forms a longest path transversal of size $1$. ",
    "url": "https://arxiv.org/abs/2302.07110",
    "authors": [
      "James A. Long Jr.",
      "Kevin G. Milans",
      "Andrea Munaro"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2302.07129",
    "title": "SHEEP: Signed Hamiltonian Eigenvector Embedding for Proximity",
    "abstract": "We introduce a spectral embedding algorithm for finding proximal relationships between nodes in signed graphs, where edges can take either positive or negative weights. Adopting a physical perspective, we construct a Hamiltonian which is dependent on the distance between nodes, such that relative embedding distance results in a similarity metric between nodes. The Hamiltonian admits a global minimum energy configuration, which can be reconfigured as an eigenvector problem, and therefore is computationally efficient to compute. We use matrix perturbation theory to show that the embedding generates a ground state energy, which can be used as a statistical test for the presence of strong balance, and to develop an energy-based approach for locating the optimal embedding dimension. Finally, we show through a series of experiments on synthetic and empirical networks, that the resulting position in the embedding can be used to recover certain continuous node attributes, and that the distance to the origin in the optimal embedding gives a measure of node extremism. ",
    "url": "https://arxiv.org/abs/2302.07129",
    "authors": [
      "Shazia'Ayn Babul",
      "Renaud Lambiotte"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)",
      "Spectral Theory (math.SP)"
    ]
  },
  {
    "id": "arXiv:2302.07153",
    "title": "A Novel Poisoned Water Detection Method Using Smartphone Embedded Wi-Fi  Technology and Machine Learning Algorithms",
    "abstract": "Water is a necessary fluid to the human body and automatic checking of its quality and cleanness is an ongoing area of research. One such approach is to present the liquid to various types of signals and make the amount of signal attenuation an indication of the liquid category. In this article, we have utilized the Wi-Fi signal to distinguish clean water from poisoned water via training different machine learning algorithms. The Wi-Fi access points (WAPs) signal is acquired via equivalent smartphone-embedded Wi-Fi chipsets, and then Channel-State-Information CSI measures are extracted and converted into feature vectors to be used as input for machine learning classification algorithms. The measured amplitude and phase of the CSI data are selected as input features into four classifiers k-NN, SVM, LSTM, and Ensemble. The experimental results show that the model is adequate to differentiate poison water from clean water with a classification accuracy of 89% when LSTM is applied, while 92% classification accuracy is achieved when the AdaBoost-Ensemble classifier is applied. ",
    "url": "https://arxiv.org/abs/2302.07153",
    "authors": [
      "Halgurd S. Maghdid",
      "Sheerko R. Hma Salah",
      "Akar T. Hawre",
      "Hassan M. Bayram",
      "Azhin T. Sabir",
      "Kosrat N. Kaka",
      "Salam Ghafour Taher",
      "Ladeh S. Abdulrahman",
      "Abdulbasit K. Al-Talabani",
      "Safar M. Asaad",
      "Aras Asaad"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.09673",
    "title": "An Exact Poly-Time Membership-Queries Algorithm for Extraction a  three-Layer ReLU Network",
    "abstract": " Title: An Exact Poly-Time Membership-Queries Algorithm for Extraction a  three-Layer ReLU Network ",
    "url": "https://arxiv.org/abs/2105.09673",
    "authors": [
      "Amit Daniely",
      "Elad Granot"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.08910",
    "title": "Achieving on-Mobile Real-Time Super-Resolution with Neural Architecture  and Pruning Search",
    "abstract": " Title: Achieving on-Mobile Real-Time Super-Resolution with Neural Architecture  and Pruning Search ",
    "url": "https://arxiv.org/abs/2108.08910",
    "authors": [
      "Zheng Zhan",
      "Yifan Gong",
      "Pu Zhao",
      "Geng Yuan",
      "Wei Niu",
      "Yushu Wu",
      "Tianyun Zhang",
      "Malith Jayaweera",
      "David Kaeli",
      "Bin Ren",
      "Xue Lin",
      "Yanzhi Wang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2109.08467",
    "title": "Online Learning of Network Bottlenecks via Minimax Paths",
    "abstract": " Title: Online Learning of Network Bottlenecks via Minimax Paths ",
    "url": "https://arxiv.org/abs/2109.08467",
    "authors": [
      "Niklas Åkerblom",
      "Fazeleh Sadat Hoseini",
      "Morteza Haghir Chehreghani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.12148",
    "title": "Event Detection on Dynamic Graphs",
    "abstract": " Comments: Longer version of \"Graph Macro Dynamics with Self-Attention for Event Detection\" accepted to DLG-AAAI 2023 ",
    "url": "https://arxiv.org/abs/2110.12148",
    "authors": [
      "Mert Kosan",
      "Arlei Silva",
      "Sourav Medya",
      "Brian Uzzi",
      "Ambuj Singh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2110.15317",
    "title": "Bridge the Gap Between CV and NLP! An Optimization-based Textual  Adversarial Attack Framework",
    "abstract": " Comments: Codes are available at: this https URL ",
    "url": "https://arxiv.org/abs/2110.15317",
    "authors": [
      "Lifan Yuan",
      "Yichi Zhang",
      "Yangyi Chen",
      "Wei Wei"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.08691",
    "title": "Towards Robust Neural Image Compression: Adversarial Attack and Model  Finetuning",
    "abstract": " Comments: This paper has been completely rewritten ",
    "url": "https://arxiv.org/abs/2112.08691",
    "authors": [
      "Tong Chen",
      "Zhan Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2201.09737",
    "title": "RamanNet: A generalized neural network architecture for Raman Spectrum  Analysis",
    "abstract": " Title: RamanNet: A generalized neural network architecture for Raman Spectrum  Analysis ",
    "url": "https://arxiv.org/abs/2201.09737",
    "authors": [
      "Nabil Ibtehaz",
      "Muhammad E. H. Chowdhury",
      "Amith Khandakar",
      "Susu M. Zughaier",
      "Serkan Kiranyaz",
      "M. Sohel Rahman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.10374",
    "title": "Multiscale modeling of linear elastic heterogeneous structures via  localized model order reduction",
    "abstract": " Title: Multiscale modeling of linear elastic heterogeneous structures via  localized model order reduction ",
    "url": "https://arxiv.org/abs/2201.10374",
    "authors": [
      "Philipp Diercks",
      "Karen Veroy",
      "Annika Robens-Radermacher",
      "Jörg F. Unger"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2202.12154",
    "title": "Towards Effective and Robust Neural Trojan Defenses via Input Filtering",
    "abstract": " Comments: Accepted to ECCV 2022 ",
    "url": "https://arxiv.org/abs/2202.12154",
    "authors": [
      "Kien Do",
      "Haripriya Harikumar",
      "Hung Le",
      "Dung Nguyen",
      "Truyen Tran",
      "Santu Rana",
      "Dang Nguyen",
      "Willy Susilo",
      "Svetha Venkatesh"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.06618",
    "title": "ALDI++: Automatic and parameter-less discord and outlier detection for  building energy load profiles",
    "abstract": " Comments: 10 pages, 5 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2203.06618",
    "authors": [
      "Matias Quintana",
      "Till Stoeckmann",
      "June Young Park",
      "Marian Turowski",
      "Veit Hagenmeyer",
      "Clayton Miller"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2204.07841",
    "title": "Multi-Modal Few-Shot Object Detection with Meta-Learning-Based  Cross-Modal Prompting",
    "abstract": " Comments: 17 pages ",
    "url": "https://arxiv.org/abs/2204.07841",
    "authors": [
      "Guangxing Han",
      "Long Chen",
      "Jiawei Ma",
      "Shiyuan Huang",
      "Rama Chellappa",
      "Shih-Fu Chang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2205.12248",
    "title": "RevUp: Revise and Update Information Bottleneck for Event Representation",
    "abstract": " Comments: To Appear in the 17th Conference of the European Chapter of the Association for Computational Linguistics (EACL 2023), Same version as EACL camera ready; pagination differences due to texlive versions ",
    "url": "https://arxiv.org/abs/2205.12248",
    "authors": [
      "Mehdi Rezaee",
      "Francis Ferraro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2206.05530",
    "title": "Memorization-Dilation: Modeling Neural Collapse Under Label Noise",
    "abstract": " Comments: to be published at ICLR 2023 ",
    "url": "https://arxiv.org/abs/2206.05530",
    "authors": [
      "Duc Anh Nguyen",
      "Ron Levie",
      "Julian Lienen",
      "Gitta Kutyniok",
      "Eyke Hüllermeier"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.06779",
    "title": "Benchmarking Bayesian neural networks and evaluation metrics for  regression tasks",
    "abstract": " Title: Benchmarking Bayesian neural networks and evaluation metrics for  regression tasks ",
    "url": "https://arxiv.org/abs/2206.06779",
    "authors": [
      "Brian Staber",
      "Sébastien Da Veiga"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Classical Physics (physics.class-ph)"
    ]
  },
  {
    "id": "arXiv:2206.07557",
    "title": "How to Reduce Change Detection to Semantic Segmentation",
    "abstract": " Comments: Accepted by Pattern Recognition. Code is at this https URL ",
    "url": "https://arxiv.org/abs/2206.07557",
    "authors": [
      "Guo-Hua Wang",
      "Bin-Bin Gao",
      "Chengjie Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.10265",
    "title": "FOCUS: Fairness via Agent-Awareness for Federated Learning on  Heterogeneous Data",
    "abstract": " Title: FOCUS: Fairness via Agent-Awareness for Federated Learning on  Heterogeneous Data ",
    "url": "https://arxiv.org/abs/2207.10265",
    "authors": [
      "Wenda Chu",
      "Chulin Xie",
      "Boxin Wang",
      "Linyi Li",
      "Lang Yin",
      "Han Zhao",
      "Bo Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2207.10887",
    "title": "Geolocated Social Media Posts are Happier: Understanding the  Characteristics of Check-in Posts on Twitter",
    "abstract": " Comments: 11 pages, 10 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2207.10887",
    "authors": [
      "Julie Jiang",
      "Jesse Thomason",
      "Francesco Barbieri",
      "Emilio Ferrara"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2208.10895",
    "title": "A Comprehensive Study of Real-Time Object Detection Networks Across  Multiple Domains: A Survey",
    "abstract": " Comments: Published in Transactions on Machine Learning Research (TMLR) with Survey Certification ",
    "url": "https://arxiv.org/abs/2208.10895",
    "authors": [
      "Elahe Arani",
      "Shruthi Gowda",
      "Ratnajit Mukherjee",
      "Omar Magdy",
      "Senthilkumar Kathiresan",
      "Bahram Zonooz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.10917",
    "title": "Graph Embeddings via Tensor Products and Approximately Orthonormal Codes",
    "abstract": " Comments: 20 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2208.10917",
    "authors": [
      "Frank Qiu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.03755",
    "title": "Fact-Saboteurs: A Taxonomy of Evidence Manipulation Attacks against  Fact-Verification Systems",
    "abstract": " Title: Fact-Saboteurs: A Taxonomy of Evidence Manipulation Attacks against  Fact-Verification Systems ",
    "url": "https://arxiv.org/abs/2209.03755",
    "authors": [
      "Sahar Abdelnabi",
      "Mario Fritz"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.10182",
    "title": "The graph structure of two-player games",
    "abstract": " Comments: 16 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2209.10182",
    "authors": [
      "Oliver Biggar",
      "Iman Shames"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2209.10788",
    "title": "How Does It Feel? Self-Supervised Costmap Learning for Off-Road Vehicle  Traversability",
    "abstract": " Title: How Does It Feel? Self-Supervised Costmap Learning for Off-Road Vehicle  Traversability ",
    "url": "https://arxiv.org/abs/2209.10788",
    "authors": [
      "Mateo Guaman Castro",
      "Samuel Triest",
      "Wenshan Wang",
      "Jason M. Gregory",
      "Felix Sanchez",
      "John G. Rogers III",
      "Sebastian Scherer"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.12313",
    "title": "Random graph matching at Otter's threshold via counting chandeliers",
    "abstract": " Title: Random graph matching at Otter's threshold via counting chandeliers ",
    "url": "https://arxiv.org/abs/2209.12313",
    "authors": [
      "Cheng Mao",
      "Yihong Wu",
      "Jiaming Xu",
      "Sophie H. Yu"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.13338",
    "title": "Large network community detection by fast label propagation",
    "abstract": " Title: Large network community detection by fast label propagation ",
    "url": "https://arxiv.org/abs/2209.13338",
    "authors": [
      "Vincent A. Traag",
      "Lovro Šubelj"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2210.01019",
    "title": "Plateau in Monotonic Linear Interpolation -- A \"Biased\" View of Loss  Landscape for Deep Networks",
    "abstract": " Comments: ICLR 2023 ",
    "url": "https://arxiv.org/abs/2210.01019",
    "authors": [
      "Xiang Wang",
      "Annie N. Wang",
      "Mo Zhou",
      "Rong Ge"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02885",
    "title": "RankMe: Assessing the downstream performance of pretrained  self-supervised representations by their rank",
    "abstract": " Title: RankMe: Assessing the downstream performance of pretrained  self-supervised representations by their rank ",
    "url": "https://arxiv.org/abs/2210.02885",
    "authors": [
      "Quentin Garrido",
      "Randall Balestriero",
      "Laurent Najman",
      "Yann Lecun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.05408",
    "title": "Private Randomness Agreement and its Application in Quantum Key  Distribution Networks",
    "abstract": " Comments: 6 pages ",
    "url": "https://arxiv.org/abs/2210.05408",
    "authors": [
      "René Bødker Christensen",
      "Petar Popovski"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2210.11996",
    "title": "Unbalanced Triangle Detection and Enumeration Hardness for Unions of  Conjunctive Queries",
    "abstract": " Title: Unbalanced Triangle Detection and Enumeration Hardness for Unions of  Conjunctive Queries ",
    "url": "https://arxiv.org/abs/2210.11996",
    "authors": [
      "Karl Bringmann",
      "Nofar Carmeli"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2210.14140",
    "title": "Contrastive Search Is What You Need For Neural Text Generation",
    "abstract": " Comments: TMLR'23 ",
    "url": "https://arxiv.org/abs/2210.14140",
    "authors": [
      "Yixuan Su",
      "Nigel Collier"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2211.01214",
    "title": "Time-aware Random Walk Diffusion to Improve Dynamic Graph Learning",
    "abstract": " Comments: Accepted to AAAI 2023 ",
    "url": "https://arxiv.org/abs/2211.01214",
    "authors": [
      "Jong-whi Lee",
      "Jinhong Jung"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.01426",
    "title": "Reciprocity, Homophily, and Social Network Effects in Pictorial  Communication: A Case Study of Bitmoji Stickers",
    "abstract": " Comments: 14 pages, 10 figures, 4 tables ",
    "url": "https://arxiv.org/abs/2211.01426",
    "authors": [
      "Julie Jiang",
      "Ron Dotsch",
      "Mireia Triguero Roura",
      "Yozen Liu",
      "Vítor Silva",
      "Maarten W. Bos",
      "Francesco Barbieri"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2211.16467",
    "title": "Linear Causal Disentanglement via Interventions",
    "abstract": " Title: Linear Causal Disentanglement via Interventions ",
    "url": "https://arxiv.org/abs/2211.16467",
    "authors": [
      "Chandler Squires",
      "Anna Seigal",
      "Salil Bhate",
      "Caroline Uhler"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.07553",
    "title": "Automated Reachability Analysis of Neural Network-Controlled Systems via  Adaptive Polytopes",
    "abstract": " Title: Automated Reachability Analysis of Neural Network-Controlled Systems via  Adaptive Polytopes ",
    "url": "https://arxiv.org/abs/2212.07553",
    "authors": [
      "Taha Entesari",
      "Mahyar Fazlyab"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2212.09408",
    "title": "Million-scale Object Detection with Large Vision Model",
    "abstract": " Comments: This paper is revised by ChatGPT ",
    "url": "https://arxiv.org/abs/2212.09408",
    "authors": [
      "Feng Lin",
      "Wenze Hu",
      "Yaowei Wang",
      "Yonghong Tian",
      "Guangming Lu",
      "Fanglin Chen",
      "Yong Xu",
      "Xiaoyu Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.02831",
    "title": "Joint Beamforming and Phase Shift Design for Hybrid-IRS-aided  Directional Modulation Network",
    "abstract": " Title: Joint Beamforming and Phase Shift Design for Hybrid-IRS-aided  Directional Modulation Network ",
    "url": "https://arxiv.org/abs/2301.02831",
    "authors": [
      "Rongen Dong",
      "Hangjia He",
      "Feng Shu",
      "Riqing Chen",
      "Jiangzhou Wang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2301.05571",
    "title": "The 2022 n2c2/UW Shared Task on Extracting Social Determinants of Health",
    "abstract": " Title: The 2022 n2c2/UW Shared Task on Extracting Social Determinants of Health ",
    "url": "https://arxiv.org/abs/2301.05571",
    "authors": [
      "Kevin Lybarger",
      "Meliha Yetisgen",
      "Özlem Uzuner"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.07307",
    "title": "Workload-Aware Scheduling using Markov Decision Process for  Infrastructure-Assisted Learning-Based Multi-UAV Surveillance Networks",
    "abstract": " Comments: 15 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2301.07307",
    "authors": [
      "Soohyun Park",
      "Chanyoung Park",
      "Soyi Jung",
      "Jae-Hyun Kim",
      "Joongheon Kim"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2301.09620",
    "title": "Tracking the industrial growth of modern China with high-resolution  panchromatic imagery: A sequential convolutional approach",
    "abstract": " Comments: Fixed typos ",
    "url": "https://arxiv.org/abs/2301.09620",
    "authors": [
      "Ethan Brewer",
      "Zhonghui Lv",
      "Dan Runfola"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.11463",
    "title": "Nik Defense: An Artificial Intelligence Based Defense Mechanism against  Selfish Mining in Bitcoin",
    "abstract": " Comments: Paper is submitted to Journal of IEEE Transactions on Dependable and Secure Computing ",
    "url": "https://arxiv.org/abs/2301.11463",
    "authors": [
      "Ali Nikhalat-Jahromi",
      "Ali Mohammad Saghiri",
      "Mohammad Reza Meybodi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.12457",
    "title": "EvoX: A Distributed GPU-accelerated Library towards Scalable  Evolutionary Computation",
    "abstract": " Title: EvoX: A Distributed GPU-accelerated Library towards Scalable  Evolutionary Computation ",
    "url": "https://arxiv.org/abs/2301.12457",
    "authors": [
      "Beichen Huang",
      "Ran Cheng",
      "Yaochu Jin",
      "Kay Chen Tan"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2301.13816",
    "title": "Execution-based Code Generation using Deep Reinforcement Learning",
    "abstract": " Title: Execution-based Code Generation using Deep Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2301.13816",
    "authors": [
      "Parshin Shojaee",
      "Aneesh Jain",
      "Sindhu Tipirneni",
      "Chandan K. Reddy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2302.03830",
    "title": "TetCNN: Convolutional Neural Networks on Tetrahedral Meshes",
    "abstract": " Comments: Accepted as a conference paper to Information Processing in Medical Imaging (IPMI 2023) conference ",
    "url": "https://arxiv.org/abs/2302.03830",
    "authors": [
      "Mohammad Farazi",
      "Zhangsihao Yang",
      "Wenhui Zhu",
      "Peijie Qiu",
      "Yalin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.04497",
    "title": "Scale-aware neural calibration for wide swath altimetry observations",
    "abstract": " Comments: 8 pages, 7 figures, Preprint ",
    "url": "https://arxiv.org/abs/2302.04497",
    "authors": [
      "Quentin Febvre",
      "Clément Ubelmann",
      "Julien Le Sommer",
      "Ronan Fablet"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Instrumentation and Detectors (physics.ins-det)"
    ]
  },
  {
    "id": "arXiv:2302.05446",
    "title": "Robust Scheduling with GFlowNets",
    "abstract": " Comments: Published at International Conference on Learning Representations (ICLR) 2023; an earlier version appeared at the NeurIPS 2022 workshop ML4Systems ",
    "url": "https://arxiv.org/abs/2302.05446",
    "authors": [
      "David W. Zhang",
      "Corrado Rainone",
      "Markus Peschl",
      "Roberto Bondesan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2302.06352",
    "title": "Deep Anatomical Federated Network (Dafne): an open client/server  framework for the continuous collaborative improvement of deep-learning-based  medical image segmentation",
    "abstract": " Comments: 10 pages (main body), 5 figures. Work partially presented at the 2021 RSNA conference and at the 2023 ISMRM conference In this new version: added author and change in the acknowledgment ",
    "url": "https://arxiv.org/abs/2302.06352",
    "authors": [
      "Francesco Santini",
      "Jakob Wasserthal",
      "Abramo Agosti",
      "Xeni Deligianni",
      "Kevin R. Keene",
      "Hermien E. Kan",
      "Stefan Sommer",
      "Christoph Stuprich",
      "Fengdan Wang",
      "Claudia Weidensteiner",
      "Giulia Manco",
      "Matteo Paoletti",
      "Valentina Mazzoli",
      "Arjun Desai",
      "Anna Pichiecchio"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.06357",
    "title": "A simple statistic for determining the dimensionality of complex  networks",
    "abstract": " Title: A simple statistic for determining the dimensionality of complex  networks ",
    "url": "https://arxiv.org/abs/2302.06357",
    "authors": [
      "Tobias Friedrich",
      "Andreas Göbel",
      "Maximilian Katzmann",
      "Leon Schiller"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Discrete Mathematics (cs.DM)"
    ]
  }
]