[
  {
    "id": "arXiv:2204.11836",
    "title": "Automated detection of dark patterns in cookie banners: how to do it  poorly and why it is hard to do it any other way",
    "abstract": "Cookie banners, the pop ups that appear to collect your consent for data collection, are a tempting ground for dark patterns. Dark patterns are design elements that are used to influence the user's choice towards an option that is not in their interest. The use of dark patterns renders consent elicitation meaningless and voids the attempts to improve a fair collection and use of data. Can machine learning be used to automatically detect the presence of dark patterns in cookie banners? In this work, a dataset of cookie banners of 300 news websites was used to train a prediction model that does exactly that. The machine learning pipeline we used includes feature engineering, parameter search, training a Gradient Boosted Tree classifier and evaluation. The accuracy of the trained model is promising, but allows a lot of room for improvement. We provide an in-depth analysis of the interdisciplinary challenges that automated dark pattern detection poses to artificial intelligence. The dataset and all the code created using machine learning is available at the url to repository removed for review. ",
    "url": "https://arxiv.org/abs/2204.11836",
    "authors": [
      "Than Htut Soe",
      "Cristiana Teixeira Santos",
      "Marija Slavkovik"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2204.11837",
    "title": "A Mask-Based Adversarial Defense Scheme",
    "abstract": "Adversarial attacks hamper the functionality and accuracy of Deep Neural Networks (DNNs) by meddling with subtle perturbations to their inputs.In this work, we propose a new Mask-based Adversarial Defense scheme (MAD) for DNNs to mitigate the negative effect from adversarial attacks. To be precise, our method promotes the robustness of a DNN by randomly masking a portion of potential adversarial images, and as a result, the %classification result output of the DNN becomes more tolerant to minor input perturbations. Compared with existing adversarial defense techniques, our method does not need any additional denoising structure, nor any change to a DNN's design. We have tested this approach on a collection of DNN models for a variety of data sets, and the experimental results confirm that the proposed method can effectively improve the defense abilities of the DNNs against all of the tested adversarial attack methods. In certain scenarios, the DNN models trained with MAD have improved classification accuracy by as much as 20% to 90% compared to the original models that are given adversarial inputs. ",
    "url": "https://arxiv.org/abs/2204.11837",
    "authors": [
      "Weizhen Xu",
      "Chenyi Zhang",
      "Fangzhen Zhao",
      "Liangda Fang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.11838",
    "title": "Automating Neural Architecture Design without Search",
    "abstract": "Neural structure search (NAS), as the mainstream approach to automate deep neural architecture design, has achieved much success in recent years. However, the performance estimation component adhering to NAS is often prohibitively costly, which leads to the enormous computational demand. Though a large number of efforts have been dedicated to alleviating this pain point, no consensus has been made yet on which is optimal. In this paper, we study the automated architecture design from a new perspective that eliminates the need to sequentially evaluate each neural architecture generated during algorithm execution. Specifically, the proposed approach is built by learning the knowledge of high-level experts in designing state-of-the-art architectures, and then the new architecture is directly generated upon the knowledge learned. We implemented the proposed approach by using a graph neural network for link prediction and acquired the knowledge from NAS-Bench-101. Compared to existing peer competitors, we found a competitive network with minimal cost. In addition, we also utilized the learned knowledge from NAS-Bench-101 to automate architecture design in the DARTS search space, and achieved 97.82% accuracy on CIFAR10, and 76.51% top-1 accuracy on ImageNet consuming only $2\\times10^{-4}$ GPU days. This also demonstrates the high transferability of the proposed approach, and can potentially lead to a new, more computationally efficient paradigm in this research direction. ",
    "url": "https://arxiv.org/abs/2204.11838",
    "authors": [
      "Zixuan Liang",
      "Yanan Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.11839",
    "title": "AU-NN: ANFIS Unit Neural Network",
    "abstract": "In this paper is described the ANFIS Unit Neural Network, a deep neural network where each neuron is an independent ANFIS. Two use cases of this network are shown to test the capability of the network. (i) Classification of five imagined words. (ii) Incremental learning in the task of detecting Imagined Word Segments vs. Idle State Segments. In both cases, the proposed network outperforms the conventional methods. Additionally, is described a process of classification where instead of taking the whole instance as one example, each instance is decomposed into a set of smaller instances, and the classification is done by a majority vote over all the predictions of the set. The codes to build the AU-NN used in this paper, are available on the github repository https://github.com/tonahdztoro/AU_NN. ",
    "url": "https://arxiv.org/abs/2204.11839",
    "authors": [
      "Tonatiuh Hernández-del-Toro",
      "Carlos A. Reyes-García",
      "Luis Villaseñor-Pineda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.11840",
    "title": "Dynamic Ensemble Bayesian Filter for Robust Control of a Human  Brain-machine Interface",
    "abstract": "Objective: Brain-machine interfaces (BMIs) aim to provide direct brain control of devices such as prostheses and computer cursors, which have demonstrated great potential for mobility restoration. One major limitation of current BMIs lies in the unstable performance in online control due to the variability of neural signals, which seriously hinders the clinical availability of BMIs. Method: To deal with the neural variability in online BMI control, we propose a dynamic ensemble Bayesian filter (DyEnsemble). DyEnsemble extends Bayesian filters with a dynamic measurement model, which adjusts its parameters in time adaptively with neural changes. This is achieved by learning a pool of candidate functions and dynamically weighting and assembling them according to neural signals. In this way, DyEnsemble copes with variability in signals and improves the robustness of online control. Results: Online BMI experiments with a human participant demonstrate that, compared with the velocity Kalman filter, DyEnsemble significantly improves the control accuracy (increases the success rate by 13.9% and reduces the reach time by 13.5% in the random target pursuit task) and robustness (performs more stably over different experiment days). Conclusion: Our results demonstrate the superiority of DyEnsemble in online BMI control. Significance: DyEnsemble frames a novel and flexible framework for robust neural decoding, which is beneficial to different neural decoding applications. ",
    "url": "https://arxiv.org/abs/2204.11840",
    "authors": [
      "Yu Qi",
      "Xinyun Zhu",
      "Kedi Xu",
      "Feixiao Ren",
      "Hongjie Jiang",
      "Junming Zhu",
      "Jianmin Zhang",
      "Gang Pan",
      "Yueming Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2204.11847",
    "title": "SIReN-VAE: Leveraging Flows and Amortized Inference for Bayesian  Networks",
    "abstract": "Initial work on variational autoencoders assumed independent latent variables with simple distributions. Subsequent work has explored incorporating more complex distributions and dependency structures: including normalizing flows in the encoder network allows latent variables to entangle non-linearly, creating a richer class of distributions for the approximate posterior, and stacking layers of latent variables allows more complex priors to be specified for the generative model. This work explores incorporating arbitrary dependency structures, as specified by Bayesian networks, into VAEs. This is achieved by extending both the prior and inference network with graphical residual flows - residual flows that encode conditional independence by masking the weight matrices of the flow's residual blocks. We compare our model's performance on several synthetic datasets and show its potential in data-sparse settings. ",
    "url": "https://arxiv.org/abs/2204.11847",
    "authors": [
      "Jacobie Mouton",
      "Steve Kroon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.11848",
    "title": "On Leveraging Variational Graph Embeddings for Open World Compositional  Zero-Shot Learning",
    "abstract": "Humans are able to identify and categorize novel compositions of known concepts. The task in Compositional Zero-Shot learning (CZSL) is to learn composition of primitive concepts, i.e. objects and states, in such a way that even their novel compositions can be zero-shot classified. In this work, we do not assume any prior knowledge on the feasibility of novel compositions i.e.open-world setting, where infeasible compositions dominate the search space. We propose a Compositional Variational Graph Autoencoder (CVGAE) approach for learning the variational embeddings of the primitive concepts (nodes) as well as feasibility of their compositions (via edges). Such modelling makes CVGAE scalable to real-world application scenarios. This is in contrast to SOTA method, CGE, which is computationally very expensive. e.g.for benchmark C-GQA dataset, CGE requires 3.94 x 10^5 nodes, whereas CVGAE requires only 1323 nodes. We learn a mapping of the graph and image embeddings onto a common embedding space. CVGAE adopts a deep metric learning approach and learns a similarity metric in this space via bi-directional contrastive loss between projected graph and image embeddings. We validate the effectiveness of our approach on three benchmark datasets.We also demonstrate via an image retrieval task that the representations learnt by CVGAE are better suited for compositional generalization. ",
    "url": "https://arxiv.org/abs/2204.11848",
    "authors": [
      "Muhammad Umer Anwaar",
      "Zhihui Pan",
      "Martin Kleinsteuber"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.11852",
    "title": "Graph Auto-Encoders for Network Completion",
    "abstract": "Completing a graph means inferring the missing nodes and edges from a partially observed network. Different methods have been proposed to solve this problem, but none of them employed the pattern similarity of parts of the graph. In this paper, we propose a model to use the learned pattern of connections from the observed part of the network based on the Graph Auto-Encoder technique and generalize these patterns to complete the whole graph. Our proposed model achieved competitive performance with less information needed. Empirical analysis of synthetic datasets and real-world datasets from different domains show that our model can complete the network with higher accuracy compared with baseline prediction models in most cases. Furthermore, we also studied the character of the model and found it is particularly suitable to complete a network that has more complex local connection patterns. ",
    "url": "https://arxiv.org/abs/2204.11852",
    "authors": [
      "Zhang Zhang",
      "Ruyi Tao",
      "Yongzai Tao",
      "Jiang Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.11855",
    "title": "Discovering Gateway Ports in Maritime Using Temporal Graph Neural  Network Port Classification",
    "abstract": "Vessel navigation is influenced by various factors, such as dynamic environmental factors that change over time or static features such as vessel type or depth of the ocean. These dynamic and static navigational factors impose limitations on vessels, such as long waiting times in regions outside the actual ports, and we call these waiting regions gateway ports. Identifying gateway ports and their associated features such as congestion and available utilities can enhance vessel navigation by planning on fuel optimization or saving time in cargo operation. In this paper, we propose a novel temporal graph neural network (TGNN) based port classification method to enable vessels to discover gateway ports efficiently, thus optimizing their operations. The proposed method processes vessel trajectory data to build dynamic graphs capturing spatio-temporal dependencies between a set of static and dynamic navigational features in the data, and it is evaluated in terms of port classification accuracy on a real-world data set collected from ten vessels operating in Halifax, NS, Canada. The experimental results indicate that our TGNN-based port classification method provides an f-score of 95% in classifying ports. ",
    "url": "https://arxiv.org/abs/2204.11855",
    "authors": [
      "Dogan Altan",
      "Mohammad Etemad",
      "Dusica Marijan",
      "Tetyana Kholodna"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.11858",
    "title": "Data Uncertainty without Prediction Models",
    "abstract": "Data acquisition processes for machine learning are often costly. To construct a high-performance prediction model with fewer data, a degree of difficulty in prediction is often deployed as the acquisition function in adding a new data point. The degree of difficulty is referred to as uncertainty in prediction models. We propose an uncertainty estimation method named a Distance-weighted Class Impurity without explicit use of prediction models. We estimated uncertainty using distances and class impurities around the location, and compared it with several methods based on prediction models for uncertainty estimation by active learning tasks. We verified that the Distance-weighted Class Impurity works effectively regardless of prediction models. ",
    "url": "https://arxiv.org/abs/2204.11858",
    "authors": [
      "Bongjoon Park",
      "Eunkyung Koh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.11860",
    "title": "Multi-objective Pointer Network for Combinatorial Optimization",
    "abstract": "Multi-objective combinatorial optimization problems (MOCOPs), one type of complex optimization problems, widely exist in various real applications. Although meta-heuristics have been successfully applied to address MOCOPs, the calculation time is often much longer. Recently, a number of deep reinforcement learning (DRL) methods have been proposed to generate approximate optimal solutions to the combinatorial optimization problems. However, the existing studies on DRL have seldom focused on MOCOPs. This study proposes a single-model deep reinforcement learning framework, called multi-objective Pointer Network (MOPN), where the input structure of PN is effectively improved so that the single PN is capable of solving MOCOPs. In addition, two training strategies, based on representative model and transfer learning, respectively, are proposed to further enhance the performance of MOPN in different application scenarios. Moreover, compared to classical meta-heuristics, MOPN only consumes much less time on forward propagation to obtain the Pareto front. Meanwhile, MOPN is insensitive to problem scale, meaning that a trained MOPN is able to address MOCOPs with different scales. To verify the performance of MOPN, extensive experiments are conducted on three multi-objective traveling salesman problems, in comparison with one state-of-the-art model DRL-MOA and three classical multi-objective meta-heuristics. Experimental results demonstrate that the proposed model outperforms all the comparative methods with only 20\\% to 40\\% training time of DRL-MOA. ",
    "url": "https://arxiv.org/abs/2204.11860",
    "authors": [
      "Le-yang Gao",
      "Rui Wang",
      "Chuang Liu",
      "Zhao-hong Jia"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.11878",
    "title": "Comeback Kid: Resilience for Mixed-Critical Wireless Network Resource  Management",
    "abstract": "The future sixth generation (6G) of communication systems is envisioned to provide numerous applications in safety-critical contexts, e.g., driverless traffic, modular industry, and smart cities, which require outstanding performance, high reliability and fault tolerance, as well as autonomy. Ensuring criticality awareness for diverse functional safety applications and providing fault tolerance in an autonomous manner are essential for future 6G systems. Therefore, this paper proposes jointly employing the concepts of resilience and mixed criticality. In this contribution, we conduct physical layer resource management in cloud-based networks under the rate-splitting paradigm, which is a promising factor towards achieving high resilience. We recapitulate the concepts individually, outline a joint metric to measure the criticality-aware resilience, and verify its merits in a case study. We, thereby, formulate a non-convex optimization problem, derive an efficient iterative algorithm, propose four resilience mechanisms differing in quality and time of adaption, and conduct numerical simulations. Towards this end, a highly autonomous rate-splitting-enabled physical layer resource management algorithm for future 6G networks respecting mixed-critical QoS levels and providing high levels of resilience is proposed. Results emphasize the appreciable improvements of implementing mixed criticality-aware resilience under channel outages and strict quality of service (QoS) demands. The rate-splitting paradigm is particularly shown to overcome state-of-the-art interference management techniques, and the resilience and throughput adaption over consecutive outage events reveals the proposed schemes suitability for future 6G networks. ",
    "url": "https://arxiv.org/abs/2204.11878",
    "authors": [
      "Robert-Jeron Reifert",
      "Stefan Roth",
      "Alaa Alameer Ahmad",
      "Aydin Sezgin"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2204.11887",
    "title": "Evolutionary latent space search for driving human portrait generation",
    "abstract": "This article presents an evolutionary approach for synthetic human portraits generation based on the latent space exploration of a generative adversarial network. The idea is to produce different human face images very similar to a given target portrait. The approach applies StyleGAN2 for portrait generation and FaceNet for face similarity evaluation. The evolutionary search is based on exploring the real-coded latent space of StyleGAN2. The main results over both synthetic and real images indicate that the proposed approach generates accurate and diverse solutions, which represent realistic human portraits. The proposed research can contribute to improving the security of face recognition systems. ",
    "url": "https://arxiv.org/abs/2204.11887",
    "authors": [
      "Benjamín Machín",
      "Sergio Nesmachnow",
      "Jamal Toutouh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.11914",
    "title": "Generating and Visualizing Trace Link Explanations",
    "abstract": "Recent breakthroughs in deep-learning (DL) approaches have resulted in the dynamic generation of trace links that are far more accurate than was previously possible. However, DL-generated links lack clear explanations, and therefore non-experts in the domain can find it difficult to understand the underlying semantics of the link, making it hard for them to evaluate the link's correctness or suitability for a specific software engineering task. In this paper we present a novel NLP pipeline for generating and visualizing trace link explanations. Our approach identifies domain-specific concepts, retrieves a corpus of concept-related sentences, mines concept definitions and usage examples, and identifies relations between cross-artifact concepts in order to explain the links. It applies a post-processing step to prioritize the most likely acronyms and definitions and to eliminate non-relevant ones. We evaluate our approach using project artifacts from three different domains of interstellar telescopes, positive train control, and electronic health-care systems, and then report coverage, correctness, and potential utility of the generated definitions. We design and utilize an explanation interface which leverages concept definitions and relations to visualize and explain trace link rationales, and we report results from a user study that was conducted to evaluate the effectiveness of the explanation interface. Results show that the explanations presented in the interface helped non-experts to understand the underlying semantics of a trace link and improved their ability to vet the correctness of the link. ",
    "url": "https://arxiv.org/abs/2204.11914",
    "authors": [
      "Yalin Liu",
      "Jinfeng Lin",
      "Oghenemaro Anuyah",
      "Ronald Metoyer",
      "Jane Cleland-Huang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2204.11920",
    "title": "Quo Vadis, Optical Network Architecture? Towards an  Optical-processing-enabled Paradigm",
    "abstract": "Among various aspects in optical network architectures, handling transit traffic at intermediate nodes represents a defining characteristic for classification. In this context, the transition from the first generation of optical-electrical-optical (O-E-O) mode to the second generation of optical-bypass marked a paradigm shift in redesigning optical transport networks towards greater network efficiency. Optical-bypass operation has then become the \\textit{de facto} approach adopted by the majority of carriers in both metro and backbone networks in the last two decades and has remained basically unchanged. However, in optical-bypass network, the fact that in-transit lightpaths crossing a common intermediate node must be separated in either time, frequency or spatial domain to avoid adversarial interference appears to be a critical shortcoming as the interaction of such lightpaths in optical domain may result in efficient computing and/or signal processing operations for saving spectral resources. Inspired by the accelerated progresses in optical signal processing technologies and the integration of computing and communications, we introduce in this paper a new architectural paradigm for future optical networks and highlight how this new architecture has the potential to shatter the \\textit{status quo}. Indeed, our proposal is centered on exploiting the superposition of in-transit lightpaths at intermediate nodes to generate more spectrally efficient lightpaths and how to harness this opportunity from network design perspectives. We present two case studies featuring optical aggregation and optical XOR encoding to demonstrate the merit of optical-processing-enabled operation compared to its counterpart, optical-bypass. Numerical results on realistic network typologies are provided, revealing that a spectral saving up to $30\\%$ could be achieved thanks to adopting optical-processing network. ",
    "url": "https://arxiv.org/abs/2204.11920",
    "authors": [
      "Dao Thanh Hai"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2204.11927",
    "title": "Fractional Graph Coloring for Functional Compression with Side  Information",
    "abstract": "We describe a rational approach to reduce the computational and communication complexities of lossless point-to-point compression for computation with side information. The traditional method relies on building a characteristic graph with vertices representing the source symbols and with edges that assign a source symbol to a collection of independent sets to be distinguished for the exact recovery of the function. Our approach uses fractional coloring for a b-fold coloring of characteristic graphs to provide a linear programming relaxation to the traditional coloring method and achieves coding at a fine-grained granularity. We derive the fundamental lower bound for compression, given by the fractional characteristic graph entropy, through generalizing the notion of K\\\"orner's graph entropy. We demonstrate the coding gains of fractional coloring over traditional coloring via a computation example. We conjecture that the integrality gap between fractional coloring and traditional coloring approaches the smallest b that attains the fractional chromatic number to losslessly represent the independent sets for a given characteristic graph, up to a linear scaling which is a function of the fractional chromatic number. ",
    "url": "https://arxiv.org/abs/2204.11927",
    "authors": [
      "Derya Malak"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2204.11939",
    "title": "Robust Dual-Graph Regularized Moving Object Detection",
    "abstract": "Moving object detection and its associated background-foreground separation have been widely used in a lot of applications, including computer vision, transportation and surveillance. Due to the presence of the static background, a video can be naturally decomposed into a low-rank background and a sparse foreground. Many regularization techniques, such as matrix nuclear norm, have been imposed on the background. In the meanwhile, sparsity or smoothness based regularizations, such as total variation and $\\ell_1$, can be imposed on the foreground. Moreover, graph Laplacians are further imposed to capture the complicated geometry of background images. Recently, weighted regularization techniques including the weighted nuclear norm regularization have been proposed in the image processing community to promote adaptive sparsity while achieving efficient performance. In this paper, we propose a robust dual-graph regularized moving object detection model based on the weighted nuclear norm regularization, which is solved by the alternating direction method of multipliers (ADMM). Numerical experiments on body movement data sets have demonstrated the effectiveness of this method in separating moving objects from background, and the great potential in robotic applications. ",
    "url": "https://arxiv.org/abs/2204.11939",
    "authors": [
      "Jing Qin",
      "Ruilong Shen",
      "Ruihan Zhu",
      "Biyun Xie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2204.11951",
    "title": "Byzantine-Resilient Counting in Networks",
    "abstract": "We present two distributed algorithms for the {\\em Byzantine counting problem}, which is concerned with estimating the size of a network in the presence of a large number of Byzantine nodes. In an $n$-node network ($n$ is unknown), our first algorithm, which is {\\em deterministic}, finishes in $O(\\log{n})$ rounds and is time-optimal. This algorithm can tolerate up to $O(n^{1 - \\gamma})$ arbitrarily (adversarially) placed Byzantine nodes for any arbitrarily small (but fixed) positive constant $\\gamma$. It outputs a (fixed) constant factor estimate of $\\log{n}$ that would be known to all but $o(1)$ fraction of the good nodes. This algorithm works for \\emph{any} bounded degree expander network. However, this algorithms assumes that good nodes can send arbitrarily large-sized messages in a round. Our second algorithm is {\\em randomized} and most good nodes send only small-sized messages (Throughout this paper, a small-sized message is defined to be one that contains $O(\\log{n})$ bits in addition to at most a constant number of node IDs.). This algorithm works in \\emph{almost all} $d$-regular graphs. It tolerates up to $B(n) = n^{\\frac{1}{2} - \\xi}$ (note that $n$ and $B(n)$ are unknown to the algorithm) arbitrarily (adversarially) placed Byzantine nodes, where $\\xi$ is any arbitrarily small (but fixed) positive constant. This algorithm takes $O(B(n)\\log^2{n})$ rounds and outputs a (fixed) constant factor estimate of $\\log{n}$ with probability at least $1 - o(1)$. The said estimate is known to most nodes, i.e., $\\geq (1 - \\beta)n$ nodes for any arbitrarily small (but fixed) positive constant $\\beta$. To complement our algorithms, we also present an impossibility result that shows that it is impossible to estimate the network size with any reasonable approximation with any non-trivial probability of success if the network does not have sufficient vertex expansion. ",
    "url": "https://arxiv.org/abs/2204.11951",
    "authors": [
      "Soumyottam Chatterjee",
      "Gopal Pandurangan",
      "Peter Robinson"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2204.11955",
    "title": "The non-GRS properties for the twisted generalized Reed-Solomon code and  its extended code",
    "abstract": "In 2017, Beelen et al. firstly introduced twisted generalized Reed-Solomon (in short, TGRS) codes, and constructed a large subclass of MDS TGRS codes. Later, they proved that TGRS code is non-GRS when the code rate is less than one half. In this letter, basing on the dual code of the TGRS code or the extended TGRS code, by using the Schur product, we prove that almost all of TGRS codes and extended TGRS codes are non-GRS when the code rate more than one half. ",
    "url": "https://arxiv.org/abs/2204.11955",
    "authors": [
      "Canze Zhu",
      "Qunying Liao"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2204.11981",
    "title": "End-to-end Mapping in Heterogeneous Systems Using Graph Representation  Learning",
    "abstract": "To enable heterogeneous computing systems with autonomous programming and optimization capabilities, we propose a unified, end-to-end, programmable graph representation learning (PGL) framework that is capable of mining the complexity of high-level programs down to the universal intermediate representation, extracting the specific computational patterns and predicting which code segments would run best on a specific core in heterogeneous hardware platforms. The proposed framework extracts multi-fractal topological features from code graphs, utilizes graph autoencoders to learn how to partition the graph into computational kernels, and exploits graph neural networks (GNN) to predict the correct assignment to a processor type. In the evaluation, we validate the PGL framework and demonstrate a maximum speedup of 6.42x compared to the thread-based execution, and 2.02x compared to the state-of-the-art technique. ",
    "url": "https://arxiv.org/abs/2204.11981",
    "authors": [
      "Yao Xiao",
      "Guixiang Ma",
      "Nesreen K. Ahmed",
      "Mihai Capota",
      "Theodore Willke",
      "Shahin Nazarian",
      "Paul Bogdan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2204.11985",
    "title": "When adversarial examples are excusable",
    "abstract": "Neural networks work remarkably well in practice and theoretically they can be universal approximators. However, they still make mistakes and a specific type of them called adversarial errors seem inexcusable to humans. In this work, we analyze both test errors and adversarial errors on a well controlled but highly non-linear visual classification problem. We find that, when approximating training on infinite data, test errors tend to be close to the ground truth decision boundary. Qualitatively speaking these are also more difficult for a human. By contrast, adversarial examples can be found almost everywhere and are often obvious mistakes. However, when we constrain adversarial examples to the manifold, we observe a 90\\% reduction in adversarial errors. If we inflate the manifold by training with Gaussian noise we observe a similar effect. In both cases, the remaining adversarial errors tend to be close to the ground truth decision boundary. Qualitatively, the remaining adversarial errors are similar to test errors on difficult examples. They do not have the customary quality of being inexcusable mistakes. ",
    "url": "https://arxiv.org/abs/2204.11985",
    "authors": [
      "Pieter-Jan Kindermans",
      "Charles Staats"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.12024",
    "title": "Reprint: a randomized extrapolation based on principal components for  data augmentation",
    "abstract": "Data scarcity and data imbalance have attracted a lot of attention in many fields. Data augmentation, explored as an effective approach to tackle them, can improve the robustness and efficiency of classification models by generating new samples. This paper presents REPRINT, a simple and effective hidden-space data augmentation method for imbalanced data classification. Given hidden-space representations of samples in each class, REPRINT extrapolates, in a randomized fashion, augmented examples for target class by using subspaces spanned by principal components to summarize distribution structure of both source and target class. Consequently, the examples generated would diversify the target while maintaining the original geometry of target distribution. Besides, this method involves a label refinement component which allows to synthesize new soft labels for augmented examples. Compared with different NLP data augmentation approaches under a range of data imbalanced scenarios on four text classification benchmark, REPRINT shows prominent improvements. Moreover, through comprehensive ablation studies, we show that label refinement is better than label-preserving for augmented examples, and that our method suggests stable and consistent improvements in terms of suitable choices of principal components. Moreover, REPRINT is appealing for its easy-to-use since it contains only one hyperparameter determining the dimension of subspace and requires low computational resource. ",
    "url": "https://arxiv.org/abs/2204.12024",
    "authors": [
      "Jiale Wei",
      "Qiyuan Chen",
      "Pai Peng",
      "Benjamin Guedj",
      "Le Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.12027",
    "title": "On Routing, Wavelength, Network Coding Assignment and Protection  Configuration Problem in Optical-processing-enabled Networks",
    "abstract": "In optical-processing-enabled network, transitional lightpaths crossing the same node could be optically encoded to each other to achieve greater spectral efficiency. In this context, we present a new research problem, entitled, routing, wavelength, network coding assignment and protection configuration (RWNCA-PC) arisen in exploiting photonic network coding (NC) for dedicated path protection in wavelength division multiplexing (WDM) networks with an extra degree of freedom in the selection of protection triggering mechanism, that is, network-side and client-side, tailoring to each connection. In order to maximize the NC benefits, we thus provide a weighted multi-objective optimization model for solving RWNCA-PC problem so as to minimize the wavelength count as the strictly prioritized goal and the redundant resources measured by the number of client-side connections as the secondary objective. Numerical results on the realistic COST239 network reveal that a saving of up to $25\\%$ wavelength resources could be achieved thanks to the optimal use of NC compared to the non-coding designs and among coding-aware designs, the use of mixed protection configurations would be spectrally more efficient than the design with only network-side protection scheme. Our proposal yields the highest spectrum efficiency compared to all reference designs and moreover, features an average saving of more than $40\\%$ transponder count compared with its single objective counterpart. ",
    "url": "https://arxiv.org/abs/2204.12027",
    "authors": [
      "Dao Thanh Hai"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2204.12036",
    "title": "Adaptive Pseudo-Siamese Policy Network for Temporal Knowledge Prediction",
    "abstract": "Temporal knowledge prediction is a crucial task for the event early warning that has gained increasing attention in recent years, which aims to predict the future facts by using relevant historical facts on the temporal knowledge graphs. There are two main difficulties in this prediction task. First, from the historical facts point of view, how to model the evolutionary patterns of the facts to predict the query accurately. Second, from the query perspective, how to handle the two cases where the query contains seen and unseen entities in a unified framework. Driven by the two problems, we propose a novel adaptive pseudo-siamese policy network for temporal knowledge prediction based on reinforcement learning. Specifically, we design the policy network in our model as a pseudo-siamese policy network that consists of two sub-policy networks. In sub-policy network I, the agent searches for the answer for the query along the entity-relation paths to capture the static evolutionary patterns. And in sub-policy network II, the agent searches for the answer for the query along the relation-time paths to deal with unseen entities. Moreover, we develop a temporal relation encoder to capture the temporal evolutionary patterns. Finally, we design a gating mechanism to adaptively integrate the results of the two sub-policy networks to help the agent focus on the destination answer. To assess our model performance, we conduct link prediction on four benchmark datasets, the experimental results demonstrate that our method obtains considerable performance compared with existing methods. ",
    "url": "https://arxiv.org/abs/2204.12036",
    "authors": [
      "Pengpeng Shao",
      "Tong Liu",
      "Feihu Che",
      "Dawei Zhang",
      "Jianhua Tao"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12037",
    "title": "Causal Reasoning with Spatial-temporal Representation Learning: A  Prospective Study",
    "abstract": "Spatial-temporal representation learning is ubiquitous in various real-world applications, including visual comprehension, video understanding, multi-modal analysis, human-computer interaction, and urban computing. Due to the emergence of huge amounts of multi-modal heterogeneous spatial/temporal/spatial-temporal data in big data era, the existing visual methods rely heavily on large-scale data annotations and supervised learning to learn a powerful big model. However, the lack of interpretability, robustness, and out-of-distribution generalization are becoming the bottleneck problems of these models, which hinders the progress of interpretable and reliable artificial intelligence. The majority of the existing methods are based on correlation learning with the assumption that the data are independent and identically distributed, which lack an unified guidance and analysis about why modern spatial-temporal representation learning methods have limited interpretability and easily collapse into dataset bias. Inspired by the strong inference ability of human-level agents, recent years have therefore witnessed great effort in developing causal reasoning paradigms to realize robust representation and model learning with good interpretability. In this paper, we conduct a comprehensive review of existing causal reasoning methods for spatial-temporal representation learning, covering fundamental theories, models, and datasets. The limitations of current methods and datasets are also discussed. Moreover, we propose some primary challenges, opportunities, and future research directions for benchmarking causal reasoning algorithms in spatial-temporal representation learning. ",
    "url": "https://arxiv.org/abs/2204.12037",
    "authors": [
      "Yang Liu",
      "Yushen Wei",
      "Hong Yan",
      "Guanbin Li",
      "Liang Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2204.12050",
    "title": "Self-recoverable Adversarial Examples: A New Effective Protection  Mechanism in Social Networks",
    "abstract": "Malicious intelligent algorithms greatly threaten the security of social users' privacy by detecting and analyzing the uploaded photos to social network platforms. The destruction to DNNs brought by the adversarial attack sparks the potential that adversarial examples serve as a new protection mechanism for privacy security in social networks. However, the existing adversarial example does not have recoverability for serving as an effective protection mechanism. To address this issue, we propose a recoverable generative adversarial network to generate self-recoverable adversarial examples. By modeling the adversarial attack and recovery as a united task, our method can minimize the error of the recovered examples while maximizing the attack ability, resulting in better recoverability of adversarial examples. To further boost the recoverability of these examples, we exploit a dimension reducer to optimize the distribution of adversarial perturbation. The experimental results prove that the adversarial examples generated by the proposed method present superior recoverability, attack ability, and robustness on different datasets and network architectures, which ensure its effectiveness as a protection mechanism in social networks. ",
    "url": "https://arxiv.org/abs/2204.12050",
    "authors": [
      "Jiawei Zhang",
      "Jinwei Wang",
      "Hao Wang",
      "Xiangyang Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12055",
    "title": "Faster Fundamental Graph Algorithms via Learned Predictions",
    "abstract": "We consider the question of speeding up classic graph algorithms with machine-learned predictions. In this model, algorithms are furnished with extra advice learned from past or similar instances. Given the additional information, we aim to improve upon the traditional worst-case run-time guarantees. Our contributions are the following: (i) We give a faster algorithm for minimum-weight bipartite matching via learned duals, improving the recent result by Dinitz, Im, Lavastida, Moseley and Vassilvitskii (NeurIPS, 2021); (ii) We extend the learned dual approach to the single-source shortest path problem (with negative edge lengths), achieving an almost linear runtime given sufficiently accurate predictions which improves upon the classic fastest algorithm due to Goldberg (SIAM J. Comput., 1995); (iii) We provide a general reduction-based framework for learning-based graph algorithms, leading to new algorithms for degree-constrained subgraph and minimum-cost $0$-$1$ flow, based on reductions to bipartite matching and the shortest path problem. Finally, we give a set of general learnability theorems, showing that the predictions required by our algorithms can be efficiently learned in a PAC fashion. ",
    "url": "https://arxiv.org/abs/2204.12055",
    "authors": [
      "Justin Y. Chen",
      "Sandeep Silwal",
      "Ali Vakilian",
      "Fred Zhang"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2204.12061",
    "title": "PLOD: An Abbreviation Detection Dataset for Scientific Documents",
    "abstract": "The detection and extraction of abbreviations from unstructured texts can help to improve the performance of Natural Language Processing tasks, such as machine translation and information retrieval. However, in terms of publicly available datasets, there is not enough data for training deep-neural-networks-based models to the point of generalising well over data. This paper presents PLOD, a large-scale dataset for abbreviation detection and extraction that contains 160k+ segments automatically annotated with abbreviations and their long forms. We performed manual validation over a set of instances and a complete automatic validation for this dataset. We then used it to generate several baseline models for detecting abbreviations and long forms. The best models achieved an F1-score of 0.92 for abbreviations and 0.89 for detecting their corresponding long forms. We release this dataset along with our code and all the models publicly in https://github.com/surrey-nlp/AbbreviationDetRepo. ",
    "url": "https://arxiv.org/abs/2204.12061",
    "authors": [
      "Leonardo Zilio",
      "Hadeel Saadany",
      "Prashant Sharma",
      "Diptesh Kanojia",
      "Constantin Orasan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.12063",
    "title": "A Review-aware Graph Contrastive Learning Framework for Recommendation",
    "abstract": "Most modern recommender systems predict users preferences with two components: user and item embedding learning, followed by the user-item interaction modeling. By utilizing the auxiliary review information accompanied with user ratings, many of the existing review-based recommendation models enriched user/item embedding learning ability with historical reviews or better modeled user-item interactions with the help of available user-item target reviews. Though significant progress has been made, we argue that current solutions for review-based recommendation suffer from two drawbacks. First, as review-based recommendation can be naturally formed as a user-item bipartite graph with edge features from corresponding user-item reviews, how to better exploit this unique graph structure for recommendation? Second, while most current models suffer from limited user behaviors, can we exploit the unique self-supervised signals in the review-aware graph to guide two recommendation components better? To this end, in this paper, we propose a novel Review-aware Graph Contrastive Learning (RGCL) framework for review-based recommendation. Specifically, we first construct a review-aware user-item graph with feature-enhanced edges from reviews, where each edge feature is composed of both the user-item rating and the corresponding review semantics. This graph with feature-enhanced edges can help attentively learn each neighbor node weight for user and item representation learning. After that, we design two additional contrastive learning tasks (i.e., Node Discrimination and Edge Discrimination) to provide self-supervised signals for the two components in recommendation process. Finally, extensive experiments over five benchmark datasets demonstrate the superiority of our proposed RGCL compared to the state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2204.12063",
    "authors": [
      "Jie Shuai",
      "Kun Zhang",
      "Le Wu",
      "Peijie Sun",
      "Richang Hong",
      "Meng Wang",
      "Yong Li"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2204.12079",
    "title": "Exact Wirelength of Embedding 3-Ary n-Cubes into certain Cylinders and  Trees",
    "abstract": "Graph embeddings play a significant role in the design and analysis of parallel algorithms. It is a mapping of the topological structure of a guest graph G into a host graph H, which is represented as a one-to-one mapping from the vertex set of the guest graph to the vertex set of the host graph. In multiprocessing systems the interconnection networks enhance the efficient communication between the components in the system. Obtaining minimum wirelength in embedding problems is significant in the designing of network and simulating one architecture by another. In this paper, we determine the wirelength of embedding 3-ary n-cubes into cylinders and certain trees. ",
    "url": "https://arxiv.org/abs/2204.12079",
    "authors": [
      "Rajeshwari S",
      "M Rajesh"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2204.12081",
    "title": "Cyber-Physical Vulnerability Assessment of P2P Energy Exchanges in  Active Distribution Networks",
    "abstract": "Owing to the decreasing costs of distributed energy resources (DERs) as well as decarbonization policies, power systems are undergoing a modernization process. The large deployment of DERs together with internet of things (IoT) devices provide a platform for peer-to-peer (P2P) energy trading in active distribution networks. However, P2P energy trading with IoT devices have driven the grid more vulnerable to cyber-physical threats. To this end, in this paper, a resilience-oriented P2P energy exchange model is developed considering three phase unbalanced distribution systems. In addition, various scenarios for vulnerability assessment of P2P energy exchanges considering adverse prosumers and consumers, who provide false information regarding the price and quantity with the goal of maximum financial benefit and system operation disruption, are considered. Techno-economic survivability analysis against these attacks are investigated on a IEEE 13-node unbalanced distribution test system. Simulation results demonstrate that adverse peers can affect the physical operation of grid, maximize their benefits, and cause financial loss of other agents. ",
    "url": "https://arxiv.org/abs/2204.12081",
    "authors": [
      "Hamed Haggi",
      "Wei Sun"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.12085",
    "title": "Time Series Prediction by Multi-task GPR with Spatiotemporal Information  Transformation",
    "abstract": "Making an accurate prediction of an unknown system only from a short-term time series is difficult due to the lack of sufficient information, especially in a multi-step-ahead manner. However, a high-dimensional short-term time series contains rich dynamical information, and also becomes increasingly available in many fields. In this work, by exploiting spatiotemporal information (STI) transformation scheme that transforms such high-dimensional/spatial information to temporal information, we developed a new method called MT-GPRMachine to achieve accurate prediction from a short-term time series. Specifically, we first construct a specific multi-task GPR which is multiple linked STI mappings to transform high dimensional/spatial information into temporal/dynamical information of any given target variable, and then makes multi step-ahead prediction of the target variable by solving those STI mappings. The multi-step-ahead prediction results on various synthetic and real-world datasets clearly validated that MT-GPRMachine outperformed other existing approaches. ",
    "url": "https://arxiv.org/abs/2204.12085",
    "authors": [
      "Peng Tao",
      "Xiaohu Hao",
      "Jie Cheng",
      "Luonan Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12088",
    "title": "A physics-informed deep neural network for surrogate modeling in  classical elasto-plasticity",
    "abstract": "In this work, we present a deep neural network architecture that can efficiently approximate classical elasto-plastic constitutive relations. The network is enriched with crucial physics aspects of classical elasto-plasticity, including additive decomposition of strains into elastic and plastic parts, and nonlinear incremental elasticity. This leads to a Physics-Informed Neural Network (PINN) surrogate model named here as Elasto-Plastic Neural Network (EPNN). Detailed analyses show that embedding these physics into the architecture of the neural network facilitates a more efficient training of the network with less training data, while also enhancing the extrapolation capability for loading regimes outside the training data. The architecture of EPNN is model and material-independent, i.e. it can be adapted to a wide range of elasto-plastic material types, including geomaterials and metals; and experimental data can potentially be directly used in training the network. To demonstrate the robustness of the proposed architecture, we adapt its general framework to the elasto-plastic behavior of sands. We use synthetic data generated from material point simulations based on a relatively advanced dilatancy-based constitutive model for granular materials to train the neural network. The superiority of EPNN over regular neural network architectures is explored through predicting unseen strain-controlled loading paths for sands with different initial densities. ",
    "url": "https://arxiv.org/abs/2204.12088",
    "authors": [
      "Mahdad Eghbalian",
      "Mehdi Pouragha",
      "Richard Wan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2204.12093",
    "title": "Approach to Predicting News -- A Precise Multi-LSTM Network With BERT",
    "abstract": "Varieties of Democracy (V-Dem) is a new approach to conceptualizing and measuring democracy and politics. It has information for 200 countries and is one of the biggest databases for political science. According to the V-Dem annual democracy report 2019, Taiwan is one of the two countries that got disseminated false information from foreign governments the most. It also shows that the \"made-up news\" has caused a great deal of confusion in Taiwanese society and has serious impacts on global stability. Although there are several applications helping distinguish the false information, we found out that the pre-processing of categorizing the news is still done by human labor. However, human labor may cause mistakes and cannot work for a long time. The growing demands for automatic machines in the near decades show that while the machine can do as good as humans or even better, using machines can reduce humans' burden and cut down costs. Therefore, in this work, we build a predictive model to classify the category of news. The corpora we used contains 28358 news and 200 news scraped from the online newspaper Liberty Times Net (LTN) website and includes 8 categories: Technology, Entertainment, Fashion, Politics, Sports, International, Finance, and Health. At first, we use Bidirectional Encoder Representations from Transformers (BERT) for word embeddings which transform each Chinese character into a (1,768) vector. Then, we use a Long Short-Term Memory (LSTM) layer to transform word embeddings into sentence embeddings and add another LSTM layer to transform them into document embeddings. Each document embedding is an input for the final predicting model, which contains two Dense layers and one Activation layer. And each document embedding is transformed into 1 vector with 8 real numbers, then the highest one will correspond to the 8 news categories with up to 99% accuracy. ",
    "url": "https://arxiv.org/abs/2204.12093",
    "authors": [
      "Chia-Lin Chen",
      "Pei-Yu Huang",
      "Yi-Ting Huang",
      "Chun Lin"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.12095",
    "title": "PyGOD: A Python Library for Graph Outlier Detection",
    "abstract": "PyGOD is an open-source Python library for detecting outliers on graph data. As the first comprehensive library of its kind, PyGOD supports a wide array of leading graph-based methods for node-, edge-, subgraph-, and graph-level outlier detection, under a unified, well-documented API designed for use by both researchers and practitioners. To overcome the scalability issue in large graphs, we provide advanced functionalities for selected models, including mini-batch and sampling. PyGOD is equipped with best practices to foster code reliability and maintainability, including unit testing, continuous integration, and code coverage. To foster accessibility, PyGOD is released under a permissive BSD-license at https://github.com/pygod-team/pygod/ and the Python Package Index (PyPI). ",
    "url": "https://arxiv.org/abs/2204.12095",
    "authors": [
      "Kay Liu",
      "Yingtong Dou",
      "Yue Zhao",
      "Xueying Ding",
      "Xiyang Hu",
      "Ruitong Zhang",
      "Kaize Ding",
      "Canyu Chen",
      "Hao Peng",
      "Kai Shu",
      "George H. Chen",
      "Zhihao Jia",
      "Philip S. Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.12111",
    "title": "Function-words Enhanced Attention Networks for Few-Shot Inverse Relation  Classification",
    "abstract": "The relation classification is to identify semantic relations between two entities in a given text. While existing models perform well for classifying inverse relations with large datasets, their performance is significantly reduced for few-shot learning. In this paper, we propose a function words adaptively enhanced attention framework (FAEA) for few-shot inverse relation classification, in which a hybrid attention model is designed to attend class-related function words based on meta-learning. As the involvement of function words brings in significant intra-class redundancy, an adaptive message passing mechanism is introduced to capture and transfer inter-class differences.We mathematically analyze the negative impact of function words from dot-product measurement, which explains why message passing mechanism effectively reduces the impact. Our experimental results show that FAEA outperforms strong baselines, especially the inverse relation accuracy is improved by 14.33% under 1-shot setting in FewRel1.0. ",
    "url": "https://arxiv.org/abs/2204.12111",
    "authors": [
      "Chunliu Dou",
      "Shaojuan Wu",
      "Xiaowang Zhang",
      "Zhiyong Feng",
      "Kewen Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.12112",
    "title": "Reformulating Speaker Diarization as Community Detection With Emphasis  On Topological Structure",
    "abstract": "Clustering-based speaker diarization has stood firm as one of the major approaches in reality, despite recent development in end-to-end diarization. However, clustering methods have not been explored extensively for speaker diarization. Commonly-used methods such as k-means, spectral clustering, and agglomerative hierarchical clustering only take into account properties such as proximity and relative densities. In this paper we propose to view clustering-based diarization as a community detection problem. By doing so the topological structure is considered. This work has four major contributions. First it is shown that Leiden community detection algorithm significantly outperforms the previous methods on the clustering of speaker-segments. Second, we propose to use uniform manifold approximation to reduce dimension while retaining global and local topological structure. Third, a masked filtering approach is introduced to extract \"clean\" speaker embeddings. Finally, the community structure is applied to an end-to-end post-processing network to obtain diarization results. The final system presents a relative DER reduction of up to 70 percent. The breakdown contribution of each component is analyzed. ",
    "url": "https://arxiv.org/abs/2204.12112",
    "authors": [
      "Siqi Zheng",
      "Hongbin Suo"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.12125",
    "title": "A Robust Contrastive Alignment Method For Multi-Domain Text  Classification",
    "abstract": "Multi-domain text classification can automatically classify texts in various scenarios. Due to the diversity of human languages, texts with the same label in different domains may differ greatly, which brings challenges to the multi-domain text classification. Current advanced methods use the private-shared paradigm, capturing domain-shared features by a shared encoder, and training a private encoder for each domain to extract domain-specific features. However, in realistic scenarios, these methods suffer from inefficiency as new domains are constantly emerging. In this paper, we propose a robust contrastive alignment method to align text classification features of various domains in the same feature space by supervised contrastive learning. By this means, we only need two universal feature extractors to achieve multi-domain text classification. Extensive experimental results show that our method performs on par with or sometimes better than the state-of-the-art method, which uses the complex multi-classifier in a private-shared framework. ",
    "url": "https://arxiv.org/abs/2204.12125",
    "authors": [
      "Xuefeng Li",
      "Hao Lei",
      "Liwen Wang",
      "Guanting Dong",
      "Jinzheng Zhao",
      "Jiachi Liu",
      "Weiran Xu",
      "Chunyun Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.12139",
    "title": "Neural Maximum A Posteriori Estimation on Unpaired Data for Motion  Deblurring",
    "abstract": "Real-world dynamic scene deblurring has long been a challenging task since paired blurry-sharp training data is unavailable. Conventional Maximum A Posteriori estimation and deep learning-based deblurring methods are restricted by handcrafted priors and synthetic blurry-sharp training pairs respectively, thereby failing to generalize to real dynamic blurriness. To this end, we propose a Neural Maximum A Posteriori (NeurMAP) estimation framework for training neural networks to recover blind motion information and sharp content from unpaired data. The proposed NeruMAP consists of a motion estimation network and a deblurring network which are trained jointly to model the (re)blurring process (i.e. likelihood function). Meanwhile, the motion estimation network is trained to explore the motion information in images by applying implicit dynamic motion prior, and in return enforces the deblurring network training (i.e. providing sharp image prior). The proposed NeurMAP is an orthogonal approach to existing deblurring neural networks, and is the first framework that enables training image deblurring networks on unpaired datasets. Experiments demonstrate our superiority on both quantitative metrics and visual quality over state-of-the-art methods. Codes are available on https://github.com/yjzhang96/NeurMAP-deblur. ",
    "url": "https://arxiv.org/abs/2204.12139",
    "authors": [
      "Youjian Zhang",
      "Chaoyue Wang",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.12143",
    "title": "Deeper Insights into ViTs Robustness towards Common Corruptions",
    "abstract": "Recent literature have shown design strategies from Convolutions Neural Networks (CNNs) benefit Vision Transformers (ViTs) in various vision tasks. However, it remains unclear how these design choices impact on robustness when transferred to ViTs. In this paper, we make the first attempt to investigate how CNN-like architectural designs and CNN-based data augmentation strategies impact on ViTs' robustness towards common corruptions through an extensive and rigorous benchmarking. We demonstrate that overlapping patch embedding and convolutional Feed-Forward Network (FFN) boost performance on robustness. Furthermore, adversarial noise training is powerful on ViTs while fourier-domain augmentation fails. Moreover, we introduce a novel conditional method enabling input-varied augmentations from two angles: (1) Generating dynamic augmentation parameters conditioned on input images. It conduces to state-of-the-art performance on robustness through conditional convolutions; (2) Selecting most suitable augmentation strategy by an extra predictor helps to achieve the best trade-off between clean accuracy and robustness. ",
    "url": "https://arxiv.org/abs/2204.12143",
    "authors": [
      "Rui Tian",
      "Zuxuan Wu",
      "Qi Dai",
      "Han Hu",
      "Yugang Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12150",
    "title": "Where and What: Driver Attention-based Object Detection",
    "abstract": "Human drivers use their attentional mechanisms to focus on critical objects and make decisions while driving. As human attention can be revealed from gaze data, capturing and analyzing gaze information has emerged in recent years to benefit autonomous driving technology. Previous works in this context have primarily aimed at predicting \"where\" human drivers look at and lack knowledge of \"what\" objects drivers focus on. Our work bridges the gap between pixel-level and object-level attention prediction. Specifically, we propose to integrate an attention prediction module into a pretrained object detection framework and predict the attention in a grid-based style. Furthermore, critical objects are recognized based on predicted attended-to areas. We evaluate our proposed method on two driver attention datasets, BDD-A and DR(eye)VE. Our framework achieves competitive state-of-the-art performance in the attention prediction on both pixel-level and object-level but is far more efficient (75.3 GFLOPs less) in computation. ",
    "url": "https://arxiv.org/abs/2204.12150",
    "authors": [
      "Yao Rong",
      "Naemi-Rebecca Kassautzki",
      "Wolfgang Fuhl",
      "Enkelejda Kasneci"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2204.12159",
    "title": "Coefficient Mutation in the Gene-pool Optimal Mixing Evolutionary  Algorithm for Symbolic Regression",
    "abstract": "Currently, the genetic programming version of the gene-pool optimal mixing evolutionary algorithm (GP-GOMEA) is among the top-performing algorithms for symbolic regression (SR). A key strength of GP-GOMEA is its way of performing variation, which dynamically adapts to the emergence of patterns in the population. However, GP-GOMEA lacks a mechanism to optimize coefficients. In this paper, we study how fairly simple approaches for optimizing coefficients can be integrated into GP-GOMEA. In particular, we considered two variants of Gaussian coefficient mutation. We performed experiments using different settings on 23 benchmark problems, and used machine learning to estimate what aspects of coefficient mutation matter most. We find that the most important aspect is that the number of coefficient mutation attempts needs to be commensurate with the number of mixing operations that GP-GOMEA performs. We applied GP-GOMEA with the best-performing coefficient mutation approach to the data sets of SRBench, a large SR benchmark, for which a ground-truth underlying equation is known. We find that coefficient mutation can help re-discovering the underlying equation by a substantial amount, but only when no noise is added to the target variable. In the presence of noise, GP-GOMEA with coefficient mutation discovers alternative but similarly-accurate equations. ",
    "url": "https://arxiv.org/abs/2204.12159",
    "authors": [
      "Marco Virgolin",
      "Peter A. N. Bosman"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.12165",
    "title": "When do Contrastive Word Alignments Improve Many-to-many Neural Machine  Translation?",
    "abstract": "Word alignment has proven to benefit many-to-many neural machine translation (NMT). However, high-quality ground-truth bilingual dictionaries were used for pre-editing in previous methods, which are unavailable for most language pairs. Meanwhile, the contrastive objective can implicitly utilize automatically learned word alignment, which has not been explored in many-to-many NMT. This work proposes a word-level contrastive objective to leverage word alignments for many-to-many NMT. Empirical results show that this leads to 0.8 BLEU gains for several language pairs. Analyses reveal that in many-to-many NMT, the encoder's sentence retrieval performance highly correlates with the translation quality, which explains when the proposed method impacts translation. This motivates future exploration for many-to-many NMT to improve the encoder's sentence retrieval performance. ",
    "url": "https://arxiv.org/abs/2204.12165",
    "authors": [
      "Zhuoyuan Mao",
      "Chenhui Chu",
      "Raj Dabre",
      "Haiyue Song",
      "Zhen Wan",
      "Sadao Kurohashi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.12202",
    "title": "Urban Change Detection Using a Dual-Task Siamese Network and  Semi-Supervised Learning",
    "abstract": "In this study, a Semi-Supervised Learning (SSL) method for improving urban change detection from bi-temporal image pairs was presented. The proposed method adapted a Dual-Task Siamese Difference network that not only predicts changes with the difference decoder, but also segments buildings for both images with a semantics decoder. First, the architecture was modified to produce a second change prediction derived from the semantics predictions. Second, SSL was adopted to improve supervised change detection. For unlabeled data, we introduced a loss that encourages the network to predict consistent changes across the two change outputs. The proposed method was tested on urban change detection using the SpaceNet7 dataset. SSL achieved improved results compared to three fully supervised benchmarks. ",
    "url": "https://arxiv.org/abs/2204.12202",
    "authors": [
      "Sebastian Hafner",
      "Yifang Ban",
      "Andrea Nascetti"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12204",
    "title": "Boosting Adversarial Transferability of MLP-Mixer",
    "abstract": "The security of models based on new architectures such as MLP-Mixer and ViTs needs to be studied urgently. However, most of the current researches are mainly aimed at the adversarial attack against ViTs, and there is still relatively little adversarial work on MLP-mixer. We propose an adversarial attack method against MLP-Mixer called Maxwell's demon Attack (MA). MA breaks the channel-mixing and token-mixing mechanism of MLP-Mixer by controlling the part input of MLP-Mixer's each Mixer layer, and disturbs MLP-Mixer to obtain the main information of images. Our method can mask the part input of the Mixer layer, avoid overfitting of the adversarial examples to the source model, and improve the transferability of cross-architecture. Extensive experimental evaluation demonstrates the effectiveness and superior performance of the proposed MA. Our method can be easily combined with existing methods and can improve the transferability by up to 38.0% on MLP-based ResMLP. Adversarial examples produced by our method on MLP-Mixer are able to exceed the transferability of adversarial examples produced using DenseNet against CNNs. To the best of our knowledge, we are the first work to study adversarial transferability of MLP-Mixer. ",
    "url": "https://arxiv.org/abs/2204.12204",
    "authors": [
      "Haoran Lyu",
      "Yajie Wang",
      "Yu-an Tan",
      "Huipeng Zhou",
      "Yuhang Zhao",
      "Quanxin Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12223",
    "title": "Context-Aware Sequence Alignment using 4D Skeletal Augmentation",
    "abstract": "Temporal alignment of fine-grained human actions in videos is important for numerous applications in computer vision, robotics, and mixed reality. State-of-the-art methods directly learn image-based embedding space by leveraging powerful deep convolutional neural networks. While being straightforward, their results are far from satisfactory, the aligned videos exhibit severe temporal discontinuity without additional post-processing steps. The recent advancements in human body and hand pose estimation in the wild promise new ways of addressing the task of human action alignment in videos. In this work, based on off-the-shelf human pose estimators, we propose a novel context-aware self-supervised learning architecture to align sequences of actions. We name it CASA. Specifically, CASA employs self-attention and cross-attention mechanisms to incorporate the spatial and temporal context of human actions, which can solve the temporal discontinuity problem. Moreover, we introduce a self-supervised learning scheme that is empowered by novel 4D augmentation techniques for 3D skeleton representations. We systematically evaluate the key components of our method. Our experiments on three public datasets demonstrate CASA significantly improves phase progress and Kendall's Tau scores over the previous state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2204.12223",
    "authors": [
      "Taein Kwon",
      "Bugra Tekin",
      "Siyu Tang",
      "Marc Pollefeys"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12227",
    "title": "Open or not open: Are conventional radio access networks more secure and  trustworthy than Open-RAN?",
    "abstract": "The Open-RAN architecture is a highly promising and future-oriented architecture. It is intended to open up the radio access network and enable more innovation and competition in the market. This will lead to RANs for current 5G networks, but especially for future 6G networks, to move away from the current centralised, provider-specific 3G RAN architecture and therefore even better meet the requirements for future RANs. However, the change in design has also created a drastic shift in the attack surface compared to conventional RANs. In the past, this has often led to negative headlines, which in summary have often associated O-RAN with faulty or inadequate security. In this paper, we analyze what components are involved in an Open-RAN deployment, how the current state of security is to be assessed and what measures need to be taken to ensure secure operation. ",
    "url": "https://arxiv.org/abs/2204.12227",
    "authors": [
      "Felix Klement",
      "Stefan Katzenbeisser",
      "Vincent Ulitzsch",
      "Juliane Krämer",
      "Slawomir Stanczak",
      "Zoran Utkovski",
      "Igor Bjelakovic",
      "Gerhard Wunder"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.12237",
    "title": "Intercategorical Label Interpolation for Emotional Face Generation with  Conditional Generative Adversarial Networks",
    "abstract": "Generative adversarial networks offer the possibility to generate deceptively real images that are almost indistinguishable from actual photographs. Such systems however rely on the presence of large datasets to realistically replicate the corresponding domain. This is especially a problem if not only random new images are to be generated, but specific (continuous) features are to be co-modeled. A particularly important use case in \\emph{Human-Computer Interaction} (HCI) research is the generation of emotional images of human faces, which can be used for various use cases, such as the automatic generation of avatars. The problem hereby lies in the availability of training data. Most suitable datasets for this task rely on categorical emotion models and therefore feature only discrete annotation labels. This greatly hinders the learning and modeling of smooth transitions between displayed affective states. To overcome this challenge, we explore the potential of label interpolation to enhance networks trained on categorical datasets with the ability to generate images conditioned on continuous features. ",
    "url": "https://arxiv.org/abs/2204.12237",
    "authors": [
      "Silvan Mertes",
      "Dominik Schiller",
      "Florian Lingenfelser",
      "Thomas Kiderle",
      "Valentin Kroner",
      "Lama Diab",
      "Elisabeth André"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.12244",
    "title": "Hybridised Loss Functions for Improved Neural Network Generalisation",
    "abstract": "Loss functions play an important role in the training of artificial neural networks (ANNs), and can affect the generalisation ability of the ANN model, among other properties. Specifically, it has been shown that the cross entropy and sum squared error loss functions result in different training dynamics, and exhibit different properties that are complementary to one another. It has previously been suggested that a hybrid of the entropy and sum squared error loss functions could combine the advantages of the two functions, while limiting their disadvantages. The effectiveness of such hybrid loss functions is investigated in this study. It is shown that hybridisation of the two loss functions improves the generalisation ability of the ANNs on all problems considered. The hybrid loss function that starts training with the sum squared error loss function and later switches to the cross entropy error loss function is shown to either perform the best on average, or to not be significantly different than the best loss function tested for all problems considered. This study shows that the minima discovered by the sum squared error loss function can be further exploited by switching to cross entropy error loss function. It can thus be concluded that hybridisation of the two loss functions could lead to better performance in ANNs. ",
    "url": "https://arxiv.org/abs/2204.12244",
    "authors": [
      "Matthew C. Dickson",
      "Anna S. Bosman",
      "Katherine M. Malan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.12281",
    "title": "Data-Efficient Backdoor Attacks",
    "abstract": "Recent studies have proven that deep neural networks are vulnerable to backdoor attacks. Specifically, by mixing a small number of poisoned samples into the training set, the behavior of the trained model can be maliciously controlled. Existing attack methods construct such adversaries by randomly selecting some clean data from the benign set and then embedding a trigger into them. However, this selection strategy ignores the fact that each poisoned sample contributes inequally to the backdoor injection, which reduces the efficiency of poisoning. In this paper, we formulate improving the poisoned data efficiency by the selection as an optimization problem and propose a Filtering-and-Updating Strategy (FUS) to solve it. The experimental results on CIFAR-10 and ImageNet-10 indicate that the proposed method is effective: the same attack success rate can be achieved with only 47% to 75% of the poisoned sample volume compared to the random selection strategy. More importantly, the adversaries selected according to one setting can generalize well to other settings, exhibiting strong transferability. ",
    "url": "https://arxiv.org/abs/2204.12281",
    "authors": [
      "Pengfei Xia",
      "Ziqiang Li",
      "Wei Zhang",
      "Bin Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12284",
    "title": "Federated Stochastic Primal-dual Learning with Differential Privacy",
    "abstract": "Federated learning (FL) is a new paradigm that enables many clients to jointly train a machine learning (ML) model under the orchestration of a parameter server while keeping the local data not being exposed to any third party. However, the training of FL is an interactive process between local clients and the parameter server. Such process would cause privacy leakage since adversaries may retrieve sensitive information by analyzing the overheard messages. In this paper, we propose a new federated stochastic primal-dual algorithm with differential privacy (FedSPD-DP). Compared to the existing methods, the proposed FedSPD-DP incorporates local stochastic gradient descent (local SGD) and partial client participation (PCP) for addressing the issues of communication efficiency and straggler effects due to randomly accessed clients. Our analysis shows that the data sampling strategy and PCP can enhance the data privacy whereas the larger number of local SGD steps could increase privacy leakage, revealing a non-trivial tradeoff between algorithm communication efficiency and privacy protection. Specifically, we show that, by guaranteeing $(\\epsilon, \\delta)$-DP for each client per communication round, the proposed algorithm guarantees $(\\mathcal{O}(q\\epsilon \\sqrt{p T}), \\delta)$-DP after $T$ communication rounds while maintaining an $\\mathcal{O}(1/\\sqrt{pTQ})$ convergence rate for a convex and non-smooth learning problem, where $Q$ is the number of local SGD steps, $p$ is the client sampling probability, $q=\\max_{i} q_i/\\sqrt{1-q_i}$ and $q_i$ is the data sampling probability of each client under PCP. Experiment results are presented to evaluate the practical performance of the proposed algorithm and comparison with state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2204.12284",
    "authors": [
      "Yiwei Li",
      "Shuai Wang",
      "Tsung-Hui Chang",
      "Chong-Yung Chi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.12297",
    "title": "Brain Tumor Detection and Classification Using a New Evolutionary  Convolutional Neural Network",
    "abstract": "A definitive diagnosis of a brain tumour is essential for enhancing treatment success and patient survival. However, it is difficult to manually evaluate multiple magnetic resonance imaging (MRI) images generated in a clinic. Therefore, more precise computer-based tumour detection methods are required. In recent years, many efforts have investigated classical machine learning methods to automate this process. Deep learning techniques have recently sparked interest as a means of diagnosing brain tumours more accurately and robustly. The goal of this study, therefore, is to employ brain MRI images to distinguish between healthy and unhealthy patients (including tumour tissues). As a result, an enhanced convolutional neural network is developed in this paper for accurate brain image classification. The enhanced convolutional neural network structure is composed of components for feature extraction and optimal classification. Nonlinear L\\'evy Chaotic Moth Flame Optimizer (NLCMFO) optimizes hyperparameters for training convolutional neural network layers. Using the BRATS 2015 data set and brain image datasets from Harvard Medical School, the proposed model is assessed and compared with various optimization techniques. The optimized CNN model outperforms other models from the literature by providing 97.4% accuracy, 96.0% sensitivity, 98.6% specificity, 98.4% precision, and 96.6% F1-score, (the mean of the weighted harmonic value of CNN precision and recall). ",
    "url": "https://arxiv.org/abs/2204.12297",
    "authors": [
      "Amin Abdollahi Dehkordi",
      "Mina Hashemi",
      "Mehdi Neshat",
      "Seyedali Mirjalili",
      "Ali Safaa Sadiq"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.12344",
    "title": "REDCHO: Robust Exact Dynamic Consensus of High Order",
    "abstract": "This article addresses the problem of average consensus in a multi-agent system when the desired consensus quantity is a time varying signal. Recently, the EDCHO protocol leveraged high order sliding modes to achieve exact consensus under a constrained set of initial conditions, limiting its applicability to static networks. In this work, we propose REDCHO, an extension of the previous protocol which is robust to mismatch in the initial conditions, making it suitable to use cases in which connection and disconnection of agents is possible. The convergence properties of the protocol are formally explored. Finally, the effectiveness and advantages of our proposal are shown with concrete simulation examples showing the benefits of REDCHO against other methods in the literature. ",
    "url": "https://arxiv.org/abs/2204.12344",
    "authors": [
      "Rodrigo Aldana-López",
      "Rosario Aragüés",
      "Carlos Sagüés"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Multiagent Systems (cs.MA)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2204.12347",
    "title": "Restricted Black-box Adversarial Attack Against DeepFake Face Swapping",
    "abstract": "DeepFake face swapping presents a significant threat to online security and social media, which can replace the source face in an arbitrary photo/video with the target face of an entirely different person. In order to prevent this fraud, some researchers have begun to study the adversarial methods against DeepFake or face manipulation. However, existing works focus on the white-box setting or the black-box setting driven by abundant queries, which severely limits the practical application of these methods. To tackle this problem, we introduce a practical adversarial attack that does not require any queries to the facial image forgery model. Our method is built on a substitute model persuing for face reconstruction and then transfers adversarial examples from the substitute model directly to inaccessible black-box DeepFake models. Specially, we propose the Transferable Cycle Adversary Generative Adversarial Network (TCA-GAN) to construct the adversarial perturbation for disrupting unknown DeepFake systems. We also present a novel post-regularization module for enhancing the transferability of generated adversarial examples. To comprehensively measure the effectiveness of our approaches, we construct a challenging benchmark of DeepFake adversarial attacks for future development. Extensive experiments impressively show that the proposed adversarial attack method makes the visual quality of DeepFake face images plummet so that they are easier to be detected by humans and algorithms. Moreover, we demonstrate that the proposed algorithm can be generalized to offer face image protection against various face translation methods. ",
    "url": "https://arxiv.org/abs/2204.12347",
    "authors": [
      "Junhao Dong",
      "Yuan Wang",
      "Jianhuang Lai",
      "Xiaohua Xie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.12363",
    "title": "Causal Transportability for Visual Recognition",
    "abstract": "Visual representations underlie object recognition tasks, but they often contain both robust and non-robust features. Our main observation is that image classifiers may perform poorly on out-of-distribution samples because spurious correlations between non-robust features and labels can be changed in a new environment. By analyzing procedures for out-of-distribution generalization with a causal graph, we show that standard classifiers fail because the association between images and labels is not transportable across settings. However, we then show that the causal effect, which severs all sources of confounding, remains invariant across domains. This motivates us to develop an algorithm to estimate the causal effect for image classification, which is transportable (i.e., invariant) across source and target environments. Without observing additional variables, we show that we can derive an estimand for the causal effect under empirical assumptions using representations in deep models as proxies. Theoretical analysis, empirical results, and visualizations show that our approach captures causal invariances and improves overall generalization. ",
    "url": "https://arxiv.org/abs/2204.12363",
    "authors": [
      "Chengzhi Mao",
      "Kevin Xia",
      "James Wang",
      "Hao Wang",
      "Junfeng Yang",
      "Elias Bareinboim",
      "Carl Vondrick"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12366",
    "title": "Robust Audio-Visual Instance Discrimination via Active Contrastive Set  Mining",
    "abstract": "The recent success of audio-visual representation learning can be largely attributed to their pervasive property of audio-visual synchronization, which can be used as self-annotated supervision. As a state-of-the-art solution, Audio-Visual Instance Discrimination (AVID) extends instance discrimination to the audio-visual realm. Existing AVID methods construct the contrastive set by random sampling based on the assumption that the audio and visual clips from all other videos are not semantically related. We argue that this assumption is rough, since the resulting contrastive sets have a large number of faulty negatives. In this paper, we overcome this limitation by proposing a novel Active Contrastive Set Mining (ACSM) that aims to mine the contrastive sets with informative and diverse negatives for robust AVID. Moreover, we also integrate a semantically-aware hard-sample mining strategy into our ACSM. The proposed ACSM is implemented into two most recent state-of-the-art AVID methods and significantly improves their performance. Extensive experiments conducted on both action and sound recognition on multiple datasets show the remarkably improved performance of our method. ",
    "url": "https://arxiv.org/abs/2204.12366",
    "authors": [
      "Hanyu Xuan",
      "Yihong Xu",
      "Shuo Chen",
      "Zhiliang Wu",
      "Jian Yang",
      "Yan Yan",
      "Xavier Alameda-Pineda"
    ],
    "subjectives": [
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2204.12371",
    "title": "Social learning spontaneously emerges by searching optimal heuristics  with deep reinforcement learning",
    "abstract": "How have individuals of social animals in nature evolved to learn from each other, and what would be the optimal strategy for such learning in a specific environment? Here, we address both problems by employing a deep reinforcement learning model to optimize the social learning strategies (SLSs) of agents in a cooperative game in a multi-dimensional landscape. Throughout the training for maximizing the overall payoff, we find that the agent spontaneously learns various concepts of social learning, such as copying, focusing on frequent and well-performing neighbors, self-comparison, and the importance of balancing between individual and social learning, without any explicit guidance or prior knowledge about the system. The SLS from a fully trained agent outperforms all of the traditional, baseline SLSs in terms of mean payoff. We demonstrate the superior performance of the reinforcement learning agent in various environments, including temporally changing environments and real social networks, which also verifies the adaptability of our framework to different social settings. ",
    "url": "https://arxiv.org/abs/2204.12371",
    "authors": [
      "Seungwoong Ha",
      "Hawoong Jeong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.12378",
    "title": "Performance Analysis of Out-of-Distribution Detection on Trained Neural  Networks",
    "abstract": "Several areas have been improved with Deep Learning during the past years. Implementing Deep Neural Networks (DNN) for non-safety related applications have shown remarkable achievements over the past years; however, for using DNNs in safety critical applications, we are missing approaches for verifying the robustness of such models. A common challenge for DNNs occurs when exposed to out-of-distribution samples that are outside of the scope of a DNN, but which result in high confidence outputs despite no prior knowledge of such input. In this paper, we analyze three methods that separate between in- and out-of-distribution data, called supervisors, on four well-known DNN architectures. We find that the outlier detection performance improves with the quality of the model. We also analyse the performance of the particular supervisors during the training procedure by applying the supervisor at a predefined interval to investigate its performance as the training proceeds. We observe that understanding the relationship between training results and supervisor performance is crucial to improve the model's robustness and to indicate, what input samples require further measures to improve the robustness of a DNN. In addition, our work paves the road towards an instrument for safety argumentation for safety critical applications. This paper is an extended version of our previous work presented at 2019 SEAA (cf. [1]); here, we elaborate on the used metrics, add an additional supervisor and test them on two additional datasets. ",
    "url": "https://arxiv.org/abs/2204.12378",
    "authors": [
      "Jens Henriksson",
      "Christian Berger",
      "Markus Borg",
      "Lars Tornberg",
      "Sankar Raman Sathyamoorthy",
      "Cristofer Englund"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.12380",
    "title": "Multi-task Learning for Concurrent Prediction of Thermal Comfort,  Sensation, and Preference",
    "abstract": "Indoor thermal comfort immensely impacts the health and performance of occupants. Therefore, researchers and engineers have proposed numerous computational models to estimate thermal comfort (TC). Given the impetus toward energy efficiency, the current focus is on data-driven TC prediction solutions that leverage state-of-the-art machine learning (ML) algorithms. However, an indoor occupant's perception of indoor thermal comfort (TC) is subjective and multi-dimensional. Different aspects of TC are represented by various standard metrics/scales viz., thermal sensation (TSV), thermal comfort (TCV), and thermal preference (TPV). The current ML-based TC prediction solutions adopt the Single-task Learning approach, i.e., one prediction model per metric. Consequently, solutions often focus on only one TC metric. Moreover, when several metrics are considered, multiple TC models for a single indoor space lead to conflicting predictions, making real-world deployment infeasible. This work addresses these problems. With the vision toward energy conservation and real-world application, naturally ventilated primary school classrooms are considered. First, month-long field experiments are conducted in 5 schools and 14 classrooms, including 512 unique student participants. Further, \"DeepComfort,\" a Multi-task Learning inspired deep-learning model is proposed. DeepComfort predicts multiple TC output metrics viz., TSV, TPV, and TCV, simultaneously, through a single model. It demonstrates high F1-scores, Accuracy (>90%), and generalization capability when validated on the ASHRAE-II database and the dataset created in this study. DeepComfort is also shown to outperform 6 popular metric-specific single-task machine learning algorithms. To the best of our knowledge, this work is the first application of Multi-task Learning to thermal comfort prediction in classrooms. ",
    "url": "https://arxiv.org/abs/2204.12380",
    "authors": [
      "Betty Lala",
      "Hamada Rizk",
      "Srikant Manas Kala",
      "Aya Hagishima"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2204.12393",
    "title": "On Fragile Features and Batch Normalization in Adversarial Training",
    "abstract": "Modern deep learning architecture utilize batch normalization (BN) to stabilize training and improve accuracy. It has been shown that the BN layers alone are surprisingly expressive. In the context of robustness against adversarial examples, however, BN is argued to increase vulnerability. That is, BN helps to learn fragile features. Nevertheless, BN is still used in adversarial training, which is the de-facto standard to learn robust features. In order to shed light on the role of BN in adversarial training, we investigate to what extent the expressiveness of BN can be used to robustify fragile features in comparison to random features. On CIFAR10, we find that adversarially fine-tuning just the BN layers can result in non-trivial adversarial robustness. Adversarially training only the BN layers from scratch, in contrast, is not able to convey meaningful adversarial robustness. Our results indicate that fragile features can be used to learn models with moderate adversarial robustness, while random features cannot ",
    "url": "https://arxiv.org/abs/2204.12393",
    "authors": [
      "Nils Philipp Walter",
      "David Stutz",
      "Bernt Schiele"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.12397",
    "title": "Tolerant Bipartiteness Testing in Dense Graphs",
    "abstract": "Bipartite testing has been a central problem in the area of property testing since its inception in the seminal work of Goldreich, Goldwasser and Ron [FOCS'96 and JACM'98]. Though the non-tolerant version of bipartite testing has been extensively studied in the literature, the tolerant variant is not well understood. In this paper, we consider the following version of tolerant bipartite testing: Given a parameter $\\varepsilon \\in (0,1)$ and access to the adjacency matrix of a graph $G$, we can decide whether $G$ is $\\varepsilon$-close to being bipartite or $G$ is at least $(2+\\Omega(1))\\varepsilon$-far from being bipartite, by performing $\\widetilde{\\mathcal{O}}\\left(\\frac{1}{\\varepsilon ^3}\\right)$ queries and in $2^{\\widetilde{\\mathcal{O}}(1/\\varepsilon)}$ time. This improves upon the state-of-the-art query and time complexities of this problem of $\\widetilde{\\mathcal{O}}\\left(\\frac{1}{\\varepsilon ^6}\\right)$ and $2^{\\widetilde{\\mathcal{O}}(1/\\varepsilon^2)}$, respectively, from the work of Alon, Fernandez de la Vega, Kannan and Karpinski (STOC'02 and JCSS'03), where $\\widetilde{\\mathcal{O}}(\\cdot)$ hides a factor polynomial in $\\log \\frac{1}{\\varepsilon}$. ",
    "url": "https://arxiv.org/abs/2204.12397",
    "authors": [
      "Arijit Ghosh",
      "Gopinath Mishra",
      "Rahul Raychaudhury",
      "Sayantan Sen"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2204.12399",
    "title": "Streaming Algorithms for High-Dimensional Robust Statistics",
    "abstract": "We study high-dimensional robust statistics tasks in the streaming model. A recent line of work obtained computationally efficient algorithms for a range of high-dimensional robust estimation tasks. Unfortunately, all previous algorithms require storing the entire dataset, incurring memory at least quadratic in the dimension. In this work, we develop the first efficient streaming algorithms for high-dimensional robust statistics with near-optimal memory requirements (up to logarithmic factors). Our main result is for the task of high-dimensional robust mean estimation in (a strengthening of) Huber's contamination model. We give an efficient single-pass streaming algorithm for this task with near-optimal error guarantees and space complexity nearly-linear in the dimension. As a corollary, we obtain streaming algorithms with near-optimal space complexity for several more complex tasks, including robust covariance estimation, robust regression, and more generally robust stochastic optimization. ",
    "url": "https://arxiv.org/abs/2204.12399",
    "authors": [
      "Ilias Diakonikolas",
      "Daniel M. Kane",
      "Ankit Pensia",
      "Thanasis Pittas"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.12415",
    "title": "Automatic Monitoring of Fruit Ripening Rooms by UHF RFID Sensor Network  and Machine Learning",
    "abstract": "Accelerated ripening through the exposure of fruits to controlled environmental conditions and gases is nowadays one of the most assessed food technologies, especially for climacteric and exotic products. However, a fine granularity control of the process and consequently of the quality of the goods is still missing, so the management of the ripening rooms is mainly based on qualitative estimations only. Following the modern paradigms of Industry 4.0, this contribution proposes a non-destructive RFID-based system for the automatic evaluation of the live ripening of avocados. The system, coupled with a properly trained automatic classification algorithm based on Support Vector Machines (SVMs), can discriminate the stage of ripening with an accuracy greater than 85%. ",
    "url": "https://arxiv.org/abs/2204.12415",
    "authors": [
      "Cecilia Occhiuzzi",
      "Francesca Camera",
      "Michele D'Orazio",
      "Nicola D'Uva",
      "Sara Amendola",
      "Giulio Maria Bianco",
      "Carolina Miozzi",
      "Luigi Garavaglia",
      "Eugenio Martinelli",
      "Gaetano Marrocco"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.12420",
    "title": "Interpretable Battery Cycle Life Range Prediction Using Early  Degradation Data at Cell Level",
    "abstract": "Battery cycle life prediction using early degradation data has many potential applications throughout the battery product life cycle. Various data-driven methods have been proposed for point prediction of battery cycle life with minimum knowledge of the battery degradation mechanisms. However, management of batteries at end-of-life with lower economic and technical risk requires prediction of cycle life with quantified uncertainty, which is still lacking. The interpretability (i.e., the reason for high prediction accuracy) of these advanced data-driven methods is also worthy of investigation. Here, a physics-informed Quantile Regression Forest (QRF) model is introduced to make cycle life range prediction with uncertainty quantified as the length of the prediction interval, in addition to point predictions with high accuracy. The hyperparameters of the QRF model are tuned with a proposed area-based performance evaluation metric so that the coverage probabilities associated with the prediction intervals are calibrated. The interpretability of the final QRF model is explored with two global model-agnostic methods, namely permutation importance, and partial dependence plot. The final QRF model facilitates dual-criteria decision-making to select the high-cycle-life charging protocol with consideration of both point predictions and uncertainty associated with the prediction. ",
    "url": "https://arxiv.org/abs/2204.12420",
    "authors": [
      "Huang Zhang",
      "Yang Su",
      "Faisal Altaf",
      "Torsten Wik",
      "Sebastien Gros"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12426",
    "title": "Time-triggered Federated Learning over Wireless Networks",
    "abstract": "The newly emerging federated learning (FL) framework offers a new way to train machine learning models in a privacy-preserving manner. However, traditional FL algorithms are based on an event-triggered aggregation, which suffers from stragglers and communication overhead issues. To address these issues, in this paper, we present a time-triggered FL algorithm (TT-Fed) over wireless networks, which is a generalized form of classic synchronous and asynchronous FL. Taking the constrained resource and unreliable nature of wireless communication into account, we jointly study the user selection and bandwidth optimization problem to minimize the FL training loss. To solve this joint optimization problem, we provide a thorough convergence analysis for TT-Fed. Based on the obtained analytical convergence upper bound, the optimization problem is decomposed into tractable sub-problems with respect to each global aggregation round, and finally solved by our proposed online search algorithm. Simulation results show that compared to asynchronous FL (FedAsync) and FL with asynchronous user tiers (FedAT) benchmarks, our proposed TT-Fed algorithm improves the converged test accuracy by up to 12.5% and 5%, respectively, under highly imbalanced and non-IID data, while substantially reducing the communication overhead. ",
    "url": "https://arxiv.org/abs/2204.12426",
    "authors": [
      "Xiaokang Zhou",
      "Yansha Deng",
      "Huiyun Xia",
      "Shaochuan Wu",
      "Mehdi Bennis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.12432",
    "title": "Encoding Cardiopulmonary Exercise Testing Time Series as Images for  Classification using Convolutional Neural Network",
    "abstract": "Exercise testing has been available for more than a half-century and is a remarkably versatile tool for diagnostic and prognostic information of patients for a range of diseases, especially cardiovascular and pulmonary. With rapid advancements in technology, wearables, and learning algorithm in the last decade, its scope has evolved. Specifically, Cardiopulmonary exercise testing (CPX) is one of the most commonly used laboratory tests for objective evaluation of exercise capacity and performance levels in patients. CPX provides a non-invasive, integrative assessment of the pulmonary, cardiovascular, and skeletal muscle systems involving the measurement of gas exchanges. However, its assessment is challenging, requiring the individual to process multiple time series data points, leading to simplification to peak values and slopes. But this simplification can discard the valuable trend information present in these time series. In this work, we encode the time series as images using the Gramian Angular Field and Markov Transition Field and use it with a convolutional neural network and attention pooling approach for the classification of heart failure and metabolic syndrome patients. Using GradCAMs, we highlight the discriminative features identified by the model. ",
    "url": "https://arxiv.org/abs/2204.12432",
    "authors": [
      "Yash Sharma",
      "Nick Coronato",
      "Donald E. Brown"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.12436",
    "title": "Incentives in Social Decision Schemes with Pairwise Comparison  Preferences",
    "abstract": "Social decision schemes (SDSs) map the preferences of individual voters over multiple alternatives to a probability distribution over the alternatives. In order to study properties such as efficiency, strategyproofness, and participation for SDSs, preferences over alternatives are typically lifted to preferences over lotteries using the notion of stochastic dominance (SD). However, requiring strategyproofness or participation with respect to this preference extension only leaves room for rather undesirable SDSs such as random dictatorships. Hence, we focus on the natural but little understood pairwise comparison (PC) preference extension, which postulates that one lottery is preferred to another if the former is more likely to return a preferred outcome. In particular, we settle three open questions raised by Brandt (2017): (i) there is no Condorcet-consistent SDS that satisfies PC-strategyproofness; (ii) there is no anonymous and neutral SDS that satisfies PC-efficiency and PC-strategyproofness; and (iii) there is no anonymous and neutral SDS that satisfies PC-efficiency and strict PC-participation. All three impossibilities require m >= 4 alternatives and turn into possibilities when m <= 3. ",
    "url": "https://arxiv.org/abs/2204.12436",
    "authors": [
      "Felix Brandt",
      "Patrick Lederer",
      "Warut Suksompong"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Theoretical Economics (econ.TH)"
    ]
  },
  {
    "id": "arXiv:2204.12441",
    "title": "Investigating the Optimal Neural Network Parameters for Decoding",
    "abstract": "Neural Networks have been proved to work as decoders in telecommunications, so the ways of making it efficient will be investigated in this thesis. The different parameters to maximize the Neural Network Decoder's efficiency will be investigated. The parameters will be tested for inversion errors only. ",
    "url": "https://arxiv.org/abs/2204.12441",
    "authors": [
      "Joshua Tshifhiwa Maumela"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12442",
    "title": "Multi-task Deep Neural Networks for Massive MIMO CSI Feedback",
    "abstract": "Deep learning has been widely applied for the channel state information (CSI) feedback in frequency division duplexing (FDD) massive multiple-input multiple-output (MIMO) system. For the typical supervised training of the feedback model, the requirements of large amounts of task-specific labeled data can hardly be satisfied, and the huge training costs and storage usage of the model in multiple scenarios are hindrance for model application. In this letter, a multi-task learning-based approach is proposed to improve the feasibility of the feedback network. An encoder-shared feedback architecture and the corresponding training scheme are further proposed to facilitate the implementation of the multi-task learning approach. The experimental results indicate that the proposed multi-task learning approach can achieve comprehensive feedback performance with considerable reduction of training cost and storage usage of the feedback model. ",
    "url": "https://arxiv.org/abs/2204.12442",
    "authors": [
      "Boyuan Zhang",
      "Haozhen Li",
      "Xin Liang",
      "Xinyu Gu",
      "Lin Zhang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12443",
    "title": "A review of Federated Learning in Intrusion Detection Systems for IoT",
    "abstract": "Intrusion detection systems are evolving into intelligent systems that perform data analysis searching for anomalies in their environment. The development of deep learning technologies opened the door to build more complex and effective threat detection models. However, training those models may be computationally infeasible in most Internet of Things devices. Current approaches rely on powerful centralized servers that receive data from all their parties -- violating basic privacy constraints and substantially affecting response times and operational costs due to the huge communication overheads. To mitigate these issues, Federated Learning emerged as a promising approach where different agents collaboratively train a shared model, neither exposing training data to others nor requiring a compute-intensive centralized infrastructure. This paper focuses on the application of Federated Learning approaches in the field of Intrusion Detection. Both technologies are described in detail and current scientific progress is reviewed and categorized. Finally, the paper highlights the limitations present in recent works and presents some future directions for this technology. ",
    "url": "https://arxiv.org/abs/2204.12443",
    "authors": [
      "Aitor Belenguer",
      "Javier Navaridas",
      "Jose A. Pascual"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12451",
    "title": "Understanding The Robustness in Vision Transformers",
    "abstract": "Recent studies show that Vision Transformers(ViTs) exhibit strong robustness against various corruptions. Although this property is partly attributed to the self-attention mechanism, there is still a lack of systematic understanding. In this paper, we examine the role of self-attention in learning robust representations. Our study is motivated by the intriguing properties of the emerging visual grouping in Vision Transformers, which indicates that self-attention may promote robustness through improved mid-level representations. We further propose a family of fully attentional networks (FANs) that strengthen this capability by incorporating an attentional channel processing design. We validate the design comprehensively on various hierarchical backbones. Our model achieves a state of-the-art 87.1% accuracy and 35.8% mCE on ImageNet-1k and ImageNet-C with 76.8M parameters. We also demonstrate state-of-the-art accuracy and robustness in two downstream tasks: semantic segmentation and object detection. Code will be available at https://github.com/NVlabs/FAN. ",
    "url": "https://arxiv.org/abs/2204.12451",
    "authors": [
      "Daquan Zhou",
      "Zhiding Yu",
      "Enze Xie",
      "Chaowei Xiao",
      "Anima Anandkumar",
      "Jiashi Feng",
      "Jose M. Alvarez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12456",
    "title": "Event Detection Explorer: An Interactive Tool for Event Detection  Exploration",
    "abstract": "Event Detection (ED) is an important task in natural language processing. In the past few years, many datasets have been introduced for advancing ED machine learning models. However, most of these datasets are under-explored because not many tools are available for people to study events, trigger words, and event mention instances systematically and efficiently. In this paper, we present an interactive and easy-to-use tool, namely ED Explorer, for ED dataset and model exploration. ED Explorer consists of an interactive web application, an API, and an NLP toolkit, which can help both domain experts and non-experts to better understand the ED task. We use ED Explorer to analyze a recent proposed large-scale ED datasets (referred to as MAVEN), and discover several underlying problems, including sparsity, label bias, label imbalance, and debatable annotations, which provide us with directions to improve the MAVEN dataset. The ED Explorer can be publicly accessed through this http URL The demonstration video is available here https://www.youtube.com/watch?v=6QPnxPwxg50. ",
    "url": "https://arxiv.org/abs/2204.12456",
    "authors": [
      "Wenlong Zhang",
      "Bhagyashree Ingale",
      "Hamza Shabir",
      "Tianyi Li",
      "Tian Shi",
      "Ping Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12463",
    "title": "Focal Sparse Convolutional Networks for 3D Object Detection",
    "abstract": "Non-uniformed 3D sparse data, e.g., point clouds or voxels in different spatial positions, make contribution to the task of 3D object detection in different ways. Existing basic components in sparse convolutional networks (Sparse CNNs) process all sparse data, regardless of regular or submanifold sparse convolution. In this paper, we introduce two new modules to enhance the capability of Sparse CNNs, both are based on making feature sparsity learnable with position-wise importance prediction. They are focal sparse convolution (Focals Conv) and its multi-modal variant of focal sparse convolution with fusion, or Focals Conv-F for short. The new modules can readily substitute their plain counterparts in existing Sparse CNNs and be jointly trained in an end-to-end fashion. For the first time, we show that spatially learnable sparsity in sparse convolution is essential for sophisticated 3D object detection. Extensive experiments on the KITTI, nuScenes and Waymo benchmarks validate the effectiveness of our approach. Without bells and whistles, our results outperform all existing single-model entries on the nuScenes test benchmark at the paper submission time. Code and models are at https://github.com/dvlab-research/FocalsConv. ",
    "url": "https://arxiv.org/abs/2204.12463",
    "authors": [
      "Yukang Chen",
      "Yanwei Li",
      "Xiangyu Zhang",
      "Jian Sun",
      "Jiaya Jia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12466",
    "title": "Meta-free representation learning for few-shot learning via stochastic  weight averaging",
    "abstract": "Recent studies on few-shot classification using transfer learning pose challenges to the effectiveness and efficiency of episodic meta-learning algorithms. Transfer learning approaches are a natural alternative, but they are restricted to few-shot classification. Moreover, little attention has been on the development of probabilistic models with well-calibrated uncertainty from few-shot samples, except for some Bayesian episodic learning algorithms. To tackle the aforementioned issues, we propose a new transfer learning method to obtain accurate and reliable models for few-shot regression and classification. The resulting method does not require episodic meta-learning and is called meta-free representation learning (MFRL). MFRL first finds low-rank representation generalizing well on meta-test tasks. Given the learned representation, probabilistic linear models are fine-tuned with few-shot samples to obtain models with well-calibrated uncertainty. The proposed method not only achieves the highest accuracy on a wide range of few-shot learning benchmark datasets but also correctly quantifies the prediction uncertainty. In addition, weight averaging and temperature scaling are effective in improving the accuracy and reliability of few-shot learning in existing meta-learning algorithms with a wide range of learning paradigms and model architectures. ",
    "url": "https://arxiv.org/abs/2204.12466",
    "authors": [
      "Kuilin Chen",
      "Chi-Guhn Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12468",
    "title": "A Review of In-Memory Space-Efficient Data Structures for Temporal  Graphs",
    "abstract": "Temporal graphs model relationships among entities over time. Recent studies applied temporal graphs to abstract complex systems such as continuous communication among participants of social networks. Often, the amount of data is larger than main memory, therefore, we need specialized structures that balance space usage and query efficiency. In this paper, we review space-efficient data structures that bring large temporal graphs from external memory to primary memory and speed up specialized queries. We found a great variety of studies using data compression techniques and self-indexed compressed data structures. We point further research directions to improve the current state-of-the-art. ",
    "url": "https://arxiv.org/abs/2204.12468",
    "authors": [
      "Luiz F. A. Brito",
      "Bruno A. N. Travençolo",
      "Marcelo K. Albertini"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2204.12488",
    "title": "Distances Release with Differential Privacy in Tree and Grid Graph",
    "abstract": "Data about individuals may contain private and sensitive information. The differential privacy (DP) was proposed to address the problem of protecting the privacy of each individual while keeping useful information about a population. Sealfon (2016) introduced a private graph model in which the graph topology is assumed to be public while the weight information is assumed to be private. That model can express hidden congestion patterns in a known transportation system. In this paper, we revisit the problem of privately releasing approximate distances between all pairs of vertices in (Sealfon 2016). Our goal is to minimize the additive error, namely the difference between the released distance and actual distance under private setting. We propose improved solutions to that problem for several cases. For the problem of privately releasing all-pairs distances, we show that for tree with depth $h$, we can release all-pairs distances with additive error $O(\\log^{1.5} h \\cdot \\log^{1.5} V)$ for fixed privacy parameter where $V$ the number of vertices in the tree, which improves the previous error bound $O(\\log^{2.5} V)$, since the size of $h$ can be as small as $O(\\log V)$. Our result implies that a $\\log V$ factor is saved, and the additive error in tree can be smaller than the error on array/path. Additionally, for the grid graph with arbitrary edge weights, we also propose a method to release all-pairs distances with additive error $\\tilde O(V^{3/4}) $ for fixed privacy parameters. On the application side, many cities like Manhattan are composed of horizontal streets and vertical avenues, which can be modeled as a grid graph. ",
    "url": "https://arxiv.org/abs/2204.12488",
    "authors": [
      "Chenglin Fan",
      "Ping Li"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2204.12489",
    "title": "Sound Localization by Self-Supervised Time Delay Estimation",
    "abstract": "Sounds reach one microphone in a stereo pair sooner than the other, resulting in an interaural time delay that conveys their directions. Estimating a sound's time delay requires finding correspondences between the signals recorded by each microphone. We propose to learn these correspondences through self-supervision, drawing on recent techniques from visual tracking. We adapt the contrastive random walk of Jabri et al. to learn a cycle-consistent representation from unlabeled stereo sounds, resulting in a model that performs on par with supervised methods on \"in the wild\" internet recordings. We also propose a multimodal contrastive learning model that solves a visually-guided localization task: estimating the time delay for a particular person in a multi-speaker mixture, given a visual representation of their face. Project site: https://ificl.github.io/stereocrw/ ",
    "url": "https://arxiv.org/abs/2204.12489",
    "authors": [
      "Ziyang Chen",
      "David F. Fouhey",
      "Andrew Owens"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.11849",
    "title": "Heterogeneous Information Network based Default Analysis on Banking  Micro and Small Enterprise Users",
    "abstract": "Risk assessment is a substantial problem for financial institutions that has been extensively studied both for its methodological richness and its various practical applications. With the expansion of inclusive finance, recent attentions are paid to micro and small-sized enterprises (MSEs). Compared with large companies, MSEs present a higher exposure rate to default owing to their insecure financial stability. Conventional efforts learn classifiers from historical data with elaborate feature engineering. However, the main obstacle for MSEs involves severe deficiency in credit-related information, which may degrade the performance of prediction. Besides, financial activities have diverse explicit and implicit relations, which have not been fully exploited for risk judgement in commercial banks. In particular, the observations on real data show that various relationships between company users have additional power in financial risk analysis. In this paper, we consider a graph of banking data, and propose a novel HIDAM model for the purpose. Specifically, we attempt to incorporate heterogeneous information network with rich attributes on multi-typed nodes and links for modeling the scenario of business banking service. To enhance feature representation of MSEs, we extract interactive information through meta-paths and fully exploit path information. Furthermore, we devise a hierarchical attention mechanism respectively to learn the importance of contents inside each meta-path and the importance of different metapahs. Experimental results verify that HIDAM outperforms state-of-the-art competitors on real-world banking data. ",
    "url": "https://arxiv.org/abs/2204.11849",
    "authors": [
      "Zheng Zhang",
      "Yingsheng Ji",
      "Jiachen Shen",
      "Xi Zhang",
      "Guangwen Yang"
    ],
    "subjectives": [
      "Risk Management (q-fin.RM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.11850",
    "title": "Memory Efficient Invertible Neural Networks for 3D Photoacoustic Imaging",
    "abstract": "Photoacoustic imaging (PAI) can image high-resolution structures of clinical interest such as vascularity in cancerous tumor monitoring. When imaging human subjects, geometric restrictions force limited-view data retrieval causing imaging artifacts. Iterative physical model based approaches reduce artifacts but require prohibitively time consuming PDE solves. Machine learning (ML) has accelerated PAI by combining physical models and learned networks. However, the depth and overall power of ML methods is limited by memory intensive training. We propose using invertible neural networks (INNs) to alleviate memory pressure. We demonstrate INNs can image 3D photoacoustic volumes in the setting of limited-view, noisy, and subsampled data. The frugal constant memory usage of INNs enables us to train an arbitrary depth of learned layers on a consumer GPU with 16GB RAM. ",
    "url": "https://arxiv.org/abs/2204.11850",
    "authors": [
      "Rafael Orozco",
      "Mathias Louboutin",
      "Felix J. Herrmann"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.11857",
    "title": "GDGRU-DTA: Predicting Drug-Target Binding Affinity Based on GNN and  Double GRU",
    "abstract": "The work for predicting drug and target affinity(DTA) is crucial for drug development and repurposing. In this work, we propose a novel method called GDGRU-DTA to predict the binding affinity between drugs and targets, which is based on GraphDTA, but we consider that protein sequences are long sequences, so simple CNN cannot capture the context dependencies in protein sequences well. Therefore, we improve it by interpreting the protein sequences as time series and extracting their features using Gate Recurrent Unit(GRU) and Bidirectional Gate Recurrent Unit(BiGRU). For the drug, our processing method is similar to that of GraphDTA, but uses two different graph convolution methods. Subsequently, the representation of drugs and proteins are concatenated for final prediction. We evaluate the proposed model on two benchmark datasets. Our model outperforms some state-of-the-art deep learning methods, and the results demonstrate the feasibility and excellent feature capture ability of our model. ",
    "url": "https://arxiv.org/abs/2204.11857",
    "authors": [
      "Lyu Zhijian",
      "Jiang Shaohua",
      "Liang Yigao",
      "Gao Min"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.11933",
    "title": "Cleanformer: A microphone array configuration-invariant, streaming,  multichannel neural enhancement frontend for ASR",
    "abstract": "This work introduces the Cleanformer, a streaming multichannel neural based enhancement frontend for automatic speech recognition (ASR). This model has a conformer-based architecture which takes as inputs a single channel each of raw and enhanced signals, and uses self-attention to derive a time-frequency mask. The enhanced input is generated by a multichannel adaptive noise cancellation algorithm known as Speech Cleaner, which makes use of noise context to derive its filter taps. The time-frequency mask is applied to the noisy input to produce enhanced output features for ASR. Detailed evaluations are presented with simulated and re-recorded datasets in speech-based and non-speech-based noise that show significant reduction in word error rate (WER) when using a large-scale state-of-the-art ASR model. It also will be shown to significantly outperform enhancement using a beamformer with ideal steering. The enhancement model is agnostic of the number of microphones and array configuration and, therefore, can be used with different microphone arrays without the need for retraining. It is demonstrated that performance improves with more microphones, up to 4, with each additional microphone providing a smaller marginal benefit. Specifically, for an SNR of -6dB, relative WER improvements of about 80\\% are shown in both noise conditions. ",
    "url": "https://arxiv.org/abs/2204.11933",
    "authors": [
      "Joseph Caroselli",
      "Arun Naranayan",
      "Tom O'Malley"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.11953",
    "title": "Crystal Transformer: Self-learning neural language model for Generative  and Tinkering Design of Materials",
    "abstract": "Self-supervised neural language models have recently achieved unprecedented success, from natural language processing to learning the languages of biological sequences and organic molecules. These models have demonstrated superior performance in the generation, structure classification, and functional predictions for proteins and molecules with learned representations. However, most of the masking-based pre-trained language models are not designed for generative design, and their black-box nature makes it difficult to interpret their design logic. Here we propose BLMM Crystal Transformer, a neural network based probabilistic generative model for generative and tinkering design of inorganic materials. Our model is built on the blank filling language model for text generation and has demonstrated unique advantages in learning the \"materials grammars\" together with high-quality generation, interpretability, and data efficiency. It can generate chemically valid materials compositions with as high as 89.7\\% charge neutrality and 84.8\\% balanced electronegativity, which are more than 4 and 8 times higher compared to a pseudo random sampling baseline. The probabilistic generation process of BLMM allows it to recommend tinkering operations based on learned materials chemistry and makes it useful for materials doping. Combined with the TCSP crysal structure prediction algorithm, We have applied our model to discover a set of new materials as validated using DFT calculations. Our work thus brings the unsupervised transformer language models based generative artificial intelligence to inorganic materials. A user-friendly web app has been developed for computational materials doping and can be accessed freely at \\url{www.materialsatlas.org/blmtinker}. ",
    "url": "https://arxiv.org/abs/2204.11953",
    "authors": [
      "Lai Wei",
      "Qinyang Li",
      "Yuqi Song",
      "Stanislav Stefanov",
      "Edirisuriya M. D. Siriwardane",
      "Fanglin Chen",
      "Jianjun Hu"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.11956",
    "title": "Spontaneous Emergence of Computation in Network Cascades",
    "abstract": "Neuronal network computation and computation by avalanche supporting networks are of interest to the fields of physics, computer science (computation theory as well as statistical or machine learning) and neuroscience. Here we show that computation of complex Boolean functions arises spontaneously in threshold networks as a function of connectivity and antagonism (inhibition), computed by logic automata (motifs) in the form of computational cascades. We explain the emergent inverse relationship between the computational complexity of the motifs and their rank-ordering by function probabilities due to motifs, and its relationship to symmetry in function space. We also show that the optimal fraction of inhibition observed here supports results in computational neuroscience, relating to optimal information processing. ",
    "url": "https://arxiv.org/abs/2204.11956",
    "authors": [
      "Galen Wilkerson",
      "Sotiris Moschoyiannis",
      "Henrik Jeldtoft Jensen"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Artificial Intelligence (cs.AI)",
      "Formal Languages and Automata Theory (cs.FL)"
    ]
  },
  {
    "id": "arXiv:2204.11970",
    "title": "Visual Acuity Prediction on Real-Life Patient Data Using a Machine  Learning Based Multistage System",
    "abstract": "In ophthalmology, intravitreal operative medication therapy (IVOM) is widespread treatment for diseases such as the age-related macular degeneration (AMD), the diabetic macular edema (DME), as well as the retinal vein occlusion (RVO). However, in real-world settings, patients often suffer from loss of vision on time scales of years despite therapy, whereas the prediction of the visual acuity (VA) and the earliest possible detection of deterioration under real-life conditions is challenging due to heterogeneous and incomplete data. In this contribution, we present a workflow for the development of a research-compatible data corpus fusing different IT systems of the department of ophthalmology of a German maximum care hospital. The extensive data corpus allows predictive statements of the expected progression of a patient and his or her VA in each of the three diseases. Within our proposed multistage system, we classify the VA progression into the three groups of therapy \"winners\", \"stabilizers\", and \"losers\" (WSL scheme). Our OCT biomarker classification using an ensemble of deep neural networks results in a classification accuracy (F1-score) of over 98 %, enabling us to complete incomplete OCT documentations while allowing us to exploit them for a more precise VA modelling process. Our VA prediction requires at least four VA examinations and optionally OCT biomarkers from the same time period to predict the VA progression within a forecasted time frame. While achieving a prediction accuracy of up to 69 % (macro average F1-score) when considering all three WSL-based progression groups, this corresponds to an improvement by 11 % in comparison to our ophthalmic expertise (58 %). ",
    "url": "https://arxiv.org/abs/2204.11970",
    "authors": [
      "Tobias Schlosser",
      "Frederik Beuth",
      "Trixy Meyer",
      "Arunodhayan Sampath Kumar",
      "Gabriel Stolze",
      "Olga Furashova",
      "Katrin Engelmann",
      "Danny Kowerko"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12007",
    "title": "Assessing the ability of generative adversarial networks to learn  canonical medical image statistics",
    "abstract": "In recent years, generative adversarial networks (GANs) have gained tremendous popularity for potential applications in medical imaging, such as medical image synthesis, restoration, reconstruction, translation, as well as objective image quality assessment. Despite the impressive progress in generating high-resolution, perceptually realistic images, it is not clear if modern GANs reliably learn the statistics that are meaningful to a downstream medical imaging application. In this work, the ability of a state-of-the-art GAN to learn the statistics of canonical stochastic image models (SIMs) that are relevant to objective assessment of image quality is investigated. It is shown that although the employed GAN successfully learned several basic first- and second-order statistics of the specific medical SIMs under consideration and generated images with high perceptual quality, it failed to correctly learn several per-image statistics pertinent to the these SIMs, highlighting the urgent need to assess medical image GANs in terms of objective measures of image quality. ",
    "url": "https://arxiv.org/abs/2204.12007",
    "authors": [
      "Varun A. Kelkar",
      "Dimitrios S. Gotsis",
      "Frank J. Brooks",
      "Prabhat KC",
      "Kyle J. Myers",
      "Rongping Zeng",
      "Mark A. Anastasio"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2204.12076",
    "title": "ATST: Audio Representation Learning with Teacher-Student Transformer",
    "abstract": "Self-supervised learning (SSL) learns knowledge from a large amount of unlabeled data, and then transfers the knowledge to a specific problem with a limited number of labeled data. SSL has achieved promising results in various domains. This work addresses the problem of segment-level general audio SSL, and proposes a new transformer-based teacher-student SSL model, named ATST. A transformer encoder is developed on a recently emerged teacher-student baseline scheme, which largely improves the modeling capability of pre-training. In addition, a new strategy for positive pair creation is designed to fully leverage the capability of transformer. Extensive experiments have been conducted, and the proposed model achieves the new state-of-the-art results on almost all of the downstream tasks. ",
    "url": "https://arxiv.org/abs/2204.12076",
    "authors": [
      "Xian Li",
      "Xiaofei Li"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.12092",
    "title": "Mask scalar prediction for improving robust automatic speech recognition",
    "abstract": "Using neural network based acoustic frontends for improving robustness of streaming automatic speech recognition (ASR) systems is challenging because of the causality constraints and the resulting distortion that the frontend processing introduces in speech. Time-frequency masking based approaches have been shown to work well, but they need additional hyper-parameters to scale the mask to limit speech distortion. Such mask scalars are typically hand-tuned and chosen conservatively. In this work, we present a technique to predict mask scalars using an ASR-based loss in an end-to-end fashion, with minimal increase in the overall model size and complexity. We evaluate the approach on two robust ASR tasks: multichannel enhancement in the presence of speech and non-speech noise, and acoustic echo cancellation (AEC). Results show that the presented algorithm consistently improves word error rate (WER) without the need for any additional tuning over strong baselines that use hand-tuned hyper-parameters: up to 16% for multichannel enhancement in noisy conditions, and up to 7% for AEC. ",
    "url": "https://arxiv.org/abs/2204.12092",
    "authors": [
      "Arun Narayanan",
      "James Walker",
      "Sankaran Panchapagesan",
      "Nathan Howard",
      "Yuma Koizumi"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.12100",
    "title": "Convergence of neural networks to Gaussian mixture distribution",
    "abstract": "We give a proof that, under relatively mild conditions, fully-connected feed-forward deep random neural networks converge to a Gaussian mixture distribution as only the width of the last hidden layer goes to infinity. We conducted experiments for a simple model which supports our result. Moreover, it gives a detailed description of the convergence, namely, the growth of the last hidden layer gets the distribution closer to the Gaussian mixture, and the other layer successively get the Gaussian mixture closer to the normal distribution. ",
    "url": "https://arxiv.org/abs/2204.12100",
    "authors": [
      "Yasuhiko Asao",
      "Ryotaro Sakamoto",
      "Shiro Takagi"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2204.12144",
    "title": "Motion Planning and Robust Tracking for the Heat Equation using Boundary  Control",
    "abstract": "Robust output tracking is addressed in this paper for a heat equation with Neumann boundary conditions and anti-collocated boundary input and output. The desired reference tracking is solved using the well-known flatness and Lyapunov approaches. The reference profile is obtained by solving the motion planning problem for the nominal plant. To robustify the closed-loop system in the presence of the disturbances and uncertainties, it is then augmented with PI feedback plus a discontinuous component responsible for rejecting matched disturbances with \\textit{a priori} known magnitude bounds. Such control law only requires the information of the system at the same boundary as the control input is located. The resulting dynamic controller globally exponentially stabilizes the error dynamics while also attenuating the influence of Lipschitz-in-time external disturbances and parameter uncertainties. For the case when the motion planning is performed over the uncertain plant, an exponential Input-to-State Stability is obtained, preserving the boundedness of the tracking error norm. The proposed controller relies on a discontinuous term that however passes through an integrator, thereby minimizing the chattering effect in the plant dynamics. The performance of the closed-loop system, thus designed, is illustrated in simulations under different kinds of reference trajectories in the presence of external disturbances and parameter uncertainties. ",
    "url": "https://arxiv.org/abs/2204.12144",
    "authors": [
      "Diego Gutiérrez-Oribio",
      "Yury Orlov",
      "Ioannis Stefanou",
      "Franck Plestan"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.12156",
    "title": "Source-independent quantum random number generator against detector  blinding attacks",
    "abstract": "Randomness, mainly in the form of random numbers, is the fundamental prerequisite for the security of many cryptographic tasks. Quantum randomness can be extracted even if adversaries are fully aware of the protocol and even control the randomness source. However, an adversary can further manipulate the randomness via detector blinding attacks, which are a hacking attack suffered by protocols with trusted detectors. Here, by treating no-click events as valid error events, we propose a quantum random number generation protocol that can simultaneously address source vulnerability and ferocious detector blinding attacks. The method can be extended to high-dimensional random number generation. We experimentally demonstrate the ability of our protocol to generate random numbers for two-dimensional measurement with a generation speed of 0.515 Mbps, which is two orders of magnitude higher than that of device-independent protocols that can address both issues of imperfect sources and imperfect detectors. ",
    "url": "https://arxiv.org/abs/2204.12156",
    "authors": [
      "Wen-Bo Liu",
      "Yu-Shuo Lu",
      "Yao Fu",
      "Si-Cheng Huang",
      "Ze-Jie Yin",
      "Kun Jiang",
      "Hua-Lei Yin",
      "Zeng-Bing Chen"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.12231",
    "title": "IRC-safe Graph Autoencoder for an unsupervised anomaly detection",
    "abstract": "Anomaly detection through employing machine learning techniques has emerged as a novel powerful tool in the search for new physics beyond the Standard Model. Historically similar to the development of jet observables, theoretical consistency has not always assumed a central role in the fast development of algorithms and neural network architectures. In this work, we construct an infrared and collinear safe autoencoder based on graph neural networks by employing energy-weighted message passing. We demonstrate that whilst this approach has theoretically favourable properties, it also exhibits formidable sensitivity to non-QCD structures. ",
    "url": "https://arxiv.org/abs/2204.12231",
    "authors": [
      "Oliver Atkinson",
      "Akanksha Bhardwaj",
      "Christoph Englert",
      "Partha Konar",
      "Vishal S. Ngairangbam",
      "Michael Spannowsky"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Experiment (hep-ex)"
    ]
  },
  {
    "id": "arXiv:2204.12243",
    "title": "Modeling and Analysis of 2-Tier Heterogeneous Vehicular Networks  Leveraging Roadside Units and Vehicle Relays",
    "abstract": "While roadside units (RSUs) play an essential role in vehicle-to-everything (V2X) by communicating with users, some users in congestion areas may not be well-served due to data traffic, signal attenuation, and interference. In these cases, vehicle relays can be employed to enhance the network topology to better serve those users. This paper leverages stochastic geometry to propose a novel framework for the performance analysis of heterogeneous vehicular networks with RSUs, vehicle relays, and vehicle users. We present a two-dimensional analytical model where the spatial dependence between RSUs, vehicle relays, vehicle users, and roads is accurately taken into account through a Cox point process structure. Assuming relays are backhauled to RSUs over a reserved wireless resource and users are associated with the closest RSU or relay, we derive the probability that the typical user is associated with either an RSU or a relay. Then, we derive the signal-to-interference ratio (SIR) coverage probability of the typical user. Finally, using the derived formulas, we evaluate the average effective rate of the typical user in the network. This allows us to determine the gain of the average effective rate of users that results from the deployment of relays in the network. ",
    "url": "https://arxiv.org/abs/2204.12243",
    "authors": [
      "Chang-Sik Choi",
      "François Baccelli"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2204.12260",
    "title": "Masked Spectrogram Modeling using Masked Autoencoders for Learning  General-purpose Audio Representation",
    "abstract": "Recent general-purpose audio representations show state-of-the-art performance on various audio tasks. These representations are pre-trained by self-supervised learning methods that create training signals from the input. For example, typical audio contrastive learning uses temporal relationships among input sounds to create training signals, whereas some methods use a difference among input views created by data augmentations. However, these training signals do not provide information derived from the intact input sound, which we think is suboptimal for learning representation that describes the input as it is. In this paper, we seek to learn audio representations from the input itself as supervision using a pretext task of auto-encoding of masked spectrogram patches, Masked Spectrogram Modeling (MSM, a variant of Masked Image Modeling applied to audio spectrogram). To implement MSM, we use Masked Autoencoders (MAE), an image self-supervised learning method. MAE learns to efficiently encode the small number of visible patches into latent representations to carry essential information for reconstructing a large number of masked patches. While training, MAE minimizes the reconstruction error, which uses the input as training signal, consequently achieving our goal. We conducted experiments on our MSM using MAE (MSM-MAE) models under the evaluation benchmark of the HEAR 2021 NeurIPS Challenge. Our MSM-MAE models outperformed the HEAR 2021 Challenge results on seven out of 15 tasks (e.g., accuracies of 73.4% on CREMA-D and 85.8% on LibriCount), while showing top performance on other tasks where specialized models perform better. We also investigate how the design choices of MSM-MAE impact the performance and conduct qualitative analysis of visualization outcomes to gain an understanding of learned representations. We make our code available online. ",
    "url": "https://arxiv.org/abs/2204.12260",
    "authors": [
      "Daisuke Niizumi",
      "Daiki Takeuchi",
      "Yasunori Ohishi",
      "Noboru Harada",
      "Kunio Kashino"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.12270",
    "title": "Graph Neural Networks for Microbial Genome Recovery",
    "abstract": "Microbes have a profound impact on our health and environment, but our understanding of the diversity and function of microbial communities is severely limited. Through DNA sequencing of microbial communities (metagenomics), DNA fragments (reads) of the individual microbes can be obtained, which through assembly graphs can be combined into long contiguous DNA sequences (contigs). Given the complexity of microbial communities, single contig microbial genomes are rarely obtained. Instead, contigs are eventually clustered into bins, with each bin ideally making up a full genome. This process is referred to as metagenomic binning. Current state-of-the-art techniques for metagenomic binning rely only on the local features for the individual contigs. These techniques therefore fail to exploit the similarities between contigs as encoded by the assembly graph, in which the contigs are organized. In this paper, we propose to use Graph Neural Networks (GNNs) to leverage the assembly graph when learning contig representations for metagenomic binning. Our method, VaeG-Bin, combines variational autoencoders for learning latent representations of the individual contigs, with GNNs for refining these representations by taking into account the neighborhood structure of the contigs in the assembly graph. We explore several types of GNNs and demonstrate that VaeG-Bin recovers more high-quality genomes than other state-of-the-art binners on both simulated and real-world datasets. ",
    "url": "https://arxiv.org/abs/2204.12270",
    "authors": [
      "Andre Lamurias",
      "Alessandro Tibo",
      "Katja Hose",
      "Mads Albertsen",
      "Thomas Dyhre Nielsen"
    ],
    "subjectives": [
      "Genomics (q-bio.GN)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2204.12279",
    "title": "Low-dimensional representation of infant and adult vocalization  acoustics",
    "abstract": "During the first years of life, infant vocalizations change considerably, as infants develop the vocalization skills that enable them to produce speech sounds. Characterizations based on specific acoustic features, protophone categories, or phonetic transcription are able to provide a representation of the sounds infants make at different ages and in different contexts but do not fully describe how sounds are perceived by listeners, can be inefficient to obtain at large scales, and are difficult to visualize in two dimensions without additional statistical processing. Machine-learning-based approaches provide the opportunity to complement these characterizations with purely data-driven representations of infant sounds. Here, we use spectral features extraction and unsupervised machine learning, specifically Uniform Manifold Approximation (UMAP), to obtain a novel 2-dimensional spatial representation of infant and caregiver vocalizations extracted from day-long home recordings. UMAP yields a continuous and well-distributed space conducive to certain analyses of infant vocal development. For instance, we found that the dispersion of infant vocalization acoustics within the 2-D space over a day increased from 3 to 9 months, and then decreased from 9 to 18 months. The method also permits analysis of similarity between infant and adult vocalizations, which also shows changes with infant age. ",
    "url": "https://arxiv.org/abs/2204.12279",
    "authors": [
      "Silvia Pagliarini",
      "Sara Schneider",
      "Christopher T. Kello",
      "Anne S. Warlaumont"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.12311",
    "title": "Formalizing a Diophantine Representation of the Set of Prime Numbers",
    "abstract": "The DPRM (Davis-Putnam-Robinson-Matiyasevich) theorem is the main step in the negative resolution of Hilbert's 10th problem. Almost three decades of work on the problem have resulted in several equally surprising results. These include the existence of diophantine equations with a reduced number of variables, as well as the explicit construction of polynomials that represent specific sets, in particular the set of primes. In this work, we formalize these constructions in the Mizar system. We focus on the set of prime numbers and its explicit representation using 10 variables. It is the smallest representation known today. For this, we show that the exponential function is diophantine, together with the same properties for the binomial coefficient and factorial. This formalization is the next step in the research on formal approaches to diophantine sets following the DPRM theorem. ",
    "url": "https://arxiv.org/abs/2204.12311",
    "authors": [
      "Karol Pąk",
      "Cezary Kaliszyk"
    ],
    "subjectives": [
      "Number Theory (math.NT)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2204.12390",
    "title": "Quantum-classical convolutional neural networks in radiological image  classification",
    "abstract": "Quantum machine learning is receiving significant attention currently, but its usefulness in comparison to classical machine learning techniques for practical applications remains unclear. However, there are indications that certain quantum machine learning algorithms might result in improved training capabilities with respect to their classical counterparts -- which might be particularly beneficial in situations with little training data available. Such situations naturally arise in medical classification tasks. Within this paper, different hybrid quantum-classical convolutional neural networks (QCCNN) with varying quantum circuit designs and encoding techniques are proposed. They are applied to two- and three-dimensional medical imaging data, e.g. featuring different, potentially malign, lesions in computed tomography scans. The performance of these QCCNNs is already similar to the one of their classical counterparts -- therefore encouraging further studies towards the direction of applying these algorithms within medical imaging tasks. ",
    "url": "https://arxiv.org/abs/2204.12390",
    "authors": [
      "Andrea Matic",
      "Maureen Monnet",
      "Jeanette Miriam Lorenz",
      "Balthasar Schachtner",
      "Thomas Messerer"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12440",
    "title": "neuro2vec: Masked Fourier Spectrum Prediction for Neurophysiological  Representation Learning",
    "abstract": "Extensive data labeling on neurophysiological signals is often prohibitively expensive or impractical, as it may require particular infrastructure or domain expertise. To address the appetite for data of deep learning methods, we present for the first time a Fourier-based modeling framework for self-supervised pre-training of neurophysiology signals. The intuition behind our approach is simple: frequency and phase distribution of neurophysiology signals reveal the underlying neurophysiological activities of the brain and muscle. Our approach first randomly masks out a portion of the input signal and then predicts the missing information from either spatiotemporal or the Fourier domain. Pre-trained models can be potentially used for downstream tasks such as sleep stage classification using electroencephalogram (EEG) signals and gesture recognition using electromyography (EMG) signals. Unlike contrastive-based methods, which strongly rely on carefully hand-crafted augmentations and siamese structure, our approach works reasonably well with a simple transformer encoder with no augmentation requirements. By evaluating our method on several benchmark datasets, including both EEG and EMG, we show that our modeling approach improves downstream neurophysiological related tasks by a large margin. ",
    "url": "https://arxiv.org/abs/2204.12440",
    "authors": [
      "Di Wu",
      "Siyuan Li",
      "Jie Yang",
      "Mohamad Sawan"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:1908.09881",
    "title": "Consistently estimating network statistics using Aggregated Relational  Data",
    "abstract": " Title: Consistently estimating network statistics using Aggregated Relational  Data ",
    "url": "https://arxiv.org/abs/1908.09881",
    "authors": [
      "Emily Breza",
      "Arun G. Chandrasekhar",
      "Shane Lubold",
      "Tyler H. McCormick",
      "Mengjie Pan"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Social and Information Networks (cs.SI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2001.09046",
    "title": "PDE-based Group Equivariant Convolutional Neural Networks",
    "abstract": " Comments: 27 pages, 18 figures. v2 changes: - mentioned KerCNNs - added section Generalization of G-CNNs - clarification that the experiments utilized automatic differentiation and SGD. v3 changes: - streamlined theoretical framework - formulation and proof Thm.1 & 2 - expanded experiments. v4 changes: typos in Prop.5 and (20) v5 changes: minor revision ",
    "url": "https://arxiv.org/abs/2001.09046",
    "authors": [
      "Bart Smets",
      "Jim Portegies",
      "Erik Bekkers",
      "Remco Duits"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Differential Geometry (math.DG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2001.11107",
    "title": "Hamiltonian neural networks for solving equations of motion",
    "abstract": " Title: Hamiltonian neural networks for solving equations of motion ",
    "url": "https://arxiv.org/abs/2001.11107",
    "authors": [
      "Marios Mattheakis",
      "David Sondak",
      "Akshunna S. Dogra",
      "Pavlos Protopapas"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2011.11201",
    "title": "Modular Action Concept Grounding in Semantic Video Prediction",
    "abstract": " Comments: To appear in CVPR 2022 ",
    "url": "https://arxiv.org/abs/2011.11201",
    "authors": [
      "Wei Yu",
      "Wenxin Chen",
      "Songhenh Yin",
      "Steve Easterbrook",
      "Animesh Garg"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2101.02023",
    "title": "Perfect domination, Roman domination and perfect Roman domination in  lexicographic product graphs",
    "abstract": " Title: Perfect domination, Roman domination and perfect Roman domination in  lexicographic product graphs ",
    "url": "https://arxiv.org/abs/2101.02023",
    "authors": [
      "A. Cabrera Martinez",
      "C. Garcia-Gomez",
      "J. A. Rodriguez-Velazquez"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2102.08577",
    "title": "DO-GAN: A Double Oracle Framework for Generative Adversarial Networks",
    "abstract": " Title: DO-GAN: A Double Oracle Framework for Generative Adversarial Networks ",
    "url": "https://arxiv.org/abs/2102.08577",
    "authors": [
      "Aye Phyu Phyu Aung",
      "Xinrun Wang",
      "Runsheng Yu",
      "Bo An",
      "Senthilnath Jayavelu",
      "Xiaoli Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2102.13086",
    "title": "Simple multi-dataset detection",
    "abstract": " Comments: code is available at this https URL ",
    "url": "https://arxiv.org/abs/2102.13086",
    "authors": [
      "Xingyi Zhou",
      "Vladlen Koltun",
      "Philipp Krähenbühl"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2103.07615",
    "title": "An Efficient Multitask Neural Network for Face Alignment, Head Pose  Estimation and Face Tracking",
    "abstract": " Comments: 13 pages, 9 figures, Accepted to CVPR2022 ",
    "url": "https://arxiv.org/abs/2103.07615",
    "authors": [
      "Jiahao Xia",
      "Haimin Zhang",
      "Shiping Wen",
      "Shuo Yang",
      "Min Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.13634",
    "title": "Saudi Parents' Privacy Concerns about Their Children's Smart Device  Applications",
    "abstract": " Comments: This is the author's version of the accepted manuscript at the International Journal of Child-Computer Interaction. This is version 2 of the paper at arxiv. It contains major changes over version 1 ",
    "url": "https://arxiv.org/abs/2105.13634",
    "authors": [
      "Eman Alashwali",
      "Fatimah Alashwali"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2106.00186",
    "title": "Towards Light-weight and Real-time Line Segment Detection",
    "abstract": " Comments: Accepted by AAAI2022 ",
    "url": "https://arxiv.org/abs/2106.00186",
    "authors": [
      "Geonmo Gu",
      "Byungsoo Ko",
      "SeoungHyun Go",
      "Sung-Hyun Lee",
      "Jingeun Lee",
      "Minchul Shin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.07243",
    "title": "Compressed Gradient Tracking for Decentralized Optimization Over General  Directed Networks",
    "abstract": " Title: Compressed Gradient Tracking for Decentralized Optimization Over General  Directed Networks ",
    "url": "https://arxiv.org/abs/2106.07243",
    "authors": [
      "Zhuoqing Song",
      "Lei Shi",
      "Shi Pu",
      "Ming Yan"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2108.09498",
    "title": "Active User Detection and Channel Estimation for Spatial-based Random  Access in Crowded Massive MIMO Systems via Blind Super-resolution",
    "abstract": " Title: Active User Detection and Channel Estimation for Spatial-based Random  Access in Crowded Massive MIMO Systems via Blind Super-resolution ",
    "url": "https://arxiv.org/abs/2108.09498",
    "authors": [
      "Abolghasem Afshar",
      "Vahid Tabataba Vakili",
      "Sajad Daei"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2109.04517",
    "title": "Prediction and Prevention of Pandemics via Graphical Model Inference and  Convex Programming",
    "abstract": " Title: Prediction and Prevention of Pandemics via Graphical Model Inference and  Convex Programming ",
    "url": "https://arxiv.org/abs/2109.04517",
    "authors": [
      "Mikhail Krechetov",
      "Amir Mohammad Esmaieeli Sikaroudi",
      "Alon Efrat",
      "Valentin Polishchuk",
      "Michael Chertkov"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2109.09374",
    "title": "Deep Quantile Regression for Uncertainty Estimation in Unsupervised and  Supervised Lesion Detection",
    "abstract": " Comments: Accepted for publication at the Journal of Machine Learning for Biomedical Imaging (MELBA) this https URL arXiv admin note: substantial text overlap with arXiv:2010.09042 ",
    "url": "https://arxiv.org/abs/2109.09374",
    "authors": [
      "Haleh Akrami",
      "Anand Joshi",
      "Sergul Aydore",
      "Richard Leahy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Image and Video Processing (eess.IV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2109.11224",
    "title": "A Novel Open Set Energy-based Flow Classifier for Network Intrusion  Detection",
    "abstract": " Title: A Novel Open Set Energy-based Flow Classifier for Network Intrusion  Detection ",
    "url": "https://arxiv.org/abs/2109.11224",
    "authors": [
      "Manuela M. C. Souza",
      "Camila Pontes",
      "Joao Gondim",
      "Luis P. F. Garcia",
      "Luiz DaSilva",
      "Marcelo A. Marotta"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2110.01931",
    "title": "Anchor-free Oriented Proposal Generator for Object Detection",
    "abstract": " Title: Anchor-free Oriented Proposal Generator for Object Detection ",
    "url": "https://arxiv.org/abs/2110.01931",
    "authors": [
      "Gong Cheng",
      "Jiabao Wang",
      "Ke Li",
      "Xingxing Xie",
      "Chunbo Lang",
      "Yanqing Yao",
      "Junwei Han"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.07957",
    "title": "Don't speak too fast: The impact of data bias on self-supervised speech  models",
    "abstract": " Comments: Accepted by ICASSP 2022 ",
    "url": "https://arxiv.org/abs/2110.07957",
    "authors": [
      "Yen Meng",
      "Yi-Hui Chou",
      "Andy T. Liu",
      "Hung-yi Lee"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2110.10106",
    "title": "Subframework-Based Rigidity Control in Multirobot Networks",
    "abstract": " Comments: Copyright 20XX IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses, in any current or future media, including reprinting/republishing this material for advertising or promotional purposes, creating new collective works, for resale or redistribution to servers or lists, or reuse of any copyrighted component of this work in other works ",
    "url": "https://arxiv.org/abs/2110.10106",
    "authors": [
      "Juan F. Presenza",
      "J. Ignacio Alvarez-Hamelin",
      "Ignacio Mas",
      "Juan I. Giribet"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2110.11996",
    "title": "The Eigenvectors of Single-spiked Complex Wishart Matrices: Finite and  Asymptotic Analyses",
    "abstract": " Comments: Revised to add analyses on real and complex singular Wishart matrices ",
    "url": "https://arxiv.org/abs/2110.11996",
    "authors": [
      "Prathapasinghe Dharmawansa",
      "Pasan Dissanayake",
      "Yang Chen"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2110.12194",
    "title": "RPT++: Customized Feature Representation for Siamese Visual Tracking",
    "abstract": " Comments: the authors hold different opinions on whether or not to public the paper ",
    "url": "https://arxiv.org/abs/2110.12194",
    "authors": [
      "Ziang Ma",
      "Haitao Zhang",
      "Linyuan Wang",
      "Jun Yin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.12899",
    "title": "No One Representation to Rule Them All: Overlapping Features of Training  Methods",
    "abstract": " Title: No One Representation to Rule Them All: Overlapping Features of Training  Methods ",
    "url": "https://arxiv.org/abs/2110.12899",
    "authors": [
      "Raphael Gontijo-Lopes",
      "Yann Dauphin",
      "Ekin D. Cubuk"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.13721",
    "title": "Geometric Transformer for End-to-End Molecule Properties Prediction",
    "abstract": " Title: Geometric Transformer for End-to-End Molecule Properties Prediction ",
    "url": "https://arxiv.org/abs/2110.13721",
    "authors": [
      "Yoni Choukroun",
      "Lior Wolf"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.09388",
    "title": "High Quality Rather than High Model Probability: Minimum Bayes Risk  Decoding with Neural Metrics",
    "abstract": " Comments: Accepted at TACL, presented at NAACL22 ",
    "url": "https://arxiv.org/abs/2111.09388",
    "authors": [
      "Markus Freitag",
      "David Grangier",
      "Qijun Tan",
      "Bowen Liang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.14055",
    "title": "ESGN: Efficient Stereo Geometry Network for Fast 3D Object Detection",
    "abstract": " Title: ESGN: Efficient Stereo Geometry Network for Fast 3D Object Detection ",
    "url": "https://arxiv.org/abs/2111.14055",
    "authors": [
      "Aqi Gao",
      "Yanwei Pang",
      "Jing Nie",
      "Jiale Cao",
      "Yishun Guo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.15367",
    "title": "A Review on Graph Neural Network Methods in Financial Applications",
    "abstract": " Title: A Review on Graph Neural Network Methods in Financial Applications ",
    "url": "https://arxiv.org/abs/2111.15367",
    "authors": [
      "Jianian Wang",
      "Sheng Zhang",
      "Yanghua Xiao",
      "Rui Song"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2112.00913",
    "title": "CDLNet: Noise-Adaptive Convolutional Dictionary Learning Network for  Blind Denoising and Demosaicing",
    "abstract": " Title: CDLNet: Noise-Adaptive Convolutional Dictionary Learning Network for  Blind Denoising and Demosaicing ",
    "url": "https://arxiv.org/abs/2112.00913",
    "authors": [
      "Nikola Janjušević",
      "Amirhossein Khalilian-Gourtani",
      "Yao Wang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.02731",
    "title": "Detecting DeFi Securities Violations from Token Smart Contract Code",
    "abstract": " Title: Detecting DeFi Securities Violations from Token Smart Contract Code ",
    "url": "https://arxiv.org/abs/2112.02731",
    "authors": [
      "Arianna Trozze",
      "Bennett Kleinberg",
      "Toby Davies"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.06147",
    "title": "Self-Supervised Modality-Aware Multiple Granularity Pre-Training for  RGB-Infrared Person Re-Identification",
    "abstract": " Comments: 13 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2112.06147",
    "authors": [
      "Lin Wan",
      "Qianyan Jing",
      "Zongyuan Sun",
      "Chuang Zhang",
      "Zhihang Li",
      "Yehansen Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.12021",
    "title": "Community Detection in Medical Image Datasets: Using Wavelets and  Spectral Methods",
    "abstract": " Title: Community Detection in Medical Image Datasets: Using Wavelets and  Spectral Methods ",
    "url": "https://arxiv.org/abs/2112.12021",
    "authors": [
      "Roozbeh Yousefzadeh"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.11968",
    "title": "Training invariances and the low-rank phenomenon: beyond linear networks",
    "abstract": " Comments: 26 pages, 3 figures, ICLR2022 ",
    "url": "https://arxiv.org/abs/2201.11968",
    "authors": [
      "Thien Le",
      "Stefanie Jegelka"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2201.12409",
    "title": "A Unified Approach to Entity-Centric Context Tracking in Social  Conversations",
    "abstract": " Comments: Published at LREC 2022 ",
    "url": "https://arxiv.org/abs/2201.12409",
    "authors": [
      "Ulrich Rückert",
      "Srinivas Sunkara",
      "Abhinav Rastogi",
      "Sushant Prakash",
      "Pranav Khaitan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.11149",
    "title": "Incorporating social norms into a configurable agent-based model of the  decision to perform commuting behaviour",
    "abstract": " Comments: 16 pages, 2 figures, 4 tables. Abstract abridged for arXiv submission. Additional results added in v2 ",
    "url": "https://arxiv.org/abs/2202.11149",
    "authors": [
      "Robert Greener",
      "Daniel Lewis",
      "Jon Reades",
      "Simon Miles",
      "Steven Cummins"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2202.13898",
    "title": "DistAD: Software Anomaly Detection Based on Execution Trace Distribution",
    "abstract": " Comments: need modification, the experiment results need carefully check ",
    "url": "https://arxiv.org/abs/2202.13898",
    "authors": [
      "Shiyi Kong",
      "Jun Ai",
      "Minyan Lu",
      "Shuguang Wang",
      "W. Eric Wong"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2203.00449",
    "title": "Deep Learning based Prediction of MSI using MMR Markers in Colorectal  Cancer",
    "abstract": " Title: Deep Learning based Prediction of MSI using MMR Markers in Colorectal  Cancer ",
    "url": "https://arxiv.org/abs/2203.00449",
    "authors": [
      "Ruqayya Awan",
      "Mohammed Nimir",
      "Shan E Ahmed Raza",
      "Mohsin Bilal",
      "Johannes Lotz",
      "David Snead",
      "Andrew Robinson",
      "Nasir Rajpoot"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2203.01360",
    "title": "Neural Galerkin Scheme with Active Learning for High-Dimensional  Evolution Equations",
    "abstract": " Title: Neural Galerkin Scheme with Active Learning for High-Dimensional  Evolution Equations ",
    "url": "https://arxiv.org/abs/2203.01360",
    "authors": [
      "Joan Bruna",
      "Benjamin Peherstorfer",
      "Eric Vanden-Eijnden"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.02077",
    "title": "User-Level Membership Inference Attack against Metric Embedding Learning",
    "abstract": " Title: User-Level Membership Inference Attack against Metric Embedding Learning ",
    "url": "https://arxiv.org/abs/2203.02077",
    "authors": [
      "Guoyao Li",
      "Shahbaz Rezaei",
      "Xin Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.03634",
    "title": "BPM-Net: non-contact blood pressure measuring network based on face  videos",
    "abstract": " Comments: 21 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2203.03634",
    "authors": [
      "Jialiang Zhuang",
      "Bin Li",
      "Yun Zhang",
      "Xiujuan Zheng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2203.08073",
    "title": "Can A Neural Network Hear the Shape of A Drum?",
    "abstract": " Title: Can A Neural Network Hear the Shape of A Drum? ",
    "url": "https://arxiv.org/abs/2203.08073",
    "authors": [
      "Yueqi Zhao",
      "Michael M. Fogler"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2203.13209",
    "title": "Direct parsing to sentiment graphs",
    "abstract": " Comments: Accepted to ACL 2022 ",
    "url": "https://arxiv.org/abs/2203.13209",
    "authors": [
      "David Samuel",
      "Jeremy Barnes",
      "Robin Kurtz",
      "Stephan Oepen",
      "Lilja Øvrelid",
      "Erik Velldal"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.00716",
    "title": "CharacterBERT and Self-Teaching for Improving the Robustness of Dense  Retrievers on Queries with Typos",
    "abstract": " Comments: 9 pages full paper, accepted at SIGIR2022 ",
    "url": "https://arxiv.org/abs/2204.00716",
    "authors": [
      "Shengyao Zhuang",
      "Guido Zuccon"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.02255",
    "title": "Sufficient Reasons for A Zero-Day Intrusion Detection Artificial Immune  System",
    "abstract": " Title: Sufficient Reasons for A Zero-Day Intrusion Detection Artificial Immune  System ",
    "url": "https://arxiv.org/abs/2204.02255",
    "authors": [
      "Qianru Zhou",
      "Rongzhen Li",
      "Lei Xu",
      "Arumugam Nallanathan",
      "Jian Yanga",
      "Anmin Fu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2204.06173",
    "title": "Task-Driven Data Augmentation for Vision-Based Robotic Control",
    "abstract": " Title: Task-Driven Data Augmentation for Vision-Based Robotic Control ",
    "url": "https://arxiv.org/abs/2204.06173",
    "authors": [
      "Shubhankar Agarwal",
      "Sandeep P. Chinchali"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.06466",
    "title": "Grand canonical ensembles of sparse networks and Bayesian inference",
    "abstract": " Comments: (30 pages, 4 figures) ",
    "url": "https://arxiv.org/abs/2204.06466",
    "authors": [
      "Ginestra Bianconi"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Social and Information Networks (cs.SI)",
      "Statistics Theory (math.ST)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2204.07352",
    "title": "A Differentially Private Probabilistic Framework for Modeling the  Variability Across Federated Datasets of Heterogeneous Multi-View  Observations",
    "abstract": " Comments: Accepted for publication at the Journal of Machine Learning for Biomedical Imaging (MELBA) this https URL ",
    "url": "https://arxiv.org/abs/2204.07352",
    "authors": [
      "Irene Balelli",
      "Santiago Silva",
      "Marco Lorenzi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Applications (stat.AP)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2204.08479",
    "title": "Inductive Biases for Object-Centric Representations in the Presence of  Complex Textures",
    "abstract": " Title: Inductive Biases for Object-Centric Representations in the Presence of  Complex Textures ",
    "url": "https://arxiv.org/abs/2204.08479",
    "authors": [
      "Samuele Papa",
      "Ole Winther",
      "Andrea Dittadi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10072",
    "title": "Detecting Topology Attacks against Graph Neural Networks",
    "abstract": " Title: Detecting Topology Attacks against Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2204.10072",
    "authors": [
      "Senrong Xu",
      "Yuan Yao",
      "Liangyue Li",
      "Wei Yang",
      "Feng Xu",
      "Hanghang Tong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2204.10836",
    "title": "Federated Learning Enables Big Data for Rare Cancer Boundary Detection",
    "abstract": " Comments: federated learning, deep learning, convolutional neural network, segmentation, brain tumor, glioma, glioblastoma, FeTS, BraTS ",
    "url": "https://arxiv.org/abs/2204.10836",
    "authors": [
      "Sarthak Pati",
      "Ujjwal Baid",
      "Brandon Edwards",
      "Micah Sheller",
      "Shih-Han Wang",
      "G Anthony Reina",
      "Patrick Foley",
      "Alexey Gruzdev",
      "Deepthi Karkada",
      "Christos Davatzikos",
      "Chiharu Sako",
      "Satyam Ghodasara",
      "Michel Bilello",
      "Suyash Mohan",
      "Philipp Vollmuth",
      "Gianluca Brugnara",
      "Chandrakanth J Preetha",
      "Felix Sahm",
      "Klaus Maier-Hein",
      "Maximilian Zenk",
      "Martin Bendszus",
      "Wolfgang Wick",
      "Evan Calabrese",
      "Jeffrey Rudie",
      "Javier Villanueva-Meyer",
      "Soonmee Cha",
      "Madhura Ingalhalikar",
      "Manali Jadhav",
      "Umang Pandey",
      "Jitender Saini",
      "John Garrett",
      "Matthew Larson",
      "Robert Jeraj",
      "Stuart Currie",
      "Russell Frood",
      "Kavi Fatania",
      "Raymond Y Huang",
      "Ken Chang",
      "Carmen Balana",
      "Jaume Capellades",
      "Josep Puig",
      "Johannes Trenkler",
      "Josef Pichler",
      "Georg Necker",
      "Andreas Haunschmidt",
      "Stephan Meckel",
      "Gaurav Shukla",
      "Spencer Liem",
      "Gregory S Alexander",
      "Joseph Lombardo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.11368",
    "title": "Enhancing the STIX Representation of MITRE ATT&CK for Group Filtering  and Technique Prioritization",
    "abstract": " Title: Enhancing the STIX Representation of MITRE ATT&CK for Group Filtering  and Technique Prioritization ",
    "url": "https://arxiv.org/abs/2204.11368",
    "authors": [
      "Mateusz Zych",
      "Vasileios Mavroeidis"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.11582",
    "title": "Graph-DETR3D: Rethinking Overlapping Regions for Multi-View 3D Object  Detection",
    "abstract": " Title: Graph-DETR3D: Rethinking Overlapping Regions for Multi-View 3D Object  Detection ",
    "url": "https://arxiv.org/abs/2204.11582",
    "authors": [
      "Zehui Chen",
      "Zhenyu Li",
      "Shiquan Zhang",
      "Liangji Fang",
      "Qinhong Jiang",
      "Feng Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.11587",
    "title": "Adversarial Filtering Modeling on Long-term User Behavior Sequences for  Click-Through Rate Prediction",
    "abstract": " Comments: 5 pages ",
    "url": "https://arxiv.org/abs/2204.11587",
    "authors": [
      "Xiaochen Li",
      "Rui Zhong",
      "Jian Liang",
      "Xialong Liu",
      "Yu Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2204.11797",
    "title": "PVNAS: 3D Neural Architecture Search with Point-Voxel Convolution",
    "abstract": " Comments: Journal extension of arXiv:1907.03739 and arXiv:2007.16100 (IEEE TPAMI, 2021). The first two authors contributed equally to this work ",
    "url": "https://arxiv.org/abs/2204.11797",
    "authors": [
      "Zhijian Liu",
      "Haotian Tang",
      "Shengyu Zhao",
      "Kevin Shao",
      "Song Han"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  }
]