[
  {
    "id": "arXiv:2107.10344",
    "title": "Challenges in cybersecurity: Lessons from biological defense systems",
    "abstract": "We explore the commonalities between methods for assuring the security of computer systems (cybersecurity) and the mechanisms that have evolved through natural selection to protect vertebrates against pathogens, and how insights derived from studying the evolution of natural defenses can inform the design of more effective cybersecurity systems. More generally, security challenges are crucial for the maintenance of a wide range of complex adaptive systems, including financial systems, and again lessons learned from the study of the evolution of natural defenses can provide guidance for the protection of such systems. ",
    "url": "https://arxiv.org/abs/2107.10344",
    "authors": [
      "Edward Schrom",
      "Ann Kinzig",
      "Stephanie Forrest",
      "Andrea L. Graham",
      "Simon A. Levin",
      "Carl T. Bergstrom",
      "Carlos Castillo-Chavez",
      "James P. Collins",
      "Rob J. de Boer",
      "Adam Doupé",
      "Roya Ensafi",
      "Stuart Feldman",
      "Bryan T. Grenfell. Alex Halderman",
      "Silvie Huijben",
      "Carlo Maley",
      "Melanie Mosesr",
      "Alan S. Perelson",
      "Charles Perrings",
      "Joshua Plotkin",
      "Jennifer Rexford",
      "Mohit Tiwari"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Populations and Evolution (q-bio.PE)"
    ]
  },
  {
    "id": "arXiv:2107.10657",
    "title": "Solving inverse problems with deep neural networks driven by sparse  signal decomposition in a physics-based dictionary",
    "abstract": "Deep neural networks (DNN) have an impressive ability to invert very complex models, i.e. to learn the generative parameters from a model's output. Once trained, the forward pass of a DNN is often much faster than traditional, optimization-based methods used to solve inverse problems. This is however done at the cost of lower interpretability, a fundamental limitation in most medical applications. We propose an approach for solving general inverse problems which combines the efficiency of DNN and the interpretability of traditional analytical methods. The measurements are first projected onto a dense dictionary of model-based responses. The resulting sparse representation is then fed to a DNN with an architecture driven by the problem's physics for fast parameter learning. Our method can handle generative forward models that are costly to evaluate and exhibits similar performance in accuracy and computation time as a fully-learned DNN, while maintaining high interpretability and being easier to train. Concrete results are shown on an example of model-based brain parameter estimation from magnetic resonance imaging (MRI). ",
    "url": "https://arxiv.org/abs/2107.10657",
    "authors": [
      "Gaetan Rensonnet",
      "Louise Adam",
      "Benoit Macq"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.10689",
    "title": "Testing isomorphism of chordal graphs of bounded leafage is  fixed-parameter tractable",
    "abstract": "It is known that testing isomorphism of chordal graphs is as hard as the general graph isomorphism problem. Every chordal graph can be represented as the intersection graph of some subtrees of a tree. The leafage of a chordal graph, is defined to be the minimum number of leaves in the representing tree. We construct a fixed-parameter tractable algorithm testing isomorphism of chordal graphs with bounded leafage. The key point is a fixed-parameter tractable algorithm finding the automorphism group of a colored order-3 hypergraph with bounded sizes of color classes of vertices. ",
    "url": "https://arxiv.org/abs/2107.10689",
    "authors": [
      "Vikraman Arvind",
      "Roman Nedela",
      "Ilia Ponomarenko",
      "Peter Zeman"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2107.10703",
    "title": "Typing assumptions improve identification in causal discovery",
    "abstract": "Causal discovery from observational data is a challenging task to which an exact solution cannot always be identified. Under assumptions about the data-generative process, the causal graph can often be identified up to an equivalence class. Proposing new realistic assumptions to circumscribe such equivalence classes is an active field of research. In this work, we propose a new set of assumptions that constrain possible causal relationships based on the nature of the variables. We thus introduce typed directed acyclic graphs, in which variable types are used to determine the validity of causal relationships. We demonstrate, both theoretically and empirically, that the proposed assumptions can result in significant gains in the identification of the causal graph. ",
    "url": "https://arxiv.org/abs/2107.10703",
    "authors": [
      "Philippe Brouillard",
      "Perouz Taslakian",
      "Alexandre Lacoste",
      "Sebastien Lachapelle",
      "Alexandre Drouin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.10835",
    "title": "Recovering lost and absent information in temporal networks",
    "abstract": "The full range of activity in a temporal network is captured in its edge activity data -- time series encoding the tie strengths or on-off dynamics of each edge in the network. However, in many practical applications, edge-level data are unavailable, and the network analyses must rely instead on node activity data which aggregates the edge-activity data and thus is less informative. This raises the question: Is it possible to use the static network to recover the richer edge activities from the node activities? Here we show that recovery is possible, often with a surprising degree of accuracy given how much information is lost, and that the recovered data are useful for subsequent network analysis tasks. Recovery is more difficult when network density increases, either topologically or dynamically, but exploiting dynamical and topological sparsity enables effective solutions to the recovery problem. We formally characterize the difficulty of the recovery problem both theoretically and empirically, proving the conditions under which recovery errors can be bounded and showing that, even when these conditions are not met, good quality solutions can still be derived. Effective recovery carries both promise and peril, as it enables deeper scientific study of complex systems but in the context of social systems also raises privacy concerns when social information can be aggregated across multiple data sources. ",
    "url": "https://arxiv.org/abs/2107.10835",
    "authors": [
      "James P. Bagrow",
      "Sune Lehmann"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)",
      "Applications (stat.AP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.10510",
    "title": "Hodge theoretic reward allocation for generalized cooperative games on  graphs",
    "abstract": "We define cooperative games on general graphs and generalize Lloyd S. Shapley's celebrated allocation formula for those games in terms of stochastic path integral driven by the associated Markov chain on each graph. We then show that the value allocation operator, one for each player defined by the stochastic path integral, coincides with the player's component game which is the solution to the least squares (or Poisson's) equation, in light of the combinatorial Hodge decomposition on general weighted graphs. Several motivational examples and applications are also presented. ",
    "url": "https://arxiv.org/abs/2107.10510",
    "authors": [
      "Tongseok Lim"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Computer Science and Game Theory (cs.GT)",
      "Theoretical Economics (econ.TH)",
      "Mathematical Finance (q-fin.MF)"
    ]
  },
  {
    "id": "arXiv:2107.10567",
    "title": "An overcome of far-distance limitation on tunnel CCTV-based accident  detection in AI deep-learning frameworks",
    "abstract": "Tunnel CCTVs are installed to low height and long-distance interval. However, because of the limitation of installation height, severe perspective effect in distance occurs, and it is almost impossible to detect vehicles in far distance from the CCTV in the existing tunnel CCTV-based accident detection system (Pflugfelder 2005). To overcome the limitation, a vehicle object is detected through an object detection algorithm based on an inverse perspective transform by re-setting the region of interest (ROI). It can detect vehicles that are far away from the CCTV. To verify this process, this paper creates each dataset consisting of images and bounding boxes based on the original and warped images of the CCTV at the same time, and then compares performance of the deep learning object detection models trained with the two datasets. As a result, the model that trained the warped image was able to detect vehicle objects more accurately at the position far from the CCTV compared to the model that trained the original image. ",
    "url": "https://arxiv.org/abs/2107.10567",
    "authors": [
      "Kyu-Beom Lee",
      "Hyu-Soung Shin"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.10711",
    "title": "Physics-informed neural networks for solving Reynolds-averaged  Navier$\\unicode{x2013}$Stokes equations",
    "abstract": "Physics-informed neural networks (PINNs) are successful machine-learning methods for the solution and identification of partial differential equations (PDEs). We employ PINNs for solving the Reynolds-averaged Navier$\\unicode{x2013}$Stokes (RANS) equations for incompressible turbulent flows without any specific model or assumption for turbulence, and by taking only the data on the domain boundaries. We first show the applicability of PINNs for solving the Navier$\\unicode{x2013}$Stokes equations for laminar flows by solving the Falkner$\\unicode{x2013}$Skan boundary layer. We then apply PINNs for the simulation of four turbulent-flow cases, i.e., zero-pressure-gradient boundary layer, adverse-pressure-gradient boundary layer, and turbulent flows over a NACA4412 airfoil and the periodic hill. Our results show the excellent applicability of PINNs for laminar flows with strong pressure gradients, where predictions with less than 1% error can be obtained. For turbulent flows, we also obtain very good accuracy on simulation results even for the Reynolds-stress components. ",
    "url": "https://arxiv.org/abs/2107.10711",
    "authors": [
      "Hamidreza Eivazi",
      "Mojtaba Tahani",
      "Philipp Schlatter",
      "Ricardo Vinuesa"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2107.10764",
    "title": "Nonlinear transformation of complex amplitudes via quantum singular  value transformation",
    "abstract": "Due to the linearity of quantum operations, it is not straightforward to implement nonlinear transformations on a quantum computer, making some practical tasks like a neural network hard to be achieved. In this work, we define a task called nonlinear transformation of complex amplitudes and provide an algorithm to achieve this task. Specifically, we construct a block-encoding of complex amplitudes from a state preparation oracle. This allows us to transform the complex amplitudes by using quantum singular value transformation. We evaluate the required overhead in terms of input dimension and precision, which reveals that the algorithm depends on the roughly square root of input dimension and achieves an exponential speedup on precision compared with previous work. We also discuss its possible applications to quantum machine learning, where complex amplitudes encoding classical or quantum data are processed by the proposed method. This paper provides a promising way to introduce highly complex nonlinearity of the quantum states, which is essentially missing in quantum mechanics. ",
    "url": "https://arxiv.org/abs/2107.10764",
    "authors": [
      "Naixu Guo",
      "Kosuke Mitarai",
      "Keisuke Fujii"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2006.05161",
    "title": "Provable tradeoffs in adversarially robust classification",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible. 42 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2006.05161",
    "authors": [
      "Edgar Dobriban",
      "Hamed Hassani",
      "David Hong",
      "Alexander Robey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2010.09994",
    "title": "Entropy stable discontinuous Galerkin methods for nonlinear conservation  laws on networks and multi-dimensional domains",
    "abstract": " Title: Entropy stable discontinuous Galerkin methods for nonlinear conservation  laws on networks and multi-dimensional domains ",
    "url": "https://arxiv.org/abs/2010.09994",
    "authors": [
      "Xinhui Wu",
      "Jesse Chan"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2105.02083",
    "title": "AdaBoost and robust one-bit compressed sensing",
    "abstract": " Comments: 29 pages, 4 figures, code available at this https URL ",
    "url": "https://arxiv.org/abs/2105.02083",
    "authors": [
      "Geoffrey Chinot",
      "Felix Kuchelmeister",
      "Matthias Löffler",
      "Sara van de Geer"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Information Theory (cs.IT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.01422",
    "title": "Imaging dynamics beneath turbid media via parallelized single-photon  detection",
    "abstract": " Title: Imaging dynamics beneath turbid media via parallelized single-photon  detection ",
    "url": "https://arxiv.org/abs/2107.01422",
    "authors": [
      "Shiqi Xu",
      "Xi Yang",
      "Wenhui Liu",
      "Joakim Jonsson",
      "Ruobing Qian",
      "Pavan Chandra Konda",
      "Kevin C. Zhou",
      "Qionghai Dai",
      "Haoqian Wang",
      "Edouard Berrocal",
      "Roarke Horstmeyer"
    ],
    "subjectives": [
      "Optics (physics.optics)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)",
      "Tissues and Organs (q-bio.TO)"
    ]
  },
  {
    "id": "arXiv:2107.09851",
    "title": "Fundamental requirements for the design of ultra-reliable low-latency  mobile networks",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2107.09851",
    "authors": [
      "André Gomes",
      "Jacek Kibiłda",
      "Nicola Marchetti",
      "Luiz A. DaSilva"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2107.10018",
    "title": "Formal method of synthesis of optimal topologies of computing systems  based on projective description of graphs",
    "abstract": " Comments: In Russian ",
    "url": "https://arxiv.org/abs/2107.10018",
    "authors": [
      "V.A. Melent'ev"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Optimization and Control (math.OC)"
    ]
  }
]