[
  {
    "id": "arXiv:2203.12622",
    "title": "Are Evolutionary Algorithms Safe Optimizers?",
    "abstract": "We consider a type of constrained optimization problem, where the violation of a constraint leads to an irrevocable loss, such as breakage of a valuable experimental resource/platform or loss of human life. Such problems are referred to as safe optimization problems (SafeOPs). While SafeOPs have received attention in the machine learning community in recent years, there was little interest in the evolutionary computation (EC) community despite some early attempts between 2009 and 2011. Moreover, there is a lack of acceptable guidelines on how to benchmark different algorithms for SafeOPs, an area where the EC community has significant experience in. Driven by the need for more efficient algorithms and benchmark guidelines for SafeOPs, the objective of this paper is to reignite the interest of this problem class in the EC community. To achieve this we (i) provide a formal definition of SafeOPs and contrast it to other types of optimization problems that the EC community is familiar with, (ii) investigate the impact of key SafeOP parameters on the performance of selected safe optimization algorithms, (iii) benchmark EC against state-of-the-art safe optimization algorithms from the machine learning community, and (iv) provide an open-source Python framework to replicate and extend our work. ",
    "url": "https://arxiv.org/abs/2203.12622",
    "authors": [
      "Youngmin Kim",
      "Richard Allmendinger",
      "Manuel López-Ibáñez"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.12647",
    "title": "Robust Onboard Localization in Changing Environments Exploiting Text  Spotting",
    "abstract": "Robust localization in a given map is a crucial component of most autonomous robots. In this paper, we address the problem of localizing in an indoor environment that changes and where prominent structures have no correspondence in the map built at a different point in time. To overcome the discrepancy between the map and the observed environment caused by such changes, we exploit human-readable localization cues to assist localization. These cues are readily available in most facilities and can be detected using RGB camera images by utilizing text spotting. We integrate these cues into a Monte Carlo localization framework using a particle filter that operates on 2D LiDAR scans and camera data. By this, we provide a robust localization solution for environments with structural changes and dynamics by humans walking. We evaluate our localization framework on multiple challenging indoor scenarios in an office environment. The experiments suggest that our approach is robust to structural changes and can run on an onboard computer. We release an open source implementation of our approach (upon paper acceptance), which uses off-the-shelf text spotting, written in C++ with a ROS wrapper. ",
    "url": "https://arxiv.org/abs/2203.12647",
    "authors": [
      "Nicky Zimmerman",
      "Louis Wiesmann",
      "Tiziano Guadagnino",
      "Thomas Läbe",
      "Jens Behley",
      "Cyrill Stachniss"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.12659",
    "title": "A Supervised Machine Learning Approach for Sequence Based  Protein-protein Interaction (PPI) Prediction",
    "abstract": "Computational protein-protein interaction (PPI) prediction techniques can contribute greatly in reducing time, cost and false-positive interactions compared to experimental approaches. Sequence is one of the key and primary information of proteins that plays a crucial role in PPI prediction. Several machine learning approaches have been applied to exploit the characteristics of PPI datasets. However, these datasets greatly influence the performance of predicting models. So, care should be taken on both dataset curation as well as design of predictive models. Here, we have described our submitted solution with the results of the SeqPIP competition whose objective was to develop comprehensive PPI predictive models from sequence information with high-quality bias-free interaction datasets. A training set of 2000 positive and 2000 negative interactions with sequences was given to us. Our method was evaluated with three independent high-quality interaction test datasets and with other competitors solutions. ",
    "url": "https://arxiv.org/abs/2203.12659",
    "authors": [
      "Soumyadeep Debnath",
      "Ayatullah Faruk Mollah"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2203.12662",
    "title": "Spiking Neural Streaming Binary Arithmetic",
    "abstract": "Boolean functions and binary arithmetic operations are central to standard computing paradigms. Accordingly, many advances in computing have focused upon how to make these operations more efficient as well as exploring what they can compute. To best leverage the advantages of novel computing paradigms it is important to consider what unique computing approaches they offer. However, for any special-purpose co-processor, Boolean functions and binary arithmetic operations are useful for, among other things, avoiding unnecessary I/O on-and-off the co-processor by pre- and post-processing data on-device. This is especially true for spiking neuromorphic architectures where these basic operations are not fundamental low-level operations. Instead, these functions require specific implementation. Here we discuss the implications of an advantageous streaming binary encoding method as well as a handful of circuits designed to exactly compute elementary Boolean and binary operations. ",
    "url": "https://arxiv.org/abs/2203.12662",
    "authors": [
      "James B. Aimone",
      "Aaron J. Hill",
      "William M. Severa",
      "Craig M. Vineyard"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2203.12674",
    "title": "A Deep Reinforcement Learning-Based Caching Strategy for IoT Networks  with Transient Data",
    "abstract": "The Internet of Things (IoT) has been continuously rising in the past few years, and its potentials are now more apparent. However, transient data generation and limited energy resources are the major bottlenecks of these networks. Besides, minimum delay and other conventional quality of service measurements are still valid requirements to meet. An efficient caching policy can help meet the standard quality of service requirements while bypassing IoT networks' specific limitations. Adopting deep reinforcement learning (DRL) algorithms enables us to develop an effective caching scheme without the need for any prior knowledge or contextual information. In this work, we propose a DRL-based caching scheme that improves the cache hit rate and reduces energy consumption of the IoT networks, in the meanwhile, taking data freshness and limited lifetime of IoT data into account. To better capture the regional-different popularity distribution, we propose a hierarchical architecture to deploy edge caching nodes in IoT networks. The results of comprehensive experiments show that our proposed method outperforms the well-known conventional caching policies and an existing DRL-based solution in terms of cache hit rate and energy consumption of the IoT networks by considerable margins. ",
    "url": "https://arxiv.org/abs/2203.12674",
    "authors": [
      "Hongda Wu",
      "Ali Nasehzadeh",
      "Ping Wang"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.12693",
    "title": "Enhancing Classifier Conservativeness and Robustness by Polynomiality",
    "abstract": "We illustrate the detrimental effect, such as overconfident decisions, that exponential behavior can have in methods like classical LDA and logistic regression. We then show how polynomiality can remedy the situation. This, among others, leads purposefully to random-level performance in the tails, away from the bulk of the training data. A directly related, simple, yet important technical novelty we subsequently present is softRmax: a reasoned alternative to the standard softmax function employed in contemporary (deep) neural networks. It is derived through linking the standard softmax to Gaussian class-conditional models, as employed in LDA, and replacing those by a polynomial alternative. We show that two aspects of softRmax, conservativeness and inherent gradient regularization, lead to robustness against adversarial attacks without gradient obfuscation. ",
    "url": "https://arxiv.org/abs/2203.12693",
    "authors": [
      "Ziqi Wang",
      "Marco Loog"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.12709",
    "title": "Adversarial Training for Improving Model Robustness? Look at Both  Prediction and Interpretation",
    "abstract": "Neural language models show vulnerability to adversarial examples which are semantically similar to their original counterparts with a few words replaced by their synonyms. A common way to improve model robustness is adversarial training which follows two steps-collecting adversarial examples by attacking a target model, and fine-tuning the model on the augmented dataset with these adversarial examples. The objective of traditional adversarial training is to make a model produce the same correct predictions on an original/adversarial example pair. However, the consistency between model decision-makings on two similar texts is ignored. We argue that a robust model should behave consistently on original/adversarial example pairs, that is making the same predictions (what) based on the same reasons (how) which can be reflected by consistent interpretations. In this work, we propose a novel feature-level adversarial training method named FLAT. FLAT aims at improving model robustness in terms of both predictions and interpretations. FLAT incorporates variational word masks in neural networks to learn global word importance and play as a bottleneck teaching the model to make predictions based on important words. FLAT explicitly shoots at the vulnerability problem caused by the mismatch between model understandings on the replaced words and their synonyms in original/adversarial example pairs by regularizing the corresponding global word importance scores. Experiments show the effectiveness of FLAT in improving the robustness with respect to both predictions and interpretations of four neural network models (LSTM, CNN, BERT, and DeBERTa) to two adversarial attacks on four text classification tasks. The models trained via FLAT also show better robustness than baseline models on unforeseen adversarial examples across different attacks. ",
    "url": "https://arxiv.org/abs/2203.12709",
    "authors": [
      "Hanjie Chen",
      "Yangfeng Ji"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.12710",
    "title": "The Challenges of Continuous Self-Supervised Learning",
    "abstract": "Self-supervised learning (SSL) aims to eliminate one of the major bottlenecks in representation learning - the need for human annotations. As a result, SSL holds the promise to learn representations from data in-the-wild, i.e., without the need for finite and static datasets. Instead, true SSL algorithms should be able to exploit the continuous stream of data being generated on the internet or by agents exploring their environments. But do traditional self-supervised learning approaches work in this setup? In this work, we investigate this question by conducting experiments on the continuous self-supervised learning problem. While learning in the wild, we expect to see a continuous (infinite) non-IID data stream that follows a non-stationary distribution of visual concepts. The goal is to learn a representation that can be robust, adaptive yet not forgetful of concepts seen in the past. We show that a direct application of current methods to such continuous setup is 1) inefficient both computationally and in the amount of data required, 2) leads to inferior representations due to temporal correlations (non-IID data) in some sources of streaming data and 3) exhibits signs of catastrophic forgetting when trained on sources with non-stationary data distributions. We propose the use of replay buffers as an approach to alleviate the issues of inefficiency and temporal correlations. We further propose a novel method to enhance the replay buffer by maintaining the least redundant samples. Minimum redundancy (MinRed) buffers allow us to learn effective representations even in the most challenging streaming scenarios composed of sequential visual data obtained from a single embodied agent, and alleviates the problem of catastrophic forgetting when learning from data with non-stationary semantic distributions. ",
    "url": "https://arxiv.org/abs/2203.12710",
    "authors": [
      "Senthil Purushwalkam",
      "Pedro Morgado",
      "Abhinav Gupta"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.12712",
    "title": "OJXPerf: Featherlight Object Replica Detection for Java Programs",
    "abstract": "Memory bloat is an important source of inefficiency in complex production software, especially in software written in managed languages such as Java. Prior approaches to this problem have focused on identifying objects that outlive their life span. Few studies have, however, looked into whether and to what extent myriad objects of the same type are identical. A quantitative assessment of identical objects with code-level attribution can assist developers in refactoring code to eliminate object bloat, and favor reuse of existing object(s). The result is reduced memory pressure, reduced allocation and garbage collection, enhanced data locality, and reduced re-computation, all of which result in superior performance. We develop OJXPerf, a lightweight sampling-based profiler, which probabilistically identifies identical objects. OJXPerf employs hardware performance monitoring units (PMU) in conjunction with hardware debug registers to sample and compare field values of different objects of the same type allocated at the same calling context but potentially accessed at different program points. The result is a lightweight measurement, a combination of object allocation contexts and usage contexts ordered by duplication frequency. This class of duplicated objects is relatively easier to optimize. OJXPerf incurs 9% runtime and 6% memory overheads on average. We empirically show the benefit of OJXPerf by using its profiles to instruct us to optimize a number of Java programs, including well-known benchmarks and real-world applications. The results show a noticeable reduction in memory usage (up to 11%) and a significant speedup (up to 25%). ",
    "url": "https://arxiv.org/abs/2203.12712",
    "authors": [
      "Bolun Li",
      "Hao Xu",
      "Qidong Zhao",
      "Pengfei Su",
      "Milind Chabbi",
      "Shuyin Jiao",
      "Xu Liu"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2203.12738",
    "title": "Contextual Model Aggregation for Fast and Robust Federated Learning in  Edge Computing",
    "abstract": "Federated learning is a prime candidate for distributed machine learning at the network edge due to the low communication complexity and privacy protection among other attractive properties. However, existing algorithms face issues with slow convergence and/or robustness of performance due to the considerable heterogeneity of data distribution, computation and communication capability at the edge. In this work, we tackle both of these issues by focusing on the key component of model aggregation in federated learning systems and studying optimal algorithms to perform this task. Particularly, we propose a contextual aggregation scheme that achieves the optimal context-dependent bound on loss reduction in each round of optimization. The aforementioned context-dependent bound is derived from the particular participating devices in that round and an assumption on smoothness of the overall loss function. We show that this aggregation leads to a definite reduction of loss function at every round. Furthermore, we can integrate our aggregation with many existing algorithms to obtain the contextual versions. Our experimental results demonstrate significant improvements in convergence speed and robustness of the contextual versions compared to the original algorithms. We also consider different variants of the contextual aggregation and show robust performance even in the most extreme settings. ",
    "url": "https://arxiv.org/abs/2203.12738",
    "authors": [
      "Hung T. Nguyen",
      "H. Vincent Poor",
      "Mung Chiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2203.12745",
    "title": "UMT: Unified Multi-modal Transformers for Joint Video Moment Retrieval  and Highlight Detection",
    "abstract": "Finding relevant moments and highlights in videos according to natural language queries is a natural and highly valuable common need in the current video content explosion era. Nevertheless, jointly conducting moment retrieval and highlight detection is an emerging research topic, even though its component problems and some related tasks have already been studied for a while. In this paper, we present the first unified framework, named Unified Multi-modal Transformers (UMT), capable of realizing such joint optimization while can also be easily degenerated for solving individual problems. As far as we are aware, this is the first scheme to integrate multi-modal (visual-audio) learning for either joint optimization or the individual moment retrieval task, and tackles moment retrieval as a keypoint detection problem using a novel query generator and query decoder. Extensive comparisons with existing methods and ablation studies on QVHighlights, Charades-STA, YouTube Highlights, and TVSum datasets demonstrate the effectiveness, superiority, and flexibility of the proposed method under various settings. Source code and pre-trained models are available at https://github.com/TencentARC/UMT. ",
    "url": "https://arxiv.org/abs/2203.12745",
    "authors": [
      "Ye Liu",
      "Siyuan Li",
      "Yang Wu",
      "Chang Wen Chen",
      "Ying Shan",
      "Xiaohu Qie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.12751",
    "title": "ThingTalk: An Extensible, Executable Representation Language for  Task-Oriented Dialogues",
    "abstract": "Task-oriented conversational agents rely on semantic parsers to translate natural language to formal representations. In this paper, we propose the design and rationale of the ThingTalk formal representation, and how the design improves the development of transactional task-oriented agents. ThingTalk is built on four core principles: (1) representing user requests directly as executable statements, covering all the functionality of the agent, (2) representing dialogues formally and succinctly to support accurate contextual semantic parsing, (3) standardizing types and interfaces to maximize reuse between agents, and (4) allowing multiple, independently-developed agents to be composed in a single virtual assistant. ThingTalk is developed as part of the Genie Framework that allows developers to quickly build transactional agents given a database and APIs. We compare ThingTalk to existing representations: SMCalFlow, SGD, TreeDST. Compared to the others, the ThingTalk design is both more general and more cost-effective. Evaluated on the MultiWOZ benchmark, using ThingTalk and associated tools yields a new state of the art accuracy of 79% turn-by-turn. ",
    "url": "https://arxiv.org/abs/2203.12751",
    "authors": [
      "Monica S. Lam",
      "Giovanni Campagna",
      "Mehrad Moradshahi",
      "Sina J. Semnani",
      "Silei Xu"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.12752",
    "title": "Functional mimicry of Ruffini receptors with Fiber Bragg Gratings and  Deep Neural Networks enables a bio-inspired large-area tactile sensitive skin",
    "abstract": "Collaborative robots are expected to physically interact with humans in daily living and workplace, including industrial and healthcare settings. A related key enabling technology is tactile sensing, which currently requires addressing the outstanding scientific challenge to simultaneously detect contact location and intensity by means of soft conformable artificial skins adapting over large areas to the complex curved geometries of robot embodiments. In this work, the development of a large-area sensitive soft skin with a curved geometry is presented, allowing for robot total-body coverage through modular patches. The biomimetic skin consists of a soft polymeric matrix, resembling a human forearm, embedded with photonic Fiber Bragg Grating (FBG) transducers, which partially mimics Ruffini mechanoreceptor functionality with diffuse, overlapping receptive fields. A Convolutional Neural Network deep learning algorithm and a multigrid Neuron Integration Process were implemented to decode the FBG sensor outputs for inferring contact force magnitude and localization through the skin surface. Results achieved 35 mN (IQR = 56 mN) and 3.2 mm (IQR = 2.3 mm) median errors, for force and localization predictions, respectively. Demonstrations with an anthropomorphic arm pave the way towards AI-based integrated skins enabling safe human-robot cooperation via machine intelligence. ",
    "url": "https://arxiv.org/abs/2203.12752",
    "authors": [
      "Luca Massari",
      "Giulia Fransvea",
      "Jessica D'Abbraccio",
      "Mariangela Filosa",
      "Giuseppe Terruso",
      "Andrea Aliperta",
      "Giacomo D'Alesio",
      "Martina Zaltieri",
      "Emiliano Schena",
      "Eduardo Palermo",
      "Edoardo Sinibaldi",
      "Calogero Maria Oddo"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Signal Processing (eess.SP)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.12755",
    "title": "SelfAPR: Self-supervised Program Repair with Test Execution Diagnostics",
    "abstract": "Neural program repair has achieved good results in a recent series of papers. Yet, we observe that the related work fails to repair some bugs because of a lack of knowledge about 1) the program being repaired, and 2) the actual fault being repaired. In this paper, we solve both problems by changing the learning paradigm from supervised training to self-supervised training in an approach called SelfAPR. First, SelfAPR generates and constructs training samples by perturbing a previous version of the program being repaired, enforcing the neural model to capture project-specific knowledge. This is different from all the existing work based on past commits. Second, SelfAPR extracts and encodes test execution diagnostics into the input representation, steering the neural model to fix the specific kind of fault. This is different from the existing studies that only consider static source code in the input. We implement SelfAPR and evaluate it in a systematic manner. We train SelfAPR with 253 411 training samples obtained by perturbing 17 open-source projects. We evaluate SelfAPR on 818 bugs from Defects4J, SelfAPR correctly repairs 112 of them. ",
    "url": "https://arxiv.org/abs/2203.12755",
    "authors": [
      "He Ye",
      "Matias Martinez",
      "Xiapu Luo",
      "Tao Zhang",
      "Martin Monperrus"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2203.12775",
    "title": "ZSM-based Management and Orchestration of 3GPP Network Slicing: An  Architectural Framework and Deployment Options",
    "abstract": "Driven by closed-loop automation, the Zero-Touch Network and Services Management (ZSM) framework offers invigorating features for the end-to-end management and orchestration of a sliced network. Although ZSM is considered a promising framework by 3GPP, there is a lack of concrete ZSM-based solutions for the 3GPP Network Slicing management. This article presents an architectural framework of a ZSM-based management system for 3GPP Network Slicing. The proposed framework employs recursive ZSM management domains to meet the specific management requirements of the standard 3GPP Network Slicing framework. Two deployment options are considered for the presented framework. The first option features the integration of the standard services of the 3GPP Management System within ZSM. The other one considers ZSM as a complementary system for the standard 3GPP Management System. From these deployment options, some key questions are identified on ZSM's interoperability with the existing 3GPP Network Slicing systems. Finally, for each option, the architectural and operational feasibility of the ZSM interoperation with 3GPP Network Slicing systems is shown through an example use case. ",
    "url": "https://arxiv.org/abs/2203.12775",
    "authors": [
      "Muhammad Mohtasim Sajjad",
      "Dhammika Jayalath",
      "Yu-Chu Tian",
      "Carlos J. Bernardos"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2203.12788",
    "title": "Evaluating Distributional Distortion in Neural Language Modeling",
    "abstract": "A fundamental characteristic of natural language is the high rate at which speakers produce novel expressions. Because of this novelty, a heavy-tail of rare events accounts for a significant amount of the total probability mass of distributions in language (Baayen, 2001). Standard language modeling metrics such as perplexity quantify the performance of language models (LM) in aggregate. As a result, we have relatively little understanding of whether neural LMs accurately estimate the probability of sequences in this heavy-tail of rare events. To address this gap, we develop a controlled evaluation scheme which uses generative models trained on natural data as artificial languages from which we can exactly compute sequence probabilities. Training LMs on generations from these artificial languages, we compare the sequence-level probability estimates given by LMs to the true probabilities in the target language. Our experiments reveal that LSTM and Transformer language models (i) systematically underestimate the probability of sequences drawn from the target language, and (ii) do so more severely for less-probable sequences. Investigating where this probability mass went, (iii) we find that LMs tend to overestimate the probability of ill formed (perturbed) sequences. In addition, we find that this underestimation behaviour (iv) is weakened, but not eliminated by greater amounts of training data, and (v) is exacerbated for target distributions with lower entropy. ",
    "url": "https://arxiv.org/abs/2203.12788",
    "authors": [
      "Benjamin LeBrun",
      "Alessandro Sordoni",
      "Timothy J. O'Donnell"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.12793",
    "title": "A Reinforcement Approach for Detecting P2P Botnet Communities in Dynamic  Communication Graphs",
    "abstract": "Peer-to-peer (P2P) botnets use decentralized command and control networks that make them resilient to disruptions. The P2P botnet overlay networks manifest structures in mutual-contact graphs, also called communication graphs, formed using network traffic information. It has been shown that these structures can be detected using community detection techniques from graph theory. These previous works, however, treat the communication graphs and the P2P botnet structures as static. In reality, communication graphs are dynamic as they represent the continuously changing network traffic flows. Similarly, the P2P botnets also evolve with time, as new bots join and existing bots leave either temporarily or permanently. In this paper we address the problem of detecting such evolving P2P botnet communities in dynamic communication graphs. We propose a reinforcement-based approach, suitable for large communication graphs, that improves precision and recall of P2P botnet community detection in dynamic communication graphs. ",
    "url": "https://arxiv.org/abs/2203.12793",
    "authors": [
      "Harshvardhan P. Joshi",
      "Rudra Dutta"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.12802",
    "title": "A platform for causal knowledge representation and inference in  industrial fault diagnosis based on cubic DUCG",
    "abstract": "The working conditions of large-scale industrial systems are very complex. Once a failure occurs, it will affect industrial production, cause property damage, and even endanger the workers' lives. Therefore, it is important to control the operation of the system to accurately grasp the operation status of the system and find out the failure in time. The occurrence of system failure is a gradual process, and the occurrence of the current system failure may depend on the previous state of the system, which is sequential. The fault diagnosis technology based on time series can monitor the operating status of the system in real-time, detect the abnormal operation of the system within the allowable time interval, diagnose the root cause of the fault and predict the status trend. In order to guide the technical personnel to troubleshoot and solve related faults, in this paper, an industrial fault diagnosis system is implemented based on the cubic DUCG theory. The diagnostic model of the system is constructed based on expert knowledge and experience. At the same time, it can perform real-time fault diagnosis based on time sequence, which solves the problem of fault diagnosis of industrial systems without sample data. ",
    "url": "https://arxiv.org/abs/2203.12802",
    "authors": [
      "Bu XuSong",
      "Nie Hao",
      "Zhang Zhan",
      "Zhang Qin"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.12821",
    "title": "GraphCoCo: Graph Complementary Contrastive Learning",
    "abstract": "Graph Contrastive Learning (GCL) has shown promising performance in graph representation learning (GRL) without the supervision of manual annotations. GCL can generate graph-level embeddings by maximizing the Mutual Information (MI) between different augmented views of the same graph (positive pairs). However, we identify an obstacle that the optimization of InfoNCE loss only concentrates on a few embeddings dimensions, limiting the distinguishability of embeddings in downstream graph classification tasks. This paper proposes an effective graph complementary contrastive learning approach named GraphCoCo to tackle the above issue. Specifically, we set the embedding of the first augmented view as the anchor embedding to localize \"highlighted\" dimensions (i.e., the dimensions contribute most in similarity measurement). Then remove these dimensions in the embeddings of the second augmented view to discover neglected complementary representations. Therefore, the combination of anchor and complementary embeddings significantly improves the performance in downstream tasks. Comprehensive experiments on various benchmark datasets are conducted to demonstrate the effectiveness of GraphCoCo, and the results show that our model outperforms the state-of-the-art methods. Source code will be made publicly available. ",
    "url": "https://arxiv.org/abs/2203.12821",
    "authors": [
      "Jiawei Sun",
      "Junchi Yan",
      "Chentao Wu",
      "Yue Ding",
      "Ruoxin Chen",
      "Xiang Yu",
      "Xinyu Lu",
      "Jie Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.12831",
    "title": "LHNN: Lattice Hypergraph Neural Network for VLSI Congestion Prediction",
    "abstract": "Precise congestion prediction from a placement solution plays a crucial role in circuit placement. This work proposes the lattice hypergraph (LH-graph), a novel graph formulation for circuits, which preserves netlist data during the whole learning process, and enables the congestion information propagated geometrically and topologically. Based on the formulation, we further developed a heterogeneous graph neural network architecture LHNN, jointing the routing demand regression to support the congestion spot classification. LHNN constantly achieves more than 35% improvements compared with U-nets and Pix2Pix on the F1 score. We expect our work shall highlight essential procedures using machine learning for congestion prediction. ",
    "url": "https://arxiv.org/abs/2203.12831",
    "authors": [
      "Bowen Wang",
      "Guibao Shen",
      "Dong Li",
      "Jianye Hao",
      "Wulong Liu",
      "Yu Huang",
      "Hongzhong Wu",
      "Yibo Lin",
      "Guangyong Chen",
      "Pheng Ann Heng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.12832",
    "title": "Heterogeneous Ground-Air Autonomous Vehicle Networking in Austere  Environments: Practical Implementation of a Mesh Network in the DARPA  Subterranean Challenge",
    "abstract": "Implementing a wireless mesh network in a real-life scenario requires a significant systems engineering effort to turn a network concept into a complete system. This paper presents an evaluation of a fielded system within the DARPA Subterranean (SubT) Challenge Final Event that contributed to a 3rd place finish. Our system included a team of air and ground robots, deployable mesh extender nodes, and a human operator base station. This paper presents a real-world evaluation of a stack optimized for air and ground robotic exploration in a RF-limited environment under practical system design limitations. Our highly customizable solution utilizes a minimum of non-free components with form factor options suited for UAV operations and provides insight into network operations at all levels. We present performance metrics based on our performance in the Final Event of the DARPA Subterranean Challenge, demonstrating the practical successes and limitations of our approach, as well as a set of lessons learned and suggestions for future improvements. ",
    "url": "https://arxiv.org/abs/2203.12832",
    "authors": [
      "Harel Biggie",
      "Steve McGuire"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.12840",
    "title": "Bayesian Nonparametric Submodular Video Partition for Robust Anomaly  Detection",
    "abstract": "Multiple-instance learning (MIL) provides an effective way to tackle the video anomaly detection problem by modeling it as a weakly supervised problem as the labels are usually only available at the video level while missing for frames due to expensive labeling cost. We propose to conduct novel Bayesian non-parametric submodular video partition (BN-SVP) to significantly improve MIL model training that can offer a highly reliable solution for robust anomaly detection in practical settings that include outlier segments or multiple types of abnormal events. BN-SVP essentially performs dynamic non-parametric hierarchical clustering with an enhanced self-transition that groups segments in a video into temporally consistent and semantically coherent hidden states that can be naturally interpreted as scenes. Each segment is assumed to be generated through a non-parametric mixture process that allows variations of segments within the same scenes to accommodate the dynamic and noisy nature of many real-world surveillance videos. The scene and mixture component assignment of BN-SVP also induces a pairwise similarity among segments, resulting in non-parametric construction of a submodular set function. Integrating this function with an MIL loss effectively exposes the model to a diverse set of potentially positive instances to improve its training. A greedy algorithm is developed to optimize the submodular function and support efficient model training. Our theoretical analysis ensures a strong performance guarantee of the proposed algorithm. The effectiveness of the proposed approach is demonstrated over multiple real-world anomaly video datasets with robust detection performance. ",
    "url": "https://arxiv.org/abs/2203.12840",
    "authors": [
      "Hitesh Sapkota",
      "Qi Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.12848",
    "title": "Keypoints Tracking via Transformer Networks",
    "abstract": "In this thesis, we propose a pioneering work on sparse keypoints tracking across images using transformer networks. While deep learning-based keypoints matching have been widely investigated using graph neural networks - and more recently transformer networks, they remain relatively too slow to operate in real-time and are particularly sensitive to the poor repeatability of the keypoints detectors. In order to address these shortcomings, we propose to study the particular case of real-time and robust keypoints tracking. Specifically, we propose a novel architecture which ensures a fast and robust estimation of the keypoints tracking between successive images of a video sequence. Our method takes advantage of a recent breakthrough in computer vision, namely, visual transformer networks. Our method consists of two successive stages, a coarse matching followed by a fine localization of the keypoints' correspondences prediction. Through various experiments, we demonstrate that our approach achieves competitive results and demonstrates high robustness against adverse conditions, such as illumination change, occlusion and viewpoint differences. ",
    "url": "https://arxiv.org/abs/2203.12848",
    "authors": [
      "Oleksii Nasypanyi",
      "Francois Rameau"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.12855",
    "title": "Disturbance Observer-based Robust Control Barrier Functions",
    "abstract": "This paper develops a novel safe control design framework that integrates the disturbance observer (DOB) and the control barrier function (CBF). Different from previous robust CBF results that are based on the worst-case of disturbances, this work utilizes a DOB to estimate the disturbances and construct a CBF-based safe controller to compensate for the disturbances such that the control performance can be significantly improved. The CBF-based safe controllers are obtained by solving convex quadratic programs (QPs) online. Application of the proposed control design method to Euler-Lagrange systems is also presented. The effectiveness of the proposed method is illustrated via numerical simulations. ",
    "url": "https://arxiv.org/abs/2203.12855",
    "authors": [
      "Yujie Wang",
      "Xiangru Xu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2203.12857",
    "title": "Local Measurement Based Robust Voltage Stability Index & Identification  of Voltage Collapse Onset",
    "abstract": "This paper addresses the problem of real-time monitoring of long-term voltage instability (LTVI) by using local field measurements. Existing local measurement-based methods use Thevenin equivalent parameter estimation that is sensitive to the noise in measurements. For solving this issue, we avoid the Thevenin approach by projecting the power flow equations as circles to develop local static-voltage stability indicator (LS-VSI) that is robust to measurement noises. The proposed method is an attractive option for practical implementation because of its decentralized nature, robustness to noise, and realistic modeling. Next, we utilize LS-VSI to propose a new local dynamic - VSI (LD-VSI) to identify the LTVI triggered by large disturbances and load tap changer dynamics. LD-VSI can identify not only the onset of instability with an alarm but also the voltage collapse point (VCP). Extensive numerical validation comparing LS-VSI with existing methods is presented on IEEE 30-bus and larger test systems like 2000-bus Texas synthetic grid to validate the robustness, accuracy, and situational awareness feature. We also verify the LD-VSI behavior on the Nordic power grid using PSSE dynamic simulation. When compared to existing methods, we observe that LD-VSI is not only more robust to measurement noise but also can identify VCP. ",
    "url": "https://arxiv.org/abs/2203.12857",
    "authors": [
      "Kishan Prudhvi Guddanti",
      "Amarsagar Matavalam",
      "Yang Weng"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Algebraic Geometry (math.AG)"
    ]
  },
  {
    "id": "arXiv:2203.12870",
    "title": "RNNPose: Recurrent 6-DoF Object Pose Refinement with Robust  Correspondence Field Estimation and Pose Optimization",
    "abstract": "Direct estimating the 6-DoF object pose from a single color image is challenging, and post-refinement is generally needed to achieve high-precision estimation. In this paper, we propose a framework based on a recurrent neural network (RNN) for object pose refinement, which is robust to erroneous initial poses and occlusions. During the recurrent iterations, object pose refinement is formulated as a non-linear least squares problem based on the estimated correspondence field (between a rendered image and the observed image). The problem is then solved by a differentiable Levenberg-Marquardt (LM) algorithm for end-toend training. The correspondence field estimation and pose refinement are conducted alternatively in each iteration to recover accurate object poses. Furthermore, to improve the robustness to occlusions, we introduce a consistencycheck mechanism based on the learned descriptors of the 3D model and observed 2D image, which downweights the unreliable correspondences during pose optimization. Extensive experiments on LINEMOD, Occlusion-LINEMOD, and YCB-Video datasets validate the effectiveness of our method and demonstrate state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2203.12870",
    "authors": [
      "Yan Xu",
      "Junyi Lin",
      "Guofeng Zhang",
      "Xiaogang Wang",
      "Hongsheng Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.12878",
    "title": "Provable GPU Data-Races in Static Race Detection",
    "abstract": "We extend the theory behind the Faial tool-chain, which can soundly prove that CUDA programs (aka, kernels) are data-race free using specialized behavioral types called memory access protocols (MAPs). In this paper we extend the theory of MAPs to characterize kernels for which alarms can be identified as true alarms. We introduce a core calculus for CUDA, which we named BabyCUDA, and a behavioral type system for it. We show that if a BabyCUDA program can be assigned a MAP, then any alarm raised by Faial for this program is a true alarm. ",
    "url": "https://arxiv.org/abs/2203.12878",
    "authors": [
      "Dennis Liew",
      "Tiago Cogumbreiro",
      "Julien Lange"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2203.12881",
    "title": "Can Unsupervised Knowledge Transfer from Social Discussions Help  Argument Mining?",
    "abstract": "Identifying argument components from unstructured texts and predicting the relationships expressed among them are two primary steps of argument mining. The intrinsic complexity of these tasks demands powerful learning models. While pretrained Transformer-based Language Models (LM) have been shown to provide state-of-the-art results over different NLP tasks, the scarcity of manually annotated data and the highly domain-dependent nature of argumentation restrict the capabilities of such models. In this work, we propose a novel transfer learning strategy to overcome these challenges. We utilize argumentation-rich social discussions from the ChangeMyView subreddit as a source of unsupervised, argumentative discourse-aware knowledge by finetuning pretrained LMs on a selectively masked language modeling task. Furthermore, we introduce a novel prompt-based strategy for inter-component relation prediction that compliments our proposed finetuning method while leveraging on the discourse context. Exhaustive experiments show the generalization capability of our method on these two tasks over within-domain as well as out-of-domain datasets, outperforming several existing and employed strong baselines. ",
    "url": "https://arxiv.org/abs/2203.12881",
    "authors": [
      "Subhabrata Dutta",
      "Jeevesh Juneja",
      "Dipankar Das",
      "Tanmoy Chakraborty"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.12894",
    "title": "A new subband non linear prediction coding algorithm for narrowband  speech signal: The nADPCMB MLT coding scheme",
    "abstract": "This paper focuses on a newly developed transparent nADPCMB MLT speech coding algorithm. Our coder first decomposes the narrowband speech signal in subbands, a non linear ADPCM scheme is then performed in each subband. The signal subband decomposition is piloted by the equivalent Modulated Lapped Transform (MLT) filter bank. The novelty of this algorithm is the non linear approach, based on neural networks, to subband prediction coding. We have evaluated the performance of the nADPCMB MLT coding algorithm with a session of formal listening based on the five grade impairment scale standardized within ITU - T Recommendation P.800. ",
    "url": "https://arxiv.org/abs/2203.12894",
    "authors": [
      "Guido D'Alessandro",
      "Marcos Faundez Zanuy",
      "Francesco Piazza"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.12896",
    "title": "Wide band sub-band speech coding using nonlinear prediction",
    "abstract": "We compare a wide band sub-band speech coder using ADPCM schemes with linear prediction against the same scheme with nonlinear prediction based on multi-layer perceptrons. Exhaustive results are presented in each band, and the full signal. Our proposed scheme with non-linear neural net prediction outperforms the linear scheme up to 2 dB in SEGSNR. In addition, we propose a simple method based on a non-linearity in order to obtain a synthetic wide band signal from a narrow band signal. ",
    "url": "https://arxiv.org/abs/2203.12896",
    "authors": [
      "Marcos Faundez-Zanuy"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.12899",
    "title": "Expression Classification using Concatenation of Deep Neural Network for  the 3rd ABAW3 Competition",
    "abstract": "For computers to recognize human emotions, expression classification is an equally important problem in the human-computer interaction area. In the 3rd Affective Behavior Analysis In-The-Wild competition, the task of expression classification includes 8 classes including 6 basic expressions of human faces from videos. In this paper, we perform combination representation from RegNet, Attention module, and Transformer Encoder for the expression classification task. We achieve 35.87 \\% for F1-score on the validation set of Aff-Wild2 dataset. This result shows the effectiveness of the proposed architecture. ",
    "url": "https://arxiv.org/abs/2203.12899",
    "authors": [
      "Kim Ngan Phan",
      "Hong-Hai Nguyen",
      "Van-Thong Huynh",
      "Soo-Hyung Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2203.12905",
    "title": "Privileged Attribution Constrained Deep Networks for Facial Expression  Recognition",
    "abstract": "Facial Expression Recognition (FER) is crucial in many research domains because it enables machines to better understand human behaviours. FER methods face the problems of relatively small datasets and noisy data that don't allow classical networks to generalize well. To alleviate these issues, we guide the model to concentrate on specific facial areas like the eyes, the mouth or the eyebrows, which we argue are decisive to recognise facial expressions. We propose the Privileged Attribution Loss (PAL), a method that directs the attention of the model towards the most salient facial regions by encouraging its attribution maps to correspond to a heatmap formed by facial landmarks. Furthermore, we introduce several channel strategies that allow the model to have more degrees of freedom. The proposed method is independent of the backbone architecture and doesn't need additional semantic information at test time. Finally, experimental results show that the proposed PAL method outperforms current state-of-the-art methods on both RAF-DB and AffectNet. ",
    "url": "https://arxiv.org/abs/2203.12905",
    "authors": [
      "Jules Bonnard",
      "Arnaud Dapogny",
      "Ferdinand Dhombres",
      "Kévin Bailly"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.12909",
    "title": "Neural Reflectance for Shape Recovery with Shadow Handling",
    "abstract": "This paper aims at recovering the shape of a scene with unknown, non-Lambertian, and possibly spatially-varying surface materials. When the shape of the object is highly complex and that shadows cast on the surface, the task becomes very challenging. To overcome these challenges, we propose a coordinate-based deep MLP (multilayer perceptron) to parameterize both the unknown 3D shape and the unknown reflectance at every surface point. This network is able to leverage the observed photometric variance and shadows on the surface, and recover both surface shape and general non-Lambertian reflectance. We explicitly predict cast shadows, mitigating possible artifacts on these shadowing regions, leading to higher estimation accuracy. Our framework is entirely self-supervised, in the sense that it requires neither ground truth shape nor BRDF. Tests on real-world images demonstrate that our method outperform existing methods by a significant margin. Thanks to the small size of the MLP-net, our method is an order of magnitude faster than previous CNN-based methods. ",
    "url": "https://arxiv.org/abs/2203.12909",
    "authors": [
      "Junxuan Li",
      "Hongdong Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.12915",
    "title": "NPC: Neuron Path Coverage via Characterizing Decision Logic of Deep  Neural Networks",
    "abstract": "Deep learning has recently been widely applied to many applications across different domains, e.g., image classification and audio recognition. However, the quality of Deep Neural Networks (DNNs) still raises concerns in the practical operational environment, which calls for systematic testing, especially in safety-critical scenarios. Inspired by software testing, a number of structural coverage criteria are designed and proposed to measure the test adequacy of DNNs. However, due to the blackbox nature of DNN, the existing structural coverage criteria are difficult to interpret, making it hard to understand the underlying principles of these criteria. The relationship between the structural coverage and the decision logic of DNNs is unknown. Moreover, recent studies have further revealed the non-existence of correlation between the structural coverage and DNN defect detection, which further posts concerns on what a suitable DNN testing criterion should be. In this paper, we propose the interpretable coverage criteria through constructing the decision structure of a DNN. Mirroring the control flow graph of the traditional program, we first extract a decision graph from a DNN based on its interpretation, where a path of the decision graph represents a decision logic of the DNN. Based on the control flow and data flow of the decision graph, we propose two variants of path coverage to measure the adequacy of the test cases in exercising the decision logic. The higher the path coverage, the more diverse decision logic the DNN is expected to be explored. Our large-scale evaluation results demonstrate that: the path in the decision graph is effective in characterizing the decision of the DNN, and the proposed coverage criteria are also sensitive with errors including natural errors and adversarial examples, and strongly correlated with the output impartiality. ",
    "url": "https://arxiv.org/abs/2203.12915",
    "authors": [
      "Xiaofei Xie",
      "Tianlin Li",
      "Jian Wang",
      "Lei Ma",
      "Qing Guo",
      "Felix Juefei-Xu",
      "Yang Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2203.12917",
    "title": "WarpingGAN: Warping Multiple Uniform Priors for Adversarial 3D Point  Cloud Generation",
    "abstract": "We propose WarpingGAN, an effective and efficient 3D point cloud generation network. Unlike existing methods that generate point clouds by directly learning the mapping functions between latent codes and 3D shapes, Warping-GAN learns a unified local-warping function to warp multiple identical pre-defined priors (i.e., sets of points uniformly distributed on regular 3D grids) into 3D shapes driven by local structure-aware semantics. In addition, we also ingeniously utilize the principle of the discriminator and tailor a stitching loss to eliminate the gaps between different partitions of a generated shape corresponding to different priors for boosting quality. Owing to the novel generating mechanism, WarpingGAN, a single lightweight network after one-time training, is capable of efficiently generating uniformly distributed 3D point clouds with various resolutions. Extensive experimental results demonstrate the superiority of our WarpingGAN over state-of-the-art methods in terms of quantitative metrics, visual quality, and efficiency. The source code is publicly available at https://github.com/yztang4/WarpingGAN.git. ",
    "url": "https://arxiv.org/abs/2203.12917",
    "authors": [
      "Yingzhi Tang",
      "Yue Qian",
      "Qijian Zhang",
      "Yiming Zeng",
      "Junhui Hou",
      "Xuefei Zhe"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.12921",
    "title": "Rubik's Cube Operator: A Plug And Play Permutation Module for Better  Arranging High Dimensional Industrial Data in Deep Convolutional Processes",
    "abstract": "The convolutional neural network (CNN) has been widely applied to process the industrial data based tensor input, which integrates data records of distributed industrial systems from the spatial, temporal, and system dynamics aspects. However, unlike images, information in the industrial data based tensor is not necessarily spatially ordered. Thus, directly applying CNN is ineffective. To tackle such issue, we propose a plug and play module, the Rubik's Cube Operator (RCO), to adaptively permutate the data organization of the industrial data based tensor to an optimal or suboptimal order of attributes before being processed by CNNs, which can be updated with subsequent CNNs together via the gradient-based optimizer. The proposed RCO maintains K binary and right stochastic permutation matrices to permutate attributes of K axes of the input industrial data based tensor. A novel learning process is proposed to enable learning permutation matrices from data, where the Gumbel-Softmax is employed to reparameterize elements of permutation matrices, and the soft regularization loss is proposed and added to the task-specific loss to ensure the feature diversity of the permuted data. We verify the effectiveness of the proposed RCO via considering two representative learning tasks processing industrial data via CNNs, the wind power prediction (WPP) and the wind speed prediction (WSP) from the renewable energy domain. Computational experiments are conducted based on four datasets collected from different wind farms and the results demonstrate that the proposed RCO can improve the performance of CNN based networks significantly. ",
    "url": "https://arxiv.org/abs/2203.12921",
    "authors": [
      "Luoxiao Yang",
      "Zhong Zheng",
      "Zijun Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.12937",
    "title": "SelfRemaster: Self-Supervised Speech Restoration with  Analysis-by-Synthesis Approach Using Channel Modeling",
    "abstract": "We present a self-supervised speech restoration method without paired speech corpora. Because the previous general speech restoration method uses artificial paired data created by applying various distortions to high-quality speech corpora, it cannot sufficiently represent acoustic distortions of real data, limiting the applicability. Our model consists of analysis, synthesis, and channel modules that simulate the recording process of degraded speech and is trained with real degraded speech data in a self-supervised manner. The analysis module extracts distortionless speech features and distortion features from degraded speech, while the synthesis module synthesizes the restored speech waveform, and the channel module adds distortions to the speech waveform. Our model also enables audio effect transfer, in which only acoustic distortions are extracted from degraded speech and added to arbitrary high-quality audio. Experimental evaluations with both simulated and real data show that our method achieves significantly higher-quality speech restoration than the previous supervised method, suggesting its applicability to real degraded speech materials. ",
    "url": "https://arxiv.org/abs/2203.12937",
    "authors": [
      "Takaaki Saeki",
      "Shinnosuke Takamichi",
      "Tomohiko Nakamura",
      "Naoko Tanji",
      "Hiroshi Saruwatari"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.12949",
    "title": "Duality-Induced Regularizer for Semantic Matching Knowledge Graph  Embeddings",
    "abstract": "Semantic matching models -- which assume that entities with similar semantics have similar embeddings -- have shown great power in knowledge graph embeddings (KGE). Many existing semantic matching models use inner products in embedding spaces to measure the plausibility of triples and quadruples in static and temporal knowledge graphs. However, vectors that have the same inner products with another vector can still be orthogonal to each other, which implies that entities with similar semantics may have dissimilar embeddings. This property of inner products significantly limits the performance of semantic matching models. To address this challenge, we propose a novel regularizer -- namely, DUality-induced RegulArizer (DURA) -- which effectively encourages the entities with similar semantics to have similar embeddings. The major novelty of DURA is based on the observation that, for an existing semantic matching KGE model (primal), there is often another distance based KGE model (dual) closely associated with it, which can be used as effective constraints for entity embeddings. Experiments demonstrate that DURA consistently and significantly improves the performance of state-of-the-art semantic matching models on both static and temporal knowledge graph benchmarks. ",
    "url": "https://arxiv.org/abs/2203.12949",
    "authors": [
      "Jie Wang",
      "Zhanqiu Zhang",
      "Zhihao Shi",
      "Jianyu Cai",
      "Shuiwang Ji",
      "Feng Wu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.12967",
    "title": "Extended critical regimes of deep neural networks",
    "abstract": "Deep neural networks (DNNs) have been successfully applied to many real-world problems, but a complete understanding of their dynamical and computational principles is still lacking. Conventional theoretical frameworks for analysing DNNs often assume random networks with coupling weights obeying Gaussian statistics. However, non-Gaussian, heavy-tailed coupling is a ubiquitous phenomenon in DNNs. Here, by weaving together theories of heavy-tailed random matrices and non-equilibrium statistical physics, we develop a new type of mean field theory for DNNs which predicts that heavy-tailed weights enable the emergence of an extended critical regime without fine-tuning parameters. In this extended critical regime, DNNs exhibit rich and complex propagation dynamics across layers. We further elucidate that the extended criticality endows DNNs with profound computational advantages: balancing the contraction as well as expansion of internal neural representations and speeding up training processes, hence providing a theoretical guide for the design of efficient neural architectures. ",
    "url": "https://arxiv.org/abs/2203.12967",
    "authors": [
      "Cheng Kevin Qu",
      "Asem Wardak",
      "Pulin Gong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.12976",
    "title": "Focus-and-Detect: A Small Object Detection Framework for Aerial Images",
    "abstract": "Despite recent advances, object detection in aerial images is still a challenging task. Specific problems in aerial images makes the detection problem harder, such as small objects, densely packed objects, objects in different sizes and with different orientations. To address small object detection problem, we propose a two-stage object detection framework called \"Focus-and-Detect\". The first stage which consists of an object detector network supervised by a Gaussian Mixture Model, generates clusters of objects constituting the focused regions. The second stage, which is also an object detector network, predicts objects within the focal regions. Incomplete Box Suppression (IBS) method is also proposed to overcome the truncation effect of region search approach. Results indicate that the proposed two-stage framework achieves an AP score of 42.06 on VisDrone validation dataset, surpassing all other state-of-the-art small object detection methods reported in the literature, to the best of authors' knowledge. ",
    "url": "https://arxiv.org/abs/2203.12976",
    "authors": [
      "Onur Can Koyun",
      "Reyhan Kevser Keser",
      "İbrahim Batuhan Akkaya",
      "Behçet Uğur Töreyin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.12980",
    "title": "MERLIN -- Malware Evasion with Reinforcement LearnINg",
    "abstract": "In addition to signature-based and heuristics-based detection techniques, Machine learning (ML) is being widely used to generalize to new never-before-seen malicious software (malware). However, it has been demonstrated that ML models can be fooled by tricking the classifier into returning the incorrect label. These studies usually rely on a prediction score that is fragile to gradient-based attacks for instance. In the context of a more realistic situation where an attacker has very little information about the outputs of a malware detection engine, modest evasion rates are achieved. In this paper, we propose a method using Reinforcement Learning with DQN and REINFORCE algorithms to challenge two state-of-the-art Machine Learning based detection engines (MalConv \\& EMBER) and a commercial AV classified by Gartner as a leader in 2021. Our stateful method combines several actions modifying a Windows Portable Execution (PE) file without breaking its functionalities. Our method also identifies which actions perform better and compiles a detailed vulnerability report to help mitigate the evasion. We demonstrate that REINFORCE achieves very good evasion rates even on a commercial AV with low provided information. ",
    "url": "https://arxiv.org/abs/2203.12980",
    "authors": [
      "Tony Quertier",
      "Benjamin Marais",
      "Stéphane Morucci",
      "Bertrand Fournel"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.12985",
    "title": "Learning Disentangled Representation for One-shot Progressive Face  Swapping",
    "abstract": "Although face swapping has attracted much attention in recent years, it remains a challenging problem. The existing methods leverage a large number of data samples to explore the intrinsic properties of face swapping without taking into account the semantic information of face images. Moreover, the representation of the identity information tends to be fixed, leading to suboptimal face swapping. In this paper, we present a simple yet efficient method named FaceSwapper, for one-shot face swapping based on Generative Adversarial Networks. Our method consists of a disentangled representation module and a semantic-guided fusion module. The disentangled representation module is composed of an attribute encoder and an identity encoder, which aims to achieve the disentanglement of the identity and the attribute information. The identity encoder is more flexible and the attribute encoder contains more details of the attributes than its competitors. Benefiting from the disentangled representation, FaceSwapper can swap face images progressively. In addition, semantic information is introduced into the semantic-guided fusion module to control the swapped area and model the pose and expression more accurately. The experimental results show that our method achieves state-of-the-art results on benchmark datasets with fewer training samples. Our code is publicly available at https://github.com/liqi-casia/FaceSwapper. ",
    "url": "https://arxiv.org/abs/2203.12985",
    "authors": [
      "Qi Li",
      "Weining Wang",
      "Chengzhong Xu",
      "Zhenan Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.12997",
    "title": "Hierarchical Nearest Neighbor Graph Embedding for Efficient  Dimensionality Reduction",
    "abstract": "Dimensionality reduction is crucial both for visualization and preprocessing high dimensional data for machine learning. We introduce a novel method based on a hierarchy built on 1-nearest neighbor graphs in the original space which is used to preserve the grouping properties of the data distribution on multiple levels. The core of the proposal is an optimization-free projection that is competitive with the latest versions of t-SNE and UMAP in performance and visualization quality while being an order of magnitude faster in run-time. Furthermore, its interpretable mechanics, the ability to project new data, and the natural separation of data clusters in visualizations make it a general purpose unsupervised dimension reduction technique. In the paper, we argue about the soundness of the proposed method and evaluate it on a diverse collection of datasets with sizes varying from 1K to 11M samples and dimensions from 28 to 16K. We perform comparisons with other state-of-the-art methods on multiple metrics and target dimensions highlighting its efficiency and performance. Code is available at https://github.com/koulakis/h-nne ",
    "url": "https://arxiv.org/abs/2203.12997",
    "authors": [
      "M. Saquib Sarfraz",
      "Marios Koulakis",
      "Constantin Seibold",
      "Rainer Stiefelhagen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Data Structures and Algorithms (cs.DS)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2203.13005",
    "title": "GX-Plug: a Middleware for Plugging Accelerators to Distributed Graph  Processing",
    "abstract": "Recently, research communities highlight the necessity of formulating a scalability continuum for large-scale graph processing, which gains the scale-out benefits from distributed graph systems, and the scale-up benefits from high-performance accelerators. To this end, we propose a middleware, called the GX-plug, for the ease of integrating the merits of both. As a middleware, the GX-plug is versatile in supporting different runtime environments, computation models, and programming models. More, for improving the middleware performance, we study a series of techniques, including pipeline shuffle, synchronization caching and skipping, and workload balancing, for intra-, inter-, and beyond-iteration optimizations, respectively. Experiments show that our middleware efficiently plugs accelerators to representative distributed graph systems, e.g., GraphX and Powergraph, with up-to 20x acceleration ratio. ",
    "url": "https://arxiv.org/abs/2203.13005",
    "authors": [
      "Kai Zou",
      "Xike Xie",
      "Qi Li",
      "Deyu Kong"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2203.13009",
    "title": "CVF-SID: Cyclic multi-Variate Function for Self-Supervised Image  Denoising by Disentangling Noise from Image",
    "abstract": "Recently, significant progress has been made on image denoising with strong supervision from large-scale datasets. However, obtaining well-aligned noisy-clean training image pairs for each specific scenario is complicated and costly in practice. Consequently, applying a conventional supervised denoising network on in-the-wild noisy inputs is not straightforward. Although several studies have challenged this problem without strong supervision, they rely on less practical assumptions and cannot be applied to practical situations directly. To address the aforementioned challenges, we propose a novel and powerful self-supervised denoising method called CVF-SID based on a Cyclic multi-Variate Function (CVF) module and a self-supervised image disentangling (SID) framework. The CVF module can output multiple decomposed variables of the input and take a combination of the outputs back as an input in a cyclic manner. Our CVF-SID can disentangle a clean image and noise maps from the input by leveraging various self-supervised loss terms. Unlike several methods that only consider the signal-independent noise models, we also deal with signal-dependent noise components for real-world applications. Furthermore, we do not rely on any prior assumptions about the underlying noise distribution, making CVF-SID more generalizable toward realistic noise. Extensive experiments on real-world datasets show that CVF-SID achieves state-of-the-art self-supervised image denoising performance and is comparable to other existing approaches. The code is publicly available from https://github.com/Reyhanehne/CVF-SID_PyTorch . ",
    "url": "https://arxiv.org/abs/2203.13009",
    "authors": [
      "Reyhaneh Neshatavar",
      "Mohsen Yavartanoo",
      "Sanghyun Son",
      "Kyoung Mu Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.13052",
    "title": "Coarse-to-Fine Cascaded Networks with Smooth Predicting for Video Facial  Expression Recognition",
    "abstract": "Facial expression recognition plays an important role in human-computer interaction. In this paper, we propose the Coarse-to-Fine Cascaded networks with Smooth Predicting (CFC-SP) to improve the performance of facial expression recognition. CFC-SP contains two core components, namely Coarse-to-Fine Cascaded networks (CFC) and Smooth Predicting (SP). For CFC, it first groups several similar emotions to form a rough category, and then employs a network to conduct a coarse but accurate classification. Later, Then, an additional network for these grouped emotions is further used to obtain fine-grained predictions. For SP, it improves the recognition capability of the model by capturing both universal and unique effective features. To be specific, the universal features denote the general characteristic of facial emotions and the unique features denote the specific characteristic of each facial expression. Experiments on Aff-Wild2 show the effectiveness of the proposed CFSP. ",
    "url": "https://arxiv.org/abs/2203.13052",
    "authors": [
      "Fanglei Xue",
      "Zichang Tan",
      "Yu Zhu",
      "Zhongsong Ma",
      "Guodong Guo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.13056",
    "title": "Information Preferences of Individual Agents in  Linear-Quadratic-Gaussian Network Games",
    "abstract": "We consider linear-quadratic-Gaussian (LQG) network games in which agents have quadratic payoffs that depend on their individual and neighbors' actions, and an unknown payoff-relevant state. An information designer determines the fidelity of information revealed to the agents about the payoff state to maximize the social welfare. Prior results show that full information disclosure is optimal under certain assumptions on the payoffs, i.e., it is beneficial for the average individual. In this paper, we provide conditions based on the strength of the dependence of payoffs on neighbors' actions, i.e., competition, under which a rational agent is expected to benefit, i.e., receive higher payoffs, from full information disclosure. We find that all agents benefit from information disclosure for the star network structure when the game is symmetric and submodular or supermodular. We also identify that the central agent benefits more than a peripheral agent from full information disclosure unless the competition is strong and the number of peripheral agents is small enough. Despite the fact that all agents expect to benefit from information disclosure ex-ante, a central agent can be worse-off from information disclosure in many realizations of the payoff state under strong competition, indicating that a risk-averse central agent can prefer uninformative signals ex-ante. ",
    "url": "https://arxiv.org/abs/2203.13056",
    "authors": [
      "Furkan Sezer",
      "Ceyhun Eksin"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)",
      "General Economics (econ.GN)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2203.13066",
    "title": "Smoothing analysis of two robust multigrid methods for elliptic optimal  control problems",
    "abstract": "In this paper we study and compare two multigrid relaxation schemes with coarsening by two, three, and four for solving elliptic sparse optimal control problems with control constraints. First, we perform a detailed local Fourier analysis (LFA) of a well-known collective Jacobi relaxation (CJR) scheme, where the optimal smoothing factors are derived. This insightful analysis reveals that the optimal relaxation parameters depend on mesh size and regularization parameters, which was not investigated in literature. Second, we propose and analyze a new mass-based Braess-Sarazin relaxation (BSR) scheme, which is proven to provide smaller smoothing factors than the CJR scheme when $\\alpha\\ge ch^4$ for a small constant $c$. Here $\\alpha$ is the regularization parameter and $h$ is the spatial mesh step size. These schemes are successfully extended to control-constrained cases through the semi-smooth Newton method. Coarsening by three or four with BSR is competitive with coarsening by two. Numerical examples are presented to validate our theoretical outcomes. The proposed inexact BSR (IBSR) scheme, where two preconditioned conjugate gradients iterations are applied to the Schur complement system, yields better computational efficiency than the CJR scheme. ",
    "url": "https://arxiv.org/abs/2203.13066",
    "authors": [
      "Yunhui He",
      "Jun Liu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2203.13068",
    "title": "SIFT and SURF based feature extraction for the anomaly detection",
    "abstract": "In this paper, we suggest a way, how to use SIFT and SURF algorithms to extract the image features for anomaly detection. We use those feature vectors to train various classifiers on a real-world dataset in the semi -supervised (with a small number of faulty samples) manner with a large number of classifiers and in the one-class (with no faulty samples) manner using the SVDD and SVM classifier. We prove, that the SIFT and SURF algorithms could be used as feature extractors, that they could be used to train a semi-supervised and one-class classifier with an accuracy around 89\\% and that the performance of the one-class classifier could be comparable to the semi-supervised one. We also made our dataset and source code publicly available. ",
    "url": "https://arxiv.org/abs/2203.13068",
    "authors": [
      "Simon Bilik",
      "Karel Horak"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.13084",
    "title": "The Dutch Draw: Constructing a Universal Baseline for Binary Prediction  Models",
    "abstract": "Novel prediction methods should always be compared to a baseline to know how well they perform. Without this frame of reference, the performance score of a model is basically meaningless. What does it mean when a model achieves an $F_1$ of 0.8 on a test set? A proper baseline is needed to evaluate the `goodness' of a performance score. Comparing with the latest state-of-the-art model is usually insightful. However, being state-of-the-art can change rapidly when newer models are developed. Contrary to an advanced model, a simple dummy classifier could be used. However, the latter could be beaten too easily, making the comparison less valuable. This paper presents a universal baseline method for all binary classification models, named the Dutch Draw (DD). This approach weighs simple classifiers and determines the best classifier to use as a baseline. We theoretically derive the DD baseline for many commonly used evaluation measures and show that in most situations it reduces to (almost) always predicting either zero or one. Summarizing, the DD baseline is: (1) general, as it is applicable to all binary classification problems; (2) simple, as it is quickly determined without training or parameter-tuning; (3) informative, as insightful conclusions can be drawn from the results. The DD baseline serves two purposes. First, to enable comparisons across research papers by this robust and universal baseline. Secondly, to provide a sanity check during the development process of a prediction model. It is a major warning sign when a model is outperformed by the DD baseline. ",
    "url": "https://arxiv.org/abs/2203.13084",
    "authors": [
      "Etienne van de Bijl",
      "Jan Klein",
      "Joris Pries",
      "Sandjai Bhulai",
      "Mark Hoogendoorn",
      "Rob van der Mei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Performance (cs.PF)",
      "Statistics Theory (math.ST)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.13086",
    "title": "HiFi++: a Unified Framework for Neural Vocoding, Bandwidth Extension and  Speech Enhancement",
    "abstract": "Generative adversarial networks have recently demonstrated outstanding performance in neural vocoding outperforming best autoregressive and flow-based models. In this paper, we show that this success can be extended to other tasks of conditional audio generation. In particular, building upon HiFi vocoders, we propose a novel HiFi++ general framework for neural vocoding, bandwidth extension, and speech enhancement. We show that with the improved generator architecture and simplified multi-discriminator training, HiFi++ performs on par with the state-of-the-art in these tasks while spending significantly less memory and computational resources. The effectiveness of our approach is validated through a series of extensive experiments. ",
    "url": "https://arxiv.org/abs/2203.13086",
    "authors": [
      "Pavel Andreev",
      "Aibek Alanov",
      "Oleg Ivanov",
      "Dmitry Vetrov"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.13088",
    "title": "Introducing Neural Bag of Whole-Words with ColBERTer: Contextualized  Late Interactions using Enhanced Reduction",
    "abstract": "Recent progress in neural information retrieval has demonstrated large gains in effectiveness, while often sacrificing the efficiency and interpretability of the neural model compared to classical approaches. This paper proposes ColBERTer, a neural retrieval model using contextualized late interaction (ColBERT) with enhanced reduction. Along the effectiveness Pareto frontier, ColBERTer's reductions dramatically lower ColBERT's storage requirements while simultaneously improving the interpretability of its token-matching scores. To this end, ColBERTer fuses single-vector retrieval, multi-vector refinement, and optional lexical matching components into one model. For its multi-vector component, ColBERTer reduces the number of stored vectors per document by learning unique whole-word representations for the terms in each document and learning to identify and remove word representations that are not essential to effective scoring. We employ an explicit multi-task, multi-stage training to facilitate using very small vector dimensions. Results on the MS MARCO and TREC-DL collection show that ColBERTer can reduce the storage footprint by up to 2.5x, while maintaining effectiveness. With just one dimension per token in its smallest setting, ColBERTer achieves index storage parity with the plaintext size, with very strong effectiveness results. Finally, we demonstrate ColBERTer's robustness on seven high-quality out-of-domain collections, yielding statistically significant gains over traditional retrieval baselines. ",
    "url": "https://arxiv.org/abs/2203.13088",
    "authors": [
      "Sebastian Hofstätter",
      "Omar Khattab",
      "Sophia Althammer",
      "Mete Sertkan",
      "Allan Hanbury"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.13104",
    "title": "R-DFCIL: Relation-Guided Representation Learning for Data-Free Class  Incremental Learning",
    "abstract": "Class-Incremental Learning (CIL) struggles with catastrophic forgetting when learning new knowledge, and Data-Free CIL (DFCIL) is even more challenging without access to the training data of previous classes. Though recent DFCIL works introduce techniques such as model inversion to synthesize data for previous classes, they fail to overcome forgetting due to the severe domain gap between the synthetic and real data. To address this issue, this paper proposes relation-guided representation learning (RRL) for DFCIL, dubbed R-DFCIL. In RRL, we introduce relational knowledge distillation to flexibly transfer the structural relation of new data from the old model to the current model. Our RRL-boosted DFCIL can guide the current model to learn representations of new classes better compatible with representations of previous classes, which greatly reduces forgetting while improving plasticity. To avoid the mutual interference between representation and classifier learning, we employ local rather than global classification loss during RRL. After RRL, the classification head is fine-tuned with global class-balanced classification loss to address the data imbalance issue as well as learn the decision boundary between new and previous classes. Extensive experiments on CIFAR100, Tiny-ImageNet200, and ImageNet100 demonstrate that our R-DFCIL significantly surpasses previous approaches and achieves a new state-of-the-art performance for DFCIL. ",
    "url": "https://arxiv.org/abs/2203.13104",
    "authors": [
      "Qiankun Gao",
      "Chen Zhao",
      "Bernard Ghanem",
      "Jian Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.13116",
    "title": "Egocentric Prediction of Action Target in 3D",
    "abstract": "We are interested in anticipating as early as possible the target location of a person's object manipulation action in a 3D workspace from egocentric vision. It is important in fields like human-robot collaboration, but has not yet received enough attention from vision and learning communities. To stimulate more research on this challenging egocentric vision task, we propose a large multimodality dataset of more than 1 million frames of RGB-D and IMU streams, and provide evaluation metrics based on our high-quality 2D and 3D labels from semi-automatic annotation. Meanwhile, we design baseline methods using recurrent neural networks and conduct various ablation studies to validate their effectiveness. Our results demonstrate that this new task is worthy of further study by researchers in robotics, vision, and learning communities. ",
    "url": "https://arxiv.org/abs/2203.13116",
    "authors": [
      "Yiming Li",
      "Ziang Cao",
      "Andrew Liang",
      "Benjamin Liang",
      "Luoyao Chen",
      "Hang Zhao",
      "Chen Feng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.13120",
    "title": "Feature visualization for convolutional neural network models trained on  neuroimaging data",
    "abstract": "A major prerequisite for the application of machine learning models in clinical decision making is trust and interpretability. Current explainability studies in the neuroimaging community have mostly focused on explaining individual decisions of trained models, e.g. obtained by a convolutional neural network (CNN). Using attribution methods such as layer-wise relevance propagation or SHAP heatmaps can be created that highlight which regions of an input are more relevant for the decision than others. While this allows the detection of potential data set biases and can be used as a guide for a human expert, it does not allow an understanding of the underlying principles the model has learned. In this study, we instead show, to the best of our knowledge, for the first time results using feature visualization of neuroimaging CNNs. Particularly, we have trained CNNs for different tasks including sex classification and artificial lesion classification based on structural magnetic resonance imaging (MRI) data. We have then iteratively generated images that maximally activate specific neurons, in order to visualize the patterns they respond to. To improve the visualizations we compared several regularization strategies. The resulting images reveal the learned concepts of the artificial lesions, including their shapes, but remain hard to interpret for abstract features in the sex classification task. ",
    "url": "https://arxiv.org/abs/2203.13120",
    "authors": [
      "Fabian Eitel",
      "Anna Melkonyan",
      "Kerstin Ritter"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.13125",
    "title": "Intelligent Systematic Investment Agent: an ensemble of deep learning  and evolutionary strategies",
    "abstract": "Machine learning driven trading strategies have garnered a lot of interest over the past few years. There is, however, limited consensus on the ideal approach for the development of such trading strategies. Further, most literature has focused on trading strategies for short-term trading, with little or no focus on strategies that attempt to build long-term wealth. Our paper proposes a new approach for developing long-term investment strategies using an ensemble of evolutionary algorithms and a deep learning model by taking a series of short-term purchase decisions. Our methodology focuses on building long-term wealth by improving systematic investment planning (SIP) decisions on Exchange Traded Funds (ETF) over a period of time. We provide empirical evidence of superior performance (around 1% higher returns) using our ensemble approach as compared to the traditional daily systematic investment practice on a given ETF. Our results are based on live trading decisions made by our algorithm and executed on the Robinhood trading platform. ",
    "url": "https://arxiv.org/abs/2203.13125",
    "authors": [
      "Prasang Gupta",
      "Shaz Hoda",
      "Anand Rao"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2203.13147",
    "title": "Self-Triggered Coordination Control of Connected Automated Vehicles in  Traffic Networks",
    "abstract": "In this paper, a self-triggered scheme is proposed to optimally control the traffic flow of Connected and Automated Vehicles (CAVs) at conflict areas of a traffic network with the main aim of reducing the data exchange among CAVs in the control zone and at the same to minimize the travel time and energy consumption. The safety constraints and the vehicle limitations are considered using the Control Barrier Function (CBF) framework and a self-triggered scheme is proposed using the CBF constraints. Moreover, modified CBF constraints are developed to ensure a minimum inter-event interval for the proposed self-triggered schemes. Finally, it is shown through a simulation study that the number of data exchanges among CAVs is significantly reduced using the proposed self-triggered schemes in comparison with the standard time-triggered framework. ",
    "url": "https://arxiv.org/abs/2203.13147",
    "authors": [
      "Nader Meskin",
      "Ehsan Sabouni",
      "Wei Xiao",
      "Christos G. Cassandras"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.13166",
    "title": "Self-supervised Video-centralised Transformer for Video Face Clustering",
    "abstract": "This paper presents a novel method for face clustering in videos using a video-centralised transformer. Previous works often employed contrastive learning to learn frame-level representation and used average pooling to aggregate the features along the temporal dimension. This approach may not fully capture the complicated video dynamics. In addition, despite the recent progress in video-based contrastive learning, few have attempted to learn a self-supervised clustering-friendly face representation that benefits the video face clustering task. To overcome these limitations, our method employs a transformer to directly learn video-level representations that can better reflect the temporally-varying property of faces in videos, while we also propose a video-centralised self-supervised framework to train the transformer model. We also investigate face clustering in egocentric videos, a fast-emerging field that has not been studied yet in works related to face clustering. To this end, we present and release the first large-scale egocentric video face clustering dataset named EasyCom-Clustering. We evaluate our proposed method on both the widely used Big Bang Theory (BBT) dataset and the new EasyCom-Clustering dataset. Results show the performance of our video-centralised transformer has surpassed all previous state-of-the-art methods on both benchmarks, exhibiting a self-attentive understanding of face videos. ",
    "url": "https://arxiv.org/abs/2203.13166",
    "authors": [
      "Yujiang Wang",
      "Mingzhi Dong",
      "Jie Shen",
      "Yiming Luo",
      "Yiming Lin",
      "Pingchuan Ma",
      "Stavros Petridis",
      "Maja Pantic"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.13169",
    "title": "An Evolutionary Note on Smart City Development in China",
    "abstract": "In response to challenges posed by urbanization, David Bollier from the University of Southern California raised a new idea for city planning: a comprehensive network and applications of information technologies. IBM later echoed the idea and initiated its Smart Planet vision in 2008. After that, the smart city concept was quickly adopted by major cities throughout the world, and it has gradually evolved into a strategic choice by ambitious cities. This paper looks into the smart city trend by reviewing how the concept of smart city was proposed and what the essence of a smart city is. More specifically, the driving forces of the smart city development in China are investigated, and the key differences of smart cities between China and other countries are summarized. Finally, four big challenges to build future smart cities are discussed. ",
    "url": "https://arxiv.org/abs/2203.13169",
    "authors": [
      "Ruizhi Liao",
      "Liping Chen"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2203.13181",
    "title": "The Cost-Accuracy Trade-Off In Operator Learning With Neural Networks",
    "abstract": "The term `surrogate modeling' in computational science and engineering refers to the development of computationally efficient approximations for expensive simulations, such as those arising from numerical solution of partial differential equations (PDEs). Surrogate modeling is an enabling methodology for many-query computations in science and engineering, which include iterative methods in optimization and sampling methods in uncertainty quantification. Over the last few years, several approaches to surrogate modeling for PDEs using neural networks have emerged, motivated by successes in using neural networks to approximate nonlinear maps in other areas. In principle, the relative merits of these different approaches can be evaluated by understanding, for each one, the cost required to achieve a given level of accuracy. However, the absence of a complete theory of approximation error for these approaches makes it difficult to assess this cost-accuracy trade-off. The purpose of the paper is to provide a careful numerical study of this issue, comparing a variety of different neural network architectures for operator approximation across a range of problems arising from PDE models in continuum mechanics. ",
    "url": "https://arxiv.org/abs/2203.13181",
    "authors": [
      "Maarten De Hoop",
      "Daniel Zhengyu Huang",
      "Elizabeth Qian",
      "Andrew M. Stuart"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2203.13182",
    "title": "Deep Bidirectional Transformers for SoC Flow Specification Mining",
    "abstract": "High-quality system-level message flow specifications can lead to comprehensive validation of system-on-chip (SoC) designs. We propose a disruptive method that utilizes an attention mechanism to produce accurate flow specifications from SoC IP communication traces. The proposed method can overcome the inherent complexity of SoC traces induced by the concurrency and parallelism of multicore designs that existing flow specification mining tools often find extremely challenging. Experiments on highly interleaved traces show promising flow reconstruction compared to several tools dedicated to the flow specification mining problem. ",
    "url": "https://arxiv.org/abs/2203.13182",
    "authors": [
      "Md Rubel Ahmed",
      "Hao Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2203.13207",
    "title": "Supervised Training of Siamese Spiking Neural Networks with Earth's  Mover Distance",
    "abstract": "This study adapts the highly-versatile siamese neural network model to the event data domain. We introduce a supervised training framework for optimizing Earth's Mover Distance (EMD) between spike trains with spiking neural networks (SNN). We train this model on images of the MNIST dataset converted into spiking domain with novel conversion schemes. The quality of the siamese embeddings of input images was evaluated by measuring the classifier performance for different dataset coding types. The models achieved performance similar to existing SNN-based approaches (F1-score of up to 0.9386) while using only about 15% of hidden layer neurons to classify each example. Furthermore, models which did not employ a sparse neural code were about 45% slower than their sparse counterparts. These properties make the model suitable for low energy consumption and low prediction latency applications. ",
    "url": "https://arxiv.org/abs/2203.13207",
    "authors": [
      "Mateusz Pabian",
      "Dominik Rzepka",
      "Mirosław Pawlak"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.13209",
    "title": "Direct parsing to sentiment graphs",
    "abstract": "This paper demonstrates how a graph-based semantic parser can be applied to the task of structured sentiment analysis, directly predicting sentiment graphs from text. We advance the state of the art on 4 out of 5 standard benchmark sets. We release the source code, models and predictions. ",
    "url": "https://arxiv.org/abs/2203.13209",
    "authors": [
      "David Samuel",
      "Jeremy Barnes",
      "Robin Kurtz",
      "Stephan Oepen",
      "Lilja Øvrelid",
      "Erik Velldal"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.13214",
    "title": "A Perturbation Constrained Adversarial Attack for Evaluating the  Robustness of Optical Flow",
    "abstract": "Recent optical flow methods are almost exclusively judged in terms of accuracy, while analyzing their robustness is often neglected. Although adversarial attacks offer a useful tool to perform such an analysis, current attacks on optical flow methods rather focus on real-world attacking scenarios than on a worst case robustness assessment. Hence, in this work, we propose a novel adversarial attack - the Perturbation Constrained Flow Attack (PCFA) - that emphasizes destructivity over applicability as a real-world attack. More precisely, PCFA is a global attack that optimizes adversarial perturbations to shift the predicted flow towards a specified target flow, while keeping the L2 norm of the perturbation below a chosen bound. Our experiments not only demonstrate PCFA's applicability in white- and black-box settings, but also show that it finds stronger adversarial samples for optical flow than previous attacking frameworks. Moreover, based on these strong samples, we provide the first common ranking of optical flow methods in the literature considering both prediction quality and adversarial robustness, indicating that high quality methods are not necessarily robust. Our source code will be publicly available. ",
    "url": "https://arxiv.org/abs/2203.13214",
    "authors": [
      "Jenny Schmalfuss",
      "Philipp Scholze",
      "Andrés Bruhn"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.13215",
    "title": "Neural Neighbor Style Transfer",
    "abstract": "We propose Neural Neighbor Style Transfer (NNST), a pipeline that offers state-of-the-art quality, generalization, and competitive efficiency for artistic style transfer. Our approach is based on explicitly replacing neural features extracted from the content input (to be stylized) with those from a style exemplar, then synthesizing the final output based on these rearranged features. While the spirit of our approach is similar to prior work, we show that our design decisions dramatically improve the final visual quality. ",
    "url": "https://arxiv.org/abs/2203.13215",
    "authors": [
      "Nicholas Kolkin",
      "Michal Kucera",
      "Sylvain Paris",
      "Daniel Sykora",
      "Eli Shechtman",
      "Greg Shakhnarovich"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2203.13216",
    "title": "Complex Frequency Domain Linear Prediction: A Tool to Compute Modulation  Spectrum of Speech",
    "abstract": "Conventional Frequency Domain Linear Prediction (FDLP) technique models the squared Hilbert envelope of speech with varied degrees of approximation which can be sampled at the required frame rate and used as features for automatic speech recognition (ASR). Although previously the complex cepstrum of the conventional FDLP model has been used as compact frame-wise speech features, it has lacked interpretability in the context of the Hilbert envelope. In this paper, we propose a modification of the conventional FDLP model that allows easy interpretability of the complex cepstrum as temporal modulations in an all-pole model approximation to the power of the speech signal. Additionally, our \"complex\" FDLP yields significant speed-ups in comparison to conventional FDLP for the same degree of approximation. ",
    "url": "https://arxiv.org/abs/2203.13216",
    "authors": [
      "Samik Sadhu",
      "Hynek Hermansky"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.13226",
    "title": "SMARAGD: Synthesized sMatch for Accurate and Rapid AMR Graph Distance",
    "abstract": "The semantic similarity of graph-based meaning representations, such as Abstract Meaning Representation (AMR), is typically assessed using graph matching algorithms, such as SMATCH (Cai and Knight, 2013). However, SMATCH suffers from NP-completeness, making its large-scale application, e.g., for AMR clustering or semantic search, infeasible. To mitigate this issue, we propose SMARAGD (Synthesized sMatch for accurate and rapid AMR graph distance). We show the potential of neural networks to approximate the SMATCH scores and graph alignments, i) in linear time using a machine translation framework to predict the alignments, or ii) in constant time using a Siamese CNN to directly predict SMATCH scores. We show that the approximation error can be substantially reduced by applying data augmentation and AMR graph anonymization. ",
    "url": "https://arxiv.org/abs/2203.13226",
    "authors": [
      "Juri Opitz",
      "Philipp Meier",
      "Anette Frank"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.13235",
    "title": "Facial Expression Recognition based on Multi-head Cross Attention  Network",
    "abstract": "Facial expression in-the-wild is essential for various interactive computing domains. In this paper, we proposed an extended version of DAN model to address the VA estimation and facial expression challenges introduced in ABAW 2022. Our method produced preliminary results of 0.44 of mean CCC value for the VA estimation task, and 0.33 of the average F1 score for the expression classification task. ",
    "url": "https://arxiv.org/abs/2203.13235",
    "authors": [
      "Jae-Yeop Jeong",
      "Yeong-Gi Hong",
      "Daun Kim",
      "Yuchul Jung",
      "Jin-Woo Jeong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.13239",
    "title": "A Representation Separation Perspective to Correspondences-free  Unsupervised 3D Point Cloud Registration",
    "abstract": "3D point cloud registration in remote sensing field has been greatly advanced by deep learning based methods, where the rigid transformation is either directly regressed from the two point clouds (correspondences-free approaches) or computed from the learned correspondences (correspondences-based approaches). Existing correspondences-free methods generally learn the holistic representation of the entire point cloud, which is fragile for partial and noisy point clouds. In this paper, we propose a correspondences-free unsupervised point cloud registration (UPCR) method from the representation separation perspective. First, we model the input point cloud as a combination of pose-invariant representation and pose-related representation. Second, the pose-related representation is used to learn the relative pose wrt a \"latent canonical shape\" for the source and target point clouds respectively. Third, the rigid transformation is obtained from the above two learned relative poses. Our method not only filters out the disturbance in pose-invariant representation but also is robust to partial-to-partial point clouds or noise. Experiments on benchmark datasets demonstrate that our unsupervised method achieves comparable if not better performance than state-of-the-art supervised registration methods. ",
    "url": "https://arxiv.org/abs/2203.13239",
    "authors": [
      "Zhiyuan Zhang",
      "Jiadai Sun",
      "Yuchao Dai",
      "Dingfu Zhou",
      "Xibin Song",
      "Mingyi He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.12620",
    "title": "Evaluation of Non-Invasive Thermal Imaging for detection of Viability of  Onchocerciasis worms",
    "abstract": "Onchocerciasis is causing blindness in over half a million people in the world today. Drug development for the disease is crippled as there is no way of measuring effectiveness of the drug without an invasive procedure. Drug efficacy measurement through assessment of viability of onchocerca worms requires the patients to undergo nodulectomy which is invasive, expensive, time-consuming, skill-dependent, infrastructure dependent and lengthy process. In this paper, we discuss the first-ever study that proposes use of machine learning over thermal imaging to non-invasively and accurately predict the viability of worms. The key contributions of the paper are (i) a unique thermal imaging protocol along with pre-processing steps such as alignment, registration and segmentation to extract interpretable features (ii) extraction of relevant semantic features (iii) development of accurate classifiers for detecting the existence of viable worms in a nodule. When tested on a prospective test data of 30 participants with 48 palpable nodules, we achieved an Area Under the Curve (AUC) of 0.85. ",
    "url": "https://arxiv.org/abs/2203.12620",
    "authors": [
      "Ronak Dedhiya",
      "Siva Teja Kakileti",
      "Goutham Deepu",
      "Kanchana Gopinath",
      "Nicholas Opoku",
      "Christopher King",
      "Geetha Manjunath"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.12634",
    "title": "Applications of physics informed neural operators",
    "abstract": "We present an end-to-end framework to learn partial differential equations that brings together initial data production, selection of boundary conditions, and the use of physics-informed neural operators to solve partial differential equations that are ubiquitous in the study and modeling of physics phenomena. We first demonstrate that our methods reproduce the accuracy and performance of other neural operators published elsewhere in the literature to learn the 1D wave equation and the 1D Burgers equation. Thereafter, we apply our physics-informed neural operators to learn new types of equations, including the 2D Burgers equation in the scalar, inviscid and vector types. Finally, we show that our approach is also applicable to learn the physics of the 2D linear and nonlinear shallow water equations, which involve three coupled partial differential equations. We release our artificial intelligence surrogates and scientific software to produce initial data and boundary conditions to study a broad range of physically motivated scenarios. We provide the source code, an interactive website to visualize the predictions of our physics informed neural operators, and a tutorial for their use at the Data and Learning Hub for Science. ",
    "url": "https://arxiv.org/abs/2203.12634",
    "authors": [
      "Shawn G. Rosofsky",
      "E. A. Huerta"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "General Relativity and Quantum Cosmology (gr-qc)"
    ]
  },
  {
    "id": "arXiv:2203.12680",
    "title": "The $k$-Cap Process on Geometric Random Graphs",
    "abstract": "The $k$-cap (or $k$-winners-take-all) process on a graph works as follows: in each iteration, exactly $k$ vertices of the graph are in the cap (i.e., winners); the next round winners are the vertices that have the highest total degree to the current winners, with ties broken randomly. This natural process is a simple model of firing activity in the brain. We study its convergence on geometric random graphs, revealing rather surprising behavior. ",
    "url": "https://arxiv.org/abs/2203.12680",
    "authors": [
      "Mirabel Reid",
      "Santosh S. Vempala"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2203.12852",
    "title": "Graph Neural Networks in Particle Physics: Implementations, Innovations,  and Challenges",
    "abstract": "Many physical systems can be best understood as sets of discrete data with associated relationships. Where previously these sets of data have been formulated as series or image data to match the available machine learning architectures, with the advent of graph neural networks (GNNs), these systems can be learned natively as graphs. This allows a wide variety of high- and low-level physical features to be attached to measurements and, by the same token, a wide variety of HEP tasks to be accomplished by the same GNN architectures. GNNs have found powerful use-cases in reconstruction, tagging, generation and end-to-end analysis. With the wide-spread adoption of GNNs in industry, the HEP community is well-placed to benefit from rapid improvements in GNN latency and memory usage. However, industry use-cases are not perfectly aligned with HEP and much work needs to be done to best match unique GNN capabilities to unique HEP obstacles. We present here a range of these capabilities, predictions of which are currently being well-adopted in HEP communities, and which are still immature. We hope to capture the landscape of graph techniques in machine learning as well as point out the most significant gaps that are inhibiting potentially large leaps in research. ",
    "url": "https://arxiv.org/abs/2203.12852",
    "authors": [
      "Savannah Thais",
      "Paolo Calafiura",
      "Grigorios Chachamis",
      "Gage DeZoort",
      "Javier Duarte",
      "Sanmay Ganguly",
      "Michael Kagan",
      "Daniel Murnane",
      "Mark S. Neubauer",
      "Kazuhiro Terao"
    ],
    "subjectives": [
      "High Energy Physics - Experiment (hep-ex)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)"
    ]
  },
  {
    "id": "arXiv:2203.12900",
    "title": "Two-timescale Resource Allocation for Automated Networks in IIoT",
    "abstract": "The rapid technological advances of cellular technologies will revolutionize network automation in industrial internet of things (IIoT). In this paper, we investigate the two-timescale resource allocation problem in IIoT networks with hybrid energy supply, where temporal variations of energy harvesting (EH), electricity price, channel state, and data arrival exhibit different granularity. The formulated problem consists of energy management at a large timescale, as well as rate control, channel selection, and power allocation at a small timescale. To address this challenge, we develop an online solution to guarantee bounded performance deviation with only causal information. Specifically, Lyapunov optimization is leveraged to transform the long-term stochastic optimization problem into a series of short-term deterministic optimization problems. Then, a low-complexity rate control algorithm is developed based on alternating direction method of multipliers (ADMM), which accelerates the convergence speed via the decomposition-coordination approach. Next, the joint channel selection and power allocation problem is transformed into a one-to-many matching problem, and solved by the proposed price-based matching with quota restriction. Finally, the proposed algorithm is verified through simulations under various system configurations. ",
    "url": "https://arxiv.org/abs/2203.12900",
    "authors": [
      "Yanhua He",
      "Yun Ren",
      "Zhenyu Zhou",
      "Shahid Mumtaz",
      "Saba Al-Rubaye",
      "Antonios Tsourdos",
      "Octavia A. Dobre"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2203.12916",
    "title": "A novel view: edge isoperimetric methods and reliability evaluation of  several kinds of conditional edge-connectivity of interconnection networks",
    "abstract": "Reliability evaluation and fault tolerance of an interconnection network of some parallel and distributed systems are discussed separately under various link-faulty hypotheses in terms of different $\\mathcal{P}$-conditional edge-connectivity. With the help of edge isoperimetric problem's method in combinatorics, this paper mainly offers a novel and unified view to investigate the $\\mathcal{P}$-conditional edge-connectivities of hamming graph $K_{L}^{n}$ with satisfying the property that each minimum $\\mathcal{P}$-conditional edge-cut separates the $K_{L}^{n}$ just into two components, such as $L^{t}$-extra edge-connectivity, $t$-embedded edge-connectivity, cyclic edge-connectivity, $(L-1)t$-super edge-connectivity, $(L-1)t$-average edge-connectivity and $L^{t}$-th isoperimetric edge-connectivity. They share the same values in form of $(L-1)(n-t)L^{t}$ (except for cyclic edge-connectivity), which equals to the minimum number of links-faulty resulting in an $L$-ary-$n$-dimensional sub-layer from $K_{L}^{n}$. Besides, we also obtain the exact values of $h$-extra edge-connectivity and $h$-th isoperimetric edge-connectivity of hamming graph $K_{L}^{n}$ for each $h\\leq L^{\\lfloor {\\frac{n}{2}} \\rfloor}$. For the case $L=2$, $K_2^n=Q_n$ is $n$-dimensional hypercube. Our results can be applied to more generalized class of networks, called $n$-dim-ensional bijective connection networks, which contains hypercubes, twisted cubes, crossed cubes, M\\\"obius cubes, locally twisted cubes and so on. Our results improve several previous results on this topic. ",
    "url": "https://arxiv.org/abs/2203.12916",
    "authors": [
      "Mingzu Zhang",
      "Zhaoxia Tian",
      "Lianzhu Zhang"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2203.12932",
    "title": "Bioformers: Embedding Transformers for Ultra-Low Power sEMG-based  Gesture Recognition",
    "abstract": "Human-machine interaction is gaining traction in rehabilitation tasks, such as controlling prosthetic hands or robotic arms. Gesture recognition exploiting surface electromyographic (sEMG) signals is one of the most promising approaches, given that sEMG signal acquisition is non-invasive and is directly related to muscle contraction. However, the analysis of these signals still presents many challenges since similar gestures result in similar muscle contractions. Thus the resulting signal shapes are almost identical, leading to low classification accuracy. To tackle this challenge, complex neural networks are employed, which require large memory footprints, consume relatively high energy and limit the maximum battery life of devices used for classification. This work addresses this problem with the introduction of the Bioformers. This new family of ultra-small attention-based architectures approaches state-of-the-art performance while reducing the number of parameters and operations of 4.9X. Additionally, by introducing a new inter-subjects pre-training, we improve the accuracy of our best Bioformer by 3.39%, matching state-of-the-art accuracy without any additional inference cost. Deploying our best performing Bioformer on a Parallel, Ultra-Low Power (PULP) microcontroller unit (MCU), the GreenWaves GAP8, we achieve an inference latency and energy of 2.72 ms and 0.14 mJ, respectively, 8.0X lower than the previous state-of-the-art neural network, while occupying just 94.2 kB of memory. ",
    "url": "https://arxiv.org/abs/2203.12932",
    "authors": [
      "Alessio Burrello",
      "Francesco Bianco Morghet",
      "Moritz Scherer",
      "Simone Benatti",
      "Luca Benini",
      "Enrico Macii",
      "Massimo Poncino",
      "Daniele Jahier Pagliari"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.12961",
    "title": "Multilevel Bayesin Deep Neural Networks",
    "abstract": "In this article we consider Bayesian inference associated to deep neural networks (DNNs) and in particular, trace-class neural network (TNN) priors which were proposed by Sell et al. [39]. Such priors were developed as more robust alternatives to classical architectures in the context of inference problems. For this work we develop multilevel Monte Carlo (MLMC) methods for such models. MLMC is a popular variance reduction technique, with particular applications in Bayesian statistics and uncertainty quantification. We show how a particular advanced MLMC method that was introduced in [4] can be applied to Bayesian inference from DNNs and establish mathematically, that the computational cost to achieve a particular mean square error, associated to posterior expectation computation, can be reduced by several orders, versus more conventional techniques. To verify such results we provide numerous numerical experiments on model problems arising in machine learning. These include Bayesian regression, as well as Bayesian classification and reinforcement learning. ",
    "url": "https://arxiv.org/abs/2203.12961",
    "authors": [
      "Neil K. Chada",
      "Ajay Jasra",
      "Kody J. H. Law",
      "Sumeetpal S. Singh"
    ],
    "subjectives": [
      "Computation (stat.CO)",
      "Numerical Analysis (math.NA)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.13038",
    "title": "Interpretable Prediction of Pulmonary Hypertension in Newborns using  Echocardiograms",
    "abstract": "Pulmonary hypertension (PH) in newborns and infants is a complex condition associated with several pulmonary, cardiac, and systemic diseases contributing to morbidity and mortality. Therefore, accurate and early detection of PH is crucial for successful management. Using echocardiography, the primary diagnostic tool in pediatrics, human assessment is both time-consuming and expertise-demanding, raising the need for an automated approach. In this work, we present an interpretable multi-view video-based deep learning approach to predict PH for a cohort of 194 newborns using echocardiograms. We use spatio-temporal convolutional architectures for the prediction of PH from each view, and aggregate the predictions of the different views using majority voting. To the best of our knowledge, this is the first work for an automated assessment of PH in newborns using echocardiograms. Our results show a mean F1-score of 0.84 for severity prediction and 0.92 for binary detection using 10-fold cross-validation. We complement our predictions with saliency maps and show that the learned model focuses on clinically relevant cardiac structures, motivating its usage in clinical practice. ",
    "url": "https://arxiv.org/abs/2203.13038",
    "authors": [
      "Hanna Ragnarsdottir",
      "Laura Manduchi",
      "Holger Michel",
      "Fabian Laumer",
      "Sven Wellmann",
      "Ece Ozkan",
      "Julia Vogt"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.13118",
    "title": "X-ray Dissectography Improves Lung Nodule Detection",
    "abstract": "Although radiographs are the most frequently used worldwide due to their cost-effectiveness and widespread accessibility, the structural superposition along the x-ray paths often renders suspicious or concerning lung nodules difficult to detect. In this study, we apply \"X-ray dissectography\" to dissect lungs digitally from a few radiographic projections, suppress the interference of irrelevant structures, and improve lung nodule detectability. For this purpose, a collaborative detection network is designed to localize lung nodules in 2D dissected projections and 3D physical space. Our experimental results show that our approach can significantly improve the average precision by 20+% in comparison with the common baseline that detects lung nodules from original projections using a popular detection network. Potentially, this approach could help re-design the current X-ray imaging protocols and workflows and improve the diagnostic performance of chest radiographs in lung diseases. ",
    "url": "https://arxiv.org/abs/2203.13118",
    "authors": [
      "Chuang Niu",
      "Giridhar Dasegowda",
      "Pingkun Yan",
      "Mannudeep K. Kalra",
      "Ge Wang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.13154",
    "title": "Addressing Missing Sources with Adversarial Support-Matching",
    "abstract": "When trained on diverse labeled data, machine learning models have proven themselves to be a powerful tool in all facets of society. However, due to budget limitations, deliberate or non-deliberate censorship, and other problems during data collection and curation, the labeled training set might exhibit a systematic shortage of data for certain groups. We investigate a scenario in which the absence of certain data is linked to the second level of a two-level hierarchy in the data. Inspired by the idea of protected groups from algorithmic fairness, we refer to the partitions carved by this second level as \"subgroups\"; we refer to combinations of subgroups and classes, or leaves of the hierarchy, as \"sources\". To characterize the problem, we introduce the concept of classes with incomplete subgroup support. The representational bias in the training set can give rise to spurious correlations between the classes and the subgroups which render standard classification models ungeneralizable to unseen sources. To overcome this bias, we make use of an additional, diverse but unlabeled dataset, called the \"deployment set\", to learn a representation that is invariant to subgroup. This is done by adversarially matching the support of the training and deployment sets in representation space. In order to learn the desired invariance, it is paramount that the sets of samples observed by the discriminator are balanced by class; this is easily achieved for the training set, but requires using semi-supervised clustering for the deployment set. We demonstrate the effectiveness of our method with experiments on several datasets and variants of the problem. ",
    "url": "https://arxiv.org/abs/2203.13154",
    "authors": [
      "Thomas Kehrenberg",
      "Myles Bartlett",
      "Viktoriia Sharmanska",
      "Novi Quadrianto"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.13225",
    "title": "Distributionally Robust Optimization via Ball Oracle Acceleration",
    "abstract": "We develop and analyze algorithms for distributionally robust optimization (DRO) of convex losses. In particular, we consider group-structured and bounded $f$-divergence uncertainty sets. Our approach relies on an accelerated method that queries a ball optimization oracle, i.e., a subroutine that minimizes the objective within a small ball around the query point. Our main contribution is efficient implementations of this oracle for DRO objectives. For DRO with $N$ non-smooth loss functions, the resulting algorithms find an $\\epsilon$-accurate solution with $\\widetilde{O}\\left(N\\epsilon^{-2/3} + \\epsilon^{-2}\\right)$ first-order oracle queries to individual loss functions. Compared to existing algorithms for this problem, we improve complexity by a factor of up to $\\epsilon^{-4/3}$. ",
    "url": "https://arxiv.org/abs/2203.13225",
    "authors": [
      "Yair Carmon",
      "Danielle Hausler"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.13233",
    "title": "Grid Induced Minor Theorem for Graphs of Small Degree",
    "abstract": "A graph $H$ is an induced minor of a graph $G$ if $H$ can be obtained from $G$ by vertex deletions and edge contractions. We show that there is a function $f(k, d) = O(k^{10} + 2^{d^5})$ so that if a graph has treewidth at least $f(k, d)$ and maximum degree at most $d$, then it contains a $k \\times k$-grid as an induced minor. This proves the conjecture of Aboulker, Adler, Kim, Sintiari, and Trotignon [Eur. J. Comb., 98, 2021] that any graph with large treewidth and bounded maximum degree contains a large wall or the line graph of a large wall as an induced subgraph. It also implies that for any fixed planar graph $H$, there is a subexponential time algorithm for maximum weight independent set on $H$-induced-minor-free graphs. ",
    "url": "https://arxiv.org/abs/2203.13233",
    "authors": [
      "Tuukka Korhonen"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:1704.03065",
    "title": "Mo3: a Modular Mobility Model for future generation mobile wireless  networks",
    "abstract": " Comments: 33 pages, 32 figures. Accepted for publication on IEEE Access ",
    "url": "https://arxiv.org/abs/1704.03065",
    "authors": [
      "Luca De Nardis",
      "Maria-Gabriella Di Benedetto"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:1709.00944",
    "title": "Audio-Visual Speech Enhancement using Multimodal Deep Convolutional  Neural Network",
    "abstract": " Comments: This paper is the same as arXiv:1703.10893v2. Apologies for the inconvenience ",
    "url": "https://arxiv.org/abs/1709.00944",
    "authors": [
      "Jen-Cheng Hou",
      "Syu-Siang Wang",
      "Ying-Hui Lai",
      "Yu Tsao",
      "Hsiu-Wen Chang",
      "Hsin-Min Wang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2005.04291",
    "title": "Learning Stable Models for Prediction and Control",
    "abstract": " Title: Learning Stable Models for Prediction and Control ",
    "url": "https://arxiv.org/abs/2005.04291",
    "authors": [
      "Giorgos Mamakoukas",
      "Ian Abraham",
      "Todd D. Murphey"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2009.11216",
    "title": "On port-Hamiltonian approximation of a nonlinear flow problem on  networks",
    "abstract": " Title: On port-Hamiltonian approximation of a nonlinear flow problem on  networks ",
    "url": "https://arxiv.org/abs/2009.11216",
    "authors": [
      "Björn Liljegren-Sailer",
      "Nicole Marheineke"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2011.10450",
    "title": "Graph Tikhonov Regularization and Interpolation via Random Spanning  Forests",
    "abstract": " Title: Graph Tikhonov Regularization and Interpolation via Random Spanning  Forests ",
    "url": "https://arxiv.org/abs/2011.10450",
    "authors": [
      "Yusuf Pilavci",
      "Pierre-Olivier Amblard",
      "Simon Barthelme",
      "Nicolas Tremblay"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2101.11906",
    "title": "Development of a Vertex Finding Algorithm using Recurrent Neural Network",
    "abstract": " Comments: 8 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2101.11906",
    "authors": [
      "Kiichi Goto",
      "Taikan Suehara",
      "Tamaki Yoshioka",
      "Masakazu Kurata",
      "Hajime Nagahara",
      "Yuta Nakashima",
      "Noriko Takemura",
      "Masako Iwasaki"
    ],
    "subjectives": [
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Experiment (hep-ex)",
      "Instrumentation and Detectors (physics.ins-det)"
    ]
  },
  {
    "id": "arXiv:2103.09136",
    "title": "QueryDet: Cascaded Sparse Query for Accelerating High-Resolution Small  Object Detection",
    "abstract": " Comments: CVPR 2022 ",
    "url": "https://arxiv.org/abs/2103.09136",
    "authors": [
      "Chenhongyi Yang",
      "Zehao Huang",
      "Naiyan Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2103.13822",
    "title": "FedCor: Correlation-Based Active Client Selection Strategy for  Heterogeneous Federated Learning",
    "abstract": " Comments: Accepted by CVPR 2022 ",
    "url": "https://arxiv.org/abs/2103.13822",
    "authors": [
      "Minxue Tang",
      "Xuefei Ning",
      "Yitu Wang",
      "Jingwei Sun",
      "Yu Wang",
      "Hai Li",
      "Yiran Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2105.11111",
    "title": "Oriented RepPoints for Aerial Object Detection",
    "abstract": " Comments: 10 pages, 4 figures, Accepted by CVPR2022 ",
    "url": "https://arxiv.org/abs/2105.11111",
    "authors": [
      "Wentong Li",
      "Yijie Chen",
      "Kaixuan Hu",
      "Jianke Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.07545",
    "title": "PolarStream: Streaming Lidar Object Detection and Segmentation with  Polar Pillars",
    "abstract": " Comments: NeurIPS 2021; code and pretrained models available at this https URL ",
    "url": "https://arxiv.org/abs/2106.07545",
    "authors": [
      "Qi Chen",
      "Sourabh Vora",
      "Oscar Beijbom"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2108.00358",
    "title": "Applications of Artificial Neural Networks in Microorganism Image  Analysis: A Comprehensive Review from Conventional Multilayer Perceptron to  Popular Convolutional Neural Network and Potential Visual Transformer",
    "abstract": " Title: Applications of Artificial Neural Networks in Microorganism Image  Analysis: A Comprehensive Review from Conventional Multilayer Perceptron to  Popular Convolutional Neural Network and Potential Visual Transformer ",
    "url": "https://arxiv.org/abs/2108.00358",
    "authors": [
      "Jinghua Zhang",
      "Chen Li",
      "Yimin Yin",
      "Jiawei Zhang",
      "Marcin Grzegorzek"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2108.13207",
    "title": "Representation of binary classification trees with binary features by  quantum circuits",
    "abstract": " Comments: 43 pages, 20 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2108.13207",
    "authors": [
      "Raoul Heese",
      "Patricia Bickert",
      "Astrid Elisa Niederle"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2109.02184",
    "title": "Dimensionality, Coordination, and Robustness in Voting",
    "abstract": " Title: Dimensionality, Coordination, and Robustness in Voting ",
    "url": "https://arxiv.org/abs/2109.02184",
    "authors": [
      "Ioannis Anagnostides",
      "Dimitris Fotakis",
      "Panagiotis Patsilinakos"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2109.10135",
    "title": "Self-supervised Representation Learning for Reliable Robotic Monitoring  of Fruit Anomalies",
    "abstract": " Comments: Accepted to ICRA2022; Codes and data are all available online ",
    "url": "https://arxiv.org/abs/2109.10135",
    "authors": [
      "Taeyeong Choi",
      "Owen Would",
      "Adrian Salazar-Gomez",
      "Grzegorz Cielniak"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.08298",
    "title": "Non-Euclidean Contractivity of Recurrent Neural Networks",
    "abstract": " Title: Non-Euclidean Contractivity of Recurrent Neural Networks ",
    "url": "https://arxiv.org/abs/2110.08298",
    "authors": [
      "Alexander Davydov",
      "Anton V. Proskurnikov",
      "Francesco Bullo"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2111.10990",
    "title": "Imperceptible Transfer Attack and Defense on 3D Point Cloud  Classification",
    "abstract": " Title: Imperceptible Transfer Attack and Defense on 3D Point Cloud  Classification ",
    "url": "https://arxiv.org/abs/2111.10990",
    "authors": [
      "Daizong Liu",
      "Wei Hu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2111.12264",
    "title": "Pixel-wise Energy-biased Abstention Learning for Anomaly Segmentation on  Complex Urban Driving Scenes",
    "abstract": " Title: Pixel-wise Energy-biased Abstention Learning for Anomaly Segmentation on  Complex Urban Driving Scenes ",
    "url": "https://arxiv.org/abs/2111.12264",
    "authors": [
      "Yu Tian",
      "Yuyuan Liu",
      "Guansong Pang",
      "Fengbei Liu",
      "Yuanhong Chen",
      "Gustavo Carneiro"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.00322",
    "title": "FCAF3D: Fully Convolutional Anchor-Free 3D Object Detection",
    "abstract": " Title: FCAF3D: Fully Convolutional Anchor-Free 3D Object Detection ",
    "url": "https://arxiv.org/abs/2112.00322",
    "authors": [
      "Danila Rukhovich",
      "Anna Vorontsova",
      "Anton Konushin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.03163",
    "title": "Encouraging Disentangled and Convex Representation with Controllable  Interpolation Regularization",
    "abstract": " Comments: 17 pages, 19 figure (including appendix) ",
    "url": "https://arxiv.org/abs/2112.03163",
    "authors": [
      "Yunhao Ge",
      "Zhi Xu",
      "Yao Xiao",
      "Gan Xin",
      "Yunkui Pang",
      "Laurent Itti"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.03916",
    "title": "BT-Unet: A self-supervised learning framework for biomedical image  segmentation using Barlow Twins with U-Net models",
    "abstract": " Title: BT-Unet: A self-supervised learning framework for biomedical image  segmentation using Barlow Twins with U-Net models ",
    "url": "https://arxiv.org/abs/2112.03916",
    "authors": [
      "Narinder Singh Punn",
      "Sonali Agarwal"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.05341",
    "title": "Hyperdimensional Feature Fusion for Interpretable Out-Of-Distribution  Detection",
    "abstract": " Title: Hyperdimensional Feature Fusion for Interpretable Out-Of-Distribution  Detection ",
    "url": "https://arxiv.org/abs/2112.05341",
    "authors": [
      "Samuel Wilson",
      "Tobias Fischer",
      "Niko Sünderhauf",
      "Feras Dayoub"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.10652",
    "title": "HyperSegNAS: Bridging One-Shot Neural Architecture Search with 3D  Medical Image Segmentation using HyperNet",
    "abstract": " Title: HyperSegNAS: Bridging One-Shot Neural Architecture Search with 3D  Medical Image Segmentation using HyperNet ",
    "url": "https://arxiv.org/abs/2112.10652",
    "authors": [
      "Cheng Peng",
      "Andriy Myronenko",
      "Ali Hatamizadeh",
      "Vish Nath",
      "Md Mahfuzur Rahman Siddiquee",
      "Yufan He",
      "Daguang Xu",
      "Rama Chellappa",
      "Dong Yang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.01426",
    "title": "Interleaving Monte Carlo Tree Search and Self-Supervised Learning for  Object Retrieval in Clutter",
    "abstract": " Comments: Accepted by ICRA 2022 ",
    "url": "https://arxiv.org/abs/2202.01426",
    "authors": [
      "Baichuan Huang",
      "Teng Guo",
      "Abdeslam Boularias",
      "Jingjin Yu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2202.09028",
    "title": "On the Implicit Bias Towards Minimal Depth of Deep Neural Networks",
    "abstract": " Title: On the Implicit Bias Towards Minimal Depth of Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2202.09028",
    "authors": [
      "Tomer Galanti",
      "Liane Galanti"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.11539",
    "title": "Self-Supervised Transformers for Unsupervised Object Discovery using  Normalized Cut",
    "abstract": " Title: Self-Supervised Transformers for Unsupervised Object Discovery using  Normalized Cut ",
    "url": "https://arxiv.org/abs/2202.11539",
    "authors": [
      "Yangtao Wang",
      "Xi Shen",
      "Shell Hu",
      "Yuan Yuan",
      "James Crowley",
      "Dominique Vaufreydaz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.00628",
    "title": "A Neural Ordinary Differential Equation Model for Visualizing Deep  Neural Network Behaviors in Multi-Parametric MRI based Glioma Segmentation",
    "abstract": " Comments: 30 pages, 7 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2203.00628",
    "authors": [
      "Zhenyu Yang",
      "Zongsheng Hu",
      "Hangjie Ji",
      "Kyle Lafata",
      "Scott Floyd",
      "Fang-Fang Yin",
      "Chunhao Wang"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2203.00680",
    "title": "CrossPoint: Self-Supervised Cross-Modal Contrastive Learning for 3D  Point Cloud Understanding",
    "abstract": " Comments: CVPR 2022 ",
    "url": "https://arxiv.org/abs/2203.00680",
    "authors": [
      "Mohamed Afham",
      "Isuru Dissanayake",
      "Dinithi Dissanayake",
      "Amaya Dharmasiri",
      "Kanchana Thilakarathna",
      "Ranga Rodrigo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.05151",
    "title": "Frequency-driven Imperceptible Adversarial Attack on Semantic Similarity",
    "abstract": " Comments: CVPR 2022 conference (accepted), 18 pages, 17 figure ",
    "url": "https://arxiv.org/abs/2203.05151",
    "authors": [
      "Cheng Luo",
      "Qinliang Lin",
      "Weicheng Xie",
      "Bizhu Wu",
      "Jinheng Xie",
      "Linlin Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.07561",
    "title": "Toward the Detection of Polyglot Files",
    "abstract": " Title: Toward the Detection of Polyglot Files ",
    "url": "https://arxiv.org/abs/2203.07561",
    "authors": [
      "Luke Koch",
      "Sean Oesch",
      "Mary Adkisson",
      "Sam Erwin",
      "Brian Weber",
      "Amul Chaulagain"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.08368",
    "title": "Mixed-Precision Neural Network Quantization via Learned Layer-wise  Importance",
    "abstract": " Title: Mixed-Precision Neural Network Quantization via Learned Layer-wise  Importance ",
    "url": "https://arxiv.org/abs/2203.08368",
    "authors": [
      "Chen Tang",
      "Kai Ouyang",
      "Zhi Wang",
      "Yifei Zhu",
      "Yaowei Wang",
      "Wen Ji",
      "Wenwu Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.08935",
    "title": "Understanding Privacy Switching Behaviour on Twitter",
    "abstract": " Comments: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI'22) ",
    "url": "https://arxiv.org/abs/2203.08935",
    "authors": [
      "Dilara Keküllüoğlu",
      "Kami Vaniea",
      "Walid Magdy"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2203.10433",
    "title": "End-to-End Human-Gaze-Target Detection with Transformers",
    "abstract": " Comments: Accepted to CVPR 2022 ",
    "url": "https://arxiv.org/abs/2203.10433",
    "authors": [
      "Danyang Tu",
      "Xiongkuo Min",
      "Huiyu Duan",
      "Guodong Guo",
      "Guangtao Zhai",
      "Wei Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.11528",
    "title": "Out-of-distribution Generalization with Causal Invariant Transformations",
    "abstract": " Comments: accepted by cvpr2022 ",
    "url": "https://arxiv.org/abs/2203.11528",
    "authors": [
      "Ruoyu Wang",
      "Mingyang Yi",
      "Zhitang Chen",
      "Shengyu Zhu"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.11799",
    "title": "AP-BSN: Self-Supervised Denoising for Real-World Images via Asymmetric  PD and Blind-Spot Network",
    "abstract": " Comments: Accepted to CVPR2022 ",
    "url": "https://arxiv.org/abs/2203.11799",
    "authors": [
      "Wooseok Lee",
      "Sanghyun Son",
      "Kyoung Mu Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2203.12064",
    "title": "Effective Seed Scheduling for Fuzzing with Graph Centrality Analysis",
    "abstract": " Comments: To appear in the 43rd IEEE Symposium on Security and Privacy, May 23--26, 2022, San Francisco, CA, USA ",
    "url": "https://arxiv.org/abs/2203.12064",
    "authors": [
      "Dongdong She",
      "Abhishek Shah",
      "Suman Jana"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2203.12257",
    "title": "IAM: A Comprehensive and Large-Scale Dataset for Integrated Argument  Mining Tasks",
    "abstract": " Comments: 11 pages, 3 figures, accepted by ACL 2022 ",
    "url": "https://arxiv.org/abs/2203.12257",
    "authors": [
      "Liying Cheng",
      "Lidong Bing",
      "Ruidan He",
      "Qian Yu",
      "Yan Zhang",
      "Luo Si"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.12369",
    "title": "MetricGAN+/-: Increasing Robustness of Noise Reduction on Unseen Data",
    "abstract": " Comments: 5 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2203.12369",
    "authors": [
      "George Close",
      "Thomas Hain",
      "Stefan Goetze"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.12613",
    "title": "A Hybrid Mesh-neural Representation for 3D Transparent Object  Reconstruction",
    "abstract": " Title: A Hybrid Mesh-neural Representation for 3D Transparent Object  Reconstruction ",
    "url": "https://arxiv.org/abs/2203.12613",
    "authors": [
      "Jiamin Xu",
      "Zihan Zhu",
      "Hujun Bao",
      "Weiwei Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]