[
  {
    "id": "arXiv:2211.09155",
    "title": "Learnable Graph Convolutional Network and Feature Fusion for Multi-view  Learning",
    "abstract": "In practical applications, multi-view data depicting objectives from assorted perspectives can facilitate the accuracy increase of learning algorithms. However, given multi-view data, there is limited work for learning discriminative node relationships and graph information simultaneously via graph convolutional network that has drawn the attention from considerable researchers in recent years. Most of existing methods only consider the weighted sum of adjacency matrices, yet a joint neural network of both feature and graph fusion is still under-explored. To cope with these issues, this paper proposes a joint deep learning framework called Learnable Graph Convolutional Network and Feature Fusion (LGCN-FF), consisting of two stages: feature fusion network and learnable graph convolutional network. The former aims to learn an underlying feature representation from heterogeneous views, while the latter explores a more discriminative graph fusion via learnable weights and a parametric activation function dubbed Differentiable Shrinkage Activation (DSA) function. The proposed LGCN-FF is validated to be superior to various state-of-the-art methods in multi-view semi-supervised classification. ",
    "url": "https://arxiv.org/abs/2211.09155",
    "authors": [
      "Zhaoliang Chen",
      "Lele Fu",
      "Jie Yao",
      "Wenzhong Guo",
      "Claudia Plant",
      "Shiping Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09165",
    "title": "Improving Effectiveness of Seamless Redundancy in Real Industrial Wi-Fi  Networks",
    "abstract": "Reliability and determinism of Wi-Fi can be tangibly improved by means of seamless redundancy, to the point of making this technology suitable for industrial environments. As pointed out in recent papers, the most benefits can be achieved when no phenomena can simultaneously affect transmissions on all channels of a redundant link. In this paper, several aspects are analyzed which, if not properly counteracted, may worsen seamless redundancy effectiveness. Effects they cause on communication have been experimentally evaluated in real testbeds, which rely on commercial Wi-Fi devices. Then, practical guidelines are provided, which aim at preventing joint interference through a careful system design. Results show that measured communication quality can be made as good as expected in theory. ",
    "url": "https://arxiv.org/abs/2211.09165",
    "authors": [
      "Gianluca Cena",
      "Stefano Scanzio",
      "Adriano Valenzano"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2211.09174",
    "title": "CASPR: Customer Activity Sequence-based Prediction and Representation",
    "abstract": "Tasks critical to enterprise profitability, such as customer churn prediction, fraudulent account detection or customer lifetime value estimation, are often tackled by models trained on features engineered from customer data in tabular format. Application-specific feature engineering adds development, operationalization and maintenance costs over time. Recent advances in representation learning present an opportunity to simplify and generalize feature engineering across applications. When applying these advancements to tabular data researchers deal with data heterogeneity, variations in customer engagement history or the sheer volume of enterprise datasets. In this paper, we propose a novel approach to encode tabular data containing customer transactions, purchase history and other interactions into a generic representation of a customer's association with the business. We then evaluate these embeddings as features to train multiple models spanning a variety of applications. CASPR, Customer Activity Sequence-based Prediction and Representation, applies Transformer architecture to encode activity sequences to improve model performance and avoid bespoke feature engineering across applications. Our experiments at scale validate CASPR for both small \\& large enterprise applications. ",
    "url": "https://arxiv.org/abs/2211.09174",
    "authors": [
      "Pin-Jung Chen",
      "Sahil Bhatnagar",
      "Damian Konrad Kowalczyk",
      "Mayank Shrivastava"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.09185",
    "title": "Which tweets 'deserve' to be included in news stories? Chronemics of  tweet embedding",
    "abstract": "The use and selection of user-generated social media content, specifically tweets, as a news source has become an integral part of news production practice. Yet, the mapping and the extent of the nature of the practices in which news outlets integrate social media use are still lacking. This study focuses on the pressures of immediacy on the media ecosystems, i.e., as organizational practices of news outlets that make choices related to social media content integration. By analyzing a large corpora of news outlets that have embedded tweets, this study analyzes tweet embedding practices by specifically focusing on the concept of chronemics, conceptualized here as the time needed to embed tweets. Temporal constraints are particularly pressing for journalistic practices, given the continuous pressures of the 24/7 news cycle. We ask two main questions: which types of outlets are quicker to embed tweets, and which types of users' tweets are more likely to be embedded quickly? ",
    "url": "https://arxiv.org/abs/2211.09185",
    "authors": [
      "Munif Ishad Mujib",
      "Asta Zelenkauskaite",
      "Jake Ryland Williams"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2211.09200",
    "title": "Power-Estimation Trade-off of Vector-valued Witsenhausen Counterexample  with Causal Decoder",
    "abstract": "The vector-valued extension of the famous Witsenhausen counterexample setup is studied where the encoder, i.e. the first decision maker, non-causally knows and encodes the i.i.d. state sequence and the decoder, i.e. the second decision maker, causally estimates the interim state. The coding scheme is transferred from the finite alphabet coordination problem for which it is proved to be optimal. The extension to the Gaussian setup is based on a non-standard weak typicality approach and requires a careful average estimation error analysis since the interim state is estimated by the decoder. We provide a single-letter expression that characterizes the optimal trade-off between the Witsenhausen power cost and estimation cost. The two auxiliary random variables improve the communication with the decoder, while performing the dual role of the channel input, which also controls the state of the system. Interestingly, we show that a pair of discrete and continuous auxiliary random variables, outperforms both Witsenhausen two point strategy and the best affine policies. The optimal choice of random variables remains unknown. ",
    "url": "https://arxiv.org/abs/2211.09200",
    "authors": [
      "Maël Le Treust",
      "Tobias Oechtering"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2211.09238",
    "title": "Learning unfolded networks with a cyclic group structure",
    "abstract": "Deep neural networks lack straightforward ways to incorporate domain knowledge and are notoriously considered black boxes. Prior works attempted to inject domain knowledge into architectures implicitly through data augmentation. Building on recent advances on equivariant neural networks, we propose networks that explicitly encode domain knowledge, specifically equivariance with respect to rotations. By using unfolded architectures, a rich framework that originated from sparse coding and has theoretical guarantees, we present interpretable networks with sparse activations. The equivariant unfolded networks compete favorably with baselines, with only a fraction of their parameters, as showcased on (rotated) MNIST and CIFAR-10. ",
    "url": "https://arxiv.org/abs/2211.09238",
    "authors": [
      "Emmanouil Theodosis",
      "Demba Ba"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09273",
    "title": "Privacy against Real-Time Speech Emotion Detection via Acoustic  Adversarial Evasion of Machine Learning",
    "abstract": "Emotional Surveillance is an emerging area with wide-reaching privacy concerns. These concerns are exacerbated by ubiquitous IoT devices with multiple sensors that can support these surveillance use cases. The work presented here considers one such use case: the use of a speech emotion recognition (SER) classifier tied to a smart speaker. This work demonstrates the ability to evade black-box SER classifiers tied to a smart speaker without compromising the utility of the smart speaker. This privacy concern is considered through the lens of adversarial evasion of machine learning. Our solution, Defeating Acoustic Recognition of Emotion via Genetic Programming (DARE-GP), uses genetic programming to generate non-invasive additive audio perturbations (AAPs). By constraining the evolution of these AAPs, transcription accuracy can be protected while simultaneously degrading SER classifier performance. The additive nature of these AAPs, along with an approach that generates these AAPs for a fixed set of users in an utterance and user location-independent manner, supports real-time, real-world evasion of SER classifiers. DARE-GP's use of spectral features, which underlay the emotional content of speech, allows the transferability of AAPs to previously unseen black-box SER classifiers. Further, DARE-GP outperforms state-of-the-art SER evasion techniques and is robust against defenses employed by a knowledgeable adversary. The evaluations in this work culminate with acoustic evaluations against two off-the-shelf commercial smart speakers, where a single AAP could evade a black box classifier over 70% of the time. The final evaluation deployed AAP playback on a small-form-factor system (raspberry pi) integrated with a wake-word system to evaluate the efficacy of a real-world, real-time deployment where DARE-GP is automatically invoked with the smart speaker's wake word. ",
    "url": "https://arxiv.org/abs/2211.09273",
    "authors": [
      "Brian Testa",
      "Yi Xiao",
      "Avery Gump",
      "Asif Salekin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2211.09299",
    "title": "FedFA: Federated Learning with Feature Anchors to Align Feature and  Classifier for Heterogeneous Data",
    "abstract": "Federated learning allows multiple clients to collaboratively train a model without exchanging their data, thus preserving data privacy. Unfortunately, it suffers significant performance degradation under heterogeneous data at clients. Common solutions in local training involve designing a specific auxiliary loss to regularize weight divergence or feature inconsistency. However, we discover that these approaches fall short of the expected performance because they ignore the existence of a vicious cycle between classifier divergence and feature mapping inconsistency across clients, such that client models are updated in inconsistent feature space with diverged classifiers. We then propose a simple yet effective framework named Federated learning with Feature Anchors (FedFA) to align the feature mappings and calibrate classifier across clients during local training, which allows client models updating in a shared feature space with consistent classifiers. We demonstrate that this modification brings similar classifiers and a virtuous cycle between feature consistency and classifier similarity across clients. Extensive experiments show that FedFA significantly outperforms the state-of-the-art federated learning algorithms on various image classification datasets under label and feature distribution skews. ",
    "url": "https://arxiv.org/abs/2211.09299",
    "authors": [
      "Tailin Zhou",
      "Jun Zhang",
      "Danny Tsang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09307",
    "title": "Proactive Resilient Transmission and Scheduling Mechanisms for mmWave  Networks",
    "abstract": "This paper aims to develop resilient transmission mechanisms to suitably distribute traffic across multiple paths in an arbitrary millimeter-wave (mmWave) network. The main contributions include: (a) the development of proactive transmission mechanisms that build resilience against network disruptions in advance, while achieving a high end-to-end packet rate; (b) the design of a heuristic path selection algorithm that efficiently selects (in polynomial time in the network size) multiple proactively resilient paths with high packet rates; and (c) the development of a hybrid scheduling algorithm that combines the proposed path selection algorithm with a deep reinforcement learning (DRL) based online approach for decentralized adaptation to blocked links and failed paths. To achieve resilience to link failures, a state-of-the-art Soft Actor-Critic DRL algorithm, which adapts the information flow through the network, is investigated. The proposed scheduling algorithm robustly adapts to link failures over different topologies, channel and blockage realizations while offering a superior performance to alternative algorithms. ",
    "url": "https://arxiv.org/abs/2211.09307",
    "authors": [
      "Mine Gokce Dogan",
      "Martina Cardone",
      "Christina Fragouli"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09345",
    "title": "More Effective Centrality-Based Attacks on Weighted Networks",
    "abstract": "Only when understanding hackers' tactics, can we thwart their attacks. With this spirit, this paper studies how hackers can effectively launch the so-called 'targeted node attacks', in which iterative attacks are staged on a network, and in each iteration the most important node is removed. In the existing attacks for weighted networks, the node importance is typically measured by the centralities related to shortest-path lengths, and the attack effectiveness is also measured mostly by length-related metrics. However, this paper argues that flows can better reflect network functioning than shortest-path lengths for those networks with carrying traffic as the main functionality. Thus, this paper proposes metrics based on flows for measuring the node importance and the attack effectiveness, respectively. Our node importance metrics include three flow-based centralities (flow betweenness, current-flow betweenness and current-flow closeness), which have not been proposed for use in the attacks on weighted networks yet. Our attack effectiveness metric is a new one proposed by us based on average network flow. Extensive experiments on both artificial and real-world networks show that the attack methods with our three suggested centralities are more effective than the existing attack methods when evaluated under our proposed attack effectiveness metric. ",
    "url": "https://arxiv.org/abs/2211.09345",
    "authors": [
      "Balume Mburano",
      "Weisheng Si",
      "Qing Cao",
      "Wei Xing Zheng"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2211.09348",
    "title": "Continuous Prediction of Web User Visual Attention on short span Windows  based on Gaze Data Analytics",
    "abstract": "The existing approaches to identify personalized salience zones of a Web page do not consider the dynamic behavior in time of the Web user's gaze or the alterations of its content. For this reason, this paper proposes the concept of visit intention, an indicator of the visual attention of a Web user in a certain period of time, short span time windows, in different areas of interest. This indicator gives information on the areas of interest of a website that will be visited by a user over a time window, without requiring to know the structure of the site in each window. Our approach leverages the population-level general gaze patterns and the user's visual kinetics. We show experimentally that it is possible to conduct such a prediction through multilabel classification models using a small number of users, obtaining an average area under curve of 84.3 %, an average accuracy of 79 %, and an individual area of interest accuracy of 77 %. Furthermore, the user's visual kinetics features are consistently selected in every set of a cross-validation evaluation. ",
    "url": "https://arxiv.org/abs/2211.09348",
    "authors": [
      "F. Diaz-Guerra",
      "A. Jimenez-Molina"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2211.09360",
    "title": "Achieving Social Optimality for Energy Communities via Dynamic NEM  Pricing",
    "abstract": "We propose a social welfare maximizing mechanism for an energy community that aggregates individual and shared community resources under a general net energy metering (NEM) policy. Referred to as Dynamic NEM, the proposed mechanism adopts the standard NEM tariff model and sets NEM prices dynamically based on the total shared renewables within the community. We show that Dynamic NEM guarantees a higher benefit to each community member than possible outside the community. We further show that Dynamic NEM aligns the individual member's incentive with that of the overall community; each member optimizing individual surplus under Dynamic NEM results in maximum community's social welfare. Dynamic NEM is also shown to satisfy the cost-causation principle. Empirical studies using real data on a hypothetical energy community demonstrate the benefits to community members and grid operators. ",
    "url": "https://arxiv.org/abs/2211.09360",
    "authors": [
      "Ahmed S. Alahmed",
      "Lang Tong"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Theoretical Economics (econ.TH)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2211.09362",
    "title": "Multiresolution ORKA: fast and resolution independent object  reconstruction using a K-approximation graph",
    "abstract": "Object recognition and reconstruction is of great interest in many research fields. Detecting pedestrians or cars in traffic cameras or tracking seismic waves in geophysical exploration are only two of many applications. Recently, the authors developed a new method - Object reconstruction using K-approximation (ORKA) - to extract such objects out of given data. In this method a special object model is used where the movement and deformation of the object can be controlled to fit the application. ORKA in its current form is highly dependent on the data resolution. On the one hand, the movement of the object can only be reconstructed on a grid that depends on the data resolution. On the other hand, the runtime increases exponentially with the resolution. Hence, the resolution of the data needs to be in a small range where the reconstruction is accurate enough but the runtime is not too high. In this work, we present a multiresolution approach, where we combine ORKA with a wavelet decomposition of the data. The object is then reconstructed iteratively what drastically reduces the runtime. Moreover, we can increase the data resolution such that the movement reconstruction no longer depends on the original grid. We also give a brief introduction on the original ORKA algorithm. Hence, knowledge of the previous work is not required. ",
    "url": "https://arxiv.org/abs/2211.09362",
    "authors": [
      "Florian Bossmann",
      "Wenze Wu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2211.09363",
    "title": "Generalizable Deepfake Detection with Phase-Based Motion Analysis",
    "abstract": "We propose PhaseForensics, a DeepFake (DF) video detection method that leverages a phase-based motion representation of facial temporal dynamics. Existing methods relying on temporal inconsistencies for DF detection present many advantages over the typical frame-based methods. However, they still show limited cross-dataset generalization and robustness to common distortions. These shortcomings are partially due to error-prone motion estimation and landmark tracking, or the susceptibility of the pixel intensity-based features to spatial distortions and the cross-dataset domain shifts. Our key insight to overcome these issues is to leverage the temporal phase variations in the band-pass components of the Complex Steerable Pyramid on face sub-regions. This not only enables a robust estimate of the temporal dynamics in these regions, but is also less prone to cross-dataset variations. Furthermore, the band-pass filters used to compute the local per-frame phase form an effective defense against the perturbations commonly seen in gradient-based adversarial attacks. Overall, with PhaseForensics, we show improved distortion and adversarial robustness, and state-of-the-art cross-dataset generalization, with 91.2% video-level AUC on the challenging CelebDFv2 (a recent state-of-the-art compares at 86.9%). ",
    "url": "https://arxiv.org/abs/2211.09363",
    "authors": [
      "Ekta Prashnani",
      "Michael Goebel",
      "B. S. Manjunath"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.09373",
    "title": "Graph Neural Network-based Surrogate Models for Finite Element Analysis",
    "abstract": "Current simulation of metal forging processes use advanced finite element methods. Such methods consist of solving mathematical equations, which takes a significant amount of time for the simulation to complete. Computational time can be prohibitive for parametric response surface exploration tasks. In this paper, we propose as an alternative, a Graph Neural Network-based graph prediction model to act as a surrogate model for parameters search space exploration and which exhibits a time cost reduced by an order of magnitude. Numerical experiments show that this new model outperforms the Point-Net model and the Dynamic Graph Convolutional Neural Net model. ",
    "url": "https://arxiv.org/abs/2211.09373",
    "authors": [
      "Meduri Venkata Shivadity",
      "José Alves",
      "Francesca Bugiotti",
      "Frederic Magoules"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2211.09374",
    "title": "Execution-based Evaluation for Data Science Code Generation Models",
    "abstract": "Code generation models can benefit data scientists' productivity by automatically generating code from context and text descriptions. An important measure of the modeling progress is whether a model can generate code that can correctly execute to solve the task. However, due to the lack of an evaluation dataset that directly supports execution-based model evaluation, existing work relies on code surface form similarity metrics (e.g., BLEU, CodeBLEU) for model selection, which can be inaccurate. To remedy this, we introduce ExeDS, an evaluation dataset for execution evaluation for data science code generation tasks. ExeDS contains a set of 534 problems from Jupyter Notebooks, each consisting of code context, task description, reference program, and the desired execution output. With ExeDS, we evaluate the execution performance of five state-of-the-art code generation models that have achieved high surface-form evaluation scores. Our experiments show that models with high surface-form scores do not necessarily perform well on execution metrics, and execution-based metrics can better capture model code generation errors. Source code and data can be found at https://github.com/Jun-jie-Huang/ExeDS ",
    "url": "https://arxiv.org/abs/2211.09374",
    "authors": [
      "Junjie Huang",
      "Chenglong Wang",
      "Jipeng Zhang",
      "Cong Yan",
      "Haotian Cui",
      "Jeevana Priya Inala",
      "Colin Clement",
      "Nan Duan",
      "Jianfeng Gao"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2211.09376",
    "title": "Balanced Deep CCA for Bird Vocalization Detection",
    "abstract": "Event detection improves when events are captured by two different modalities rather than just one. But to train detection systems on multiple modalities is challenging, in particular when there is abundance of unlabelled data but limited amounts of labeled data. We develop a novel self-supervised learning technique for multi-modal data that learns (hidden) correlations between simultaneously recorded microphone (sound) signals and accelerometer (body vibration) signals. The key objective of this work is to learn useful embeddings associated with high performance in downstream event detection tasks when labeled data is scarce and the audio events of interest (songbird vocalizations) are sparse. We base our approach on deep canonical correlation analysis (DCCA) that suffers from event sparseness. We overcome the sparseness of positive labels by first learning a data sampling model from the labelled data and by applying DCCA on the output it produces. This method that we term balanced DCCA (b-DCCA) improves the performance of the unsupervised embeddings on the downstream supervised audio detection task compared to classsical DCCA. Because data labels are frequently imbalanced, our method might be of broad utility in low-resource scenarios. ",
    "url": "https://arxiv.org/abs/2211.09376",
    "authors": [
      "Sumit Kumar",
      "B. Anshuman",
      "Linus Ruettimann",
      "Richard H.R. Hahnloser",
      "Vipul Arora"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2211.09379",
    "title": "Self-Training with Purpose Preserving Augmentation Improves Few-shot  Generative Dialogue State Tracking",
    "abstract": "In dialogue state tracking (DST), labeling the dataset involves considerable human labor. We propose a new self-training framework for few-shot generative DST that utilize unlabeled data. Our self-training method iteratively improves the model by pseudo labeling and employs Purpose Preserving Augmentation (PPAug) to prevent overfitting. We increaese the few-shot 10% performance by approximately 4% on MultiWOZ 2.1 and enhances the slot-recall 8.34% for unseen values compared to baseline. ",
    "url": "https://arxiv.org/abs/2211.09379",
    "authors": [
      "Jihyun Lee",
      "Chaebin Lee",
      "Yunsu Kim",
      "Gary Geunbae Lee"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2211.09381",
    "title": "Token-level Speaker Change Detection Using Speaker Difference and Speech  Content via Continuous Integrate-and-fire",
    "abstract": "In multi-talker scenarios such as meetings and conversations, speech processing systems are usually required to segment the audio and then transcribe each segmentation. These two stages are addressed separately by speaker change detection (SCD) and automatic speech recognition (ASR). Most previous SCD systems rely solely on speaker information and ignore the importance of speech content. In this paper, we propose a novel SCD system that considers both cues of speaker difference and speech content. These two cues are converted into token-level representations by the continuous integrate-and-fire (CIF) mechanism and then combined for detecting speaker changes on the token acoustic boundaries. We evaluate the performance of our approach on a public real-recorded meeting dataset, AISHELL-4. The experiment results show that our method outperforms a competitive frame-level baseline system by 2.45% equal coverage-purity (ECP). In addition, we demonstrate the importance of speech content and speaker difference to the SCD task, and the advantages of conducting SCD on the token acoustic boundaries compared with conducting SCD frame by frame. ",
    "url": "https://arxiv.org/abs/2211.09381",
    "authors": [
      "Zhiyun Fan",
      "Zhenlin Liang",
      "Linhao Dong",
      "Yi Liu",
      "Shiyu Zhou",
      "Meng Cai",
      "Jun Zhang",
      "Zejun Ma",
      "Bo Xu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2211.09386",
    "title": "BEVDistill: Cross-Modal BEV Distillation for Multi-View 3D Object  Detection",
    "abstract": "3D object detection from multiple image views is a fundamental and challenging task for visual scene understanding. Owing to its low cost and high efficiency, multi-view 3D object detection has demonstrated promising application prospects. However, accurately detecting objects through perspective views is extremely difficult due to the lack of depth information. Current approaches tend to adopt heavy backbones for image encoders, making them inapplicable for real-world deployment. Different from the images, LiDAR points are superior in providing spatial cues, resulting in highly precise localization. In this paper, we explore the incorporation of LiDAR-based detectors for multi-view 3D object detection. Instead of directly training a depth prediction network, we unify the image and LiDAR features in the Bird-Eye-View (BEV) space and adaptively transfer knowledge across non-homogenous representations in a teacher-student paradigm. To this end, we propose \\textbf{BEVDistill}, a cross-modal BEV knowledge distillation (KD) framework for multi-view 3D object detection. Extensive experiments demonstrate that the proposed method outperforms current KD approaches on a highly-competitive baseline, BEVFormer, without introducing any extra cost in the inference phase. Notably, our best model achieves 59.4 NDS on the nuScenes test leaderboard, achieving new state-of-the-art in comparison with various image-based detectors. Code will be available at https://github.com/zehuichen123/BEVDistill. ",
    "url": "https://arxiv.org/abs/2211.09386",
    "authors": [
      "Zehui Chen",
      "Zhenyu Li",
      "Shiquan Zhang",
      "Liangji Fang",
      "Qinhong Jiang",
      "Feng Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.09407",
    "title": "NANSY++: Unified Voice Synthesis with Neural Analysis and Synthesis",
    "abstract": "Various applications of voice synthesis have been developed independently despite the fact that they generate \"voice\" as output in common. In addition, most of the voice synthesis models still require a large number of audio data paired with annotated labels (e.g., text transcription and music score) for training. To this end, we propose a unified framework of synthesizing and manipulating voice signals from analysis features, dubbed NANSY++. The backbone network of NANSY++ is trained in a self-supervised manner that does not require any annotations paired with audio. After training the backbone network, we efficiently tackle four voice applications - i.e. voice conversion, text-to-speech, singing voice synthesis, and voice designing - by partially modeling the analysis features required for each task. Extensive experiments show that the proposed framework offers competitive advantages such as controllability, data efficiency, and fast training convergence, while providing high quality synthesis. Audio samples: tinyurl.com/8tnsy3uc. ",
    "url": "https://arxiv.org/abs/2211.09407",
    "authors": [
      "Hyeong-Seok Choi",
      "Jinhyeok Yang",
      "Juheon Lee",
      "Hyeongju Kim"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2211.09412",
    "title": "LongFNT: Long-form Speech Recognition with Factorized Neural Transducer",
    "abstract": "Traditional automatic speech recognition~(ASR) systems usually focus on individual utterances, without considering long-form speech with useful historical information, which is more practical in real scenarios. Simply attending longer transcription history for a vanilla neural transducer model shows no much gain in our preliminary experiments, since the prediction network is not a pure language model. This motivates us to leverage the factorized neural transducer structure, containing a real language model, the vocabulary predictor. We propose the {LongFNT-Text} architecture, which fuses the sentence-level long-form features directly with the output of the vocabulary predictor and then embeds token-level long-form features inside the vocabulary predictor, with a pre-trained contextual encoder RoBERTa to further boost the performance. Moreover, we propose the {LongFNT} architecture by extending the long-form speech to the original speech input and achieve the best performance. The effectiveness of our LongFNT approach is validated on LibriSpeech and GigaSpeech corpora with 19% and 12% relative word error rate~(WER) reduction, respectively. ",
    "url": "https://arxiv.org/abs/2211.09412",
    "authors": [
      "Xun Gong",
      "Yu Wu",
      "Jinyu Li",
      "Shujie Liu",
      "Rui Zhao",
      "Xie Chen",
      "Yanmin Qian"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2211.09419",
    "title": "Physics-Informed Koopman Network",
    "abstract": "Koopman operator theory is receiving increased attention due to its promise to linearize nonlinear dynamics. Neural networks that are developed to represent Koopman operators have shown great success thanks to their ability to approximate arbitrarily complex functions. However, despite their great potential, they typically require large training data-sets either from measurements of a real system or from high-fidelity simulations. In this work, we propose a novel architecture inspired by physics-informed neural networks, which leverage automatic differentiation to impose the underlying physical laws via soft penalty constraints during model training. We demonstrate that it not only reduces the need of large training data-sets, but also maintains high effectiveness in approximating Koopman eigenfunctions. ",
    "url": "https://arxiv.org/abs/2211.09419",
    "authors": [
      "Yuying Liu",
      "Aleksei Sholokhov",
      "Hassan Mansour",
      "Saleh Nabi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Analysis of PDEs (math.AP)",
      "Dynamical Systems (math.DS)",
      "Operator Algebras (math.OA)"
    ]
  },
  {
    "id": "arXiv:2211.09421",
    "title": "FedSiam-DA: Dual-aggregated Federated Learning via Siamese Networks  under Non-IID Data",
    "abstract": "Federated learning is a distributed learning that allows each client to keep the original data locally and only upload the parameters of the local model to the server. Despite federated learning can address data island, it remains challenging to train with data heterogeneous in a real application. In this paper, we propose FedSiam-DA, a novel dual-aggregated contrastive federated learning approach, to personalize both local and global models, under various settings of data heterogeneity. Firstly, based on the idea of contrastive learning in the Siamese Network, FedSiam-DA regards the local and global model as different branches of the Siamese Network during the local training and controls the update direction of the model by constantly changing model similarity to personalize the local model. Secondly, FedSiam-DA introduces dynamic weights based on model similarity for each local model and exercises the dual-aggregated mechanism to further improve the generalization of the global model. Moreover, we provide extensive experiments on benchmark datasets, the results demonstrate that FedSiam-DA achieves outperforming several previous FL approaches on heterogeneous datasets. ",
    "url": "https://arxiv.org/abs/2211.09421",
    "authors": [
      "Ming Yang",
      "Yanhan Wang",
      "Xin Wang",
      "Zhenyong Zhang",
      "Xiaoming Wu",
      "Peng Cheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09434",
    "title": "Robust peak-to-peak gain analysis using integral quadratic constraints",
    "abstract": "This work provides a framework to compute an upper bound on the robust peak-to-peak gain of discrete-time uncertain linear systems using integral quadratic constraints (IQCs). Such bounds are of particular interest in the computation of reachable sets and the $\\ell_1$-norm, as well as when safety-critical constraints need to be satisfied pointwise in time. The use of $\\rho$-hard IQCs with a terminal cost enables us to deal with a wide variety of uncertainty classes, for example, we provide $\\rho$-hard IQCs with a terminal cost for the class of parametric uncertainties. This approach unifies, generalizes, and significantly improves state-of-the-art methods, which is also demonstrated in a numerical example. ",
    "url": "https://arxiv.org/abs/2211.09434",
    "authors": [
      "Lukas Schwenkel",
      "Johannes Köhler",
      "Matthias A. Müller",
      "Frank Allgöwer"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2211.09440",
    "title": "Learning to Control Rapidly Changing Synaptic Connections: An  Alternative Type of Memory in Sequence Processing Artificial Neural Networks",
    "abstract": "Short-term memory in standard, general-purpose, sequence-processing recurrent neural networks (RNNs) is stored as activations of nodes or \"neurons.\" Generalising feedforward NNs to such RNNs is mathematically straightforward and natural, and even historical: already in 1943, McCulloch and Pitts proposed this as a surrogate to \"synaptic modifications\" (in effect, generalising the Lenz-Ising model, the first non-sequence processing RNN architecture of the 1920s). A lesser known alternative approach to storing short-term memory in \"synaptic connections\" -- by parameterising and controlling the dynamics of a context-sensitive time-varying weight matrix through another NN -- yields another \"natural\" type of short-term memory in sequence processing NNs: the Fast Weight Programmers (FWPs) of the early 1990s. FWPs have seen a recent revival as generic sequence processors, achieving competitive performance across various tasks. They are formally closely related to the now popular Transformers. Here we present them in the context of artificial NNs as an abstraction of biological NNs -- a perspective that has not been stressed enough in previous FWP work. We first review aspects of FWPs for pedagogical purposes, then discuss connections to related works motivated by insights from neuroscience. ",
    "url": "https://arxiv.org/abs/2211.09440",
    "authors": [
      "Kazuki Irie",
      "Jürgen Schmidhuber"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09443",
    "title": "LEAST: a Low-Energy Adaptive Scalable Tree-based routing protocol for  Wireless Sensor Networks",
    "abstract": "Routing is one of the critical and ongoing challenges in Wireless Sensor Networks. The main challenge has always been to have a routing protocol that reduces the communication overhead, hence saving the energy of the sensors in the network. Hierarchical routing protocols are known to be the most energy-efficient routing protocols for Wireless Sensor Networks. In this paper, a more generalized hierarchical routing protocol is introduced for Wireless Sensor Network, which is based on tree data structures. The clustering in the proposed protocol has the format of a general tree, which is constructed in an adaptive manner based on the distance of the sensors. Results show that the proposed tree-based protocol introduces a significant benefit in energy consumption and lifetime of the network over the existing hierarchical approaches. ",
    "url": "https://arxiv.org/abs/2211.09443",
    "authors": [
      "Amirmohammad Farzaneh",
      "Mihai-Alin Badiu",
      "Justin P. Coon"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2211.09445",
    "title": "aiMotive Dataset: A Multimodal Dataset for Robust Autonomous Driving  with Long-Range Perception",
    "abstract": "Autonomous driving is a popular research area within the computer vision research community. Since autonomous vehicles are highly safety-critical, ensuring robustness is essential for real-world deployment. While several public multimodal datasets are accessible, they mainly comprise two sensor modalities (camera, LiDAR) which are not well suited for adverse weather. In addition, they lack far-range annotations, making it harder to train neural networks that are the base of a highway assistant function of an autonomous vehicle. Therefore, we introduce a multimodal dataset for robust autonomous driving with long-range perception. The dataset consists of 176 scenes with synchronized and calibrated LiDAR, camera, and radar sensors covering a 360-degree field of view. The collected data was captured in highway, urban, and suburban areas during daytime, night, and rain and is annotated with 3D bounding boxes with consistent identifiers across frames. Furthermore, we trained unimodal and multimodal baseline models for 3D object detection. Data are available at \\url{https://github.com/aimotive/aimotive_dataset}. ",
    "url": "https://arxiv.org/abs/2211.09445",
    "authors": [
      "Tamás Matuszka",
      "Iván Barton",
      "Ádám Butykai",
      "Péter Hajas",
      "Dávid Kiss",
      "Domonkos Kovács",
      "Sándor Kunsági-Máté",
      "Péter Lengyel",
      "Gábor Németh",
      "Levente Pető",
      "Dezső Ribli",
      "Dávid Szeghy",
      "Szabolcs Vajna",
      "Bálint Varga"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.09460",
    "title": "Progressive Tree-Structured Prototype Network for End-to-End Image  Captioning",
    "abstract": "Studies of image captioning are shifting towards a trend of a fully end-to-end paradigm by leveraging powerful visual pre-trained models and transformer-based generation architecture for more flexible model training and faster inference speed. State-of-the-art approaches simply extract isolated concepts or attributes to assist description generation. However, such approaches do not consider the hierarchical semantic structure in the textual domain, which leads to an unpredictable mapping between visual representations and concept words. To this end, we propose a novel Progressive Tree-Structured prototype Network (dubbed PTSN), which is the first attempt to narrow down the scope of prediction words with appropriate semantics by modeling the hierarchical textual semantics. Specifically, we design a novel embedding method called tree-structured prototype, producing a set of hierarchical representative embeddings which capture the hierarchical semantic structure in textual space. To utilize such tree-structured prototypes into visual cognition, we also propose a progressive aggregation module to exploit semantic relationships within the image and prototypes. By applying our PTSN to the end-to-end captioning framework, extensive experiments conducted on MSCOCO dataset show that our method achieves a new state-of-the-art performance with 144.2% (single model) and 146.5% (ensemble of 4 models) CIDEr scores on `Karpathy' split and 141.4% (c5) and 143.9% (c40) CIDEr scores on the official online test server. Trained models and source code have been released at: https://github.com/NovaMind-Z/PTSN. ",
    "url": "https://arxiv.org/abs/2211.09460",
    "authors": [
      "Pengpeng Zeng",
      "Jinkuan Zhu",
      "Jingkuan Song",
      "Lianli Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.09466",
    "title": "Integrated Sensing and Communication for Large Networks using a Dynamic  Transmission Strategy and Full Duplex",
    "abstract": "A large network employing integrated sensing and communication (ISAC) where a single transmit signal by the base station (BS) serves both the radar and communication modes is studied. Typically in ISAC, bistatic radar detection is done at a passive radar. The radar-mode performance is significantly more vulnerable than the communication-mode due to the double path-loss in the signal component while interferers have direct links. To combat this, we propose: 1) monostatic radar detection at the BS via full-duplex (FD), 2) a novel dynamic transmission strategy (DTS). With FD monostatic detection we are able to improve radar-mode performance over bistatic detection in certain scenarios, while bistatic detection dominates in others. We also analyze the performance of joint bistatic and FD monostatic detection. Significant improvements in radar-performance can be attained with joint detection in certain scenarios, while using one strategy is beneficial in others. Our results highlight that with the DTS we are able to significantly improve quality of radar detection at the cost of quantity. Further, DTS causes some performance deterioration to the communication-mode; however, the gains attained for the radar-mode are much higher. We show that joint detection and DTS together can significantly improve radar performance from a traditional radar-network. ",
    "url": "https://arxiv.org/abs/2211.09466",
    "authors": [
      "Konpal Shaukat Ali",
      "Marwa Chafii"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2211.09469",
    "title": "Visual Commonsense-aware Representation Network for Video Captioning",
    "abstract": "Generating consecutive descriptions for videos, i.e., Video Captioning, requires taking full advantage of visual representation along with the generation process. Existing video captioning methods focus on making an exploration of spatial-temporal representations and their relationships to produce inferences. However, such methods only exploit the superficial association contained in the video itself without considering the intrinsic visual commonsense knowledge that existed in a video dataset, which may hinder their capabilities of knowledge cognitive to reason accurate descriptions. To address this problem, we propose a simple yet effective method, called Visual Commonsense-aware Representation Network (VCRN), for video captioning. Specifically, we construct a Video Dictionary, a plug-and-play component, obtained by clustering all video features from the total dataset into multiple clustered centers without additional annotation. Each center implicitly represents a visual commonsense concept in the video domain, which is utilized in our proposed Visual Concept Selection (VCS) to obtain a video-related concept feature. Next, a Conceptual Integration Generation (CIG) is proposed to enhance the caption generation. Extensive experiments on three publicly video captioning benchmarks: MSVD, MSR-VTT, and VATEX, demonstrate that our method reaches state-of-the-art performance, indicating the effectiveness of our method. In addition, our approach is integrated into the existing method of video question answering and improves this performance, further showing the generalization of our method. Source code has been released at https://github.com/zchoi/VCRN. ",
    "url": "https://arxiv.org/abs/2211.09469",
    "authors": [
      "Pengpeng Zeng",
      "Haonan Zhang",
      "Lianli Gao",
      "Xiangpeng Li",
      "Jin Qian",
      "Heng Tao Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.09495",
    "title": "Back-Translation-Style Data Augmentation for Mandarin Chinese Polyphone  Disambiguation",
    "abstract": "Conversion of Chinese Grapheme-to-Phoneme (G2P) plays an important role in Mandarin Chinese Text-To-Speech (TTS) systems, where one of the biggest challenges is the task of polyphone disambiguation. Most of the previous polyphone disambiguation models are trained on manually annotated datasets, and publicly available datasets for polyphone disambiguation are scarce. In this paper we propose a simple back-translation-style data augmentation method for mandarin Chinese polyphone disambiguation, utilizing a large amount of unlabeled text data. Inspired by the back-translation technique proposed in the field of machine translation, we build a Grapheme-to-Phoneme (G2P) model to predict the pronunciation of polyphonic character, and a Phoneme-to-Grapheme (P2G) model to predict pronunciation into text. Meanwhile, a window-based matching strategy and a multi-model scoring strategy are proposed to judge the correctness of the pseudo-label. We design a data balance strategy to improve the accuracy of some typical polyphonic characters in the training set with imbalanced distribution or data scarcity. The experimental result shows the effectiveness of the proposed back-translation-style data augmentation method. ",
    "url": "https://arxiv.org/abs/2211.09495",
    "authors": [
      "Chunyu Qiang",
      "Peng Yang",
      "Hao Che",
      "Jinba Xiao",
      "Xiaorui Wang",
      "Zhongyuan Wang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2211.09507",
    "title": "Attacking Digital Twins of Robotic Systems to Compromise Security and  Safety",
    "abstract": "Security and safety are of paramount importance to human-robot interaction, either for autonomous robots or human-robot collaborative manufacturing. The intertwined relationship between security and safety has imposed new challenges on the emerging digital twin systems of various types of robots. To be specific, the attack of either the cyber-physical system or the digital-twin system could cause severe consequences to the other. Particularly, the attack of a digital-twin system that is synchronized with a cyber-physical system could cause lateral damage to humans and other surrounding facilities. This paper demonstrates that for Robot Operating System (ROS) driven systems, attacks such as the person-in-the-middle attack of the digital-twin system could eventually lead to a collapse of the cyber-physical system, whether it is an industrial robot or an autonomous mobile robot, causing unexpected consequences. We also discuss potential solutions to alleviate such attacks. ",
    "url": "https://arxiv.org/abs/2211.09507",
    "authors": [
      "Christopher Carr",
      "Shenglin Wang",
      "Peng Wang",
      "Liangxiu Han"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2211.09510",
    "title": "Self-supervised Trajectory Representation Learning with Temporal  Regularities and Travel Semantics",
    "abstract": "Trajectory Representation Learning (TRL) is a powerful tool for spatial-temporal data analysis and management. TRL aims to convert complicated raw trajectories into low-dimensional representation vectors, which can be applied to various downstream tasks, such as trajectory classification, clustering, and similarity computation. Existing TRL works usually treat trajectories as ordinary sequence data, while some important spatial-temporal characteristics, such as temporal regularities and travel semantics, are not fully exploited. To fill this gap, we propose a novel Self-supervised trajectory representation learning framework with TemporAl Regularities and Travel semantics, namely START. The proposed method consists of two stages. The first stage is a Trajectory Pattern-Enhanced Graph Attention Network (TPE-GAT), which converts the road network features and travel semantics into representation vectors of road segments. The second stage is a Time-Aware Trajectory Encoder (TAT-Enc), which encodes representation vectors of road segments in the same trajectory as a trajectory representation vector, meanwhile incorporating temporal regularities with the trajectory representation. Moreover, we also design two self-supervised tasks, i.e., span-masked trajectory recovery and trajectory contrastive learning, to introduce spatial-temporal characteristics of trajectories into the training process of our START framework. The effectiveness of the proposed method is verified by extensive experiments on two large-scale real-world datasets for three downstream tasks. The experiments also demonstrate that our method can be transferred across different cities to adapt heterogeneous trajectory datasets. ",
    "url": "https://arxiv.org/abs/2211.09510",
    "authors": [
      "Jiawei Jiang",
      "Dayan Pan",
      "Houxing Ren",
      "Xiaohan Jiang",
      "Chao Li",
      "Jingyuan Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09518",
    "title": "ImLiDAR: Cross-Sensor Dynamic Message Propagation Network for 3D Object  Detection",
    "abstract": "LiDAR and camera, as two different sensors, supply geometric (point clouds) and semantic (RGB images) information of 3D scenes. However, it is still challenging for existing methods to fuse data from the two cross sensors, making them complementary for quality 3D object detection (3OD). We propose ImLiDAR, a new 3OD paradigm to narrow the cross-sensor discrepancies by progressively fusing the multi-scale features of camera Images and LiDAR point clouds. ImLiDAR enables to provide the detection head with cross-sensor yet robustly fused features. To achieve this, two core designs exist in ImLiDAR. First, we propose a cross-sensor dynamic message propagation module to combine the best of the multi-scale image and point features. Second, we raise a direct set prediction problem that allows designing an effective set-based detector to tackle the inconsistency of the classification and localization confidences, and the sensitivity of hand-tuned hyperparameters. Besides, the novel set-based detector can be detachable and easily integrated into various detection networks. Comparisons on both the KITTI and SUN-RGBD datasets show clear visual and numerical improvements of our ImLiDAR over twenty-three state-of-the-art 3OD methods. ",
    "url": "https://arxiv.org/abs/2211.09518",
    "authors": [
      "Yiyang Shen",
      "Rongwei Yu",
      "Peng Wu",
      "Haoran Xie",
      "Lina Gong",
      "Jing Qin",
      "Mingqiang Wei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.09527",
    "title": "Ignore Previous Prompt: Attack Techniques For Language Models",
    "abstract": "Transformer-based large language models (LLMs) provide a powerful foundation for natural language tasks in large-scale customer-facing applications. However, studies that explore their vulnerabilities emerging from malicious user interaction are scarce. By proposing PromptInject, a prosaic alignment framework for mask-based iterative adversarial prompt composition, we examine how GPT-3, the most widely deployed language model in production, can be easily misaligned by simple handcrafted inputs. In particular, we investigate two types of attacks -- goal hijacking and prompt leaking -- and demonstrate that even low-aptitude, but sufficiently ill-intentioned agents, can easily exploit GPT-3's stochastic nature, creating long-tail risks. The code for PromptInject is available at https://github.com/agencyenterprise/PromptInject. ",
    "url": "https://arxiv.org/abs/2211.09527",
    "authors": [
      "Fábio Perez",
      "Ian Ribeiro"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.09537",
    "title": "Neural Langevin Dynamics: towards interpretable Neural Stochastic  Differential Equations",
    "abstract": "Neural Stochastic Differential Equations (NSDE) have been trained as both Variational Autoencoders, and as GANs. However, the resulting Stochastic Differential Equations can be hard to interpret or analyse due to the generic nature of the drift and diffusion fields. By restricting our NSDE to be of the form of Langevin dynamics, and training it as a VAE, we obtain NSDEs that lend themselves to more elaborate analysis and to a wider range of visualisation techniques than a generic NSDE. More specifically, we obtain an energy landscape, the minima of which are in one-to-one correspondence with latent states underlying the used data. This not only allows us to detect states underlying the data dynamics in an unsupervised manner, but also to infer the distribution of time spent in each state according to the learned SDE. More in general, restricting an NSDE to Langevin dynamics enables the use of a large set of tools from computational molecular dynamics for the analysis of the obtained results. ",
    "url": "https://arxiv.org/abs/2211.09537",
    "authors": [
      "Simon M. Koop",
      "Mark A. Peletier",
      "Jacobus W. Portegies",
      "Vlado Menkovski"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09544",
    "title": "Robust Downlink Multi-Antenna Beamforming with Heterogenous CSI:  Enabling eMBB and URLLC Coexistence",
    "abstract": "Two of the main problems to achieve ultra-reliable low-latency communications (URLLC) are related to instantaneous channel state information (I-CSI) acquisition and the coexistence with other service modes such as enhanced mobile broadband (eMBB). The former comes from the non-negligible time required for accurate I-CSI acquisition, while the latter, from the heterogeneous and conflicting requirements of different nodes sharing the same network resources. In this paper, we leverage the I-CSI of multiple eMBB links and the channel measurement's history of a URLLC user for multi-antenna beamforming design. Specifically, we propose a precoding design that minimizes the transmit power of a base station (BS) providing eMBB and URLLC services with signal-to-interference-plus-noise ratio (SINR) and outage constraints, respectively, by modifying existing I-CSI-based precoding schemes to account for URLLC channel history information. Moreover, we illustrate and validate the proposed method by adopting zero-forcing (ZF) and the transmit power minimization (TPM) precoding with SINR constraints. We show that the ZF implementation outperforms TPM in adverse channel conditions as in Rayleigh fading, while the situation is rapidly reversed as the channel experiences some line-of-sight (LOS). Finally, we determine the confidence levels at which the target outage probabilities are reached. For instance, we show that outage probabilities below $10^{-3}$ are achievable with more than 99$\\%$ confidence for both precoding schemes under favorable LOS conditions with 16 transmit antennas and 500 samples of URLLC channel history. ",
    "url": "https://arxiv.org/abs/2211.09544",
    "authors": [
      "Dian Echevarría Pérez",
      "Onel L. Alcaraz López",
      "Hirley Alves"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2211.09562",
    "title": "Convolutional neural networks for medical image segmentation",
    "abstract": "In this article, we look into some essential aspects of convolutional neural networks (CNNs) with the focus on medical image segmentation. First, we discuss the CNN architecture, thereby highlighting the spatial origin of the data, voxel-wise classification and the receptive field. Second, we discuss the sampling of input-output pairs, thereby highlighting the interaction between voxel-wise classification, patch size and the receptive field. Finally, we give a historical overview of crucial changes to CNN architectures for classification and segmentation, giving insights in the relation between three pivotal CNN architectures: FCN, U-Net and DeepMedic. ",
    "url": "https://arxiv.org/abs/2211.09562",
    "authors": [
      "Jeroen Bertels",
      "David Robben",
      "Robin Lemmens",
      "Dirk Vandermeulen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09565",
    "title": "Towards Good Practices in Evaluating Transfer Adversarial Attacks",
    "abstract": "Transfer adversarial attacks raise critical security concerns in real-world, black-box scenarios. However, the actual progress of attack methods is difficult to assess due to two main limitations in existing evaluations. First, existing evaluations are unsystematic and sometimes unfair since new methods are often directly added to old ones without complete comparisons to similar methods. Second, existing evaluations mainly focus on transferability but overlook another key attack property: stealthiness. In this work, we design good practices to address these limitations. We first introduce a new attack categorization, which enables our systematic analyses of similar attacks in each specific category. Our analyses lead to new findings that complement or even challenge existing knowledge. Furthermore, we comprehensively evaluate 23 representative attacks against 9 defenses on ImageNet. We pay particular attention to stealthiness, by adopting diverse imperceptibility metrics and looking into new, finer-grained characteristics. Our evaluation reveals new important insights: 1) Transferability is highly contextual, and some white-box defenses may give a false sense of security since they are actually vulnerable to (black-box) transfer attacks; 2) All transfer attacks are less stealthy, and their stealthiness can vary dramatically under the same $L_{\\infty}$ bound. ",
    "url": "https://arxiv.org/abs/2211.09565",
    "authors": [
      "Zhengyu Zhao",
      "Hanwei Zhang",
      "Renjue Li",
      "Ronan Sicre",
      "Laurent Amsaleg",
      "Michael Backes"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09587",
    "title": "Spatial Graph Convolution Neural Networks for Water Distribution Systems",
    "abstract": "We investigate the task of missing value estimation in graphs as given by water distribution systems (WDS) based on sparse signals as a representative machine learning challenge in the domain of critical infrastructure. The underlying graphs have a comparably low node degree and high diameter, while information in the graph is globally relevant, hence graph neural networks face the challenge of long-term dependencies. We propose a specific architecture based on message passing which displays excellent results for a number of benchmark tasks in the WDS domain. Further, we investigate a multi-hop variation, which requires considerably less resources and opens an avenue towards big WDS graphs. ",
    "url": "https://arxiv.org/abs/2211.09587",
    "authors": [
      "Inaam Ashraf",
      "Luca Hermes",
      "André Artelt",
      "Barbara Hammer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09625",
    "title": "Predicting Human Mobility via Self-supervised Disentanglement Learning",
    "abstract": "Deep neural networks have recently achieved considerable improvements in learning human behavioral patterns and individual preferences from massive spatial-temporal trajectories data. However, most of the existing research concentrates on fusing different semantics underlying sequential trajectories for mobility pattern learning which, in turn, yields a narrow perspective on comprehending human intrinsic motions. In addition, the inherent sparsity and under-explored heterogeneous collaborative items pertaining to human check-ins hinder the potential exploitation of human diverse periodic regularities as well as common interests. Motivated by recent advances in disentanglement learning, in this study we propose a novel disentangled solution called SSDL for tackling the next POI prediction problem. SSDL primarily seeks to disentangle the potential time-invariant and time-varying factors into different latent spaces from massive trajectories data, providing an interpretable view to understand the intricate semantics underlying human diverse mobility representations. To address the data sparsity issue, we present two realistic trajectory augmentation approaches to enhance the understanding of both the human intrinsic periodicity and constantly-changing intents. In addition, we devise a POI-centric graph structure to explore heterogeneous collaborative signals underlying historical check-ins. Extensive experiments conducted on four real-world datasets demonstrate that our proposed SSDL significantly outperforms the state-of-the-art approaches -- for example, it yields up to 8.57% improvements on ACC@1. ",
    "url": "https://arxiv.org/abs/2211.09625",
    "authors": [
      "Qiang Gao",
      "Jinyu Hong",
      "Xovee Xu",
      "Ping Kuang",
      "Fan Zhou",
      "Goce Trajcevski"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2211.09656",
    "title": "Social Networks are Divulging Your Identity behind Crypto Addresses",
    "abstract": "Cryptocurrencies, such as Bitcoin and Ethereum, are becoming increasingly prevalent mainly due to their anonymity, decentralization, transparency, and security. However, the completely public ledger makes the trace and analysis of each account possible as long as the identity behind the public address is revealed. Theoretically, social networks could make that happen when addresses are posted on social network platforms using accounts containing personal information. To verify such a possibility, we have collected public data from two major platforms, i.e. Twitter and Reddit, aiming to find potential privacy leakage behind the ETH public address. In the end, an easy-to-use retrieval application is also built for a better illustration. ",
    "url": "https://arxiv.org/abs/2211.09656",
    "authors": [
      "Shuo Chen",
      "Shaikh Muhammad Uzair Norman"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2211.09657",
    "title": "A Spreader Ranking Algorithm for Extremely Low-budget Influence  Maximization in Social Networks using Community Bridge Nodes",
    "abstract": "In recent years, social networking platforms have gained significant popularity among the masses like connecting with people and propagating ones thoughts and opinions. This has opened the door to user-specific advertisements and recommendations on these platforms, bringing along a significant focus on Influence Maximisation (IM) on social networks due to its wide applicability in target advertising, viral marketing, and personalized recommendations. The aim of IM is to identify certain nodes in the network which can help maximize the spread of certain information through a diffusion cascade. While several works have been proposed for IM, most were inefficient in exploiting community structures to their full extent. In this work, we propose a community structures-based approach, which employs a K-Shell algorithm in order to generate a score for the connections between seed nodes and communities for low-budget scenarios. Further, our approach employs entropy within communities to ensure the proper spread of information within the communities. We choose the Independent Cascade (IC) model to simulate information spread and evaluate it on four evaluation metrics. We validate our proposed approach on eight publicly available networks and find that it significantly outperforms the baseline approaches on these metrics, while still being relatively efficient. ",
    "url": "https://arxiv.org/abs/2211.09657",
    "authors": [
      "Aaryan Gupta",
      "Inder Khatri",
      "Arjun Choudhry",
      "Pranav Chandhok",
      "Dinesh Kumar Vishwakarma",
      "Mukesh Prasad"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.09664",
    "title": "Influencer Detection with Dynamic Graph Neural Networks",
    "abstract": "Leveraging network information for prediction tasks has become a common practice in many domains. Being an important part of targeted marketing, influencer detection can potentially benefit from incorporating dynamic network representation. In this work, we investigate different dynamic Graph Neural Networks (GNNs) configurations for influencer detection and evaluate their prediction performance using a unique corporate data set. We show that using deep multi-head attention in GNN and encoding temporal attributes significantly improves performance. Furthermore, our empirical evaluation illustrates that capturing neighborhood representation is more beneficial that using network centrality measures. ",
    "url": "https://arxiv.org/abs/2211.09664",
    "authors": [
      "Elena Tiukhova",
      "Emiliano Penaloza",
      "María Óskarsdóttir",
      "Hernan Garcia",
      "Alejandro Correa Bahnsen",
      "Bart Baesens",
      "Monique Snoeck",
      "Cristián Bravo"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09682",
    "title": "AligNeRF: High-Fidelity Neural Radiance Fields via Alignment-Aware  Training",
    "abstract": "Neural Radiance Fields (NeRFs) are a powerful representation for modeling a 3D scene as a continuous function. Though NeRF is able to render complex 3D scenes with view-dependent effects, few efforts have been devoted to exploring its limits in a high-resolution setting. Specifically, existing NeRF-based methods face several limitations when reconstructing high-resolution real scenes, including a very large number of parameters, misaligned input data, and overly smooth details. In this work, we conduct the first pilot study on training NeRF with high-resolution data and propose the corresponding solutions: 1) marrying the multilayer perceptron (MLP) with convolutional layers which can encode more neighborhood information while reducing the total number of parameters; 2) a novel training strategy to address misalignment caused by moving objects or small camera calibration errors; and 3) a high-frequency aware loss. Our approach is nearly free without introducing obvious training/testing costs, while experiments on different datasets demonstrate that it can recover more high-frequency details compared with the current state-of-the-art NeRF models. Project page: \\url{https://yifanjiang.net/alignerf.} ",
    "url": "https://arxiv.org/abs/2211.09682",
    "authors": [
      "Yifan Jiang",
      "Peter Hedman",
      "Ben Mildenhall",
      "Dejia Xu",
      "Jonathan T. Barron",
      "Zhangyang Wang",
      "Tianfan Xue"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.09683",
    "title": "Influence Maximization in Social Networks using Discretized Harris Hawks  Optimization Algorithm and Neighbour Scout Strategy",
    "abstract": "Influence Maximization (IM) is the task of determining k optimal influential nodes in a social network to maximize the influence spread using a propagation model. IM is a prominent problem for viral marketing, and helps significantly in social media advertising. However, developing effective algorithms with minimal time complexity for real-world social networks still remains a challenge. While traditional heuristic approaches have been applied for IM, they often result in minimal performance gains over the computationally expensive Greedy-based and Reverse Influence Sampling-based approaches. In this paper, we propose the discretization of the nature-inspired Harris Hawks Optimisation meta-heuristic algorithm using community structures for optimal selection of seed nodes for influence spread. In addition to Harris Hawks intelligence, we employ a neighbour scout strategy algorithm to avoid blindness and enhance the searching ability of the hawks. Further, we use a candidate nodes-based random population initialization approach, and these candidate nodes aid in accelerating the convergence process for the entire populace. We evaluate the efficacy of our proposed DHHO approach on six social networks using the Independent Cascade model for information diffusion. We observe that DHHO is comparable or better than competing meta-heuristic approaches for Influence Maximization across five metrics, and performs noticeably better than competing heuristic approaches. ",
    "url": "https://arxiv.org/abs/2211.09683",
    "authors": [
      "Inder Khatri",
      "Arjun Choudhry",
      "Aryaman Rao",
      "Aryan Tyagi",
      "Dinesh Kumar Vishwakarma",
      "Mukesh Prasad"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2211.09706",
    "title": "A Synthetic Dataset for 5G UAV Attacks Based on Observable Network  Parameters",
    "abstract": "Synthetic datasets are beneficial for machine learning researchers due to the possibility of experimenting with new strategies and algorithms in the training and testing phases. These datasets can easily include more scenarios that might be costly to research with real data or can complement and, in some cases, replace real data measurements, depending on the quality of the synthetic data. They can also solve the unbalanced data problem, avoid overfitting, and can be used in training while testing can be done with real data. In this paper, we present, to the best of our knowledge, the first synthetic dataset for Unmanned Aerial Vehicle (UAV) attacks in 5G and beyond networks based on the following key observable network parameters that indicate power levels: the Received Signal Strength Indicator (RSSI) and the Signal to Interference-plus-Noise Ratio (SINR). The main objective of this data is to enable deep network development for UAV communication security. Especially, for algorithm development or the analysis of time-series data applied to UAV attack recognition. Our proposed dataset provides insights into network functionality when static or moving UAV attackers target authenticated UAVs in an urban environment. The dataset also considers the presence and absence of authenticated terrestrial users in the network, which may decrease the deep networks ability to identify attacks. Furthermore, the data provides deeper comprehension of the metrics available in the 5G physical and MAC layers for machine learning and statistics research. The dataset will available at link archive-beta.ics.uci.edu ",
    "url": "https://arxiv.org/abs/2211.09706",
    "authors": [
      "Joseanne Viana",
      "Hamed Farkhari",
      "Pedro Sebastiao",
      "Sandra Lagen",
      "Katerina Koutlia",
      "Biljana Bojovic",
      "Rui Dinis"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09708",
    "title": "Sources of performance variability in deep learning-based polyp  detection",
    "abstract": "Validation metrics are a key prerequisite for the reliable tracking of scientific progress and for deciding on the potential clinical translation of methods. While recent initiatives aim to develop comprehensive theoretical frameworks for understanding metric-related pitfalls in image analysis problems, there is a lack of experimental evidence on the concrete effects of common and rare pitfalls on specific applications. We address this gap in the literature in the context of colon cancer screening. Our contribution is twofold. Firstly, we present the winning solution of the Endoscopy computer vision challenge (EndoCV) on colon cancer detection, conducted in conjunction with the IEEE International Symposium on Biomedical Imaging (ISBI) 2022. Secondly, we demonstrate the sensitivity of commonly used metrics to a range of hyperparameters as well as the consequences of poor metric choices. Based on comprehensive validation studies performed with patient data from six clinical centers, we found all commonly applied object detection metrics to be subject to high inter-center variability. Furthermore, our results clearly demonstrate that the adaptation of standard hyperparameters used in the computer vision community does not generally lead to the clinically most plausible results. Finally, we present localization criteria that correspond well to clinical relevance. Our work could be a first step towards reconsidering common validation strategies in automatic colon cancer screening applications. ",
    "url": "https://arxiv.org/abs/2211.09708",
    "authors": [
      "Thuy Nuong Tran",
      "Tim Adler",
      "Amine Yamlahi",
      "Evangelia Christodoulou",
      "Patrick Godau",
      "Annika Reinke",
      "Minu Dietlinde Tizabi",
      "Peter Sauer",
      "Tillmann Persicke",
      "Jörg Gerhard Albert",
      "Lena Maier-Hein"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.09710",
    "title": "Style Classification of Rabbinic Literature for Detection of Lost  Midrash Tanhuma Material",
    "abstract": "Midrash collections are complex rabbinic works that consist of text in multiple languages, which evolved through long processes of unstable oral and written transmission. Determining the origin of a given passage in such a compilation is not always straightforward and is often a matter of dispute among scholars, yet it is essential for scholars' understanding of the passage and its relationship to other texts in the rabbinic corpus. To help solve this problem, we propose a system for classification of rabbinic literature based on its style, leveraging recently released pretrained Transformer models for Hebrew. Additionally, we demonstrate how our method can be applied to uncover lost material from Midrash Tanhuma. ",
    "url": "https://arxiv.org/abs/2211.09710",
    "authors": [
      "Shlomo Tannor",
      "Nachum Dershowitz",
      "Moshe Lavee"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09717",
    "title": "UPTON: Unattributable Authorship Text via Data Poisoning",
    "abstract": "In online medium such as opinion column in Bloomberg, The Guardian and Western Journal, aspiring writers post their writings for various reasons with their names often proudly open. However, it may occur that such a writer wants to write in other venues anonymously or under a pseudonym (e.g., activist, whistle-blower). However, if an attacker has already built an accurate authorship attribution (AA) model based off of the writings from such platforms, attributing an anonymous writing to the known authorship is possible. Therefore, in this work, we ask a question \"can one make the writings and texts, T, in the open spaces such as opinion sharing platforms unattributable so that AA models trained from T cannot attribute authorship well?\" Toward this question, we present a novel solution, UPTON, that exploits textual data poisoning method to disturb the training process of AA models. UPTON uses data poisoning to destroy the authorship feature only in training samples by perturbing them, and try to make released textual data unlearnable on deep neuron networks. It is different from previous obfuscation works, that use adversarial attack to modify the test samples and mislead an AA model, and also the backdoor works, which use trigger words both in test and training samples and only change the model output when trigger words occur. Using four authorship datasets (e.g., IMDb10, IMDb64, Enron and WJO), then, we present empirical validation where: (1)UPTON is able to downgrade the test accuracy to about 30% with carefully designed target-selection methods. (2)UPTON poisoning is able to preserve most of the original semantics. The BERTSCORE between the clean and UPTON poisoned texts are higher than 0.95. The number is very closed to 1.00, which means no sematic change. (3)UPTON is also robust towards spelling correction systems. ",
    "url": "https://arxiv.org/abs/2211.09717",
    "authors": [
      "Ziyao Wang",
      "Thai Le",
      "Dongwon Lee"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2211.09719",
    "title": "Learning Adaptive Evolutionary Computation for Solving Multi-Objective  Optimization Problems",
    "abstract": "Multi-objective evolutionary algorithms (MOEAs) are widely used to solve multi-objective optimization problems. The algorithms rely on setting appropriate parameters to find good solutions. However, this parameter tuning could be very computationally expensive in solving non-trial (combinatorial) optimization problems. This paper proposes a framework that integrates MOEAs with adaptive parameter control using Deep Reinforcement Learning (DRL). The DRL policy is trained to adaptively set the values that dictate the intensity and probability of mutation for solutions during optimization. We test the proposed approach with a simple benchmark problem and a real-world, complex warehouse design and control problem. The experimental results demonstrate the advantages of our method in terms of solution quality and computation time to reach good solutions. In addition, we show the learned policy is transferable, i.e., the policy trained on a simple benchmark problem can be directly applied to solve the complex warehouse optimization problem, effectively, without the need for retraining. ",
    "url": "https://arxiv.org/abs/2211.09719",
    "authors": [
      "Remco Coppens",
      "Robbert Reijnen",
      "Yingqian Zhang",
      "Laurens Bliek",
      "Berend Steenhuisen"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09728",
    "title": "Generative Adversarial Training Can Improve Neural Language Models",
    "abstract": "While deep learning in the form of recurrent neural networks (RNNs) has caused a significant improvement in neural language modeling, the fact that they are extremely prone to overfitting is still a mainly unresolved issue. In this paper we propose a regularization method based on generative adversarial networks (GANs) and adversarial training (AT), that can prevent overfitting in neural language models. Unlike common adversarial training methods such as the fast gradient sign method (FGSM) that require a second back-propagation through time, and therefore effectively require at least twice the amount of time for regular training, the overhead of our method does not exceed more than 20% of the training of the baselines. ",
    "url": "https://arxiv.org/abs/2211.09728",
    "authors": [
      "Sajad Movahedi",
      "Azadeh Shakery"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09732",
    "title": "Extending Logic Explained Networks to Text Classification",
    "abstract": "Recently, Logic Explained Networks (LENs) have been proposed as explainable-by-design neural models providing logic explanations for their predictions. However, these models have only been applied to vision and tabular data, and they mostly favour the generation of global explanations, while local ones tend to be noisy and verbose. For these reasons, we propose LENp, improving local explanations by perturbing input words, and we test it on text classification. Our results show that (i) LENp provides better local explanations than LIME in terms of sensitivity and faithfulness, and (ii) logic explanations are more useful and user-friendly than feature scoring provided by LIME as attested by a human survey. ",
    "url": "https://arxiv.org/abs/2211.09732",
    "authors": [
      "Rishabh Jain",
      "Gabriele Ciravegna",
      "Pietro Barbiero",
      "Francesco Giannini",
      "Davide Buffelli",
      "Pietro Lio"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.09751",
    "title": "Heart Abnormality Detection from Heart Sound Signals using MFCC Feature  and Dual Stream Attention Based Network",
    "abstract": "Cardiovascular diseases are one of the leading cause of death in today's world and early screening of heart condition plays a crucial role in preventing them. The heart sound signal is one of the primary indicator of heart condition and can be used to detect abnormality in the heart. The acquisition of heart sound signal is non-invasive, cost effective and requires minimum equipment. But currently the detection of heart abnormality from heart sound signal depends largely on the expertise and experience of the physician. As such an automatic detection system for heart abnormality detection from heart sound signal can be a great asset for the people living in underdeveloped areas. In this paper we propose a novel deep learning based dual stream network with attention mechanism that uses both the raw heart sound signal and the MFCC features to detect abnormality in heart condition of a patient. The deep neural network has a convolutional stream that uses the raw heart sound signal and a recurrent stream that uses the MFCC features of the signal. The features from these two streams are merged together using a novel attention network and passed through the classification network. The model is trained on the largest publicly available dataset of PCG signal and achieves an accuracy of 87.11, sensitivity of 82.41, specificty of 91.8 and a MACC of 87.12. ",
    "url": "https://arxiv.org/abs/2211.09751",
    "authors": [
      "Nayeeb Rashid",
      "Swapnil Saha",
      "Mohseu Rashid Subah",
      "Rizwan Ahmed Robin",
      "Syed Mortuza Hasan Fahim",
      "Shahed Ahmed",
      "Talha Ibn Mahmud"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)",
      "Medical Physics (physics.med-ph)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2211.09768",
    "title": "D$^3$ETR: Decoder Distillation for Detection Transformer",
    "abstract": "While various knowledge distillation (KD) methods in CNN-based detectors show their effectiveness in improving small students, the baselines and recipes for DETR-based detectors are yet to be built. In this paper, we focus on the transformer decoder of DETR-based detectors and explore KD methods for them. The outputs of the transformer decoder lie in random order, which gives no direct correspondence between the predictions of the teacher and the student, thus posing a challenge for knowledge distillation. To this end, we propose MixMatcher to align the decoder outputs of DETR-based teachers and students, which mixes two teacher-student matching strategies, i.e., Adaptive Matching and Fixed Matching. Specifically, Adaptive Matching applies bipartite matching to adaptively match the outputs of the teacher and the student in each decoder layer, while Fixed Matching fixes the correspondence between the outputs of the teacher and the student with the same object queries, with the teacher's fixed object queries fed to the decoder of the student as an auxiliary group. Based on MixMatcher, we build \\textbf{D}ecoder \\textbf{D}istillation for \\textbf{DE}tection \\textbf{TR}ansformer (D$^3$ETR), which distills knowledge in decoder predictions and attention maps from the teachers to students. D$^3$ETR shows superior performance on various DETR-based detectors with different backbones. For example, D$^3$ETR improves Conditional DETR-R50-C5 by $\\textbf{7.8}/\\textbf{2.4}$ mAP under $12/50$ epochs training settings with Conditional DETR-R101-C5 as the teacher. ",
    "url": "https://arxiv.org/abs/2211.09768",
    "authors": [
      "Xiaokang Chen",
      "Jiahui Chen",
      "Yan Liu",
      "Gang Zeng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.09771",
    "title": "Boosting Object Representation Learning via Motion and Object Continuity",
    "abstract": "Recent unsupervised multi-object detection models have shown impressive performance improvements, largely attributed to novel architectural inductive biases. Unfortunately, they may produce suboptimal object encodings for downstream tasks. To overcome this, we propose to exploit object motion and continuity, i.e., objects do not pop in and out of existence. This is accomplished through two mechanisms: (i) providing priors on the location of objects through integration of optical flow, and (ii) a contrastive object continuity loss across consecutive image frames. Rather than developing an explicit deep architecture, the resulting Motion and Object Continuity (MOC) scheme can be instantiated using any baseline object detection model. Our results show large improvements in the performances of a SOTA model in terms of object discovery, convergence speed and overall latent object representations, particularly for playing Atari games. Overall, we show clear benefits of integrating motion and object continuity for downstream tasks, moving beyond object representation learning based only on reconstruction. ",
    "url": "https://arxiv.org/abs/2211.09771",
    "authors": [
      "Quentin Delfosse",
      "Wolfgang Stammer",
      "Thomas Rothenbacher",
      "Dwarak Vittal",
      "Kristian Kersting"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09773",
    "title": "T-SEA: Transfer-based Self-Ensemble Attack on Object Detection",
    "abstract": "Compared to query-based black-box attacks, transfer-based black-box attacks do not require any information of the attacked models, which ensures their secrecy. However, most existing transfer-based approaches rely on ensembling multiple models to boost the attack transferability, which is time- and resource-intensive, not to mention the difficulty of obtaining diverse models on the same task. To address this limitation, in this work, we focus on the single-model transfer-based black-box attack on object detection, utilizing only one model to achieve a high-transferability adversarial attack on multiple black-box detectors. Specifically, we first make observations on the patch optimization process of the existing method and propose an enhanced attack framework by slightly adjusting its training strategies. Then, we analogize patch optimization with regular model optimization, proposing a series of self-ensemble approaches on the input data, the attacked model, and the adversarial patch to efficiently make use of the limited information and prevent the patch from overfitting. The experimental results show that the proposed framework can be applied with multiple classical base attack methods (e.g., PGD and MIM) to greatly improve the black-box transferability of the well-optimized patch on multiple mainstream detectors, meanwhile boosting white-box performance. Our code is available at https://github.com/VDIGPKU/T-SEA. ",
    "url": "https://arxiv.org/abs/2211.09773",
    "authors": [
      "Hao Huang",
      "Ziyan Chen",
      "Huanran Chen",
      "Yongtao Wang",
      "Kevin Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.09776",
    "title": "Cheeger Inequalities for Directed Graphs and Hypergraphs Using  Reweighted Eigenvalues",
    "abstract": "We derive Cheeger inequalities for directed graphs and hypergraphs using the reweighted eigenvalue approach that was recently developed for vertex expansion in undirected graphs [OZ22,KLT22,JPV22]. The goal is to develop a new spectral theory for directed graphs and an alternative spectral theory for hypergraphs. The first main result is a Cheeger inequality relating the vertex expansion $\\vec{\\psi}(G)$ of a directed graph $G$ to the vertex-capacitated maximum reweighted second eigenvalue $\\vec{\\lambda}_2^{v*}$: \\[ \\vec{\\lambda}_2^{v*} \\lesssim \\vec{\\psi}(G) \\lesssim \\sqrt{\\vec{\\lambda}_2^{v*} \\cdot \\log (\\Delta/\\vec{\\lambda}_2^{v*})}. \\] This provides a combinatorial characterization of the fastest mixing time of a directed graph by vertex expansion, and builds a new connection between reweighted eigenvalued, vertex expansion, and fastest mixing time for directed graphs. The second main result is a stronger Cheeger inequality relating the edge conductance $\\vec{\\phi}(G)$ of a directed graph $G$ to the edge-capacitated maximum reweighted second eigenvalue $\\vec{\\lambda}_2^{e*}$: \\[ \\vec{\\lambda}_2^{e*} \\lesssim \\vec{\\phi}(G) \\lesssim \\sqrt{\\vec{\\lambda}_2^{e*} \\cdot \\log (1/\\vec{\\lambda}_2^{e*})}. \\] This provides a certificate for a directed graph to be an expander and a spectral algorithm to find a sparse cut in a directed graph, playing a similar role as Cheeger's inequality in certifying graph expansion and in the spectral partitioning algorithm for undirected graphs. We also use this reweighted eigenvalue approach to derive the improved Cheeger inequality for directed graphs, and furthermore to derive several Cheeger inequalities for hypergraphs that match and improve the existing results in [Lou15,CLTZ18]. These are supporting results that this provides a unifying approach to lift the spectral theory for undirected graphs to more general settings. ",
    "url": "https://arxiv.org/abs/2211.09776",
    "authors": [
      "Lap Chi Lau",
      "Kam Chuen Tung",
      "Robert Wang"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)",
      "Machine Learning (cs.LG)",
      "Combinatorics (math.CO)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2211.09782",
    "title": "Assessing Neural Network Robustness via Adversarial Pivotal Tuning",
    "abstract": "The ability to assess the robustness of image classifiers to a diverse set of manipulations is essential to their deployment in the real world. Recently, semantic manipulations of real images have been considered for this purpose, as they may not arise using standard adversarial settings. However, such semantic manipulations are often limited to style, color or attribute changes. While expressive, these manipulations do not consider the full capacity of a pretrained generator to affect adversarial image manipulations. In this work, we aim at leveraging the full capacity of a pretrained image generator to generate highly detailed, diverse and photorealistic image manipulations. Inspired by recent GAN-based image inversion methods, we propose a method called Adversarial Pivotal Tuning (APT). APT first finds a pivot latent space input to a pretrained generator that best reconstructs an input image. It then adjusts the weights of the generator to create small, but semantic, manipulations which fool a pretrained classifier. Crucially, APT changes both the input and the weights of the pretrained generator, while preserving its expressive latent editing capability, thus allowing the use of its full capacity in creating semantic adversarial manipulations. We demonstrate that APT generates a variety of semantic image manipulations, which preserve the input image class, but which fool a variety of pretrained classifiers. We further demonstrate that classifiers trained to be robust to other robustness benchmarks, are not robust to our generated manipulations and propose an approach to improve the robustness towards our generated manipulations. Code available at: https://captaine.github.io/apt/ ",
    "url": "https://arxiv.org/abs/2211.09782",
    "authors": [
      "Peter Ebert Christensen",
      "Vésteinn Snæbjarnarson",
      "Andrea Dittadi",
      "Serge Belongie",
      "Sagie Benaim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09786",
    "title": "SE(3)-Equivariant Relational Rearrangement with Neural Descriptor Fields",
    "abstract": "We present a method for performing tasks involving spatial relations between novel object instances initialized in arbitrary poses directly from point cloud observations. Our framework provides a scalable way for specifying new tasks using only 5-10 demonstrations. Object rearrangement is formalized as the question of finding actions that configure task-relevant parts of the object in a desired alignment. This formalism is implemented in three steps: assigning a consistent local coordinate frame to the task-relevant object parts, determining the location and orientation of this coordinate frame on unseen object instances, and executing an action that brings these frames into the desired alignment. We overcome the key technical challenge of determining task-relevant local coordinate frames from a few demonstrations by developing an optimization method based on Neural Descriptor Fields (NDFs) and a single annotated 3D keypoint. An energy-based learning scheme to model the joint configuration of the objects that satisfies a desired relational task further improves performance. The method is tested on three multi-object rearrangement tasks in simulation and on a real robot. Project website, videos, and code: https://anthonysimeonov.github.io/r-ndf/ ",
    "url": "https://arxiv.org/abs/2211.09786",
    "authors": [
      "Anthony Simeonov",
      "Yilun Du",
      "Lin Yen-Chen",
      "Alberto Rodriguez",
      "Leslie Pack Kaelbling",
      "Tomas Lozano-Perez",
      "Pulkit Agrawal"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09788",
    "title": "DiffusionDet: Diffusion Model for Object Detection",
    "abstract": "We propose DiffusionDet, a new framework that formulates object detection as a denoising diffusion process from noisy boxes to object boxes. During training stage, object boxes diffuse from ground-truth boxes to random distribution, and the model learns to reverse this noising process. In inference, the model refines a set of randomly generated boxes to the output results in a progressive way. The extensive evaluations on the standard benchmarks, including MS-COCO and LVIS, show that DiffusionDet achieves favorable performance compared to previous well-established detectors. Our work brings two important findings in object detection. First, random boxes, although drastically different from pre-defined anchors or learned queries, are also effective object candidates. Second, object detection, one of the representative perception tasks, can be solved by a generative way. Our code is available at https://github.com/ShoufaChen/DiffusionDet. ",
    "url": "https://arxiv.org/abs/2211.09788",
    "authors": [
      "Shoufa Chen",
      "Peize Sun",
      "Yibing Song",
      "Ping Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.09166",
    "title": "A Two-Stage Deep Representation Learning-Based Speech Enhancement Method  Using Variational Autoencoder and Adversarial Training",
    "abstract": "This paper focuses on leveraging deep representation learning (DRL) for speech enhancement (SE). In general, the performance of the deep neural network (DNN) is heavily dependent on the learning of data representation. However, the DRL's importance is often ignored in many DNN-based SE algorithms. To obtain a higher quality enhanced speech, we propose a two-stage DRL-based SE method through adversarial training. In the first stage, we disentangle different latent variables because disentangled representations can help DNN generate a better enhanced speech. Specifically, we use the $\\beta$-variational autoencoder (VAE) algorithm to obtain the speech and noise posterior estimations and related representations from the observed signal. However, since the posteriors and representations are intractable and we can only apply a conditional assumption to estimate them, it is difficult to ensure that these estimations are always pretty accurate, which may potentially degrade the final accuracy of the signal estimation. To further improve the quality of enhanced speech, in the second stage, we introduce adversarial training to reduce the effect of the inaccurate posterior towards signal reconstruction and improve the signal estimation accuracy, making our algorithm more robust for the potentially inaccurate posterior estimations. As a result, better SE performance can be achieved. The experimental results indicate that the proposed strategy can help similar DNN-based SE algorithms achieve higher short-time objective intelligibility (STOI), perceptual evaluation of speech quality (PESQ), and scale-invariant signal-to-distortion ratio (SI-SDR) scores. Moreover, the proposed algorithm can also outperform recent competitive SE algorithms. ",
    "url": "https://arxiv.org/abs/2211.09166",
    "authors": [
      "Yang Xiang",
      "Jesper Lisby Højvang",
      "Morten Højfeldt Rasmussen",
      "Mads Græsbøll Christensen"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2211.09184",
    "title": "An Empirical Analysis of the Advantages of Finite- v.s. Infinite-Width  Bayesian Neural Networks",
    "abstract": "Comparing Bayesian neural networks (BNNs) with different widths is challenging because, as the width increases, multiple model properties change simultaneously, and, inference in the finite-width case is intractable. In this work, we empirically compare finite- and infinite-width BNNs, and provide quantitative and qualitative explanations for their performance difference. We find that when the model is mis-specified, increasing width can hurt BNN performance. In these cases, we provide evidence that finite-width BNNs generalize better partially due to the properties of their frequency spectrum that allows them to adapt under model mismatch. ",
    "url": "https://arxiv.org/abs/2211.09184",
    "authors": [
      "Jiayu Yao",
      "Yaniv Yacoby",
      "Beau Coker",
      "Weiwei Pan",
      "Finale Doshi-Velez"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09295",
    "title": "Testing for context-dependent changes in neural encoding in naturalistic  experiments",
    "abstract": "We propose a decoding-based approach to detect context effects on neural codes in longitudinal neural recording data. The approach is agnostic to how information is encoded in neural activity, and can control for a variety of possible confounding factors present in the data. We demonstrate our approach by determining whether it is possible to decode location encoding from prefrontal cortex in the mouse and, further, testing whether the encoding changes due to task engagement. ",
    "url": "https://arxiv.org/abs/2211.09295",
    "authors": [
      "Yenho Chen",
      "Carl W. Harris",
      "Xiaoyu Ma",
      "Zheng Li",
      "Francisco Pereira",
      "Charles Y.Zheng"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09462",
    "title": "RDRN: Recursively Defined Residual Network for Image Super-Resolution",
    "abstract": "Deep convolutional neural networks (CNNs) have obtained remarkable performance in single image super-resolution (SISR). However, very deep networks can suffer from training difficulty and hardly achieve further performance gain. There are two main trends to solve that problem: improving the network architecture for better propagation of features through large number of layers and designing an attention mechanism for selecting most informative features. Recent SISR solutions propose advanced attention and self-attention mechanisms. However, constructing a network to use an attention block in the most efficient way is a challenging problem. To address this issue, we propose a general recursively defined residual block (RDRB) for better feature extraction and propagation through network layers. Based on RDRB we designed recursively defined residual network (RDRN), a novel network architecture which utilizes attention blocks efficiently. Extensive experiments show that the proposed model achieves state-of-the-art results on several popular super-resolution benchmarks and outperforms previous methods by up to 0.43 dB. ",
    "url": "https://arxiv.org/abs/2211.09462",
    "authors": [
      "Alexander Panaetov",
      "Karim Elhadji Daou",
      "Igor Samenko",
      "Evgeny Tetin",
      "Ilya Ivanov"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09463",
    "title": "Why are there six degrees of separation in a social network?",
    "abstract": "A wealth of evidence shows that real world networks are endowed with the small-world property i.e., that the maximal distance between any two of their nodes scales logarithmically rather than linearly with their size. In addition, most social networks are organized so that no individual is more than six connections apart from any other, an empirical regularity known as the six degrees of separation. Why social networks have this ultra-small world organization, whereby the graph's diameter is independent of the network size over several orders of magnitude, is still unknown. Here we show that the 'six degrees of separation' are the property featured by the equilibrium state of any network where individuals weigh between their aspiration to improve their centrality and the costs incurred in forming and maintaining connections. Thus, our results show how simple evolutionary rules of the kind traditionally associated with human cooperation and altruism can also account for the emergence of one of the most intriguing attributes of social networks. ",
    "url": "https://arxiv.org/abs/2211.09463",
    "authors": [
      "Ivan Samoylenko",
      "David Aleja",
      "Eva Primo",
      "Karin Alfaro-Bittner",
      "Ekaterina Vasilyeva",
      "Kirill Kovalenko",
      "Daniil Musatov",
      "Andreii M. Raigorodskii",
      "Regino Criado",
      "Miguel Romance",
      "David Papo",
      "Matjaz Perc",
      "Baruch Barzel",
      "Stefano Boccaletti"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2211.09535",
    "title": "Proactively Predicting Dynamic 6G Link Blockages Using LiDAR and In-Band  Signatures",
    "abstract": "Line-of-sight link blockages represent a key challenge for the reliability and latency of millimeter wave (mmWave) and terahertz (THz) communication networks. To address this challenge, this paper leverages mmWave and LiDAR sensory data to provide awareness about the communication environment and proactively predict dynamic link blockages before they occur. This allows the network to make proactive decisions for hand-off/beam switching, enhancing the network reliability and latency. More specifically, this paper addresses the following key questions: (i) Can we predict a line-of-sight link blockage, before it happens, using in-band mmWave/THz signal and LiDAR sensing data? (ii) Can we also predict when this blockage will occur? (iii) Can we predict the blockage duration? And (iv) can we predict the direction of the moving blockage? For that, we develop machine learning solutions that learn special patterns of the received signal and sensory data, which we call \\textit{pre-blockage signatures}, to infer future blockages. To evaluate the proposed approaches, we build a large-scale real-world dataset that comprises co-existing LiDAR and mmWave communication measurements in outdoor vehicular scenarios. Then, we develop an efficient LiDAR data denoising algorithm that applies some pre-processing to the LiDAR data. Based on the real-world dataset, the developed approaches are shown to achieve above 95\\% accuracy in predicting blockages occurring within 100 ms and more than 80\\% prediction accuracy for blockages occurring within one second. Given this future blockage prediction capability, the paper also shows that the developed solutions can achieve an order of magnitude saving in network latency, which further highlights the potential of the developed blockage prediction solutions for wireless networks. ",
    "url": "https://arxiv.org/abs/2211.09535",
    "authors": [
      "Shunyao Wu",
      "Chaitali Chakrabarti",
      "Ahmed Alkhateeb"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2211.09591",
    "title": "Personal Privacy Protection Problems in the Digital Age",
    "abstract": "With the development of Internet technology, the issue of privacy leakage has attracted more and more attention from the public. In our daily life, mobile phone applications and identity documents that we use may bring the risk of privacy leakage, which had increasingly aroused public concern. The path of privacy protection in the digital age remains to be explored. To explore the source of this risk and how it can be reduced, we conducted this study by using personal experience, collecting data and applying the theory. ",
    "url": "https://arxiv.org/abs/2211.09591",
    "authors": [
      "Zhiheng Yi",
      "Xiaoli Chen"
    ],
    "subjectives": [
      "General Economics (econ.GN)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2211.09705",
    "title": "A Review of Deep Learning Techniques for Protein Function Prediction",
    "abstract": "Deep Learning and big data have shown tremendous success in bioinformatics and computational biology in recent years; artificial intelligence methods have also significantly contributed in the task of protein function classification. This review paper analyzes the recent developments in approaches for the task of predicting protein function using deep learning. We explain the importance of determining the protein function and why automating the following task is crucial. Then, after reviewing the widely used deep learning techniques for this task, we continue our review and highlight the emergence of the modern State of The Art (SOTA) deep learning models which have achieved groundbreaking results in the field of computer vision, natural language processing and multi-modal learning in the last few years. We hope that this review will provide a broad view of the current role and advances of deep learning in biological sciences, especially in predicting protein function tasks and encourage new researchers to contribute to this area. ",
    "url": "https://arxiv.org/abs/2211.09705",
    "authors": [
      "Divyanshu Aggarwal",
      "Yasha Hasija"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09715",
    "title": "Physics-informed neural networks for gravity currents reconstruction  from limited data",
    "abstract": "The present work investigates the use of physics-informed neural networks (PINNs) for the 3D reconstruction of unsteady gravity currents from limited data. In the PINN context, the flow fields are reconstructed by training a neural network whose objective function penalizes the mismatch between the network predictions and the observed data and embeds the underlying equations using automatic differentiation. This study relies on a high-fidelity numerical experiment of the canonical lock-exchange configuration. This allows us to benchmark quantitatively the PINNs reconstruction capabilities on several training databases that mimic state-of-the-art experimental measurement techniques for density and velocity. Notably, spatially averaged density measurements by light attenuation technique (LAT) are employed for the training procedure. An optimal experimental setup for flow reconstruction by PINNs is proposed according to two criteria : the implementation complexity and the accuracy of the inferred fields. ",
    "url": "https://arxiv.org/abs/2211.09715",
    "authors": [
      "Mickaël Delcey",
      "Yoann Cheny",
      "Sébastien Kiesgen de Richter"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09735",
    "title": "Behavior Score-Embedded Brain Encoder Network for Improved  Classification of Alzheimer Disease Using Resting State fMRI",
    "abstract": "The ability to accurately detect onset of dementia is important in the treatment of the disease. Clinically, the diagnosis of Alzheimer Disease (AD) and Mild Cognitive Impairment (MCI) patients are based on an integrated assessment of psychological tests and brain imaging such as positron emission tomography (PET) and anatomical magnetic resonance imaging (MRI). In this work using two different datasets, we propose a behavior score-embedded encoder network (BSEN) that integrates regularly adminstrated psychological tests information into the encoding procedure of representing subject's restingstate fMRI data for automatic classification tasks. BSEN is based on a 3D convolutional autoencoder structure with contrastive loss jointly optimized using behavior scores from MiniMental State Examination (MMSE) and Clinical Dementia Rating (CDR). Our proposed classification framework of using BSEN achieved an overall recognition accuracy of 59.44% (3-class classification: AD, MCI and Healthy Control), and we further extracted the most discriminative regions between healthy control (HC) and AD patients. ",
    "url": "https://arxiv.org/abs/2211.09735",
    "authors": [
      "Wan-Ting Hsieh",
      "Jeremy Lefort-Besnard",
      "Hao-Chun Yang",
      "Li-Wei Kuo",
      "Chi-Chun Lee"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.09781",
    "title": "Monitoring machine learning (ML)-based risk prediction algorithms in the  presence of confounding medical interventions",
    "abstract": "Monitoring the performance of machine learning (ML)-based risk prediction models in healthcare is complicated by the issue of confounding medical interventions (CMI): when an algorithm predicts a patient to be at high risk for an adverse event, clinicians are more likely to administer prophylactic treatment and alter the very target that the algorithm aims to predict. Ignoring CMI by monitoring only the untreated patients--whose outcomes remain unaltered--can inflate false alarm rates, because the evolution of both the model and clinician-ML interactions can induce complex dependencies in the data that violate standard assumptions. A more sophisticated approach is to explicitly account for CMI by modeling treatment propensities, but its time-varying nature makes accurate estimation difficult. Given the many sources of complexity in the data, it is important to determine situations in which a simple procedure that ignores CMI provides valid inference. Here we describe the special case of monitoring model calibration, under either the assumption of conditional exchangeability or time-constant selection bias. We introduce a new score-based cumulative sum (CUSUM) chart for monitoring in a frequentist framework and review an alternative approach using Bayesian inference. Through simulations, we investigate the benefits of combining model updating with monitoring and study when over-trust in a prediction model does (or does not) delay detection. Finally, we simulate monitoring an ML-based postoperative nausea and vomiting risk calculator during the COVID-19 pandemic. ",
    "url": "https://arxiv.org/abs/2211.09781",
    "authors": [
      "Jean Feng",
      "Alexej Gossmann",
      "Gene Pennello",
      "Nicholas Petrick",
      "Berkman Sahiner",
      "Romain Pirracchio"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2007.08284",
    "title": "Area- Efficient VLSI Implementation of Serial-In Parallel-Out Multiplier  Using Polynomial Representation in Finite Field GF(2m)",
    "abstract": " Comments: 19 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2007.08284",
    "authors": [
      "Saeideh Nabipour",
      "Gholamreza Zare Fatin",
      "Javad Javidan"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2010.15315",
    "title": "Exploring Generative Adversarial Networks for Image-to-Image Translation  in STEM Simulation",
    "abstract": " Title: Exploring Generative Adversarial Networks for Image-to-Image Translation  in STEM Simulation ",
    "url": "https://arxiv.org/abs/2010.15315",
    "authors": [
      "Nick Lawrence",
      "Mingren Shen",
      "Ruiqi Yin",
      "Cloris Feng",
      "Dane Morgan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2101.02405",
    "title": "Adaptive Group Testing on Networks with Community Structure: The  Stochastic Block Model",
    "abstract": " Comments: 27 pages, 5 figures. Presented in part at the 2021 IEEE International Symposium on Information Theory (ISIT). Restructured the paper and added new results for the noisy setting ",
    "url": "https://arxiv.org/abs/2101.02405",
    "authors": [
      "Surin Ahn",
      "Wei-Ning Chen",
      "Ayfer Ozgur"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2103.15938",
    "title": "Safe Model-based Control from Signal Temporal Logic Specifications Using  Recurrent Neural Networks",
    "abstract": " Comments: Submitted to ICRA 2023 ",
    "url": "https://arxiv.org/abs/2103.15938",
    "authors": [
      "Wenliang Liu",
      "Mirai Nishioka",
      "Calin Belta"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.01612",
    "title": "An Efficient Digital Watermarking Algorithm Based on DCT and BCH Error  Correcting Code",
    "abstract": " Title: An Efficient Digital Watermarking Algorithm Based on DCT and BCH Error  Correcting Code ",
    "url": "https://arxiv.org/abs/2108.01612",
    "authors": [
      "Saeideh Nabipour",
      "Javad Javidan",
      "Majid Khorrami",
      "Jila Azimzadeh"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2108.12722",
    "title": "Feature Extraction for Machine Learning-based Intrusion Detection in IoT  Networks",
    "abstract": " Title: Feature Extraction for Machine Learning-based Intrusion Detection in IoT  Networks ",
    "url": "https://arxiv.org/abs/2108.12722",
    "authors": [
      "Mohanad Sarhan",
      "Siamak Layeghy",
      "Nour Moustafa",
      "Marcus Gallagher",
      "Marius Portmann"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.04598",
    "title": "Self-explaining Neural Network with Concept-based Explanations for ICU  Mortality Prediction",
    "abstract": " Comments: Workshop on Interpretable ML in Healthcare at International Conference on Machine Learning (ICML 2022) ",
    "url": "https://arxiv.org/abs/2110.04598",
    "authors": [
      "Sayantan Kumar",
      "Sean C. Yu",
      "Thomas Kannampallil",
      "Zachary Abrams",
      "Andrew Michelson",
      "Philip R.O. Payne"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.12539",
    "title": "Discrete Acoustic Space for an Efficient Sampling in Neural  Text-To-Speech",
    "abstract": " Comments: 5 pages, 5 figures, accepted at IberSPEECH 2022 ",
    "url": "https://arxiv.org/abs/2110.12539",
    "authors": [
      "Marek Strelec",
      "Jonas Rohnke",
      "Antonio Bonafonte",
      "Mateusz Łajszczak",
      "Trevor Wood"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2110.14003",
    "title": "Connected greedy colourings of perfect graphs and other classes: the  good, the bad and the ugly",
    "abstract": " Comments: 9 pages, 5 figures. Some errors fixed and more details added in this version ",
    "url": "https://arxiv.org/abs/2110.14003",
    "authors": [
      "Laurent Beaudou",
      "Caroline Brosse",
      "Oscar Defrain",
      "Florent Foucaud",
      "Aurélie Lagoutte",
      "Vincent Limouzy",
      "Lucas Pastor"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2112.13567",
    "title": "Cooperative Fair Throughput Maximization in a Multi-Cluster Wireless  Powered Network",
    "abstract": " Comments: 30 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2112.13567",
    "authors": [
      "Omid Rezaei",
      "Maryam Masjedi",
      "Mohammad Mahdi Naghsh",
      "Saeed Gazor",
      "Mohammad Mahdi Nayebi"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2112.15287",
    "title": "Distributed Random Reshuffling over Networks",
    "abstract": " Comments: 20 pages, 13 figures ",
    "url": "https://arxiv.org/abs/2112.15287",
    "authors": [
      "Kun Huang",
      "Xiao Li",
      "Andre Milzarek",
      "Shi Pu",
      "Junwen Qiu"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2112.15458",
    "title": "Accurate and Real-time 3D Pedestrian Detection Using an Efficient  Attentive Pillar Network",
    "abstract": " Comments: 8 pages ",
    "url": "https://arxiv.org/abs/2112.15458",
    "authors": [
      "Duy-Tho Le",
      "Hengcan Shi",
      "Hamid Rezatofighi",
      "Jianfei Cai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.11300",
    "title": "Geo-MOEA: A Multi-Objective Evolutionary Algorithm with Geo-obfuscation  for Mobile Crowdsourcing Workers",
    "abstract": " Comments: 14 pages, 13 figures ",
    "url": "https://arxiv.org/abs/2201.11300",
    "authors": [
      "Shun Zhang",
      "Tao Zhang",
      "Zhili Chen",
      "N. Xiong"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2202.08975",
    "title": "Probing Pretrained Models of Source Code",
    "abstract": " Title: Probing Pretrained Models of Source Code ",
    "url": "https://arxiv.org/abs/2202.08975",
    "authors": [
      "Sergey Troshin",
      "Nadezhda Chirkova"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.00714",
    "title": "Subspace-Based Pilot Decontamination in User-Centric Scalable Cell-Free  Wireless Networks",
    "abstract": " Title: Subspace-Based Pilot Decontamination in User-Centric Scalable Cell-Free  Wireless Networks ",
    "url": "https://arxiv.org/abs/2203.00714",
    "authors": [
      "Fabian Göttsch",
      "Noboru Osawa",
      "Takeo Ohseki",
      "Kosuke Yamazaki",
      "Giuseppe Caire"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.11702",
    "title": "BERT-ASC: Implicit Aspect Representation Learning through  Auxiliary-Sentence Construction for Sentiment Analysis",
    "abstract": " Comments: under review ",
    "url": "https://arxiv.org/abs/2203.11702",
    "authors": [
      "Murtadha Ahmed",
      "Shengfeng Pan",
      "Jianlin Su",
      "Xinxin Cao",
      "Wenze Zhang",
      "Bo Wen",
      "Yunfeng Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.00742",
    "title": "FirmTruss Community Search in Multilayer Networks",
    "abstract": " Comments: Accepted to VLDB 2023 (PVLDB 2022) ",
    "url": "https://arxiv.org/abs/2205.00742",
    "authors": [
      "Ali Behrouz",
      "Farnoosh Hashemi",
      "Laks V.S. Lakshmanan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2205.07362",
    "title": "What is an equivariant neural network?",
    "abstract": " Comments: 8 pages, 3 figure ",
    "url": "https://arxiv.org/abs/2205.07362",
    "authors": [
      "Lek-Heng Lim",
      "Bradley J. Nelson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Representation Theory (math.RT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.09786",
    "title": "Subset Node Anomaly Tracking over Large Dynamic Graphs",
    "abstract": " Comments: 9 pages + 2 pages supplement, accepted to 2022 ACM SIGKDD Research Track - fixed one notation typo ",
    "url": "https://arxiv.org/abs/2205.09786",
    "authors": [
      "Xingzhi Guo",
      "Baojian Zhou",
      "Steven Skiena"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2205.13618",
    "title": "Phantom Sponges: Exploiting Non-Maximum Suppression to Attack Deep  Object Detectors",
    "abstract": " Title: Phantom Sponges: Exploiting Non-Maximum Suppression to Attack Deep  Object Detectors ",
    "url": "https://arxiv.org/abs/2205.13618",
    "authors": [
      "Avishag Shapira",
      "Alon Zolfi",
      "Luca Demetrio",
      "Battista Biggio",
      "Asaf Shabtai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.03348",
    "title": "Human-Robot Commensality: Bite Timing Prediction for Robot-Assisted  Feeding in Groups",
    "abstract": " Comments: 6th Conference on Robot Learning (CoRL), 2022 ",
    "url": "https://arxiv.org/abs/2207.03348",
    "authors": [
      "Jan Ondras",
      "Abrar Anwar",
      "Tong Wu",
      "Fanjun Bu",
      "Malte Jung",
      "Jorge Jose Ortiz",
      "Tapomayukh Bhattacharjee"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.06190",
    "title": "Simulation-guided Beam Search for Neural Combinatorial Optimization",
    "abstract": " Comments: Accepted at NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2207.06190",
    "authors": [
      "Jinho Choo",
      "Yeong-Dae Kwon",
      "Jihoon Kim",
      "Jeongwoo Jae",
      "André Hottung",
      "Kevin Tierney",
      "Youngjune Gwon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.07307",
    "title": "MIMO-DoAnet: Multi-channel Input and Multiple Outputs DoA Network with  Unknown Number of Sound Sources",
    "abstract": " Comments: Accepted by Interspeech 2022 ",
    "url": "https://arxiv.org/abs/2207.07307",
    "authors": [
      "Haoran Yin",
      "Meng Ge",
      "Yanjie Fu",
      "Gaoyan Zhang",
      "Longbiao Wang",
      "Lei Zhang",
      "Lin Qiu",
      "Jianwu Dang"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2207.13381",
    "title": "Look Closer to Your Enemy: Learning to Attack via Teacher-student  Mimicking",
    "abstract": " Comments: 13 pages, 8 figures, NDSS ",
    "url": "https://arxiv.org/abs/2207.13381",
    "authors": [
      "Mingjie Wang",
      "Zhiqing Tang",
      "Sirui Li",
      "Dingwen Xiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05781",
    "title": "Path-aware Siamese Graph Neural Network for Link Prediction",
    "abstract": " Comments: 5 pages, 1 figure, 3 tables, 35 references, manuscript under review ",
    "url": "https://arxiv.org/abs/2208.05781",
    "authors": [
      "Jingsong Lv",
      "Zhao Li",
      "Hongyang Chen",
      "Yao Qi",
      "Chunqi Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.07180",
    "title": "Open Challenges in Synthetic Speech Detection",
    "abstract": " Comments: To appear in: IEEE International Workshop on Information Forensics and Security (WIFS), December 12-16, 2022, Shanghai, China ",
    "url": "https://arxiv.org/abs/2209.07180",
    "authors": [
      "Luca Cuccovillo",
      "Christoforos Papastergiopoulos",
      "Anastasios Vafeiadis",
      "Artem Yaroshchuk",
      "Patrick Aichroth",
      "Konstantinos Votis",
      "Dimitrios Tzovaras"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2209.07819",
    "title": "Self-Supervised Learning of Phenotypic Representations from Cell Images  with Weak Labels",
    "abstract": " Title: Self-Supervised Learning of Phenotypic Representations from Cell Images  with Weak Labels ",
    "url": "https://arxiv.org/abs/2209.07819",
    "authors": [
      "Jan Oscar Cross-Zamirski",
      "Guy Williams",
      "Elizabeth Mouchet",
      "Carola-Bibiane Schönlieb",
      "Riku Turkki",
      "Yinhai Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.10729",
    "title": "Fair Robust Active Learning by Joint Inconsistency",
    "abstract": " Comments: 11 pages, 2 figures, 8 tables ",
    "url": "https://arxiv.org/abs/2209.10729",
    "authors": [
      "Tsung-Han Wu",
      "Hung-Ting Su",
      "Shang-Tse Chen",
      "Winston H. Hsu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.13388",
    "title": "Efficient Fault Detection Architecture of Bit-Parallel Multiplier in  Polynomial Basis of GF(2m) Using BCH Code",
    "abstract": " Comments: 8 pages, 4 Figures, 3 Tables ",
    "url": "https://arxiv.org/abs/2209.13388",
    "authors": [
      "Saeideh Nabipour",
      "Javad Javidan",
      "Gholamreza Zare Fatin"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2210.04022",
    "title": "Speeding up the solution of the Site and Power Assignment Problem in  Wireless Networks",
    "abstract": " Title: Speeding up the solution of the Site and Power Assignment Problem in  Wireless Networks ",
    "url": "https://arxiv.org/abs/2210.04022",
    "authors": [
      "Pasquale Avella",
      "Alice Calamita",
      "Laura Palagi"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2210.14404",
    "title": "Adaptive Test-Time Defense with the Manifold Hypothesis",
    "abstract": " Title: Adaptive Test-Time Defense with the Manifold Hypothesis ",
    "url": "https://arxiv.org/abs/2210.14404",
    "authors": [
      "Zhaoyuan Yang",
      "Zhiwei Xu",
      "Jing Zhang",
      "Richard Hartley",
      "Peter Tu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.14698",
    "title": "Autoregressive Structured Prediction with Language Models",
    "abstract": " Comments: EMNLP 2022 (findings) ",
    "url": "https://arxiv.org/abs/2210.14698",
    "authors": [
      "Tianyu Liu",
      "Yuchen Jiang",
      "Nicholas Monath",
      "Ryan Cotterell",
      "Mrinmaya Sachan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.16478",
    "title": "GPA-Net:No-Reference Point Cloud Quality Assessment with Multi-task  Graph Convolutional Network",
    "abstract": " Title: GPA-Net:No-Reference Point Cloud Quality Assessment with Multi-task  Graph Convolutional Network ",
    "url": "https://arxiv.org/abs/2210.16478",
    "authors": [
      "Ziyu Shan",
      "Qi Yang",
      "Rui Ye",
      "Yujie Zhang",
      "Yiling Xu",
      "Xiaozhong Xu",
      "Shan Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2210.16622",
    "title": "Discriminative Speaker Representation via Contrastive Learning with  Class-Aware Attention in Angular Space",
    "abstract": " Comments: Submitted to ICASSP 2023, 5 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2210.16622",
    "authors": [
      "Zhe Li",
      "Man-Wai Mak",
      "Helen Mei-Ling Meng"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2210.16636",
    "title": "Speaker Representation Learning via Contrastive Loss with Maximal  Speaker Separability",
    "abstract": " Comments: Accept by APSIPA ASC 2022, 6 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2210.16636",
    "authors": [
      "Zhe Li",
      "Man-Wai Mak"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2211.00266",
    "title": "Two Low-complexity Efficient Beamformers for IRS-aided Directional  Modulation Networks",
    "abstract": " Title: Two Low-complexity Efficient Beamformers for IRS-aided Directional  Modulation Networks ",
    "url": "https://arxiv.org/abs/2211.00266",
    "authors": [
      "Yeqing Lin",
      "Jing Liu",
      "Rongen Dong",
      "Xun Chen",
      "Yue Wu",
      "Feng Shu",
      "Jiangzhou Wang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2211.00577",
    "title": "Fine-tuned Generative Adversarial Network-based Model for Medical Images  Super-Resolution",
    "abstract": " Title: Fine-tuned Generative Adversarial Network-based Model for Medical Images  Super-Resolution ",
    "url": "https://arxiv.org/abs/2211.00577",
    "authors": [
      "Alireza Aghelan",
      "Modjtaba Rouhani"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.02888",
    "title": "Pitfalls of Climate Network Construction: A Statistical Perspective",
    "abstract": " Title: Pitfalls of Climate Network Construction: A Statistical Perspective ",
    "url": "https://arxiv.org/abs/2211.02888",
    "authors": [
      "Moritz Haas",
      "Bedartha Goswami",
      "Ulrike von Luxburg"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2211.03627",
    "title": "A Deep Double Ritz Method (D$^2$RM) for solving Partial Differential  Equations using Neural Networks",
    "abstract": " Comments: 26 pages ",
    "url": "https://arxiv.org/abs/2211.03627",
    "authors": [
      "Carlos Uriarte",
      "David Pardo",
      "Ignacio Muga",
      "Judit Muñoz-Matute"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.06689",
    "title": "TINC: Tree-structured Implicit Neural Compression",
    "abstract": " Title: TINC: Tree-structured Implicit Neural Compression ",
    "url": "https://arxiv.org/abs/2211.06689",
    "authors": [
      "Runzhao Yang",
      "Tingxiong Xiao",
      "Yuxiao Cheng",
      "Jinli Suo",
      "Qionghai Dai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.06816",
    "title": "Long-Range Zero-Shot Generative Deep Network Quantization",
    "abstract": " Title: Long-Range Zero-Shot Generative Deep Network Quantization ",
    "url": "https://arxiv.org/abs/2211.06816",
    "authors": [
      "Yan Luo",
      "Yangcheng Gao",
      "Zhao Zhang",
      "Haijun Zhang",
      "Mingliang Xu",
      "Meng Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.07814",
    "title": "Extending the Neural Additive Model for Survival Analysis with EHR Data",
    "abstract": " Comments: Extended Abstract presented at Machine Learning for Health (ML4H) symposium 2022, November 28th, 2022, New Orleans, United States & Virtual, this http URL, 14 pages ",
    "url": "https://arxiv.org/abs/2211.07814",
    "authors": [
      "Matthew Peroni",
      "Marharyta Kurban",
      "Sun Young Yang",
      "Young Sun Kim",
      "Hae Yeon Kang",
      "Ji Hyun Song"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.08029",
    "title": "Persian Emotion Detection using ParsBERT and Imbalanced Data Handling  Approaches",
    "abstract": " Comments: 14 pages, 5 figures, 9 tables ",
    "url": "https://arxiv.org/abs/2211.08029",
    "authors": [
      "Amirhossein Abaskohi",
      "Nazanin Sabri",
      "Behnam Bahrak"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2211.08407",
    "title": "Trust-Awareness to Secure Swarm Intelligence from Data Injection Attack",
    "abstract": " Comments: Submitted to ICC 2023 ",
    "url": "https://arxiv.org/abs/2211.08407",
    "authors": [
      "Bin Han",
      "Dennis Krummacker",
      "Qiuheng Zhou",
      "Hans D. Schotten"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2211.08447",
    "title": "SexWEs: Domain-Aware Word Embeddings via Cross-lingual Semantic  Specialisation for Chinese Sexism Detection in Social Media",
    "abstract": " Comments: accepted at ICWSM 2023 ",
    "url": "https://arxiv.org/abs/2211.08447",
    "authors": [
      "Aiqi Jiang",
      "Arkaitz Zubiaga"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  }
]