[
  {
    "id": "arXiv:2108.10365",
    "title": "L1-regularized neural ranking for risk stratification and its  application to prediction of time to distant metastasis in luminal node  negative chemotherapy naïve breast cancer patients",
    "abstract": "Can we predict if an early stage cancer patient is at high risk of developing distant metastasis and what clinicopathological factors are associated with such a risk? In this paper, we propose a ranking based censoring-aware machine learning model for answering such questions. The proposed model is able to generate an interpretable formula for risk stratifi-cation using a minimal number of clinicopathological covariates through L1-regulrization. Using this approach, we analyze the association of time to distant metastasis (TTDM) with various clinical parameters for early stage, luminal (ER+ or HER2-) breast cancer patients who received endocrine therapy but no chemotherapy (n = 728). The TTDM risk stratification formula obtained using the proposed approach is primarily based on mitotic score, histolog-ical tumor type and lymphovascular invasion. These findings corroborate with the known role of these covariates in increased risk for distant metastasis. Our analysis shows that the proposed risk stratification formula can discriminate between cases with high and low risk of distant metastasis (p-value < 0.005) and can also rank cases based on their time to distant metastasis with a concordance-index of 0.73. ",
    "url": "https://arxiv.org/abs/2108.10365",
    "authors": [
      "Fayyaz Minhas",
      "Michael S. Toss",
      "Noor ul Wahab",
      "Emad Rakha",
      "Nasir M. Rajpoot"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2108.10398",
    "title": "Approximation and parameterized algorithms to find balanced connected  partitions of graphs",
    "abstract": "Partitioning a connected graph into $k$~vertex-disjoint connected subgraphs of similar (or given) orders is a classical problem that has been intensively investigated since late seventies. Given a connected graph $G=(V,E)$ and a weight function $w : V \\to \\mathbb{Q}_\\geq$, a connected $k$-partition of $G$ is a partition of $V$ such that each class induces a connected subgraph. The balanced connected $k$-partition problem consists in finding a connected $k$-partition in which every class has roughly the same weight. To model this concept of balance, one may seek connected $k$-partitions that either maximize the weight of a lightest class $(\\text{max-min BCP}_k)$ or minimize the weight of a heaviest class $(\\text{min-max BCP}_k)$. Such problems are equivalent when $k=2$, but they are different when $k\\geq 3$. In this work, we propose a simple pseudo-polynomial $\\frac{k}{2}$-approximation algorithm for $\\text{min-max BCP}_k$ which runs in time $\\mathcal{O}(W|V||E|)$, where $W = \\sum_{v \\in V} w(v)$. Based on this algorithm and using a scaling technique, we design a (polynomial) $(\\frac{k}{2} +\\varepsilon)$-approximation for the same problem with running-time $\\mathcal{O}(|V|^3|E|/\\varepsilon)$, for any fixed $\\varepsilon>0$. Additionally, we propose a fixed-parameter tractable algorithm based on integer linear programming for the unweighted $\\text{max-min BCP}_k$ parameterized by the size of a vertex cover. ",
    "url": "https://arxiv.org/abs/2108.10398",
    "authors": [
      "Phablo F. S. Moura",
      "Matheus J. Ota",
      "Yoshiko Wakabayashi"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2108.10682",
    "title": "Hybrid deep learning methods for phenotype prediction from clinical  notes",
    "abstract": "Identifying patient cohorts from clinical notes in secondary electronic health records is a fundamental task in clinical information management. The patient cohort identification needs to identify the patient phenotypes. However, with the growing number of clinical notes, it becomes challenging to analyze the data manually. Therefore, automatic extraction of clinical concepts would be an essential task to identify the patient phenotypes correctly. This paper proposes a novel hybrid model for automatically extracting patient phenotypes using natural language processing and deep learning models to determine the patient phenotypes without dictionaries and human intervention. The proposed hybrid model is based on a neural bidirectional sequence model (BiLSTM or BiGRU) and a Convolutional Neural Network (CNN) for identifying patient's phenotypes in discharge reports. Furthermore, to extract more features related to each phenotype, an extra CNN layer is run parallel to the hybrid proposed model. We used pre-trained embeddings such as FastText and Word2vec separately as the input layers to evaluate other embedding's performance in identifying patient phenotypes. We also measured the effect of applying additional data cleaning steps on discharge reports to identify patient phenotypes by deep learning models. We used discharge reports in the Medical Information Mart for Intensive Care III (MIMIC III) database. Experimental results in internal comparison demonstrate significant performance improvement over existing models. The enhanced model with an extra CNN layer obtained a relatively higher F1-score than the original hybrid model. ",
    "url": "https://arxiv.org/abs/2108.10682",
    "authors": [
      "Sahar Khalafi",
      "Nasser Ghadiri",
      "Milad Moradi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2108.10819",
    "title": "Next-generation perception system for automated defects detection in  composite laminates via polarized computational imaging",
    "abstract": "Finishing operations on large-scale composite components like wind turbine blades, including trimming and sanding, often require multiple workers and part repositioning. In the composites manufacturing industry, automation of such processes is challenging, as manufactured part geometry may be inconsistent and task completion is based on human judgment and experience. Implementing a mobile, collaborative robotic system capable of performing finishing tasks in dynamic and uncertain environments would improve quality and lower manufacturing costs. To complete the given tasks, the collaborative robotic team must properly understand the environment and detect irregularities in the manufactured parts. In this paper, we describe the initial implementation and demonstration of a polarized computational imaging system to identify defects in composite laminates. As the polarimetric images are highly relevant to the surface micro-geometry, they can be used to detect surface defects that are not visible in conventional color images. The proposed vision system successfully identifies defect types and surface characteristics (e.g., pinholes, voids, scratches, resin flash) for different glass fiber and carbon fiber laminates. ",
    "url": "https://arxiv.org/abs/2108.10819",
    "authors": [
      "Yuqi Ding",
      "Jinwei Ye",
      "Corina Barbalata",
      "James Oubre",
      "Chandler Lemoine",
      "Jacob Agostinho",
      "Genevieve Palardy"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.10879",
    "title": "Are socially-aware trajectory prediction models really socially-aware?",
    "abstract": "Our field has recently witnessed an arms race of neural network-based trajectory predictors. While these predictors are at the core of many applications such as autonomous navigation or pedestrian flow simulations, their adversarial robustness has not been carefully studied. In this paper, we introduce a socially-attended attack to assess the social understanding of prediction models in terms of collision avoidance. An attack is a small yet carefully-crafted perturbations to fail predictors. Technically, we define collision as a failure mode of the output, and propose hard- and soft-attention mechanisms to guide our attack. Thanks to our attack, we shed light on the limitations of the current models in terms of their social understanding. We demonstrate the strengths of our method on the recent trajectory prediction models. Finally, we show that our attack can be employed to increase the social understanding of state-of-the-art models. The code is available online: https://s-attack.github.io/ ",
    "url": "https://arxiv.org/abs/2108.10879",
    "authors": [
      "Saeed Saadatnejad",
      "Mohammadhossein Bahari",
      "Pedram Khorsandi",
      "Mohammad Saneian",
      "Seyed-Mohsen Moosavi-Dezfooli",
      "Alexandre Alahi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.10550",
    "title": "A generative adversarial approach to facilitate archival-quality  histopathologic diagnoses from frozen tissue sections",
    "abstract": "In clinical diagnostics and research involving histopathology, formalin fixed paraffin embedded (FFPE) tissue is almost universally favored for its superb image quality. However, tissue processing time (more than 24 hours) can slow decision-making. In contrast, fresh frozen (FF) processing (less than 1 hour) can yield rapid information but diagnostic accuracy is suboptimal due to lack of clearing, morphologic deformation and more frequent artifacts. Here, we bridge this gap using artificial intelligence. We synthesize FFPE-like images ,virtual FFPE, from FF images using a generative adversarial network (GAN) from 98 paired kidney samples derived from 40 patients. Five board-certified pathologists evaluated the results in a blinded test. Image quality of the virtual FFPE data was assessed to be high and showed a close resemblance to real FFPE images. Clinical assessments of disease on the virtual FFPE images showed a higher inter-observer agreement compared to FF images. The nearly instantaneously generated virtual FFPE images can not only reduce time to information but can facilitate more precise diagnosis from routine FF images without extraneous costs and effort. ",
    "url": "https://arxiv.org/abs/2108.10550",
    "authors": [
      "Kianoush Falahkheirkhah",
      "Tao Guo",
      "Michael Hwang",
      "Pheroze Tamboli",
      "Christopher G Wood",
      "Jose A Karam",
      "Kanishka Sircar",
      "Rohit Bhargava"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2108.10639",
    "title": "GrADE: A graph based data-driven solver for time-dependent nonlinear  partial differential equations",
    "abstract": "The physical world is governed by the laws of physics, often represented in form of nonlinear partial differential equations (PDEs). Unfortunately, solution of PDEs is non-trivial and often involves significant computational time. With recent developments in the field of artificial intelligence and machine learning, the solution of PDEs using neural network has emerged as a domain with huge potential. However, most of the developments in this field are based on either fully connected neural networks (FNN) or convolutional neural networks (CNN). While FNN is computationally inefficient as the number of network parameters can be potentially huge, CNN necessitates regular grid and simpler domain. In this work, we propose a novel framework referred to as the Graph Attention Differential Equation (GrADE) for solving time dependent nonlinear PDEs. The proposed approach couples FNN, graph neural network, and recently developed Neural ODE framework. The primary idea is to use graph neural network for modeling the spatial domain, and Neural ODE for modeling the temporal domain. The attention mechanism identifies important inputs/features and assign more weightage to the same; this enhances the performance of the proposed framework. Neural ODE, on the other hand, results in constant memory cost and allows trading of numerical precision for speed. We also propose depth refinement as an effective technique for training the proposed architecture in lesser time with better accuracy. The effectiveness of the proposed framework is illustrated using 1D and 2D Burgers' equations. Results obtained illustrate the capability of the proposed framework in modeling PDE and its scalability to larger domains without the need for retraining. ",
    "url": "https://arxiv.org/abs/2108.10639",
    "authors": [
      "Yash Kumar",
      "Souvik Chakraborty"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2008.02672",
    "title": "MFNets: Data efficient all-at-once learning of multifidelity surrogates  as directed networks of information sources",
    "abstract": " Comments: 24 pages ",
    "url": "https://arxiv.org/abs/2008.02672",
    "authors": [
      "Alex Gorodetsky",
      "John D. Jakeman",
      "Gianluca Geraci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2103.01830",
    "title": "Audio scene monitoring using redundant ad-hoc microphone array networks",
    "abstract": " Comments: IN press, IEEE Internet of Things Journal ",
    "url": "https://arxiv.org/abs/2103.01830",
    "authors": [
      "Peter Gerstoft",
      "Yihan Hu",
      "Michael J. Bianco",
      "Chaitanya Patil",
      "Ardel Alegre",
      "Yoav Freund",
      "Francois Grondin"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2103.06685",
    "title": "Frame-independent vector-cloud neural network for nonlocal constitutive  modeling on arbitrary grids",
    "abstract": " Title: Frame-independent vector-cloud neural network for nonlocal constitutive  modeling on arbitrary grids ",
    "url": "https://arxiv.org/abs/2103.06685",
    "authors": [
      "Xu-Hui Zhou",
      "Jiequn Han",
      "Heng Xiao"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2104.11076",
    "title": "Splitting authentication codes with perfect secrecy: new results,  constructions and connections with algebraic manipulation detection codes",
    "abstract": " Title: Splitting authentication codes with perfect secrecy: new results,  constructions and connections with algebraic manipulation detection codes ",
    "url": "https://arxiv.org/abs/2104.11076",
    "authors": [
      "Maura B. Paterson",
      "Douglas R. Stinson"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2105.02225",
    "title": "Model reduction in acoustic inversion by artificial neural network",
    "abstract": " Title: Model reduction in acoustic inversion by artificial neural network ",
    "url": "https://arxiv.org/abs/2105.02225",
    "authors": [
      "Janne Koponen",
      "Timo Lähivaara",
      "Jari Kaipio",
      "Marko Vauhkonen"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)",
      "Computational Physics (physics.comp-ph)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2106.02522",
    "title": "Price graphs: Utilizing the structural information of financial time  series for stock prediction",
    "abstract": " Comments: Code and data can be accessed through this https URL ",
    "url": "https://arxiv.org/abs/2106.02522",
    "authors": [
      "Junran Wu",
      "Ke Xu",
      "Xueyuan Chen",
      "Shangzhe Li",
      "Jichang Zhao"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.12045",
    "title": "Deep learning for improved global precipitation in numerical weather  prediction systems",
    "abstract": " Title: Deep learning for improved global precipitation in numerical weather  prediction systems ",
    "url": "https://arxiv.org/abs/2106.12045",
    "authors": [
      "Manmeet Singh",
      "Bipin Kumar",
      "Suryachandra Rao",
      "Sukhpal Singh Gill",
      "Rajib Chattopadhyay",
      "Ravi S Nanjundiah",
      "Dev Niyogi"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.10510",
    "title": "Hodge theoretic reward allocation for generalized cooperative games on  graphs",
    "abstract": " Title: Hodge theoretic reward allocation for generalized cooperative games on  graphs ",
    "url": "https://arxiv.org/abs/2107.10510",
    "authors": [
      "Tongseok Lim"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Computer Science and Game Theory (cs.GT)",
      "Theoretical Economics (econ.TH)",
      "Mathematical Finance (q-fin.MF)"
    ]
  },
  {
    "id": "arXiv:2108.09598",
    "title": "SERF: Towards better training of deep neural networks using log-Softplus  ERror activation Function",
    "abstract": " Title: SERF: Towards better training of deep neural networks using log-Softplus  ERror activation Function ",
    "url": "https://arxiv.org/abs/2108.09598",
    "authors": [
      "Sayan Nag",
      "Mayukh Bhattacharyya"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2108.10103",
    "title": "Deep neural networks approach to microbial colony detection -- a  comparative analysis",
    "abstract": " Comments: 8 pages, 2 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2108.10103",
    "authors": [
      "Sylwia Majchrowska",
      "Jarosław Pawłowski",
      "Natalia Czerep",
      "Aleksander Górecki",
      "Jakub Kuciński",
      "Tomasz Golan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)",
      "Quantitative Methods (q-bio.QM)"
    ]
  }
]