[
  {
    "id": "arXiv:2107.02175",
    "title": "Identifying negativity factors from social media text corpus using  sentiment analysis method",
    "abstract": "Automatic sentiment analysis play vital role in decision making. Many organizations spend a lot of budget to understand their customer satisfaction by manually going over their feedback/comments or tweets. Automatic sentiment analysis can give overall picture of the comments received against any event, product, or activity. Usually, the comments/tweets are classified into two main classes that are negative or positive. However, the negative comments are too abstract to understand the basic reason or the context. organizations are interested to identify the exact reason for the negativity. In this research study, we hierarchically goes down into negative comments, and link them with more classes. Tweets are extracted from social media sites such as Twitter and Facebook. If the sentiment analysis classifies any tweet into negative class, then we further try to associates that negative comments with more possible negative classes. Based on expert opinions, the negative comments/tweets are further classified into 8 classes. Different machine learning algorithms are evaluated and their accuracy are reported. ",
    "url": "https://arxiv.org/abs/2107.02175",
    "authors": [
      "Mohammad Aimal",
      "Maheen Bakhtyar",
      "Junaid Baber",
      "Sadia Lakho",
      "Umar Mohammad",
      "Warda Ahmed",
      "Jahanvash Karim"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.02189",
    "title": "Label noise in segmentation networks : mitigation must deal with bias",
    "abstract": "Imperfect labels limit the quality of predictions learned by deep neural networks. This is particularly relevant in medical image segmentation, where reference annotations are difficult to collect and vary significantly even across expert annotators. Prior work on mitigating label noise focused on simple models of mostly uniform noise. In this work, we explore biased and unbiased errors artificially introduced to brain tumour annotations on MRI data. We found that supervised and semi-supervised segmentation methods are robust or fairly robust to unbiased errors but sensitive to biased errors. It is therefore important to identify the sorts of errors expected in medical image labels and especially mitigate the biased errors. ",
    "url": "https://arxiv.org/abs/2107.02189",
    "authors": [
      "Eugene Vorontsov",
      "Samuel Kadoury"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.02246",
    "title": "Experiments with adversarial attacks on text genres",
    "abstract": "Neural models based on pre-trained transformers, such as BERT or XLM-RoBERTa, demonstrate SOTA results in many NLP tasks, including non-topical classification, such as genre identification. However, often these approaches exhibit low reliability to minor alterations of the test texts. A related probelm concerns topical biases in the training corpus, for example, the prevalence of words on a specific topic in a specific genre can trick the genre classifier to recognise any text on this topic in this genre. In order to mitigate the reliability problem, this paper investigates techniques for attacking genre classifiers to understand the limitations of the transformer models and to improve their performance. While simple text attacks, such as those based on word replacement using keywords extracted by tf-idf, are not capable of deceiving powerful models like XLM-RoBERTa, we show that embedding-based algorithms which can replace some of the most ``significant'' words with words similar to them, for example, TextFooler, have the ability to influence model predictions in a significant proportion of cases. ",
    "url": "https://arxiv.org/abs/2107.02246",
    "authors": [
      "Mikhail Lepekhin",
      "Serge Sharoff"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2107.02248",
    "title": "A comparison of LSTM and GRU networks for learning symbolic sequences",
    "abstract": "We explore relations between the hyper-parameters of a recurrent neural network (RNN) and the complexity of string sequences it is able to memorize. We compare long short-term memory (LSTM) networks and gated recurrent units (GRUs). We find that an increase of RNN depth does not necessarily result in better memorization capability when the training time is constrained. Our results also indicate that the learning rate and the number of units per layer are among the most important hyper-parameters to be tuned. Generally, GRUs outperform LSTM networks on low complexity sequences while on high complexity sequences LSTMs perform better. ",
    "url": "https://arxiv.org/abs/2107.02248",
    "authors": [
      "Roberto Cahuantzi",
      "Xinye Chen",
      "Stefan Güttel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2107.02328",
    "title": "Polarized skylight orientation determination artificial neural network",
    "abstract": "This paper proposes an artificial neural network to determine orientation using polarized skylight. This neural network has specific dilated convolution, which can extract light intensity information of different polarization directions. Then, the degree of polarization (DOP) and angle of polarization (AOP) are directly extracted in the network. In addition, the exponential function encoding of orientation is designed as the network output, which can better reflect the insect's encoding of polarization information, and improve the accuracy of orientation determination. Finally, training and testing were conducted on a public polarized skylight navigation dataset, and the experimental results proved the stability and effectiveness of the network. ",
    "url": "https://arxiv.org/abs/2107.02328",
    "authors": [
      "Huaju Liang",
      "Hongyang Bai",
      "Ke Hu",
      "Xinbo Lv"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.02412",
    "title": "GBLinks: GNN-based beam selection and link activation for ultra-dense  D2D mmWave networks",
    "abstract": "Millimeter wave (mmWave) communication is regarded as a key enabled technology for the future wireless communication to satisfy the requirement of Gbps transmission rate and address the problem of spectrum shortage. Directional transmission used to combat the large pathloss of mmWave communications helps to realize the device-to-device (D2D) communication in ultra-dense networks. In this paper, we consider the problem of joint beam selection and link activation across a set of communication pairs in ultra-dense D2D mmWave networks. The resulting optimization problem is formulated as an integer programming problem that is nonconvex and NP-hard problem. Consequently, the global optimal solution, even the local optimal solution, cannot be generally obtained. To overcome this challenge, we resort to design a deep learning architecture based on graphic neural network to finish the joint beam selection and link activation, called as GBLinks model, with taking into account the network topology information. We further present an unsupervised Lagrangian dual learning framework to train the parameters of GBLinks. Numerical results show that the proposed GBLinks model can converges to a stable point with the number of iterations increases, in terms of the average sum rate. It also shows that GBLinks can reach near-optimal solution through comparing with the exhaustively search in small-scale D2D mmWave networks and outperforms selfish beam selection strategy with activating all links. ",
    "url": "https://arxiv.org/abs/2107.02412",
    "authors": [
      "S. He",
      "S. Xiong",
      "W. Zhang",
      "Y. Yang",
      "J. Ren",
      "Y. Huang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2107.02422",
    "title": "Equivariant bifurcation, quadratic equivariants, and symmetry breaking  for the standard representation of $S_n$",
    "abstract": "Motivated by questions originating from the study of a class of shallow student-teacher neural networks, methods are developed for the analysis of spurious minima in classes of gradient equivariant dynamics related to neural nets. In the symmetric case, methods depend on the generic equivariant bifurcation theory of irreducible representations of the symmetric group on $n$ symbols, $S_n$; in particular, the standard representation of $S_n$. It is shown that spurious minima do not arise from spontaneous symmetry breaking but rather through a complex deformation of the landscape geometry that can be encoded by a generic $S_n$-equivariant bifurcation. We describe minimal models for forced symmetry breaking that give a lower bound on the dynamic complexity involved in the creation of spurious minima when there is no symmetry. Results on generic bifurcation when there are quadratic equivariants are also proved; this work extends and clarifies results of Ihrig & Golubitsky and Chossat, Lauterback & Melbourne on the instability of solutions when there are quadratic equivariants. ",
    "url": "https://arxiv.org/abs/2107.02422",
    "authors": [
      "Yossi Arjevani",
      "Michael Field"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2107.02467",
    "title": "DeepDDS: deep graph neural network with attention mechanism to predict  synergistic drug combinations",
    "abstract": "Drug combination therapy has become a increasingly promising method in the treatment of cancer. However, the number of possible drug combinations is so huge that it is hard to screen synergistic drug combinations through wet-lab experiments. Therefore, computational screening has become an important way to prioritize drug combinations. Graph neural network have recently shown remarkable performance in the prediction of compound-protein interactions, but it has not been applied to the screening of drug combinations. In this paper, we proposed a deep learning model based on graph neural networks and attention mechanism to identify drug combinations that can effectively inhibit the viability of specific cancer cells. The feature embeddings of drug molecule structure and gene expression profiles were taken as input to multi-layer feedforward neural network to identify the synergistic drug combinations. We compared DeepDDS with classical machine learning methods and other deep learning-based methods on benchmark data set, and the leave-one-out experimental results showed that DeepDDS achieved better performance than competitive methods. Also, on an independent test set released by well-known pharmaceutical enterprise AstraZeneca, DeepDDS was superior to competitive methods by more than 16\\% predictive precision. Furthermore, we explored the interpretability of the graph attention network, and found the correlation matrix of atomic features revealed important chemical substructures of drugs. We believed that DeepDDS is an effective tool that prioritized synergistic drug combinations for further wet-lab experiment validation. ",
    "url": "https://arxiv.org/abs/2107.02467",
    "authors": [
      "J. Wang",
      "X. Liu",
      "S. Shen",
      "L. Deng",
      "H. Liu*"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2107.02482",
    "title": "A Knowledge graph representation of baseline characteristics for the  Dutch proton therapy research registry",
    "abstract": "Cancer registries collect multisource data and provide valuable information that can lead to unique research opportunities. In the Netherlands, a registry and model-based approach (MBA) are used for the selection of patients that are eligible for proton therapy. We collected baseline characteristics including demographic, clinical, tumour and treatment information. These data were transformed into a machine readable format using the FAIR (Findable, Accessible, Interoperable, Reusable) data principles and resulted in a knowledge graph with baseline characteristics of proton therapy patients. With this approach, we enable the possibility of linking external data sources and optimal flexibility to easily adapt the data structure of the existing knowledge graph to the needs of the clinic. ",
    "url": "https://arxiv.org/abs/2107.02482",
    "authors": [
      "Matthijs Sloep",
      "Petros Kalendralis",
      "Ananya Choudhury",
      "Lerau Seyben",
      "Jasper Snel",
      "Nibin Moni George",
      "Martijn Veening",
      "Johannes A. Langendijk",
      "Andre Dekker",
      "Johan van Soest",
      "Rianne Fijten"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2107.02496",
    "title": "Convolutional LSTM models to estimate network traffic",
    "abstract": "Network utilisation efficiency can, at least in principle, often be improved by dynamically re-configuring routing policies to better distribute on-going large data transfers. Unfortunately, the information necessary to decide on an appropriate reconfiguration - details of on-going and upcoming data transfers such as their source and destination and, most importantly, their volume and duration - is usually lacking. Fortunately, the increased use of scheduled transfer services, such as FTS, makes it possible to collect the necessary information. However, the mere detection and characterisation of larger transfers is not sufficient to predict with confidence the likelihood a network link will become overloaded. In this paper we present the use of LSTM-based models (CNN-LSTM and Conv-LSTM) to effectively estimate future network traffic and so provide a solid basis for formulating a sensible network configuration plan. ",
    "url": "https://arxiv.org/abs/2107.02496",
    "authors": [
      "Joanna Waczynska",
      "Edoardo Martelli",
      "Sofia Vallecorsa",
      "Edward Karavakis",
      "TonyCass"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2107.02550",
    "title": "The QR decomposition for radial neural networks",
    "abstract": "We provide a theoretical framework for neural networks in terms of the representation theory of quivers, thus revealing symmetries of the parameter space of neural networks. An exploitation of these symmetries leads to a model compression algorithm for radial neural networks based on an analogue of the QR decomposition. A projected version of backpropogation on the original model matches usual backpropogation on the compressed model. ",
    "url": "https://arxiv.org/abs/2107.02550",
    "authors": [
      "Iordan Ganev",
      "Robin Walters"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Representation Theory (math.RT)"
    ]
  },
  {
    "id": "arXiv:2107.02655",
    "title": "Automatic size and pose homogenization with spatial transformer network  to improve and accelerate pediatric segmentation",
    "abstract": "Due to a high heterogeneity in pose and size and to a limited number of available data, segmentation of pediatric images is challenging for deep learning methods. In this work, we propose a new CNN architecture that is pose and scale invariant thanks to the use of Spatial Transformer Network (STN). Our architecture is composed of three sequential modules that are estimated together during training: (i) a regression module to estimate a similarity matrix to normalize the input image to a reference one; (ii) a differentiable module to find the region of interest to segment; (iii) a segmentation module, based on the popular UNet architecture, to delineate the object. Unlike the original UNet, which strives to learn a complex mapping, including pose and scale variations, from a finite training dataset, our segmentation module learns a simpler mapping focusing on images with normalized pose and size. Furthermore, the use of an automatic bounding box detection through STN allows saving time and especially memory, while keeping similar performance. We test the proposed method in kidney and renal tumor segmentation on abdominal pediatric CT scanners. Results indicate that the estimated STN homogenization of size and pose accelerates the segmentation (25h), compared to standard data-augmentation (33h), while obtaining a similar quality for the kidney (88.01\\% of Dice score) and improving the renal tumor delineation (from 85.52\\% to 87.12\\%). ",
    "url": "https://arxiv.org/abs/2107.02655",
    "authors": [
      "Giammarco La Barbera",
      "Pietro Gori",
      "Haithem Boussaid",
      "Bruno Belucci",
      "Alessandro Delmonte",
      "Jeanne Goulin",
      "Sabine Sarnacki",
      "Laurence Rouet",
      "Isabelle Bloch"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.02693",
    "title": "Remote sensing, AI and innovative prediction methods for adapting cities  to the impacts of the climate change",
    "abstract": "Urban areas are not only one of the biggest contributors to climate change, but also they are one of the most vulnerable areas with high populations who would together experience the negative impacts. In this paper, I address some of the opportunities brought by satellite remote sensing imaging and artificial intelligence (AI) in order to measure climate adaptation of cities automatically. I propose an AI-based framework which might be useful for extracting indicators from remote sensing images and might help with predictive estimation of future states of these climate adaptation related indicators. When such models become more robust and used in real-life applications, they might help decision makers and early responders to choose the best actions to sustain the wellbeing of society, natural resources and biodiversity. I underline that this is an open field and an ongoing research for many scientists, therefore I offer an in depth discussion on the challenges and limitations of AI-based methods and the predictive estimation models in general. ",
    "url": "https://arxiv.org/abs/2107.02693",
    "authors": [
      "Beril Sirmacek"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.02713",
    "title": "Predicate correlation learning for scene graph generation",
    "abstract": "For a typical Scene Graph Generation (SGG) method, there is often a large gap in the performance of the predicates' head classes and tail classes. This phenomenon is mainly caused by the semantic overlap between different predicates as well as the long-tailed data distribution. In this paper, a Predicate Correlation Learning (PCL) method for SGG is proposed to address the above two problems by taking the correlation between predicates into consideration. To describe the semantic overlap between strong-correlated predicate classes, a Predicate Correlation Matrix (PCM) is defined to quantify the relationship between predicate pairs, which is dynamically updated to remove the matrix's long-tailed bias. In addition, PCM is integrated into a Predicate Correlation Loss function ($L_{PC}$) to reduce discouraging gradients of unannotated classes. The proposed method is evaluated on Visual Genome benchmark, where the performance of the tail classes is significantly improved when built on the existing methods. ",
    "url": "https://arxiv.org/abs/2107.02713",
    "authors": [
      "Leitian Tao",
      "Li Mi",
      "Nannan Li",
      "Xianhang Cheng",
      "Yaosi Hu",
      "Zhenzhong Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.02784",
    "title": "Data-driven reduced order modeling of environmental hydrodynamics using  deep autoencoders and neural ODEs",
    "abstract": "Model reduction for fluid flow simulation continues to be of great interest across a number of scientific and engineering fields. In a previous work [arXiv:2104.13962], we explored the use of Neural Ordinary Differential Equations (NODE) as a non-intrusive method for propagating the latent-space dynamics in reduced order models. Here, we investigate employing deep autoencoders for discovering the reduced basis representation, the dynamics of which are then approximated by NODE. The ability of deep autoencoders to represent the latent-space is compared to the traditional proper orthogonal decomposition (POD) approach, again in conjunction with NODE for capturing the dynamics. Additionally, we compare their behavior with two classical non-intrusive methods based on POD and radial basis function interpolation as well as dynamic mode decomposition. The test problems we consider include incompressible flow around a cylinder as well as a real-world application of shallow water hydrodynamics in an estuarine system. Our findings indicate that deep autoencoders can leverage nonlinear manifold learning to achieve a highly efficient compression of spatial information and define a latent-space that appears to be more suitable for capturing the temporal dynamics through the NODE framework. ",
    "url": "https://arxiv.org/abs/2107.02784",
    "authors": [
      "Sourav Dutta",
      "Peter Rivera-Casillas",
      "Orie M. Cecil",
      "Matthew W. Farthing",
      "Emma Perracchione",
      "Mario Putti"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.02338",
    "title": "Impact of deep learning-based image super-resolution on binary signal  detection",
    "abstract": "Deep learning-based image super-resolution (DL-SR) has shown great promise in medical imaging applications. To date, most of the proposed methods for DL-SR have only been assessed by use of traditional measures of image quality (IQ) that are commonly employed in the field of computer vision. However, the impact of these methods on objective measures of image quality that are relevant to medical imaging tasks remains largely unexplored. In this study, we investigate the impact of DL-SR methods on binary signal detection performance. Two popular DL-SR methods, the super-resolution convolutional neural network (SRCNN) and the super-resolution generative adversarial network (SRGAN), were trained by use of simulated medical image data. Binary signal-known-exactly with background-known-statistically (SKE/BKS) and signal-known-statistically with background-known-statistically (SKS/BKS) detection tasks were formulated. Numerical observers, which included a neural network-approximated ideal observer and common linear numerical observers, were employed to assess the impact of DL-SR on task performance. The impact of the complexity of the DL-SR network architectures on task-performance was quantified. In addition, the utility of DL-SR for improving the task-performance of sub-optimal observers was investigated. Our numerical experiments confirmed that, as expected, DL-SR could improve traditional measures of IQ. However, for many of the study designs considered, the DL-SR methods provided little or no improvement in task performance and could even degrade it. It was observed that DL-SR could improve the task-performance of sub-optimal observers under certain conditions. The presented study highlights the urgent need for the objective assessment of DL-SR methods and suggests avenues for improving their efficacy in medical imaging applications. ",
    "url": "https://arxiv.org/abs/2107.02338",
    "authors": [
      "Xiaohui Zhang",
      "Varun A. Kelkar",
      "Jason Granstedt",
      "Hua Li",
      "Mark A. Anastasio"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2107.02476",
    "title": "A new smart-cropping pipeline for prostate segmentation using deep  learning networks",
    "abstract": "Prostate segmentation from magnetic resonance imaging (MRI) is a challenging task. In recent years, several network architectures have been proposed to automate this process and alleviate the burden of manual annotation. Although the performance of these models has achieved promising results, there is still room for improvement before these models can be used safely and effectively in clinical practice. One of the major challenges in prostate MR image segmentation is the presence of class imbalance in the image labels where the background pixels dominate over the prostate. In the present work we propose a DL-based pipeline for cropping the region around the prostate from MRI images to produce a more balanced distribution of the foreground pixels (prostate) and the background pixels and improve segmentation accuracy. The effect of DL-cropping for improving the segmentation performance compared to standard center-cropping is assessed using five popular DL networks for prostate segmentation, namely U-net, U-net+, Res Unet++, Bridge U-net and Dense U-net. The proposed smart-cropping outperformed the standard center cropping in terms of segmentation accuracy for all the evaluated prostate segmentation networks. In terms of Dice score, the highest improvement was achieved for the U-net+ and ResU-net++ architectures corresponding to 8.9% and 8%, respectively. ",
    "url": "https://arxiv.org/abs/2107.02476",
    "authors": [
      "Dimitrios G. Zaridis",
      "Eugenia Mylona",
      "Nikolaos S. Tachos",
      "Kostas Marias",
      "Nikolaos Papanikolaou",
      "Manolis Tsiknakis",
      "Dimitrios I. Fotiadis"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.02683",
    "title": "Normal and stable approximation to subgraph counts in superpositions of  Bernoulli random graphs",
    "abstract": "The clustering property of a complex network signals about the abundance of small dense subgraphs in otherwise sparse network. We establish the normal and stable approximation to the number of small cliques, cycles and more general $2$-connected subgraphs in the network model defined by a superposition of Bernoulli random graphs that admits non-vanishing global clustering coefficient and power law degrees. ",
    "url": "https://arxiv.org/abs/2107.02683",
    "authors": [
      "Mindaugas Bloznelis",
      "Joona Karjalainen",
      "Lasse Leskelä"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Social and Information Networks (cs.SI)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2107.02720",
    "title": "Lexical Access Model for Italian -- Modeling human speech processing:  identification of words in running speech toward lexical access based on the  detection of landmarks and other acoustic cues to features",
    "abstract": "Modelling the process that a listener actuates in deriving the words intended by a speaker requires setting a hypothesis on how lexical items are stored in memory. This work aims at developing a system that imitates humans when identifying words in running speech and, in this way, provide a framework to better understand human speech processing. We build a speech recognizer for Italian based on the principles of Stevens' model of Lexical Access in which words are stored as hierarchical arrangements of distinctive features (Stevens, K. N. (2002). \"Toward a model for lexical access based on acoustic landmarks and distinctive features,\" J. Acoust. Soc. Am., 111(4):1872-1891). Over the past few decades, the Speech Communication Group at the Massachusetts Institute of Technology (MIT) developed a speech recognition system for English based on this approach. Italian will be the first language beyond English to be explored; the extension to another language provides the opportunity to test the hypothesis that words are represented in memory as a set of hierarchically-arranged distinctive features, and reveal which of the underlying mechanisms may have a language-independent nature. This paper also introduces a new Lexical Access corpus, the LaMIT database, created and labeled specifically for this work, that will be provided freely to the speech research community. Future developments will test the hypothesis that specific acoustic discontinuities - called landmarks - that serve as cues to features, are language independent, while other cues may be language-dependent, with powerful implications for understanding how the human brain recognizes speech. ",
    "url": "https://arxiv.org/abs/2107.02720",
    "authors": [
      "Maria-Gabriella Di Benedetto",
      "Stefanie Shattuck-Hufnagel",
      "Jeung-Yoon Choi",
      "Luca De Nardis",
      "Javier Arango",
      "Ian Chan",
      "Alec DeCaprio"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2001.04026",
    "title": "Fractional order graph neural network",
    "abstract": " Comments: There are serious mistakes in the article and it needs to be retracted and corrected ",
    "url": "https://arxiv.org/abs/2001.04026",
    "authors": [
      "Zijian Liu",
      "Chunbo Luo",
      "Shuai Li",
      "Peng Ren",
      "Geyong Min"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2007.05352",
    "title": "Multi-Emitter MAP-Elites: Improving quality, diversity and convergence  speed with heterogeneous sets of emitters",
    "abstract": " Title: Multi-Emitter MAP-Elites: Improving quality, diversity and convergence  speed with heterogeneous sets of emitters ",
    "url": "https://arxiv.org/abs/2007.05352",
    "authors": [
      "Antoine Cully"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2010.11546",
    "title": "Simulating systematic bias in attributed social networks and its effect  on rankings of minority nodes",
    "abstract": " Title: Simulating systematic bias in attributed social networks and its effect  on rankings of minority nodes ",
    "url": "https://arxiv.org/abs/2010.11546",
    "authors": [
      "Felix I. Stamm",
      "Leonie Neuhäuser",
      "Florian Lemmerich",
      "Michael T. Schaub",
      "Markus Strohmaier"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2012.08508",
    "title": "Attention over learned object embeddings enables complex visual  reasoning",
    "abstract": " Comments: 22 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2012.08508",
    "authors": [
      "David Ding",
      "Felix Hill",
      "Adam Santoro",
      "Malcolm Reynolds",
      "Matt Botvinick"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2102.03117",
    "title": "Twin-width IV: ordered graphs and matrices",
    "abstract": " Comments: 53 pages, 18 figures ",
    "url": "https://arxiv.org/abs/2102.03117",
    "authors": [
      "Édouard Bonnet",
      "Ugo Giocanti",
      "Patrice Ossona de Mendez",
      "Pierre Simon",
      "Stéphan Thomassé",
      "Szymon Toruńczyk"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2102.12071",
    "title": "Learning optimal multigrid smoothers via neural networks",
    "abstract": " Title: Learning optimal multigrid smoothers via neural networks ",
    "url": "https://arxiv.org/abs/2102.12071",
    "authors": [
      "Ru Huang",
      "Ruipeng Li",
      "Yuanzhe Xi"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.03006",
    "title": "Data-driven distributionally robust MPC for constrained stochastic  systems",
    "abstract": " Title: Data-driven distributionally robust MPC for constrained stochastic  systems ",
    "url": "https://arxiv.org/abs/2103.03006",
    "authors": [
      "Peter Coppens",
      "Panagiotis Patrinos"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2103.16804",
    "title": "TS-RIR: Translated synthetic room impulse responses for speech  augmentation",
    "abstract": " Title: TS-RIR: Translated synthetic room impulse responses for speech  augmentation ",
    "url": "https://arxiv.org/abs/2103.16804",
    "authors": [
      "Anton Ratnarajah",
      "Zhenyu Tang",
      "Dinesh Manocha"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2105.05495",
    "title": "LipBaB: Computing exact Lipschitz constant of ReLU networks",
    "abstract": " Title: LipBaB: Computing exact Lipschitz constant of ReLU networks ",
    "url": "https://arxiv.org/abs/2105.05495",
    "authors": [
      "Aritra Bhowmick",
      "Meenakshi D'Souza",
      "G. Srinivasa Raghavan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2106.16009",
    "title": "MissFormer: (In-)attention-based handling of missing observations for  trajectory filtering and prediction",
    "abstract": " Title: MissFormer: (In-)attention-based handling of missing observations for  trajectory filtering and prediction ",
    "url": "https://arxiv.org/abs/2106.16009",
    "authors": [
      "Stefan Becker",
      "Ronny Hug",
      "Wolfgang Hübner",
      "Michael Arens",
      "Brendan T. Morris"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.01651",
    "title": "The hidden dependence of spreading vulnerability on topological  complexity",
    "abstract": " Title: The hidden dependence of spreading vulnerability on topological  complexity ",
    "url": "https://arxiv.org/abs/2107.01651",
    "authors": [
      "Mark M. Dekker",
      "Raoul D. Schram",
      "Jiamin Ou",
      "Debabrata Panja"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  }
]