[
  {
    "id": "arXiv:2205.02851",
    "title": "Computing Traffic Accident High-Risk Locations Using Graph Analytics",
    "abstract": "Analysis of the dynamic relationship between traffic accident events and road network topology based on connectivity and graph analytics offers a new approach to identifying, ranking and profiling traffic accident high risk-locations at different levels of space and time granularities. Previous studies on traffic accident hot spots have mostly adopted spatial statistics and Geographic Information Systems (GIS) where spatial point patterns are discovered based only on spatial dependence with no recognition of the temporal dependence of the events. A limitation arises from the fact that the results are either under or over-estimated because of the temporal aggregation of the events to an absolute time point. Furthermore, the existing methods apart from the Network Kernel Density Estimation (NETKDE), consider traffic accident events as events randomly on a 2-D geographic space. However, traffic accident events are network constrained events that happens majorly on the road network space. Therefore, in this paper, we adopt the connectivity of graph on a network space approach that identifies accident high risk-locations based on space-time-varying connectivity between traffic accident events and the road network geometry. A simple but extensible traffic accident space time-varying graph (STVG) model is developed and implemented for this study. Traffic accident high risk-locations are identified and ranked in space and time using time-dependent degree centrality and PageRank centrality graph metrics respectively through time-incremental graph queries. This study offers urban traffic accident analysts with a new and efficient approach to identify, rank and profile accident-prone areas in space and time at different scales. ",
    "url": "https://arxiv.org/abs/2205.02851",
    "authors": [
      "Iyke Maduako",
      "Elijah Ebinne",
      "Victus Uzodinma",
      "Chukwuma Okolie",
      "Emmanuel Chiemelu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2205.02885",
    "title": "Multi-confound regression adversarial network for deep learning-based  diagnosis on highly heterogenous clinical data",
    "abstract": "Automated disease detection in medical images using deep learning holds promise to improve the diagnostic ability of radiologists, but routinely collected clinical data frequently contains technical and demographic confounding factors that differ between hospitals, negatively affecting the robustness of diagnostic deep learning models. Thus, there is a critical need for deep learning models that can train on imbalanced datasets without overfitting to site-specific confounding factors. In this work, we developed a novel deep learning architecture, MUCRAN (Multi-Confound Regression Adversarial Network), to train a deep learning model on highly heterogeneous clinical data while regressing demographic and technical confounding factors. We trained MUCRAN using 16,821 clinical T1 Axial brain MRIs collected from Massachusetts General Hospital before 2019 and tested it using post-2019 data to distinguish Alzheimer's disease (AD) patients, identified using both prescriptions of AD drugs and ICD codes, from a non-medicated control group. In external validation tests using MRI data from other hospitals, the model showed a robust performance of over 90% accuracy on newly collected data. This work shows the feasibility of deep learning-based diagnosis in real-world clinical data. ",
    "url": "https://arxiv.org/abs/2205.02885",
    "authors": [
      "Matthew Leming",
      "Sudeshna Das",
      "Hyungsoon Im"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)",
      "Tissues and Organs (q-bio.TO)"
    ]
  },
  {
    "id": "arXiv:2205.02886",
    "title": "Data Augmentation for Manipulation",
    "abstract": "The success of deep learning depends heavily on the availability of large datasets, but in robotic manipulation there are many learning problems for which such datasets do not exist. Collecting these datasets is time-consuming and expensive, and therefore learning from small datasets is an important open problem. Within computer vision, a common approach to a lack of data is data augmentation. Data augmentation is the process of creating additional training examples by modifying existing ones. However, because the types of tasks and data differ, the methods used in computer vision cannot be easily adapted to manipulation. Therefore, we propose a data augmentation method for robotic manipulation. We argue that augmentations should be valid, relevant, and diverse. We use these principles to formalize augmentation as an optimization problem, with the objective function derived from physics and knowledge of the manipulation domain. This method applies rigid body transformations to trajectories of geometric state and action data. We test our method in two scenarios: 1) learning the dynamics of planar pushing of rigid cylinders, and 2) learning a constraint checker for rope manipulation. These two scenarios have different data and label types, yet in both scenarios, training on our augmented data significantly improves performance on downstream tasks. We also show how our augmentation method can be used on real-robot data to enable more data-efficient online learning. ",
    "url": "https://arxiv.org/abs/2205.02886",
    "authors": [
      "Peter Mitrano",
      "Dmitry Berenson"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2205.02889",
    "title": "Using network structure and community detection to discover important  website features when distinguishing between phishing and legitimate ones",
    "abstract": "In this paper, we uncover the essential features of websites that allow intelligent models to distinguish between phishing and legitimate sites. Phishing websites are those that are made with a similar user interface and a near similar address to trustworthy websites in order to persuade users to input their private data for potential future misuse by attackers. Detecting phishing websites with intelligent systems is an important goal to protect users, companies, and other online services that use the HTTP protocol. An intelligent model needs to distinguish features that are important as input to predict phishing sites. In this research, using correlation-based networks, we provide a novel network-based method to find features that are more important in phishing detection. The networks are trained and tested on an established phishing dataset. Three different networks are made by partitioning the dataset by its data instance labels. The important features are found by discovering the hubs of these networks, and the results are presented and analysed. This is the first time using a network-based approach for feature selection which is a fast and accurate way to do so. ",
    "url": "https://arxiv.org/abs/2205.02889",
    "authors": [
      "Arash Negahdari Kia",
      "Finbarr Murphy",
      "Zahra Dehghani Mohammadabadi",
      "Parisa Shamsi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2205.02902",
    "title": "Lagrangian PINNs: A causality-conforming solution to failure modes of  physics-informed neural networks",
    "abstract": "Physics-informed neural networks (PINNs) leverage neural-networks to find the solutions of partial differential equation (PDE)-constrained optimization problems with initial conditions and boundary conditions as soft constraints. These soft constraints are often considered to be the sources of the complexity in the training phase of PINNs. Here, we demonstrate that the challenge of training (i) persists even when the boundary conditions are strictly enforced, and (ii) is closely related to the Kolmogorov n-width associated with problems demonstrating transport, convection, traveling waves, or moving fronts. Given this realization, we describe the mechanism underlying the training schemes such as those used in eXtended PINNs (XPINN), curriculum regularization, and sequence-to-sequence learning. For an important category of PDEs, i.e., governed by non-linear convection-diffusion equation, we propose reformulating PINNs on a Lagrangian frame of reference, i.e., LPINNs, as a PDE-informed solution. A parallel architecture with two branches is proposed. One branch solves for the state variables on the characteristics, and the second branch solves for the low-dimensional characteristics curves. The proposed architecture conforms to the causality innate to the convection, and leverages the direction of travel of the information in the domain. Finally, we demonstrate that the loss landscapes of LPINNs are less sensitive to the so-called \"complexity\" of the problems, compared to those in the traditional PINNs in the Eulerian framework. ",
    "url": "https://arxiv.org/abs/2205.02902",
    "authors": [
      "Rambod Mojgani",
      "Maciej Balajewicz",
      "Pedram Hassanzadeh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Numerical Analysis (math.NA)",
      "Computational Physics (physics.comp-ph)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.02904",
    "title": "Neural Jacobian Fields: Learning Intrinsic Mappings of Arbitrary Meshes",
    "abstract": "This paper introduces a framework designed to accurately predict piecewise linear mappings of arbitrary meshes via a neural network, enabling training and evaluating over heterogeneous collections of meshes that do not share a triangulation, as well as producing highly detail-preserving maps whose accuracy exceeds current state of the art. The framework is based on reducing the neural aspect to a prediction of a matrix for a single given point, conditioned on a global shape descriptor. The field of matrices is then projected onto the tangent bundle of the given mesh, and used as candidate jacobians for the predicted map. The map is computed by a standard Poisson solve, implemented as a differentiable layer with cached pre-factorization for efficient training. This construction is agnostic to the triangulation of the input, thereby enabling applications on datasets with varying triangulations. At the same time, by operating in the intrinsic gradient domain of each individual mesh, it allows the framework to predict highly-accurate mappings. We validate these properties by conducting experiments over a broad range of scenarios, from semantic ones such as morphing, registration, and deformation transfer, to optimization-based ones, such as emulating elastic deformations and contact correction, as well as being the first work, to our knowledge, to tackle the task of learning to compute UV parameterizations of arbitrary meshes. The results exhibit the high accuracy of the method as well as its versatility, as it is readily applied to the above scenarios without any changes to the framework. ",
    "url": "https://arxiv.org/abs/2205.02904",
    "authors": [
      "Noam Aigerman",
      "Kunal Gupta",
      "Vladimir G. Kim",
      "Siddhartha Chaudhuri",
      "Jun Saito",
      "Thibault Groueix"
    ],
    "subjectives": [
      "Graphics (cs.GR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02909",
    "title": "RoboCraft: Learning to See, Simulate, and Shape Elasto-Plastic Objects  with Graph Networks",
    "abstract": "Modeling and manipulating elasto-plastic objects are essential capabilities for robots to perform complex industrial and household interaction tasks (e.g., stuffing dumplings, rolling sushi, and making pottery). However, due to the high degree of freedom of elasto-plastic objects, significant challenges exist in virtually every aspect of the robotic manipulation pipeline, e.g., representing the states, modeling the dynamics, and synthesizing the control signals. We propose to tackle these challenges by employing a particle-based representation for elasto-plastic objects in a model-based planning framework. Our system, RoboCraft, only assumes access to raw RGBD visual observations. It transforms the sensing data into particles and learns a particle-based dynamics model using graph neural networks (GNNs) to capture the structure of the underlying system. The learned model can then be coupled with model-predictive control (MPC) algorithms to plan the robot's behavior. We show through experiments that with just 10 minutes of real-world robotic interaction data, our robot can learn a dynamics model that can be used to synthesize control signals to deform elasto-plastic objects into various target shapes, including shapes that the robot has never encountered before. We perform systematic evaluations in both simulation and the real world to demonstrate the robot's manipulation capabilities and ability to generalize to a more complex action space, different tool shapes, and a mixture of motion modes. We also conduct comparisons between RoboCraft and untrained human subjects controlling the gripper to manipulate deformable objects in both simulation and the real world. Our learned model-based planning framework is comparable to and sometimes better than human subjects on the tested tasks. ",
    "url": "https://arxiv.org/abs/2205.02909",
    "authors": [
      "Haochen Shi",
      "Huazhe Xu",
      "Zhiao Huang",
      "Yunzhu Li",
      "Jiajun Wu"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.02916",
    "title": "Reconfigurable Heterogeneous Parallel Island Models",
    "abstract": "Heterogeneous Parallel Island Models (HePIMs) run different bio-inspired algorithms (BAs) in their islands. From a variety of communication topologies and migration policies fine-tuned for homogeneous PIMs (HoPIMs), which run the same BA in all their islands, previous work introduced HePIMs that provided competitive quality solutions regarding the best-adapted BA in HoPIMs. This work goes a step forward, maintaining the population diversity provided by HePIMs, and increasing their flexibility, allowing BA reconfiguration on islands during execution: according to their performance, islands may substitute their BAs dynamically during the evolutionary process. Experiments with the introduced architectures (RecHePIMs) were applied to the NP-hard problem of sorting permutations by reversals, using four different BAs, namely, simple Genetic Algorithm, Double-point crossover Genetic Algorithm, Differential Evolution, and self-adjusting Particle Swarm Optimization. The results showed that the new reconfigurable heterogeneous models compute better quality solutions than the HePIMs closing the gap with the HoPIM running the best-adapted BA. ",
    "url": "https://arxiv.org/abs/2205.02916",
    "authors": [
      "Lucas Ângelo da Silveira",
      "Thaynara Arielly de Lima",
      "Mauricio Ayala-Rincón"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2205.02919",
    "title": "Action Languages Based Actual Causality in Ethical Decision Making  Contexts",
    "abstract": "Moral responsibility is closely intermixed with causality, even if it cannot be reduced to it. Besides, rationally understanding the evolution of the physical world is inherently linked with the idea of causality. It follows that decision making applications based on automated planning, especially if they integrate references to ethical norms, have inevitably to deal with causality. Despite these considerations, much of the work in computational ethics relegates causality to the background, if not ignores it completely. This paper contribution is double. The first one is to link up two research topics$\\unicode{x2014}$automated planning and causality$\\unicode{x2014}$by proposing an actual causation definition suitable for action languages. This definition is a formalisation of Wright's NESS test of causation. The second is to link up computational ethics and causality by showing the importance of causality in the simulation of ethical reasoning and by enabling the domain to deal with situations that were previously out of reach thanks to the actual causation definition proposed. ",
    "url": "https://arxiv.org/abs/2205.02919",
    "authors": [
      "Camilo Sarmiento",
      "Gauvain Bourgne",
      "Daniele Cavalli",
      "Katsumi Inoue",
      "Jean-Gabriel Ganascia"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.02927",
    "title": "Neural Network Based Variational Methods for Solving Quadratic Porous  Medium Equations in High Dimensions",
    "abstract": "In this paper, we propose and study neural network based methods for solutions of high-dimensional quadratic porous medium equation (QPME). Three variational formulations of this nonlinear PDE are presented: a strong formulation and two weak formulations. For the strong formulation, the solution is directly parameterized with a neural network and optimized by minimizing the PDE residual. It can be proved that the convergence of the optimization problem guarantees the convergence of the approximate solution in the $L^1$ sense. The weak formulations are derived following Brenier, Y., 2020, which characterizes the very weak solutions of QPME. Specifically speaking, the solutions are represented with intermediate functions who are parameterized with neural networks and are trained to optimize the weak formulations. Extensive numerical tests are further carried out to investigate the pros and cons of each formulation in low and high dimensions. This is an initial exploration made along the line of solving high-dimensional nonlinear PDEs with neural network based methods, which we hope can provide some useful experience for future investigations. ",
    "url": "https://arxiv.org/abs/2205.02927",
    "authors": [
      "Jianfeng Lu",
      "Min Wang"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2205.02930",
    "title": "FisheyeDistill: Self-Supervised Monocular Depth Estimation with Ordinal  Distillation for Fisheye Cameras",
    "abstract": "In this paper, we deal with the problem of monocular depth estimation for fisheye cameras in a self-supervised manner. A known issue of self-supervised depth estimation is that it suffers in low-light/over-exposure conditions and in large homogeneous regions. To tackle this issue, we propose a novel ordinal distillation loss that distills the ordinal information from a large teacher model. Such a teacher model, since having been trained on a large amount of diverse data, can capture the depth ordering information well, but lacks in preserving accurate scene geometry. Combined with self-supervised losses, we show that our model can not only generate reasonable depth maps in challenging environments but also better recover the scene geometry. We further leverage the fisheye cameras of an AR-Glasses device to collect an indoor dataset to facilitate evaluation. ",
    "url": "https://arxiv.org/abs/2205.02930",
    "authors": [
      "Qingan Yan",
      "Pan Ji",
      "Nitin Bansal",
      "Yuxin Ma",
      "Yuan Tian",
      "Yi Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02934",
    "title": "Biometric Signature Verification Using Recurrent Neural Networks",
    "abstract": "Architectures based on Recurrent Neural Networks (RNNs) have been successfully applied to many different tasks such as speech or handwriting recognition with state-of-the-art results. The main contribution of this work is to analyse the feasibility of RNNs for on-line signature verification in real practical scenarios. We have considered a system based on Long Short-Term Memory (LSTM) with a Siamese architecture whose goal is to learn a similarity metric from pairs of signatures. For the experimental work, the BiosecurID database comprised of 400 users and 4 separated acquisition sessions are considered. Our proposed LSTM RNN system has outperformed the results of recent published works on the BiosecurID benchmark in figures ranging from 17.76% to 28.00% relative verification performance improvement for skilled forgeries. ",
    "url": "https://arxiv.org/abs/2205.02934",
    "authors": [
      "Ruben Tolosana",
      "Ruben Vera-Rodriguez",
      "Julian Fierrez",
      "Javier Ortega-Garcia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02937",
    "title": "Detection of Propaganda Techniques in Visuo-Lingual Metaphor in Memes",
    "abstract": "The exponential rise of social media networks has allowed the production, distribution, and consumption of data at a phenomenal rate. Moreover, the social media revolution has brought a unique phenomenon to social media platforms called Internet memes. Internet memes are one of the most popular contents used on social media, and they can be in the form of images with a witty, catchy, or satirical text description. In this paper, we are dealing with propaganda that is often seen in Internet memes in recent times. Propaganda is communication, which frequently includes psychological and rhetorical techniques to manipulate or influence an audience to act or respond as the propagandist wants. To detect propaganda in Internet memes, we propose a multimodal deep learning fusion system that fuses the text and image feature representations and outperforms individual models based solely on either text or image modalities. ",
    "url": "https://arxiv.org/abs/2205.02937",
    "authors": [
      "Sunil Gundapu",
      "Radhika Mamidi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02938",
    "title": "Immiscible Color Flows in Optimal Transport Networks for Image  Classification",
    "abstract": "In classification tasks, it is crucial to meaningfully exploit information contained in data. Here, we propose a physics-inspired dynamical system that adapts Optimal Transport principles to effectively leverage color distributions of images. Our dynamics regulates immiscible fluxes of colors traveling on a network built from images. Instead of aggregating colors together, it treats them as different commodities that interact with a shared capacity on edges. Our method outperforms competitor algorithms on image classification tasks in datasets where color information matters. ",
    "url": "https://arxiv.org/abs/2205.02938",
    "authors": [
      "Alessandro Lonardi",
      "Diego Baptista",
      "Caterina De Bacco"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)",
      "Applied Physics (physics.app-ph)"
    ]
  },
  {
    "id": "arXiv:2205.02949",
    "title": "Over-The-Air Federated Learning under Byzantine Attacks",
    "abstract": "Federated learning (FL) is a promising solution to enable many AI applications, where sensitive datasets from distributed clients are needed for collaboratively training a global model. FL allows the clients to participate in the training phase, governed by a central server, without sharing their local data. One of the main challenges of FL is the communication overhead, where the model updates of the participating clients are sent to the central server at each global training round. Over-the-air computation (AirComp) has been recently proposed to alleviate the communication bottleneck where the model updates are sent simultaneously over the multiple-access channel. However, simple averaging of the model updates via AirComp makes the learning process vulnerable to random or intended modifications of the local model updates of some Byzantine clients. In this paper, we propose a transmission and aggregation framework to reduce the effect of such attacks while preserving the benefits of AirComp for FL. For the proposed robust approach, the central server divides the participating clients randomly into groups and allocates a transmission time slot for each group. The updates of the different groups are then aggregated using a robust aggregation technique. We extend our approach to handle the case of non-i.i.d. local data, where a resampling step is added before robust aggregation. We analyze the convergence of the proposed approach for both cases of i.i.d. and non-i.i.d. data and demonstrate that the proposed algorithm converges at a linear rate to a neighborhood of the optimal solution. Experiments on real datasets are provided to confirm the robustness of the proposed approach. ",
    "url": "https://arxiv.org/abs/2205.02949",
    "authors": [
      "Houssem Sifaou",
      "Geoffrey Ye Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.02958",
    "title": "Scene Graph Expansion for Semantics-Guided Image Outpainting",
    "abstract": "In this paper, we address the task of semantics-guided image outpainting, which is to complete an image by generating semantically practical content. Different from most existing image outpainting works, we approach the above task by understanding and completing image semantics at the scene graph level. In particular, we propose a novel network of Scene Graph Transformer (SGT), which is designed to take node and edge features as inputs for modeling the associated structural information. To better understand and process graph-based inputs, our SGT uniquely performs feature attention at both node and edge levels. While the former views edges as relationship regularization, the latter observes the co-occurrence of nodes for guiding the attention process. We demonstrate that, given a partial input image with its layout and scene graph, our SGT can be applied for scene graph expansion and its conversion to a complete layout. Following state-of-the-art layout-to-image conversions works, the task of image outpainting can be completed with sufficient and practical semantics introduced. Extensive experiments are conducted on the datasets of MS-COCO and Visual Genome, which quantitatively and qualitatively confirm the effectiveness of our proposed SGT and outpainting frameworks. ",
    "url": "https://arxiv.org/abs/2205.02958",
    "authors": [
      "Chiao-An Yang",
      "Cheng-Yo Tan",
      "Wan-Cyuan Fan",
      "Cheng-Fu Yang",
      "Meng-Lin Wu",
      "Yu-Chiang Frank Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02962",
    "title": "An Incremental Negative Sequence Admittance Method for Fault Detection  in Inverter-Based Microgrids",
    "abstract": "Superimposed sequence quantities have been relied on for years to provide pure fault components for various applications in protection schemes. In more recent times, they have been employed in various solutions to the challenges introduced by integration of distributed generation in distribution systems. To improve the overall reliability of protection schemes deployed in such active distribution networks, this paper evaluates a new approach for detecting unbalanced faults using negative sequence quantities. A proposed superimposed negative sequence admittance element is validated using simulation tests on a modelled community microgrid. The performance of the method is tested for various fault scenarios in MATLAB/Simulink. ",
    "url": "https://arxiv.org/abs/2205.02962",
    "authors": [
      "Kwasi Opoku",
      "Subash Pokharel",
      "Aleksandar Dimitrovski"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2205.02977",
    "title": "IMU Based Deep Stride Length Estimation With Self-Supervised Learning",
    "abstract": "Stride length estimation using inertial measurement unit (IMU) sensors is getting popular recently as one representative gait parameter for health care and sports training. The traditional estimation method requires some explicit calibrations and design assumptions. Current deep learning methods suffer from few labeled data problem. To solve above problems, this paper proposes a single convolutional neural network (CNN) model to predict stride length of running and walking and classify the running or walking type per stride. The model trains its pretext task with self-supervised learning on a large unlabeled dataset for feature learning, and its downstream task on the stride length estimation and classification tasks with supervised learning with a small labeled dataset. The proposed model can achieve better average percent error, 4.78\\%, on running and walking stride length regression and 99.83\\% accuracy on running and walking classification, when compared to the previous approach, 7.44\\% on the stride length estimation. ",
    "url": "https://arxiv.org/abs/2205.02977",
    "authors": [
      "Jien-De Sui",
      "Tian-Sheuan Chang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02996",
    "title": "Multi-view Point Cloud Registration based on Evolutionary Multitasking  with Bi-Channel Knowledge Sharing Mechanism",
    "abstract": "Registration of multi-view point clouds is fundamental in 3D reconstruction. Since there are close connections between point clouds captured from different viewpoints, registration performance can be enhanced if these connections be harnessed properly. Therefore, this paper models the registration problem as multi-task optimization, and proposes a novel bi-channel knowledge sharing mechanism for effective and efficient problem solving. The modeling of multi-view point cloud registration as multi-task optimization are twofold. By simultaneously considering the local accuracy of two point clouds as well as the global consistency posed by all the point clouds involved, a fitness function with an adaptive threshold is derived. Also a framework of the co-evolutionary search process is defined for the concurrent optimization of multiple fitness functions belonging to related tasks. To enhance solution quality and convergence speed, the proposed bi-channel knowledge sharing mechanism plays its role. The intra-task knowledge sharing introduces aiding tasks that are much simpler to solve, and useful information is shared within tasks, accelerating the search process. The inter-task knowledge sharing explores commonalities buried among tasks, aiming to prevent tasks from getting stuck to local optima. Comprehensive experiments conducted on model object as well as scene point clouds show the efficacy of the proposed method. ",
    "url": "https://arxiv.org/abs/2205.02996",
    "authors": [
      "Yue Wu",
      "Yibo Liu",
      "Maoguo Gong",
      "Hao Li",
      "Zedong Tang",
      "Qiguang Miao",
      "Wenping Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2205.02998",
    "title": "Learning Optimal Propagation for Graph Neural Networks",
    "abstract": "Graph Neural Networks (GNNs) have achieved tremendous success in a variety of real-world applications by relying on the fixed graph data as input. However, the initial input graph might not be optimal in terms of specific downstream tasks, because of information scarcity, noise, adversarial attacks, or discrepancies between the distribution in graph topology, features, and groundtruth labels. In this paper, we propose a bi-level optimization-based approach for learning the optimal graph structure via directly learning the Personalized PageRank propagation matrix as well as the downstream semi-supervised node classification simultaneously. We also explore a low-rank approximation model for further reducing the time complexity. Empirical evaluations show the superior efficacy and robustness of the proposed model over all baseline methods. ",
    "url": "https://arxiv.org/abs/2205.02998",
    "authors": [
      "Beidi Zhao",
      "Boxin Du",
      "Zhe Xu",
      "Liangyue Li",
      "Hanghang Tong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.03009",
    "title": "Watching the watchers: bias and vulnerability in remote proctoring  software",
    "abstract": "Educators are rapidly switching to remote proctoring and examination software for their testing needs, both due to the COVID-19 pandemic and the expanding virtualization of the education sector. State boards are increasingly utilizing these software for high stakes legal and medical licensing exams. Three key concerns arise with the use of these complex software: exam integrity, exam procedural fairness, and exam-taker security and privacy. We conduct the first technical analysis of each of these concerns through a case study of four primary proctoring suites used in U.S. law school and state attorney licensing exams. We reverse engineer these proctoring suites and find that despite promises of high-security, all their anti-cheating measures can be trivially bypassed and can pose significant user security risks. We evaluate current facial recognition classifiers alongside the classifier used by Examplify, the legal exam proctoring suite with the largest market share, to ascertain their accuracy and determine whether faces with certain skin tones are more readily flagged for cheating. Finally, we offer recommendations to improve the integrity and fairness of the remotely proctored exam experience. ",
    "url": "https://arxiv.org/abs/2205.03009",
    "authors": [
      "Ben Burgess",
      "Avi Ginsberg",
      "Edward W. Felten",
      "Shaanan Cohney"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2205.03017",
    "title": "Generative Adversarial Neural Operators",
    "abstract": "We propose the generative adversarial neural operator (GANO), a generative model paradigm for learning probabilities on infinite-dimensional function spaces. The natural sciences and engineering are known to have many types of data that are sampled from infinite-dimensional function spaces, where classical finite-dimensional deep generative adversarial networks (GANs) may not be directly applicable. GANO generalizes the GAN framework and allows for the sampling of functions by learning push-forward operator maps in infinite-dimensional spaces. GANO consists of two main components, a generator neural operator and a discriminator neural functional. The inputs to the generator are samples of functions from a user-specified probability measure, e.g., Gaussian random field (GRF), and the generator outputs are synthetic data functions. The input to the discriminator is either a real or synthetic data function. In this work, we instantiate GANO using the Wasserstein criterion and show how the Wasserstein loss can be computed in infinite-dimensional spaces. We empirically study GANOs in controlled cases where both input and output functions are samples from GRFs and compare its performance to the finite-dimensional counterpart GAN. We empirically study the efficacy of GANO on real-world function data of volcanic activities and show its superior performance over GAN. Furthermore, we find that for the function-based data considered, GANOs are more stable to train than GANs and require less hyperparameter optimization. ",
    "url": "https://arxiv.org/abs/2205.03017",
    "authors": [
      "Md Ashiqur Rahman",
      "Manuel A. Florez",
      "Anima Anandkumar",
      "Zachary E. Ross",
      "Kamyar Azizzadenesheli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2205.03019",
    "title": "A Fingerprint Detection Method by Fingerprint Ridge Orientation Check",
    "abstract": "Fingerprints are popular among the biometric based systems due to ease of acquisition, uniqueness and availability. Nowadays it is used in smart phone security, digital payment and digital locker. Fingerprint recognition technology has been studied for a long time, and its recognition rate has recently risen to a high level. In particular, with the introduction of Deep Neural Network technologies, the recognition rate that could not be reached before was reached. In this paper, we propose a fingerprint detection algorithm used in a fingerprint recognition system. ",
    "url": "https://arxiv.org/abs/2205.03019",
    "authors": [
      "Kim JuSong",
      "Ri IlYong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.03029",
    "title": "Investigation of large-scale extended Granger causality (lsXGC) on  synthetic functional MRI data",
    "abstract": "It is a challenging research endeavor to infer causal relationships in multivariate observational time-series. Such data may be represented by graphs, where nodes represent time-series, and edges directed causal influence scores between them. If the number of nodes exceeds the number of temporal observations, conventional methods, such as standard Granger causality, are of limited value, because estimating free parameters of time-series predictors lead to underdetermined problems. A typical example for this situation is functional Magnetic Resonance Imaging (fMRI), where the number of nodal observations is large, usually ranging from $10^2$ to $10^5$ time-series, while the number of temporal observations is low, usually less than $10^3$. Hence, innovative approaches are required to address the challenges arising from such data sets. Recently, we have proposed the large-scale Extended Granger Causality (lsXGC) algorithm, which is based on augmenting a dimensionality-reduced representation of the system's state-space by supplementing data from the conditional source time-series taken from the original input space. Here, we apply lsXGC on synthetic fMRI data with known ground truth and compare its performance to state-of-the-art methods by leveraging the benefits of information-theoretic approaches. Our results suggest that the proposed lsXGC method significantly outperforms existing methods, both in diagnostic accuracy with Area Under the Receiver Operating Characteristic (AUROC = $0.849$ vs.~$[0.727, 0.762]$ for competing methods, $p<\\!10^{-8}$), and computation time ($3.4$ sec vs.~[$9.7$, $4.8 \\times 10^3$] sec for competing methods) benchmarks, demonstrating the potential of lsXGC for analyzing large-scale networks in neuroimaging studies of the human brain. ",
    "url": "https://arxiv.org/abs/2205.03029",
    "authors": [
      "Axel Wismüller",
      "Ali Vosoughi",
      "Adora DSouza",
      "Anas Abidin"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.03055",
    "title": "Continual Object Detection via Prototypical Task Correlation Guided  Gating Mechanism",
    "abstract": "Continual learning is a challenging real-world problem for constructing a mature AI system when data are provided in a streaming fashion. Despite recent progress in continual classification, the researches of continual object detection are impeded by the diverse sizes and numbers of objects in each image. Different from previous works that tune the whole network for all tasks, in this work, we present a simple and flexible framework for continual object detection via pRotOtypical taSk corrElaTion guided gaTing mechAnism (ROSETTA). Concretely, a unified framework is shared by all tasks while task-aware gates are introduced to automatically select sub-models for specific tasks. In this way, various knowledge can be successively memorized by storing their corresponding sub-model weights in this system. To make ROSETTA automatically determine which experience is available and useful, a prototypical task correlation guided Gating Diversity Controller(GDC) is introduced to adaptively adjust the diversity of gates for the new task based on class-specific prototypes. GDC module computes class-to-class correlation matrix to depict the cross-task correlation, and hereby activates more exclusive gates for the new task if a significant domain gap is observed. Comprehensive experiments on COCO-VOC, KITTI-Kitchen, class-incremental detection on VOC and sequential learning of four tasks show that ROSETTA yields state-of-the-art performance on both task-based and class-based continual object detection. ",
    "url": "https://arxiv.org/abs/2205.03055",
    "authors": [
      "Binbin Yang",
      "Xinchi Deng",
      "Han Shi",
      "Changlin Li",
      "Gengwei Zhang",
      "Hang Xu",
      "Shen Zhao",
      "Liang Lin",
      "Xiaodan Liang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.03056",
    "title": "Generative Evolutionary Strategy For Black-Box Optimizations",
    "abstract": "Many scientific and technological problems are related to optimization. Among them, black-box optimization in high-dimensional space is particularly challenging. Recent neural network-based black-box optimization studies have shown noteworthy achievements. However, their capability in high-dimensional search space is still limited. This study investigates a novel black-box optimization method based on evolution strategy and generative neural network model. We designed the algorithm so that the evolutionary strategy and the generative neural network model work cooperatively with each other. This hybrid model enables reliable training of surrogate networks; it optimizes multi-objective, high-dimensional, and stochastic black-box functions. In this experiment, our method outperforms baseline optimization methods, including an NSGA-II and Bayesian optimization. ",
    "url": "https://arxiv.org/abs/2205.03056",
    "authors": [
      "Changhwi Park",
      "Seong Ryeol Kim",
      "Young-Gu Kim",
      "Dae Sin Kim"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2205.03100",
    "title": "Fake News Detection with Heterogeneous Transformer",
    "abstract": "The dissemination of fake news on social networks has drawn public need for effective and efficient fake news detection methods. Generally, fake news on social networks is multi-modal and has various connections with other entities such as users and posts. The heterogeneity in both news content and the relationship with other entities in social networks brings challenges to designing a model that comprehensively captures the local multi-modal semantics of entities in social networks and the global structural representation of the propagation patterns, so as to classify fake news effectively and accurately. In this paper, we propose a novel Transformer-based model: HetTransformer to solve the fake news detection problem on social networks, which utilises the encoder-decoder structure of Transformer to capture the structural information of news propagation patterns. We first capture the local heterogeneous semantics of news, post, and user entities in social networks. Then, we apply Transformer to capture the global structural representation of the propagation patterns in social networks for fake news detection. Experiments on three real-world datasets demonstrate that our model is able to outperform the state-of-the-art baselines in fake news detection. ",
    "url": "https://arxiv.org/abs/2205.03100",
    "authors": [
      "Tianle Li",
      "Yushi Sun",
      "Shang-ling Hsu",
      "Yanjia Li",
      "Raymond Chi-Wing Wong"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.03105",
    "title": "LPGNet: Link Private Graph Networks for Node Classification",
    "abstract": "Classification tasks on labeled graph-structured data have many important applications ranging from social recommendation to financial modeling. Deep neural networks are increasingly being used for node classification on graphs, wherein nodes with similar features have to be given the same label. Graph convolutional networks (GCNs) are one such widely studied neural network architecture that perform well on this task. However, powerful link-stealing attacks on GCNs have recently shown that even with black-box access to the trained model, inferring which links (or edges) are present in the training graph is practical. In this paper, we present a new neural network architecture called LPGNet for training on graphs with privacy-sensitive edges. LPGNet provides differential privacy (DP) guarantees for edges using a novel design for how graph edge structure is used during training. We empirically show that LPGNet models often lie in the sweet spot between providing privacy and utility: They can offer better utility than \"trivially\" private architectures which use no edge information (e.g., vanilla MLPs) and better resilience against existing link-stealing attacks than vanilla GCNs which use the full edge structure. LPGNet also offers consistently better privacy-utility tradeoffs than DPGCN, which is the state-of-the-art mechanism for retrofitting differential privacy into conventional GCNs, in most of our evaluated datasets. ",
    "url": "https://arxiv.org/abs/2205.03105",
    "authors": [
      "Aashish Kolluri",
      "Teodora Baluta",
      "Bryan Hooi",
      "Prateek Saxena"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2205.03114",
    "title": "Arabic Fake News Detection Based on Deep Contextualized Embedding Models",
    "abstract": "Social media is becoming a source of news for many people due to its ease and freedom of use. As a result, fake news has been spreading quickly and easily regardless of its credibility, especially in the last decade. Fake news publishers take advantage of critical situations such as the Covid-19 pandemic and the American presidential elections to affect societies negatively. Fake news can seriously impact society in many fields including politics, finance, sports, etc. Many studies have been conducted to help detect fake news in English, but research conducted on fake news detection in the Arabic language is scarce. Our contribution is twofold: first, we have constructed a large and diverse Arabic fake news dataset. Second, we have developed and evaluated transformer-based classifiers to identify fake news while utilizing eight state-of-the-art Arabic contextualized embedding models. The majority of these models had not been previously used for Arabic fake news detection. We conduct a thorough analysis of the state-of-the-art Arabic contextualized embedding models as well as comparison with similar fake news detection systems. Experimental results confirm that these state-of-the-art models are robust, with accuracy exceeding 98%. ",
    "url": "https://arxiv.org/abs/2205.03114",
    "authors": [
      "Ali Bou Nassif",
      "Ashraf Elnagar",
      "Omar Elgendy",
      "Yaman Afadar"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.03115",
    "title": "Latency Guarantee for Ubiquitous Intelligence in 6G: A Network Calculus  Approach",
    "abstract": "With the gradual deployment of 5G and the continuous popularization of edge intelligence (EI), the explosive growth of data on the edge of the network has promoted the rapid development of 6G and ubiquitous intelligence (UbiI). This article aims to explore a new method for modeling latency guarantees for UbiI in 6G given 6G's extremely stochastic nature in terahertz (THz) environments, THz channel tail behavior, and delay distribution tail characteristics generated by the UBiI random component, and to find the optimal solution that minimizes the end-to-end (E2E) delay of UbiI. In this article, the arrival curve and service curve of network calculus can well characterize the stochastic nature of wireless channels, the tail behavior of wireless systems and the E2E service curve of network calculus can model the tail characteristic of the delay distribution in UbiI. Specifically, we first propose demands and challenges facing 6G, edge computing (EC), edge deep learning (DL), and UbiI. Then, we propose the hierarchical architecture, the network model, and the service delay model of the UbiI system based on network calculus. In addition, two case studies demonstrate the usefulness and effectiveness of the network calculus approach in analyzing and modeling the latency guarantee for UbiI in 6G. Finally, future open research issues regarding the latency guarantee for UbiI in 6G are outlined. ",
    "url": "https://arxiv.org/abs/2205.03115",
    "authors": [
      "Lianming Zhang",
      "Qian Wang",
      "Pingping Dong",
      "Yehua Wei",
      "Jing Mei"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.03116",
    "title": "Longitudinal cardio-respiratory fitness prediction through free-living  wearable sensors",
    "abstract": "Cardiorespiratory fitness is an established predictor of metabolic disease and mortality. Fitness is directly measured as maximal oxygen consumption (VO2max), or indirectly assessed using heart rate response to a standard exercise test. However, such testing is costly and burdensome, limiting its utility and scalability. Fitness can also be approximated using resting heart rate and self-reported exercise habits but with lower accuracy. Modern wearables capture dynamic heart rate data which, in combination with machine learning models, could improve fitness prediction. In this work, we analyze movement and heart rate signals from wearable sensors in free-living conditions from 11,059 participants who also underwent a standard exercise test, along with a longitudinal repeat cohort of 2,675 participants. We design algorithms and models that convert raw sensor data into cardio-respiratory fitness estimates, and validate these estimates' ability to capture fitness profiles in a longitudinal cohort over time while subjects engaged in real-world (non-exercise) behaviour. Additionally, we validate our methods with a third external cohort of 181 participants who underwent maximal VO2max testing, which is considered the gold standard measurement because it requires reaching one's maximum heart rate and exhaustion level. Our results show that the developed models yield a high correlation (r = 0.82, 95CI 0.80-0.83), when compared to the ground truth in a holdout sample. These models outperform conventional non-exercise fitness models and traditional bio-markers using measurements of normal daily living without the need for a specific exercise test. Additionally, we show the adaptability and applicability of this approach for detecting fitness change over time in the longitudinal subsample that repeated measurements after 7 years. ",
    "url": "https://arxiv.org/abs/2205.03116",
    "authors": [
      "Dimitris Spathis",
      "Ignacio Perez-Pozuelo",
      "Tomas I. Gonzales",
      "Soren Brage",
      "Nicholas Wareham",
      "Cecilia Mascolo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.03151",
    "title": "Rediscovering Argumentation Principles Utilizing Collective Attacks",
    "abstract": "Argumentation Frameworks (AFs) are a key formalism in AI research. Their semantics have been investigated in terms of principles, which define characteristic properties in order to deliver guidance for analysing established and developing new semantics. Because of the simple structure of AFs, many desired properties hold almost trivially, at the same time hiding interesting concepts behind syntactic notions. We extend the principle-based approach to Argumentation Frameworks with Collective Attacks (SETAFs) and provide a comprehensive overview of common principles for their semantics. Our analysis shows that investigating principles based on decomposing the given SETAF (e.g. directionality or SCC-recursiveness) poses additional challenges in comparison to usual AFs. We introduce the notion of the reduct as well as the modularization principle for SETAFs which will prove beneficial for this kind of investigation. We then demonstrate how our findings can be utilized for incremental computation of extensions and give a novel parameterized tractability result for verifying preferred extensions. ",
    "url": "https://arxiv.org/abs/2205.03151",
    "authors": [
      "Wolfgang Dvořák",
      "Matthias König",
      "Markus Ulbricht",
      "Stefan Woltran"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.03153",
    "title": "Bridging the Domain Gap for Stance Detection for the Zulu language",
    "abstract": "Misinformation has become a major concern in recent last years given its spread across our information sources. In the past years, many NLP tasks have been introduced in this area, with some systems reaching good results on English language datasets. Existing AI based approaches for fighting misinformation in literature suggest automatic stance detection as an integral first step to success. Our paper aims at utilizing this progress made for English to transfers that knowledge into other languages, which is a non-trivial task due to the domain gap between English and the target languages. We propose a black-box non-intrusive method that utilizes techniques from Domain Adaptation to reduce the domain gap, without requiring any human expertise in the target language, by leveraging low-quality data in both a supervised and unsupervised manner. This allows us to rapidly achieve similar results for stance detection for the Zulu language, the target language in this work, as are found for English. We also provide a stance detection dataset in the Zulu language. Our experimental results show that by leveraging English datasets and machine translation we can increase performances on both English data along with other languages. ",
    "url": "https://arxiv.org/abs/2205.03153",
    "authors": [
      "Gcinizwe Dlamini",
      "Imad Eddine Ibrahim Bekkouch",
      "Adil Khan",
      "Leon Derczynski"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.03168",
    "title": "Defending against Reconstruction Attacks through Differentially Private  Federated Learning for Classification of Heterogeneous Chest X-Ray Data",
    "abstract": "Privacy regulations and the physical distribution of heterogeneous data are often primary concerns for the development of deep learning models in a medical context. This paper evaluates the feasibility of differentially private federated learning for chest X-ray classification as a defense against privacy attacks on DenseNet121 and ResNet50 network architectures. We simulated a federated environment by distributing images from the public CheXpert and Mendeley chest X-ray datasets unevenly among 36 clients. Both non-private baseline models achieved an area under the ROC curve (AUC) of 0.94 on the binary classification task of detecting the presence of a medical finding. We demonstrate that both model architectures are vulnerable to privacy violation by applying image reconstruction attacks to local model updates from individual clients. The attack was particularly successful during later training stages. To mitigate the risk of privacy breach, we integrated R\\'enyi differential privacy with a Gaussian noise mechanism into local model training. We evaluate model performance and attack vulnerability for privacy budgets $\\epsilon \\in$ {1, 3, 6, 10}. The DenseNet121 achieved the best utility-privacy trade-off with an AUC of 0.94 for $\\epsilon$ = 6. Model performance deteriorated slightly for individual clients compared to the non-private baseline. The ResNet50 only reached an AUC of 0.76 in the same privacy setting. Its performance was inferior to that of the DenseNet121 for all considered privacy constraints, suggesting that the DenseNet121 architecture is more robust to differentially private training. ",
    "url": "https://arxiv.org/abs/2205.03168",
    "authors": [
      "Joceline Ziegler",
      "Bjarne Pfitzner",
      "Heinrich Schulz",
      "Axel Saalbach",
      "Bert Arnrich"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.03189",
    "title": "Optimal Bandwidth Allocation for Multicast-Cache-Aided on-Demand  Streaming in Wireless Networks",
    "abstract": "We consider a hybrid delivery scheme for streaming content, combining cache-enabled Orthogonal Multipoint Multicast (OMPMC) and on-demand Single-Point Unicast (SPUC) transmissions for heterogeneous networks. The OMPMC service transmits cached files through the whole network to interested users, and users not being satisfied by this service are assigned to the SPUC service to be individually served. The SPUC fetches the requested files from the core network and unicasts them to UEs using cellular beamforming transmissions. We optimize the delivery scheme to minimize the average resource consumption in the network. We formulate a constrained optimization problem over the cache placement and resource allocation of the OMPMC component, as well as the multi-user beamforming scheme of the SPUC component. We apply a path-following method to find the optimal traffic offloading solution. The solutions portray a contrast between the total amount of consumed resources and service outage probability. Simulation results show that the hybrid scheme provides a better tradeoff between the amount of network-wide consumed resources and the service outage probability, as compared to schemes from the literature. ",
    "url": "https://arxiv.org/abs/2205.03189",
    "authors": [
      "Mohsen Amidzadeh",
      "Giuseppe Caire",
      "Olav Tirkkonen"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.03190",
    "title": "Imperceptible Backdoor Attack: From Input Space to Feature  Representation",
    "abstract": "Backdoor attacks are rapidly emerging threats to deep neural networks (DNNs). In the backdoor attack scenario, attackers usually implant the backdoor into the target model by manipulating the training dataset or training process. Then, the compromised model behaves normally for benign input yet makes mistakes when the pre-defined trigger appears. In this paper, we analyze the drawbacks of existing attack approaches and propose a novel imperceptible backdoor attack. We treat the trigger pattern as a special kind of noise following a multinomial distribution. A U-net-based network is employed to generate concrete parameters of multinomial distribution for each benign input. This elaborated trigger ensures that our approach is invisible to both humans and statistical detection. Besides the design of the trigger, we also consider the robustness of our approach against model diagnose-based defences. We force the feature representation of malicious input stamped with the trigger to be entangled with the benign one. We demonstrate the effectiveness and robustness against multiple state-of-the-art defences through extensive datasets and networks. Our trigger only modifies less than 1\\% pixels of a benign image while the modification magnitude is 1. Our source code is available at https://github.com/Ekko-zn/IJCAI2022-Backdoor. ",
    "url": "https://arxiv.org/abs/2205.03190",
    "authors": [
      "Nan Zhong",
      "Zhenxing Qian",
      "Xinpeng Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.03201",
    "title": "Analysis of Load-Altering Attacks Against Power Grids: A Rare-Event  Sampling Approach",
    "abstract": "By manipulating tens of thousands of internet-of-things (IoT) enabled high-wattage electrical appliances (e.g., WiFi-controlled air-conditioners), large-scale load-altering attacks (LAAs) can cause severe disruptions to power grid operations. In this work, we present a rare-event sampling approach to identify LAAs that lead to critical network failure events (defined by the activation of a power grid emergency response (ER)). The proposed sampler is designed to \"skip\" over LAA instances that are of little interest (i.e., those that do not trigger network failure), thus significantly reducing the computational complexity in identifying the impactful LAAs. We perform extensive simulations of LAAs using the Kundur two-area system (KTAS) power network while employing the rare-event sampler. The results help us identify the victim nodes from which the attacker can launch the most impactful attacks and provide insights into how the spatial distribution of LAAs triggers the activation of ERs. ",
    "url": "https://arxiv.org/abs/2205.03201",
    "authors": [
      "Maldon Patrice Goodridge",
      "Subhash Lakshminarayana",
      "Christopher Few"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2205.03226",
    "title": "Trust-SIoT: Towards Trustworthy Object Classification in the Social  Internet of Things",
    "abstract": "The recent emergence of the promising paradigm of the Social Internet of Things (SIoT) is a result of an intelligent amalgamation of the social networking concepts with the Internet of Things (IoT) objects (also referred to as \"things\") in an attempt to unravel the challenges of network discovery, navigability, and service composition. This is realized by facilitating the IoT objects to socialize with one another, i.e., similar to the social interactions amongst the human beings. A fundamental issue that mandates careful attention is to thus establish, and over time, maintain trustworthy relationships amongst these IoT objects. Therefore, a trust framework for SIoT must include object-object interactions, the aspects of social relationships, credible recommendations, etc., however, the existing literature has only focused on some aspects of trust by primarily relying on the conventional approaches that govern linear relationships between input and output. In this paper, an artificial neural network-based trust framework, Trust-SIoT, has been envisaged for identifying the complex non-linear relationships between input and output in a bid to classify the trustworthy objects. Moreover, Trust-SIoT has been designed for capturing a number of key trust metrics as input, i.e., direct trust by integrating both current and past interactions, reliability, and benevolence of an object, credible recommendations, and the degree of relationship by employing a knowledge graph embedding. Finally, we have performed extensive experiments to evaluate the performance of Trust-SIoT vis-a-vis state-of-the-art heuristics on two real-world datasets. The results demonstrate that Trust-SIoT achieves a higher F1 and lower MAE and MSE scores. ",
    "url": "https://arxiv.org/abs/2205.03226",
    "authors": [
      "Subhash Sagar",
      "Adnan Mahmood",
      "Kai Wang",
      "Quan Z. Sheng",
      "Wei Emma Zhang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2205.03235",
    "title": "A Review on Text-Based Emotion Detection -- Techniques, Applications,  Datasets, and Future Directions",
    "abstract": "Artificial Intelligence (AI) has been used for processing data to make decisions, interact with humans, and understand their feelings and emotions. With the advent of the internet, people share and express their thoughts on day-to-day activities and global and local events through text messaging applications. Hence, it is essential for machines to understand emotions in opinions, feedback, and textual dialogues to provide emotionally aware responses to users in today's online world. The field of text-based emotion detection (TBED) is advancing to provide automated solutions to various applications, such as businesses, and finances, to name a few. TBED has gained a lot of attention in recent times. The paper presents a systematic literature review of the existing literature published between 2005 to 2021 in TBED. This review has meticulously examined 63 research papers from IEEE, Science Direct, Scopus, and Web of Science databases to address four primary research questions. It also reviews the different applications of TBED across various research domains and highlights its use. An overview of various emotion models, techniques, feature extraction methods, datasets, and research challenges with future directions has also been represented. ",
    "url": "https://arxiv.org/abs/2205.03235",
    "authors": [
      "Sheetal Kusal",
      "Shruti Patil",
      "Jyoti Choudrie",
      "Ketan Kotecha",
      "Deepali Vora",
      "Ilias Pappas"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.03261",
    "title": "Designing Robust Biotechnological Processes Regarding Variabilities  using Multi-Objective Optimization Applied to a Biopharmaceutical Seed Train  Design",
    "abstract": "Development and optimization of biopharmaceutical production processes with cell cultures is cost- and time-consuming and often performed rather empirically. Efficient optimization of multiple-objectives like process time, viable cell density, number of operating steps & cultivation scales, required medium, amount of product as well as product quality depicts a promising approach. This contribution presents a workflow which couples uncertainty-based upstream simulation and Bayes optimization using Gaussian processes. Its application is demonstrated in a simulation case study for a relevant industrial task in process development, the design of a robust cell culture expansion process (seed train), meaning that despite uncertainties and variabilities concerning cell growth, low variations of viable cell density during the seed train are obtained. Compared to a non-optimized reference seed train, the optimized process showed much lower deviation rates regarding viable cell densities (<~10% instead of 41.7%) using 5 or 4 shake flask scales and seed train duration could be reduced by 56 h from 576 h to 520 h. Overall, it is shown that applying Bayes optimization allows for optimization of a multi-objective optimization function with several optimizable input variables and under a considerable amount of constraints with a low computational effort. This approach provides the potential to be used in form of a decision tool, e.g. for the choice of an optimal and robust seed train design or for further optimization tasks within process development. ",
    "url": "https://arxiv.org/abs/2205.03261",
    "authors": [
      "Tanja Hernández Rodríguez",
      "Anton Sekulic",
      "Markus Lange-Hegermann",
      "Björn Frahm"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.03268",
    "title": "Robustness of Neural Architectures for Audio Event Detection",
    "abstract": "Traditionally, in Audio Recognition pipeline, noise is suppressed by the \"frontend\", relying on preprocessing techniques such as speech enhancement. However, it is not guaranteed that noise will not cascade into downstream pipelines. To understand the actual influence of noise on the entire audio pipeline, in this paper, we directly investigate the impact of noise on a different types of neural models without the preprocessing step. We measure the recognition performances of 4 different neural network models on the task of environment sound classification under the 3 types of noises: \\emph{occlusion} (to emulate intermittent noise), \\emph{Gaussian} noise (models continuous noise), and \\emph{adversarial perturbations} (worst case scenario). Our intuition is that the different ways in which these models process their input (i.e. CNNs have strong locality inductive biases, which Transformers do not have) should lead to observable differences in performance and/ or robustness, an understanding of which will enable further improvements. We perform extensive experiments on AudioSet which is the largest weakly-labeled sound event dataset available. We also seek to explain the behaviors of different models through output distribution change and weight visualization. ",
    "url": "https://arxiv.org/abs/2205.03268",
    "authors": [
      "Juncheng B Li",
      "Shuhui Qu",
      "Florian Metze"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2205.03296",
    "title": "Disentangled Learning of Stance and Aspect Topics for Vaccine Attitude  Detection in Social Media",
    "abstract": "Building models to detect vaccine attitudes on social media is challenging because of the composite, often intricate aspects involved, and the limited availability of annotated data. Existing approaches have relied heavily on supervised training that requires abundant annotations and pre-defined aspect categories. Instead, with the aim of leveraging the large amount of unannotated data now available on vaccination, we propose a novel semi-supervised approach for vaccine attitude detection, called VADet. A variational autoencoding architecture based on language models is employed to learn from unlabelled data the topical information of the domain. Then, the model is fine-tuned with a few manually annotated examples of user attitudes. We validate the effectiveness of VADet on our annotated data and also on an existing vaccination corpus annotated with opinions on vaccines. Our results show that VADet is able to learn disentangled stance and aspect topics, and outperforms existing aspect-based sentiment analysis models on both stance detection and tweet clustering. ",
    "url": "https://arxiv.org/abs/2205.03296",
    "authors": [
      "Lixing Zhu",
      "Zheng Fang",
      "Gabriele Pergola",
      "Rob Procter",
      "Yulan He"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.03302",
    "title": "Necessity and Sufficiency for Explaining Text Classifiers: A Case Study  in Hate Speech Detection",
    "abstract": "We present a novel feature attribution method for explaining text classifiers, and analyze it in the context of hate speech detection. Although feature attribution models usually provide a single importance score for each token, we instead provide two complementary and theoretically-grounded scores -- necessity and sufficiency -- resulting in more informative explanations. We propose a transparent method that calculates these values by generating explicit perturbations of the input text, allowing the importance scores themselves to be explainable. We employ our method to explain the predictions of different hate speech detection models on the same set of curated examples from a test suite, and show that different values of necessity and sufficiency for identity terms correspond to different kinds of false positive errors, exposing sources of classifier bias against marginalized groups. ",
    "url": "https://arxiv.org/abs/2205.03302",
    "authors": [
      "Esma Balkir",
      "Isar Nejadgholi",
      "Kathleen C. Fraser",
      "Svetlana Kiritchenko"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.03313",
    "title": "Combining Humor and Sarcasm for Improving Political Parody Detection",
    "abstract": "Parody is a figurative device used for mimicking entities for comedic or critical purposes. Parody is intentionally humorous and often involves sarcasm. This paper explores jointly modelling these figurative tropes with the goal of improving performance of political parody detection in tweets. To this end, we present a multi-encoder model that combines three parallel encoders to enrich parody-specific representations with humor and sarcasm information. Experiments on a publicly available data set of political parody tweets demonstrate that our approach outperforms previous state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2205.03313",
    "authors": [
      "Xiao Ao",
      "Danae Sánchez Villegas",
      "Daniel Preoţiuc-Pietro",
      "Nikolaos Aletras"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.03314",
    "title": "Example-Based Machine Translation from Text to a Hierarchical  Representation of Sign Language",
    "abstract": "This article presents an original method for Text-to-Sign Translation. It compensates data scarcity using a domain-specific parallel corpus of alignments between text and hierarchical formal descriptions of Sign Language videos in AZee. Based on the detection of similarities present in the source text, the proposed algorithm recursively exploits matches and substitutions of aligned segments to build multiple candidate translations for a novel statement. This helps preserving Sign Language structures as much as possible before falling back on literal translations too quickly, in a generative way. The resulting translations are in the form of AZee expressions, designed to be used as input to avatar synthesis systems. We present a test set tailored to showcase its potential for expressiveness and generation of idiomatic target language, and observed limitations. This work finally opens prospects on how to evaluate translation and linguistic aspects, such as accuracy and grammatical fluency. ",
    "url": "https://arxiv.org/abs/2205.03314",
    "authors": [
      "Élise Bertin-Lemée",
      "Annelies Braffort",
      "Camille Challant",
      "Claire Danet",
      "Michael Filhol"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.03316",
    "title": "Application of Clustering Algorithms for Dimensionality Reduction in  Infrastructure Resilience Prediction Models",
    "abstract": "Recent studies increasingly adopt simulation-based machine learning (ML) models to analyze critical infrastructure system resilience. For realistic applications, these ML models consider the component-level characteristics that influence the network response during emergencies. However, such an approach could result in a large number of features and cause ML models to suffer from the `curse of dimensionality'. We present a clustering-based method that simultaneously minimizes the problem of high-dimensionality and improves the prediction accuracy of ML models developed for resilience analysis in large-scale interdependent infrastructure networks. The methodology has three parts: (a) generation of simulation dataset, (b) network component clustering, and (c) dimensionality reduction and development of prediction models. First, an interdependent infrastructure simulation model simulates the network-wide consequences of various disruptive events. The component-level features are extracted from the simulated data. Next, clustering algorithms are used to derive the cluster-level features by grouping component-level features based on their topological and functional characteristics. Finally, ML algorithms are used to develop models that predict the network-wide impacts of disruptive events using the cluster-level features. The applicability of the method is demonstrated using an interdependent power-water-transport testbed. The proposed method can be used to develop decision-support tools for post-disaster recovery of infrastructure networks. ",
    "url": "https://arxiv.org/abs/2205.03316",
    "authors": [
      "Srijith Balakrishnan",
      "Beatrice Cassottana",
      "Arun Verma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2205.03321",
    "title": "Learning Scalable Policies over Graphs for Multi-Robot Task Allocation  using Capsule Attention Networks",
    "abstract": "This paper presents a novel graph reinforcement learning (RL) architecture to solve multi-robot task allocation (MRTA) problems that involve tasks with deadlines and workload, and robot constraints such as work capacity. While drawing motivation from recent graph learning methods that learn to solve combinatorial optimization (CO) problems such as multi-Traveling Salesman and Vehicle Routing Problems using RL, this paper seeks to provide better performance (compared to non-learning methods) and important scalability (compared to existing learning architectures) for the stated class of MRTA problems. The proposed neural architecture, called Capsule Attention-based Mechanism or CapAM acts as the policy network, and includes three main components: 1) an encoder: a Capsule Network based node embedding model to represent each task as a learnable feature vector; 2) a decoder: an attention-based model to facilitate a sequential output; and 3) context: that encodes the states of the mission and the robots. To train the CapAM model, the policy-gradient method based on REINFORCE is used. When evaluated over unseen scenarios, CapAM demonstrates better task completion performance and $>$10 times faster decision-making compared to standard non-learning based online MRTA methods. CapAM's advantage in generalizability, and scalability to test problems of size larger than those used in training, are also successfully demonstrated in comparison to a popular approach for learning to solve CO problems, namely the purely attention mechanism. ",
    "url": "https://arxiv.org/abs/2205.03321",
    "authors": [
      "Steve Paul",
      "Payam Ghassemi",
      "Souma Chowdhury"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2205.03326",
    "title": "Leveraging strategic connection migration-powered traffic splitting for  privacy",
    "abstract": "Network-level adversaries have developed increasingly sophisticated techniques to surveil and control users' network traffic. In this paper, we exploit our observation that many encrypted protocol connections are no longer tied to device IP address (e.g., the connection migration feature in QUIC, or IP roaming in WireGuard and Mosh), due to the need for performance in a mobile-first world. We design and implement a novel framework, Connection Migration Powered Splitting (CoMPS), that utilizes these performance features for enhancing user privacy. With CoMPS, we can split traffic mid-session across network paths and heterogeneous network protocols. Such traffic splitting mitigates the ability of a network-level adversary to perform traffic analysis attacks by limiting the amount of traffic they can observe. We use CoMPS to construct a website fingerprinting defense that is resilient against traffic analysis attacks by a powerful adaptive adversary in the open-world setting. We evaluate our system using both simulated splitting data and real-world traffic that is actively split using CoMPS. In our real-world experiments, CoMPS reduces the precision and recall of VarCNN to 29.9% and 36.7% respectively in the open-world setting with 100 monitored classes. CoMPS is not only immediately deployable with any unaltered server that supports connection migration, but also incurs little overhead, decreasing throughput by only 5-20%. ",
    "url": "https://arxiv.org/abs/2205.03326",
    "authors": [
      "Mona Wang",
      "Anunay Kulshrestha",
      "Liang Wang",
      "Prateek Mittal"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.03328",
    "title": "Age of Gossip in Ring Networks in the Presence of Jamming Attacks",
    "abstract": "We consider a system with a source which maintains the most current version of a file, and a ring network of $n$ user nodes that wish to acquire the latest version of the file. The source gets updated with newer file versions as a point process, and forwards them to the user nodes, which further forward them to their neighbors using a memoryless gossip protocol. We study the average version age of this network in the presence of $\\tilde{n}$ jammers that disrupt inter-node communications. To this purpose, we construct an alternate system model of mini-rings and prove that the version age of the original model can be sandwiched between constant multiples of the version age of the alternate model. We show that when the number of jammers scales as a fractional power of the network size, i.e., $\\tilde n= cn^\\alpha$, the version age scales as $\\sqrt{n}$ when $\\alpha < \\frac{1}{2}$, and as $n^{\\alpha}$ when $\\alpha \\geq \\frac{1}{2}$. As the version age of a ring network without any jammers scales as $\\sqrt{n}$, our result implies that the version age with gossiping is robust against up to $\\sqrt{n}$ jammers in a ring network. ",
    "url": "https://arxiv.org/abs/2205.03328",
    "authors": [
      "Priyanka Kaswan",
      "Sennur Ulukus"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.03335",
    "title": "UAV-aided RF Mapping for Sensing and Connectivity in Wireless Networks",
    "abstract": "The use of unmanned aerial vehicles (UAV) as flying radio access network (RAN) nodes offers a promising complement to traditional fixed terrestrial deployments. More recently yet still in the context of wireless networks, drones have also been envisioned for use as radio frequency (RF) sensing and localization devices. In both cases, the advantage of using UAVs lies in their ability to navigate themselves freely in 3D and in a timely manner to locations of space where the obtained network throughput or sensing performance is optimal. In practice, the selection of a proper location or trajectory for the UAV very much depends on local terrain features, including the position of surrounding radio obstacles. Hence, the robot must be able to map the features of its radio environment as it performs its data communication or sensing services. The challenges related to this task, referred here as radio mapping, are discussed in this paper. Its promises related to efficient trajectory design for autonomous radio-aware UAVs are highlighted, along with algorithm solutions. The advantages induced by radio-mapping in terms of connectivity, sensing, and localization performance are illustrated. ",
    "url": "https://arxiv.org/abs/2205.03335",
    "authors": [
      "David Gesbert",
      "Omid Esrafilian",
      "Junting Chen",
      "Rajeev Gangula",
      "Urbashi Mitra"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2205.03336",
    "title": "Statistical Data Privacy: A Song of Privacy and Utility",
    "abstract": "To quantify trade-offs between increasing demand for open data sharing and concerns about sensitive information disclosure, statistical data privacy (SDP) methodology analyzes data release mechanisms which sanitize outputs based on confidential data. Two dominant frameworks exist: statistical disclosure control (SDC), and more recent, differential privacy (DP). Despite framing differences, both SDC and DP share the same statistical problems at its core. For inference problems, we may either design optimal release mechanisms and associated estimators that satisfy bounds on disclosure risk, or we may adjust existing sanitized output to create new optimal estimators. Both problems rely on uncertainty quantification in evaluating risk and utility. In this review, we discuss the statistical foundations common to both SDC and DP, highlight major developments in SDP, and present exciting open research problems in private inference. ",
    "url": "https://arxiv.org/abs/2205.03336",
    "authors": [
      "Aleksandra Slavkovic",
      "Jeremy Seeman"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2205.03338",
    "title": "Domain-Level Detection and Disruption of Disinformation",
    "abstract": "How, in 20 short years, did we go from the promise of the internet to democratize access to knowledge and make the world more understanding and enlightened, to the litany of daily horrors that is today's internet? We are awash in disinformation consisting of lies, conspiracies, and general nonsense, all with real-world implications ranging from horrific humans rights violations to threats to our democracy and global public health. Although the internet is vast, the peddlers of disinformation appear to be more localized. To this end, we describe a domain-level analysis for predicting if a domain is complicit in distributing or amplifying disinformation. This process analyzes the underlying domain content and the hyperlinking connectivity between domains to predict if a domain is peddling in disinformation. These basic insights extend to an analysis of disinformation on Telegram and Twitter. From these insights, we propose that search engines and social-media recommendation algorithms can systematically discover and demote the worst disinformation offenders, returning some trust and sanity to our online communities. ",
    "url": "https://arxiv.org/abs/2205.03338",
    "authors": [
      "Elliott Waissbluth",
      "Hany Farid",
      "Vibhor Sehgal",
      "Ankit Peshin",
      "Sadia Afroz"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2205.03346",
    "title": "Multitask AET with Orthogonal Tangent Regularity for Dark Object  Detection",
    "abstract": "Dark environment becomes a challenge for computer vision algorithms owing to insufficient photons and undesirable noise. To enhance object detection in a dark environment, we propose a novel multitask auto encoding transformation (MAET) model which is able to explore the intrinsic pattern behind illumination translation. In a self-supervision manner, the MAET learns the intrinsic visual structure by encoding and decoding the realistic illumination-degrading transformation considering the physical noise model and image signal processing (ISP). Based on this representation, we achieve the object detection task by decoding the bounding box coordinates and classes. To avoid the over-entanglement of two tasks, our MAET disentangles the object and degrading features by imposing an orthogonal tangent regularity. This forms a parametric manifold along which multitask predictions can be geometrically formulated by maximizing the orthogonality between the tangents along the outputs of respective tasks. Our framework can be implemented based on the mainstream object detection architecture and directly trained end-to-end using normal target detection datasets, such as VOC and COCO. We have achieved the state-of-the-art performance using synthetic and real-world datasets. Code is available at https://github.com/cuiziteng/MAET. ",
    "url": "https://arxiv.org/abs/2205.03346",
    "authors": [
      "Ziteng Cui",
      "Guo-Jun Qi",
      "Lin Gu",
      "Shaodi You",
      "Zenghui Zhang",
      "Tatsuya Harada"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.03355",
    "title": "Trainable Wavelet Neural Network for Non-Stationary Signals",
    "abstract": "This work introduces a wavelet neural network to learn a filter-bank specialized to fit non-stationary signals and improve interpretability and performance for digital signal processing. The network uses a wavelet transform as the first layer of a neural network where the convolution is a parameterized function of the complex Morlet wavelet. Experimental results, on both simplified data and atmospheric gravity waves, show the network is quick to converge, generalizes well on noisy data, and outperforms standard network architectures. ",
    "url": "https://arxiv.org/abs/2205.03355",
    "authors": [
      "Jason Stock",
      "Chuck Anderson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.03371",
    "title": "All Grains, One Scheme (AGOS): Learning Multi-grain Instance  Representation for Aerial Scene Classification",
    "abstract": "Aerial scene classification remains challenging as: 1) the size of key objects in determining the scene scheme varies greatly; 2) many objects irrelevant to the scene scheme are often flooded in the image. Hence, how to effectively perceive the region of interests (RoIs) from a variety of sizes and build more discriminative representation from such complicated object distribution is vital to understand an aerial scene. In this paper, we propose a novel all grains, one scheme (AGOS) framework to tackle these challenges. To the best of our knowledge, it is the first work to extend the classic multiple instance learning into multi-grain formulation. Specially, it consists of a multi-grain perception module (MGP), a multi-branch multi-instance representation module (MBMIR) and a self-aligned semantic fusion (SSF) module. Firstly, our MGP preserves the differential dilated convolutional features from the backbone, which magnifies the discriminative information from multi-grains. Then, our MBMIR highlights the key instances in the multi-grain representation under the MIL formulation. Finally, our SSF allows our framework to learn the same scene scheme from multi-grain instance representations and fuses them, so that the entire framework is optimized as a whole. Notably, our AGOS is flexible and can be easily adapted to existing CNNs in a plug-and-play manner. Extensive experiments on UCM, AID and NWPU benchmarks demonstrate that our AGOS achieves a comparable performance against the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2205.03371",
    "authors": [
      "Qi Bi",
      "Beichen Zhou",
      "Kun Qin",
      "Qinghao Ye",
      "Gui-Song Xia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.03377",
    "title": "Physics-informed neural networks for PDE-constrained optimization and  control",
    "abstract": "A fundamental problem of science is designing optimal control policies that manipulate a given environment into producing a desired outcome. Control Physics-Informed Neural Networks simultaneously solve a given system state, and its respective optimal control, in a one-stage framework that conforms to physical laws of the system. Prior approaches use a two-stage framework that models and controls a system sequentially, whereas Control PINNs incorporates the required optimality conditions in its architecture and loss function. The success of Control PINNs is demonstrated by solving the following open-loop optimal control problems: (i) an analytical problem (ii) a one-dimensional heat equation, and (iii) a two-dimensional predator-prey problem. ",
    "url": "https://arxiv.org/abs/2205.03377",
    "authors": [
      "Jostein Barry-Straume",
      "Arash Sarshar",
      "Andrey A. Popov",
      "Adrian Sandu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2205.03381",
    "title": "MINI: Mining Implicit Novel Instances for Few-Shot Object Detection",
    "abstract": "Learning from a few training samples is a desirable ability of an object detector, inspiring the explorations of Few-Shot Object Detection (FSOD). Most existing approaches employ a pretrain-transfer paradigm. The model is first pre-trained on base classes with abundant data and then transferred to novel classes with a few annotated samples. Despite the substantial progress, the FSOD performance is still far behind satisfactory. During pre-training, due to the co-occurrence between base and novel classes, the model is learned to treat the co-occurred novel classes as backgrounds. During transferring, given scarce samples of novel classes, the model suffers from learning discriminative features to distinguish novel instances from backgrounds and base classes. To overcome the obstacles, we propose a novel framework, Mining Implicit Novel Instances (MINI), to mine the implicit novel instances as auxiliary training samples, which widely exist in abundant base data but are not annotated. MINI comprises an offline mining mechanism and an online mining mechanism. The offline mining mechanism leverages a self-supervised discriminative model to collaboratively mine implicit novel instances with a trained FSOD network. Taking the mined novel instances as auxiliary training samples, the online mining mechanism takes a teacher-student framework to simultaneously update the FSOD network and the mined implicit novel instances on the fly. Extensive experiments on PASCAL VOC and MS-COCO datasets show MINI achieves new state-of-the-art performance on any shot and split. The significant performance improvements demonstrate the superiority of our method. ",
    "url": "https://arxiv.org/abs/2205.03381",
    "authors": [
      "Yuhang Cao",
      "Jiaqi Wang",
      "Yiqi Lin",
      "Dahua Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.03391",
    "title": "Journaling Data for Daily PHQ-2 Depression Prediction and Forecasting",
    "abstract": "Digital health applications are becoming increasingly important for assessing and monitoring the wellbeing of people suffering from mental health conditions like depression. A common target of said applications is to predict the results of self-assessed Patient-Health-Questionnaires (PHQ), indicating current symptom severity of depressive individuals. In this work, we explore the potential of using actively-collected data to predict and forecast daily PHQ-2 scores on a newly-collected longitudinal dataset. We obtain a best MAE of 1.417 for daily prediction of PHQ-2 scores, which specifically in the used dataset have a range of 0 to 12, using leave-one-subject-out cross-validation, as well as a best MAE of 1.914 for forecasting PHQ-2 scores using data from up to the last 7 days. This illustrates the additive value that can be obtained by incorporating actively-collected data in a depression monitoring application. ",
    "url": "https://arxiv.org/abs/2205.03391",
    "authors": [
      "Alexander Kathan",
      "Andreas Triantafyllopoulos",
      "Xiangheng He",
      "Manuel Milling",
      "Tianhao Yan",
      "Srividya Tirunellai Rajamani",
      "Ludwig Küster",
      "Mathias Harrer",
      "Elena Heber",
      "Inga Grossmann",
      "David D. Ebert",
      "Björn W. Schuller"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.02840",
    "title": "GAN Inversion for Data Augmentation to Improve Colonoscopy Lesion  Classification",
    "abstract": "A major challenge in applying deep learning to medical imaging is the paucity of annotated data. This study demonstrates that synthetic colonoscopy images generated by Generative Adversarial Network (GAN) inversion can be used as training data to improve the lesion classification performance of deep learning models. This approach inverts pairs of images with the same label to a semantically rich & disentangled latent space and manipulates latent representations to produce new synthetic images with the same label. We perform image modality translation (style transfer) between white light and narrowband imaging (NBI). We also generate realistic-looking synthetic lesion images by interpolating between original training images to increase the variety of lesion shapes in the training dataset. We show that these approaches outperform comparative colonoscopy data augmentation techniques without the need to re-train multiple generative models. This approach also leverages information from datasets that may not have been designed for the specific colonoscopy downstream task. E.g. using a bowel prep grading dataset for a polyp classification task. Our experiments show this approach can perform multiple colonoscopy data augmentations, which improve the downstream polyp classification performance over baseline and comparison methods by up to 6%. ",
    "url": "https://arxiv.org/abs/2205.02840",
    "authors": [
      "Mayank Golhar",
      "Taylor L. Bobrow",
      "Saowanee Ngamruengphong",
      "Nicholas J. Durr"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02842",
    "title": "InvNorm: Domain Generalization for Object Detection in Gastrointestinal  Endoscopy",
    "abstract": "Domain Generalization is a challenging topic in computer vision, especially in Gastrointestinal Endoscopy image analysis. Due to several device limitations and ethical reasons, current open-source datasets are typically collected on a limited number of patients using the same brand of sensors. Different brands of devices and individual differences will significantly affect the model's generalizability. Therefore, to address the generalization problem in GI(Gastrointestinal) endoscopy, we propose a multi-domain GI dataset and a light, plug-in block called InvNorm(Invertible Normalization), which could achieve a better generalization performance in any structure. Previous DG(Domain Generalization) methods fail to achieve invertible transformation, which would lead to some misleading augmentation. Moreover, these models would be more likely to lead to medical ethics issues. Our method utilizes normalizing flow to achieve invertible and explainable style normalization to address the problem. The effectiveness of InvNorm is demonstrated on a wide range of tasks, including GI recognition, GI object detection, and natural image recognition. ",
    "url": "https://arxiv.org/abs/2205.02842",
    "authors": [
      "Weichen Fan",
      "Yuanbo Yang",
      "Kunpeng Qiu",
      "Shuo Wang",
      "Yongxin Guo"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02843",
    "title": "Generative Adversarial Network Based Synthetic Learning and a Novel  Domain Relevant Loss Term for Spine Radiographs",
    "abstract": "Problem: There is a lack of big data for the training of deep learning models in medicine, characterized by the time cost of data collection and privacy concerns. Generative adversarial networks (GANs) offer both the potential to generate new data, as well as to use this newly generated data, without inclusion of patients' real data, for downstream applications. Approach: A series of GANs were trained and applied for a downstream computer vision spine radiograph abnormality classification task. Separate classifiers were trained with either access or no access to the original imaging. Trained GANs included a conditional StyleGAN2 with adaptive discriminator augmentation, a conditional StyleGAN2 with adaptive discriminator augmentation to generate spine radiographs conditional on lesion type, and using a novel clinical loss term for the generator a StyleGAN2 with adaptive discriminator augmentation conditional on abnormality (SpineGAN). Finally, a differential privacy imposed StyleGAN2 with adaptive discriminator augmentation conditional on abnormality was trained and an ablation study was performed on its differential privacy impositions. Key Results: We accomplish GAN generation of synthetic spine radiographs without meaningful input for the first time from a literature review. We further demonstrate the success of synthetic learning for the spine domain with a downstream clinical classification task (AUC of 0.830 using synthetic data compared to AUC of 0.886 using the real data). Importantly, the introduction of a new clinical loss term for the generator was found to increase generation recall as well as accelerate model training. Lastly, we demonstrate that, in a limited size medical dataset, differential privacy impositions severely impede GAN training, finding that this is specifically due to the requirement for gradient perturbation with noise. ",
    "url": "https://arxiv.org/abs/2205.02843",
    "authors": [
      "Ethan Schonfeld",
      "Anand Veeravagu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02848",
    "title": "Building Brains: Subvolume Recombination for Data Augmentation in Large  Vessel Occlusion Detection",
    "abstract": "Ischemic strokes are often caused by large vessel occlusions (LVOs), which can be visualized and diagnosed with Computed Tomography Angiography scans. As time is brain, a fast, accurate and automated diagnosis of these scans is desirable. Human readers compare the left and right hemispheres in their assessment of strokes. A large training data set is required for a standard deep learning-based model to learn this strategy from data. As labeled medical data in this field is rare, other approaches need to be developed. To both include the prior knowledge of side comparison and increase the amount of training data, we propose an augmentation method that generates artificial training samples by recombining vessel tree segmentations of the hemispheres or hemisphere subregions from different patients. The subregions cover vessels commonly affected by LVOs, namely the internal carotid artery (ICA) and middle cerebral artery (MCA). In line with the augmentation scheme, we use a 3D-DenseNet fed with task-specific input, fostering a side-by-side comparison between the hemispheres. Furthermore, we propose an extension of that architecture to process the individual hemisphere subregions. All configurations predict the presence of an LVO, its side, and the affected subregion. We show the effect of recombination as an augmentation strategy in a 5-fold cross validated ablation study. We enhanced the AUC for patient-wise classification regarding the presence of an LVO of all investigated architectures. For one variant, the proposed method improved the AUC from 0.73 without augmentation to 0.89. The best configuration detects LVOs with an AUC of 0.91, LVOs in the ICA with an AUC of 0.96, and in the MCA with 0.91 while accurately predicting the affected side. ",
    "url": "https://arxiv.org/abs/2205.02848",
    "authors": [
      "Florian Thamm",
      "Oliver Taubmann",
      "Markus Jürgens",
      "Aleksandra Thamm",
      "Felix Denzinger",
      "Leonhard Rist",
      "Hendrik Ditt",
      "Andreas Maier"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02879",
    "title": "Exploiting Ligand Additivity for Transferable Machine Learning of  Multireference Character Across Known Transition Metal Complex Ligands",
    "abstract": "Accurate virtual high-throughput screening (VHTS) of transition metal complexes (TMCs) remains challenging due to the possibility of high multi-reference (MR) character that complicates property evaluation. We compute MR diagnostics for over 5,000 ligands present in previously synthesized transition metal complexes in the Cambridge Structural Database (CSD). To accomplish this task, we introduce an iterative approach for consistent ligand charge assignment for ligands in the CSD. Across this set, we observe that MR character correlates linearly with the inverse value of the averaged bond order over all bonds in the molecule. We then demonstrate that ligand additivity of MR character holds in TMCs, which suggests that the TMC MR character can be inferred from the sum of the MR character of the ligands. Encouraged by this observation, we leverage ligand additivity and develop a ligand-derived machine learning representation to train neural networks to predict the MR character of TMCs from properties of the constituent ligands. This approach yields models with excellent performance and superior transferability to unseen ligand chemistry and compositions. ",
    "url": "https://arxiv.org/abs/2205.02879",
    "authors": [
      "Chenru Duan",
      "Adriana J. Ladera",
      "Julian C.-L. Liu",
      "Michael G. Taylor",
      "Isuru R. Ariyarathna",
      "Heather J. Kulik"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)",
      "Chemical Physics (physics.chem-ph)"
    ]
  },
  {
    "id": "arXiv:2205.02935",
    "title": "Explainable multi-class anomaly detection on functional data",
    "abstract": "In this paper we describe an approach for anomaly detection and its explainability in multivariate functional data. The anomaly detection procedure consists of transforming the series into a vector of features and using an Isolation forest algorithm. The explainable procedure is based on the computation of the SHAP coefficients and on the use of a supervised decision tree. We apply it on simulated data to measure the performance of our method and on real data coming from industry. ",
    "url": "https://arxiv.org/abs/2205.02935",
    "authors": [
      "Mathieu Cura",
      "Katarina Firdova",
      "Céline Labart",
      "Arthur Martel"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2205.03174",
    "title": "Analysis of Multiple Overlapping Paths algorithms for Secure Key  Exchange in Large-Scale Quantum Networks",
    "abstract": "Quantum networks open the way to an unprecedented level of communication security. However, due to physical limitations on the distances of quantum links, current implementations of quantum networks are unavoidably equipped with trusted nodes. As a consequence, the quantum key distribution can be performed only on the links. Due to this, some new authentication and key exchange schemes must be considered to fully benefit from the unconditional security of links. One such approach uses Multiple Non-Overlapping Paths (MNOPs) for key exchange to mitigate the risk of an attack on a trusted node. The scope of the article is to perform a security analysis of this scheme for the case of both uncorrelated attacks and correlated attacks with finite resources. Furthermore, our analysis is extended to the case of Multiple Overlapping Paths (MOPs). We prove that introducing overlapping paths allows one to increase the security of the protocol, compared to the non-overlapping case with the same number of additional links added. This result may find application in optimising architectures of large-scale (hybrid) quantum networks. ",
    "url": "https://arxiv.org/abs/2205.03174",
    "authors": [
      "Mateusz Stępniak",
      "Jakub Mielczarek"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.03194",
    "title": "Scalable computation of prediction intervals for neural networks via  matrix sketching",
    "abstract": "Accounting for the uncertainty in the predictions of modern neural networks is a challenging and important task in many domains. Existing algorithms for uncertainty estimation require modifying the model architecture and training procedure (e.g., Bayesian neural networks) or dramatically increase the computational cost of predictions such as approaches based on ensembling. This work proposes a new algorithm that can be applied to a given trained neural network and produces approximate prediction intervals. The method is based on the classical delta method in statistics but achieves computational efficiency by using matrix sketching to approximate the Jacobian matrix. The resulting algorithm is competitive with state-of-the-art approaches for constructing predictive intervals on various regression datasets from the UCI repository. ",
    "url": "https://arxiv.org/abs/2205.03194",
    "authors": [
      "Alexander Fishkov",
      "Maxim Panov"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.03234",
    "title": "Real Time On Sensor Gait Phase Detection with 0.5KB Deep Learning Model",
    "abstract": "Gait phase detection with convolution neural network provides accurate classification but demands high computational cost, which inhibits real time low power on-sensor processing. This paper presents a segmentation based gait phase detection with a width and depth downscaled U-Net like model that only needs 0.5KB model size and 67K operations per second with 95.9% accuracy to be easily fitted into resource limited on sensor microcontroller. ",
    "url": "https://arxiv.org/abs/2205.03234",
    "authors": [
      "Yi-An Chen",
      "Jien-De Sui",
      "Tian-Sheuan Chang"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.03238",
    "title": "Ultra-sensitive Flexible Sponge-Sensor Array for Muscle Activities  Detection and Human Limb Motion Recognition",
    "abstract": "Human limb motion tracking and recognition plays an important role in medical rehabilitation training, lower limb assistance, prosthetics design for amputees, feedback control for assistive robots, etc. Lightweight wearable sensors, including inertial sensors, surface electromyography sensors, and flexible strain/pressure, are promising to become the next-generation human motion capture devices. Herein, we present a wireless wearable device consisting of a sixteen-channel flexible sponge-based pressure sensor array to recognize various human lower limb motions by detecting contours on the human skin caused by calf gastrocnemius muscle actions. Each sensing element is a round porous structure of thin carbon nanotube/polydimethylsiloxane nanocomposites with a diameter of 4 mm and thickness of about 400 {\\mu}m. Three human subjects were recruited to perform ten different lower limb motions while wearing the developed device. The motion classification result with the support vector machine method shows a macro-recall of about 94.48% for all ten motions tested. This work demonstrates a portable wearable muscle activity detection device with a lower limb motion recognition application, which can be potentially used in assistive robot control, healthcare, sports monitoring, etc. ",
    "url": "https://arxiv.org/abs/2205.03238",
    "authors": [
      "Jiao Suo",
      "Yifan Liu",
      "Clio Cheng",
      "Keer Wang",
      "Meng Chen",
      "Ho-yin Chan",
      "Roy Vellaisamy",
      "Ning Xi",
      "Vivian W. O. Lou",
      "Wen Jung Li"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.03239",
    "title": "Multichannel Synthetic Preictal EEG Signals to Enhance the Prediction of  Epileptic Seizures",
    "abstract": "Epilepsy is a chronic neurological disorder affecting 1\\% of people worldwide, deep learning (DL) algorithms-based electroencephalograph (EEG) analysis provides the possibility for accurate epileptic seizure (ES) prediction, thereby benefiting patients suffering from epilepsy. To identify the preictal region that precedes the onset of seizure, a large number of annotated EEG signals are required to train DL algorithms. However, the scarcity of seizure onsets leads to significant insufficiency of data for training the DL algorithms. To overcome this data insufficiency, in this paper, we propose a preictal artificial signal synthesis algorithm based on a generative adversarial network to generate synthetic multichannel EEG preictal samples. A high-quality single-channel architecture, determined by visual and statistical evaluations, is used to train the generators of multichannel samples. The effectiveness of the synthetic samples is evaluated by comparing the ES prediction performances without and with synthetic preictal sample augmentation. The leave-one-seizure-out cross validation ES prediction accuracy and corresponding area under the receiver operating characteristic curve evaluation improve from 73.0\\% and 0.676 to 78.0\\% and 0.704 by 10$\\times$ synthetic sample augmentation, respectively. The obtained results indicate that synthetic preictal samples are effective for enhancing ES prediction performance. ",
    "url": "https://arxiv.org/abs/2205.03239",
    "authors": [
      "Yankun Xu",
      "Jie Yang",
      "Mohamad Sawan"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2003.09869",
    "title": "Progressive Domain-Independent Feature Decomposition Network for  Zero-Shot Sketch-Based Image Retrieval",
    "abstract": " Title: Progressive Domain-Independent Feature Decomposition Network for  Zero-Shot Sketch-Based Image Retrieval ",
    "url": "https://arxiv.org/abs/2003.09869",
    "authors": [
      "Xinxun Xu",
      "Muli Yang",
      "Yanhua Yang",
      "Hao Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2004.04040",
    "title": "Investigation of Singing Voice Separation for Singing Voice Detection in  Polyphonic Music",
    "abstract": " Comments: Accepted by CSMT (The 9th Conference on Sound and Music Technology) ",
    "url": "https://arxiv.org/abs/2004.04040",
    "authors": [
      "Yifu Sun",
      "Xulong Zhang",
      "Yi Yu",
      "Xi Chen",
      "Wei Li"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2009.09961",
    "title": "Adjusting for Confounders with Text: Challenges and an Empirical  Evaluation Framework for Causal Inference",
    "abstract": " Comments: to appear at ICWSM 2022 ",
    "url": "https://arxiv.org/abs/2009.09961",
    "authors": [
      "Galen Weld",
      "Peter West",
      "Maria Glenski",
      "David Arbour",
      "Ryan Rossi",
      "Tim Althoff"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2103.15059",
    "title": "A Benchmark and Comprehensive Survey on Knowledge Graph Entity Alignment  via Representation Learning",
    "abstract": " Comments: to appear in VLDB Journal, 2022 ",
    "url": "https://arxiv.org/abs/2103.15059",
    "authors": [
      "Rui Zhang",
      "Bayu Distiawan Trisedy",
      "Miao Li",
      "Yong Jiang",
      "Jianzhong Qi"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2105.08693",
    "title": "Conflict-Free Coloring: Graphs of Bounded Clique Width and Intersection  Graphs",
    "abstract": " Title: Conflict-Free Coloring: Graphs of Bounded Clique Width and Intersection  Graphs ",
    "url": "https://arxiv.org/abs/2105.08693",
    "authors": [
      "Sriram Bhyravarapu",
      "Tim A. Hartmann",
      "Hung P. Hoang",
      "Subrahmanyam Kalyanasundaram",
      "I. Vinod Reddy"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2105.09711",
    "title": "An Attractor-Guided Neural Networks for Skeleton-Based Human Motion  Prediction",
    "abstract": " Title: An Attractor-Guided Neural Networks for Skeleton-Based Human Motion  Prediction ",
    "url": "https://arxiv.org/abs/2105.09711",
    "authors": [
      "Pengxiang Ding",
      "Junying Wang",
      "Jianqin Yin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.13585",
    "title": "Information Fragmentation, Encryption and Information Flow in Complex  Biological Networks",
    "abstract": " Title: Information Fragmentation, Encryption and Information Flow in Complex  Biological Networks ",
    "url": "https://arxiv.org/abs/2105.13585",
    "authors": [
      "Clifford Bohm",
      "Douglas Kirkpatrick",
      "Victoria Cao",
      "Christoph Adami"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2106.04066",
    "title": "Semantically Adversarial Driving Scenario Generation with Explicit  Knowledge Integration",
    "abstract": " Comments: 14 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2106.04066",
    "authors": [
      "Wenhao Ding",
      "Haohong Lin",
      "Bo Li",
      "Kim Ji Eun",
      "Ding Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2106.08265",
    "title": "Towards Total Recall in Industrial Anomaly Detection",
    "abstract": " Comments: Accepted to CVPR 2022 ",
    "url": "https://arxiv.org/abs/2106.08265",
    "authors": [
      "Karsten Roth",
      "Latha Pemula",
      "Joaquin Zepeda",
      "Bernhard Schölkopf",
      "Thomas Brox",
      "Peter Gehler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.05087",
    "title": "Remote Blood Oxygen Estimation From Videos Using Neural Networks",
    "abstract": " Title: Remote Blood Oxygen Estimation From Videos Using Neural Networks ",
    "url": "https://arxiv.org/abs/2107.05087",
    "authors": [
      "Joshua Mathew",
      "Xin Tian",
      "Min Wu",
      "Chau-Wai Wong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2107.10037",
    "title": "A novel method for assessing and measuring homophily in networks through  second-order statistics",
    "abstract": " Title: A novel method for assessing and measuring homophily in networks through  second-order statistics ",
    "url": "https://arxiv.org/abs/2107.10037",
    "authors": [
      "Nicola Apollonio",
      "Paolo Giulio Franciosa",
      "Daniele Santoni"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2108.01176",
    "title": "Hierarchical Representations and Explicit Memory: Learning Effective  Navigation Policies on 3D Scene Graphs using Graph Neural Networks",
    "abstract": " Comments: Accepted by the International Conference on Robotics and Automation (ICRA) 2022 ",
    "url": "https://arxiv.org/abs/2108.01176",
    "authors": [
      "Zachary Ravichandran",
      "Lisa Peng",
      "Nathan Hughes",
      "J. Daniel Griffith",
      "Luca Carlone"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.10129",
    "title": "Learning General Optimal Policies with Graph Neural Networks: Expressive  Power, Transparency, and Limits",
    "abstract": " Comments: Proceedings of the 32nd International Conference on Automated Planning and Scheduling (ICAPS-22) ",
    "url": "https://arxiv.org/abs/2109.10129",
    "authors": [
      "Simon Ståhlberg",
      "Blai Bonet",
      "Hector Geffner"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.14885",
    "title": "Out-of-Distribution Detection for Medical Applications: Guidelines for  Practical Evaluation",
    "abstract": " Title: Out-of-Distribution Detection for Medical Applications: Guidelines for  Practical Evaluation ",
    "url": "https://arxiv.org/abs/2109.14885",
    "authors": [
      "Karina Zadorozhny",
      "Patrick Thoral",
      "Paul Elbers",
      "Giovanni Cinà"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.14170",
    "title": "Meta-Knowledge Transfer for Inductive Knowledge Graph Embedding",
    "abstract": " Comments: SIGIR 2022 ",
    "url": "https://arxiv.org/abs/2110.14170",
    "authors": [
      "Mingyang Chen",
      "Wen Zhang",
      "Yushan Zhu",
      "Hongting Zhou",
      "Zonggang Yuan",
      "Changliang Xu",
      "Huajun Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2111.06916",
    "title": "Offense Detection in Dravidian Languages using Code-Mixing Index based  Focal Loss",
    "abstract": " Comments: Accepted for publication at SN Computer Science Journal ",
    "url": "https://arxiv.org/abs/2111.06916",
    "authors": [
      "Debapriya Tula",
      "Shreyas MS",
      "Viswanatha Reddy",
      "Pranjal Sahu",
      "Sumanth Doddapaneni",
      "Prathyush Potluri",
      "Rohan Sukumaran",
      "Parth Patwa"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.12157",
    "title": "Bayesian Sample Size Prediction for Online Activity",
    "abstract": " Comments: 10 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2111.12157",
    "authors": [
      "Thomas Richardson",
      "Yu Liu",
      "James McQueen",
      "Doug Hains"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.09159",
    "title": "Implementation of a Binary Neural Network on a Passive Array of Magnetic  Tunnel Junctions",
    "abstract": " Comments: 22 pages plus 8 pages supplemental material; 7 figures plus 7 supplemental figures ",
    "url": "https://arxiv.org/abs/2112.09159",
    "authors": [
      "Jonathan M. Goodwill",
      "Nitin Prasad",
      "Brian D. Hoskins",
      "Matthew W. Daniels",
      "Advait Madhavan",
      "Lei Wan",
      "Tiffany S. Santos",
      "Michael Tran",
      "Jordan A. Katine",
      "Patrick M. Braganca",
      "Mark D. Stiles",
      "Jabez J. McClelland"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)",
      "Applied Physics (physics.app-ph)"
    ]
  },
  {
    "id": "arXiv:2201.09751",
    "title": "Adversarial Classification under Gaussian Mechanism: Calibrating the  Attack to Sensitivity",
    "abstract": " Title: Adversarial Classification under Gaussian Mechanism: Calibrating the  Attack to Sensitivity ",
    "url": "https://arxiv.org/abs/2201.09751",
    "authors": [
      "Ayse Unsal",
      "Melek Onen"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2202.01630",
    "title": "A deep complex multi-frame filtering network for stereophonic acoustic  echo cancellation",
    "abstract": " Title: A deep complex multi-frame filtering network for stereophonic acoustic  echo cancellation ",
    "url": "https://arxiv.org/abs/2202.01630",
    "authors": [
      "Linjuan Cheng",
      "Chengshi Zheng",
      "Andong Li",
      "Yuquan Wu",
      "Renhua Peng",
      "Xiaodong Li"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2202.05894",
    "title": "Failure Prediction with Statistical Guarantees for Vision-Based Robot  Control",
    "abstract": " Title: Failure Prediction with Statistical Guarantees for Vision-Based Robot  Control ",
    "url": "https://arxiv.org/abs/2202.05894",
    "authors": [
      "Alec Farid",
      "David Snyder",
      "Allen Z. Ren",
      "Anirudha Majumdar"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2202.06509",
    "title": "PR-PL: A Novel Transfer Learning Framework with Prototypical  Representation based Pairwise Learning for EEG-Based Emotion Recognition",
    "abstract": " Title: PR-PL: A Novel Transfer Learning Framework with Prototypical  Representation based Pairwise Learning for EEG-Based Emotion Recognition ",
    "url": "https://arxiv.org/abs/2202.06509",
    "authors": [
      "Rushuang Zhou",
      "Zhiguo Zhang",
      "Hong Fu",
      "Li Zhang",
      "Linling Li",
      "Gan Huang",
      "Yining Dong",
      "Fali Li",
      "Xin Yang",
      "Zhen Liang"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2202.09994",
    "title": "Transferring Adversarial Robustness Through Robust Representation  Matching",
    "abstract": " Comments: To appear at USENIX Security '22. Updated version with artifact evaluation badges and appendix ",
    "url": "https://arxiv.org/abs/2202.09994",
    "authors": [
      "Pratik Vaishnavi",
      "Kevin Eykholt",
      "Amir Rahmati"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.00324",
    "title": "Differentially private training of residual networks with scale  normalisation",
    "abstract": " Comments: Submitted as paper to TPDP at ICML 2022 ",
    "url": "https://arxiv.org/abs/2203.00324",
    "authors": [
      "Helena Klause",
      "Alexander Ziller",
      "Daniel Rueckert",
      "Kerstin Hammernik",
      "Georgios Kaissis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.01993",
    "title": "Polarity Sampling: Quality and Diversity Control of Pre-Trained  Generative Networks via Singular Values",
    "abstract": " Comments: 20 pages, 16 figures, CVPR 2022 Oral, Camera Ready ",
    "url": "https://arxiv.org/abs/2203.01993",
    "authors": [
      "Ahmed Imtiaz Humayun",
      "Randall Balestriero",
      "Richard Baraniuk"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.08669",
    "title": "MPAF: Model Poisoning Attacks to Federated Learning based on Fake  Clients",
    "abstract": " Comments: In CVPR Workshops, 2022 ",
    "url": "https://arxiv.org/abs/2203.08669",
    "authors": [
      "Xiaoyu Cao",
      "Neil Zhenqiang Gong"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.09193",
    "title": "Database of Indian Social Media Influencers on Twitter",
    "abstract": " Comments: 7 pages (incl. references), 2 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2203.09193",
    "authors": [
      "Arshia Arya",
      "Soham De",
      "Dibyendu Mishra",
      "Gazal Shekhawat",
      "Ankur Sharma",
      "Anmol Panda",
      "Faisal Lalani",
      "Parantak Singh",
      "Ramaravind Kommiya Mothilal",
      "Rynaa Grover",
      "Sachita Nishal",
      "Saloni Dash",
      "Shehla Shora",
      "Syeda Zainab Akbar",
      "Joyojeet Pal"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2203.15212",
    "title": "Are Edge Weights in Summary Graphs Useful? -- A Comparative Study",
    "abstract": " Comments: To be published in the 26th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD 2022) ",
    "url": "https://arxiv.org/abs/2203.15212",
    "authors": [
      "Shinhwan Kang",
      "Kyuhan Lee",
      "Kijung Shin"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2203.17149",
    "title": "AEGNN: Asynchronous Event-based Graph Neural Networks",
    "abstract": " Comments: IEEE Conference on Computer Vision and Pattern Recognition (CVPR), New Orleans, 2022 ",
    "url": "https://arxiv.org/abs/2203.17149",
    "authors": [
      "Simon Schaefer",
      "Daniel Gehrig",
      "Davide Scaramuzza"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.07889",
    "title": "SymForce: Symbolic Computation and Code Generation for Robotics",
    "abstract": " Comments: 10 pages, 5 figures. RSS 2022 ",
    "url": "https://arxiv.org/abs/2204.07889",
    "authors": [
      "Hayk Martiros",
      "Aaron Miller",
      "Nathan Bucki",
      "Bradley Solliday",
      "Ryan Kennedy",
      "Jack Zhu",
      "Tung Dang",
      "Dominic Pattison",
      "Harrison Zheng",
      "Teo Tomic",
      "Peter Henry",
      "Gareth Cross",
      "Josiah VanderMey",
      "Alvin Sun",
      "Samuel Wang",
      "Kristen Holtz"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Symbolic Computation (cs.SC)"
    ]
  },
  {
    "id": "arXiv:2204.13256",
    "title": "Shielding Federated Learning: Robust Aggregation with Adaptive Client  Selection",
    "abstract": " Comments: This paper has been accepted by the 31st International Joint Conference on Artificial Intelligence (IJCAI-22, Main Track, LONG Oral Presentation) ",
    "url": "https://arxiv.org/abs/2204.13256",
    "authors": [
      "Wei Wan",
      "Shengshan Hu",
      "Jianrong Lu",
      "Leo Yu Zhang",
      "Hai Jin",
      "Yuanyuan He"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2204.13359",
    "title": "Poly-CAM: High resolution class activation map for convolutional neural  networks",
    "abstract": " Comments: The PolyCAM method was accepted at ICPR 2022 under the name \"Backward recursive Class Activation Map refinement for high resolution saliency map\" ",
    "url": "https://arxiv.org/abs/2204.13359",
    "authors": [
      "Alexandre Englebert",
      "Olivier Cornu",
      "Christophe De Vleeschouwer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.14099",
    "title": "Climate and Weather: Inspecting Depression Detection via Emotion  Recognition",
    "abstract": " Title: Climate and Weather: Inspecting Depression Detection via Emotion  Recognition ",
    "url": "https://arxiv.org/abs/2204.14099",
    "authors": [
      "Wen Wu",
      "Mengyue Wu",
      "Kai Yu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.00748",
    "title": "Dual networks based 3D Multi-Person Pose Estimation from Monocular Video",
    "abstract": " Comments: Accepted by TPAMI 2022. arXiv admin note: substantial text overlap with arXiv:2104.01797 ",
    "url": "https://arxiv.org/abs/2205.00748",
    "authors": [
      "Yu Cheng",
      "Bo Wang",
      "Robby T. Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.01355",
    "title": "Predicting Loose-Fitting Garment Deformations Using Bone-Driven Motion  Networks",
    "abstract": " Comments: SIGGRAPH 22 Conference Paper ",
    "url": "https://arxiv.org/abs/2205.01355",
    "authors": [
      "Xiaoyu Pan",
      "Jiaming Mai",
      "Xinwei Jiang",
      "Dongxue Tang",
      "Jingxiang Li",
      "Tianjia Shao",
      "Kun Zhou",
      "Xiaogang Jin",
      "Dinesh Manocha"
    ],
    "subjectives": [
      "Graphics (cs.GR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02105",
    "title": "Neuroevolutionary Multi-objective approaches to Trajectory Prediction in  Autonomous Vehicles",
    "abstract": " Comments: Accepted in Genetic and Evolutionary Computation Conference Companion (GECCO '22 Companion), July 9--13, 2022, Boston, MA, USA, 4 pages, 1 figure, 6 tables ",
    "url": "https://arxiv.org/abs/2205.02105",
    "authors": [
      "Fergal Stapleton",
      "Edgar Galván",
      "Ganesh Sistu",
      "Senthil Yogamani"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02216",
    "title": "The Extremal GDoF Gain of Optimal versus Binary Power Control in $K$  User Interference Networks Is $Θ(\\sqrt{K})$",
    "abstract": " Comments: 18 pages, 5 figures; Typo corrections ",
    "url": "https://arxiv.org/abs/2205.02216",
    "authors": [
      "Yao-Chia Chan",
      "Pouya Pezeshkpour",
      "Chunhua Geng",
      "Syed A. Jafar"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2205.02825",
    "title": "Dual Octree Graph Networks for Learning Adaptive Volumetric Shape  Representations",
    "abstract": " Comments: Accepted to SIGGRAPH 2022 ",
    "url": "https://arxiv.org/abs/2205.02825",
    "authors": [
      "Peng-Shuai Wang",
      "Yang Liu",
      "Xin Tong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  }
]