[
  {
    "id": "arXiv:2304.09864",
    "title": "GeoGraphViz: Geographically Constrained 3D Force-Directed Graph for  Knowledge Graph Visualization",
    "abstract": "Knowledge graphs are a key technique for linking and integrating cross-domain data, concepts, tools, and knowledge to enable data-driven analytics. As much of the worlds data have become massive in size, visualizing graph entities and their interrelationships intuitively and interactively has become a crucial task for ingesting and better utilizing graph content to support semantic reasoning, discovering hidden knowledge discovering, and better scientific understanding of geophysical and social phenomena. Despite the fact that many such phenomena (e.g., disasters) have clear spatial footprints and geographical properties, their location information is considered only as a textual label in existing graph visualization tools, limiting their capability to reveal the geospatial distribution patterns of the graph nodes. In addition, most graph visualization techniques rely on 2D graph visualization, which constraints the dimensions of information that can be presented and lacks support for graph structure examination from multiple angles. To tackle the above challenges, we developed a novel 3D map-based graph visualization algorithm to enable interactive exploration of graph content and patterns in a spatially explicit manner. The algorithm extends a 3D force directed graph by integrating a web map, an additional geolocational force, and a force balancing variable that allows for the dynamic adjustment of the 3D graph structure and layout. This mechanism helps create a balanced graph view between the semantic forces among the graph nodes and the attractive force from a geolocation to a graph node. Our solution offers a new perspective in visualizing and understanding spatial entities and events in a knowledge graph. ",
    "url": "https://arxiv.org/abs/2304.09864",
    "authors": [
      "Sizhe Wang",
      "Wenwen Li",
      "Zhining Gu"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2304.09874",
    "title": "Domain Adaptable Self-supervised Representation Learning on Remote  Sensing Satellite Imagery",
    "abstract": "This work presents a novel domain adaption paradigm for studying contrastive self-supervised representation learning and knowledge transfer using remote sensing satellite data. Major state-of-the-art remote sensing visual domain efforts primarily focus on fully supervised learning approaches that rely entirely on human annotations. On the other hand, human annotations in remote sensing satellite imagery are always subject to limited quantity due to high costs and domain expertise, making transfer learning a viable alternative. The proposed approach investigates the knowledge transfer of selfsupervised representations across the distinct source and target data distributions in depth in the remote sensing data domain. In this arrangement, self-supervised contrastive learning-based pretraining is performed on the source dataset, and downstream tasks are performed on the target datasets in a round-robin fashion. Experiments are conducted on three publicly available datasets, UC Merced Landuse (UCMD), SIRI-WHU, and MLRSNet, for different downstream classification tasks versus label efficiency. In self-supervised knowledge transfer, the proposed approach achieves state-of-the-art performance with label efficiency labels and outperforms a fully supervised setting. A more in-depth qualitative examination reveals consistent evidence for explainable representation learning. The source code and trained models are published on GitHub. ",
    "url": "https://arxiv.org/abs/2304.09874",
    "authors": [
      "Muskaan Chopra",
      "Prakash Chandra Chhipa",
      "Gopal Mengi",
      "Varun Gupta",
      "Marcus Liwicki"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.09875",
    "title": "GREAT Score: Global Robustness Evaluation of Adversarial Perturbation  using Generative Models",
    "abstract": "Current studies on adversarial robustness mainly focus on aggregating local robustness results from a set of data samples to evaluate and rank different models. However, the local statistics may not well represent the true global robustness of the underlying unknown data distribution. To address this challenge, this paper makes the first attempt to present a new framework, called GREAT Score , for global robustness evaluation of adversarial perturbation using generative models. Formally, GREAT Score carries the physical meaning of a global statistic capturing a mean certified attack-proof perturbation level over all samples drawn from a generative model. For finite-sample evaluation, we also derive a probabilistic guarantee on the sample complexity and the difference between the sample mean and the true mean. GREAT Score has several advantages: (1) Robustness evaluations using GREAT Score are efficient and scalable to large models, by sparing the need of running adversarial attacks. In particular, we show high correlation and significantly reduced computation cost of GREAT Score when compared to the attack-based model ranking on RobustBench (Croce,et. al. 2021). (2) The use of generative models facilitates the approximation of the unknown data distribution. In our ablation study with different generative adversarial networks (GANs), we observe consistency between global robustness evaluation and the quality of GANs. (3) GREAT Score can be used for remote auditing of privacy-sensitive black-box models, as demonstrated by our robustness evaluation on several online facial recognition services. ",
    "url": "https://arxiv.org/abs/2304.09875",
    "authors": [
      "Li Zaitang",
      "Pin-Yu Chen",
      "Tsung-Yi Ho"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.09910",
    "title": "Robust trajectory tracking for underactuated mechanical systems without  velocity measurements",
    "abstract": "In this paper, the notion of contraction is used to solve the trajectory-tracking problem for a class of mechanical systems. Additionally, we propose a dynamic extension to remove velocity measurements from the controller while rejecting matched disturbances. In particular, we propose three control designs stemming from the Interconnection and Damping Assignment Passivity-Based Control approach. The first controller is a tracker that does not require velocity measurements. The second control design solves the trajectory-tracking problem while guaranteeing robustness with respect to matched disturbances. Then, the third approach is a combination of both mentioned controllers. It is shown that all proposed design methods guarantee exponential convergence of the mechanical system to the desired (feasible) trajectory due to the contraction property of the closed-loop system. The applicability of this method is illustrated via the design of a controller for an underactuated mechanical system. ",
    "url": "https://arxiv.org/abs/2304.09910",
    "authors": [
      "N. Javanmardi",
      "P. Borja",
      "M. J. Yazdanpanah",
      "J. M. A. Scherpen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.09915",
    "title": "DCN-T: Dual Context Network with Transformer for Hyperspectral Image  Classification",
    "abstract": "Hyperspectral image (HSI) classification is challenging due to spatial variability caused by complex imaging conditions. Prior methods suffer from limited representation ability, as they train specially designed networks from scratch on limited annotated data. We propose a tri-spectral image generation pipeline that transforms HSI into high-quality tri-spectral images, enabling the use of off-the-shelf ImageNet pretrained backbone networks for feature extraction. Motivated by the observation that there are many homogeneous areas with distinguished semantic and geometric properties in HSIs, which can be used to extract useful contexts, we propose an end-to-end segmentation network named DCN-T. It adopts transformers to effectively encode regional adaptation and global aggregation spatial contexts within and between the homogeneous areas discovered by similarity-based clustering. To fully exploit the rich spectrums of the HSI, we adopt an ensemble approach where all segmentation results of the tri-spectral images are integrated into the final prediction through a voting scheme. Extensive experiments on three public benchmarks show that our proposed method outperforms state-of-the-art methods for HSI classification. ",
    "url": "https://arxiv.org/abs/2304.09915",
    "authors": [
      "Di Wang",
      "Jing Zhang",
      "Bo Du",
      "Liangpei Zhang",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.09921",
    "title": "Regularization for distributionally robust state estimation and  prediction",
    "abstract": "The increasing availability of sensing techniques provides a great opportunity for engineers to design state estimation methods, which are optimal for the system under observation and the observed noise patterns. However, these patterns often do not fulfill the assumptions of existing methods. We provide a direct method using samples of the noise to create a moving horizon observer for linear time-varying and nonlinear systems, which is optimal under the empirical noise distribution. Moreover, we show how to enhance the observer with distributional robustness properties in order to handle unmodeled components in the noise profile, as well as different noise realizations. We prove that, even though the design of distributionally robust estimators is a complex minmax problem over an infinite-dimensional space, it can be transformed into a regularized linear program using a system level synthesis approach. Numerical experiments with the Van der Pol oscillator show the benefits of not only using empirical samples of the noise to design the state estimator, but also of adding distributional robustness. We show that our method can significantly outperform state-of-the-art approaches under challenging noise distributions, including multi-modal and deterministic components. ",
    "url": "https://arxiv.org/abs/2304.09921",
    "authors": [
      "Jean-Sébastien Brouillon",
      "Florian Dörfler",
      "Giancarlo Ferrari-Trecate"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.09938",
    "title": "LARD -- Landing Approach Runway Detection -- Dataset for Vision Based  Landing",
    "abstract": "As the interest in autonomous systems continues to grow, one of the major challenges is collecting sufficient and representative real-world data. Despite the strong practical and commercial interest in autonomous landing systems in the aerospace field, there is a lack of open-source datasets of aerial images. To address this issue, we present a dataset-lard-of high-quality aerial images for the task of runway detection during approach and landing phases. Most of the dataset is composed of synthetic images but we also provide manually labelled images from real landing footages, to extend the detection task to a more realistic setting. In addition, we offer the generator which can produce such synthetic front-view images and enables automatic annotation of the runway corners through geometric transformations. This dataset paves the way for further research such as the analysis of dataset quality or the development of models to cope with the detection tasks. Find data, code and more up-to-date information at https://github.com/deel-ai/LARD ",
    "url": "https://arxiv.org/abs/2304.09938",
    "authors": [
      "Mélanie Ducoffe",
      "Maxime Carrere",
      "Léo Féliers",
      "Adrien Gauffriau",
      "Vincent Mussot",
      "Claire Pagetti",
      "Thierry Sammour"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.09941",
    "title": "A robust and interpretable deep learning framework for multi-modal  registration via keypoints",
    "abstract": "We present KeyMorph, a deep learning-based image registration framework that relies on automatically detecting corresponding keypoints. State-of-the-art deep learning methods for registration often are not robust to large misalignments, are not interpretable, and do not incorporate the symmetries of the problem. In addition, most models produce only a single prediction at test-time. Our core insight which addresses these shortcomings is that corresponding keypoints between images can be used to obtain the optimal transformation via a differentiable closed-form expression. We use this observation to drive the end-to-end learning of keypoints tailored for the registration task, and without knowledge of ground-truth keypoints. This framework not only leads to substantially more robust registration but also yields better interpretability, since the keypoints reveal which parts of the image are driving the final alignment. Moreover, KeyMorph can be designed to be equivariant under image translations and/or symmetric with respect to the input image ordering. Finally, we show how multiple deformation fields can be computed efficiently and in closed-form at test time corresponding to different transformation variants. We demonstrate the proposed framework in solving 3D affine and spline-based registration of multi-modal brain MRI scans. In particular, we show registration accuracy that surpasses current state-of-the-art methods, especially in the context of large displacements. Our code is available at https://github.com/evanmy/keymorph. ",
    "url": "https://arxiv.org/abs/2304.09941",
    "authors": [
      "Alan Q. Wang",
      "Evan M. Yu",
      "Adrian V. Dalca",
      "Mert R. Sabuncu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.09965",
    "title": "Vulnerability of Finitely-long Blockchains in Securing Data",
    "abstract": "Recently, blockchain has been applied in various fields to secure data exchanges and storage in decentralized systems. In a blockchain application where the task of the application which makes use of the data stored in a blockchain has to be accomplished by a time instant, the employed blockchain is essentially finitely-long. In this paper, we consider a general finitely-long blockchain model which is generalized from most existing works on finitely-long blockchain applications, and take the first step towards characterizing the vulnerability of finitely-long blockchains in securing data against double-spending attacks. For the first time, we develop a general closed-form expression for the probability of success in launching a double-spending attack on a finitely-long blockchain. This probability essentially characterizes the vulnerability of finitely-long blockchains. Then, we prove that the probability of success in launching a double-spending attack on a finitely-long blockchain is no greater than that on an infinitely-long blockchain, which implies that finitely-long blockchains are less vulnerable to double-spending attacks than infinitely-long blockchains. Moreover, we show that unlike infinitely-long blockchains which can be surely paralyzed by a 51% attack, finitely-long blockchains are more resistant to 51% attacks. ",
    "url": "https://arxiv.org/abs/2304.09965",
    "authors": [
      "Yiming Jiang",
      "Jiangfan Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.09975",
    "title": "Solving the Kidney-Exchange Problem via Graph Neural Networks with No  Supervision",
    "abstract": "This paper introduces a new learning-based approach for approximately solving the Kidney-Exchange Problem (KEP), an NP-hard problem on graphs. The problem consists of, given a pool of kidney donors and patients waiting for kidney donations, optimally selecting a set of donations to optimize the quantity and quality of transplants performed while respecting a set of constraints about the arrangement of these donations. The proposed technique consists of two main steps: the first is a Graph Neural Network (GNN) trained without supervision; the second is a deterministic non-learned search heuristic that uses the output of the GNN to find paths and cycles. To allow for comparisons, we also implemented and tested an exact solution method using integer programming, two greedy search heuristics without the machine learning module, and the GNN alone without a heuristic. We analyze and compare the methods and conclude that the learning-based two-stage approach is the best solution quality, outputting approximate solutions on average 1.1 times more valuable than the ones from the deterministic heuristic alone. ",
    "url": "https://arxiv.org/abs/2304.09975",
    "authors": [
      "Pedro Foletto Pimenta",
      "Pedro H. C. Avelar",
      "Luis C. Lamb"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.09982",
    "title": "Radar de Parité: An NLP system to measure gender representation in  French news stories",
    "abstract": "We present the Radar de Parit\\'e, an automated Natural Language Processing (NLP) system that measures the proportion of women and men quoted daily in six Canadian French-language media outlets. We outline the system's architecture and detail the challenges we overcame to address French-specific issues, in particular regarding coreference resolution, a new contribution to the NLP literature on French. We also showcase statistics covering over one year's worth of data (282,512 news articles). Our results highlight the underrepresentation of women in news stories, while also illustrating the application of modern NLP methods to measure gender representation and address societal issues. ",
    "url": "https://arxiv.org/abs/2304.09982",
    "authors": [
      "Valentin-Gabriel Soumah",
      "Prashanth Rao",
      "Philipp Eibl",
      "Maite Taboada"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.09987",
    "title": "Tetra-NeRF: Representing Neural Radiance Fields Using Tetrahedra",
    "abstract": "Neural Radiance Fields (NeRFs) are a very recent and very popular approach for the problems of novel view synthesis and 3D reconstruction. A popular scene representation used by NeRFs is to combine a uniform, voxel-based subdivision of the scene with an MLP. Based on the observation that a (sparse) point cloud of the scene is often available, this paper proposes to use an adaptive representation based on tetrahedra and a Delaunay representation instead of the uniform subdivision or point-based representations. We show that such a representation enables efficient training and leads to state-of-the-art results. Our approach elegantly combines concepts from 3D geometry processing, triangle-based rendering, and modern neural radiance fields. Compared to voxel-based representations, ours provides more detail around parts of the scene likely to be close to the surface. Compared to point-based representations, our approach achieves better performance. ",
    "url": "https://arxiv.org/abs/2304.09987",
    "authors": [
      "Jonas Kulhanek",
      "Torsten Sattler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.09994",
    "title": "Improving Urban Flood Prediction using LSTM-DeepLabv3+ and Bayesian  Optimization with Spatiotemporal feature fusion",
    "abstract": "Deep learning models have become increasingly popular for flood prediction due to their superior accuracy and efficiency compared to traditional methods. However, current machine learning methods often rely on separate spatial or temporal feature analysis and have limitations on the types, number, and dimensions of input data. This study presented a CNN-RNN hybrid feature fusion modelling approach for urban flood prediction, which integrated the strengths of CNNs in processing spatial features and RNNs in analyzing different dimensions of time sequences. This approach allowed for both static and dynamic flood predictions. Bayesian optimization was applied to identify the seven most influential flood-driven factors and determine the best combination strategy. By combining four CNNs (FCN, UNet, SegNet, DeepLabv3+) and three RNNs (LSTM, BiLSTM, GRU), the optimal hybrid model was identified as LSTM-DeepLabv3+. This model achieved the highest prediction accuracy (MAE, RMSE, NSE, and KGE were 0.007, 0.025, 0.973 and 0.755, respectively) under various rainfall input conditions. Additionally, the processing speed was significantly improved, with an inference time of 1.158s (approximately 1/125 of the traditional computation time) compared to the physically-based models. ",
    "url": "https://arxiv.org/abs/2304.09994",
    "authors": [
      "Zuxiang Situ",
      "Qi Wang",
      "Shuai Teng",
      "Wanen Feng",
      "Gongfa Chen",
      "Qianqian Zhou",
      "Guangtao Fu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.09996",
    "title": "Robust Route Planning with Distributional Reinforcement Learning in a  Stochastic Road Network Environment",
    "abstract": "Route planning is essential to mobile robot navigation problems. In recent years, deep reinforcement learning (DRL) has been applied to learning optimal planning policies in stochastic environments without prior knowledge. However, existing works focus on learning policies that maximize the expected return, the performance of which can vary greatly when the level of stochasticity in the environment is high. In this work, we propose a distributional reinforcement learning based framework that learns return distributions which explicitly reflect environmental stochasticity. Policies based on the second-order stochastic dominance (SSD) relation can be used to make adjustable route decisions according to user preference on performance robustness. Our proposed method is evaluated in a simulated road network environment, and experimental results show that our method is able to plan the shortest routes that minimize stochasticity in travel time when robustness is preferred, while other state-of-the-art DRL methods are agnostic to environmental stochasticity. ",
    "url": "https://arxiv.org/abs/2304.09996",
    "authors": [
      "Xi Lin",
      "Paul Szenher",
      "John D. Martin",
      "Brendan Englot"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.10001",
    "title": "Weakly Supervised Detection of Baby Cry",
    "abstract": "Detection of baby cries is an important part of baby monitoring and health care. Almost all existing methods use supervised SVM, CNN, or their varieties. In this work, we propose to use weakly supervised anomaly detection to detect a baby cry. In this weak supervision, we only need weak annotation if there is a cry in an audio file. We design a data mining technique using the pre-trained VGGish feature extractor and an anomaly detection network on long untrimmed audio files. The obtained datasets are used to train a simple CNN feature network for cry/non-cry classification. This CNN is then used as a feature extractor in an anomaly detection framework to achieve better cry detection performance. ",
    "url": "https://arxiv.org/abs/2304.10001",
    "authors": [
      "Weijun Tan",
      "Qi Yao",
      "Jingfeng Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10013",
    "title": "HTNet: Dynamic WLAN Performance Prediction using Heterogenous Temporal  GNN",
    "abstract": "Predicting the throughput of WLAN deployments is a classic problem that occurs in the design of robust and high performance WLAN systems. However, due to the increasingly complex communication protocols and the increase in interference between devices in denser and denser WLAN deployments, traditional methods either have substantial runtime or enormous prediction error and hence cannot be applied in downstream tasks. Recently, Graph Neural Networks have been proven to be powerful graph analytic models and have been broadly applied to various networking problems such as link scheduling and power allocation. In this work, we propose HTNet, a specialized Heterogeneous Temporal Graph Neural Network that extracts features from dynamic WLAN deployments. Analyzing the unique graph structure of WLAN deployment graphs, we show that HTNet achieves the maximum expressive power on each snapshot. Based on a powerful message passing scheme, HTNet requires fewer number of layers compared with other GNN-based methods which entails less supporting data and runtime. To evaluate the performance of HTNet, we prepare six different setups with more than five thousands dense dynamic WLAN deployments that cover a wide range of real-world scenarios. HTNet achieves the lowest prediction error on all six setups with an average improvement of 25.3\\% over the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2304.10013",
    "authors": [
      "Hongkuan Zhou",
      "Rajgopal Kannan",
      "Ananthram Swami",
      "Viktor Prasanna"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2304.10020",
    "title": "A Survey on Deep Neural Network Partition over Cloud, Edge and End  Devices",
    "abstract": "Deep neural network (DNN) partition is a research problem that involves splitting a DNN into multiple parts and offloading them to specific locations. Because of the recent advancement in multi-access edge computing and edge intelligence, DNN partition has been considered as a powerful tool for improving DNN inference performance when the computing resources of edge and end devices are limited and the remote transmission of data from these devices to clouds is costly. This paper provides a comprehensive survey on the recent advances and challenges in DNN partition approaches over the cloud, edge, and end devices based on a detailed literature collection. We review how DNN partition works in various application scenarios, and provide a unified mathematical model of the DNN partition problem. We developed a five-dimensional classification framework for DNN partition approaches, consisting of deployment locations, partition granularity, partition constraints, optimization objectives, and optimization algorithms. Each existing DNN partition approache can be perfectly defined in this framework by instantiating each dimension into specific values. In addition, we suggest a set of metrics for comparing and evaluating the DNN partition approaches. Based on this, we identify and discuss research challenges that have not yet been investigated or fully addressed. We hope that this work helps DNN partition researchers by highlighting significant future research directions in this domain. ",
    "url": "https://arxiv.org/abs/2304.10020",
    "authors": [
      "Di Xu",
      "Xiang He",
      "Tonghua Su",
      "Zhongjie Wang"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Artificial Intelligence (cs.AI)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2304.10029",
    "title": "Jedi: Entropy-based Localization and Removal of Adversarial Patches",
    "abstract": "Real-world adversarial physical patches were shown to be successful in compromising state-of-the-art models in a variety of computer vision applications. Existing defenses that are based on either input gradient or features analysis have been compromised by recent GAN-based attacks that generate naturalistic patches. In this paper, we propose Jedi, a new defense against adversarial patches that is resilient to realistic patch attacks. Jedi tackles the patch localization problem from an information theory perspective; leverages two new ideas: (1) it improves the identification of potential patch regions using entropy analysis: we show that the entropy of adversarial patches is high, even in naturalistic patches; and (2) it improves the localization of adversarial patches, using an autoencoder that is able to complete patch regions from high entropy kernels. Jedi achieves high-precision adversarial patch localization, which we show is critical to successfully repair the images. Since Jedi relies on an input entropy analysis, it is model-agnostic, and can be applied on pre-trained off-the-shelf models without changes to the training or inference of the protected models. Jedi detects on average 90% of adversarial patches across different benchmarks and recovers up to 94% of successful patch attacks (Compared to 75% and 65% for LGS and Jujutsu, respectively). ",
    "url": "https://arxiv.org/abs/2304.10029",
    "authors": [
      "Bilel Tarchoun",
      "Anouar Ben Khalifa",
      "Mohamed Ali Mahjoub",
      "Nael Abu-Ghazaleh",
      "Ihsen Alouani"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10031",
    "title": "Architectures of Topological Deep Learning: A Survey on Topological  Neural Networks",
    "abstract": "The natural world is full of complex systems characterized by intricate relations between their components: from social interactions between individuals in a social network to electrostatic interactions between atoms in a protein. Topological Deep Learning (TDL) provides a comprehensive framework to process and extract knowledge from data associated with these systems, such as predicting the social community to which an individual belongs or predicting whether a protein can be a reasonable target for drug development. TDL has demonstrated theoretical and practical advantages that hold the promise of breaking ground in the applied sciences and beyond. However, the rapid growth of the TDL literature has also led to a lack of unification in notation and language across Topological Neural Network (TNN) architectures. This presents a real obstacle for building upon existing works and for deploying TNNs to new real-world problems. To address this issue, we provide an accessible introduction to TDL, and compare the recently published TNNs using a unified mathematical and graphical notation. Through an intuitive and critical review of the emerging field of TDL, we extract valuable insights into current challenges and exciting opportunities for future development. ",
    "url": "https://arxiv.org/abs/2304.10031",
    "authors": [
      "Mathilde Papillon",
      "Sophia Sanborn",
      "Mustafa Hajij",
      "Nina Miolane"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10038",
    "title": "Open-World Continual Learning: Unifying Novelty Detection and Continual  Learning",
    "abstract": "As AI agents are increasingly used in the real open world with unknowns or novelties, they need the ability to (1) recognize objects that (i) they have learned and (ii) detect items that they have not seen or learned before, and (2) learn the new items incrementally to become more and more knowledgeable and powerful. (1) is called novelty detection or out-of-distribution (OOD) detection and (2) is called class incremental learning (CIL), which is a setting of continual learning (CL). In existing research, OOD detection and CIL are regarded as two completely different problems. This paper theoretically proves that OOD detection actually is necessary for CIL. We first show that CIL can be decomposed into two sub-problems: within-task prediction (WP) and task-id prediction (TP). We then prove that TP is correlated with OOD detection. The key theoretical result is that regardless of whether WP and OOD detection (or TP) are defined explicitly or implicitly by a CIL algorithm, good WP and good OOD detection are necessary and sufficient conditions for good CIL, which unifies novelty or OOD detection and continual learning (CIL, in particular). A good CIL algorithm based on our theory can naturally be used in open world learning, which is able to perform both novelty/OOD detection and continual learning. Based on the theoretical result, new CIL methods are also designed, which outperform strong baselines in terms of CIL accuracy and its continual OOD detection by a large margin. ",
    "url": "https://arxiv.org/abs/2304.10038",
    "authors": [
      "Gyuhak Kim",
      "Changnan Xiao",
      "Tatsuya Konishi",
      "Zixuan Ke",
      "Bing Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10045",
    "title": "ID-MixGCL: Identity Mixup for Graph Contrastive Learning",
    "abstract": "Recently developed graph contrastive learning (GCL) approaches compare two different \"views\" of the same graph in order to learn node/graph representations. The core assumption of these approaches is that by graph augmentation, it is possible to generate several structurally different but semantically similar graph structures, and therefore, the identity labels of the original and augmented graph/nodes should be identical. However, in this paper, we observe that this assumption does not always hold, for example, any perturbation to nodes or edges in a molecular graph will change the graph labels to some degree. Therefore, we believe that augmenting the graph structure should be accompanied by an adaptation of the labels used for the contrastive loss. Based on this idea, we propose ID-MixGCL, which allows for simultaneous modulation of both the input graph and the corresponding identity labels, with a controllable degree of change, leading to the capture of fine-grained representations from unlabeled graphs. Experimental results demonstrate that ID-MixGCL improves performance on graph classification and node classification tasks, as demonstrated by significant improvements on the Cora, IMDB-B, and IMDB-M datasets compared to state-of-the-art techniques, by 3-29% absolute points. ",
    "url": "https://arxiv.org/abs/2304.10045",
    "authors": [
      "Gehang Zhang",
      "Bowen Yu",
      "Jiangxia Cao",
      "Xinghua Zhang",
      "Tingwen Liu",
      "Chuan Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.10049",
    "title": "Dynablox: Real-time Detection of Diverse Dynamic Objects in Complex  Environments",
    "abstract": "Real-time detection of moving objects is an essential capability for robots acting autonomously in dynamic environments. We thus propose Dynablox, a novel online mapping-based approach for robust moving object detection in complex environments. The central idea of our approach is to incrementally estimate high confidence free-space areas by modeling and accounting for sensing, state estimation, and mapping limitations during online robot operation. The spatio-temporally conservative free space estimate enables robust detection of moving objects without making any assumptions on the appearance of objects or environments. This allows deployment in complex scenes such as multi-storied buildings or staircases, and for diverse moving objects such as people carrying various items, doors swinging or even balls rolling around. We thoroughly evaluate our approach on real-world data sets, achieving 86% IoU at 17 FPS in typical robotic settings. The method outperforms a recent appearance-based classifier and approaches the performance of offline methods. We demonstrate its generality on a novel data set with rare moving objects in complex environments. We make our efficient implementation and the novel data set available as open-source. ",
    "url": "https://arxiv.org/abs/2304.10049",
    "authors": [
      "Lukas Schmid",
      "Olov Andersson",
      "Aurelio Sulser",
      "Patrick Pfreundschuh",
      "Roland Siegwart"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.10050",
    "title": "Neural Radiance Fields: Past, Present, and Future",
    "abstract": "The various aspects like modeling and interpreting 3D environments and surroundings have enticed humans to progress their research in 3D Computer Vision, Computer Graphics, and Machine Learning. An attempt made by Mildenhall et al in their paper about NeRFs (Neural Radiance Fields) led to a boom in Computer Graphics, Robotics, Computer Vision, and the possible scope of High-Resolution Low Storage Augmented Reality and Virtual Reality-based 3D models have gained traction from res with more than 500 preprints related to NeRFs published. This paper serves as a bridge for people starting to study these fields by building on the basics of Mathematics, Geometry, Computer Vision, and Computer Graphics to the difficulties encountered in Implicit Representations at the intersection of all these disciplines. This survey provides the history of rendering, Implicit Learning, and NeRFs, the progression of research on NeRFs, and the potential applications and implications of NeRFs in today's world. In doing so, this survey categorizes all the NeRF-related research in terms of the datasets used, objective functions, applications solved, and evaluation criteria for these applications. ",
    "url": "https://arxiv.org/abs/2304.10050",
    "authors": [
      "Ansh Mittal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10054",
    "title": "Complex Mixer for MedMNIST Classification Decathlon",
    "abstract": "With the development of the medical image field, researchers seek to develop a class of datasets to block the need for medical knowledge, such as \\text{MedMNIST} (v2). MedMNIST (v2) includes a large number of small-sized (28 $\\times$ 28 or 28 $\\times$ 28 $\\times$ 28) medical samples and the corresponding expert annotations (class label). The existing baseline model (Google AutoML Vision, ResNet-50+3D) can reach an average accuracy of over 70\\% on MedMNIST (v2) datasets, which is comparable to the performance of expert decision-making. Nevertheless, we note that there are two insurmountable obstacles to modeling on MedMNIST (v2): 1) the raw images are cropped to low scales may cause effective recognition information to be dropped and the classifier to have difficulty in tracing accurate decision boundaries; 2) the labelers' subjective insight may cause many uncertainties in the label space. To address these issues, we develop a Complex Mixer (C-Mixer) with a pre-training framework to alleviate the problem of insufficient information and uncertainty in the label space by introducing an incentive imaginary matrix and a self-supervised scheme with random masking. Our method (incentive learning and self-supervised learning with masking) shows surprising potential on both the standard MedMNIST (v2) dataset, the customized weakly supervised datasets, and other image enhancement tasks. ",
    "url": "https://arxiv.org/abs/2304.10054",
    "authors": [
      "Zhuoran Zheng",
      "Xiuyi Jia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10057",
    "title": "Maximize the Long-term Average Revenue of Network Slice Provider via  Admission Control Among Heterogeneous Slices",
    "abstract": "Network slicing endows 5G/B5G with differentiated and customized capabilities to cope with the proliferation of diversified services, whereas limited physical network resources may not be able to support all service requests. Slice admission control is regarded as an essential means to ensure service quality and service isolation when the network is under burden. Herein, the scenario where rational tenants coexist with partially competitive network slice providers is adopted. We aim to maximize the long-term average revenue of the network operators through slice admission control, with the feasibility of multidimensional resource requirements, the priority differences among heterogeneous slices, and the admission fairness within each slice taken into account concurrently. We prove the intractability of our problem by a reduction from the Multidimensional Knapsack Problem (MKP), and propose a two-stage algorithm called MPSAC to make a sub-optimal solution efficiently. The principle of MPSAC is to split the original problem into two sub-problems; inter-slice decision-making and intra-slice quota allocation, which are solved using a heuristic method and a tailored auction mechanism respectively. Extensive simulations are carried out to demonstrate the efficacy of our algorithm, the results show that the long-term average revenue of ours is at least 9.6% higher than comparisons while maintaining better priority relations and achieving improved fairness performance. ",
    "url": "https://arxiv.org/abs/2304.10057",
    "authors": [
      "Miao Dai",
      "Gang Sun",
      "Hongfang Yu",
      "Dusit Niyato"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2304.10066",
    "title": "Recognizability Embedding Enhancement for Very Low-Resolution Face  Recognition and Quality Estimation",
    "abstract": "Very low-resolution face recognition (VLRFR) poses unique challenges, such as tiny regions of interest and poor resolution due to extreme standoff distance or wide viewing angle of the acquisition devices. In this paper, we study principled approaches to elevate the recognizability of a face in the embedding space instead of the visual quality. We first formulate a robust learning-based face recognizability measure, namely recognizability index (RI), based on two criteria: (i) proximity of each face embedding against the unrecognizable faces cluster center and (ii) closeness of each face embedding against its positive and negative class prototypes. We then devise an index diversion loss to push the hard-to-recognize face embedding with low RI away from unrecognizable faces cluster to boost the RI, which reflects better recognizability. Additionally, a perceptibility attention mechanism is introduced to attend to the most recognizable face regions, which offers better explanatory and discriminative traits for embedding learning. Our proposed model is trained end-to-end and simultaneously serves recognizability-aware embedding learning and face quality estimation. To address VLRFR, our extensive evaluations on three challenging low-resolution datasets and face quality assessment demonstrate the superiority of the proposed model over the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2304.10066",
    "authors": [
      "Jacky Chen Long Chai",
      "Tiong-Sik Ng",
      "Cheng-Yaw Low",
      "Jaewoo Park",
      "Andrew Beng Jin Teoh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10074",
    "title": "Improving Graph Neural Networks on Multi-node Tasks with Labeling Tricks",
    "abstract": "In this paper, we provide a theory of using graph neural networks (GNNs) for \\textit{multi-node representation learning}, where we are interested in learning a representation for a set of more than one node such as a link. Existing GNNs are mainly designed to learn single-node representations. When we want to learn a node-set representation involving multiple nodes, a common practice in previous works is to directly aggregate the single-node representations obtained by a GNN. In this paper, we show a fundamental limitation of such an approach, namely the inability to capture the dependence among multiple nodes in a node set, and argue that directly aggregating individual node representations fails to produce an effective joint representation for multiple nodes. A straightforward solution is to distinguish target nodes from others. Formalizing this idea, we propose \\text{labeling trick}, which first labels nodes in the graph according to their relationships with the target node set before applying a GNN and then aggregates node representations obtained in the labeled graph for multi-node representations. The labeling trick also unifies a few previous successful works for multi-node representation learning, including SEAL, Distance Encoding, ID-GNN, and NBFNet. Besides node sets in graphs, we also extend labeling tricks to posets, subsets and hypergraphs. Experiments verify that the labeling trick technique can boost GNNs on various tasks, including undirected link prediction, directed link prediction, hyperedge prediction, and subgraph prediction. Our work explains the superior performance of previous node-labeling-based methods and establishes a theoretical foundation for using GNNs for multi-node representation learning. ",
    "url": "https://arxiv.org/abs/2304.10074",
    "authors": [
      "Xiyuan Wang",
      "Pan Li",
      "Muhan Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10075",
    "title": "Multiscale Representation for Real-Time Anti-Aliasing Neural Rendering",
    "abstract": "The rendering scheme in neural radiance field (NeRF) is effective in rendering a pixel by casting a ray into the scene. However, NeRF yields blurred rendering results when the training images are captured at non-uniform scales, and produces aliasing artifacts if the test images are taken in distant views. To address this issue, Mip-NeRF proposes a multiscale representation as a conical frustum to encode scale information. Nevertheless, this approach is only suitable for offline rendering since it relies on integrated positional encoding (IPE) to query a multilayer perceptron (MLP). To overcome this limitation, we propose mip voxel grids (Mip-VoG), an explicit multiscale representation with a deferred architecture for real-time anti-aliasing rendering. Our approach includes a density Mip-VoG for scene geometry and a feature Mip-VoG with a small MLP for view-dependent color. Mip-VoG encodes scene scale using the level of detail (LOD) derived from ray differentials and uses quadrilinear interpolation to map a queried 3D location to its features and density from two neighboring downsampled voxel grids. To our knowledge, our approach is the first to offer multiscale training and real-time anti-aliasing rendering simultaneously. We conducted experiments on multiscale datasets, and the results show that our approach outperforms state-of-the-art real-time rendering baselines. ",
    "url": "https://arxiv.org/abs/2304.10075",
    "authors": [
      "Dongting Hu",
      "Zhenkai Zhang",
      "Tingbo Hou",
      "Tongliang Liu",
      "Huan Fu",
      "Mingming Gong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10079",
    "title": "Recurrent Transformer for Dynamic Graph Representation Learning with  Edge Temporal States",
    "abstract": "Dynamic graph representation learning is growing as a trending yet challenging research task owing to the widespread demand for graph data analysis in real world applications. Despite the encouraging performance of many recent works that build upon recurrent neural networks (RNNs) and graph neural networks (GNNs), they fail to explicitly model the impact of edge temporal states on node features over time slices. Additionally, they are challenging to extract global structural features because of the inherent over-smoothing disadvantage of GNNs, which further restricts the performance. In this paper, we propose a recurrent difference graph transformer (RDGT) framework, which firstly assigns the edges in each snapshot with various types and weights to illustrate their specific temporal states explicitly, then a structure-reinforced graph transformer is employed to capture the temporal node representations by a recurrent learning paradigm. Experimental results on four real-world datasets demonstrate the superiority of RDGT for discrete dynamic graph representation learning, as it consistently outperforms competing methods in dynamic link prediction tasks. ",
    "url": "https://arxiv.org/abs/2304.10079",
    "authors": [
      "Shengxiang Hu",
      "Guobing Zou",
      "Shiyi Lin",
      "Liangrui Wu",
      "Chenyang Zhou",
      "Bofeng Zhang",
      "Yixin Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10080",
    "title": "NeUDF: Leaning Neural Unsigned Distance Fields with Volume Rendering",
    "abstract": "Multi-view shape reconstruction has achieved impressive progresses thanks to the latest advances in neural implicit surface rendering. However, existing methods based on signed distance function (SDF) are limited to closed surfaces, failing to reconstruct a wide range of real-world objects that contain open-surface structures. In this work, we introduce a new neural rendering framework, coded NeUDF, that can reconstruct surfaces with arbitrary topologies solely from multi-view supervision. To gain the flexibility of representing arbitrary surfaces, NeUDF leverages the unsigned distance function (UDF) as surface representation. While a naive extension of an SDF-based neural renderer cannot scale to UDF, we propose two new formulations of weight function specially tailored for UDF-based volume rendering. Furthermore, to cope with open surface rendering, where the in/out test is no longer valid, we present a dedicated normal regularization strategy to resolve the surface orientation ambiguity. We extensively evaluate our method over a number of challenging datasets, including DTU}, MGN, and Deep Fashion 3D. Experimental results demonstrate that nEudf can significantly outperform the state-of-the-art method in the task of multi-view surface reconstruction, especially for complex shapes with open boundaries. ",
    "url": "https://arxiv.org/abs/2304.10080",
    "authors": [
      "Yu-Tao Liu",
      "Li Wang",
      "Jie yang",
      "Weikai Chen",
      "Xiaoxu Meng",
      "Bo Yang",
      "Lin Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2304.10103",
    "title": "eTag: Class-Incremental Learning with Embedding Distillation and  Task-Oriented Generation",
    "abstract": "Class-Incremental Learning (CIL) aims to solve the neural networks' catastrophic forgetting problem, which refers to the fact that once the network updates on a new task, its performance on previously-learned tasks drops dramatically. Most successful CIL methods incrementally train a feature extractor with the aid of stored exemplars, or estimate the feature distribution with the stored prototypes. However, the stored exemplars would violate the data privacy concerns, while the stored prototypes might not reasonably be consistent with a proper feature distribution, hindering the exploration of real-world CIL applications. In this paper, we propose a method of \\textit{e}mbedding distillation and \\textit{Ta}sk-oriented \\textit{g}eneration (\\textit{eTag}) for CIL, which requires neither the exemplar nor the prototype. Instead, eTag achieves a data-free manner to train the neural networks incrementally. To prevent the feature extractor from forgetting, eTag distills the embeddings of the network's intermediate blocks. Additionally, eTag enables a generative network to produce suitable features, fitting the needs of the top incremental classifier. Experimental results confirmed that our proposed eTag considerably outperforms the state-of-the-art methods on CIFAR-100 and ImageNet-sub\\footnote{Our code is available in the Supplementary Materials. ",
    "url": "https://arxiv.org/abs/2304.10103",
    "authors": [
      "Libo Huang",
      "Yan Zeng",
      "Chuanguang Yang",
      "Zhulin An",
      "Boyu Diao",
      "Yongjun Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10105",
    "title": "Automatic Procurement Fraud Detection with Machine Learning",
    "abstract": "Although procurement fraud is always a critical problem in almost every free market, audit departments still have a strong reliance on reporting from informed sources when detecting them. With our generous cooperator, SF Express, sharing the access to the database related with procurements took place from 2015 to 2017 in their company, our team studies how machine learning techniques could help with the audition of one of the most profound crime among current chinese market, namely procurement frauds. By representing each procurement event as 9 specific features, we construct neural network models to identify suspicious procurements and classify their fraud types. Through testing our models over 50000 samples collected from the procurement database, we have proven that such models -- despite having space for improvements -- are useful in detecting procurement frauds. ",
    "url": "https://arxiv.org/abs/2304.10105",
    "authors": [
      "Jin Bai",
      "Tong Qiu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10113",
    "title": "SATA: Source Anchoring and Target Alignment Network for Continual Test  Time Adaptation",
    "abstract": "Adapting a trained model to perform satisfactorily on continually changing testing domains/environments is an important and challenging task. In this work, we propose a novel framework, SATA, which aims to satisfy the following characteristics required for online adaptation: 1) can work seamlessly with different (preferably small) batch sizes to reduce latency; 2) should continue to work well for the source domain; 3) should have minimal tunable hyper-parameters and storage requirements. Given a pre-trained network trained on source domain data, the proposed SATA framework modifies the batch-norm affine parameters using source anchoring based self-distillation. This ensures that the model incorporates the knowledge of the newly encountered domains, without catastrophically forgetting about the previously seen ones. We also propose a source-prototype driven contrastive alignment to ensure natural grouping of the target samples, while maintaining the already learnt semantic information. Extensive evaluation on three benchmark datasets under challenging settings justify the effectiveness of SATA for real-world applications. ",
    "url": "https://arxiv.org/abs/2304.10113",
    "authors": [
      "Goirik Chakrabarty",
      "Manogna Sreenivas",
      "Soma Biswas"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10126",
    "title": "Decouple Graph Neural Networks: Train Multiple Simple GNNs  Simultaneously Instead of One",
    "abstract": "Graph neural networks (GNN) suffer from severe inefficiency. It is mainly caused by the exponential growth of node dependency with the increase of layers. It extremely limits the application of stochastic optimization algorithms so that the training of GNN is usually time-consuming. To address this problem, we propose to decouple a multi-layer GNN as multiple simple modules for more efficient training, which is comprised of classical forward training (FT)and designed backward training (BT). Under the proposed framework, each module can be trained efficiently in FT by stochastic algorithms without distortion of graph information owing to its simplicity. To avoid the only unidirectional information delivery of FT and sufficiently train shallow modules with the deeper ones, we develop a backward training mechanism that makes the former modules perceive the latter modules. The backward training introduces the reversed information delivery into the decoupled modules as well as the forward information delivery. To investigate how the decoupling and greedy training affect the representational capacity, we theoretically prove that the error produced by linear modules will not accumulate on unsupervised tasks in most cases. The theoretical and experimental results show that the proposed framework is highly efficient with reasonable performance. ",
    "url": "https://arxiv.org/abs/2304.10126",
    "authors": [
      "Hongyuan Zhang",
      "Yanan Zhu",
      "Xuelong Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.10127",
    "title": "Learning Sample Difficulty from Pre-trained Models for Reliable  Prediction",
    "abstract": "Large-scale pre-trained models have achieved remarkable success in a variety of scenarios and applications, but how to leverage them to improve the prediction reliability of downstream models is undesirably under-explored. Moreover, modern neural networks have been found to be poorly calibrated and make overconfident predictions regardless of inherent sample difficulty and data uncertainty. To address this issue, we propose to utilize large-scale pre-trained models to guide downstream model training with sample difficulty-aware entropy regularization. Pre-trained models that have been exposed to large-scale datasets and do not overfit the downstream training classes enable us to measure each training sample difficulty via feature-space Gaussian modeling and relative Mahalanobis distance computation. Importantly, by adaptively penalizing overconfident prediction based on the sample's difficulty, we simultaneously improve accuracy and uncertainty calibration on various challenging benchmarks, consistently surpassing competitive baselines for reliable prediction. ",
    "url": "https://arxiv.org/abs/2304.10127",
    "authors": [
      "Peng Cui",
      "Dan Zhang",
      "Zhijie Deng",
      "Yinpeng Dong",
      "Jun Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10136",
    "title": "Diversifying the High-level Features for better Adversarial  Transferability",
    "abstract": "Given the great threat of adversarial attacks against Deep Neural Networks (DNNs), numerous works have been proposed to boost transferability to attack real-world applications. However, existing attacks often utilize advanced gradient calculation or input transformation but ignore the white-box model. Inspired by the fact that DNNs are over-parameterized for superior performance, we propose diversifying the high-level features (DHF) for more transferable adversarial examples. In particular, DHF perturbs the high-level features by randomly transforming the high-level features and mixing them with the feature of benign samples when calculating the gradient at each iteration. Due to the redundancy of parameters, such transformation does not affect the classification performance but helps identify the invariant features across different models, leading to much better transferability. Empirical evaluations on ImageNet dataset show that DHF could effectively improve the transferability of existing momentum-based attacks. Incorporated into the input transformation-based attacks, DHF generates more transferable adversarial examples and outperforms the baselines with a clear margin when attacking several defense models, showing its generalization to various attacks and high effectiveness for boosting transferability. ",
    "url": "https://arxiv.org/abs/2304.10136",
    "authors": [
      "Zhiyuan Wang",
      "Zeliang Zhang",
      "Siyuan Liang",
      "Xiaosen Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10140",
    "title": "FTMRate: Collision-Immune Distance-based Data Rate Selection for IEEE  802.11 Networks",
    "abstract": "Data rate selection algorithms for Wi-Fi devices are an important area of research because they directly impact performance. Most of the proposals are based on measuring the transmission success probability for a given data rate. In dense scenarios, however, this probing approach will fail because frame collisions are misinterpreted as erroneous data rate selection. We propose FTMRate which uses the fine timing measurement (FTM) feature, recently introduced in IEEE 802.11. FTM allows stations to measure their distance from the AP. We argue that knowledge of the distance from the receiver can be useful in determining which data rate to use. We apply statistical learning (a form of machine learning) to estimate the distance based on measurements, estimate channel quality from the distance, and select data rates based on channel quality. We evaluate three distinct estimation approaches: exponential smoothing, Kalman filter, and particle filter. We present a performance evaluation of the three variants of FTMRate and show, in several dense and mobile (though line-of-sight only) scenarios, that it can outperform two benchmarks and provide close to optimal results in IEEE 802.11ax networks. ",
    "url": "https://arxiv.org/abs/2304.10140",
    "authors": [
      "Wojciech Ciezobka",
      "Maksymilian Wojnar",
      "Katarzyna Kosek-Szott",
      "Szymon Szott",
      "Krzysztof Rusek"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2304.10145",
    "title": "Can ChatGPT Reproduce Human-Generated Labels? A Study of Social  Computing Tasks",
    "abstract": "The release of ChatGPT has uncovered a range of possibilities whereby large language models (LLMs) can substitute human intelligence. In this paper, we seek to understand whether ChatGPT has the potential to reproduce human-generated label annotations in social computing tasks. Such an achievement could significantly reduce the cost and complexity of social computing research. As such, we use ChatGPT to re-label five seminal datasets covering stance detection (2x), sentiment analysis, hate speech, and bot detection. Our results highlight that ChatGPT does have the potential to handle these data annotation tasks, although a number of challenges remain. ChatGPT obtains an average precision 0.609. Performance is highest for the sentiment analysis dataset, with ChatGPT correctly annotating 64.9% of tweets. Yet, we show that performance varies substantially across individual labels. We believe this work can open up new lines of analysis and act as a basis for future research into the exploitation of ChatGPT for human annotation tasks. ",
    "url": "https://arxiv.org/abs/2304.10145",
    "authors": [
      "Yiming Zhu",
      "Peixian Zhang",
      "Ehsan-Ul Haq",
      "Pan Hui",
      "Gareth Tyson"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.10154",
    "title": "Motion Artifacts Detection in Short-scan Dental CBCT Reconstructions",
    "abstract": "Cone Beam Computed Tomography (CBCT) is widely used in dentistry for diagnostics and treatment planning. CBCT Imaging has a long acquisition time and consequently, the patient is likely to move. This motion causes significant artifacts in the reconstructed data which may lead to misdiagnosis. Existing motion correction algorithms only address this issue partially, struggling with inconsistencies due to truncation, accuracy, and execution speed. On the other hand, a short-scan reconstruction using a subset of motion-free projections with appropriate weighting methods can have a sufficient clinical image quality for most diagnostic purposes. Therefore, a framework is used in this study to extract the motion-free part of the scanned projections with which a clean short-scan volume can be reconstructed without using correction algorithms. Motion artifacts are detected using deep learning with a slice-based prediction scheme followed by volume averaging to get the final result. A realistic motion simulation strategy and data augmentation has been implemented to address data scarcity. The framework has been validated by testing it with real motion-affected data while the model was trained only with simulated motion data. This shows the feasibility to apply the proposed framework to a broad variety of motion cases for further research. ",
    "url": "https://arxiv.org/abs/2304.10154",
    "authors": [
      "Abdul Salam Rasmi Asraf Ali",
      "Andrea Fusiello",
      "Claudio Landi",
      "Cristina Sarti",
      "Anneke Annassia Putri Siswadi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10175",
    "title": "Automated Dynamic Bayesian Networks for Predicting Acute Kidney Injury  Before Onset",
    "abstract": "Several algorithms for learning the structure of dynamic Bayesian networks (DBNs) require an a priori ordering of variables, which influences the determined graph topology. However, it is often unclear how to determine this order if feature importance is unknown, especially as an exhaustive search is usually impractical. In this paper, we introduce Ranking Approaches for Unknown Structures (RAUS), an automated framework to systematically inform variable ordering and learn networks end-to-end. RAUS leverages existing statistical methods (Cramers V, chi-squared test, and information gain) to compare variable ordering, resultant generated network topologies, and DBN performance. RAUS enables end-users with limited DBN expertise to implement models via command line interface. We evaluate RAUS on the task of predicting impending acute kidney injury (AKI) from inpatient clinical laboratory data. Longitudinal observations from 67,460 patients were collected from our electronic health record (EHR) and Kidney Disease Improving Global Outcomes (KDIGO) criteria were then applied to define AKI events. RAUS learns multiple DBNs simultaneously to predict a future AKI event at different time points (i.e., 24-, 48-, 72-hours in advance of AKI). We also compared the results of the learned AKI prediction models and variable orderings to baseline techniques (logistic regression, random forests, and extreme gradient boosting). The DBNs generated by RAUS achieved 73-83% area under the receiver operating characteristic curve (AUCROC) within 24-hours before AKI; and 71-79% AUCROC within 48-hours before AKI of any stage in a 7-day observation window. Insights from this automated framework can help efficiently implement and interpret DBNs for clinical decision support. The source code for RAUS is available in GitHub at https://github.com/dgrdn08/RAUS . ",
    "url": "https://arxiv.org/abs/2304.10175",
    "authors": [
      "David Gordon",
      "Panayiotis Petousis",
      "Anders O. Garlid",
      "Keith Norris",
      "Katherine Tuttle",
      "Susanne B. Nicholas",
      "Alex A.T. Bui"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.10176",
    "title": "Robust Deep Reinforcement Learning Scheduling via Weight Anchoring",
    "abstract": "Questions remain on the robustness of data-driven learning methods when crossing the gap from simulation to reality. We utilize weight anchoring, a method known from continual learning, to cultivate and fixate desired behavior in Neural Networks. Weight anchoring may be used to find a solution to a learning problem that is nearby the solution of another learning problem. Thereby, learning can be carried out in optimal environments without neglecting or unlearning desired behavior. We demonstrate this approach on the example of learning mixed QoS-efficient discrete resource scheduling with infrequent priority messages. Results show that this method provides performance comparable to the state of the art of augmenting a simulation environment, alongside significantly increased robustness and steerability. ",
    "url": "https://arxiv.org/abs/2304.10176",
    "authors": [
      "Steffen Gracla",
      "Edgar Beck",
      "Carsten Bockelmann",
      "Armin Dekorsy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.10190",
    "title": "A Large-scale Examination of \"Socioeconomic\" Fairness in Mobile Networks",
    "abstract": "Internet access is a special resource of which needs has become universal across the public whereas the service is operated in the private sector. Mobile Network Operators (MNOs) put efforts for management, planning, and optimization; however, they do not link such activities to socioeconomic fairness. In this paper, we make a first step towards understanding the relation between socioeconomic status of customers and network performance, and investigate potential discrimination in network deployment and management. The scope of our study spans various aspects, including urban geography, network resource deployment, data consumption, and device distribution. A novel methodology that enables a geo-socioeconomic perspective to mobile network is developed for the study. The results are based on an actual infrastructure in multiple cities, covering millions of users densely covering the socioeconomic scale. We report a thorough examination of the fairness status, its relationship with various structural factors, and potential class specific solutions. ",
    "url": "https://arxiv.org/abs/2304.10190",
    "authors": [
      "Souneil Park",
      "Pavol Mulinka",
      "Diego Perino"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2304.10191",
    "title": "Efficient Uncertainty Estimation in Spiking Neural Networks via  MC-dropout",
    "abstract": "Spiking neural networks (SNNs) have gained attention as models of sparse and event-driven communication of biological neurons, and as such have shown increasing promise for energy-efficient applications in neuromorphic hardware. As with classical artificial neural networks (ANNs), predictive uncertainties are important for decision making in high-stakes applications, such as autonomous vehicles, medical diagnosis, and high frequency trading. Yet, discussion of uncertainty estimation in SNNs is limited, and approaches for uncertainty estimation in artificial neural networks (ANNs) are not directly applicable to SNNs. Here, we propose an efficient Monte Carlo(MC)-dropout based approach for uncertainty estimation in SNNs. Our approach exploits the time-step mechanism of SNNs to enable MC-dropout in a computationally efficient manner, without introducing significant overheads during training and inference while demonstrating high accuracy and uncertainty quality. ",
    "url": "https://arxiv.org/abs/2304.10191",
    "authors": [
      "Tao Sun",
      "Bojian Yin",
      "Sander Bohte"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10211",
    "title": "Spiking-Fer: Spiking Neural Network for Facial Expression Recognition  With Event Cameras",
    "abstract": "Facial Expression Recognition (FER) is an active research domain that has shown great progress recently, notably thanks to the use of large deep learning models. However, such approaches are particularly energy intensive, which makes their deployment difficult for edge devices. To address this issue, Spiking Neural Networks (SNNs) coupled with event cameras are a promising alternative, capable of processing sparse and asynchronous events with lower energy consumption. In this paper, we establish the first use of event cameras for FER, named \"Event-based FER\", and propose the first related benchmarks by converting popular video FER datasets to event streams. To deal with this new task, we propose \"Spiking-FER\", a deep convolutional SNN model, and compare it against a similar Artificial Neural Network (ANN). Experiments show that the proposed approach achieves comparable performance to the ANN architecture, while consuming less energy by orders of magnitude (up to 65.39x). In addition, an experimental study of various event-based data augmentation techniques is performed to provide insights into the efficient transformations specific to event-based FER. ",
    "url": "https://arxiv.org/abs/2304.10211",
    "authors": [
      "Sami Barchid",
      "Benjamin Allaert",
      "Amel Aissaoui",
      "José Mennesson",
      "Chaabane Djéraba"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.10216",
    "title": "Exploring Paracrawl for Document-level Neural Machine Translation",
    "abstract": "Document-level neural machine translation (NMT) has outperformed sentence-level NMT on a number of datasets. However, document-level NMT is still not widely adopted in real-world translation systems mainly due to the lack of large-scale general-domain training data for document-level NMT. We examine the effectiveness of using Paracrawl for learning document-level translation. Paracrawl is a large-scale parallel corpus crawled from the Internet and contains data from various domains. The official Paracrawl corpus was released as parallel sentences (extracted from parallel webpages) and therefore previous works only used Paracrawl for learning sentence-level translation. In this work, we extract parallel paragraphs from Paracrawl parallel webpages using automatic sentence alignments and we use the extracted parallel paragraphs as parallel documents for training document-level translation models. We show that document-level NMT models trained with only parallel paragraphs from Paracrawl can be used to translate real documents from TED, News and Europarl, outperforming sentence-level NMT models. We also perform a targeted pronoun evaluation and show that document-level models trained with Paracrawl data can help context-aware pronoun translation. ",
    "url": "https://arxiv.org/abs/2304.10216",
    "authors": [
      "Yusser Al Ghussin",
      "Jingyi Zhang",
      "Josef van Genabith"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.10234",
    "title": "Transcoding Quality Prediction for Adaptive Video Streaming",
    "abstract": "In recent years, video streaming applications have proliferated the demand for Video Quality Assessment VQA). Reduced reference video quality assessment (RR-VQA) is a category of VQA where certain features (e.g., texture, edges) of the original video are provided for quality assessment. It is a popular research area for various applications such as social media, online games, and video streaming. This paper introduces a reduced reference Transcoding Quality Prediction Model (TQPM) to determine the visual quality score of the video possibly transcoded in multiple stages. The quality is predicted using Discrete Cosine Transform (DCT)-energy-based features of the video (i.e., the video's brightness, spatial texture information, and temporal activity) and the target bitrate representation of each transcoding stage. To do that, the problem is formulated, and a Long Short-Term Memory (LSTM)-based quality prediction model is presented. Experimental results illustrate that, on average, TQPM yields PSNR, SSIM, and VMAF predictions with an R2 score of 0.83, 0.85, and 0.87, respectively, and Mean Absolute Error (MAE) of 1.31 dB, 1.19 dB, and 3.01, respectively, for single-stage transcoding. Furthermore, an R2 score of 0.84, 0.86, and 0.91, respectively, and MAE of 1.32 dB, 1.33 dB, and 3.25, respectively, are observed for a two-stage transcoding scenario. Moreover, the average processing time of TQPM for 4s segments is 0.328s, making it a practical VQA method in online streaming applications. ",
    "url": "https://arxiv.org/abs/2304.10234",
    "authors": [
      "Vignesh V Menon",
      "Reza Farahani",
      "Prajit T Rajendran",
      "Mohammed Ghanbari",
      "Hermann Hellwagner",
      "Christian Timmerer"
    ],
    "subjectives": [
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2304.10241",
    "title": "A geometry-aware deep network for depth estimation in monocular  endoscopy",
    "abstract": "Monocular depth estimation is critical for endoscopists to perform spatial perception and 3D navigation of surgical sites. However, most of the existing methods ignore the important geometric structural consistency, which inevitably leads to performance degradation and distortion of 3D reconstruction. To address this issue, we introduce a gradient loss to penalize edge fluctuations ambiguous around stepped edge structures and a normal loss to explicitly express the sensitivity to frequently small structures, and propose a geometric consistency loss to spreads the spatial information across the sample grids to constrain the global geometric anatomy structures. In addition, we develop a synthetic RGB-Depth dataset that captures the anatomical structures under reflections and illumination variations. The proposed method is extensively validated across different datasets and clinical images and achieves mean RMSE values of 0.066 (stomach), 0.029 (small intestine), and 0.139 (colon) on the EndoSLAM dataset. The generalizability of the proposed method achieves mean RMSE values of 12.604 (T1-L1), 9.930 (T2-L2), and 13.893 (T3-L3) on the ColonDepth dataset. The experimental results show that our method exceeds previous state-of-the-art competitors and generates more consistent depth maps and reasonable anatomical structures. The quality of intraoperative 3D structure perception from endoscopic videos of the proposed method meets the accuracy requirements of video-CT registration algorithms for endoscopic navigation. The dataset and the source code will be available at https://github.com/YYM-SIA/LINGMI-MR. ",
    "url": "https://arxiv.org/abs/2304.10241",
    "authors": [
      "Yongming Yang",
      "Shuwei Shao",
      "Tao Yang",
      "Peng Wang",
      "Zhuo Yang",
      "Chengdong Wu",
      "Hao Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10242",
    "title": "Fourier Neural Operator Surrogate Model to Predict 3D Seismic Waves  Propagation",
    "abstract": "With the recent rise of neural operators, scientific machine learning offers new solutions to quantify uncertainties associated with high-fidelity numerical simulations. Traditional neural networks, such as Convolutional Neural Networks (CNN) or Physics-Informed Neural Networks (PINN), are restricted to the prediction of solutions in a predefined configuration. With neural operators, one can learn the general solution of Partial Differential Equations, such as the elastic wave equation, with varying parameters. There have been very few applications of neural operators in seismology. All of them were limited to two-dimensional settings, although the importance of three-dimensional (3D) effects is well known. In this work, we apply the Fourier Neural Operator (FNO) to predict ground motion time series from a 3D geological description. We used a high-fidelity simulation code, SEM3D, to build an extensive database of ground motions generated by 30,000 different geologies. With this database, we show that the FNO can produce accurate ground motion even when the underlying geology exhibits large heterogeneities. Intensity measures at moderate and large periods are especially well reproduced. We present the first seismological application of Fourier Neural Operators in 3D. Thanks to the generalizability of our database, we believe that our model can be used to assess the influence of geological features such as sedimentary basins on ground motion, which is paramount to evaluating site effects. ",
    "url": "https://arxiv.org/abs/2304.10242",
    "authors": [
      "Fanny Lehmann",
      "Filippo Gatti",
      "Michaël Bertin",
      "Didier Clouteau"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Geophysics (physics.geo-ph)"
    ]
  },
  {
    "id": "arXiv:2304.10244",
    "title": "Omni Aggregation Networks for Lightweight Image Super-Resolution",
    "abstract": "While lightweight ViT framework has made tremendous progress in image super-resolution, its uni-dimensional self-attention modeling, as well as homogeneous aggregation scheme, limit its effective receptive field (ERF) to include more comprehensive interactions from both spatial and channel dimensions. To tackle these drawbacks, this work proposes two enhanced components under a new Omni-SR architecture. First, an Omni Self-Attention (OSA) block is proposed based on dense interaction principle, which can simultaneously model pixel-interaction from both spatial and channel dimensions, mining the potential correlations across omni-axis (i.e., spatial and channel). Coupling with mainstream window partitioning strategies, OSA can achieve superior performance with compelling computational budgets. Second, a multi-scale interaction scheme is proposed to mitigate sub-optimal ERF (i.e., premature saturation) in shallow models, which facilitates local propagation and meso-/global-scale interactions, rendering an omni-scale aggregation building block. Extensive experiments demonstrate that Omni-SR achieves record-high performance on lightweight super-resolution benchmarks (e.g., 26.95 dB@Urban100 $\\times 4$ with only 792K parameters). Our code is available at \\url{https://github.com/Francis0625/Omni-SR}. ",
    "url": "https://arxiv.org/abs/2304.10244",
    "authors": [
      "Hang Wang",
      "Xuanhong Chen",
      "Bingbing Ni",
      "Yutian Liu",
      "Jinfan Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10249",
    "title": "Harnessing the Power of Text-image Contrastive Models for Automatic  Detection of Online Misinformation",
    "abstract": "As growing usage of social media websites in the recent decades, the amount of news articles spreading online rapidly, resulting in an unprecedented scale of potentially fraudulent information. Although a plenty of studies have applied the supervised machine learning approaches to detect such content, the lack of gold standard training data has hindered the development. Analysing the single data format, either fake text description or fake image, is the mainstream direction for the current research. However, the misinformation in real-world scenario is commonly formed as a text-image pair where the news article/news title is described as text content, and usually followed by the related image. Given the strong ability of learning features without labelled data, contrastive learning, as a self-learning approach, has emerged and achieved success on the computer vision. In this paper, our goal is to explore the constrastive learning in the domain of misinformation identification. We developed a self-learning model and carried out the comprehensive experiments on a public data set named COSMOS. Comparing to the baseline classifier, our model shows the superior performance of non-matched image-text pair detection (approximately 10%) when the training data is insufficient. In addition, we observed the stability for contrsative learning and suggested the use of it offers large reductions in the number of training data, whilst maintaining comparable classification results. ",
    "url": "https://arxiv.org/abs/2304.10249",
    "authors": [
      "Hao Chen",
      "Peng Zheng",
      "Xin Wang",
      "Shu Hu",
      "Bin Zhu",
      "Jinrong Hu",
      "Xi Wu",
      "Siwei Lyu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10250",
    "title": "Revisiting Implicit Neural Representations in Low-Level Vision",
    "abstract": "Implicit Neural Representation (INR) has been emerging in computer vision in recent years. It has been shown to be effective in parameterising continuous signals such as dense 3D models from discrete image data, e.g. the neural radius field (NeRF). However, INR is under-explored in 2D image processing tasks. Considering the basic definition and the structure of INR, we are interested in its effectiveness in low-level vision problems such as image restoration. In this work, we revisit INR and investigate its application in low-level image restoration tasks including image denoising, super-resolution, inpainting, and deblurring. Extensive experimental evaluations suggest the superior performance of INR in several low-level vision tasks with limited resources, outperforming its counterparts by over 2dB. Code and models are available at https://github.com/WenTXuL/LINR ",
    "url": "https://arxiv.org/abs/2304.10250",
    "authors": [
      "Wentian Xu",
      "Jianbo Jiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10253",
    "title": "A data augmentation perspective on diffusion models and retrieval",
    "abstract": "Diffusion models excel at generating photorealistic images from text-queries. Naturally, many approaches have been proposed to use these generative abilities to augment training datasets for downstream tasks, such as classification. However, diffusion models are themselves trained on large noisily supervised, but nonetheless, annotated datasets. It is an open question whether the generalization capabilities of diffusion models beyond using the additional data of the pre-training process for augmentation lead to improved downstream performance. We perform a systematic evaluation of existing methods to generate images from diffusion models and study new extensions to assess their benefit for data augmentation. While we find that personalizing diffusion models towards the target data outperforms simpler prompting strategies, we also show that using the training data of the diffusion model alone, via a simple nearest neighbor retrieval procedure, leads to even stronger downstream performance. Overall, our study probes the limitations of diffusion models for data augmentation but also highlights its potential in generating new training data to improve performance on simple downstream vision tasks. ",
    "url": "https://arxiv.org/abs/2304.10253",
    "authors": [
      "Max F. Burg",
      "Florian Wenzel",
      "Dominik Zietlow",
      "Max Horn",
      "Osama Makansi",
      "Francesco Locatello",
      "Chris Russell"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10259",
    "title": "Social Distance Detection Using Deep Learning And Risk Management System",
    "abstract": "An outbreak of the coronavirus disease which occurred three years later and it has hit the world again with many evolutions. The effects on the human race have already been profound. We can only safeguard ourselves against this pandemic by mandating a \"Face Mask\" also maintaining the \"Social Distancing.\" The necessity of protective face masks in all gatherings is required by many civil institutions in India. As a result of the substantial human resource utilization, personally examining the whole country with a huge population like India, to determine whether the execution of mask wearing and social distance maintained is unfeasible. The COVID-19 Social Distancing Detector System is a single-stage detector that employs deep learning to integrate high-end semantic data to a CNN module in order to maintain social distances and simultaneously monitor violations within a specified region. By deploying current Security footages, CCTV cameras, and computer vision (CV), it will also be able to identify those who are experiencing the calamity of social separation. Providing tools for safety and security, this technology disposes the need for a labor-force based surveillance system, yet a manual governing body is still required to monitor, track, and inform on the violations that are committed. Any sort of infrastructure, including universities, hospitals, offices of the government, schools, and building sites, can employ the technology. Therefore, the risk management system created to report and analyze video streams along with the social distance detector system might help to ensure our protection and security as well as the security of our loved ones. Furthermore, we will discuss about deployment and improvement of the project overall. ",
    "url": "https://arxiv.org/abs/2304.10259",
    "authors": [
      "Dr. Sangeetha R.G",
      "Jaya Aravindh V. V"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10266",
    "title": "OOD-CV-v2: An extended Benchmark for Robustness to Out-of-Distribution  Shifts of Individual Nuisances in Natural Images",
    "abstract": "Enhancing the robustness of vision algorithms in real-world scenarios is challenging. One reason is that existing robustness benchmarks are limited, as they either rely on synthetic data or ignore the effects of individual nuisance factors. We introduce OOD-CV-v2, a benchmark dataset that includes out-of-distribution examples of 10 object categories in terms of pose, shape, texture, context and the weather conditions, and enables benchmarking of models for image classification, object detection, and 3D pose estimation. In addition to this novel dataset, we contribute extensive experiments using popular baseline methods, which reveal that: 1) Some nuisance factors have a much stronger negative effect on the performance compared to others, also depending on the vision task. 2) Current approaches to enhance robustness have only marginal effects, and can even reduce robustness. 3) We do not observe significant differences between convolutional and transformer architectures. We believe our dataset provides a rich test bed to study robustness and will help push forward research in this area. Our dataset can be accessed from this http URL ",
    "url": "https://arxiv.org/abs/2304.10266",
    "authors": [
      "Bingchen Zhao",
      "Jiahao Wang",
      "Wufei Ma",
      "Artur Jesslen",
      "Siwei Yang",
      "Shaozuo Yu",
      "Oliver Zendel",
      "Christian Theobalt",
      "Alan Yuille",
      "Adam Kortylewski"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10268",
    "title": "BackCache: Mitigating Contention-Based Cache Timing Attacks by Hiding  Cache Line Evictions",
    "abstract": "Caches are used to reduce the speed differential between the CPU and memory to improve the performance of modern processors. However, attackers can use contention-based cache timing attacks to steal sensitive information from victim processes through carefully designed cache eviction sets. And L1 data cache attacks are widely exploited and pose a significant privacy and confidentiality threat. Existing hardware-based countermeasures mainly focus on cache partitioning, randomization, and cache line flushing, which unfortunately either incur high overhead or can be circumvented by sophisticated attacks. In this paper, we propose a novel hardware-software co-design called BackCache with the idea of always achieving cache hits instead of cache misses to mitigate contention-based cache timing attacks on the L1 data cache. BackCache places the evicted cache lines from the L1 data cache into a fully-associative backup cache to hide the evictions. To improve the security of BackCache, we introduce a randomly used replacement policy (RURP) and a dynamic backup cache resizing mechanism. We also present a theoretical security analysis to demonstrate the effectiveness of BackCache. Our evaluation on the gem5 simulator shows that BackCache can degrade the performance by 1.33%, 7.34%, and 7.59% For OS kernel, single-thread, and multi-thread benchmarks. ",
    "url": "https://arxiv.org/abs/2304.10268",
    "authors": [
      "Quancheng Wang",
      "Ming Tang",
      "Han Wang",
      "Yuzhe Gu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2304.10277",
    "title": "Robust nonlinear set-point control with reinforcement learning",
    "abstract": "There has recently been an increased interest in reinforcement learning for nonlinear control problems. However standard reinforcement learning algorithms can often struggle even on seemingly simple set-point control problems. This paper argues that three ideas can improve reinforcement learning methods even for highly nonlinear set-point control problems: 1) Make use of a prior feedback controller to aid amplitude exploration. 2) Use integrated errors. 3) Train on model ensembles. Together these ideas lead to more efficient training, and a trained set-point controller that is more robust to modelling errors and thus can be directly deployed to real-world nonlinear systems. The claim is supported by experiments with a real-world nonlinear cascaded tank process and a simulated strongly nonlinear pH-control system. ",
    "url": "https://arxiv.org/abs/2304.10277",
    "authors": [
      "Ruoqi Zhang",
      "Per Mattsson",
      "Torbjörn Wigren"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10283",
    "title": "Is augmentation effective to improve prediction in imbalanced text  datasets?",
    "abstract": "Imbalanced datasets present a significant challenge for machine learning models, often leading to biased predictions. To address this issue, data augmentation techniques are widely used in natural language processing (NLP) to generate new samples for the minority class. However, in this paper, we challenge the common assumption that data augmentation is always necessary to improve predictions on imbalanced datasets. Instead, we argue that adjusting the classifier cutoffs without data augmentation can produce similar results to oversampling techniques. Our study provides theoretical and empirical evidence to support this claim. Our findings contribute to a better understanding of the strengths and limitations of different approaches to dealing with imbalanced data, and help researchers and practitioners make informed decisions about which methods to use for a given task. ",
    "url": "https://arxiv.org/abs/2304.10283",
    "authors": [
      "Gabriel O. Assunção",
      "Rafael Izbicki",
      "Marcos O. Prates"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.10297",
    "title": "SARF: Aliasing Relation Assisted Self-Supervised Learning for Few-shot  Relation Reasoning",
    "abstract": "Few-shot relation reasoning on knowledge graphs (FS-KGR) aims to infer long-tail data-poor relations, which has drawn increasing attention these years due to its practicalities. The pre-training of previous methods needs to manually construct the meta-relation set, leading to numerous labor costs. Self-supervised learning (SSL) is treated as a solution to tackle the issue, but still at an early stage for FS-KGR task. Moreover, most of the existing methods ignore leveraging the beneficial information from aliasing relations (AR), i.e., data-rich relations with similar contextual semantics to the target data-poor relation. Therefore, we proposed a novel Self-Supervised Learning model by leveraging Aliasing Relations to assist FS-KGR, termed SARF. Concretely, four main components are designed in our model, i.e., SSL reasoning module, AR-assisted mechanism, fusion module, and scoring function. We first generate the representation of the co-occurrence patterns in a generative manner. Meanwhile, the representations of aliasing relations are learned to enhance reasoning in the AR-assist mechanism. Besides, multiple strategies, i.e., simple summation and learnable fusion, are offered for representation fusion. Finally, the generated representation is used for scoring. Extensive experiments on three few-shot benchmarks demonstrate that SARF achieves state-of-the-art performance compared with other methods in most cases. ",
    "url": "https://arxiv.org/abs/2304.10297",
    "authors": [
      "Lingyuan Meng",
      "Ke Liang",
      "Bin Xiao",
      "Sihang Zhou",
      "Yue Liu",
      "Meng Liu",
      "Xihong Yang",
      "Xinwang Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2304.10305",
    "title": "Feature-compatible Progressive Learning for Video Copy Detection",
    "abstract": "Video Copy Detection (VCD) has been developed to identify instances of unauthorized or duplicated video content. This paper presents our first and second solutions to the Meta AI Video Similarity Challenge (VSC22), CVPR 2023. In order to compete in this challenge, we propose Feature-Compatible Progressive Learning (FCPL) for VCD. FCPL trains various models that produce mutually-compatible features, meaning that the features derived from multiple distinct models can be directly compared with one another. We find this mutual compatibility enables feature ensemble. By implementing progressive learning and utilizing labeled ground truth pairs, we effectively gradually enhance performance. Experimental results demonstrate the superiority of the proposed FCPL over other competitors. Our code is available at https://github.com/WangWenhao0716/VSC-DescriptorTrack-Submission and https://github.com/WangWenhao0716/VSC-MatchingTrack-Submission. ",
    "url": "https://arxiv.org/abs/2304.10305",
    "authors": [
      "Wenhao Wang",
      "Yifan Sun",
      "Yi Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10306",
    "title": "FIANCEE: Faster Inference of Adversarial Networks via Conditional Early  Exits",
    "abstract": "Generative DNNs are a powerful tool for image synthesis, but they are limited by their computational load. On the other hand, given a trained model and a task, e.g. faces generation within a range of characteristics, the output image quality will be unevenly distributed among images with different characteristics. It follows, that we might restrain the models complexity on some instances, maintaining a high quality. We propose a method for diminishing computations by adding so-called early exit branches to the original architecture, and dynamically switching the computational path depending on how difficult it will be to render the output. We apply our method on two different SOTA models performing generative tasks: generation from a semantic map, and cross-reenactment of face expressions; showing it is able to output images with custom lower-quality thresholds. For a threshold of LPIPS <=0.1, we diminish their computations by up to a half. This is especially relevant for real-time applications such as synthesis of faces, when quality loss needs to be contained, but most of the inputs need fewer computations than the complex instances. ",
    "url": "https://arxiv.org/abs/2304.10306",
    "authors": [
      "Polina Karpikova",
      "Radionova Ekaterina",
      "Anastasia Yaschenko",
      "Andrei Spiridonov",
      "Leonid Kostyushko",
      "Riccardo Fabbricatore",
      "Aleksei Ivakhnenko"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.10311",
    "title": "Movie Box Office Prediction With Self-Supervised and Visually Grounded  Pretraining",
    "abstract": "Investments in movie production are associated with a high level of risk as movie revenues have long-tailed and bimodal distributions. Accurate prediction of box-office revenue may mitigate the uncertainty and encourage investment. However, learning effective representations for actors, directors, and user-generated content-related keywords remains a challenging open problem. In this work, we investigate the effects of self-supervised pretraining and propose visual grounding of content keywords in objects from movie posters as a pertaining objective. Experiments on a large dataset of 35,794 movies demonstrate significant benefits of self-supervised training and visual grounding. In particular, visual grounding pretraining substantially improves learning on movies with content keywords and achieves 14.5% relative performance gains compared to a finetuned BERT model with identical architecture. ",
    "url": "https://arxiv.org/abs/2304.10311",
    "authors": [
      "Qin Chao",
      "Eunsoo Kim",
      "Boyang Li"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10321",
    "title": "DropDim: A Regularization Method for Transformer Networks",
    "abstract": "We introduceDropDim, a structured dropout method designed for regularizing the self-attention mechanism, which is a key component of the transformer. In contrast to the general dropout method, which randomly drops neurons, DropDim drops part of the embedding dimensions. In this way, the semantic information can be completely discarded. Thus, the excessive coadapting between different embedding dimensions can be broken, and the self-attention is forced to encode meaningful featureswith a certain number of embedding dimensions erased. Experiments on a wide range of tasks executed on the MUST-C English-Germany dataset show that DropDim can effectively improve model performance, reduce over-fitting, and show complementary effects with other regularization methods. When combined with label smoothing, the WER can be reduced from 19.1% to 15.1% on the ASR task, and the BLEU value can be increased from26.90 to 28.38 on the MT task. On the ST task, the model can reach a BLEU score of 22.99, an increase by 1.86 BLEU points compared to the strong baseline. ",
    "url": "https://arxiv.org/abs/2304.10321",
    "authors": [
      "Hao Zhang",
      "Dan Qu",
      "Keji Shao",
      "Xukui Yang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10328",
    "title": "Learning Cellular Coverage from Real Network Configurations using GNNs",
    "abstract": "Cellular coverage quality estimation has been a critical task for self-organized networks. In real-world scenarios, deep-learning-powered coverage quality estimation methods cannot scale up to large areas due to little ground truth can be provided during network design & optimization. In addition they fall short in produce expressive embeddings to adequately capture the variations of the cells' configurations. To deal with this challenge, we formulate the task in a graph representation and so that we can apply state-of-the-art graph neural networks, that show exemplary performance. We propose a novel training framework that can both produce quality cell configuration embeddings for estimating multiple KPIs, while we show it is capable of generalising to large (area-wide) scenarios given very few labeled cells. We show that our framework yields comparable accuracy with models that have been trained using massively labeled samples. ",
    "url": "https://arxiv.org/abs/2304.10328",
    "authors": [
      "Yifei Jin",
      "Marios Daoutis",
      "Sarunas Girdzijauskas",
      "Aristides Gionis"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10336",
    "title": "Controllable Neural Symbolic Regression",
    "abstract": "In symbolic regression, the goal is to find an analytical expression that accurately fits experimental data with the minimal use of mathematical symbols such as operators, variables, and constants. However, the combinatorial space of possible expressions can make it challenging for traditional evolutionary algorithms to find the correct expression in a reasonable amount of time. To address this issue, Neural Symbolic Regression (NSR) algorithms have been developed that can quickly identify patterns in the data and generate analytical expressions. However, these methods, in their current form, lack the capability to incorporate user-defined prior knowledge, which is often required in natural sciences and engineering fields. To overcome this limitation, we propose a novel neural symbolic regression method, named Neural Symbolic Regression with Hypothesis (NSRwH) that enables the explicit incorporation of assumptions about the expected structure of the ground-truth expression into the prediction process. Our experiments demonstrate that the proposed conditioned deep learning model outperforms its unconditioned counterparts in terms of accuracy while also providing control over the predicted expression structure. ",
    "url": "https://arxiv.org/abs/2304.10336",
    "authors": [
      "Tommaso Bendinelli",
      "Luca Biggio",
      "Pierre-Alexandre Kamienny"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.10337",
    "title": "Prediction of the evolution of the nuclear reactor core parameters using  artificial neural network",
    "abstract": "A nuclear reactor based on MIT BEAVRS benchmark was used as a typical power generating Pressurized Water Reactor (PWR). The PARCS v3.2 nodal-diffusion core simulator was used as a full-core reactor physics solver to emulate the operation of a reactor and to generate training, and validation data for the ANN. The ANN was implemented with dedicated Python 3.8 code with Google's TensorFlow 2.0 library. The effort was based to a large extent on the process of appropriate automatic transformation of data generated by PARCS simulator, which was later used in the process of the ANN development. Various methods that allow obtaining better accuracy of the ANN predicted results were studied, such as trying different ANN architectures to find the optimal number of neurons in the hidden layers of the network. Results were later compared with the architectures proposed in the literature. For the selected best architecture predictions were made for different core parameters and their dependence on core loading patterns. In this study, a special focus was put on the prediction of the fuel cycle length for a given core loading pattern, as it can be considered one of the targets for plant economic operation. For instance, the length of a single fuel cycle depending on the initial core loading pattern was predicted with very good accuracy (>99%). This work contributes to the exploration of the usefulness of neural networks in solving nuclear reactor design problems. Thanks to the application of ANN, designers can avoid using an excessive amount of core simulator runs and more rapidly explore the space of possible solutions before performing more detailed design considerations. ",
    "url": "https://arxiv.org/abs/2304.10337",
    "authors": [
      "Krzysztof Palmi",
      "Wojciech Kubinski",
      "Piotr Darnowski"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10341",
    "title": "DocMAE: Document Image Rectification via Self-supervised Representation  Learning",
    "abstract": "Tremendous efforts have been made on document image rectification, but how to learn effective representation of such distorted images is still under-explored. In this paper, we present DocMAE, a novel self-supervised framework for document image rectification. Our motivation is to encode the structural cues in document images by leveraging masked autoencoder to benefit the rectification, i.e., the document boundaries, and text lines. Specifically, we first mask random patches of the background-excluded document images and then reconstruct the missing pixels. With such a self-supervised learning approach, the network is encouraged to learn the intrinsic structure of deformed documents by restoring document boundaries and missing text lines. Transfer performance in the downstream rectification task validates the effectiveness of our method. Extensive experiments are conducted to demonstrate the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2304.10341",
    "authors": [
      "Shaokai Liu",
      "Hao Feng",
      "Wengang Zhou",
      "Houqiang Li",
      "Cong Liu",
      "Feng Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10348",
    "title": "Neuro-OSVETA: A Robust Watermarking of 3D Meshes",
    "abstract": "Best and practical watermarking schemes for copyright protection of 3D meshes are required to be blind and robust to attacks and errors. In this paper, we present the latest developments in 3D blind watermarking with a special emphasis on our Ordered Statistics Vertex Extraction and Tracing Algorithm (OSVETA) algorithm and its improvements. OSVETA is based on a combination of quantization index modulation (QIM) and error correction coding using novel ways for judicial selection of mesh vertices which are stable under mesh simplification, and the technique we propose in this paper offers a systematic method for vertex selection based on neural networks replacing a heuristic approach in the OSVETA. The Neuro-OSVETA enables a more precise mesh geometry estimation and better curvature and topological feature estimation. These enhancements result in a more accurate identification of stable vertices resulting in significant reduction of deletion probability. ",
    "url": "https://arxiv.org/abs/2304.10348",
    "authors": [
      "Bata Vasc",
      "Nithin Raveendran",
      "Bane Vasic"
    ],
    "subjectives": [
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2304.10350",
    "title": "Polylog-Competitive Algorithms for Dynamic Balanced Graph Partitioning  for Ring Demands",
    "abstract": "The performance of many large-scale and data-intensive distributed systems critically depends on the capacity of the interconnecting network. This paper is motivated by the vision of self-adjusting infrastructures whose resources can be adjusted according to the workload they currently serve, in a demand-aware manner. Such dynamic adjustments can be exploited to improve network utilization and hence performance, by dynamically moving frequently interacting communication partners closer, e.g., collocating them in the same server or datacenter rack. In particular, we revisit the online balanced graph partitioning problem which captures the fundamental tradeoff between the benefits and costs of dynamically collocating communication partners. The demand is modelled as a sequence $\\sigma$ (revealed in an online manner) of communication requests between $n$ processes, each of which is running on one of the $\\ell$ servers. Each server has capacity $k=n/\\ell$, hence, the processes have to be scheduled in a balanced manner across the servers. A request incurs cost $1$, if the requested processes are located on different servers, otherwise the cost is 0. A process can be migrated to a different server at cost $1$. This paper presents the first online algorithm for online balanced graph partitioning achieving a polylogarithmic competitive ratio for the fundamental case of ring communication patterns. Specifically, our main contribution is a $O(\\log^3 n)$-competitive randomized online algorithm for this problem. We further present a randomized online algorithm which is $O(\\log^2 n)$-competitive when compared to a static optimal solution. Our two results rely on different algorithms and techniques and hence are of independent interest. ",
    "url": "https://arxiv.org/abs/2304.10350",
    "authors": [
      "Harald Räcke",
      "Stefan Schmid",
      "Ruslan Zabrodin"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2304.10360",
    "title": "Trust regulation in Social Robotics: From Violation to Repair",
    "abstract": "While trust in human-robot interaction is increasingly recognized as necessary for the implementation of social robots, our understanding of regulating trust in human-robot interaction is yet limited. In the current experiment, we evaluated different approaches to trust calibration in human-robot interaction. The within-subject experimental approach utilized five different strategies for trust calibration: proficiency, situation awareness, transparency, trust violation, and trust repair. We implemented these interventions into a within-subject experiment where participants (N=24) teamed up with a social robot and played a collaborative game. The level of trust was measured after each section using the Multi-Dimensional Measure of Trust (MDMT) scale. As expected, the interventions have a significant effect on i) violating and ii) repairing the level of trust throughout the interaction. Consequently, the robot demonstrating situation awareness was perceived as significantly more benevolent than the baseline. ",
    "url": "https://arxiv.org/abs/2304.10360",
    "authors": [
      "Matouš Jelínek",
      "Kerstin Fischer"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.10362",
    "title": "Kirchhoff-Love shell representation and analysis using triangle  configuration B-splines",
    "abstract": "This paper presents the application of triangle configuration B-splines (TCB-splines) for representing and analyzing the Kirchhoff-Love shell in the context of isogeometric analysis (IGA). The Kirchhoff-Love shell formulation requires global $C^1$-continuous basis functions. The nonuniform rational B-spline (NURBS)-based IGA has been extensively used for developing Kirchhoff-Love shell elements. However, shells with complex geometries inevitably need multiple patches and trimming techniques, where stitching patches with high continuity is a challenge. On the other hand, due to their unstructured nature, TCB-splines can accommodate general polygonal domains, have local refinement, and are flexible to model complex geometries with $C^1$ continuity, which naturally fit into the Kirchhoff-Love shell formulation with complex geometries. Therefore, we propose to use TCB-splines as basis functions for geometric representation and solution approximation. We apply our method to both linear and nonlinear benchmark shell problems, where the accuracy and robustness are validated. The applicability of the proposed approach to shell analysis is further exemplified by performing geometrically nonlinear Kirchhoff-Love shell simulations of a pipe junction and a front bumper represented by a single patch of TCB-splines. ",
    "url": "https://arxiv.org/abs/2304.10362",
    "authors": [
      "Zhihao Wang",
      "Juan Cao",
      "Xiaodong Wei",
      "Zhonggui Chen",
      "Hugo Casquero",
      "Yongjie Jessica Zhang"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2304.10369",
    "title": "Novice programmers strategies for online resource use and their impact  on source code",
    "abstract": "Websites are frequently used by programmers to support the development process. This paper investigates programmer-Web interactions when coding, and combines observations of behaviour with assessments of the resulting source code. We report on an online observational study with ten undergraduate student programmers as they engaged in programming tasks of varying complexity. Screens were recorded of participants' activities, and each participated in an interview. Videos and interviews were thematically analysed. Novice programmers employed various strategies for seeking and utilising online knowledge. The resulting source code was examined to determine the extent to which it met requirements and whether it contained errors. The source code analysis revealed that coding with the websites involved more coding time and effort, but increased the possibility of producing correct code. However, coding with websites also introduced instances of either incorrect or non-executable source code. ",
    "url": "https://arxiv.org/abs/2304.10369",
    "authors": [
      "Omar Alghamdi",
      "Sarah Clinch",
      "Mohammad Alhamadi",
      "Caroline Jay"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2304.10386",
    "title": "Breast cancer detection using deep learning",
    "abstract": "Objective: This paper proposes a deep learning model for breast cancer detection from reconstructed images of microwave imaging scan data and aims to improve the accuracy and efficiency of breast tumor detection, which could have a significant impact on breast cancer diagnosis and treatment. Methods: Our framework consists of different convolutional neural network (CNN) architectures for feature extraction and a region-based CNN for tumor detection. We use 7 different architectures: DenseNet201, ResNet50, InceptionV3, InceptionResNetV3, MobileNetV2, NASNetMobile and NASNetLarge and compare its performance to find the best architecture out of the seven. An experimental dataset of MRI-derived breast phantoms was used. Results: NASNetLarge is the best architecture which can be used for the CNN model with accuracy of 88.41% and loss of 27.82%. Given that the model's AUC is 0.786, it can be concluded that it is suitable for use in its present form, while it could be improved upon and trained on other datasets that are comparable. Impact: One of the main causes of death in women is breast cancer, and early identification is essential for enhancing the results for patients. Due to its non-invasiveness and capacity to produce high-resolution images, microwave imaging is a potential tool for breast cancer screening. The complexity of tumors makes it difficult to adequately detect them in microwave images. The results of this research show that deep learning has a lot of potential for breast cancer detection in microwave images ",
    "url": "https://arxiv.org/abs/2304.10386",
    "authors": [
      "Gayathri Girish",
      "Ponnathota Spandana",
      "Badrish Vasu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.10406",
    "title": "LiDAR-NeRF: Novel LiDAR View Synthesis via Neural Radiance Fields",
    "abstract": "We introduce a new task, novel view synthesis for LiDAR sensors. While traditional model-based LiDAR simulators with style-transfer neural networks can be applied to render novel views, they fall short in producing accurate and realistic LiDAR patterns, because the renderers they rely on exploit game engines, which are not differentiable. We address this by formulating, to the best of our knowledge, the first differentiable LiDAR renderer, and propose an end-to-end framework, LiDAR-NeRF, leveraging a neural radiance field (NeRF) to enable jointly learning the geometry and the attributes of 3D points. To evaluate the effectiveness of our approach, we establish an object-centric multi-view LiDAR dataset, dubbed NeRF-MVL. It contains observations of objects from 9 categories seen from 360-degree viewpoints captured with multiple LiDAR sensors. Our extensive experiments on the scene-level KITTI-360 dataset, and on our object-level NeRF-MVL show that our LiDAR- NeRF surpasses the model-based algorithms significantly. ",
    "url": "https://arxiv.org/abs/2304.10406",
    "authors": [
      "Tang Tao",
      "Longfei Gao",
      "Guangrun Wang",
      "Peng Chen",
      "Dayang Hao",
      "Xiaodan Liang",
      "Mathieu Salzmann",
      "Kaicheng Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10410",
    "title": "Radar-Camera Fusion for Object Detection and Semantic Segmentation in  Autonomous Driving: A Comprehensive Review",
    "abstract": "Driven by deep learning techniques, perception technology in autonomous driving has developed rapidly in recent years. To achieve accurate and robust perception capabilities, autonomous vehicles are often equipped with multiple sensors, making sensor fusion a crucial part of the perception system. Among these fused sensors, radars and cameras enable a complementary and cost-effective perception of the surrounding environment regardless of lighting and weather conditions. This review aims to provide a comprehensive guideline for radar-camera fusion, particularly concentrating on perception tasks related to object detection and semantic segmentation. Based on the principles of the radar and camera sensors, we delve into the data processing process and representations, followed by an in-depth analysis and summary of radar-camera fusion datasets. In the review of methodologies in radar-camera fusion, we address interrogative questions, including \"why to fuse\", \"what to fuse\", \"where to fuse\", \"when to fuse\", and \"how to fuse\", subsequently discussing various challenges and potential research directions within this domain. To ease the retrieval and comparison of datasets and fusion methods, we also provide an interactive website: https://XJTLU-VEC.github.io/Radar-Camera-Fusion. ",
    "url": "https://arxiv.org/abs/2304.10410",
    "authors": [
      "Shanliang Yao",
      "Runwei Guan",
      "Xiaoyu Huang",
      "Zhuoxiao Li",
      "Xiangyu Sha",
      "Yong Yue",
      "Eng Gee Lim",
      "Hyungjoon Seo",
      "Ka Lok Man",
      "Xiaohui Zhu",
      "Yutao Yue"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.10427",
    "title": "On the Potential of Artificial Intelligence Chatbots for Data  Exploration of Federated Bioinformatics Knowledge Graphs",
    "abstract": "In this paper, we present work in progress on the role of artificial intelligence (AI) chatbots, such as ChatGPT, in facilitating data access to federated knowledge graphs. In particular, we provide examples from the field of bioinformatics, to illustrate the potential use of Conversational AI to describe datasets, as well as generate and explain (federated) queries across datasets for the benefit of domain experts. ",
    "url": "https://arxiv.org/abs/2304.10427",
    "authors": [
      "Ana-Claudia Sima",
      "Tarcisio Mendes de Farias"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.10442",
    "title": "Securing Neural Networks with Knapsack Optimization",
    "abstract": "Deep learning inference brings together the data and the Convolutional Neural Network (CNN). This is problematic in case the user wants to preserve the privacy of the data and the service provider does not want to reveal the weights of his CNN. Secure Inference allows the two parties to engage in a protocol that preserves their respective privacy concerns, while revealing only the inference result to the user. This is known as Multi-Party Computation (MPC). A major bottleneck of MPC algorithms is communication, as the parties must send data back and forth. The linear component of a CNN (i.e. convolutions) can be done efficiently with minimal communication, but the non-linear part (i.e., ReLU) requires the bulk of communication bandwidth. We propose two ways to accelerate Secure Inference. The first is based on the observation that the ReLU outcome of many convolutions is highly correlated. Therefore, we replace the per pixel ReLU operation by a ReLU operation per patch. Each layer in the network will benefit from a patch of a different size and we devise an algorithm to choose the optimal set of patch sizes through a novel reduction of the problem to a knapsack problem. The second way to accelerate Secure Inference is based on cutting the number of bit comparisons required for a secure ReLU operation. We demonstrate the cumulative effect of these tools in the semi-honest secure 3-party setting for four problems: Classifying ImageNet using ResNet50 backbone, classifying CIFAR100 using ResNet18 backbone, semantic segmentation of ADE20K using MobileNetV2 backbone and semantic segmentation of Pascal VOC 2012 using ResNet50 backbone. Our source code is publicly available: $\\href{https://github.com/yg320/secure_inference}{\\text{https://github.com/yg320/secure_inference}}$ ",
    "url": "https://arxiv.org/abs/2304.10442",
    "authors": [
      "Yakir Gorski",
      "Shai Avidan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10446",
    "title": "Certified Adversarial Robustness Within Multiple Perturbation Bounds",
    "abstract": "Randomized smoothing (RS) is a well known certified defense against adversarial attacks, which creates a smoothed classifier by predicting the most likely class under random noise perturbations of inputs during inference. While initial work focused on robustness to $\\ell_2$ norm perturbations using noise sampled from a Gaussian distribution, subsequent works have shown that different noise distributions can result in robustness to other $\\ell_p$ norm bounds as well. In general, a specific noise distribution is optimal for defending against a given $\\ell_p$ norm based attack. In this work, we aim to improve the certified adversarial robustness against multiple perturbation bounds simultaneously. Towards this, we firstly present a novel \\textit{certification scheme}, that effectively combines the certificates obtained using different noise distributions to obtain optimal results against multiple perturbation bounds. We further propose a novel \\textit{training noise distribution} along with a \\textit{regularized training scheme} to improve the certification within both $\\ell_1$ and $\\ell_2$ perturbation norms simultaneously. Contrary to prior works, we compare the certified robustness of different training algorithms across the same natural (clean) accuracy, rather than across fixed noise levels used for training and certification. We also empirically invalidate the argument that training and certifying the classifier with the same amount of noise gives the best results. The proposed approach achieves improvements on the ACR (Average Certified Radius) metric across both $\\ell_1$ and $\\ell_2$ perturbation bounds. ",
    "url": "https://arxiv.org/abs/2304.10446",
    "authors": [
      "Soumalya Nandi",
      "Sravanti Addepalli",
      "Harsh Rangwani",
      "R. Venkatesh Babu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10477",
    "title": "Location Privacy Protection Game against Adversary through Multi-user  Cooperative Obfuscation",
    "abstract": "In location-based services(LBSs), it is promising for users to crowdsource and share their Point-of-Interest(PoI) information with each other in a common cache to reduce query frequency and preserve location privacy. Yet most studies on multi-user privacy preservation overlook the opportunity of leveraging their service flexibility. This paper is the first to study multiple users' strategic cooperation against an adversary's optimal inference attack, by leveraging mutual service flexibility. We formulate the multi-user privacy cooperation against the adversary as a max-min adversarial game and solve it in a linear program. Unlike the vast literature, even if a user finds the cached information useful, we prove it beneficial to still query the platform to further confuse the adversary. As the linear program's computational complexity still increases superlinearly with the number of users' possible locations, we propose a binary obfuscation scheme in two opposite spatial directions to achieve guaranteed performance with only constant complexity. Perhaps surprisingly, a user with a greater service flexibility should query with a less obfuscated location to add confusion. Finally, we provide guidance on the optimal query sequence among LBS users. Simulation results show that our crowdsourced privacy protection scheme greatly improves users' privacy as compared with existing approaches. ",
    "url": "https://arxiv.org/abs/2304.10477",
    "authors": [
      "Shu Hong",
      "Lingjie Duan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2304.10500",
    "title": "Transformer Models for Type Inference in the Simply Typed Lambda  Calculus: A Case Study in Deep Learning for Code",
    "abstract": "Despite a growing body of work at the intersection of deep learning and formal languages, there has been relatively little systematic exploration of transformer models for reasoning about typed lambda calculi. This is an interesting area of inquiry for two reasons. First, typed lambda calculi are the lingua franc of programming languages. A set of heuristics that relate various typed lambda calculi to effective neural architectures would provide a systematic method for mapping language features (e.g., polymorphism, subtyping, inheritance, etc.) to architecture choices. Second, transformer models are widely used in deep learning architectures applied to code, but the design and hyperparameter space for them is large and relatively unexplored in programming language applications. Therefore, we suggest a benchmark that allows us to explore exactly this through perhaps the simplest and most fundamental property of a programming language: the relationship between terms and types. Consequently, we begin this inquiry of transformer architectures for typed lambda calculi by exploring the effect of transformer warm-up and optimizer selection in the task of type inference: i.e., predicting the types of lambda calculus terms using only transformers. We find that the optimization landscape is difficult even in this simple setting. One particular experimental finding is that optimization by Adafactor converges much faster compared to the optimization by Adam and RAdam. We conjecture that such different performance of optimizers might be related to the difficulties of generalization over formally generated dataset. ",
    "url": "https://arxiv.org/abs/2304.10500",
    "authors": [
      "Brando Miranda",
      "Avi Shinnar",
      "Vasily Pestun",
      "Barry Trager"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)",
      "Symbolic Computation (cs.SC)"
    ]
  },
  {
    "id": "arXiv:2304.10502",
    "title": "Study of Robust Adaptive Beamforming with Covariance Matrix  Reconstruction Based on Power Spectral Estimation and Uncertainty Region",
    "abstract": "In this work, a simple and effective robust adaptive beamforming technique is proposed for uniform linear arrays, which is based on the power spectral estimation and uncertainty region (PSEUR) of the interference plus noise (IPN) components. In particular, two algorithms are presented to find the angular sector of interference in every snapshot based on the adopted spatial uncertainty region of the interference direction. Moreover, a power spectrum is introduced based on the estimation of the power of interference and noise components, which allows the development of a robust approach to IPN covariance matrix reconstruction. The proposed method has two main advantages. First, an angular region that contains the interference direction is updated based on the statistics of the array data. Secondly, the proposed IPN-PSEUR method avoids estimating the power spectrum of the whole range of possible directions of the interference sector. Simulation results show that the performance of the proposed IPN-PSEUR beamformer is almost always close to the optimal value across a wide range of signal-to-noise ratios. ",
    "url": "https://arxiv.org/abs/2304.10502",
    "authors": [
      "S. Mohammadzadeh",
      "V. H. Nascimento",
      "R. C. de Lamare",
      "O. Kukrer"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10504",
    "title": "New Closed-Form ASER Expressions for Dual-Hop Mixed THz-RF Cooperative  Relay Networks",
    "abstract": "In this paper, we consider a dual-hop mixed THz-RF system model for backhaul-fronthaul applications where the link between source and destination is established only through the relay node in which decode-and-forward relaying protocol is used. The THz link suffers from the joint impact of antenna misalignment and stochastic characteristics of wireless channels, including the effect of environmental conditions such as pressure, humidity, and temperature. The envelope of THz link in the first hop follows a generalized $\\alpha-\\mu$ distribution, and for the RF end, the Nakagami-$m$ distribution is considered. In this context, we obtain new closed-form expressions of the cumulative density function and the moment-generating function of the end-to-end signal-to-noise ratio. Further, we derive the average symbol error rate expressions for coherent rectangular quadrature amplitude modulation (RQAM) and coherent hexagonal QAM (HQAM), as well as the non-coherent modulation scheme. The asymptotic behavior is also discussed to examine the system's diversity. Furthermore, the impact of several parameters, such as fading coefficients of individual links and antenna misalignment, as well as the distance between nodes, are also highlighted in the system's performance. Moreover, Monte Carlo simulations are used to validate the presented analytical framework. Finally, the presented numerical insights aid in the extraction of practical design principles. ",
    "url": "https://arxiv.org/abs/2304.10504",
    "authors": [
      "Soumendu Das",
      "Nagendra Kumar",
      "Dharmendra Dixit"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.10512",
    "title": "\"Can We Detect Substance Use Disorder?\": Knowledge and Time Aware  Classification on Social Media from Darkweb",
    "abstract": "Opioid and substance misuse is rampant in the United States today, with the phenomenon known as the \"opioid crisis\". The relationship between substance use and mental health has been extensively studied, with one possible relationship being: substance misuse causes poor mental health. However, the lack of evidence on the relationship has resulted in opioids being largely inaccessible through legal means. This study analyzes the substance use posts on social media with opioids being sold through crypto market listings. We use the Drug Abuse Ontology, state-of-the-art deep learning, and knowledge-aware BERT-based models to generate sentiment and emotion for the social media posts to understand users' perceptions on social media by investigating questions such as: which synthetic opioids people are optimistic, neutral, or negative about? or what kind of drugs induced fear and sorrow? or what kind of drugs people love or are thankful about? or which drugs people think negatively about? or which opioids cause little to no sentimental reaction. We discuss how we crawled crypto market data and its use in extracting posts for fentanyl, fentanyl analogs, and other novel synthetic opioids. We also perform topic analysis associated with the generated sentiments and emotions to understand which topics correlate with people's responses to various drugs. Additionally, we analyze time-aware neural models built on these features while considering historical sentiment and emotional activity of posts related to a drug. The most effective model performs well (statistically significant) with (macroF1=82.12, recall =83.58) to identify substance use disorder. ",
    "url": "https://arxiv.org/abs/2304.10512",
    "authors": [
      "Usha Lokala",
      "Orchid Chetia Phukan",
      "Triyasha Ghosh Dastidar",
      "Francois Lamy",
      "Raminta Daniulaityte",
      "Amit Sheth"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.10515",
    "title": "CP-CNN: Core-Periphery Principle Guided Convolutional Neural Network",
    "abstract": "The evolution of convolutional neural networks (CNNs) can be largely attributed to the design of its architecture, i.e., the network wiring pattern. Neural architecture search (NAS) advances this by automating the search for the optimal network architecture, but the resulting network instance may not generalize well in different tasks. To overcome this, exploring network design principles that are generalizable across tasks is a more practical solution. In this study, We explore a novel brain-inspired design principle based on the core-periphery property of the human brain network to guide the design of CNNs. Our work draws inspiration from recent studies suggesting that artificial and biological neural networks may have common principles in optimizing network architecture. We implement the core-periphery principle in the design of network wiring patterns and the sparsification of the convolution operation. The resulting core-periphery principle guided CNNs (CP-CNNs) are evaluated on three different datasets. The experiments demonstrate the effectiveness and superiority compared to CNNs and ViT-based methods. Overall, our work contributes to the growing field of brain-inspired AI by incorporating insights from the human brain into the design of neural networks. ",
    "url": "https://arxiv.org/abs/2304.10515",
    "authors": [
      "Lin Zhao",
      "Haixing Dai",
      "Zihao Wu",
      "Dajiang Zhu",
      "Tianming Liu"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10516",
    "title": "Distributed Neural Representation for Reactive in situ Visualization",
    "abstract": "In situ visualization and steering of computational modeling can be effectively achieved using reactive programming, which leverages temporal abstraction and data caching mechanisms to create dynamic workflows. However, implementing a temporal cache for large-scale simulations can be challenging. Implicit neural networks have proven effective in compressing large volume data. However, their application to distributed data has yet to be fully explored. In this work, we develop an implicit neural representation for distributed volume data and incorporate it into the DIVA reactive programming system. This implementation enables us to build an in situ temporal caching system with a capacity 100 times larger than previously achieved. We integrate our implementation into the Ascent infrastructure and evaluate its performance using real-world simulations. ",
    "url": "https://arxiv.org/abs/2304.10516",
    "authors": [
      "Qi Wu",
      "Joseph A. Insley",
      "Victor A. Mateevitsi",
      "Silvio Rizzi",
      "Michael E. Papka",
      "Kwan-Liu Ma"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.10524",
    "title": "Learning Narrow One-Hidden-Layer ReLU Networks",
    "abstract": "We consider the well-studied problem of learning a linear combination of $k$ ReLU activations with respect to a Gaussian distribution on inputs in $d$ dimensions. We give the first polynomial-time algorithm that succeeds whenever $k$ is a constant. All prior polynomial-time learners require additional assumptions on the network, such as positive combining coefficients or the matrix of hidden weight vectors being well-conditioned. Our approach is based on analyzing random contractions of higher-order moment tensors. We use a multi-scale analysis to argue that sufficiently close neurons can be collapsed together, sidestepping the conditioning issues present in prior work. This allows us to design an iterative procedure to discover individual neurons. ",
    "url": "https://arxiv.org/abs/2304.10524",
    "authors": [
      "Sitan Chen",
      "Zehao Dou",
      "Surbhi Goel",
      "Adam R Klivans",
      "Raghu Meka"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.10525",
    "title": "A User-Driven Framework for Regulating and Auditing Social Media",
    "abstract": "People form judgments and make decisions based on the information that they observe. A growing portion of that information is not only provided, but carefully curated by social media platforms. Although lawmakers largely agree that platforms should not operate without any oversight, there is little consensus on how to regulate social media. There is consensus, however, that creating a strict, global standard of \"acceptable\" content is untenable (e.g., in the US, it is incompatible with Section 230 of the Communications Decency Act and the First Amendment). In this work, we propose that algorithmic filtering should be regulated with respect to a flexible, user-driven baseline. We provide a concrete framework for regulating and auditing a social media platform according to such a baseline. In particular, we introduce the notion of a baseline feed: the content that a user would see without filtering (e.g., on Twitter, this could be the chronological timeline). We require that the feeds a platform filters contain \"similar\" informational content as their respective baseline feeds, and we design a principled way to measure similarity. This approach is motivated by related suggestions that regulations should increase user agency. We present an auditing procedure that checks whether a platform honors this requirement. Notably, the audit needs only black-box access to a platform's filtering algorithm, and it does not access or infer private user information. We provide theoretical guarantees on the strength of the audit. We further show that requiring closeness between filtered and baseline feeds does not impose a large performance cost, nor does it create echo chambers. ",
    "url": "https://arxiv.org/abs/2304.10525",
    "authors": [
      "Sarah H. Cen",
      "Aleksander Madry",
      "Devavrat Shah"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2304.10527",
    "title": "Multidimensional Uncertainty Quantification for Deep Neural Networks",
    "abstract": "Deep neural networks (DNNs) have received tremendous attention and achieved great success in various applications, such as image and video analysis, natural language processing, recommendation systems, and drug discovery. However, inherent uncertainties derived from different root causes have been realized as serious hurdles for DNNs to find robust and trustworthy solutions for real-world problems. A lack of consideration of such uncertainties may lead to unnecessary risk. For example, a self-driving autonomous car can misdetect a human on the road. A deep learning-based medical assistant may misdiagnose cancer as a benign tumor. In this work, we study how to measure different uncertainty causes for DNNs and use them to solve diverse decision-making problems more effectively. In the first part of this thesis, we develop a general learning framework to quantify multiple types of uncertainties caused by different root causes, such as vacuity (i.e., uncertainty due to a lack of evidence) and dissonance (i.e., uncertainty due to conflicting evidence), for graph neural networks. We provide a theoretical analysis of the relationships between different uncertainty types. We further demonstrate that dissonance is most effective for misclassification detection and vacuity is most effective for Out-of-Distribution (OOD) detection. In the second part of the thesis, we study the significant impact of OOD objects on semi-supervised learning (SSL) for DNNs and develop a novel framework to improve the robustness of existing SSL algorithms against OODs. In the last part of the thesis, we create a general learning framework to quantity multiple uncertainty types for multi-label temporal neural networks. We further develop novel uncertainty fusion operators to quantify the fused uncertainty of a subsequence for early event detection. ",
    "url": "https://arxiv.org/abs/2304.10527",
    "authors": [
      "Xujiang Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10528",
    "title": "Generalizing Neural Human Fitting to Unseen Poses With Articulated SE(3)  Equivariance",
    "abstract": "We address the problem of fitting a parametric human body model (SMPL) to point cloud data. Optimization-based methods require careful initialization and are prone to becoming trapped in local optima. Learning-based methods address this but do not generalize well when the input pose is far from those seen during training. For rigid point clouds, remarkable generalization has been achieved by leveraging SE(3)-equivariant networks, but these methods do not work on articulated objects. In this work we extend this idea to human bodies and propose ArtEq, a novel part-based SE(3)-equivariant neural architecture for SMPL model estimation from point clouds. Specifically, we learn a part detection network by leveraging local SO(3) invariance, and regress shape and pose using articulated SE(3) shape-invariant and pose-equivariant networks, all trained end-to-end. Our novel equivariant pose regression module leverages the permutation-equivariant property of self-attention layers to preserve rotational equivariance. Experimental results show that ArtEq can generalize to poses not seen during training, outperforming state-of-the-art methods by 74.5%, without requiring an optimization refinement step. Further, compared with competing works, our method is more than three orders of magnitude faster during inference and has 97.3% fewer parameters. The code and model will be available for research purposes at https://arteq.is.tue.mpg.de. ",
    "url": "https://arxiv.org/abs/2304.10528",
    "authors": [
      "Haiwen Feng",
      "Peter Kulits",
      "Shichen Liu",
      "Michael J. Black",
      "Victoria Abrevaya"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10537",
    "title": "Learning Neural Duplex Radiance Fields for Real-Time View Synthesis",
    "abstract": "Neural radiance fields (NeRFs) enable novel view synthesis with unprecedented visual quality. However, to render photorealistic images, NeRFs require hundreds of deep multilayer perceptron (MLP) evaluations - for each pixel. This is prohibitively expensive and makes real-time rendering infeasible, even on powerful modern GPUs. In this paper, we propose a novel approach to distill and bake NeRFs into highly efficient mesh-based neural representations that are fully compatible with the massively parallel graphics rendering pipeline. We represent scenes as neural radiance features encoded on a two-layer duplex mesh, which effectively overcomes the inherent inaccuracies in 3D surface reconstruction by learning the aggregated radiance information from a reliable interval of ray-surface intersections. To exploit local geometric relationships of nearby pixels, we leverage screen-space convolutions instead of the MLPs used in NeRFs to achieve high-quality appearance. Finally, the performance of the whole framework is further boosted by a novel multi-view distillation optimization strategy. We demonstrate the effectiveness and superiority of our approach via extensive experiments on a range of standard datasets. ",
    "url": "https://arxiv.org/abs/2304.10537",
    "authors": [
      "Ziyu Wan",
      "Christian Richardt",
      "Aljaž Božič",
      "Chao Li",
      "Vijay Rengarajan",
      "Seonghyeon Nam",
      "Xiaoyu Xiang",
      "Tuotuo Li",
      "Bo Zhu",
      "Rakesh Ranjan",
      "Jing Liao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2203.12777",
    "title": "Kernel Robust Hypothesis Testing",
    "abstract": "The problem of robust hypothesis testing is studied, where under the null and the alternative hypotheses, the data-generating distributions are assumed to be in some uncertainty sets, and the goal is to design a test that performs well under the worst-case distributions over the uncertainty sets. In this paper, uncertainty sets are constructed in a data-driven manner using kernel method, i.e., they are centered around empirical distributions of training samples from the null and alternative hypotheses, respectively; and are constrained via the distance between kernel mean embeddings of distributions in the reproducing kernel Hilbert space, i.e., maximum mean discrepancy (MMD). The Bayesian setting and the Neyman-Pearson setting are investigated. For the Bayesian setting where the goal is to minimize the worst-case error probability, an optimal test is firstly obtained when the alphabet is finite. When the alphabet is infinite, a tractable approximation is proposed to quantify the worst-case average error probability, and a kernel smoothing method is further applied to design test that generalizes to unseen samples. A direct robust kernel test is also proposed and proved to be exponentially consistent. For the Neyman-Pearson setting, where the goal is to minimize the worst-case probability of miss detection subject to a constraint on the worst-case probability of false alarm, an efficient robust kernel test is proposed and is shown to be asymptotically optimal. Numerical results are provided to demonstrate the performance of the proposed robust tests. ",
    "url": "https://arxiv.org/abs/2203.12777",
    "authors": [
      "Zhongchang Sun",
      "Shaofeng Zou"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.09981",
    "title": "Interpretable (not just posthoc-explainable) heterogeneous survivor  bias-corrected treatment effects for assignment of postdischarge  interventions to prevent readmissions",
    "abstract": "We used survival analysis to quantify the impact of postdischarge evaluation and management (E/M) services in preventing hospital readmission or death. Our approach avoids a specific pitfall of applying machine learning to this problem, which is an inflated estimate of the effect of interventions, due to survivors bias -- where the magnitude of inflation may be conditional on heterogeneous confounders in the population. This bias arises simply because in order to receive an intervention after discharge, a person must not have been readmitted in the intervening period. After deriving an expression for this phantom effect, we controlled for this and other biases within an inherently interpretable Bayesian survival framework. We identified case management services as being the most impactful for reducing readmissions overall, particularly for patients discharged to long term care facilities, with high resource utilization in the quarter preceding admission. ",
    "url": "https://arxiv.org/abs/2304.09981",
    "authors": [
      "Hongjing Xia",
      "Joshua C. Chang",
      "Sarah Nowak",
      "Sonya Mahajan",
      "Rohit Mahajan",
      "Ted L. Chang",
      "Carson C. Chow"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2304.10060",
    "title": "Optimality of Robust Online Learning",
    "abstract": "In this paper, we study an online learning algorithm with a robust loss function $\\mathcal{L}_{\\sigma}$ for regression over a reproducing kernel Hilbert space (RKHS). The loss function $\\mathcal{L}_{\\sigma}$ involving a scaling parameter $\\sigma>0$ can cover a wide range of commonly used robust losses. The proposed algorithm is then a robust alternative for online least squares regression aiming to estimate the conditional mean function. For properly chosen $\\sigma$ and step size, we show that the last iterate of this online algorithm can achieve optimal capacity independent convergence in the mean square distance. Moreover, if additional information on the underlying function space is known, we also establish optimal capacity dependent rates for strong convergence in RKHS. To the best of our knowledge, both of the two results are new to the existing literature of online learning. ",
    "url": "https://arxiv.org/abs/2304.10060",
    "authors": [
      "Zheng-Chu Guo",
      "Andreas Christmann",
      "Lei Shi"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10088",
    "title": "Towards the Universal Defense for Query-Based Audio Adversarial Attacks",
    "abstract": "Recently, studies show that deep learning-based automatic speech recognition (ASR) systems are vulnerable to adversarial examples (AEs), which add a small amount of noise to the original audio examples. These AE attacks pose new challenges to deep learning security and have raised significant concerns about deploying ASR systems and devices. The existing defense methods are either limited in application or only defend on results, but not on process. In this work, we propose a novel method to infer the adversary intent and discover audio adversarial examples based on the AEs generation process. The insight of this method is based on the observation: many existing audio AE attacks utilize query-based methods, which means the adversary must send continuous and similar queries to target ASR models during the audio AE generation process. Inspired by this observation, We propose a memory mechanism by adopting audio fingerprint technology to analyze the similarity of the current query with a certain length of memory query. Thus, we can identify when a sequence of queries appears to be suspectable to generate audio AEs. Through extensive evaluation on four state-of-the-art audio AE attacks, we demonstrate that on average our defense identify the adversary intent with over 90% accuracy. With careful regard for robustness evaluations, we also analyze our proposed defense and its strength to withstand two adaptive attacks. Finally, our scheme is available out-of-the-box and directly compatible with any ensemble of ASR defense models to uncover audio AE attacks effectively without model retraining. ",
    "url": "https://arxiv.org/abs/2304.10088",
    "authors": [
      "Feng Guo",
      "Zheng Sun",
      "Yuxuan Chen",
      "Lei Ju"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Cryptography and Security (cs.CR)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2304.10094",
    "title": "Optimal radio labelings of the Cartesian product of the generalized  Peterson graph and tree",
    "abstract": "A radio labeling of a graph $G$ is a function $f : V(G) \\rightarrow \\{0,1,2,\\ldots\\}$ such that $|f(u)-f(v)| \\geq diam(G) + 1 - d(u,v)$ for every pair of distinct vertices $u,v$ of $G$. The radio number of $G$, denoted by $rn(G)$, is the smallest number $k$ such that $G$ has radio labeling $f$ with max$\\{f(v):v \\in V(G)\\} = k$. In this paper, we give a lower bound for the radio number for the Cartesian product of the generalized Petersen graph and tree. We present two necessary and sufficient conditions, and three other sufficient conditions to achieve the lower bound. Using these results, we determine the radio number for the Cartesian product of the Peterson graph and stars. ",
    "url": "https://arxiv.org/abs/2304.10094",
    "authors": [
      "Payal Vasoya",
      "Devsi Bantva"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2304.10159",
    "title": "Deep Reinforcement Learning Using Hybrid Quantum Neural Network",
    "abstract": "Quantum computation has a strong implication for advancing the current limitation of machine learning algorithms to deal with higher data dimensions or reducing the overall training parameters for a deep neural network model. Based on a gate-based quantum computer, a parameterized quantum circuit was designed to solve a model-free reinforcement learning problem with the deep-Q learning method. This research has investigated and evaluated its potential. Therefore, a novel PQC based on the latest Qiskit and PyTorch framework was designed and trained to compare with a full-classical deep neural network with and without integrated PQC. At the end of the research, the research draws its conclusion and prospects on developing deep quantum learning in solving a maze problem or other reinforcement learning problems. ",
    "url": "https://arxiv.org/abs/2304.10159",
    "authors": [
      "Hao-Yuan Chen"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.10167",
    "title": "Adaptive coded illumination Fourier ptychography microscopy based on  physical neural network",
    "abstract": "Fourier Ptychographic Microscopy (FPM) is a computational technique that achieves a large space-bandwidth product imaging. It addresses the challenge of balancing a large field of view and high resolution by fusing information from multiple images taken with varying illumination angles. Nevertheless, conventional FPM framework always suffers from long acquisition time and a heavy computational burden. In this paper, we propose a novel physical neural network that generates an adaptive illumination mode by incorporating temporally-encoded illumination modes as a distinct layer, aiming to improve the acquisition and calculation efficiency. Both simulations and experiments have been conducted to validate the feasibility and effectiveness of the proposed method. It is worth mentioning that, unlike previous works that obtain the intensity of a multiplexed illumination by post-combination of each sequentially illuminated and obtained low-resolution images, our experimental data is captured directly by turning on multiple LEDs with a coded illumination pattern. Our method has exhibited state-of-the-art performance in terms of both detail fidelity and imaging velocity when assessed through a multitude of evaluative aspects. ",
    "url": "https://arxiv.org/abs/2304.10167",
    "authors": [
      "Ruiqing Sun",
      "Delong Yang",
      "Yao Hu",
      "Qun Hao",
      "Xin Li",
      "Shaohui Zhang"
    ],
    "subjectives": [
      "Optics (physics.optics)",
      "Emerging Technologies (cs.ET)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2007.01975",
    "title": "Interpretation of Disease Evidence for Medical Images Using Adversarial  Deformation Fields",
    "abstract": " Comments: Presented at MICCAI 2020 ",
    "url": "https://arxiv.org/abs/2007.01975",
    "authors": [
      "Ricardo Bigolin Lanfredi",
      "Joyce D. Schroeder",
      "Clement Vachet",
      "Tolga Tasdizen"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2008.02144",
    "title": "FRMDN: Flow-based Recurrent Mixture Density Network",
    "abstract": " Title: FRMDN: Flow-based Recurrent Mixture Density Network ",
    "url": "https://arxiv.org/abs/2008.02144",
    "authors": [
      "Seyedeh Fatemeh Razavi",
      "Reshad Hosseini",
      "Tina Behzad"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2009.04709",
    "title": "Quantifying the Preferential Direction of the Model Gradient in  Adversarial Training With Projected Gradient Descent",
    "abstract": " Comments: This paper was published in Pattern Recognition ",
    "url": "https://arxiv.org/abs/2009.04709",
    "authors": [
      "Ricardo Bigolin Lanfredi",
      "Joyce D. Schroeder",
      "Tolga Tasdizen"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.06638",
    "title": "Generalized Contrastive Optimization of Siamese Networks for Place  Recognition",
    "abstract": " Comments: Published at CVPR2023 as arXiv:2303.11739 ",
    "url": "https://arxiv.org/abs/2103.06638",
    "authors": [
      "María Leyva-Vallina",
      "Nicola Strisciuglio",
      "Nicolai Petkov"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.03753",
    "title": "Energy-Efficient Naming in Beeping Networks",
    "abstract": " Title: Energy-Efficient Naming in Beeping Networks ",
    "url": "https://arxiv.org/abs/2106.03753",
    "authors": [
      "Ny Aina Andriambolamalala",
      "Vlady Ravelomanana"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2111.09902",
    "title": "A transformer-based model for default prediction in mid-cap corporate  markets",
    "abstract": " Comments: 38 pages, 6 figures, V4 published ",
    "url": "https://arxiv.org/abs/2111.09902",
    "authors": [
      "Kamesh Korangi",
      "Christophe Mues",
      "Cristián Bravo"
    ],
    "subjectives": [
      "General Finance (q-fin.GN)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.01360",
    "title": "Probabilistic Approach for Road-Users Detection",
    "abstract": " Comments: This work has been accepted for publication as a REGULAR PAPER in the Transactions on Intelligent Transportation Systems-ITS ",
    "url": "https://arxiv.org/abs/2112.01360",
    "authors": [
      "G. Melotti",
      "W. Lu",
      "P. Conde",
      "D. Zhao",
      "A. Asvadi",
      "N. Gonçalves",
      "C. Premebida"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03195",
    "title": "More is Better (Mostly): On the Backdoor Attacks in Federated Graph  Neural Networks",
    "abstract": " Comments: 15 pages, 13 figures ",
    "url": "https://arxiv.org/abs/2202.03195",
    "authors": [
      "Jing Xu",
      "Rui Wang",
      "Stefanos Koffas",
      "Kaitai Liang",
      "Stjepan Picek"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02853",
    "title": "Spin-Dependent Graph Neural Network Potential for Magnetic Materials",
    "abstract": " Comments: 28 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2203.02853",
    "authors": [
      "Hongyu Yu",
      "Yang Zhong",
      "Liangliang Hong",
      "Changsong Xu",
      "Wei Ren",
      "Xingao Gong",
      "Hongjun Xiang"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.03397",
    "title": "OverlapTransformer: An Efficient and Rotation-Invariant Transformer  Network for LiDAR-Based Place Recognition",
    "abstract": " Comments: Accepted by RAL/IROS 2022 ",
    "url": "https://arxiv.org/abs/2203.03397",
    "authors": [
      "Junyi Ma",
      "Jun Zhang",
      "Jintao Xu",
      "Rui Ai",
      "Weihao Gu",
      "Xieyuanli Chen"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.01218",
    "title": "Neural Rendering of Humans in Novel View and Pose from Monocular Video",
    "abstract": " Comments: 10 pages ",
    "url": "https://arxiv.org/abs/2204.01218",
    "authors": [
      "Tiantian Wang",
      "Nikolaos Sarafianos",
      "Ming-Hsuan Yang",
      "Tony Tung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08461",
    "title": "Investigating Temporal Convolutional Neural Networks for Satellite Image  Time Series Classification: A survey",
    "abstract": " Comments: 24 pages (not inc. 6 pages for appendices and references), 8 figures, 15 tables. Submitted for publishing ",
    "url": "https://arxiv.org/abs/2204.08461",
    "authors": [
      "James Brock",
      "Zahraa S. Abdallah"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02043",
    "title": "A Manifold Two-Sample Test Study: Integral Probability Metric with  Neural Networks",
    "abstract": " Comments: 32 pages, 2 figures, 3 tables. Accepted by Information and Inference: A Journal of the IMA ",
    "url": "https://arxiv.org/abs/2205.02043",
    "authors": [
      "Jie Wang",
      "Minshuo Chen",
      "Tuo Zhao",
      "Wenjing Liao",
      "Yao Xie"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2205.11039",
    "title": "FLEX: Feature-Logic Embedding Framework for CompleX Knowledge Graph  Reasoning",
    "abstract": " Title: FLEX: Feature-Logic Embedding Framework for CompleX Knowledge Graph  Reasoning ",
    "url": "https://arxiv.org/abs/2205.11039",
    "authors": [
      "Xueyuan Lin",
      "Haihong E",
      "Gengxian Zhou",
      "Tianyi Hu",
      "Li Ningyuan",
      "Mingzhi Sun",
      "Haoran Luo"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.14627",
    "title": "Continuous Generative Neural Networks",
    "abstract": " Comments: 40 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2205.14627",
    "authors": [
      "Giovanni S. Alberti",
      "Matteo Santacesaria",
      "Silvia Sciutto"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.04869",
    "title": "Graph-based Molecular Representation Learning",
    "abstract": " Title: Graph-based Molecular Representation Learning ",
    "url": "https://arxiv.org/abs/2207.04869",
    "authors": [
      "Zhichun Guo",
      "Kehan Guo",
      "Bozhao Nan",
      "Yijun Tian",
      "Roshni G. Iyer",
      "Yihong Ma",
      "Olaf Wiest",
      "Xiangliang Zhang",
      "Wei Wang",
      "Chuxu Zhang",
      "Nitesh V. Chawla"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.07572",
    "title": "Outlier detection of vital sign trajectories from COVID-19 patients",
    "abstract": " Comments: 4 pages, 4 figures, 1 table. Accepted to EMBC 2023, to be indexed in IEEE Xplore and PubMed Medline ",
    "url": "https://arxiv.org/abs/2207.07572",
    "authors": [
      "Sara Summerton",
      "Ann Tivey",
      "Rohan Shotton",
      "Gavin Brown",
      "Oliver C. Redfern",
      "Rachel Oakley",
      "John Radford",
      "David C. Wong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Human-Computer Interaction (cs.HC)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2209.05661",
    "title": "Unsupervised representation learning with recognition-parametrised  probabilistic models",
    "abstract": " Title: Unsupervised representation learning with recognition-parametrised  probabilistic models ",
    "url": "https://arxiv.org/abs/2209.05661",
    "authors": [
      "William I.Walker",
      "Hugo Soulat",
      "Changmin Yu",
      "Maneesh Sahani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.15171",
    "title": "State-specific protein-ligand complex structure prediction with a  multi-scale deep generative model",
    "abstract": " Comments: 19 pages, 5 figures, 1 table & Supplementary Information (18 pages, 2 figures, 7 tables, 12 algorithms); supersedes an earlier version arXiv:2209.15171v1 presented at the NeurIPS 2022 MLSB workshop as a contributed talk ",
    "url": "https://arxiv.org/abs/2209.15171",
    "authors": [
      "Zhuoran Qiao",
      "Weili Nie",
      "Arash Vahdat",
      "Thomas F. Miller III",
      "Anima Anandkumar"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2210.06688",
    "title": "Overlooked Video Classification in Weakly Supervised Video Anomaly  Detection",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2101.10030 by other authors ",
    "url": "https://arxiv.org/abs/2210.06688",
    "authors": [
      "Weijun Tan",
      "Qi Yao",
      "Jingfeng Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.15827",
    "title": "Federated Learning with Intermediate Representation Regularization",
    "abstract": " Comments: IEEE BigComp 2023 ",
    "url": "https://arxiv.org/abs/2210.15827",
    "authors": [
      "Ye Lin Tun",
      "Chu Myaet Thwal",
      "Yu Min Park",
      "Seong-Bae Park",
      "Choong Seon Hong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.00313",
    "title": "RGMIM: Region-Guided Masked Image Modeling for COVID-19 Detection",
    "abstract": " Comments: Under review ",
    "url": "https://arxiv.org/abs/2211.00313",
    "authors": [
      "Guang Li",
      "Ren Togo",
      "Takahiro Ogawa",
      "Miki Haseyama"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2211.09299",
    "title": "FedFA: Federated Learning with Feature Anchors to Align Features and  Classifiers for Heterogeneous Data",
    "abstract": " Title: FedFA: Federated Learning with Feature Anchors to Align Features and  Classifiers for Heterogeneous Data ",
    "url": "https://arxiv.org/abs/2211.09299",
    "authors": [
      "Tailin Zhou",
      "Jun Zhang",
      "Danny H.K. Tsang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.16854",
    "title": "Resolving Prime Modules: The Structure of Pseudo-cographs and  Galled-Tree Explainable Graphs",
    "abstract": " Comments: 18 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2211.16854",
    "authors": [
      "Marc Hellmuth",
      "Guillaume E. Scholz"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2212.02397",
    "title": "PowRL: A Reinforcement Learning Framework for Robust Management of Power  Networks",
    "abstract": " Comments: Accepted at the 37th AAAI Conference on Artificial Intelligence ",
    "url": "https://arxiv.org/abs/2212.02397",
    "authors": [
      "Anandsingh Chauhan",
      "Mayank Baranwal",
      "Ansuma Basumatary"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.05989",
    "title": "MegaCRN: Meta-Graph Convolutional Recurrent Network for Spatio-Temporal  Modeling",
    "abstract": " Comments: Rejected by AIJ. We withdraw for now and shall further work on the manuscript ",
    "url": "https://arxiv.org/abs/2212.05989",
    "authors": [
      "Renhe Jiang",
      "Zhaonan Wang",
      "Jiawei Yong",
      "Puneet Jeph",
      "Quanjun Chen",
      "Yasumasa Kobayashi",
      "Xuan Song",
      "Toyotaro Suzumura",
      "Shintaro Fukushima"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.12110",
    "title": "Combatting Front-Running in Smart Contracts: Attack Mining, Benchmark  Construction and Vulnerability Detector Evaluation",
    "abstract": " Comments: Accepted as Journal First paper on the Transactions on Software Engineering (TSE-2022-12-0547) ",
    "url": "https://arxiv.org/abs/2212.12110",
    "authors": [
      "Wuqi Zhang",
      "Lili Wei",
      "Shing-Chi Cheung",
      "Yepang Liu",
      "Shuqing Li",
      "Lu Liu",
      "Michael R. Lyu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2301.12721",
    "title": "Robust Attributed Graph Alignment via Joint Structure Learning and  Optimal Transport",
    "abstract": " Comments: ICDE 2023. Code and data are released at this https URL ",
    "url": "https://arxiv.org/abs/2301.12721",
    "authors": [
      "Jianheng Tang",
      "Weiqi Zhang",
      "Jiajin Li",
      "Kangfei Zhao",
      "Fugee Tsung",
      "Jia Li"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.04544",
    "title": "GMConv: Modulating Effective Receptive Fields for Convolutional Kernels",
    "abstract": " Comments: 10 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2302.04544",
    "authors": [
      "Qi Chen",
      "Chao Li",
      "Jia Ning",
      "Stephen Lin",
      "Kun He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06359",
    "title": "Fixing Overconfidence in Dynamic Neural Networks",
    "abstract": " Title: Fixing Overconfidence in Dynamic Neural Networks ",
    "url": "https://arxiv.org/abs/2302.06359",
    "authors": [
      "Lassi Meronen",
      "Martin Trapp",
      "Andrea Pilzer",
      "Le Yang",
      "Arno Solin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.10866",
    "title": "Hyena Hierarchy: Towards Larger Convolutional Language Models",
    "abstract": " Comments: Additional details ",
    "url": "https://arxiv.org/abs/2302.10866",
    "authors": [
      "Michael Poli",
      "Stefano Massaroli",
      "Eric Nguyen",
      "Daniel Y. Fu",
      "Tri Dao",
      "Stephen Baccus",
      "Yoshua Bengio",
      "Stefano Ermon",
      "Christopher Ré"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.14698",
    "title": "Heuristic Modularity Maximization Algorithms for Community Detection  Rarely Return an Optimal Partition or Anything Similar",
    "abstract": " Comments: 15 pages, 3 figures. This is a post-peer-review accepted manuscript from the Proceedings of the 23rd International Conference on Computational Science (ICCS 2023). The publisher authenticated version (version of record) is available on Springer-Nature website ",
    "url": "https://arxiv.org/abs/2302.14698",
    "authors": [
      "Samin Aref",
      "Mahdi Mostajabdaveh",
      "Hriday Chheda"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2303.00304",
    "title": "Renderable Neural Radiance Map for Visual Navigation",
    "abstract": " Comments: Preprint version. CVPR 2023 accepted, highlight paper. Project page: this https URL ",
    "url": "https://arxiv.org/abs/2303.00304",
    "authors": [
      "Obin Kwon",
      "Jeongho Park",
      "Songhwai Oh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2303.15739",
    "title": "Bayesian Free Energy of Deep ReLU Neural Network in Overparametrized  Cases",
    "abstract": " Comments: 20pages, 2figure ",
    "url": "https://arxiv.org/abs/2303.15739",
    "authors": [
      "Shuya Nagayasu",
      "Sumio Watanabe"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.02122",
    "title": "OpenContrails: Benchmarking Contrail Detection on GOES-16 ABI",
    "abstract": " Title: OpenContrails: Benchmarking Contrail Detection on GOES-16 ABI ",
    "url": "https://arxiv.org/abs/2304.02122",
    "authors": [
      "Joe Yue-Hei Ng",
      "Kevin McCloskey",
      "Jian Cui",
      "Vincent R. Meijer",
      "Erica Brand",
      "Aaron Sarna",
      "Nita Goyal",
      "Christopher Van Arsdale",
      "Scott Geraedts"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03294",
    "title": "What makes a good data augmentation for few-shot unsupervised image  anomaly detection?",
    "abstract": " Title: What makes a good data augmentation for few-shot unsupervised image  anomaly detection? ",
    "url": "https://arxiv.org/abs/2304.03294",
    "authors": [
      "Shuheng Zhang",
      "Lingrui Zhang",
      "Guoyang Xie",
      "Jiaqi Liu",
      "Hua Yan",
      "Jinbao Wang",
      "Feng Zheng",
      "Yaochu Jin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.04187",
    "title": "Similarity-Aware Multimodal Prompt Learning for Fake News Detection",
    "abstract": " Title: Similarity-Aware Multimodal Prompt Learning for Fake News Detection ",
    "url": "https://arxiv.org/abs/2304.04187",
    "authors": [
      "Ye Jiang",
      "Xiaomin Yu",
      "Yimin Wang",
      "Xiaoman Xu",
      "Xingyi Song",
      "Diana Maynard"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.04389",
    "title": "Deep Active Alignment of Knowledge Graph Entities and Schemata",
    "abstract": " Comments: Accepted in the ACM SIGMOD/PODS International Conference on Management of Data (SIGMOD 2023) ",
    "url": "https://arxiv.org/abs/2304.04389",
    "authors": [
      "Jiacheng Huang",
      "Zequn Sun",
      "Qijin Chen",
      "Xiaozhou Xu",
      "Weijun Ren",
      "Wei Hu"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.04589",
    "title": "Hyperspectral Image Super-Resolution via Dual-domain Network Based on  Hybrid Convolution",
    "abstract": " Title: Hyperspectral Image Super-Resolution via Dual-domain Network Based on  Hybrid Convolution ",
    "url": "https://arxiv.org/abs/2304.04589",
    "authors": [
      "Tingting Liu",
      "Yuan Liu",
      "Chuncheng Zhang",
      "Yuan Liyin",
      "Xiubao Sui",
      "Qian Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2304.05070",
    "title": "Static Analysis of Graph Database Transformations",
    "abstract": " Title: Static Analysis of Graph Database Transformations ",
    "url": "https://arxiv.org/abs/2304.05070",
    "authors": [
      "Iovka Boneva",
      "Benoit Groz",
      "Jan Hidders",
      "Filip Murlak",
      "Slawomir Staworko"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2304.05294",
    "title": "Selecting Robust Features for Machine Learning Applications using  Multidata Causal Discovery",
    "abstract": " Comments: 11 pages, 4 figures, 1 table, Supporting Information, Accepted for an oral presentation at the Climate Informatics 2023 ",
    "url": "https://arxiv.org/abs/2304.05294",
    "authors": [
      "Saranya Ganesh S.",
      "Tom Beucler",
      "Frederick Iat-Hin Tam",
      "Milton S. Gomez",
      "Jakob Runge",
      "Andreas Gerhardus"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2304.06234",
    "title": "Physics-informed radial basis network (PIRBN): A local approximating  neural network for solving nonlinear PDEs",
    "abstract": " Comments: 48 pages, 26 figures ",
    "url": "https://arxiv.org/abs/2304.06234",
    "authors": [
      "Jinshuai Bai",
      "Gui-Rong Liu",
      "Ashish Gupta",
      "Laith Alzubaidi",
      "Xi-Qiao Feng",
      "YuanTong Gu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06377",
    "title": "Emergence of Symbols in Neural Networks for Semantic Understanding and  Communication",
    "abstract": " Title: Emergence of Symbols in Neural Networks for Semantic Understanding and  Communication ",
    "url": "https://arxiv.org/abs/2304.06377",
    "authors": [
      "Yang Chen",
      "Liangxuan Guo",
      "Shan Yu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Symbolic Computation (cs.SC)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2304.07072",
    "title": "CornerFormer: Boosting Corner Representation for Fine-Grained Structured  Reconstruction",
    "abstract": " Title: CornerFormer: Boosting Corner Representation for Fine-Grained Structured  Reconstruction ",
    "url": "https://arxiv.org/abs/2304.07072",
    "authors": [
      "Hongbo Tian",
      "Yulong Li",
      "Linzhi Huang",
      "Yue Yang",
      "Weihong Deng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.07239",
    "title": "Separating Key Agreement and Computational Differential Privacy",
    "abstract": " Title: Separating Key Agreement and Computational Differential Privacy ",
    "url": "https://arxiv.org/abs/2304.07239",
    "authors": [
      "Vipul Arora",
      "Eldon Chung",
      "Zeyong Li",
      "Thomas Tan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.07973",
    "title": "Frequency Regularization: Restricting Information Redundancy of  Convolutional Neural Networks",
    "abstract": " Comments: This work has been submitted for peer review. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2304.07973",
    "authors": [
      "Chenqiu Zhao",
      "Guanfang Dong",
      "Shupei Zhang",
      "Zijie Tan",
      "Anup Basu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.08147",
    "title": "Convex NMPC reformulations for a special class of nonlinear multi-input  systems with application to rank-one bilinear networks",
    "abstract": " Comments: 8 pages, 4 Figures, submitted to 22nd World Congress of the International Federation of Automatic Control 2023 ",
    "url": "https://arxiv.org/abs/2304.08147",
    "authors": [
      "Manuel Klädtke",
      "Moritz Schulze Darup"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2304.08658",
    "title": "In-situ surface porosity prediction in DED (directed energy deposition)  printed SS316L parts using multimodal sensor fusion",
    "abstract": " Title: In-situ surface porosity prediction in DED (directed energy deposition)  printed SS316L parts using multimodal sensor fusion ",
    "url": "https://arxiv.org/abs/2304.08658",
    "authors": [
      "Adithyaa Karthikeyan",
      "Himanshu Balhara",
      "Andreas K Lianos",
      "Abhishek Hanchate",
      "Satish TS Bukkapatnam"
    ],
    "subjectives": [
      "Applied Physics (physics.app-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.09367",
    "title": "Graph Neural Network-Based Anomaly Detection for River Network Systems",
    "abstract": " Title: Graph Neural Network-Based Anomaly Detection for River Network Systems ",
    "url": "https://arxiv.org/abs/2304.09367",
    "authors": [
      "Katie Buchhorn",
      "Edgar Santos-Fernandez",
      "Kerrie Mengersen",
      "Robert Salomone"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2304.09433",
    "title": "Language Models Enable Simple Systems for Generating Structured Views of  Heterogeneous Data Lakes",
    "abstract": " Title: Language Models Enable Simple Systems for Generating Structured Views of  Heterogeneous Data Lakes ",
    "url": "https://arxiv.org/abs/2304.09433",
    "authors": [
      "Simran Arora",
      "Brandon Yang",
      "Sabri Eyuboglu",
      "Avanika Narayan",
      "Andrew Hojel",
      "Immanuel Trummer",
      "Christopher Ré"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.09623",
    "title": "CHATTY: Coupled Holistic Adversarial Transport Terms with Yield for  Unsupervised Domain Adaptation",
    "abstract": " Comments: 10 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2304.09623",
    "authors": [
      "Chirag P",
      "Mukta Wagle",
      "Ravi Kant Gupta",
      "Pranav Jeevan",
      "Amit Sethi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2304.09677",
    "title": "Reference-guided Controllable Inpainting of Neural Radiance Fields",
    "abstract": " Comments: Project Page: this https URL ",
    "url": "https://arxiv.org/abs/2304.09677",
    "authors": [
      "Ashkan Mirzaei",
      "Tristan Aumentado-Armstrong",
      "Marcus A. Brubaker",
      "Jonathan Kelly",
      "Alex Levinshtein",
      "Konstantinos G. Derpanis",
      "Igor Gilitschenski"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.09783",
    "title": "Application of attention-based Siamese composite neural network in  medical image recognition",
    "abstract": " Comments: This preprint is currently under consideration at Pattern Recognition Letters ",
    "url": "https://arxiv.org/abs/2304.09783",
    "authors": [
      "Zihao Huang",
      "Xia Chen",
      "Yue Wang",
      "Weixing Xin",
      "Xingtong Lin",
      "Huizhen Li",
      "Haowen Chen",
      "Yizhen Lao"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]