[
  {
    "id": "arXiv:2205.06837",
    "title": "Strategic Latency Reduction in Blockchain Peer-to-Peer Networks",
    "abstract": "Most permissionless blockchain networks run on peer-to-peer (P2P) networks, which offer flexibility and decentralization at the expense of performance (e.g., network latency). Historically, this tradeoff has not been a bottleneck for most blockchains. However, an emerging host of blockchain-based applications (e.g., decentralized finance) are increasingly sensitive to latency; users who can reduce their network latency relative to other users can accrue (sometimes significant) financial gains. In this work, we initiate the study of strategic latency reduction in blockchain P2P networks. We first define two classes of latency that are of interest in blockchain applications. We then show empirically that a strategic agent who controls only their local peering decisions can manipulate both types of latency, achieving 60\\% of the global latency gains provided by the centralized, paid service bloXroute, or, in targeted scenarios, comparable gains. Finally, we show that our results are not due to the poor design of existing P2P networks. Under a simple network model, we theoretically prove that an adversary can always manipulate the P2P network's latency to their advantage, provided the network experiences sufficient peer churn and transaction activity. ",
    "url": "https://arxiv.org/abs/2205.06837",
    "authors": [
      "Weizhao Tang",
      "Lucianna Kiffer",
      "Giulia Fanti",
      "Ari Juels"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Science and Game Theory (cs.GT)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2205.06854",
    "title": "An Approach for Automatic Construction of an Algorithmic Knowledge Graph  from Textual Resources",
    "abstract": "There is enormous growth in various fields of research. This development is accompanied by new problems. To solve these problems efficiently and in an optimized manner, algorithms are created and described by researchers in the scientific literature. Scientific algorithms are vital for understanding and reusing existing work in numerous domains. However, algorithms are generally challenging to find. Also, the comparison among similar algorithms is difficult because of the disconnected documentation. Information about algorithms is mostly present in websites, code comments, and so on. There is an absence of structured metadata to portray algorithms. As a result, sometimes redundant or similar algorithms are published, and the researchers build them from scratch instead of reusing or expanding upon the already existing algorithm. In this paper, we introduce an approach for automatically developing a knowledge graph (KG) for algorithmic problems from unstructured data. Because it captures information more clearly and extensively, an algorithm KG will give additional context and explainability to the algorithm metadata. ",
    "url": "https://arxiv.org/abs/2205.06854",
    "authors": [
      "Jyotima Patel",
      "Biswanath Dutta"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.06858",
    "title": "Physics guided neural networks for modelling of non-linear dynamics",
    "abstract": "The success of the current wave of artificial intelligence can be partly attributed to deep neural networks, which have proven to be very effective in learning complex patterns from large datasets with minimal human intervention. However, it is difficult to train these models on complex dynamical systems from data alone due to their low data efficiency and sensitivity to hyperparameters and initialisation. This work demonstrates that injection of partially known information at an intermediate layer in a DNN can improve model accuracy, reduce model uncertainty, and yield improved convergence during the training. The value of these physics-guided neural networks has been demonstrated by learning the dynamics of a wide variety of nonlinear dynamical systems represented by five well-known equations in nonlinear systems theory: the Lotka-Volterra, Duffing, Van der Pol, Lorenz, and Henon-Heiles systems. ",
    "url": "https://arxiv.org/abs/2205.06858",
    "authors": [
      "Haakon Robinson",
      "Suraj Pawar",
      "Adil Rasheed",
      "Omer San"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.06896",
    "title": "Robustness of Control Design via Bayesian Learning",
    "abstract": "In the realm of supervised learning, Bayesian learning has shown robust predictive capabilities under input and parameter perturbations. Inspired by these findings, we demonstrate the robustness properties of Bayesian learning in the control search task. We seek to find a linear controller that stabilizes a one-dimensional open-loop unstable stochastic system. We compare two methods to deduce the controller: the first (deterministic) one assumes perfect knowledge of system parameter and state, the second takes into account uncertainties in both and employs Bayesian learning to compute a posterior distribution for the controller. ",
    "url": "https://arxiv.org/abs/2205.06896",
    "authors": [
      "Nardos Ayele Ashenafi",
      "Wankun Sirichotiyakul",
      "Aykut C. Satici"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2205.06900",
    "title": "Universal Post-Training Backdoor Detection",
    "abstract": "A Backdoor attack (BA) is an important type of adversarial attack against deep neural network classifiers, wherein test samples from one or more source classes will be (mis)classified to the attacker's target class when a backdoor pattern (BP) is embedded. In this paper, we focus on the post-training backdoor defense scenario commonly considered in the literature, where the defender aims to detect whether a trained classifier was backdoor attacked, without any access to the training set. To the best of our knowledge, existing post-training backdoor defenses are all designed for BAs with presumed BP types, where each BP type has a specific embedding function. They may fail when the actual BP type used by the attacker (unknown to the defender) is different from the BP type assumed by the defender. In contrast, we propose a universal post-training defense that detects BAs with arbitrary types of BPs, without making any assumptions about the BP type. Our detector leverages the influence of the BA, independently of the BP type, on the landscape of the classifier's outputs prior to the softmax layer. For each class, a maximum margin statistic is estimated using a set of random vectors; detection inference is then performed by applying an unsupervised anomaly detector to these statistics. Thus, our detector is also an advance relative to most existing post-training methods by not needing any legitimate clean samples, and can efficiently detect BAs with arbitrary numbers of source classes. These advantages of our detector over several state-of-the-art methods are demonstrated on four datasets, for three different types of BPs, and for a variety of attack configurations. Finally, we propose a novel, general approach for BA mitigation once a detection is made. ",
    "url": "https://arxiv.org/abs/2205.06900",
    "authors": [
      "Hang Wang",
      "Zhen Xiang",
      "David J. Miller",
      "George Kesidis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.06904",
    "title": "Developing a Production System for Purpose of Call Detection in Business  Phone Conversations",
    "abstract": "For agents at a contact centre receiving calls, the most important piece of information is the reason for a given call. An agent cannot provide support on a call if they do not know why a customer is calling. In this paper we describe our implementation of a commercial system to detect Purpose of Call statements in English business call transcripts in real time. We present a detailed analysis of types of Purpose of Call statements and language patterns related to them, discuss an approach to collect rich training data by bootstrapping from a set of rules to a neural model, and describe a hybrid model which consists of a transformer-based classifier and a set of rules by leveraging insights from the analysis of call transcripts. The model achieved 88.6 F1 on average in various types of business calls when tested on real life data and has low inference time. We reflect on the challenges and design decisions when developing and deploying the system. ",
    "url": "https://arxiv.org/abs/2205.06904",
    "authors": [
      "Elena Khasanova",
      "Pooja Hiranandani",
      "Shayna Gardiner",
      "Cheng Chen",
      "Xue-Yong Fu",
      "Simon Corston-Oliver"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06910",
    "title": "A Property Induction Framework for Neural Language Models",
    "abstract": "To what extent can experience from language contribute to our conceptual knowledge? Computational explorations of this question have shed light on the ability of powerful neural language models (LMs) -- informed solely through text input -- to encode and elicit information about concepts and properties. To extend this line of research, we present a framework that uses neural-network language models (LMs) to perform property induction -- a task in which humans generalize novel property knowledge (has sesamoid bones) from one or more concepts (robins) to others (sparrows, canaries). Patterns of property induction observed in humans have shed considerable light on the nature and organization of human conceptual knowledge. Inspired by this insight, we use our framework to explore the property inductions of LMs, and find that they show an inductive preference to generalize novel properties on the basis of category membership, suggesting the presence of a taxonomic bias in their representations. ",
    "url": "https://arxiv.org/abs/2205.06910",
    "authors": [
      "Kanishka Misra",
      "Julia Taylor Rayz",
      "Allyson Ettinger"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.06918",
    "title": "Representation learning with function call graph transformations for  malware open set recognition",
    "abstract": "Open set recognition (OSR) problem has been a challenge in many machine learning (ML) applications, such as security. As new/unknown malware families occur regularly, it is difficult to exhaust samples that cover all the classes for the training process in ML systems. An advanced malware classification system should classify the known classes correctly while sensitive to the unknown class. In this paper, we introduce a self-supervised pre-training approach for the OSR problem in malware classification. We propose two transformations for the function call graph (FCG) based malware representations to facilitate the pretext task. Also, we present a statistical thresholding approach to find the optimal threshold for the unknown class. Moreover, the experiment results indicate that our proposed pre-training process can improve different performances of different downstream loss functions for the OSR problem. ",
    "url": "https://arxiv.org/abs/2205.06918",
    "authors": [
      "Jingyun Jia",
      "Philip K. Chan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06921",
    "title": "Ferrite: A Judgmental Embedding of Session Types in Rust",
    "abstract": "\\emph{Session types} have proved viable in expressing and verifying the protocols of message-passing systems. While message passing is a dominant concurrency paradigm in practice, real world software is written without session types. A limitation of existing session type libraries in mainstream languages is their restriction to linear session types, precluding application scenarios that demand sharing and thus aliasing of channel references. This paper introduces Ferrite, a shallow embedding of session types in Rust that supports both \\emph{linear} and \\emph{shared} sessions. The formal foundation of Ferrite constitutes the shared session type calculus $\\sills$, which Ferrite encodes via a novel \\emph{judgmental embedding} technique. The fulcrum of the embedding is the notion of a typing judgment that allows reasoning about shared and linear resources to type a session. Typing rules are then encoded as functions over judgments, with a valid typing derivation manifesting as a well-typed Rust program. This Rust program generated by Ferrite serves as a \\emph{certificate}, ensuring that the application will proceed according to the protocol defined by the session type. The paper details the features and implementation of Ferrite and includes a case study on implementing Servo's canvas component in Ferrite. ",
    "url": "https://arxiv.org/abs/2205.06921",
    "authors": [
      "Ruo Fei Chen",
      "Stephanie Balzer",
      "Bernardo Toninho"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2205.06926",
    "title": "Toward a Geometrical Understanding of Self-supervised Contrastive  Learning",
    "abstract": "Self-supervised learning (SSL) is currently one of the premier techniques to create data representations that are actionable for transfer learning in the absence of human annotations. Despite their success, the underlying geometry of these representations remains elusive, which obfuscates the quest for more robust, trustworthy, and interpretable models. In particular, mainstream SSL techniques rely on a specific deep neural network architecture with two cascaded neural networks: the encoder and the projector. When used for transfer learning, the projector is discarded since empirical results show that its representation generalizes more poorly than the encoder's. In this paper, we investigate this curious phenomenon and analyze how the strength of the data augmentation policies affects the data embedding. We discover a non-trivial relation between the encoder, the projector, and the data augmentation strength: with increasingly larger augmentation policies, the projector, rather than the encoder, is more strongly driven to become invariant to the augmentations. It does so by eliminating crucial information about the data by learning to project it into a low-dimensional space, a noisy estimate of the data manifold tangent plane in the encoder representation. This analysis is substantiated through a geometrical perspective with theoretical and empirical results. ",
    "url": "https://arxiv.org/abs/2205.06926",
    "authors": [
      "Romain Cosentino",
      "Anirvan Sengupta",
      "Salman Avestimehr",
      "Mahdi Soltanolkotabi",
      "Antonio Ortega",
      "Ted Willke",
      "Mariano Tepper"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.06938",
    "title": "Generating Literal and Implied Subquestions to Fact-check Complex Claims",
    "abstract": "Verifying complex political claims is a challenging task, especially when politicians use various tactics to subtly misrepresent the facts. Automatic fact-checking systems fall short here, and their predictions like \"half-true\" are not very useful in isolation, since we have no idea which parts of the claim are true and which are not. In this work, we focus on decomposing a complex claim into a comprehensive set of yes-no subquestions whose answers influence the veracity of the claim. We present ClaimDecomp, a dataset of decompositions for over 1000 claims. Given a claim and its verification paragraph written by fact-checkers, our trained annotators write subquestions covering both explicit propositions of the original claim and its implicit facets, such as asking about additional political context that changes our view of the claim's veracity. We study whether state-of-the-art models can generate such subquestions, showing that these models generate reasonable questions to ask, but predicting the comprehensive set of subquestions from the original claim without evidence remains challenging. We further show that these subquestions can help identify relevant evidence to fact-check the full claim and derive the veracity through their answers, suggesting that they can be useful pieces of a fact-checking pipeline. ",
    "url": "https://arxiv.org/abs/2205.06938",
    "authors": [
      "Jifan Chen",
      "Aniruddh Sriram",
      "Eunsol Choi",
      "Greg Durrett"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.06951",
    "title": "NR-RRT: Neural Risk-Aware Near-Optimal Path Planning in Uncertain  Nonconvex Environments",
    "abstract": "Balancing the trade-off between safety and efficiency is of significant importance for path planning under uncertainty. Many risk-aware path planners have been developed to explicitly limit the probability of collision to an acceptable bound in uncertain environments. However, convex obstacles or Gaussian uncertainties are usually assumed to make the problem tractable in the existing method. These assumptions limit the generalization and application of path planners in real-world implementations. In this article, we propose to apply deep learning methods to the sampling-based planner, developing a novel risk bounded near-optimal path planning algorithm named neural risk-aware RRT (NR-RRT). Specifically, a deterministic risk contours map is maintained by perceiving the probabilistic nonconvex obstacles, and a neural network sampler is proposed to predict the next most-promising safe state. Furthermore, the recursive divide-and-conquer planning and bidirectional search strategies are used to accelerate the convergence to a near-optimal solution with guaranteed bounded risk. Worst-case theoretical guarantees can also be proven owing to a standby safety guaranteed planner utilizing a uniform sampling distribution. Simulation experiments demonstrate that the proposed algorithm outperforms the state-of-the-art remarkably for finding risk bounded low-cost paths in seen and unseen environments with uncertainty and nonconvex constraints. ",
    "url": "https://arxiv.org/abs/2205.06951",
    "authors": [
      "Fei Meng",
      "Liangliang Chen",
      "Han Ma",
      "Jiankun Wang",
      "Max Q.-H. Meng"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2205.06955",
    "title": "Robust Design of Federated Learning for Edge-Intelligent Networks",
    "abstract": "Mass data traffics, low-latency wireless services and advanced artificial intelligence (AI) technologies have driven the emergence of a new paradigm for wireless networks, namely edge-intelligent networks, which are more efficient and flexible than traditional cloud-intelligent networks. Considering users' privacy, model sharing-based federated learning (FL) that migrates model parameters but not private data from edge devices to a central cloud is particularly attractive for edge-intelligent networks. Due to multiple rounds of iterative updating of high-dimensional model parameters between base station (BS) and edge devices, the communication reliability is a critical issue of FL for edge-intelligent networks. We reveal the impacts of the errors generated during model broadcast and model aggregation via wireless channels caused by channel fading, interference and noise on the accuracy of FL, especially when there exists channel uncertainty. To alleviate the impacts, we propose a robust FL algorithm for edge-intelligent networks with channel uncertainty, which is formulated as a worst-case optimization problem with joint device selection and transceiver design. Finally, simulation results validate the robustness and effectiveness of the proposed algorithm. ",
    "url": "https://arxiv.org/abs/2205.06955",
    "authors": [
      "Qiao Qi",
      "Xiaoming Chen"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2205.06980",
    "title": "Efficient Gesture Recognition for the Assistance of Visually Impaired  People using Multi-Head Neural Networks",
    "abstract": "This paper proposes an interactive system for mobile devices controlled by hand gestures aimed at helping people with visual impairments. This system allows the user to interact with the device by making simple static and dynamic hand gestures. Each gesture triggers a different action in the system, such as object recognition, scene description or image scaling (e.g., pointing a finger at an object will show a description of it). The system is based on a multi-head neural network architecture, which initially detects and classifies the gestures, and subsequently, depending on the gesture detected, performs a second stage that carries out the corresponding action. This multi-head architecture optimizes the resources required to perform different tasks simultaneously, and takes advantage of the information obtained from an initial backbone to perform different processes in a second stage. To train and evaluate the system, a dataset with about 40k images was manually compiled and labeled including different types of hand gestures, backgrounds (indoors and outdoors), lighting conditions, etc. This dataset contains synthetic gestures (whose objective is to pre-train the system in order to improve the results) and real images captured using different mobile phones. The results obtained and the comparison made with the state of the art show competitive results as regards the different actions performed by the system, such as the accuracy of classification and localization of gestures, or the generation of descriptions for objects and scenes. ",
    "url": "https://arxiv.org/abs/2205.06980",
    "authors": [
      "Samer Alashhab",
      "Antonio Javier Gallego",
      "Miguel Ángel Lozano"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.06986",
    "title": "Evaluating Membership Inference Through Adversarial Robustness",
    "abstract": "The usage of deep learning is being escalated in many applications. Due to its outstanding performance, it is being used in a variety of security and privacy-sensitive areas in addition to conventional applications. One of the key aspects of deep learning efficacy is to have abundant data. This trait leads to the usage of data which can be highly sensitive and private, which in turn causes wariness with regard to deep learning in the general public. Membership inference attacks are considered lethal as they can be used to figure out whether a piece of data belongs to the training dataset or not. This can be problematic with regards to leakage of training data information and its characteristics. To highlight the significance of these types of attacks, we propose an enhanced methodology for membership inference attacks based on adversarial robustness, by adjusting the directions of adversarial perturbations through label smoothing under a white-box setting. We evaluate our proposed method on three datasets: Fashion-MNIST, CIFAR-10, and CIFAR-100. Our experimental results reveal that the performance of our method surpasses that of the existing adversarial robustness-based method when attacking normally trained models. Additionally, through comparing our technique with the state-of-the-art metric-based membership inference methods, our proposed method also shows better performance when attacking adversarially trained models. The code for reproducing the results of this work is available at \\url{https://github.com/plll4zzx/Evaluating-Membership-Inference-Through-Adversarial-Robustness}. ",
    "url": "https://arxiv.org/abs/2205.06986",
    "authors": [
      "Zhaoxi Zhang",
      "Leo Yu Zhang",
      "Xufei Zheng",
      "Bilal Hussain Abbasi",
      "Shengshan Hu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.06987",
    "title": "Voxel-wise Adversarial Semi-supervised Learning for Medical Image  Segmentation",
    "abstract": "Semi-supervised learning for medical image segmentation is an important area of research for alleviating the huge cost associated with the construction of reliable large-scale annotations in the medical domain. Recent semi-supervised approaches have demonstrated promising results by employing consistency regularization, pseudo-labeling techniques, and adversarial learning. These methods primarily attempt to learn the distribution of labeled and unlabeled data by enforcing consistency in the predictions or embedding context. However, previous approaches have focused only on local discrepancy minimization or context relations across single classes. In this paper, we introduce a novel adversarial learning-based semi-supervised segmentation method that effectively embeds both local and global features from multiple hidden layers and learns context relations between multiple classes. Our voxel-wise adversarial learning method utilizes a voxel-wise feature discriminator, which considers multilayer voxel-wise features (involving both local and global features) as an input by embedding class-specific voxel-wise feature distribution. Furthermore, we improve our previous representation learning method by overcoming information loss and learning stability problems, which enables rich representations of labeled data. Our method outperforms current best-performing state-of-the-art semi-supervised learning approaches on the image segmentation of the left atrium (single class) and multiorgan datasets (multiclass). Moreover, our visual interpretation of the feature space demonstrates that our proposed method enables a well-distributed and separated feature space from both labeled and unlabeled data, which improves the overall prediction results. ",
    "url": "https://arxiv.org/abs/2205.06987",
    "authors": [
      "Chae Eun Lee",
      "Hyelim Park",
      "Yeong-Gil Shin",
      "Minyoung Chung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.06992",
    "title": "Verifying Neural Networks Against Backdoor Attacks",
    "abstract": "Neural networks have achieved state-of-the-art performance in solving many problems, including many applications in safety/security-critical systems. Researchers also discovered multiple security issues associated with neural networks. One of them is backdoor attacks, i.e., a neural network may be embedded with a backdoor such that a target output is almost always generated in the presence of a trigger. Existing defense approaches mostly focus on detecting whether a neural network is 'backdoored' based on heuristics, e.g., activation patterns. To the best of our knowledge, the only line of work which certifies the absence of backdoor is based on randomized smoothing, which is known to significantly reduce neural network performance. In this work, we propose an approach to verify whether a given neural network is free of backdoor with a certain level of success rate. Our approach integrates statistical sampling as well as abstract interpretation. The experiment results show that our approach effectively verifies the absence of backdoor or generates backdoor triggers. ",
    "url": "https://arxiv.org/abs/2205.06992",
    "authors": [
      "Long H. Pham",
      "Jun Sun"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06993",
    "title": "Improving Neural Machine Translation of Indigenous Languages with  Multilingual Transfer Learning",
    "abstract": "Machine translation (MT) involving Indigenous languages, including those possibly endangered, is challenging due to lack of sufficient parallel data. We describe an approach exploiting bilingual and multilingual pretrained MT models in a transfer learning setting to translate from Spanish to ten South American Indigenous languages. Our models set new SOTA on five out of the ten language pairs we consider, even doubling performance on one of these five pairs. Unlike previous SOTA that perform data augmentation to enlarge the train sets, we retain the low-resource setting to test the effectiveness of our models under such a constraint. In spite of the rarity of linguistic information available about the Indigenous languages, we offer a number of quantitative and qualitative analyses (e.g., as to morphology, tokenization, and orthography) to contextualize our results. ",
    "url": "https://arxiv.org/abs/2205.06993",
    "authors": [
      "Wei-Rui Chen",
      "Muhammad Abdul-Mageed"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.07014",
    "title": "SaiNet: Stereo aware inpainting behind objects with generative networks",
    "abstract": "In this work, we present an end-to-end network for stereo-consistent image inpainting with the objective of inpainting large missing regions behind objects. The proposed model consists of an edge-guided UNet-like network using Partial Convolutions. We enforce multi-view stereo consistency by introducing a disparity loss. More importantly, we develop a training scheme where the model is learned from realistic stereo masks representing object occlusions, instead of the more common random masks. The technique is trained in a supervised way. Our evaluation shows competitive results compared to previous state-of-the-art techniques. ",
    "url": "https://arxiv.org/abs/2205.07014",
    "authors": [
      "Violeta Menéndez González",
      "Andrew Gilbert",
      "Graeme Phillipson",
      "Stephen Jolly",
      "Simon Hadfield"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07017",
    "title": "Importance Weighted Structure Learning for Scene Graph Generation",
    "abstract": "Scene graph generation is a structured prediction task aiming to explicitly model objects and their relationships via constructing a visually-grounded scene graph for an input image. Currently, the message passing neural network based mean field variational Bayesian methodology is the ubiquitous solution for such a task, in which the variational inference objective is often assumed to be the classical evidence lower bound. However, the variational approximation inferred from such loose objective generally underestimates the underlying posterior, which often leads to inferior generation performance. In this paper, we propose a novel importance weighted structure learning method aiming to approximate the underlying log-partition function with a tighter importance weighted lower bound, which is computed from multiple samples drawn from a reparameterizable Gumbel-Softmax sampler. A generic entropic mirror descent algorithm is applied to solve the resulting constrained variational inference task. The proposed method achieves the state-of-the-art performance on various popular scene graph generation benchmarks. ",
    "url": "https://arxiv.org/abs/2205.07017",
    "authors": [
      "Daqi Liu",
      "Miroslaw Bober",
      "Josef Kittler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07019",
    "title": "Evaluating the Generalization Ability of Super-Resolution Networks",
    "abstract": "Performance and generalization ability are two important aspects to evaluate deep learning models. However, research on the generalization ability of Super-Resolution (SR) networks is currently absent. We make the first attempt to propose a Generalization Assessment Index for SR networks, namely SRGA. SRGA exploits the statistical characteristics of internal features of deep networks, not output images to measure the generalization ability. Specially, it is a non-parametric and non-learning metric. To better validate our method, we collect a patch-based image evaluation set (PIES) that includes both synthetic and real-world images, covering a wide range of degradations. With SRGA and PIES dataset, we benchmark existing SR models on the generalization ability. This work could lay the foundation for future research on model generalization in low-level vision. ",
    "url": "https://arxiv.org/abs/2205.07019",
    "authors": [
      "Yihao Liu",
      "Hengyuan Zhao",
      "Jinjin Gu",
      "Yu Qiao",
      "Chao Dong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2205.07023",
    "title": "High Performance of Gradient Boosting in Binding Affinity Prediction",
    "abstract": "Prediction of protein-ligand (PL) binding affinity remains the key to drug discovery. Popular approaches in recent years involve graph neural networks (GNNs), which are used to learn the topology and geometry of PL complexes. However, GNNs are computationally heavy and have poor scalability to graph sizes. On the other hand, traditional machine learning (ML) approaches, such as gradient-boosted decision trees (GBDTs), are lightweight yet extremely efficient for tabular data. We propose to use PL interaction features along with PL graph-level features in GBDT. We show that this combination outperforms the existing solutions. ",
    "url": "https://arxiv.org/abs/2205.07023",
    "authors": [
      "Dmitrii Gavrilev",
      "Nurlybek Amangeldiuly",
      "Sergei Ivanov",
      "Evgeny Burnaev"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07028",
    "title": "Object-Aware Self-supervised Multi-Label Learning",
    "abstract": "Multi-label Learning on Image data has been widely exploited with deep learning models. However, supervised training on deep CNN models often cannot discover sufficient discriminative features for classification. As a result, numerous self-supervision methods are proposed to learn more robust image representations. However, most self-supervised approaches focus on single-instance single-label data and fall short on more complex images with multiple objects. Therefore, we propose an Object-Aware Self-Supervision (OASS) method to obtain more fine-grained representations for multi-label learning, dynamically generating auxiliary tasks based on object locations. Secondly, the robust representation learned by OASS can be leveraged to efficiently generate Class-Specific Instances (CSI) in a proposal-free fashion to better guide multi-label supervision signal transfer to instances. Extensive experiments on the VOC2012 dataset for multi-label classification demonstrate the effectiveness of the proposed method against the state-of-the-art counterparts. ",
    "url": "https://arxiv.org/abs/2205.07028",
    "authors": [
      "Xu Kaixin",
      "Liu Liyang",
      "Zhao Ziyuan",
      "Zeng Zeng",
      "Bharadwaj Veeravalli"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07039",
    "title": "Fake News Quick Detection on Dynamic Heterogeneous Information Networks",
    "abstract": "The spread of fake news has caused great harm to society in recent years. So the quick detection of fake news has become an important task. Some current detection methods often model news articles and other related components as a static heterogeneous information network (HIN) and use expensive message-passing algorithms. However, in the real-world, quickly identifying fake news is of great significance and the network may vary over time in terms of dynamic nodes and edges. Therefore, in this paper, we propose a novel Dynamic Heterogeneous Graph Neural Network (DHGNN) for fake news quick detection. More specifically, we first implement BERT and fine-tuned BERT to get a semantic representation of the news article contents and author profiles and convert it into graph data. Then, we construct the heterogeneous news-author graph to reflect contextual information and relationships. Additionally, we adapt ideas from personalized PageRank propagation and dynamic propagation to heterogeneous networks in order to reduce the time complexity of back-propagating through many nodes during training. Experiments on three real-world fake news datasets show that DHGNN can outperform other GNN-based models in terms of both effectiveness and efficiency. ",
    "url": "https://arxiv.org/abs/2205.07039",
    "authors": [
      "Jin Ho Go",
      "Alina Sari",
      "Jiaojiao Jiang",
      "Shuiqiao Yang",
      "Sanjay Jha"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07043",
    "title": "Naturalistic Causal Probing for Morpho-Syntax",
    "abstract": "Probing has become a go-to methodology for interpreting and analyzing deep neural models in natural language processing. Yet recently, there has been much debate around the limitations and weaknesses of probes. In this work, we suggest a naturalistic strategy for input-level intervention on real world data in Spanish, which is a language with gender marking. Using our approach, we isolate morpho-syntactic features from counfounders in sentences, e.g. topic, which will then allow us to causally probe pre-trained models. We apply this methodology to analyze causal effects of gender and number on contextualized representations extracted from pre-trained models -- BERT, RoBERTa and GPT-2. Our experiments suggest that naturalistic intervention can give us stable estimates of causal effects, which varies across different words in a sentence. We further show the utility of our estimator in investigating gender bias in adjectives, and answering counterfactual questions in masked prediction. Our probing experiments highlights the importance of conducting causal probing in determining if a particular property is encoded in representations. ",
    "url": "https://arxiv.org/abs/2205.07043",
    "authors": [
      "Afra Amini",
      "Tiago Pimentel",
      "Clara Meister",
      "Ryan Cotterell"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.07050",
    "title": "Generalization error bounds for DECONET: a deep unfolded network for  analysis Compressive Sensing",
    "abstract": "In this paper, we propose a new deep unfolding neural network -- based on a state-of-the-art optimization algorithm -- for analysis Compressed Sensing. The proposed network called Decoding Network (DECONET) implements a decoder that reconstructs vectors from their incomplete, noisy measurements. Moreover, DECONET jointly learns a redundant analysis operator for sparsification, which is shared across the layers of DECONET. We study the generalization ability of DECONET. Towards that end, we first estimate the Rademacher complexity of the hypothesis class consisting of all the decoders that DECONET can implement. Then, we provide generalization error bounds, in terms of the aforementioned estimate. Finally, we present numerical experiments which confirm the validity of our theoretical results. ",
    "url": "https://arxiv.org/abs/2205.07050",
    "authors": [
      "Vasiliki Kouni"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07061",
    "title": "MIND: Maximum Mutual Information Based Neural Decoder",
    "abstract": "We are assisting at a growing interest in the development of learning architectures with application to digital communication systems. Herein, we consider the detection/decoding problem. We aim at developing an optimal neural architecture for such a task. The definition of the optimal criterion is a fundamental step. We propose to use the mutual information (MI) of the channel input-output signal pair. The computation of the MI is a formidable task, and for the majority of communication channels it is unknown. Therefore, the MI has to be learned. For such an objective, we propose a novel neural MI estimator based on a discriminative formulation. This leads to the derivation of the mutual information neural decoder (MIND). The developed neural architecture is capable not only to solve the decoding problem in unknown channels, but also to return an estimate of the average MI achieved with the coding scheme, as well as the decoding error probability. Several numerical results are reported and compared with maximum a-posteriori (MAP) and maximum likelihood (MaxL) decoding strategies. ",
    "url": "https://arxiv.org/abs/2205.07061",
    "authors": [
      "Andrea M. Tonello",
      "Nunzio A. Letizia"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07073",
    "title": "An Architecture for the detection of GAN-generated Flood Images with  Localization Capabilities",
    "abstract": "In this paper, we address a new image forensics task, namely the detection of fake flood images generated by ClimateGAN architecture. We do so by proposing a hybrid deep learning architecture including both a detection and a localization branch, the latter being devoted to the identification of the image regions manipulated by ClimateGAN. Even if our goal is the detection of fake flood images, in fact, we found that adding a localization branch helps the network to focus on the most relevant image regions with significant improvements in terms of generalization capabilities and robustness against image processing operations. The good performance of the proposed architecture is validated on two datasets of pristine flood images downloaded from the internet and three datasets of fake flood images generated by ClimateGAN starting from a large set of diverse street images. ",
    "url": "https://arxiv.org/abs/2205.07073",
    "authors": [
      "Jun Wang",
      "Omran Alamayreh",
      "Benedetta Tondi",
      "Mauro Barni"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.07075",
    "title": "Corrosion Detection for Industrial Objects: From Multi-Sensor System to  5D Feature Space",
    "abstract": "Corrosion is a form of damage that often appears on the surface of metal-made objects used in industrial applications. Those damages can be critical depending on the purpose of the used object. Optical-based testing systems provide a form of non-contact data acquisition, where the acquired data can then be used to analyse the surface of an object. In the field of industrial image processing, this is called surface inspection. We provide a testing setup consisting of a rotary table which rotates the object by 360 degrees, as well as industrial RGB cameras and laser triangulation sensors for the acquisition of 2D and 3D data as our multi-sensor system. These sensors acquire data while the object to be tested takes a full rotation. Further on, data augmentation is applied to prepare new data or enhance already acquired data. In order to evaluate the impact of a laser triangulation sensor for corrosion detection, one challenge is to at first fuse the data of both domains. After the data fusion process, 5 different channels can be utilized to create a 5D feature space. Besides the red, green and blue channels of the image (1-3), additional range data from the laser triangulation sensor is incorporated (4). As a fifth channel, said sensor provides additional intensity data (5). With a multi-channel image classification, a 5D feature space will lead to slightly superior results opposed to a 3D feature space, composed of only the RGB channels of the image. ",
    "url": "https://arxiv.org/abs/2205.07075",
    "authors": [
      "Dennis Haitz",
      "Boris Jutzi",
      "Patrick Huebner",
      "Markus Ulrich"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07092",
    "title": "Blind Goal-Oriented Massive Access for Future Wireless Networks",
    "abstract": "Emerging communication networks are envisioned to support massive wireless connectivity of heterogeneous devices with sporadic traffic and diverse requirements in terms of latency, reliability, and bandwidth. Providing multiple access to an increasing number of uncoordinated users and sharing the limited resources become essential in this context. In this work, we revisit the random access (RA) problem and exploit the continuous angular group sparsity feature of wireless channels to propose a novel RA strategy that provides low latency, high reliability, and massive access with limited bandwidth resources in an all-in-one package. To this end, we first design a reconstruction-free goal-oriented optimization problem, which only preserves the angular information required to identify the active devices. To solve this, we propose an alternating direction method of multipliers (ADMM) and derive closed-form expressions for each ADMM step. Then, we design a clustering algorithm that assigns the users in specific groups from which we can identify active stationary devices by their angles. For mobile devices, we propose an alternating minimization algorithm to recover their data and their channel gains simultaneously, which allows us to identify active mobile users. Simulation results show significant performance gains in terms of active user detection and false alarm probabilities as compared to state-of-the-art RA schemes, even with limited number of preambles. Moreover, unlike prior work, the performance of the proposed blind goal-oriented massive access does not depend on the number of devices. ",
    "url": "https://arxiv.org/abs/2205.07092",
    "authors": [
      "Sajad Daei",
      "Marios Kountouris"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.07096",
    "title": "Multi-modal curb detection and filtering",
    "abstract": "Reliable knowledge of road boundaries is critical for autonomous vehicle navigation. We propose a robust curb detection and filtering technique based on the fusion of camera semantics and dense lidar point clouds. The lidar point clouds are collected by fusing multiple lidars for robust feature detection. The camera semantics are based on a modified EfficientNet architecture which is trained with labeled data collected from onboard fisheye cameras. The point clouds are associated with the closest curb segment with $L_2$-norm analysis after projecting into the image space with the fisheye model projection. Next, the selected points are clustered using unsupervised density-based spatial clustering to detect different curb regions. As new curb points are detected in consecutive frames they are associated with the existing curb clusters using temporal reachability constraints. If no reachability constraints are found a new curb cluster is formed from these new points. This ensures we can detect multiple curbs present in road segments consisting of multiple lanes if they are in the sensors' field of view. Finally, Delaunay filtering is applied for outlier removal and its performance is compared to traditional RANSAC-based filtering. An objective evaluation of the proposed solution is done using a high-definition map containing ground truth curb points obtained from a commercial map supplier. The proposed system has proven capable of detecting curbs of any orientation in complex urban road scenarios comprising straight roads, curved roads, and intersections with traffic isles. ",
    "url": "https://arxiv.org/abs/2205.07096",
    "authors": [
      "Sandipan Das",
      "Navid Mahabadi",
      "Saikat Chatterjee",
      "Maurice Fallon"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2205.07108",
    "title": "Formalizing PQRST Complex in Accelerometer-based Gait Cycle for  Authentication",
    "abstract": "Accelerometer signals generated through gait present a new frontier of human interface with mobile devices. Gait cycle detection based on these signals has applications in various areas, including authentication, health monitoring, and activity detection. Template-based studies focus on how the entire gait cycle represents walking patterns, but these are compute-intensive. Aggregate feature-based studies extract features in the time domain and frequency domain from the entire gait cycle to reduce the number of features. However, these methods may miss critical structural information needed to appropriately represent the intricacies of walking patterns. To the best of our knowledge, no study has formally proposed a structure to capture variations within gait cycles or phases from accelerometer readings. We propose a new structure named the PQRST Complex, which corresponds to the swing phase in a gait cycle and matches the foot movements during this phase, thus capturing the changes in foot position. In our experiments, based on the nine features derived from this structure, the accelerometer-based gait authentication system outperforms many state-of-the-art gait cycle-based authentication systems. Our work opens up a new paradigm of capturing the structure of gait and opens multiple areas of research and practice using gait analogous to the \"QRS complex\" structure of ECG signals related to the heart. ",
    "url": "https://arxiv.org/abs/2205.07108",
    "authors": [
      "Frank Sicong Chen",
      "Amith K. Belman",
      "Vir V. Phoha"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.07109",
    "title": "Unsupervised Abnormal Traffic Detection through Topological Flow  Analysis",
    "abstract": "Cyberthreats are a permanent concern in our modern technological world. In the recent years, sophisticated traffic analysis techniques and anomaly detection (AD) algorithms have been employed to face the more and more subversive adversarial attacks. A malicious intrusion, defined as an invasive action intending to illegally exploit private resources, manifests through unusual data traffic and/or abnormal connectivity pattern. Despite the plethora of statistical or signature-based detectors currently provided in the literature, the topological connectivity component of a malicious flow is less exploited. Furthermore, a great proportion of the existing statistical intrusion detectors are based on supervised learning, that relies on labeled data. By viewing network flows as weighted directed interactions between a pair of nodes, in this paper we present a simple method that facilitate the use of connectivity graph features in unsupervised anomaly detection algorithms. We test our methodology on real network traffic datasets and observe several improvements over standard AD. ",
    "url": "https://arxiv.org/abs/2205.07109",
    "authors": [
      "Paul Irofti",
      "Andrei Pătraşcu",
      "Andrei Iulian Hîji"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.07121",
    "title": "Revisiting Facial Key Point Detection: An Efficient Approach Using Deep  Neural Networks",
    "abstract": "Facial landmark detection is a widely researched field of deep learning as this has a wide range of applications in many fields. These key points are distinguishing characteristic points on the face, such as the eyes center, the eye's inner and outer corners, the mouth center, and the nose tip from which human emotions and intent can be explained. The focus of our work has been evaluating transfer learning models such as MobileNetV2 and NasNetMobile, including custom CNN architectures. The objective of the research has been to develop efficient deep learning models in terms of model size, parameters, and inference time and to study the effect of augmentation imputation and fine-tuning on these models. It was found that while augmentation techniques produced lower RMSE scores than imputation techniques, they did not affect the inference time. MobileNetV2 architecture produced the lowest RMSE and inference time. Moreover, our results indicate that manually optimized CNN architectures performed similarly to Auto Keras tuned architecture. However, manually optimized architectures yielded better inference time and training curves. ",
    "url": "https://arxiv.org/abs/2205.07121",
    "authors": [
      "Prathima Dileep",
      "Bharath Kumar Bolla",
      "Sabeesh Ethiraj"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07124",
    "title": "Classification of Astronomical Bodies by Efficient Layer Fine-Tuning of  Deep Neural Networks",
    "abstract": "The SDSS-IV dataset contains information about various astronomical bodies such as Galaxies, Stars, and Quasars captured by observatories. Inspired by our work on deep multimodal learning, which utilized transfer learning to classify the SDSS-IV dataset, we further extended our research in the fine tuning of these architectures to study the effect in the classification scenario. Architectures such as Resnet-50, DenseNet-121 VGG-16, Xception, EfficientNetB2, MobileNetV2 and NasnetMobile have been built using layer wise fine tuning at different levels. Our findings suggest that freezing all layers with Imagenet weights and adding a final trainable layer may not be the optimal solution. Further, baseline models and models that have higher number of trainable layers performed similarly in certain architectures. Model need to be fine tuned at different levels and a specific training ratio is required for a model to be termed ideal. Different architectures had different responses to the change in the number of trainable layers w.r.t accuracies. While models such as DenseNet-121, Xception, EfficientNetB2 achieved peak accuracies that were relatively consistent with near perfect training curves, models such as Resnet-50,VGG-16, MobileNetV2 and NasnetMobile had lower, delayed peak accuracies with poorly fitting training curves. It was also found that though mobile neural networks have lesser parameters and model size, they may not always be ideal for deployment on a low computational device as they had consistently lower validation accuracies. Customized evaluation metrics such as Tuning Parameter Ratio and Tuning Layer Ratio are used for model evaluation. ",
    "url": "https://arxiv.org/abs/2205.07124",
    "authors": [
      "Sabeesh Ethiraj",
      "Bharath Kumar Bolla"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07126",
    "title": "LB-OPAR: Load Balanced Optimized Predictive and Adaptive Routing for  Cooperative UAV Networks",
    "abstract": "Cooperative ad-hoc UAV networks have been turning into the primary solution set for situations where establishing a communication infrastructure is not feasible. Search-and-rescue after a disaster and intelligence, surveillance, and reconnaissance (ISR) are two examples where the UAV nodes need to send their collected data cooperatively into a central decision maker unit. Recently proposed SDN-based solutions show incredible performance in managing different aspects of such networks. Alas, the routing problem for the highly dynamic UAV networks has not been addressed adequately. An optimal, reliable, and adaptive routing algorithm compatible with the SDN design and highly dynamic nature of such networks is required to improve the network performance. This paper proposes a load-balanced optimized predictive and adaptive routing (LB-OPAR), an SDN-based routing solution for cooperative UAV networks. LB-OPAR is the extension of our recently published routing algorithm (OPAR) that balances the network load and optimizes the network performance in terms of throughput, success rate, and flow completion time (FCT). We analytically model the routing problem in highly dynamic UAV network and propose a lightweight algorithmic solution to find the optimal solution with $O(|E|^2)$ time complexity where $|E|$ is the total number of network links. We exhaustively evaluate the proposed algorithm's performance using ns-3 network simulator. Results show that LB-OPAR outperforms the benchmark algorithms by $20\\%$ in FCT, by $30\\%$ in flow success rate on average, and up to $400\\%$ in throughput. ",
    "url": "https://arxiv.org/abs/2205.07126",
    "authors": [
      "Mohammed Gharib",
      "Fatemeh Afghah",
      "Elizabeth Serena Bentley"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Multiagent Systems (cs.MA)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2205.07129",
    "title": "Efficient lifting of symmetry breaking constraints for complex  combinatorial problems",
    "abstract": "Many industrial applications require finding solutions to challenging combinatorial problems. Efficient elimination of symmetric solution candidates is one of the key enablers for high-performance solving. However, existing model-based approaches for symmetry breaking are limited to problems for which a set of representative and easily-solvable instances is available, which is often not the case in practical applications. This work extends the learning framework and implementation of a model-based approach for Answer Set Programming to overcome these limitations and address challenging problems, such as the Partner Units Problem. In particular, we incorporate a new conflict analysis algorithm in the Inductive Logic Programming system ILASP, redefine the learning task, and suggest a new example generation method to scale up the approach. The experiments conducted for different kinds of Partner Units Problem instances demonstrate the applicability of our approach and the computational benefits due to the first-order constraints learned. ",
    "url": "https://arxiv.org/abs/2205.07129",
    "authors": [
      "Alice Tarzariol",
      "Martin Gebser",
      "Mark Law",
      "Konstantin Schekotihin"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2205.07131",
    "title": "Scientific Workflows in Heterogeneous Edge-Cloud Computing: A Data  Placement Strategy Based on Reinforcement learning",
    "abstract": "The heterogeneous edge-cloud computing paradigm can provide an optimal solution to deploy scientific workflows compared to cloud computing or other traditional distributed computing environments. Owing to the different sizes of scientific datasets and the privacy issue concerning some of these datasets, it is essential to find a data placement strategy that can minimize data transmission time. Some state-of-the-art data placement strategies combine edge computing and cloud computing to distribute scientific datasets. However, the dynamic distribution of newly generated datasets to appropriate datacenters and exiting the spent datasets are still a challenge during workflows execution. To address this challenge, this study not only constructs a data placement model that includes shared datasets within individual and among multiple workflows across various geographical regions, but also proposes a data placement strategy (DYM-RL-DPS) based on algorithms of two stages. First, during the build-time stage of workflows, we use the discrete particle swarm optimization algorithm with differential evolution to pre-allocate initial datasets to proper datacenters. Then, we reformulate the dynamic datasets distribution problem as a Markov decision process and provide a reinforcement learning-based approach to learn the optimal strategy in the runtime stage of scientific workflows. Through simulating heterogeneous edge-cloud computing environments, we designed comprehensive experiments to demonstrate the superiority of DYM-RL-DPS. The results of our strategy can effectively reduce the data transmission time as compared to other strategies. ",
    "url": "https://arxiv.org/abs/2205.07131",
    "authors": [
      "Xin Du"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2205.07134",
    "title": "ETAD: A Unified Framework for Efficient Temporal Action Detection",
    "abstract": "Untrimmed video understanding such as temporal action detection (TAD) often suffers from the pain of huge demand for computing resources. Because of long video durations and limited GPU memory, most action detectors can only operate on pre-extracted features rather than the original videos, and they still require a lot of computation to achieve high detection performance. To alleviate the heavy computation problem in TAD, in this work, we first propose an efficient action detector with detector proposal sampling, based on the observation that performance saturates at a small number of proposals. This detector is designed with several important techniques, such as LSTM-boosted temporal aggregation and cascaded proposal refinement to achieve high detection quality as well as low computational cost. To enable joint optimization of this action detector and the feature encoder, we also propose encoder gradient sampling, which selectively back-propagates through video snippets and tremendously reduces GPU memory consumption. With the two sampling strategies and the effective detector, we build a unified framework for efficient end-to-end temporal action detection (ETAD), making real-world untrimmed video understanding tractable. ETAD achieves state-of-the-art performance on both THUMOS-14 and ActivityNet-1.3. Interestingly, on ActivityNet-1.3, it reaches 37.78% average mAP, while only requiring 6 mins of training time and 1.23 GB memory based on pre-extracted features. With end-to-end training, it reduces the GPU memory footprint by more than 70% with even higher performance (38.21% average mAP), as compared with traditional end-to-end methods. The code is available at https://github.com/sming256/ETAD. ",
    "url": "https://arxiv.org/abs/2205.07134",
    "authors": [
      "Shuming Liu",
      "Mengmeng Xu",
      "Chen Zhao",
      "Xu Zhao",
      "Bernard Ghanem"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07154",
    "title": "Exploring Generalizability of Fine-Tuned Models for Fake News Detection",
    "abstract": "The Covid-19 pandemic has caused a dramatic and parallel rise in dangerous misinformation, denoted an `infodemic' by the CDC and WHO. Misinformation tied to the Covid-19 infodemic changes continuously; this can lead to performance degradation of fine-tuned models due to concept drift. Degredation can be mitigated if models generalize well-enough to capture some cyclical aspects of drifted data. In this paper, we explore generalizability of pre-trained and fine-tuned fake news detectors across 9 fake news datasets. We show that existing models often overfit on their training dataset and have poor performance on unseen data. However, on some subsets of unseen data that overlap with training data, models have higher accuracy. Based on this observation, we also present KMeans-Proxy, a fast and effective method based on K-Means clustering for quickly identifying these overlapping subsets of unseen data. KMeans-Proxy improves generalizability on unseen fake news datasets by 0.1-0.2 f1-points across datasets. We present both our generalizability experiments as well as KMeans-Proxy to further research in tackling the fake news problem. ",
    "url": "https://arxiv.org/abs/2205.07154",
    "authors": [
      "Abhijit Suprem",
      "Calton Pu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.07168",
    "title": "Proxyless Neural Architecture Adaptation for Supervised Learning and  Self-Supervised Learning",
    "abstract": "Recently, Neural Architecture Search (NAS) methods have been introduced and show impressive performance on many benchmarks. Among those NAS studies, Neural Architecture Transformer (NAT) aims to adapt the given neural architecture to improve performance while maintaining computational costs. However, NAT lacks reproducibility and it requires an additional architecture adaptation process before network weight training. In this paper, we propose proxyless neural architecture adaptation that is reproducible and efficient. Our method can be applied to both supervised learning and self-supervised learning. The proposed method shows stable performance on various architectures. Extensive reproducibility experiments on two datasets, i.e., CIFAR-10 and Tiny Imagenet, present that the proposed method definitely outperforms NAT and is applicable to other models and datasets. ",
    "url": "https://arxiv.org/abs/2205.07168",
    "authors": [
      "Do-Guk Kim",
      "Heung-Chang Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07172",
    "title": "Sparsity-Aware Robust Normalized Subband Adaptive Filtering algorithms  based on Alternating Optimization",
    "abstract": "This paper proposes a unified sparsity-aware robust normalized subband adaptive filtering (SA-RNSAF) algorithm for identification of sparse systems under impulsive noise. The proposed SA-RNSAF algorithm generalizes different algorithms by defining the robust criterion and sparsity-aware penalty. Furthermore, by alternating optimization of the parameters (AOP) of the algorithm, including the step-size and the sparsity penalty weight, we develop the AOP-SA-RNSAF algorithm, which not only exhibits fast convergence but also obtains low steady-state misadjustment for sparse systems. Simulations in various noise scenarios have verified that the proposed AOP-SA-RNSAF algorithm outperforms existing techniques. ",
    "url": "https://arxiv.org/abs/2205.07172",
    "authors": [
      "Yi Yu",
      "Zongxin Huang",
      "Hongsen He",
      "Yuriy Zakharov",
      "Rodrigo C. de Lamare"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.07177",
    "title": "Hero-Gang Neural Model For Named Entity Recognition",
    "abstract": "Named entity recognition (NER) is a fundamental and important task in NLP, aiming at identifying named entities (NEs) from free text. Recently, since the multi-head attention mechanism applied in the Transformer model can effectively capture longer contextual information, Transformer-based models have become the mainstream methods and have achieved significant performance in this task. Unfortunately, although these models can capture effective global context information, they are still limited in the local feature and position information extraction, which is critical in NER. In this paper, to address this limitation, we propose a novel Hero-Gang Neural structure (HGN), including the Hero and Gang module, to leverage both global and local information to promote NER. Specifically, the Hero module is composed of a Transformer-based encoder to maintain the advantage of the self-attention mechanism, and the Gang module utilizes a multi-window recurrent module to extract local features and position information under the guidance of the Hero module. Afterward, the proposed multi-window attention effectively combines global information and multiple local features for predicting entity labels. Experimental results on several benchmark datasets demonstrate the effectiveness of our proposed model. ",
    "url": "https://arxiv.org/abs/2205.07177",
    "authors": [
      "Jinpeng Hu",
      "Yaling Shen",
      "Yang Liu",
      "Xiang Wan",
      "Tsung-Hui Chang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.07179",
    "title": "Promoting Saliency From Depth: Deep Unsupervised RGB-D Saliency  Detection",
    "abstract": "Growing interests in RGB-D salient object detection (RGB-D SOD) have been witnessed in recent years, owing partly to the popularity of depth sensors and the rapid progress of deep learning techniques. Unfortunately, existing RGB-D SOD methods typically demand large quantity of training images being thoroughly annotated at pixel-level. The laborious and time-consuming manual annotation has become a real bottleneck in various practical scenarios. On the other hand, current unsupervised RGB-D SOD methods still heavily rely on handcrafted feature representations. This inspires us to propose in this paper a deep unsupervised RGB-D saliency detection approach, which requires no manual pixel-level annotation during training. It is realized by two key ingredients in our training pipeline. First, a depth-disentangled saliency update (DSU) framework is designed to automatically produce pseudo-labels with iterative follow-up refinements, which provides more trustworthy supervision signals for training the saliency network. Second, an attentive training strategy is introduced to tackle the issue of noisy pseudo-labels, by properly re-weighting to highlight the more reliable pseudo-labels. Extensive experiments demonstrate the superior efficiency and effectiveness of our approach in tackling the challenging unsupervised RGB-D SOD scenarios. Moreover, our approach can also be adapted to work in fully-supervised situation. Empirical studies show the incorporation of our approach gives rise to notably performance improvement in existing supervised RGB-D SOD models. ",
    "url": "https://arxiv.org/abs/2205.07179",
    "authors": [
      "Wei Ji",
      "Jingjing Li",
      "Qi Bi",
      "Chuan Guo",
      "Jie Liu",
      "Li Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07201",
    "title": "Real-centric Consistency Learning for Deepfake Detection",
    "abstract": "Most of previous deepfake detection researches bent their efforts to describe and discriminate artifacts in human perceptible ways, which leave a bias in the learned networks of ignoring some critical invariance features intra-class and underperforming the robustness of internet interference. Essentially, the target of deepfake detection problem is to represent natural faces and fake faces at the representation space discriminatively, and it reminds us whether we could optimize the feature extraction procedure at the representation space through constraining intra-class consistence and inter-class inconsistence to bring the intra-class representations close and push the inter-class representations apart? Therefore, inspired by contrastive representation learning, we tackle the deepfake detection problem through learning the invariant representations of both classes and propose a novel real-centric consistency learning method. We constraint the representation from both the sample level and the feature level. At the sample level, we take the procedure of deepfake synthesis into consideration and propose a novel forgery semantical-based pairing strategy to mine latent generation-related features. At the feature level, based on the centers of natural faces at the representation space, we design a hard positive mining and synthesizing method to simulate the potential marginal features. Besides, a hard negative fusion method is designed to improve the discrimination of negative marginal features with the help of supervised contrastive margin loss we developed. The effectiveness and robustness of the proposed method has been demonstrated through extensive experiments. ",
    "url": "https://arxiv.org/abs/2205.07201",
    "authors": [
      "Ruiqi Zha",
      "Zhichao Lian",
      "Qianmu Li",
      "Siqi Gu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07203",
    "title": "Fused Deep Neural Network based Transfer Learning in Occluded Face  Classification and Person re-Identification",
    "abstract": "Recent period of pandemic has brought person identification even with occluded face image a great importance with increased number of mask usage. This paper aims to recognize the occlusion of one of four types in face images. Various transfer learning methods were tested, and the results show that MobileNet V2 with Gated Recurrent Unit(GRU) performs better than any other Transfer Learning methods, with a perfect accuracy of 99% in classification of images as with or without occlusion and if with occlusion, then the type of occlusion. In parallel, identifying the Region of interest from the device captured image is done. This extracted Region of interest is utilised in face identification. Such a face identification process is done using the ResNet model with its Caffe implementation. To reduce the execution time, after the face occlusion type was recognized the person was searched to confirm their face image in the registered database. The face label of the person obtained from both simultaneous processes was verified for their matching score. If the matching score was above 90, the recognized label of the person was logged into a file with their name, type of mask, date, and time of recognition. MobileNetV2 is a lightweight framework which can also be used in embedded or IoT devices to perform real time detection and identification in suspicious areas of investigations using CCTV footages. When MobileNetV2 was combined with GRU, a reliable accuracy was obtained. The data provided in the paper belong to two categories, being either collected from Google Images for occlusion classification, face recognition, and facial landmarks, or collected in fieldwork. The motive behind this research is to identify and log person details which could serve surveillance activities in society-based e-governance. ",
    "url": "https://arxiv.org/abs/2205.07203",
    "authors": [
      "Mohamed Mohana",
      "Prasanalakshmi B",
      "Salem Alelyani",
      "Mohammed Saleh Alsaqer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07229",
    "title": "RoMFAC: A Robust Mean-Field Actor-Critic Reinforcement Learning against  Adversarial Perturbations on States",
    "abstract": "Deep reinforcement learning methods for multi-agent systems make optimal decisions dependent on states observed by agents, but a little uncertainty on the observations can possibly mislead agents into taking wrong actions. The mean-field actor-critic reinforcement learning (MFAC) is very famous in the multi-agent field since it can effectively handle the scalability problem. However, this paper finds that it is also sensitive to state perturbations which can significantly degrade the team rewards. This paper proposes a robust learning framework for MFAC called RoMFAC that has two innovations: 1) a new objective function of training actors, composed of a \\emph{policy gradient function} that is related to the expected cumulative discount reward on sampled clean states and an \\emph{action loss function} that represents the difference between actions taken on clean and adversarial states; and 2) a repetitive regularization of the action loss that ensures the trained actors obtain a good performance. Furthermore, we prove that the proposed action loss function is convergent. Experiments show that RoMFAC is robust against adversarial perturbations while maintaining its good performance in environments without perturbations. ",
    "url": "https://arxiv.org/abs/2205.07229",
    "authors": [
      "Ziyuan Zhou",
      "Guanjun Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.07231",
    "title": "On the Physical Layer Security of a Dual-Hop UAV-based Network in the  Presence of per-hop Eavesdropping and Imperfect CSI",
    "abstract": "In this paper, the physical layer security of a dual-hop unmanned aerial vehicle-based wireless network, subject to imperfect channel state information (CSI) and mobility effects, is analyzed. Specifically, a source node $(S)$ communicates with a destination node $(D)$ through a decode-and-forward relay $(R)$, in the presence of two wiretappers $\\left(E_{1},E_{2}\\right)$ independently trying to compromise the two hops. Furthermore, the transmit nodes $\\left(S,R\\right) $ have a single transmit antenna, while the receivers $\\left(R,D,E_{1},E_{2}\\right) $ are equipped with multiple receive antennas. Based on the per-hop signal-to-noise ratios (SNRs) and correlated secrecy capacities' statistics, a closed-form expression for the secrecy intercept probability (IP) metric is derived, in terms of key system parameters. Additionally, asymptotic expressions are revealed for two scenarios, namely (i) mobile nodes with imperfect CSI and (ii) static nodes with perfect CSI. The results show that a zero secrecy diversity order is manifested for the first scenario, due to the presence of a ceiling value of the average SNR, while the IP drops linearly at high average SNR in the second one, where the achievable diversity order depends on the fading parameters and number of antennas of the legitimate links/nodes. Furthermore, for static nodes, the system can be castigated by a $15$ dB secrecy loss at IP$=3\\times10^{-3},$ when the CSI imperfection power raises from $0$ to $10^{-3}$. Lastly, the higher the legitimate nodes' speed, carrier frequency, delay, and/or relay's decoding threshold SNR, the worse is the system's secrecy. Monte Carlo simulations endorse the derived analytical results. ",
    "url": "https://arxiv.org/abs/2205.07231",
    "authors": [
      "Elmehdi Illi",
      "Marwa K. Qaraqe",
      "F. El Bouanani",
      "Saif M. Al-Kuwari"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2205.07234",
    "title": "Clinical outcome prediction under hypothetical interventions -- a  representation learning framework for counterfactual reasoning",
    "abstract": "Most machine learning (ML) models are developed for prediction only; offering no option for causal interpretation of their predictions or parameters/properties. This can hamper the health systems' ability to employ ML models in clinical decision-making processes, where the need and desire for predicting outcomes under hypothetical investigations (i.e., counterfactual reasoning/explanation) is high. In this research, we introduce a new representation learning framework (i.e., partial concept bottleneck), which considers the provision of counterfactual explanations as an embedded property of the risk model. Despite architectural changes necessary for jointly optimising for prediction accuracy and counterfactual reasoning, the accuracy of our approach is comparable to prediction-only models. Our results suggest that our proposed framework has the potential to help researchers and clinicians improve personalised care (e.g., by investigating the hypothetical differential effects of interventions) ",
    "url": "https://arxiv.org/abs/2205.07234",
    "authors": [
      "Yikuan Li",
      "Mohammad Mamouei",
      "Shishir Rao",
      "Abdelaali Hassaine",
      "Dexter Canoy",
      "Thomas Lukasiewicz",
      "Kazem Rahimi",
      "Gholamreza Salimi-Khorshidi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.07260",
    "title": "Guidelines for the Regularization of Gammas in Batch Normalization for  Deep Residual Networks",
    "abstract": "L2 regularization for weights in neural networks is widely used as a standard training trick. However, L2 regularization for gamma, a trainable parameter of batch normalization, remains an undiscussed mystery and is applied in different ways depending on the library and practitioner. In this paper, we study whether L2 regularization for gamma is valid. To explore this issue, we consider two approaches: 1) variance control to make the residual network behave like identity mapping and 2) stable optimization through the improvement of effective learning rate. Through two analyses, we specify the desirable and undesirable gamma to apply L2 regularization and propose four guidelines for managing them. In several experiments, we observed the increase and decrease in performance caused by applying L2 regularization to gamma of four categories, which is consistent with our four guidelines. Our proposed guidelines were validated through various tasks and architectures, including variants of residual networks and transformers. ",
    "url": "https://arxiv.org/abs/2205.07260",
    "authors": [
      "Bum Jun Kim",
      "Hyeyeon Choi",
      "Hyeonah Jang",
      "Dong Gu Lee",
      "Wonseok Jeong",
      "Sang Woo Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07266",
    "title": "Discovering the Representation Bottleneck of Graph Neural Networks from  Multi-order Interactions",
    "abstract": "Most graph neural networks (GNNs) rely on the message passing paradigm to propagate node features and build interactions. Recent works point out that different graph learning tasks require different ranges of interactions between nodes. To investigate its underlying mechanism, we explore the capacity of GNNs to capture pairwise interactions between nodes under contexts with different complexities, especially for their graph-level and node-level applications in scientific domains like biochemistry and physics. When formulating pairwise interactions, we study two common graph construction methods in scientific domains, i.e., \\emph{K-nearest neighbor} (KNN) graphs and \\emph{fully-connected} (FC) graphs. Furthermore, we demonstrate that the inductive bias introduced by KNN-graphs and FC-graphs hinders GNNs to learn the most informative order of interactions. {Such a phenomenon is broadly shared by several GNNs for different graph learning tasks and forbids GNNs to achieve the global minimum loss, so we name it a \\emph{representation bottleneck}.} To overcome that, we propose a novel graph rewiring approach based on the pairwise interaction strengths to dynamically adjust the reception fields of each node. Extensive experiments in molecular property prediction and dynamic system forecast prove the superiority of our method over state-of-the-art GNN baselines. More importantly, this paper provides a reasonable explanation of why subgraphs play an important role in the determination of graph properties. ",
    "url": "https://arxiv.org/abs/2205.07266",
    "authors": [
      "Fang Wu",
      "Siyuan Li",
      "Lirong Wu",
      "Stan Z. Li",
      "Dragomir Radev",
      "Qiang Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.07283",
    "title": "Domain Adaptation in Multilingual and Multi-Domain Monolingual Settings  for Complex Word Identification",
    "abstract": "Complex word identification (CWI) is a cornerstone process towards proper text simplification. CWI is highly dependent on context, whereas its difficulty is augmented by the scarcity of available datasets which vary greatly in terms of domains and languages. As such, it becomes increasingly more difficult to develop a robust model that generalizes across a wide array of input examples. In this paper, we propose a novel training technique for the CWI task based on domain adaptation to improve the target character and context representations. This technique addresses the problem of working with multiple domains, inasmuch as it creates a way of smoothing the differences between the explored datasets. Moreover, we also propose a similar auxiliary task, namely text simplification, that can be used to complement lexical complexity prediction. Our model obtains a boost of up to 2.42% in terms of Pearson Correlation Coefficients in contrast to vanilla training techniques, when considering the CompLex from the Lexical Complexity Prediction 2021 dataset. At the same time, we obtain an increase of 3% in Pearson scores, while considering a cross-lingual setup relying on the Complex Word Identification 2018 dataset. In addition, our model yields state-of-the-art results in terms of Mean Absolute Error. ",
    "url": "https://arxiv.org/abs/2205.07283",
    "authors": [
      "George-Eduard Zaharia",
      "Răzvan-Alexandru Smădu",
      "Dumitru-Clementin Cercel",
      "Mihai Dascalu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.07290",
    "title": "Meta Self-Refinement for Robust Learning with Weak Supervision",
    "abstract": "Training deep neural networks (DNNs) with weak supervision has been a hot topic as it can significantly reduce the annotation cost. However, labels from weak supervision can be rather noisy and the high capacity of DNNs makes them easy to overfit the noisy labels. Recent methods leverage self-training techniques to train noise-robust models, where a teacher trained on noisy labels is used to teach a student. However, the teacher from such models might fit a substantial amount of noise and produce wrong pseudo-labels with high confidence, leading to error propagation. In this work, we propose Meta Self-Refinement (MSR), a noise-resistant learning framework, to effectively combat noisy labels from weak supervision sources. Instead of purely relying on a fixed teacher trained on noisy labels, we keep updating the teacher to refine its pseudo-labels. At each training step, it performs a meta gradient descent on the current mini-batch to maximize the student performance on a clean validation set. Extensive experimentation on eight NLP benchmarks demonstrates that MSR is robust against noise in all settings and outperforms the state-of-the-art up to 11.4% in accuracy and 9.26% in F1 score. ",
    "url": "https://arxiv.org/abs/2205.07290",
    "authors": [
      "Dawei Zhu",
      "Xiaoyu Shen",
      "Michael A. Hedderich",
      "Dietrich Klakow"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.07295",
    "title": "Posterior Probability Matters: Doubly-Adaptive Calibration for Neural  Predictions in Online Advertising",
    "abstract": "Predicting user response probabilities is vital for ad ranking and bidding. We hope that predictive models can produce accurate probabilistic predictions that reflect true likelihoods. Calibration techniques aims to post-process model predictions to posterior probabilities. Field-level calibration -- which performs calibration w.r.t. to a specific field value -- is fine-grained and more practical. In this paper we propose a doubly-adaptive approach AdaCalib. It learns an isotonic function family to calibrate model predictions with the guidance of posterior statistics, and field-adaptive mechanisms are designed to ensure that the posterior is appropriate for the field value to be calibrated. Experiments verify that AdaCalib achieves significant improvement on calibration performance. It has been deployed online and beats previous approach. ",
    "url": "https://arxiv.org/abs/2205.07295",
    "authors": [
      "Penghui Wei",
      "Weimin Zhang",
      "Ruijie Hou",
      "Jinquan Liu",
      "Shaoguo Liu",
      "Liang Wang",
      "Bo Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2205.07308",
    "title": "Finding Global Homophily in Graph Neural Networks When Meeting  Heterophily",
    "abstract": "We investigate graph neural networks on graphs with heterophily. Some existing methods amplify a node's neighborhood with multi-hop neighbors to include more nodes with homophily. However, it is a significant challenge to set personalized neighborhood sizes for different nodes. Further, for other homophilous nodes excluded in the neighborhood, they are ignored for information aggregation. To address these problems, we propose two models GloGNN and GloGNN++, which generate a node's embedding by aggregating information from global nodes in the graph. In each layer, both models learn a coefficient matrix to capture the correlations between nodes, based on which neighborhood aggregation is performed. The coefficient matrix allows signed values and is derived from an optimization problem that has a closed-form solution. We further accelerate neighborhood aggregation and derive a linear time complexity. We theoretically explain the models' effectiveness by proving that both the coefficient matrix and the generated node embedding matrix have the desired grouping effect. We conduct extensive experiments to compare our models against 11 other competitors on 15 benchmark datasets in a wide range of domains, scales and graph heterophilies. Experimental results show that our methods achieve superior performance and are also very efficient. ",
    "url": "https://arxiv.org/abs/2205.07308",
    "authors": [
      "Xiang Li",
      "Renyu Zhu",
      "Yao Cheng",
      "Caihua Shan",
      "Siqiang Luo",
      "Dongsheng Li",
      "Weining Qian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.07310",
    "title": "Uncertainty estimation for Cross-dataset performance in Trajectory  prediction",
    "abstract": "While a lot of work has been done on developing trajectory prediction methods, and various datasets have been proposed for benchmarking this task, little study has been done so far on the generalizability and the transferability of these methods across dataset. In this paper, we study the performance of a state-of-the-art trajectory prediction method across four different datasets (Argoverse, NuScenes, Interaction, Shifts). We first check how a similar method can be applied and trained on all these datasets with similar hyperparameters. Then we highlight which datasets work best on others, and study how uncertainty estimation allows for a better transferable performance; proposing a novel way to estimate uncertainty and to directly use it in prediction. ",
    "url": "https://arxiv.org/abs/2205.07310",
    "authors": [
      "Thomas Gilles",
      "Stefano Sabatini",
      "Dzmitry Tsishkou",
      "Bogdan Stanciulescu",
      "Fabien Moutarde"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07311",
    "title": "COIN: Communication-Aware In-Memory Acceleration for Graph Convolutional  Networks",
    "abstract": "Graph convolutional networks (GCNs) have shown remarkable learning capabilities when processing graph-structured data found inherently in many application areas. GCNs distribute the outputs of neural networks embedded in each vertex over multiple iterations to take advantage of the relations captured by the underlying graphs. Consequently, they incur a significant amount of computation and irregular communication overheads, which call for GCN-specific hardware accelerators. To this end, this paper presents a communication-aware in-memory computing architecture (COIN) for GCN hardware acceleration. Besides accelerating the computation using custom compute elements (CE) and in-memory computing, COIN aims at minimizing the intra- and inter-CE communication in GCN operations to optimize the performance and energy efficiency. Experimental evaluations with widely used datasets show up to 105x improvement in energy consumption compared to state-of-the-art GCN accelerator. ",
    "url": "https://arxiv.org/abs/2205.07311",
    "authors": [
      "Sumit K. Mandal",
      "Gokul Krishnan",
      "A. Alper Goksoy",
      "Gopikrishnan Ravindran Nair",
      "Yu Cao",
      "Umit Y. Ogras"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07323",
    "title": "Attack vs Benign Network Intrusion Traffic Classification",
    "abstract": "Intrusion detection systems (IDS) are used to monitor networks or systems for attack activity or policy violations. Such a system should be able to successfully identify anomalous deviations from normal traffic behavior. Here we discuss the machine learning approach to building an anomaly-based IDS using the CSE-CIC-IDS2018 dataset. Since the publication of this dataset a relatively large number of papers have been published, most of them presenting IDS architectures and results based on complex machine learning methods, like deep neural networks, gradient boosting classifiers, or hidden Markov models. Here we show that similar results can be obtained using a very simple nearest neighbor classification approach, avoiding the inherent complications of training such complex models. The advantages of the nearest neighbor algorithm are: (1) it is very simple to implement; (2) it is extremely robust; (3) it has no parameters, and therefore it cannot overfit the data. This result also shows that currently there is a trend of developing over-engineered solutions in the machine learning community. Such solutions are based on complex methods, like deep learning neural networks, without even considering baseline solutions corresponding to simple, but efficient methods. ",
    "url": "https://arxiv.org/abs/2205.07323",
    "authors": [
      "M. Andrecut"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.07337",
    "title": "Output-Feedback Path Planning with Robustness to State-Dependent Errors",
    "abstract": "We consider the problem of sample-based feedback motion planning from measurements affected by systematic errors. Our previous work presented output feedback controllers that use measurements from landmarks in the environment to navigate through a cell-decomposable environment using duality, Control Lyapunov and Barrier Functions (CLF, CBF), and Linear Programming. In this paper, we build on this previous work with a novel strategy that allows the use of measurements affected by systematic errors in perceived depth (similarly to what might be generated by vision-based sensors), as opposed to accurate displacement measurements. As a result, our new method has the advantage of providing more robust performance (with quantitative guarantees) when inaccurate sensors are used. We test the proposed algorithm in the simulation to evaluate the performance limits of our approach predicted by our theoretical derivations. ",
    "url": "https://arxiv.org/abs/2205.07337",
    "authors": [
      "Mahroo Bahreinian",
      "Roberto Tron"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2205.07344",
    "title": "Policy Gradient Method For Robust Reinforcement Learning",
    "abstract": "This paper develops the first policy gradient method with global optimality guarantee and complexity analysis for robust reinforcement learning under model mismatch. Robust reinforcement learning is to learn a policy robust to model mismatch between simulator and real environment. We first develop the robust policy (sub-)gradient, which is applicable for any differentiable parametric policy class. We show that the proposed robust policy gradient method converges to the global optimum asymptotically under direct policy parameterization. We further develop a smoothed robust policy gradient method and show that to achieve an $\\epsilon$-global optimum, the complexity is $\\mathcal O(\\epsilon^{-3})$. We then extend our methodology to the general model-free setting and design the robust actor-critic method with differentiable parametric policy class and value function. We further characterize its asymptotic convergence and sample complexity under the tabular setting. Finally, we provide simulation results to demonstrate the robustness of our methods. ",
    "url": "https://arxiv.org/abs/2205.07344",
    "authors": [
      "Yue Wang",
      "Shaofeng Zou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07348",
    "title": "Novel Multicolumn Kernel Extreme Learning Machine for Food Detection via  Optimal Features from CNN",
    "abstract": "Automatic food detection is an emerging topic of interest due to its wide array of applications ranging from detecting food images on social media platforms to filtering non-food photos from the users in dietary assessment apps. Recently, during the COVID-19 pandemic, it has facilitated enforcing an eating ban by automatically detecting eating activities from cameras in public places. Therefore, to tackle the challenge of recognizing food images with high accuracy, we proposed the idea of a hybrid framework for extracting and selecting optimal features from an efficient neural network. There on, a nonlinear classifier is employed to discriminate between linearly inseparable feature vectors with great precision. In line with this idea, our method extracts features from MobileNetV3, selects an optimal subset of attributes by using Shapley Additive exPlanations (SHAP) values, and exploits kernel extreme learning machine (KELM) due to its nonlinear decision boundary and good generalization ability. However, KELM suffers from the 'curse of dimensionality problem' for large datasets due to the complex computation of kernel matrix with large numbers of hidden nodes. We solved this problem by proposing a novel multicolumn kernel extreme learning machine (MCKELM) which exploited the k-d tree algorithm to divide data into N subsets and trains separate KELM on each subset of data. Then, the method incorporates KELM classifiers into parallel structures and selects the top k nearest subsets during testing by using the k-d tree search for classifying input instead of the whole network. For evaluating a proposed framework large food/non-food dataset is prepared using nine publically available datasets. Experimental results showed the superiority of our method on an integrated set of measures while solving the problem of 'curse of dimensionality in KELM for large datasets. ",
    "url": "https://arxiv.org/abs/2205.07348",
    "authors": [
      "Ghalib Ahmed",
      "Tahir Chu",
      "Kiong Loo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2205.07362",
    "title": "What is an equivariant neural network?",
    "abstract": "We explain equivariant neural networks, a notion underlying breakthroughs in machine learning from deep convolutional neural networks for computer vision to AlphaFold 2 for protein structure prediction, without assuming knowledge of equivariance or neural networks. The basic mathematical ideas are simple but are often obscured by engineering complications that come with practical realizations. We extract and focus on the mathematical aspects, and limit ourselves to a cursory treatment of the engineering issues at the end. ",
    "url": "https://arxiv.org/abs/2205.07362",
    "authors": [
      "Lek-Heng Lim",
      "Bradley J. Nelson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Representation Theory (math.RT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.07369",
    "title": "Understanding Emergent Behaviours in Multi-Agent Systems with  Evolutionary Game Theory",
    "abstract": "The mechanisms of emergence and evolution of collective behaviours in dynamical Multi-Agent Systems (MAS) of multiple interacting agents, with diverse behavioral strategies in co-presence, have been undergoing mathematical study via Evolutionary Game Theory (EGT). Their systematic study also resorts to agent-based modelling and simulation (ABM) techniques, thus enabling the study of aforesaid mechanisms under a variety of conditions, parameters, and alternative virtual games. This paper summarises some main research directions and challenges tackled in our group, using methods from EGT and ABM. These range from the introduction of cognitive and emotional mechanisms into agents' implementation in an evolving MAS, to the cost-efficient interference for promoting prosocial behaviours in complex networks, to the regulation and governance of AI safety development ecology, and to the equilibrium analysis of random evolutionary multi-player games. This brief aims to sensitize the reader to EGT based issues, results and prospects, which are accruing in importance for the modeling of minds with machines and the engineering of prosocial behaviours in dynamical MAS, with impact on our understanding of the emergence and stability of collective behaviours. In all cases, important open problems in MAS research as viewed or prioritised by the group are described. ",
    "url": "https://arxiv.org/abs/2205.07369",
    "authors": [
      "Anh Han"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Multiagent Systems (cs.MA)",
      "Dynamical Systems (math.DS)",
      "Adaptation and Self-Organizing Systems (nlin.AO)"
    ]
  },
  {
    "id": "arXiv:2205.07384",
    "title": "Incorporating Prior Knowledge into Neural Networks through an Implicit  Composite Kernel",
    "abstract": "It is challenging to guide neural network (NN) learning with prior knowledge. In contrast, many known properties, such as spatial smoothness or seasonality, are straightforward to model by choosing an appropriate kernel in a Gaussian process (GP). Many deep learning applications could be enhanced by modeling such known properties. For example, convolutional neural networks (CNNs) are frequently used in remote sensing, which is subject to strong seasonal effects. We propose to blend the strengths of deep learning and the clear modeling capabilities of GPs by using a composite kernel that combines a kernel implicitly defined by a neural network with a second kernel function chosen to model known properties (e.g., seasonality). Then, we approximate the resultant GP by combining a deep network and an efficient mapping based on the Nystrom approximation, which we call Implicit Composite Kernel (ICK). ICK is flexible and can be used to include prior information in neural networks in many applications. We demonstrate the strength of our framework by showing its superior performance and flexibility on both synthetic and real-world data sets. The code is available at: https://anonymous.4open.science/r/ICK_NNGP-17C5/. ",
    "url": "https://arxiv.org/abs/2205.07384",
    "authors": [
      "Ziyang Jiang",
      "Tongshu Zheng",
      "David Carlson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.07403",
    "title": "PillarNet: High-Performance Pillar-based 3D Object Detection",
    "abstract": "Real-time and high-performance 3D object detection is of critical importance for autonomous driving. Recent top-performing 3D object detectors mainly rely on point-based or 3D voxel-based convolutions, which are both computationally inefficient for onboard deployment. In contrast, pillar-based methods use merely 2D convolutions, which consume less computation resources, but they lag far behind their voxel-based counterparts in detection accuracy. In this paper, by examining the primary performance gap between pillar- and voxel-based detectors, we develop a real-time and high-performance pillar-based detector, dubbed PillarNet. The proposed PillarNet consists of a powerful encoder network for effective pillar feature learning, a neck network for spatial-semantic feature fusion and the commonly used detect head. Using only 2D convolutions, PillarNet is flexible to an optional pillar size and compatible with classical 2D CNN backbones, such as VGGNet and ResNet. Additionally, PillarNet benefits from an orientation-decoupled IoU regression loss along with the IoU-aware prediction branch. Extensive experimental results on the large-scale nuScenes Dataset and Waymo Open Dataset demonstrate that the proposed PillarNet performs well over the state-of-the-art 3D detectors in terms of effectiveness and efficiency. ",
    "url": "https://arxiv.org/abs/2205.07403",
    "authors": [
      "Guangsheng Shi",
      "Ruifeng Li",
      "Chao Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07404",
    "title": "A New Outlier Removal Strategy Based on Reliability of Correspondence  Graph for Fast Point Cloud Registration",
    "abstract": "Registration is a basic yet crucial task in point cloud processing. In correspondence-based point cloud registration, matching correspondences by point feature techniques may lead to an extremely high outlier ratio. Current methods still suffer from low efficiency, accuracy, and recall rate. We use a simple and intuitive method to describe the 6-DOF (degree of freedom) curtailment process in point cloud registration and propose an outlier removal strategy based on the reliability of the correspondence graph. The method constructs the corresponding graph according to the given correspondences and designs the concept of the reliability degree of the graph node for optimal candidate selection and the reliability degree of the graph edge to obtain the global maximum consensus set. The presented method could achieve fast and accurate outliers removal along with gradual aligning parameters estimation. Extensive experiments on simulations and challenging real-world datasets demonstrate that the proposed method can still perform effective point cloud registration even the correspondence outlier ratio is over 99%, and the efficiency is better than the state-of-the-art. Code is available at https://github.com/WPC-WHU/GROR. ",
    "url": "https://arxiv.org/abs/2205.07404",
    "authors": [
      "Li Yan",
      "Pengcheng Wei",
      "Hong Xie",
      "Jicheng Dai",
      "Hao Wu",
      "Ming Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07408",
    "title": "Training neural networks using Metropolis Monte Carlo and an adaptive  variant",
    "abstract": "We examine the zero-temperature Metropolis Monte Carlo algorithm as a tool for training a neural network by minimizing a loss function. We find that, as expected on theoretical grounds and shown empirically by other authors, Metropolis Monte Carlo can train a neural net with an accuracy comparable to that of gradient descent, if not necessarily as quickly. The Metropolis algorithm does not fail automatically when the number of parameters of a neural network is large. It can fail when a neural network's structure or neuron activations are strongly heterogenous, and we introduce an adaptive Monte Carlo algorithm, aMC, to overcome these limitations. The intrinsic stochasticity of the Monte Carlo method allows aMC to train neural networks in which the gradient is too small to allow training by gradient descent. We suggest that, as for molecular simulation, Monte Carlo methods offer a complement to gradient-based methods for training neural networks, allowing access to a distinct set of network architectures and principles. ",
    "url": "https://arxiv.org/abs/2205.07408",
    "authors": [
      "Stephen Whitelam",
      "Viktor Selin",
      "Ian Benlolo",
      "Isaac Tamblyn"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2205.07411",
    "title": "Phishing Detection Leveraging Machine Learning and Deep Learning: A  Review",
    "abstract": "Phishing attacks trick victims into disclosing sensitive information. To counter rapidly evolving attacks, we must explore machine learning and deep learning models leveraging large-scale data. We discuss models built on different kinds of data, along with their advantages and disadvantages, and present multiple deployment options to detect phishing attacks. ",
    "url": "https://arxiv.org/abs/2205.07411",
    "authors": [
      "Dinil Mon Divakaran",
      "Adam Oest"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.07422",
    "title": "PrEF: Percolation-based Evolutionary Framework for the  diffusion-source-localization problem in large networks",
    "abstract": "We assume that the state of a number of nodes in a network could be investigated if necessary, and study what configuration of those nodes could facilitate a better solution for the diffusion-source-localization (DSL) problem. In particular, we formulate a candidate set which contains the diffusion source for sure, and propose the method, Percolation-based Evolutionary Framework (PrEF), to minimize such set. Hence one could further conduct more intensive investigation on only a few nodes to target the source. To achieve that, we first demonstrate that there are some similarities between the DSL problem and the network immunization problem. We find that the minimization of the candidate set is equivalent to the minimization of the order parameter if we view the observer set as the removal node set. Hence, PrEF is developed based on the network percolation and evolutionary algorithm. The effectiveness of the proposed method is validated on both model and empirical networks in regard to varied circumstances. Our results show that the developed approach could achieve a much smaller candidate set compared to the state of the art in almost all cases. Meanwhile, our approach is also more stable, i.e., it has similar performance irrespective of varied infection probabilities, diffusion models, and outbreak ranges. More importantly, our approach might provide a new framework to tackle the DSL problem in extreme large networks. ",
    "url": "https://arxiv.org/abs/2205.07422",
    "authors": [
      "Yang Liu",
      "Xiaoqi Chen",
      "Xi Wang",
      "Zhen Wang",
      "Jürgen Kurths"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2205.07424",
    "title": "Trustworthy Graph Neural Networks: Aspects, Methods and Trends",
    "abstract": "Graph neural networks (GNNs) have emerged as a series of competent graph learning methods for diverse real-world scenarios, ranging from daily applications like recommendation systems and question answering to cutting-edge technologies such as drug discovery in life sciences and n-body simulation in astrophysics. However, task performance is not the only requirement for GNNs. Performance-oriented GNNs have exhibited potential adverse effects like vulnerability to adversarial attacks, unexplainable discrimination against disadvantaged groups, or excessive resource consumption in edge computing environments. To avoid these unintentional harms, it is necessary to build competent GNNs characterised by trustworthiness. To this end, we propose a comprehensive roadmap to build trustworthy GNNs from the view of the various computing technologies involved. In this survey, we introduce basic concepts and comprehensively summarise existing efforts for trustworthy GNNs from six aspects, including robustness, explainability, privacy, fairness, accountability, and environmental well-being. Additionally, we highlight the intricate cross-aspect relations between the above six aspects of trustworthy GNNs. Finally, we present a thorough overview of trending directions for facilitating the research and industrialisation of trustworthy GNNs. ",
    "url": "https://arxiv.org/abs/2205.07424",
    "authors": [
      "He Zhang",
      "Bang Wu",
      "Xingliang Yuan",
      "Shirui Pan",
      "Hanghang Tong",
      "Jian Pei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.07430",
    "title": "Optimizing the optimizer for data driven deep neural networks and  physics informed neural networks",
    "abstract": "We investigate the role of the optimizer in determining the quality of the model fit for neural networks with a small to medium number of parameters. We study the performance of Adam, an algorithm for first-order gradient-based optimization that uses adaptive momentum, the Levenberg and Marquardt (LM) algorithm a second order method, Broyden,Fletcher,Goldfarb and Shanno algorithm (BFGS) a second order method and LBFGS, a low memory version of BFGS. Using these optimizers we fit the function y = sinc(10x) using a neural network with a few parameters. This function has a variable amplitude and a constant frequency. We observe that the higher amplitude components of the function are fitted first and the Adam, BFGS and LBFGS struggle to fit the lower amplitude components of the function. We also solve the Burgers equation using a physics informed neural network(PINN) with the BFGS and LM optimizers. For our example problems with a small to medium number of weights, we find that the LM algorithm is able to rapidly converge to machine precision offering significant benefits over other optimizers. We further investigated the Adam optimizer with a range of models and found that Adam optimiser requires much deeper models with large numbers of hidden units containing up to 26x more parameters, in order to achieve a model fit close that achieved by the LM optimizer. The LM optimizer results illustrate that it may be possible build models with far fewer parameters. We have implemented all our methods in Keras and TensorFlow 2. ",
    "url": "https://arxiv.org/abs/2205.07430",
    "authors": [
      "John Taylor",
      "Wenyi Wang",
      "Biswajit Bala",
      "Tomasz Bednarz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07439",
    "title": "ReDFeat: Recoupling Detection and Description for Multimodal Feature  Learning",
    "abstract": "Deep-learning-based local feature extraction algorithms that combine detection and description have made significant progress in visible image matching. However, the end-to-end training of such frameworks is notoriously unstable due to the lack of strong supervision of detection and the inappropriate coupling between detection and description. The problem is magnified in cross-modal scenarios, in which most methods heavily rely on the pre-training. In this paper, we recouple independent constraints of detection and description of multimodal feature learning with a mutual weighting strategy, in which the detected probabilities of robust features are forced to peak and repeat, while features with high detection scores are emphasized during optimization. Different from previous works, those weights are detached from back propagation so that the detected probability of indistinct features would not be directly suppressed and the training would be more stable. Moreover, we propose the Super Detector, a detector that possesses a large receptive field and is equipped with learnable non-maximum suppression layers, to fulfill the harsh terms of detection. Finally, we build a benchmark that contains cross visible, infrared, near-infrared and synthetic aperture radar image pairs for evaluating the performance of features in feature matching and image registration tasks. Extensive experiments demonstrate that features trained with the recoulped detection and description, named ReDFeat, surpass previous state-of-the-arts in the benchmark, while the model can be readily trained from scratch. ",
    "url": "https://arxiv.org/abs/2205.07439",
    "authors": [
      "Yuxin Deng",
      "Jiayi Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.07443",
    "title": "Behaviour Explanation via Causal Analysis of Mental States: A  Preliminary Report",
    "abstract": "Inspired by a novel action-theoretic formalization of actual cause, Khan and Lesp\\'erance (2021) recently proposed a first account of causal knowledge that supports epistemic effects, models causal knowledge dynamics, and allows sensing actions to be causes of observed effects. To date, no other study has looked specifically at these issues. But their formalization is not sufficiently expressive enough to model explanations via causal analysis of mental states as it ignores a crucial aspect of theory of mind, namely motivations. In this paper, we build on their work to support causal reasoning about conative effects. In our framework, one can reason about causes of motivational states, and we allow motivation-altering actions to be causes of observed effects. We illustrate that this formalization along with a model of goal recognition can be utilized to explain agent behaviour in communicative multiagent contexts. ",
    "url": "https://arxiv.org/abs/2205.07443",
    "authors": [
      "Shakil M. Khan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Logic in Computer Science (cs.LO)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2205.07448",
    "title": "A Stochastic Hybrid Systems Approach to the Joint Distribution of Ages  of Information in Networks",
    "abstract": "We study a general setting of status updating systems in which a set of source nodes provide status updates about some physical process(es) to a set of destination nodes (or monitors). The freshness of information available at each monitor is quantified in terms of the Age of Information (AoI), and the vector of AoI processes at the monitors (or equivalently the age vector) models the continuous state of the system. While the marginal distributional properties of each AoI process have been studied for a variety of settings using the stochastic hybrid system (SHS) approach, we lack a counterpart of this approach to systematically study their joint distributional properties. Developing such a framework is the main contribution of this paper. In particular, we model the discrete state of the system as a finite-state continuous-time Markov chain, and describe the coupled evolution of the system's continuous and discrete states by a piecewise linear SHS with linear reset maps. We start our analysis by deriving first-order linear differential equations for the temporal evolution of both the joint moments and the joint moment generating function (MGF) of all possible pairwise combinations formed by the age vector components. We then derive the conditions under which the derived differential equations are asymptotically stable. Finally, we apply our framework to characterize the stationary joint MGF in a multi-source updating system under several queueing disciplines including non-preemptive and source-agnostic/source-aware preemptive in service queueing disciplines. ",
    "url": "https://arxiv.org/abs/2205.07448",
    "authors": [
      "Mohamed A. Abd-Elmagid",
      "Harpreet S. Dhillon"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2205.07450",
    "title": "PRISM: Pre-trained Indeterminate Speaker Representation Model for  Speaker Diarization and Speaker Verification",
    "abstract": "Speaker embedding has been a fundamental feature for speaker-related tasks such as verification, clustering, and diarization. Traditionally, speaker embeddings are represented as fixed vectors in high-dimensional space. This could lead to biased estimations, especially when handling shorter utterances. In this paper we propose to represent a speaker utterance as \"floating\" vector whose state is indeterminate without knowing the context. The state of a speaker representation is jointly determined by itself, other speech from the same speaker, as well as other speakers it is being compared to. The content of the speech also contributes to determining the final state of a speaker representation. We pre-train an indeterminate speaker representation model that estimates the state of an utterance based on the context. The pre-trained model can be fine-tuned for downstream tasks such as speaker verification, speaker clustering, and speaker diarization. Substantial improvements are observed across all downstream tasks. ",
    "url": "https://arxiv.org/abs/2205.07450",
    "authors": [
      "Siqi Zheng",
      "Hongbin Suo",
      "Qian Chen"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2205.07460",
    "title": "Diffusion Models for Adversarial Purification",
    "abstract": "Adversarial purification refers to a class of defense methods that remove adversarial perturbations using a generative model. These methods do not make assumptions on the form of attack and the classification model, and thus can defend pre-existing classifiers against unseen threats. However, their performance currently falls behind adversarial training methods. In this work, we propose DiffPure that uses diffusion models for adversarial purification: Given an adversarial example, we first diffuse it with a small amount of noise following a forward diffusion process, and then recover the clean image through a reverse generative process. To evaluate our method against strong adaptive attacks in an efficient and scalable way, we propose to use the adjoint method to compute full gradients of the reverse generative process. Extensive experiments on three image datasets including CIFAR-10, ImageNet and CelebA-HQ with three classifier architectures including ResNet, WideResNet and ViT demonstrate that our method achieves the state-of-the-art results, outperforming current adversarial training and adversarial purification methods, often by a large margin. Project page: https://diffpure.github.io. ",
    "url": "https://arxiv.org/abs/2205.07460",
    "authors": [
      "Weili Nie",
      "Brandon Guo",
      "Yujia Huang",
      "Chaowei Xiao",
      "Arash Vahdat",
      "Anima Anandkumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07463",
    "title": "Gradient Descent Optimizes Infinite-Depth ReLU Implicit Networks with  Linear Widths",
    "abstract": "Implicit deep learning has recently become popular in the machine learning community since these implicit models can achieve competitive performance with state-of-the-art deep networks while using significantly less memory and computational resources. However, our theoretical understanding of when and how first-order methods such as gradient descent (GD) converge on \\textit{nonlinear} implicit networks is limited. Although this type of problem has been studied in standard feed-forward networks, the case of implicit models is still intriguing because implicit networks have \\textit{infinitely} many layers. The corresponding equilibrium equation probably admits no or multiple solutions during training. This paper studies the convergence of both gradient flow (GF) and gradient descent for nonlinear ReLU activated implicit networks. To deal with the well-posedness problem, we introduce a fixed scalar to scale the weight matrix of the implicit layer and show that there exists a small enough scaling constant, keeping the equilibrium equation well-posed throughout training. As a result, we prove that both GF and GD converge to a global minimum at a linear rate if the width $m$ of the implicit network is \\textit{linear} in the sample size $N$, i.e., $m=\\Omega(N)$. ",
    "url": "https://arxiv.org/abs/2205.07463",
    "authors": [
      "Tianxiang Gao",
      "Hongyang Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.07466",
    "title": "Robust Representation via Dynamic Feature Aggregation",
    "abstract": "Deep convolutional neural network (CNN) based models are vulnerable to the adversarial attacks. One of the possible reasons is that the embedding space of CNN based model is sparse, resulting in a large space for the generation of adversarial samples. In this study, we propose a method, denoted as Dynamic Feature Aggregation, to compress the embedding space with a novel regularization. Particularly, the convex combination between two samples are regarded as the pivot for aggregation. In the embedding space, the selected samples are guided to be similar to the representation of the pivot. On the other side, to mitigate the trivial solution of such regularization, the last fully-connected layer of the model is replaced by an orthogonal classifier, in which the embedding codes for different classes are processed orthogonally and separately. With the regularization and orthogonal classifier, a more compact embedding space can be obtained, which accordingly improves the model robustness against adversarial attacks. An averaging accuracy of 56.91% is achieved by our method on CIFAR-10 against various attack methods, which significantly surpasses a solid baseline (Mixup) by a margin of 37.31%. More surprisingly, empirical results show that, the proposed method can also achieve the state-of-the-art performance for out-of-distribution (OOD) detection, due to the learned compact feature space. An F1 score of 0.937 is achieved by the proposed method, when adopting CIFAR-10 as in-distribution (ID) dataset and LSUN as OOD dataset. Code is available at https://github.com/HaozheLiu-ST/DynamicFeatureAggregation. ",
    "url": "https://arxiv.org/abs/2205.07466",
    "authors": [
      "Haozhe Liu",
      "Haoqin Ji",
      "Yuexiang Li",
      "Nanjun He",
      "Haoqian Wu",
      "Feng Liu",
      "Linlin Shen",
      "Yefeng Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.07488",
    "title": "Robust Testing in High-Dimensional Sparse Models",
    "abstract": "We consider the problem of robustly testing the norm of a high-dimensional sparse signal vector under two different observation models. In the first model, we are given $n$ i.i.d. samples from the distribution $\\mathcal{N}\\left(\\theta,I_d\\right)$ (with unknown $\\theta$), of which a small fraction has been arbitrarily corrupted. Under the promise that $\\|\\theta\\|_0\\le s$, we want to correctly distinguish whether $\\|\\theta\\|_2=0$ or $\\|\\theta\\|_2>\\gamma$, for some input parameter $\\gamma>0$. We show that any algorithm for this task requires $n=\\Omega\\left(s\\log\\frac{ed}{s}\\right)$ samples, which is tight up to logarithmic factors. We also extend our results to other common notions of sparsity, namely, $\\|\\theta\\|_q\\le s$ for any $0 < q < 2$. In the second observation model that we consider, the data is generated according to a sparse linear regression model, where the covariates are i.i.d. Gaussian and the regression coefficient (signal) is known to be $s$-sparse. Here too we assume that an $\\epsilon$-fraction of the data is arbitrarily corrupted. We show that any algorithm that reliably tests the norm of the regression coefficient requires at least $n=\\Omega\\left(\\min(s\\log d,{1}/{\\gamma^4})\\right)$ samples. Our results show that the complexity of testing in these two settings significantly increases under robustness constraints. This is in line with the recent observations made in robust mean testing and robust covariance testing. ",
    "url": "https://arxiv.org/abs/2205.07488",
    "authors": [
      "Anand Jerry George",
      "Clément L. Canonne"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.07499",
    "title": "Mitigating Hidden Confounding Effects for Causal Recommendation",
    "abstract": "Recommender systems suffer from confounding biases when there exist confounders affecting both item features and user feedback (e.g., like or not). Existing causal recommendation methods typically assume confounders are fully observed and measured, forgoing the possible existence of hidden confounders in real applications. For instance, product quality is a confounder since affecting both item prices and user ratings, but is hidden for the third-party e-commerce platform due to the difficulty of large-scale quality inspection; ignoring it could result in the bias effect of over-recommending high-price items. This work analyzes and addresses the problem from a causal perspective. The key lies in modeling the causal effect of item features on a user's feedback. To mitigate hidden confounding effects, it is compulsory but challenging to estimate the causal effect without measuring the confounder. Towards this goal, we propose a Hidden Confounder Removal (HCR) framework that leverages front-door adjustment to decompose the causal effect into two partial effects, according to the mediators between item features and user feedback. The partial effects are independent from the hidden confounder and identifiable. During training, HCR performs multi-task learning to infer the partial effects from historical interactions. We instantiate HCR for two scenarios and conduct experiments on three real-world datasets. Empirical results show that the HCR framework provides more accurate recommendations, especially for less-active users. We will release the code once accepted. ",
    "url": "https://arxiv.org/abs/2205.07499",
    "authors": [
      "Xinyuan Zhu",
      "Yang Zhang",
      "Fuli Feng",
      "Xun Yang",
      "Dingxian Wang",
      "Xiangnan He"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2205.07500",
    "title": "Computing Bend-Minimum Orthogonal Drawings of Plane Series-Parallel  Graphs in Linear Time",
    "abstract": "A planar orthogonal drawing of a planar 4-graph G (i.e., a planar graph with vertex-degree at most four) is a crossing-free drawing that maps each vertex of G to a distinct point of the plane and each edge of $G$ to a sequence of horizontal and vertical segments between its end-points. A longstanding open question in Graph Drawing, dating back over 30 years, is whether there exists a linear-time algorithm to compute an orthogonal drawing of a plane 4-graph with the minimum number of bends. The term \"plane\" indicates that the input graph comes together with a planar embedding, which must be preserved by the drawing (i.e., the drawing must have the same set of faces as the input graph). In this paper, we positively answer the question above for the widely-studied class of series-parallel graphs. Our linear-time algorithm is based on a characterization of the planar series-parallel graphs that admit an orthogonal drawing without bends. This characterization is given in terms of the orthogonal spirality that each type of triconnected component of the graph can take; the orthogonal spirality of a component measures how much that component is \"rolled-up\" in an orthogonal drawing of the graph. ",
    "url": "https://arxiv.org/abs/2205.07500",
    "authors": [
      "Walter Didimo",
      "Michael Kaufmann",
      "Giuseppe Liotta",
      "Giacomo Ortali"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2205.07502",
    "title": "KGRGRL: A User's Permission Reasoning Method Based on Knowledge Graph  Reward Guidance Reinforcement Learning",
    "abstract": "In general, multiple domain cyberspace security assessments can be implemented by reasoning user's permissions. However, while existing methods include some information from the physical and social domains, they do not provide a comprehensive representation of cyberspace. Existing reasoning methods are also based on expert-given rules, resulting in inefficiency and a low degree of intelligence. To address this challenge, we create a Knowledge Graph (KG) of multiple domain cyberspace in order to provide a standard semantic description of the multiple domain cyberspace. Following that, we proposed a user's permissions reasoning method based on reinforcement learning. All permissions in cyberspace are represented as nodes, and an agent is trained to find all permissions that user can have according to user's initial permissions and cyberspace KG. We set 10 reward setting rules based on the features of cyberspace KG in the reinforcement learning of reward information setting, so that the agent can better locate user's all permissions and avoid blindly finding user's permissions. The results of the experiments showed that the proposed method can successfully reason about user's permissions and increase the intelligence level of the user's permissions reasoning method. At the same time, the F1 value of the proposed method is 6% greater than that of the Translating Embedding (TransE) method. ",
    "url": "https://arxiv.org/abs/2205.07502",
    "authors": [
      "Lei Zhang",
      "Yu Pan",
      "Yi Liu",
      "Qibin Zheng",
      "Zhisong Pan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07514",
    "title": "Residual Local Feature Network for Efficient Super-Resolution",
    "abstract": "Deep learning based approaches has achieved great performance in single image super-resolution (SISR). However, recent advances in efficient super-resolution focus on reducing the number of parameters and FLOPs, and they aggregate more powerful features by improving feature utilization through complex layer connection strategies. These structures may not be necessary to achieve higher running speed, which makes them difficult to be deployed to resource-constrained devices. In this work, we propose a novel Residual Local Feature Network (RLFN). The main idea is using three convolutional layers for residual local feature learning to simplify feature aggregation, which achieves a good trade-off between model performance and inference time. Moreover, we revisit the popular contrastive loss and observe that the selection of intermediate features of its feature extractor has great influence on the performance. Besides, we propose a novel multi-stage warm-start training strategy. In each stage, the pre-trained weights from previous stages are utilized to improve the model performance. Combined with the improved contrastive loss and training strategy, the proposed RLFN outperforms all the state-of-the-art efficient image SR models in terms of runtime while maintaining both PSNR and SSIM for SR. In addition, we won the first place in the runtime track of the NTIRE 2022 efficient super-resolution challenge. Code will be available at https://github.com/fyan111/RLFN. ",
    "url": "https://arxiv.org/abs/2205.07514",
    "authors": [
      "Fangyuan Kong",
      "Mingxi Li",
      "Songwei Liu",
      "Ding Liu",
      "Jingwen He",
      "Yang Bai",
      "Fangmin Chen",
      "Lean Fu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07532",
    "title": "Quantitative Discourse Cohesion Analysis of Scientific Scholarly Texts  using Multilayer Networks",
    "abstract": "Discourse cohesion facilitates text comprehension and helps the reader form a coherent narrative. In this study, we aim to computationally analyze the discourse cohesion in scientific scholarly texts using multilayer network representation and quantify the writing quality of the document. Exploiting the hierarchical structure of scientific scholarly texts, we design section-level and document-level metrics to assess the extent of lexical cohesion in text. We use a publicly available dataset along with a curated set of contrasting examples to validate the proposed metrics by comparing them against select indices computed using existing cohesion analysis tools. We observe that the proposed metrics correlate as expected with the existing cohesion indices. We also present an analytical framework, CHIAA (CHeck It Again, Author), to provide pointers to the author for potential improvements in the manuscript with the help of the section-level and document-level metrics. The proposed CHIAA framework furnishes a clear and precise prescription to the author for improving writing by localizing regions in text with cohesion gaps. We demonstrate the efficacy of CHIAA framework using succinct examples from cohesion-deficient text excerpts in the experimental dataset. ",
    "url": "https://arxiv.org/abs/2205.07532",
    "authors": [
      "Vasudha Bhatnagar",
      "Swagata Duari",
      "S.K. Gupta"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.07535",
    "title": "Code Smells Detection via Modern Code Review: A Study of the OpenStack  and Qt Communities",
    "abstract": "Code review that detects and locates defects and other quality issues plays an important role in software quality control. One type of issue that may impact the quality of software is code smells. Yet, little is known about the extent to which code smells are identified during modern code review. To investigate the concept behind code smells identified in modern code review and what actions reviewers suggest and developers take in response to the identified smells, we conducted a study of code smells in code reviews by analyzing reviews from four large open source projects from the OpenStack (Nova and Neutron) and Qt (Qt Base and Qt Creator) communities. We manually checked a total of 25,415 code review comments obtained by keywords search and random selection, and identified 1,539 smell-related reviews. Our analysis found that 1) code smells were not commonly identified in code reviews, 2) smells were usually caused by violation of coding conventions, 3) reviewers usually provided constructive feedback, including fixing (refactoring) recommendations to help developers remove smells, 4) developers generally followed those recommendations and actioned the changes, 5) once identified by reviewers, it usually takes developers less than one week to fix the smells, and 6) the main reason why developers chose to ignore the identified smells is not worth fixing the smell. Our results suggest that: 1) developers should closely follow coding conventions in their projects to avoid introducing code smells, 2) review-based detection of code smells is perceived to be a trustworthy approach by developers, mainly because reviews are context-sensitive (as reviewers are more aware of the context of the code given that they are part of the project's development team), and 3) program context needs to be fully considered in order to make a decision of whether to fix the identified code smell immediately. ",
    "url": "https://arxiv.org/abs/2205.07535",
    "authors": [
      "Xiaofeng Han",
      "Amjed Tahir",
      "Peng Liang",
      "Steve Counsell",
      "Kelly Blincoe",
      "Bing Li",
      "Yajing Luo"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2205.07545",
    "title": "Heri-Graphs: A Workflow of Creating Datasets for Multi-modal Machine  Learning on Graphs of Heritage Values and Attributes with Social Media",
    "abstract": "Values (why to conserve) and Attributes (what to conserve) are essential concepts of cultural heritage. Recent studies have been using social media to map values and attributes conveyed by public to cultural heritage. However, it is rare to connect heterogeneous modalities of images, texts, geo-locations, timestamps, and social network structures to mine the semantic and structural characteristics therein. This study presents a methodological workflow for constructing such multi-modal datasets using posts and images on Flickr for graph-based machine learning (ML) tasks concerning heritage values and attributes. After data pre-processing using state-of-the-art ML models, the multi-modal information of visual contents and textual semantics are modelled as node features and labels, while their social relationships and spatiotemporal contexts are modelled as links in Multi-Graphs. The workflow is tested in three cities containing UNESCO World Heritage properties - Amsterdam, Suzhou, and Venice, which yielded datasets with high consistency for semi-supervised learning tasks. The entire process is formally described with mathematical notations, ready to be applied in provisional tasks both as ML problems with technical relevance and as urban/heritage study questions with societal interests. This study could also benefit the understanding and mapping of heritage values and attributes for future research in global cases, aiming at inclusive heritage management practices. ",
    "url": "https://arxiv.org/abs/2205.07545",
    "authors": [
      "Nan Bai",
      "Pirouz Nourian",
      "Renqian Luo",
      "Ana Pereira Roders"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2205.07547",
    "title": "SQ-VAE: Variational Bayes on Discrete Representation with Self-annealed  Stochastic Quantization",
    "abstract": "One noted issue of vector-quantized variational autoencoder (VQ-VAE) is that the learned discrete representation uses only a fraction of the full capacity of the codebook, also known as codebook collapse. We hypothesize that the training scheme of VQ-VAE, which involves some carefully designed heuristics, underlies this issue. In this paper, we propose a new training scheme that extends the standard VAE via novel stochastic dequantization and quantization, called stochastically quantized variational autoencoder (SQ-VAE). In SQ-VAE, we observe a trend that the quantization is stochastic at the initial stage of the training but gradually converges toward a deterministic quantization, which we call self-annealing. Our experiments show that SQ-VAE improves codebook utilization without using common heuristics. Furthermore, we empirically show that SQ-VAE is superior to VAE and VQ-VAE in vision- and speech-related tasks. ",
    "url": "https://arxiv.org/abs/2205.07547",
    "authors": [
      "Yuhta Takida",
      "Takashi Shibuya",
      "WeiHsiang Liao",
      "Chieh-Hsin Lai",
      "Junki Ohmura",
      "Toshimitsu Uesaka",
      "Naoki Murata",
      "Shusuke Takahashi",
      "Toshiyuki Kumakura",
      "Yuki Mitsufuji"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07556",
    "title": "An Effective Transformer-based Solution for RSNA Intracranial Hemorrhage  Detection Competition",
    "abstract": "We present an effective method for Intracranial Hemorrhage Detection (IHD) which exceeds the performance of the winner solution in RSNA-IHD competition (2019). Meanwhile, our model only takes quarter parameters and ten percent FLOPs compared to the winner's solution. The IHD task needs to predict the hemorrhage category of each slice for the input brain CT. We review the top-5 solutions for the IHD competition held by the Radiological Society of North America(RSNA) in 2019. Nearly all the top solutions rely on 2D convolutional networks and sequential models (Bidirectional GRU or LSTM) to extract intra-slice and inter-slice features, respectively. All the top solutions enhance the performance by leveraging the model ensemble, and the model number varies from 7 to 31. In the past years, since much progress has been made in the computer vision regime especially Transformer-based models, we introduce the Transformer-based techniques to extract the features in both intra-slice and inter-slice views for IHD tasks. Additionally, a semi-supervised method is embedded into our workflow to further improve the performance. The code is available athttps://aistudio.baidu.com/aistudio/projectdetail/3995861. ",
    "url": "https://arxiv.org/abs/2205.07556",
    "authors": [
      "Fangxin Shang",
      "Siqi Wang",
      "Yehui Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07561",
    "title": "State of Health Estimation of Lithium-Ion Batteries in Vehicle-to-Grid  Applications Using Recurrent Neural Networks for Learning the Impact of  Degradation Stress Factors",
    "abstract": "This work presents an effective state of health indicator to indicate lithium-ion battery degradation based on a long short-term memory (LSTM) recurrent neural network (RNN) coupled with a sliding-window. The developed LSTM RNN is able to capture the underlying long-term dependencies of degraded cell capacity on battery degradation stress factors. The learning performance was robust when there was sufficient training data, with an error of < 5% if more than 1.15 years worth of data was supplied for training. ",
    "url": "https://arxiv.org/abs/2205.07561",
    "authors": [
      "Kotub Uddin",
      "James Schofield",
      "W. Dhammika Widanage"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2205.07590",
    "title": "Metaverse: Security and Privacy Issues",
    "abstract": "The metaverse promises a host of bright opportunities for business, economics, and society. Though, a number of critical aspects are still to be considered and the analysis of their impact is almost non-existent. In this paper, we provide several contributions. We start by analysing the foundations of the metaverse, later we focus on the novel privacy and security issues introduced by this new paradigm, and finally we broaden the scope of the contribution highlighting some of the far-reaching yet logical implications of the metaverse on a number of domains, not all of them in tech. Throughout the paper, we also discuss possible research directions. We believe that the provided holistic view on the foundations, technology, and issues related to the metaverse-with a focus on security and privacy-, other than being an interesting contribution on its own, could also pave the way for a few multidisciplinary research avenues. ",
    "url": "https://arxiv.org/abs/2205.07590",
    "authors": [
      "Roberto Di Pietro",
      "Stefano Cresci"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2205.07592",
    "title": "Qualitative Differences Between Evolutionary Strategies and  Reinforcement Learning Methods for Control of Autonomous Agents",
    "abstract": "In this paper we analyze the qualitative differences between evolutionary strategies and reinforcement learning algorithms by focusing on two popular state-of-the-art algorithms: the OpenAI-ES evolutionary strategy and the Proximal Policy Optimization (PPO) reinforcement learning algorithm -- the most similar methods of the two families. We analyze how the methods differ with respect to: (i) general efficacy, (ii) ability to cope with sparse rewards, (iii) propensity/capacity to discover minimal solutions, (iv) dependency on reward shaping, and (v) ability to cope with variations of the environmental conditions. The analysis of the performance and of the behavioral strategies displayed by the agents trained with the two methods on benchmark problems enable us to demonstrate qualitative differences which were not identified in previous studies, to identify the relative weakness of the two methods, and to propose ways to ameliorate some of those weakness. We show that the characteristics of the reward function has a strong impact which vary qualitatively not only for the OpenAI-ES and the PPO but also for alternative reinforcement learning algorithms, thus demonstrating the importance of optimizing the characteristic of the reward function to the algorithm used. ",
    "url": "https://arxiv.org/abs/2205.07592",
    "authors": [
      "Nicola Milano",
      "Stefano Nolfi"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2205.07626",
    "title": "Attacking and Defending Deep Reinforcement Learning Policies",
    "abstract": "Recent studies have shown that deep reinforcement learning (DRL) policies are vulnerable to adversarial attacks, which raise concerns about applications of DRL to safety-critical systems. In this work, we adopt a principled way and study the robustness of DRL policies to adversarial attacks from the perspective of robust optimization. Within the framework of robust optimization, optimal adversarial attacks are given by minimizing the expected return of the policy, and correspondingly a good defense mechanism should be realized by improving the worst-case performance of the policy. Considering that attackers generally have no access to the training environment, we propose a greedy attack algorithm, which tries to minimize the expected return of the policy without interacting with the environment, and a defense algorithm, which performs adversarial training in a max-min form. Experiments on Atari game environments show that our attack algorithm is more effective and leads to worse return of the policy than existing attack algorithms, and our defense algorithm yields policies more robust than existing defense methods to a range of adversarial attacks (including our proposed attack algorithm). ",
    "url": "https://arxiv.org/abs/2205.07626",
    "authors": [
      "Chao Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.07627",
    "title": "KnowGraph-PM: a Knowledge Graph based Pricing Model for Semiconductors  Supply Chains",
    "abstract": "Semiconductor supply chains are described by significant demand fluctuation that increases as one moves up the supply chain, the so-called bullwhip effect. To counteract, semiconductor manufacturers aim to optimize capacity utilization, to deliver with shorter lead times and exploit this to generate revenue. Additionally, in a competitive market, firms seek to maintain customer relationships while applying revenue management strategies such as dynamic pricing. Price change potentially generates conflicts with customers. In this paper, we present KnowGraph-PM, a knowledge graph-based dynamic pricing model. The semantic model uses the potential of faster delivery and shorter lead times to define premium prices, thus entail increased profits based on the customer profile. The knowledge graph enables the integration of customer-related information, e.g., customer class and location to customer order data. The pricing algorithm is realized as a SPARQL query that relies on customer profile and order behavior to determine the corresponding price premium. We evaluate the approach by calculating the revenue generated after applying the pricing algorithm. Based on competency questions that translate to SPARQL queries, we validate the created knowledge graph. We demonstrate that semantic data integration enables customer-tailored revenue management. ",
    "url": "https://arxiv.org/abs/2205.07627",
    "authors": [
      "Nour Ramzy",
      "Soren Auer",
      "Javad Chamanara",
      "Hans Ehm"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.07646",
    "title": "A Fast Attention Network for Joint Intent Detection and Slot Filling on  Edge Devices",
    "abstract": "Intent detection and slot filling are two main tasks in natural language understanding and play an essential role in task-oriented dialogue systems. The joint learning of both tasks can improve inference accuracy and is popular in recent works. However, most joint models ignore the inference latency and cannot meet the need to deploy dialogue systems at the edge. In this paper, we propose a Fast Attention Network (FAN) for joint intent detection and slot filling tasks, guaranteeing both accuracy and latency. Specifically, we introduce a clean and parameter-refined attention module to enhance the information exchange between intent and slot, improving semantic accuracy by more than 2%. FAN can be implemented on different encoders and delivers more accurate models at every speed level. Our experiments on the Jetson Nano platform show that FAN inferences fifteen utterances per second with a small accuracy drop, showing its effectiveness and efficiency on edge devices. ",
    "url": "https://arxiv.org/abs/2205.07646",
    "authors": [
      "Liang Huang",
      "Senjie Liang",
      "Feiyang Ye",
      "Nan Gao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2205.07654",
    "title": "Hyperdimensional computing encoding for feature selection on the use  case of epileptic seizure detection",
    "abstract": "The healthcare landscape is moving from the reactive interventions focused on symptoms treatment to a more proactive prevention, from one-size-fits-all to personalized medicine, and from centralized to distributed paradigms. Wearable IoT devices and novel algorithms for continuous monitoring are essential components of this transition. Hyperdimensional (HD) computing is an emerging ML paradigm inspired by neuroscience research with various aspects interesting for IoT devices and biomedical applications. Here we explore the not yet addressed topic of optimal encoding of spatio-temporal data, such as electroencephalogram (EEG) signals, and all information it entails to the HD vectors. Further, we demonstrate how the HD computing framework can be used to perform feature selection by choosing an adequate encoding. To the best of our knowledge, this is the first approach to performing feature selection using HD computing in the literature. As a result, we believe it can support the ML community to further foster the research in multiple directions related to feature and channel selection, as well as model interpretability. ",
    "url": "https://arxiv.org/abs/2205.07654",
    "authors": [
      "Una Pale",
      "Tomas Teijeiro",
      "David Atienza"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.07682",
    "title": "L3-Net Deep Audio Embeddings to Improve COVID-19 Detection from  Smartphone Data",
    "abstract": "Smartphones and wearable devices, along with Artificial Intelligence, can represent a game-changer in the pandemic control, by implementing low-cost and pervasive solutions to recognize the development of new diseases at their early stages and by potentially avoiding the rise of new outbreaks. Some recent works show promise in detecting diagnostic signals of COVID-19 from voice and coughs by using machine learning and hand-crafted acoustic features. In this paper, we decided to investigate the capabilities of the recently proposed deep embedding model L3-Net to automatically extract meaningful features from raw respiratory audio recordings in order to improve the performances of standard machine learning classifiers in discriminating between COVID-19 positive and negative subjects from smartphone data. We evaluated the proposed model on 3 datasets, comparing the obtained results with those of two reference works. Results show that the combination of L3-Net with hand-crafted features overcomes the performance of the other works of 28.57% in terms of AUC in a set of subject-independent experiments. This result paves the way to further investigation on different deep audio embeddings, also for the automatic detection of different diseases. ",
    "url": "https://arxiv.org/abs/2205.07682",
    "authors": [
      "Mattia Giovanni Campana",
      "Andrea Rovati",
      "Franca Delmastro",
      "Elena Pagani"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2205.07708",
    "title": "Exploring Diversity-based Active Learning for 3D Object Detection in  Autonomous Driving",
    "abstract": "3D object detection has recently received much attention due to its great potential in autonomous vehicle (AV). The success of deep learning based object detectors relies on the availability of large-scale annotated datasets, which is time-consuming and expensive to compile, especially for 3D bounding box annotation. In this work, we investigate diversity-based active learning (AL) as a potential solution to alleviate the annotation burden. Given limited annotation budget, only the most informative frames and objects are automatically selected for human to annotate. Technically, we take the advantage of the multimodal information provided in an AV dataset, and propose a novel acquisition function that enforces spatial and temporal diversity in the selected samples. We benchmark the proposed method against other AL strategies under realistic annotation cost measurement, where the realistic costs for annotating a frame and a 3D bounding box are both taken into consideration. We demonstrate the effectiveness of the proposed method on the nuScenes dataset and show that it outperforms existing AL strategies significantly. ",
    "url": "https://arxiv.org/abs/2205.07708",
    "authors": [
      "Zhihao Liang",
      "Xun Xu",
      "Shengheng Deng",
      "Lile Cai",
      "Tao Jiang",
      "Kui Jia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07711",
    "title": "Transferability of Adversarial Attacks on Synthetic Speech Detection",
    "abstract": "Synthetic speech detection is one of the most important research problems in audio security. Meanwhile, deep neural networks are vulnerable to adversarial attacks. Therefore, we establish a comprehensive benchmark to evaluate the transferability of adversarial attacks on the synthetic speech detection task. Specifically, we attempt to investigate: 1) The transferability of adversarial attacks between different features. 2) The influence of varying extraction hyperparameters of features on the transferability of adversarial attacks. 3) The effect of clipping or self-padding operation on the transferability of adversarial attacks. By performing these analyses, we summarise the weaknesses of synthetic speech detectors and the transferability behaviours of adversarial attacks, which provide insights for future research. More details can be found at https://gitee.com/djc_QRICK/Attack-Transferability-On-Synthetic-Detection. ",
    "url": "https://arxiv.org/abs/2205.07711",
    "authors": [
      "Jiacheng Deng",
      "Shunyi Chen",
      "Li Dong",
      "Diqun Yan",
      "Rangding Wang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Cryptography and Security (cs.CR)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2205.07712",
    "title": "Persian Abstract Meaning Representation",
    "abstract": "Abstract Meaning Representation (AMR) is an annotation framework representing the semantic structure of a sentence as a whole. From the beginning, AMR was not intended to act as an interlingua; however, it has made progress towards the idea of designing a universal meaning representation framework. Accordingly, developing AMR annotation guidelines for different languages, based on language divergences, is of significant importance. In this paper, we elaborate on Persian Abstract Meaning Representation (PAMR) annotation specifications, based on which we annotated the Persian translation of \"The Little Prince\" as the first gold standard for Persian AMR. Moreover, we describe how some Persian-specific syntactic constructions would result in different AMR annotations. ",
    "url": "https://arxiv.org/abs/2205.07712",
    "authors": [
      "Reza Takhshid",
      "Razieh Shojaei",
      "Zahra Azin",
      "Mohammad Bahrani"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.07723",
    "title": "Pest presence prediction using interpretable machine learning",
    "abstract": "Helicoverpa Armigera, or cotton bollworm, is a serious insect pest of cotton crops that threatens the yield and the quality of lint. The timely knowledge of the presence of the insects in the field is crucial for effective farm interventions. Meteo-climatic and vegetation conditions have been identified as key drivers of crop pest abundance. In this work, we applied an interpretable classifier, i.e., Explainable Boosting Machine, which uses earth observation vegetation indices, numerical weather predictions and insect trap catches to predict the onset of bollworm harmfulness in cotton fields in Greece. The glass-box nature of our approach provides significant insight on the main drivers of the model and the interactions among them. Model interpretability adds to the trustworthiness of our approach and therefore its potential for rapid uptake and context-based implementation in operational farm management scenarios. Our results are satisfactory and the importance of drivers, through our analysis on global and local explainability, is in accordance with the literature. ",
    "url": "https://arxiv.org/abs/2205.07723",
    "authors": [
      "Ornela Nanushi",
      "Vasileios Sitokonstantinou",
      "Ilias Tsoumas",
      "Charalampos Kontoes"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07731",
    "title": "Transfer learning based physics-informed neural networks for solving  inverse problems in tunneling",
    "abstract": "Recently, a class of machine learning methods called physics-informed neural networks (PINNs) has been proposed and gained great prevalence in solving various scientific computing problems. This approach enables the solution of partial differential equations (PDEs) via embedding physical laws into the loss function of neural networks. Many inverse problems can also be tackled by simply combining the observational data from real life scenarios with existing PINN algorithms. In this paper, we present a multi-task learning method to improve the training stability of PINNs for linear elastic problems, and the homoscedastic uncertainty is introduced as a basis for weighting losses. Furthermore, we demonstrate an application of PINNs to a practical inverse problem in tunnel engineering: prediction of external loading distributions of tunnel rings based on a limited number of displacement monitoring points. To this end, we first determine a simplified tunneling scenario at the offline stage. By setting unknown boundary conditions as learnable parameters, PINNs can predict the external loads applied on the tunnel lining with the support of enough measurement data. When it comes to the online stage in real tunnel projects, the Kriging method is adopted to reconstruct the whole displacement field based on very limited measurements. Then transfer learning is employed to fine-tune the pre-trained model from offline stage. Our results show that, although the reconstructed displacement field generated from gappy measurements is accompanied by errors, satisfactory results can still be obtained from the PINN model due to the dual regularization of physics laws and prior knowledge, which exhibits better robustness compared to traditional analysis methods. The convergence of training is also accelerated, thus making it possible for PINNs to be applied in actual tunnel projects. ",
    "url": "https://arxiv.org/abs/2205.07731",
    "authors": [
      "Chen Xu",
      "Ba Trung Cao",
      "Yong Yuan",
      "Günther Meschke"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2205.07763",
    "title": "FvOR: Robust Joint Shape and Pose Optimization for Few-view Object  Reconstruction",
    "abstract": "Reconstructing an accurate 3D object model from a few image observations remains a challenging problem in computer vision. State-of-the-art approaches typically assume accurate camera poses as input, which could be difficult to obtain in realistic settings. In this paper, we present FvOR, a learning-based object reconstruction method that predicts accurate 3D models given a few images with noisy input poses. The core of our approach is a fast and robust multi-view reconstruction algorithm to jointly refine 3D geometry and camera pose estimation using learnable neural network modules. We provide a thorough benchmark of state-of-the-art approaches for this problem on ShapeNet. Our approach achieves best-in-class results. It is also two orders of magnitude faster than the recent optimization-based approach IDR. Our code is released at \\url{https://github.com/zhenpeiyang/FvOR/} ",
    "url": "https://arxiv.org/abs/2205.07763",
    "authors": [
      "Zhenpei Yang",
      "Zhile Ren",
      "Miguel Angel Bautista",
      "Zaiwei Zhang",
      "Qi Shan",
      "Qixing Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07781",
    "title": "Social Aspects of Software Testing: Comparative Studies in Asia",
    "abstract": "This study attempts to understand motivators and de-motivators that influence the decisions of software students to take up and sustain software testing careers across three different Asian countries, i.e., China, India, and Malaysia. The re-search question can be framed as How many software students across different Asian geographies are keen to take up testing careers, and what are the reasons for their choices? Towards an answer, we developed a cross-sectional but simple survey-based instrument. In this work, we investigated how software students perceived the software testing role. The results from China and India revealed that students are not very keen on taking up a software tester career, but the Malaysia students show a more positive attitude towards software testing. The study also pointed out the importance of considering software testing activities as a set of human-dependent tasks and emphasized the need for further re-search that examines critically individual assessments of software testers about software testing activities. This investigation can academics involved in software testing courses to understand the impacting factors on the motivation and de-motivators of their students, as well as to try convey positive view of testing as challenging and requires critical thinking and innovative ideas. ",
    "url": "https://arxiv.org/abs/2205.07781",
    "authors": [
      "Luiz Fernando Capretz",
      "Jingdong Jia",
      "Pradeep Waychal",
      "Shuib Basri"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2205.07815",
    "title": "Vehicle Collision Detection & Prevention Using VANET Based IoT With V2V",
    "abstract": "EMERGENCY alert in case of any accident is vitally necessitated to rescue the victims. And so, this paper is made to present the results of a major analysis relating to emergency alert conditions at the time of collision (automobile). In this study, the authors have investigated modern Internet of Things (IoT) and VANET (Vehicular Ad hoc Networks) technologies and developed a collection of modern and specialized techniques as well as their characteristics. It has sensors that detect unbalanced circumstances and provide with a warning to the microcontroller if a collision occurs. Additionally, the technique can be implemented in such a way that vehicles are alerted of possible closing barriers. Vehicle-to-Vehicle communication (V2V) has a huge impact since it allows vehicles to communicate with each other while in proximity and the buzzer together with the LEDs serves as a safety feature. The primary goal of the system is to carry out the microcontroller functions in every environment and moreover, the concept refers to detect and prevent the collision specially in a foggy weather as well as at night and in other odd circumstances. The Internet of Things (IoT) and the Vehicular Ad-Hoc Network (VANET) have now been merged as the fundamental and central components of Intelligent Transportation System (ITS). Furthermore, while the procedure of obtaining the insurance may be longer for certain people. On the other hand, others may avoid the law after being involved in severe collisions which makes it difficult for the authorities to discriminate between criminal and non-criminal evidence. ",
    "url": "https://arxiv.org/abs/2205.07815",
    "authors": [
      "Shafin Talukder",
      "SK. Tasnim Bari Ira",
      "Aseya Khanom",
      "Prantika Biswas Sneha",
      "Wardah Saleh"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2205.07816",
    "title": "RAN Slicing: Towards Multi-Tenancy IN 5G Radio Access Networks",
    "abstract": "A significant purpose of 5G networks is allowing sharing resources among different network tenants such as service providers and Mobile Virtual network Operators. Numerous domains are taken in account regarding resource sharing containing different infrastructure (storage, compute and networking), Radio Access Network (RAN) and Radio Frequency (RF) spectrum. RAN and spectrum, transport. Spectrum sharing and RAN are anticipated as the fundamental part in multi-tenant 5G network. Nevertheless, there is a shortage of evaluation platforms to determine the number of benefits that can be acquired from multilevel spectrum sharing rather than single-level spectrum sharing. The work presented in this paper intend to address this issue by presenting a modified SimuLTE model is used for evaluating active RAN based on multi-tenant 5G networks. The result shows an understanding into the actual advantages of RAN slicing for multi-tenants in 5G networks. ",
    "url": "https://arxiv.org/abs/2205.07816",
    "authors": [
      "Wardah Saleh",
      "Shahrin Chowdhury"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2205.07820",
    "title": "Multi-ship cooperative air defense model based on queuing theory",
    "abstract": "The study of the multi-ship air defense model is of great significance in the simulation and evaluation of the actual combat process, the demonstration of air defense tactics, and the improvement of the security of important targets. The traditional multi-ship air defense model does not consider the coordination between ships, and the model assumptions are often too simple to effectively describe the capabilities of the multi-ship cooperative air defense system in realistic combat scenarios. In response to the above problems, this paper proposes a multi-ship cooperative air defense model, which effectively integrates the attack and defense parameters of both sides such as missile launch rate, missile flight speed, missile launch direction, ship interception rate, ship interception range, and the number of ship interception fire units. Then, the cooperative interception capability among ships is modeled by the method of task assignment. Based on the queuing theory, this paper strictly deduces the penetration probability of the cooperative air defense system, and provides an analytical calculation model for the analysis and design of the cooperative air defense system. Finally, through simulation experiments in typical scenarios, this paper studies and compares the air defense capabilities of the system in two different modes with and without coordination, and verifies the superiority of the multi-ship cooperative air defense model in reducing the probability of missile penetration; Further, the ability changes of the defense system under different parameters such as missile speed, speed, angle, ship interception rate, range, and number of fire units are studied, and the weak points of the defense formation, defense range settings, and interception settings are obtained. ",
    "url": "https://arxiv.org/abs/2205.07820",
    "authors": [
      "Zhongyao Ma",
      "Keyu Wu",
      "Zhong Liu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2205.07826",
    "title": "GraphHD: Efficient graph classification using hyperdimensional computing",
    "abstract": "Hyperdimensional Computing (HDC) developed by Kanerva is a computational model for machine learning inspired by neuroscience. HDC exploits characteristics of biological neural systems such as high-dimensionality, randomness and a holographic representation of information to achieve a good balance between accuracy, efficiency and robustness. HDC models have already been proven to be useful in different learning applications, especially in resource-limited settings such as the increasingly popular Internet of Things (IoT). One class of learning tasks that is missing from the current body of work on HDC is graph classification. Graphs are among the most important forms of information representation, yet, to this day, HDC algorithms have not been applied to the graph learning problem in a general sense. Moreover, graph learning in IoT and sensor networks, with limited compute capabilities, introduce challenges to the overall design methodology. In this paper, we present GraphHD$-$a baseline approach for graph classification with HDC. We evaluate GraphHD on real-world graph classification problems. Our results show that when compared to the state-of-the-art Graph Neural Networks (GNNs) the proposed model achieves comparable accuracy, while training and inference times are on average 14.6$\\times$ and 2.0$\\times$ faster, respectively. ",
    "url": "https://arxiv.org/abs/2205.07826",
    "authors": [
      "Igor Nunes",
      "Mike Heddes",
      "Tony Givargis",
      "Alexandru Nicolau",
      "Alex Veidenbaum"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2205.07829",
    "title": "Federated Anomaly Detection over Distributed Data Streams",
    "abstract": "Sharing of telecommunication network data, for example, even at high aggregation levels, is nowadays highly restricted due to privacy legislation and regulations and other important ethical concerns. It leads to scattering data across institutions, regions, and states, inhibiting the usage of AI methods that could otherwise take advantage of data at scale. It creates the need to build a platform to control such data, build models or perform calculations. In this work, we propose an approach to building the bridge among anomaly detection, federated learning, and data streams. The overarching goal of the work is to detect anomalies in a federated environment over distributed data streams. This work complements the state-of-the-art by adapting the data stream algorithms in a federated learning setting for anomaly detection and by delivering a robust framework and demonstrating the practical feasibility in a real-world distributed deployment scenario. ",
    "url": "https://arxiv.org/abs/2205.07829",
    "authors": [
      "Paula Raissa Silva",
      "João Viangre",
      "João Gama"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2205.07850",
    "title": "Hyperdimensional Hashing: A Robust and Efficient Dynamic Hash Table",
    "abstract": "Most cloud services and distributed applications rely on hashing algorithms that allow dynamic scaling of a robust and efficient hash table. Examples include AWS, Google Cloud and BitTorrent. Consistent and rendezvous hashing are algorithms that minimize key remapping as the hash table resizes. While memory errors in large-scale cloud deployments are common, neither algorithm offers both efficiency and robustness. Hyperdimensional Computing is an emerging computational model that has inherent efficiency, robustness and is well suited for vector or hardware acceleration. We propose Hyperdimensional (HD) hashing and show that it has the efficiency to be deployed in large systems. Moreover, a realistic level of memory errors causes more than 20% mismatches for consistent hashing while HD hashing remains unaffected. ",
    "url": "https://arxiv.org/abs/2205.07850",
    "authors": [
      "Mike Heddes",
      "Igor Nunes",
      "Tony Givargis",
      "Alexandru Nicolau",
      "Alex Veidenbaum"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2205.06834",
    "title": "Multi-variant COVID-19 model with heterogeneous transmission rates using  deep neural networks",
    "abstract": "Mutating variants of COVID-19 have been reported across many US states since 2021. In the fight against COVID-19, it has become imperative to study the heterogeneity in the time-varying transmission rates for each variant in the presence of pharmaceutical and non-pharmaceutical mitigation measures. We develop a Susceptible-Exposed-Infected-Recovered mathematical model to highlight the differences in the transmission of the B.1.617.2 delta variant and the original SARS-CoV-2. Theoretical results for the well-posedness of the model are discussed. A Deep neural network is utilized and a deep learning algorithm is developed to learn the time-varying heterogeneous transmission rates for each variant. The accuracy of the algorithm for the model is shown using error metrics in the data-driven simulation for COVID-19 variants in the US states of Florida, Alabama, Tennessee, and Missouri. Short-term forecasting of daily cases is demonstrated using long short term memory neural network and an adaptive neuro-fuzzy inference system. ",
    "url": "https://arxiv.org/abs/2205.06834",
    "authors": [
      "K.D. Olumoyin",
      "A.Q.M. Khaliq",
      "K.M. Furati"
    ],
    "subjectives": [
      "Populations and Evolution (q-bio.PE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.06891",
    "title": "Unsupervised Representation Learning for 3D MRI Super Resolution with  Degradation Adaptation",
    "abstract": "High-resolution (HR) MRI is critical in assisting the doctor's diagnosis and image-guided treatment, but is hard to obtain in a clinical setting due to long acquisition time. Therefore, the research community investigated deep learning-based super-resolution (SR) technology to reconstruct HR MRI images with shortened acquisition time. However, training such neural networks usually requires paired HR and low-resolution (LR) in-vivo images, which are difficult to acquire due to patient movement during and between the image acquisition. Rigid movements of hard tissues can be corrected with image-registration, whereas the alignment of deformed soft tissues is challenging, making it impractical to train the neural network with such authentic HR and LR image pairs. Therefore, most of the previous studies proposed SR reconstruction by employing authentic HR images and synthetic LR images downsampled from the HR images, yet the difference in degradation representations between synthetic and authentic LR images suppresses the performance of SR reconstruction from authentic LR images. To mitigate the aforementioned problems, we propose a novel Unsupervised DEgradation Adaptation Network (UDEAN). Our model consists of two components: the degradation learning network and the SR reconstruction network. The degradation learning network downsamples the HR images by addressing the degradation representation of the misaligned or unpaired LR images, and the SR reconstruction network learns the mapping from the downsampled HR images to their original HR images. As a result, the SR reconstruction network can generate SR images from the LR images and achieve comparable quality to the HR images. Experimental results show that our method outperforms the state-of-the-art models and can potentially be applied in real-world clinical settings. ",
    "url": "https://arxiv.org/abs/2205.06891",
    "authors": [
      "Jianan Liu",
      "Hao Li",
      "Tao Huang",
      "Euijoon Ahn",
      "Adeel Razi",
      "Wei Xiang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2205.06947",
    "title": "BronchusNet: Region and Structure Prior Embedded Representation Learning  for Bronchus Segmentation and Classification",
    "abstract": "CT-based bronchial tree analysis plays an important role in the computer-aided diagnosis for respiratory diseases, as it could provide structured information for clinicians. The basis of airway analysis is bronchial tree reconstruction, which consists of bronchus segmentation and classification. However, there remains a challenge for accurate bronchial analysis due to the individual variations and the severe class imbalance. In this paper, we propose a region and structure prior embedded framework named BronchusNet to achieve accurate segmentation and classification of bronchial regions in CT images. For bronchus segmentation, we propose an adaptive hard region-aware UNet that incorporates multi-level prior guidance of hard pixel-wise samples in the general Unet segmentation network to achieve better hierarchical feature learning. For the classification of bronchial branches, we propose a hybrid point-voxel graph learning module to fully exploit bronchial structure priors and to support simultaneous feature interactions across different branches. To facilitate the study of bronchial analysis, we contribute~\\textbf{BRSC}: an open-access benchmark of \\textbf{BR}onchus imaging analysis with high-quality pixel-wise \\textbf{S}egmentation masks and the \\textbf{C}lass of bronchial segments. Experimental results on BRSC show that our proposed method not only achieves the state-of-the-art performance for binary segmentation of bronchial region but also exceeds the best existing method on bronchial branches classification by 6.9\\%. ",
    "url": "https://arxiv.org/abs/2205.06947",
    "authors": [
      "Wenhao Huang",
      "Haifan Gong",
      "Huan Zhang",
      "Yu Wang",
      "Haofeng Li",
      "Guanbin Li",
      "Hong Shen"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.06956",
    "title": "The multi-robber damage number of a graph",
    "abstract": "In many variants of the game of Cops and Robbers on graphs, multiple cops play against a single robber. In 2019, Cox and Sanaei introduced a variant of the game that gives the robber a more active role than simply evading the cop. In their version, the robber tries to damage as many vertices as possible and the cop attempts to minimize this damage. While the damage variant was originally studied with one cop and one robber, it was later extended to play with multiple cops by Carlson et. al in 2021. We take a different approach by studying the damage variant with multiple robbers against one cop. Specifically, we introduce the $s$-robber damage number of a graph and obtain a variety of bounds on this parameter. Applying these bounds, we determine the $s$-robber damage number for a variety of graph families and characterize graphs with extreme $2$-robber damage number. ",
    "url": "https://arxiv.org/abs/2205.06956",
    "authors": [
      "Joshua Carlson",
      "Meghan Halloran",
      "Carolyn Reinhart"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2205.06973",
    "title": "Efficient Hierarchical State Vector Simulation of Quantum Circuits via  Acyclic Graph Partitioning",
    "abstract": "Early but promising results in quantum computing have been enabled by the concurrent development of quantum algorithms, devices, and materials. Classical simulation of quantum programs has enabled the design and analysis of algorithms and implementation strategies targeting current and anticipated quantum device architectures. In this paper, we present a graph-based approach to achieve efficient quantum circuit simulation. Our approach involves partitioning the graph representation of a given quantum circuit into acyclic sub-graphs/circuits that exhibit better data locality. Simulation of each sub-circuit is organized hierarchically, with the iterative construction and simulation of smaller state vectors, improving overall performance. Also, this partitioning reduces the number of passes through data, improving the total computation time. We present three partitioning strategies and observe that acyclic graph partitioning typically results in the best time-to-solution. In contrast, other strategies reduce the partitioning time at the expense of potentially increased simulation times. Experimental evaluation demonstrates the effectiveness of our approach. ",
    "url": "https://arxiv.org/abs/2205.06973",
    "authors": [
      "Bo Fang",
      "M. Yusuf Özkaya",
      "Ang Li",
      "Ümit V. Çatalyürek",
      "Sriram Krishnamoorthy"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2205.06998",
    "title": "The Detection and effect of social events on Wikipedia data-set for  studying human preferences",
    "abstract": "Several studies have used Wikipedia (WP) data-set to analyse worldwide human preferences by languages. However, those studies could suffer from bias related to exceptional social circumstances. Any massive event promoting the exceptional edition of WP can be defined as a source of bias. In this article, we follow a procedure for detecting outliers. Our study is based on $12$ languages and $13$ different categories. Our methodology defines a parameter, which is language-depending instead of being externally fixed. We also study the presence of human cyclic behaviour to evaluate apparent outliers. After our analysis, we found that the outliers in our data set do not significantly affect using the whole Wikipedia-data set as a digital footprint to analyse worldwide human preferences. ",
    "url": "https://arxiv.org/abs/2205.06998",
    "authors": [
      "Julien Assuied",
      "Yérali Gandica"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2205.07021",
    "title": "Self-supervised Assisted Active Learning for Skin Lesion Segmentation",
    "abstract": "Label scarcity has been a long-standing issue for biomedical image segmentation, due to high annotation costs and professional requirements. Recently, active learning (AL) strategies strive to reduce annotation costs by querying a small portion of data for annotation, receiving much traction in the field of medical imaging. However, most of the existing AL methods have to initialize models with some randomly selected samples followed by active selection based on various criteria, such as uncertainty and diversity. Such random-start initialization methods inevitably introduce under-value redundant samples and unnecessary annotation costs. For the purpose of addressing the issue, we propose a novel self-supervised assisted active learning framework in the cold-start setting, in which the segmentation model is first warmed up with self-supervised learning (SSL), and then SSL features are used for sample selection via latent feature clustering without accessing labels. We assess our proposed methodology on skin lesions segmentation task. Extensive experiments demonstrate that our approach is capable of achieving promising performance with substantial improvements over existing baselines. ",
    "url": "https://arxiv.org/abs/2205.07021",
    "authors": [
      "Ziyuan Zhao",
      "Wenjing Lu",
      "Zeng Zeng",
      "Kaixin Xu",
      "Bharadwaj Veeravalli",
      "Cuntai Guan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07086",
    "title": "Collar-aware Training for Streaming Speaker Change Detection in  Broadcast Speech",
    "abstract": "In this paper, we present a novel training method for speaker change detection models. Speaker change detection is often viewed as a binary sequence labelling problem. The main challenges with this approach are the vagueness of annotated change points caused by the silences between speaker turns and imbalanced data due to the majority of frames not including a speaker change. Conventional training methods tackle these by artificially increasing the proportion of positive labels in the training data. Instead, the proposed method uses an objective function which encourages the model to predict a single positive label within a specified collar. This is done by marginalizing over all possible subsequences that have exactly one positive label within the collar. Experiments on English and Estonian datasets show large improvements over the conventional training method. Additionally, the model outputs have peaks concentrated to a single frame, removing the need for post-processing to find the exact predicted change point which is particularly useful for streaming applications. ",
    "url": "https://arxiv.org/abs/2205.07086",
    "authors": [
      "Joonas Kalda",
      "Tanel Alumäe"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2205.07104",
    "title": "Evolutionary optimization of the Verlet closure relation for the  hard-sphere and square-well fluids",
    "abstract": "The Ornstein-Zernike equation is solved for the hard-sphere and square-well fluids using a diverse selection of closure relations; the attraction range of the square-well is chosen to be $\\lambda=1.5.$ In particular, for both fluids we mainly focus on the solution based on a three-parameter version of the Verlet closure relation [Mol. Phys. 42, 1291-1302 (1981)]. To find the free parameters of the latter, an unconstrained optimization problem is defined as a condition of thermodynamic consistency based on the compressibility and solved using Evolutionary Algorithms. For the hard-sphere fluid, the results show good agreement when compared with mean-field equations of state and accurate computer simulation results; at high densities, i.e., close to the freezing transition, expected (small) deviations are seen. In the case of the square-well fluid, a good agreement is observed at low and high densities when compared with event-driven molecular dynamics computer simulations. For intermediate densities, the explored closure relations vary in terms of accuracy. Our findings suggest that a modification of the optimization problem to include, for example, additional thermodynamic consistency criteria could improve the results for the type of fluids here explored. ",
    "url": "https://arxiv.org/abs/2205.07104",
    "authors": [
      "Edwin Bedolla",
      "Luis Carlos Padierna",
      "Ramón Castañeda-Priego"
    ],
    "subjectives": [
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Soft Condensed Matter (cond-mat.soft)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2205.07106",
    "title": "Robust Regularized Low-Rank Matrix Models for Regression and  Classification",
    "abstract": "While matrix variate regression models have been studied in many existing works, classical statistical and computational methods for the analysis of the regression coefficient estimation are highly affected by high dimensional and noisy matrix-valued predictors. To address these issues, this paper proposes a framework of matrix variate regression models based on a rank constraint, vector regularization (e.g., sparsity), and a general loss function with three special cases considered: ordinary matrix regression, robust matrix regression, and matrix logistic regression. We also propose an alternating projected gradient descent algorithm. Based on analyzing our objective functions on manifolds with bounded curvature, we show that the algorithm is guaranteed to converge, all accumulation points of the iterates have estimation errors in the order of $O(1/\\sqrt{n})$ asymptotically and substantially attaining the minimax rate. Our theoretical analysis can be applied to general optimization problems on manifolds with bounded curvature and can be considered an important technical contribution to this work. We validate the proposed method through simulation studies and real image data examples. ",
    "url": "https://arxiv.org/abs/2205.07106",
    "authors": [
      "Hsin-Hsiung Huang",
      "Feng Yu",
      "Xing Fan",
      "Teng Zhang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07195",
    "title": "A comparison of PINN approaches for drift-diffusion equations on metric  graphs",
    "abstract": "In this paper we focus on comparing machine learning approaches for quantum graphs, which are metric graphs, i.e., graphs with dedicated edge lengths, and an associated differential operator. In our case the differential equation is a drift-diffusion model. Computational methods for quantum graphs require a careful discretization of the differential operator that also incorporates the node conditions, in our case Kirchhoff-Neumann conditions. Traditional numerical schemes are rather mature but have to be tailored manually when the differential equation becomes the constraint in an optimization problem. Recently, physics informed neural networks (PINNs) have emerged as a versatile tool for the solution of partial differential equations from a range of applications. They offer flexibility to solve parameter identification or optimization problems by only slightly changing the problem formulation used for the forward simulation. We compare several PINN approaches for solving the drift-diffusion on the metric graph. ",
    "url": "https://arxiv.org/abs/2205.07195",
    "authors": [
      "Jan Blechschmidt",
      "Jan-Frederik Pietschman",
      "Tom-Christian Riemer",
      "Martin Stoll",
      "Max Winkler"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2205.07236",
    "title": "Combating COVID-19 using Generative Adversarial Networks and Artificial  Intelligence for Medical Images: A Scoping Review",
    "abstract": "This review presents a comprehensive study on the role of GANs in addressing the challenges related to COVID-19 data scarcity and diagnosis. It is the first review that summarizes the different GANs methods and the lungs images datasets for COVID-19. It attempts to answer the questions related to applications of GANs, popular GAN architectures, frequently used image modalities, and the availability of source code. This review included 57 full-text studies that reported the use of GANs for different applications in COVID-19 lungs images data. Most of the studies (n=42) used GANs for data augmentation to enhance the performance of AI techniques for COVID-19 diagnosis. Other popular applications of GANs were segmentation of lungs and super-resolution of the lungs images. The cycleGAN and the conditional GAN were the most commonly used architectures used in nine studies each. 29 studies used chest X-Ray images while 21 studies used CT images for the training of GANs. For majority of the studies (n=47), the experiments were done and results were reported using publicly available data. A secondary evaluation of the results by radiologists/clinicians was reported by only two studies. Conclusion: Studies have shown that GANs have great potential to address the data scarcity challenge for lungs images of COVID-19. Data synthesized with GANs have been helpful to improve the training of the Convolutional Neural Network (CNN) models trained for the diagnosis of COVID-19. Besides, GANs have also contributed to enhancing the CNNs performance through the super-resolution of the images and segmentation. This review also identified key limitations of the potential transformation of GANs based methods in clinical applications. ",
    "url": "https://arxiv.org/abs/2205.07236",
    "authors": [
      "Hazrat Ali",
      "Zubair Shah"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07390",
    "title": "Learning Representations for New Sound Classes With Continual  Self-Supervised Learning",
    "abstract": "In this paper, we present a self-supervised learning framework for continually learning representations for new sound classes. The proposed system relies on a continually trained neural encoder that is trained with similarity-based learning objectives without using labels. We show that representations learned with the proposed method generalize better and are less susceptible to catastrophic forgetting than fully-supervised approaches. Remarkably, our technique does not store past data or models and is more computationally efficient than distillation-based methods. To accurately assess the system performance, in addition to using existing protocols, we propose two realistic evaluation protocols that use only a small amount of labeled data to simulate practical use cases. ",
    "url": "https://arxiv.org/abs/2205.07390",
    "authors": [
      "Zhepei Wang",
      "Cem Subakan",
      "Xilin Jiang",
      "Junkai Wu",
      "Efthymios Tzinis",
      "Mirco Ravanelli",
      "Paris Smaragdis"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.07447",
    "title": "Optimal chromatic bound for ($P_2+P_3$, $\\bar{P_2+ P_3}$)-free graphs",
    "abstract": "For a graph $G$, let $\\chi(G)$ ($\\omega(G)$) denote its chromatic (clique) number. A $P_2+P_3$ is the graph obtained by taking the disjoint union of a two-vertex path $P_2$ and a three-vertex path $P_3$. A $\\bar{P_2+P_3}$ is the complement graph of a $P_2+P_3$. In this paper, we study the class of ($P_2+P_3$, $\\bar{P_2+P_3}$)-free graphs and show that every such graph $G$ with $\\omega(G)\\geq 3$ satisfies $\\chi(G)\\leq \\max \\{\\omega(G)+3, \\lfloor\\frac{3}{2} \\omega(G) \\rfloor-1 \\}$. Moreover, the bound is tight. Indeed, for any $k\\in {\\mathbb N}$ and $k\\geq 3$, there is a ($P_2+P_3$, $\\bar{P_2+P_3}$)-free graph $G$ such that $\\omega(G)=k$ and $\\chi(G)=\\max\\{k+3, \\lfloor\\frac{3}{2} k \\rfloor-1 \\}$. ",
    "url": "https://arxiv.org/abs/2205.07447",
    "authors": [
      "Arnab Char",
      "T. Karthick"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2205.07471",
    "title": "Adaptive Convolutional Dictionary Network for CT Metal Artifact  Reduction",
    "abstract": "Inspired by the great success of deep neural networks, learning-based methods have gained promising performances for metal artifact reduction (MAR) in computed tomography (CT) images. However, most of the existing approaches put less emphasis on modelling and embedding the intrinsic prior knowledge underlying this specific MAR task into their network designs. Against this issue, we propose an adaptive convolutional dictionary network (ACDNet), which leverages both model-based and learning-based methods. Specifically, we explore the prior structures of metal artifacts, e.g., non-local repetitive streaking patterns, and encode them as an explicit weighted convolutional dictionary model. Then, a simple-yet-effective algorithm is carefully designed to solve the model. By unfolding every iterative substep of the proposed algorithm into a network module, we explicitly embed the prior structure into a deep network, \\emph{i.e.,} a clear interpretability for the MAR task. Furthermore, our ACDNet can automatically learn the prior for artifact-free CT images via training data and adaptively adjust the representation kernels for each input CT image based on its content. Hence, our method inherits the clear interpretability of model-based methods and maintains the powerful representation ability of learning-based methods. Comprehensive experiments executed on synthetic and clinical datasets show the superiority of our ACDNet in terms of effectiveness and model generalization. {\\color{blue}{{\\textit{Code is available at {\\url{https://github.com/hongwang01/ACDNet}}.}}}} ",
    "url": "https://arxiv.org/abs/2205.07471",
    "authors": [
      "Hong Wang",
      "Yuexiang Li",
      "Deyu Meng",
      "Yefeng Zheng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.07609",
    "title": "Reduction of detection limit and quantification uncertainty due to  interferent by neural classification with abstention",
    "abstract": "Many measurements in the physical sciences can be cast as counting experiments, where the number of occurrences of a physical phenomenon informs the prevalence of the phenomenon's source. Often, detection of the physical phenomenon (termed signal) is difficult to distinguish from naturally occurring phenomena (termed background). In this case, the discrimination of signal events from background can be performed using classifiers, and they may range from simple, threshold-based classifiers to sophisticated neural networks. These classifiers are often trained and validated to obtain optimal accuracy, however we show that the optimal accuracy classifier does not generally coincide with a classifier that provides the lowest detection limit, nor the lowest quantification uncertainty. We present a derivation of the detection limit and quantification uncertainty in the classifier-based counting experiment case. We also present a novel abstention mechanism to minimize the detection limit or quantification uncertainty \\emph{a posteriori}. We illustrate the method on two data sets from the physical sciences, discriminating Ar-37 and Ar-39 radioactive decay from non-radioactive events in a gas proportional counter, and discriminating neutrons from photons in an inorganic scintillator and report results therefrom. ",
    "url": "https://arxiv.org/abs/2205.07609",
    "authors": [
      "Alex Hagen",
      "Ken Jarman",
      "Jesse Ward",
      "Greg Eiden",
      "Charles Barinaga",
      "Emily Mace",
      "Craig Aalseth",
      "Anthony Carado"
    ],
    "subjectives": [
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Experiment (hep-ex)",
      "Instrumentation and Detectors (physics.ins-det)"
    ]
  },
  {
    "id": "arXiv:2205.07770",
    "title": "JR2net: A Joint Non-Linear Representation and Recovery Network for  Compressive Spectral Imaging",
    "abstract": "Deep learning models are state-of-the-art in compressive spectral imaging (CSI) recovery. These methods use a deep neural network (DNN) as an image generator to learn non-linear mapping from compressed measurements to the spectral image. For instance, the deep spectral prior approach uses a convolutional autoencoder network (CAE) in the optimization algorithm to recover the spectral image by using a non-linear representation. However, the CAE training is detached from the recovery problem, which does not guarantee optimal representation of the spectral images for the CSI problem. This work proposes a joint non-linear representation and recovery network (JR2net), linking the representation and recovery task into a single optimization problem. JR2net consists of an optimization-inspired network following an ADMM formulation that learns a non-linear low-dimensional representation and simultaneously performs the spectral image recovery, trained via the end-to-end approach. Experimental results show the superiority of the proposed method with improvements up to 2.57 dB in PSNR and performance around 2000 times faster than state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2205.07770",
    "authors": [
      "Brayan Monroy",
      "Jorge Bacca",
      "Henry Arguello"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07848",
    "title": "Power and limitations of single-qubit native quantum neural networks",
    "abstract": "Quantum neural networks (QNNs) have emerged as a leading strategy to establish applications in machine learning, chemistry, and optimization. While the applications of QNN have been widely investigated, its theoretical foundation remains less understood. In this paper, we formulate a theoretical framework for the expressive ability of data re-uploading quantum neural networks that consist of interleaved encoding circuit blocks and trainable circuit blocks. First, we prove that single-qubit quantum neural networks can approximate any univariate function by mapping the model to a partial Fourier series. Beyond previous works' understanding of existence, we in particular establish the exact correlations between the parameters of the trainable gates and the working Fourier coefficients, by exploring connections to quantum signal processing. Second, we discuss the limitations of single-qubit native QNNs on approximating multivariate functions by analyzing the frequency spectrum and the flexibility of Fourier coefficients. We further demonstrate the expressivity and limitations of single-qubit native QNNs via numerical experiments. As applications, we introduce natural extensions to multi-qubit quantum neural networks, which exhibit the capability of classifying real-world multi-dimensional data. We believe these results would improve our understanding of QNNs and provide a helpful guideline for designing powerful QNNs for machine learning tasks. ",
    "url": "https://arxiv.org/abs/2205.07848",
    "authors": [
      "Zhan Yu",
      "Hongshun Yao",
      "Mujin Li",
      "Xin Wang"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Mathematical Physics (math-ph)"
    ]
  },
  {
    "id": "arXiv:1911.06382",
    "title": "R-local unlabeled sensing: A novel graph matching approach for multiview  unlabeled sensing under local permutations",
    "abstract": " Title: R-local unlabeled sensing: A novel graph matching approach for multiview  unlabeled sensing under local permutations ",
    "url": "https://arxiv.org/abs/1911.06382",
    "authors": [
      "Ahmed Abbasi",
      "Abiy Tasissa",
      "Shuchin Aeron"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:1911.11132",
    "title": "Scaling Out-of-Distribution Detection for Real-World Settings",
    "abstract": " Comments: ICML 2022; The Species dataset and code are available at this https URL ",
    "url": "https://arxiv.org/abs/1911.11132",
    "authors": [
      "Dan Hendrycks",
      "Steven Basart",
      "Mantas Mazeika",
      "Andy Zou",
      "Joe Kwon",
      "Mohammadreza Mostajabi",
      "Jacob Steinhardt",
      "Dawn Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2005.11706",
    "title": "A Novel Distributed Representation of News (DRNews) for Stock Market  Predictions",
    "abstract": " Comments: 25 pages ",
    "url": "https://arxiv.org/abs/2005.11706",
    "authors": [
      "Ye Ma",
      "Lu Zong",
      "Peiwan Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2006.03493",
    "title": "Compositional modelling of network games",
    "abstract": " Comments: Published in CSL'21 ",
    "url": "https://arxiv.org/abs/2006.03493",
    "authors": [
      "Elena Di Lavore",
      "Jules Hedges",
      "Paweł Sobociński"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Category Theory (math.CT)"
    ]
  },
  {
    "id": "arXiv:2006.12963",
    "title": "PFGDF: Pruning Filter via Gaussian Distribution Feature for Deep Neural  Networks Acceleration",
    "abstract": " Title: PFGDF: Pruning Filter via Gaussian Distribution Feature for Deep Neural  Networks Acceleration ",
    "url": "https://arxiv.org/abs/2006.12963",
    "authors": [
      "Jianrong Xu",
      "Chao Li",
      "Bifeng Cui",
      "Kang Yang",
      "Yongjun Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2006.14583",
    "title": "Replication Robust Payoff Allocation in Submodular Cooperative Games",
    "abstract": " Title: Replication Robust Payoff Allocation in Submodular Cooperative Games ",
    "url": "https://arxiv.org/abs/2006.14583",
    "authors": [
      "Dongge Han",
      "Michael Wooldridge",
      "Alex Rogers",
      "Olga Ohrimenko",
      "Sebastian Tschiatschek"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2007.00930",
    "title": "Robust MPC for Linear Systems with Parametric and Additive Uncertainty:  A Novel Constraint Tightening Approach",
    "abstract": " Comments: Minor typo fixes. Shortened and slightly altered version of this draft accepted as a full paper in Automatica ",
    "url": "https://arxiv.org/abs/2007.00930",
    "authors": [
      "Monimoy Bujarbaruah",
      "Ugo Rosolia",
      "Yvonne R Stürz",
      "Xiaojing Zhang",
      "Francesco Borrelli"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2007.02066",
    "title": "Weight-dependent Gates for Network Pruning",
    "abstract": " Comments: 13 pages, 7 figures, to appear at IEEE TCSVT ",
    "url": "https://arxiv.org/abs/2007.02066",
    "authors": [
      "Yun Li",
      "Zechun Liu",
      "Weiqun Wu",
      "Haotian Yao",
      "Xiangyu Zhang",
      "Chi Zhang",
      "Baoqun Yin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2010.12464",
    "title": "Representation Learning for High-Dimensional Data Collection under Local  Differential Privacy",
    "abstract": " Title: Representation Learning for High-Dimensional Data Collection under Local  Differential Privacy ",
    "url": "https://arxiv.org/abs/2010.12464",
    "authors": [
      "Alex Mansbridge",
      "Gregory Barbour",
      "Davide Piras",
      "Michael Murray",
      "Christopher Frye",
      "Ilya Feige",
      "David Barber"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2011.04923",
    "title": "Topological properties of basins of attraction and expressiveness of  width bounded neural networks",
    "abstract": " Title: Topological properties of basins of attraction and expressiveness of  width bounded neural networks ",
    "url": "https://arxiv.org/abs/2011.04923",
    "authors": [
      "Hans-Peter Beise",
      "Steve Dias Da Cruz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2012.03506",
    "title": "Dynamic Structure Learning through Graph Neural Network for Forecasting  Soil Moisture in Precision Agriculture",
    "abstract": " Comments: Accepted for publication in IJCAI 2022 ",
    "url": "https://arxiv.org/abs/2012.03506",
    "authors": [
      "Anoushka Vyas",
      "Sambaran Bandyopadhyay"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2102.09404",
    "title": "Transient Performance of Tube-based Robust Economic Model Predictive  Control",
    "abstract": " Title: Transient Performance of Tube-based Robust Economic Model Predictive  Control ",
    "url": "https://arxiv.org/abs/2102.09404",
    "authors": [
      "Christian Klöppelt",
      "Lukas Schwenkel",
      "Frank Allgöwer",
      "Matthias A. Müller"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2103.13686",
    "title": "Robust subgroup discovery",
    "abstract": " Comments: For associated code, see this https URL ; submitted to Data Mining and Knowledge Discovery Journal ",
    "url": "https://arxiv.org/abs/2103.13686",
    "authors": [
      "Hugo Manuel Proença",
      "Peter Grünwald",
      "Thomas Bäck",
      "Matthijs van Leeuwen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2104.01026",
    "title": "SGBA: A Stealthy Scapegoat Backdoor Attack against Deep Neural Networks",
    "abstract": " Title: SGBA: A Stealthy Scapegoat Backdoor Attack against Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2104.01026",
    "authors": [
      "Ying He",
      "Zhili Shen",
      "Chang Xia",
      "Jingyu Hua",
      "Wei Tong",
      "Sheng Zhong"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2104.13433",
    "title": "Self-supervised Spatial Reasoning on Multi-View Line Drawings",
    "abstract": " Comments: The first two authors contributed equally. Chen Feng is the corresponding author ",
    "url": "https://arxiv.org/abs/2104.13433",
    "authors": [
      "Siyuan Xiang",
      "Anbang Yang",
      "Yanfei Xue",
      "Yaoqing Yang",
      "Chen Feng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.06351",
    "title": "Convergence and Implicit Bias of Gradient Flow on Overparametrized  Linear Networks",
    "abstract": " Title: Convergence and Implicit Bias of Gradient Flow on Overparametrized  Linear Networks ",
    "url": "https://arxiv.org/abs/2105.06351",
    "authors": [
      "Hancheng Min",
      "Salma Tarmoun",
      "Rene Vidal",
      "Enrique Mallada"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.07436",
    "title": "Attacking Masked Cryptographic Implementations: Information-Theoretic  Bounds",
    "abstract": " Comments: The revised version will appear in ISIT 2022 ",
    "url": "https://arxiv.org/abs/2105.07436",
    "authors": [
      "Wei Cheng",
      "Yi Liu",
      "Sylvain Guilley",
      "Olivier Rioul"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2105.10884",
    "title": "THP: Topological Hawkes Processes for Learning Causal Structure on Event  Sequences",
    "abstract": " Comments: IEEE Transactions on Neural Networks and Learning Systems (TNNLS) ",
    "url": "https://arxiv.org/abs/2105.10884",
    "authors": [
      "Ruichu Cai",
      "Siyu Wu",
      "Jie Qiao",
      "Zhifeng Hao",
      "Keli Zhang",
      "Xi Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.05325",
    "title": "ZoPE: A Fast Optimizer for ReLU Networks with Low-Dimensional Inputs",
    "abstract": " Comments: 14 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2106.05325",
    "authors": [
      "Christopher A. Strong",
      "Sydney M. Katz",
      "Anthony L. Corso",
      "Mykel J. Kochenderfer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2107.05869",
    "title": "Applications of knowledge graphs for food science and industry",
    "abstract": " Comments: 45 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2107.05869",
    "authors": [
      "Weiqing Min",
      "Chunlin Liu",
      "Leyi Xu",
      "Shuqiang Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.12920",
    "title": "Emotion Stimulus Detection in German News Headlines",
    "abstract": " Comments: KONVENS 2021, published at this https URL Please cite by using this https URL ",
    "url": "https://arxiv.org/abs/2107.12920",
    "authors": [
      "Bao Minh Doan Dang",
      "Laura Oberländer",
      "Roman Klinger"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2108.02634",
    "title": "Time-aware Path Reasoning on Knowledge Graph for Recommendation",
    "abstract": " Comments: 27 pages, ACM Transactions on Information Systems (TOIS), accepted ",
    "url": "https://arxiv.org/abs/2108.02634",
    "authors": [
      "Yuyue Zhao",
      "Xiang Wang",
      "Jiawei Chen",
      "Yashen Wang",
      "Wei Tang",
      "Xiangnan He",
      "Haiyong Xie"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2108.04349",
    "title": "AASeg: Attention Aware Network for Real Time Semantic Segmentation",
    "abstract": " Comments: This work makes assumptions which were found wrong later by the author ",
    "url": "https://arxiv.org/abs/2108.04349",
    "authors": [
      "Abhinav Sagar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2108.12944",
    "title": "Selective Differential Privacy for Language Modeling",
    "abstract": " Comments: NAACL 2022 ",
    "url": "https://arxiv.org/abs/2108.12944",
    "authors": [
      "Weiyan Shi",
      "Aiqi Cui",
      "Evan Li",
      "Ruoxi Jia",
      "Zhou Yu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2109.00124",
    "title": "Learning Coated Adversarial Camouflages for Object Detectors",
    "abstract": " Title: Learning Coated Adversarial Camouflages for Object Detectors ",
    "url": "https://arxiv.org/abs/2109.00124",
    "authors": [
      "Yexin Duan",
      "Jialin Chen",
      "Xingyu Zhou",
      "Junhua Zou",
      "Zhengyun He",
      "Jin Zhang",
      "Wu Zhang",
      "Zhisong Pan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.08031",
    "title": "Accurately Modeling Biased Random Walks on Weighted Graphs Using  $\\textit{Node2vec+}$",
    "abstract": " Comments: The final analysis on gene classification in the previous version was incorrect. A bug in the code for GNN evaluation causes the GNN to have access to part of the testing data during training, and thus significantly biased the true testing evaluation for GNNs. A revision will be released that correct for this error will be released shortly ",
    "url": "https://arxiv.org/abs/2109.08031",
    "authors": [
      "Renming Liu",
      "Matthew Hirn",
      "Arjun Krishnan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Molecular Networks (q-bio.MN)"
    ]
  },
  {
    "id": "arXiv:2110.01191",
    "title": "Molformer: Motif-based Roto-Translation Invariant Transformer on 3D  Heterogeneous Molecular Graphs",
    "abstract": " Title: Molformer: Motif-based Roto-Translation Invariant Transformer on 3D  Heterogeneous Molecular Graphs ",
    "url": "https://arxiv.org/abs/2110.01191",
    "authors": [
      "Fang Wu",
      "Qiang Zhang",
      "Dragomir Radev",
      "Jiyu Cui",
      "Wen Zhang",
      "Huabin Xing",
      "Ningyu Zhang",
      "Huajun Chen"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.03663",
    "title": "Quantifying the Suicidal Tendency on Social Media: A Survey",
    "abstract": " Comments: The paper got rejected due to major issues and challenges in the content. This work will be rephrased and submitted with major changes ",
    "url": "https://arxiv.org/abs/2110.03663",
    "authors": [
      "Muskan Garg"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2111.00812",
    "title": "Topology identification of autonomous quantum dynamical networks",
    "abstract": " Comments: 12 pages, 2 figures; v2: misprints corrected and presentation of the results improved with respect to v1 ",
    "url": "https://arxiv.org/abs/2111.00812",
    "authors": [
      "Stefano Gherardini",
      "Henk J. van Waarde",
      "Pietro Tesi",
      "Filippo Caruso"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Mesoscale and Nanoscale Physics (cond-mat.mes-hall)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2111.02272",
    "title": "Convolutional Motif Kernel Networks",
    "abstract": " Title: Convolutional Motif Kernel Networks ",
    "url": "https://arxiv.org/abs/2111.02272",
    "authors": [
      "Jonas C. Ditz",
      "Bernhard Reuter",
      "Nico Pfeifer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.10085",
    "title": "Measuring Vulnerabilities of Malware Detectors with  Explainability-Guided Evasion Attacks",
    "abstract": " Title: Measuring Vulnerabilities of Malware Detectors with  Explainability-Guided Evasion Attacks ",
    "url": "https://arxiv.org/abs/2111.10085",
    "authors": [
      "Ruoxi Sun",
      "Wei Wang",
      "Tian Dong",
      "Shaofeng Li",
      "Minhui Xue",
      "Gareth Tyson",
      "Haojin Zhu",
      "Mingyu Guo",
      "Surya Nepal"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.12011",
    "title": "A note on Matching-Cut in $P_t$-free Graphs",
    "abstract": " Comments: 7 pages, 3 figures; incorporated referees' suggestions ",
    "url": "https://arxiv.org/abs/2111.12011",
    "authors": [
      "Carl Feghali"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2111.12490",
    "title": "Matching Learned Causal Effects of Neural Networks with Domain Priors",
    "abstract": " Comments: Accepted at International Conference on Machine Learning (ICML'22) ",
    "url": "https://arxiv.org/abs/2111.12490",
    "authors": [
      "Sai Srinivas Kancheti",
      "Abbavaram Gowtham Reddy",
      "Vineeth N Balasubramanian",
      "Amit Sharma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.14463",
    "title": "Evolutionary Multitask Optimization: Fundamental Research Questions,  Practices, and Directions for the Future",
    "abstract": " Comments: 13 pages, 4 figures, Submitted to an Elsevier Journal ",
    "url": "https://arxiv.org/abs/2111.14463",
    "authors": [
      "Eneko Osaba",
      "Javier Del Ser",
      "Ponnuthurai N. Suganthan"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2111.15300",
    "title": "TridentAdapt: Learning Domain-invariance via Source-Target Confrontation  and Self-induced Cross-domain Augmentation",
    "abstract": " Title: TridentAdapt: Learning Domain-invariance via Source-Target Confrontation  and Self-induced Cross-domain Augmentation ",
    "url": "https://arxiv.org/abs/2111.15300",
    "authors": [
      "Fengyi Shen",
      "Akhil Gurram",
      "Ahmet Faruk Tuna",
      "Onay Urfalioglu",
      "Alois Knoll"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.01506",
    "title": "Sample Complexity of Robust Reinforcement Learning with a Generative  Model",
    "abstract": " Comments: Published in the International Conference on Artificial Intelligence and Statistics (AISTATS) 2022 ",
    "url": "https://arxiv.org/abs/2112.01506",
    "authors": [
      "Kishan Panaganti",
      "Dileep Kalathil"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.04564",
    "title": "CoSSL: Co-Learning of Representation and Classifier for Imbalanced  Semi-Supervised Learning",
    "abstract": " Comments: Published at CVPR 2022 as a conference paper. Code at this https URL ",
    "url": "https://arxiv.org/abs/2112.04564",
    "authors": [
      "Yue Fan",
      "Dengxin Dai",
      "Bernt Schiele"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.06238",
    "title": "HerosNet: Hyperspectral Explicable Reconstruction and Optimal Sampling  Deep Network for Snapshot Compressive Imaging",
    "abstract": " Comments: CVPR2022 ",
    "url": "https://arxiv.org/abs/2112.06238",
    "authors": [
      "Xuanyu Zhang",
      "Yongbing Zhang",
      "Ruiqin Xiong",
      "Qilin Sun",
      "Jian Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2112.06667",
    "title": "Long-Term Benefits of Network Boosters for Renewables Integration and  Corrective Grid Security",
    "abstract": " Comments: Preprint submitted to International Journal of Electrical Power & Energy Systems ",
    "url": "https://arxiv.org/abs/2112.06667",
    "authors": [
      "Amin Shokri Gazafroudi",
      "Elisabeth Zeyen",
      "Martha Frysztacki",
      "Fabian Neumann",
      "Tom Brown"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2112.08596",
    "title": "Guiding Neural Story Generation with Reader Models",
    "abstract": " Title: Guiding Neural Story Generation with Reader Models ",
    "url": "https://arxiv.org/abs/2112.08596",
    "authors": [
      "Xiangyu Peng",
      "Kaige Xie",
      "Amal Alabdulkarim",
      "Harshith Kayam",
      "Samihan Dani",
      "Mark O. Riedl"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2112.08598",
    "title": "FIgLib & SmokeyNet: Dataset and Deep Learning Model for Real-Time  Wildland Fire Smoke Detection",
    "abstract": " Title: FIgLib & SmokeyNet: Dataset and Deep Learning Model for Real-Time  Wildland Fire Smoke Detection ",
    "url": "https://arxiv.org/abs/2112.08598",
    "authors": [
      "Anshuman Dewangan",
      "Yash Pande",
      "Hans-Werner Braun",
      "Frank Vernon",
      "Ismael Perez",
      "Ilkay Altintas",
      "Garrison W. Cottrell",
      "Mai H. Nguyen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.12342",
    "title": "Error-Correcting Neural Networks for Two-Dimensional Curvature  Computation in the Level-Set Method",
    "abstract": " Title: Error-Correcting Neural Networks for Two-Dimensional Curvature  Computation in the Level-Set Method ",
    "url": "https://arxiv.org/abs/2201.12342",
    "authors": [
      "Luis Ángel Larios-Cárdenas",
      "Frédéric Gibou"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.01059",
    "title": "PINNs and GaLS: A Priori Error Estimates for Shallow Physics Informed  Neural Networks Applied to Elliptic Problems",
    "abstract": " Comments: This work has been accepted at MathMOD ",
    "url": "https://arxiv.org/abs/2202.01059",
    "authors": [
      "Umberto Zerbinati"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2202.01123",
    "title": "An ASP approach for reasoning on neural networks under a finitely  many-valued semantics for weighted conditional knowledge bases",
    "abstract": " Comments: Paper presented at the 38th International Conference on Logic Programming (ICLP 2022), 16 pages ",
    "url": "https://arxiv.org/abs/2202.01123",
    "authors": [
      "Laura Giordano",
      "Daniele Theseider Dupré"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.02394",
    "title": "JARVix at SemEval-2022 Task 2: It Takes One to Know One? Idiomaticity  Detection using Zero and One Shot Learning",
    "abstract": " Comments: Accepted at the 16th International Workshop on Semantic Evaluation (SemEval-2022), ACL. Best Project Award for Georgia Tech CS 7650. Code available at this https URL ",
    "url": "https://arxiv.org/abs/2202.02394",
    "authors": [
      "Yash Jakhotiya",
      "Vaibhav Kumar",
      "Ashwin Pathak",
      "Raj Shah"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.02684",
    "title": "On the Multi-View Information Bottleneck Representation",
    "abstract": " Title: On the Multi-View Information Bottleneck Representation ",
    "url": "https://arxiv.org/abs/2202.02684",
    "authors": [
      "Teng-Hui Huang",
      "Aly El Gamal",
      "Hesham El Gamal"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2202.03129",
    "title": "Over-the-Air Ensemble Inference with Model Privacy",
    "abstract": " Comments: To appear in IEEE International Symposium on Information Theory (ISIT) 2022 ",
    "url": "https://arxiv.org/abs/2202.03129",
    "authors": [
      "Selim F. Yilmaz",
      "Burak Hasircioglu",
      "Deniz Gunduz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2202.03195",
    "title": "More is Better (Mostly): On the Backdoor Attacks in Federated Graph  Neural Networks",
    "abstract": " Comments: 17 pages, 13 figures ",
    "url": "https://arxiv.org/abs/2202.03195",
    "authors": [
      "Jing Xu",
      "Rui Wang",
      "Stefanos Koffas",
      "Kaitai Liang",
      "Stjepan Picek"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03352",
    "title": "Analog Secure Distributed Matrix Multiplication over Complex Numbers",
    "abstract": " Comments: 13 pages, 2 figures. To appear in ISIT 2022 ",
    "url": "https://arxiv.org/abs/2202.03352",
    "authors": [
      "Okko Makkonen",
      "Camilla Hollanti"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2202.04258",
    "title": "A Data-Driven Approach to Robust Hypothesis Testing Using Sinkhorn  Uncertainty Sets",
    "abstract": " Comments: 22 pages, 7 figures, accepted in ISIT-22 ",
    "url": "https://arxiv.org/abs/2202.04258",
    "authors": [
      "Jie Wang",
      "Yao Xie"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.05338",
    "title": "Accountability in an Algorithmic Society: Relationality, Responsibility,  and Robustness in Machine Learning",
    "abstract": " Title: Accountability in an Algorithmic Society: Relationality, Responsibility,  and Robustness in Machine Learning ",
    "url": "https://arxiv.org/abs/2202.05338",
    "authors": [
      "A. Feder Cooper",
      "Emanuel Moss",
      "Benjamin Laufer",
      "Helen Nissenbaum"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.07342",
    "title": "Unreasonable Effectiveness of Last Hidden Layer Activations for  Adversarial Robustness",
    "abstract": " Comments: IEEE COMPSAC 2022 publication full version ",
    "url": "https://arxiv.org/abs/2202.07342",
    "authors": [
      "Omer Faruk Tuna",
      "Ferhat Ozgur Catak",
      "M. Taner Eskil"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.07427",
    "title": "On the Complementarity of Images and Text for the Expression of Emotions  in Social Media",
    "abstract": " Comments: WASSA 2022 at ACL 2022, published at this https URL Please cite using this https URL ",
    "url": "https://arxiv.org/abs/2202.07427",
    "authors": [
      "Anna Khlyzova",
      "Carina Silberer",
      "Roman Klinger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2202.10793",
    "title": "PyTorch Geometric Signed Directed: A Survey and Software on Graph Neural  Networks for Signed and Directed Graphs",
    "abstract": " Comments: 11 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2202.10793",
    "authors": [
      "Yixuan He",
      "Xitong Zhang",
      "Junjie Huang",
      "Benedek Rozemberczki",
      "Mihai Cucuringu",
      "Gesine Reinert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2202.11946",
    "title": "Temporal Efficient Training of Spiking Neural Network via Gradient  Re-weighting",
    "abstract": " Comments: Published as a conference paper at ICLR 2022 ",
    "url": "https://arxiv.org/abs/2202.11946",
    "authors": [
      "Shikuang Deng",
      "Yuhang Li",
      "Shanghang Zhang",
      "Shi Gu"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.03931",
    "title": "PASS: Part-Aware Self-Supervised Pre-Training for Person  Re-Identification",
    "abstract": " Title: PASS: Part-Aware Self-Supervised Pre-Training for Person  Re-Identification ",
    "url": "https://arxiv.org/abs/2203.03931",
    "authors": [
      "Kuan Zhu",
      "Haiyun Guo",
      "Tianyi Yan",
      "Yousong Zhu",
      "Jinqiao Wang",
      "Ming Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.06317",
    "title": "Towards Equal Opportunity Fairness through Adversarial Learning",
    "abstract": " Comments: 8 pages ",
    "url": "https://arxiv.org/abs/2203.06317",
    "authors": [
      "Xudong Han",
      "Timothy Baldwin",
      "Trevor Cohn"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.06803",
    "title": "Learning Markov Games with Adversarial Opponents: Efficient Algorithms  and Fundamental Limits",
    "abstract": " Title: Learning Markov Games with Adversarial Opponents: Efficient Algorithms  and Fundamental Limits ",
    "url": "https://arxiv.org/abs/2203.06803",
    "authors": [
      "Qinghua Liu",
      "Yuanhao Wang",
      "Chi Jin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.10926",
    "title": "3D Multi-Object Tracking Using Graph Neural Networks with Cross-Edge  Modality Attention",
    "abstract": " Comments: 12 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2203.10926",
    "authors": [
      "Martin Buchner",
      "Abhinav Valada"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.11740",
    "title": "Plasticity Neural Network Based on Astrocytic Influence at Critical  Period, Synaptic Competition and Compensation by Current and Mnemonic Brain  Plasticity and Synapse Formation",
    "abstract": " Title: Plasticity Neural Network Based on Astrocytic Influence at Critical  Period, Synaptic Competition and Compensation by Current and Mnemonic Brain  Plasticity and Synapse Formation ",
    "url": "https://arxiv.org/abs/2203.11740",
    "authors": [
      "Jun-Bo Tao",
      "Bai-Qing Sun",
      "Wei-Dong Zhu",
      "Shi-You Qu",
      "Ling-Kun Chen",
      "Jia-Qiang Li",
      "Chong Wu",
      "Yu Xiong",
      "Jiaxuan Zhou"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.13471",
    "title": "Non-Probability Sampling Network for Stochastic Human Trajectory  Prediction",
    "abstract": " Comments: Accepted at CVPR 2022 ",
    "url": "https://arxiv.org/abs/2203.13471",
    "authors": [
      "Inhwan Bae",
      "Jin-Hwi Park",
      "Hae-Gon Jeon"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.01702",
    "title": "Personalized Prediction of Future Lesion Activity and Treatment Effect  in Multiple Sclerosis from Baseline MRI",
    "abstract": " Comments: Accepted to MIDL 2022 ",
    "url": "https://arxiv.org/abs/2204.01702",
    "authors": [
      "Joshua Durso-Finley",
      "Jean-Pierre R. Falet",
      "Brennan Nichyporuk",
      "Douglas L. Arnold",
      "Tal Arbel"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.01795",
    "title": "Lightweight HDR Camera ISP for Robust Perception in Dynamic Illumination  Conditions via Fourier Adversarial Networks",
    "abstract": " Comments: Accepted in BMVC 2021 ",
    "url": "https://arxiv.org/abs/2204.01795",
    "authors": [
      "Pranjay Shyam",
      "Sandeep Singh Sengar",
      "Kuk-Jin Yoon",
      "Kyung-Soo Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.04046",
    "title": "KCD: Knowledge Walks and Textual Cues Enhanced Political Perspective  Detection in News Media",
    "abstract": " Comments: accepted at NAACL 2022 main conference ",
    "url": "https://arxiv.org/abs/2204.04046",
    "authors": [
      "Wenqian Zhang",
      "Shangbin Feng",
      "Zilong Chen",
      "Zhenyu Lei",
      "Jundong Li",
      "Minnan Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.07532",
    "title": "Accurate ADMET Prediction with XGBoost",
    "abstract": " Title: Accurate ADMET Prediction with XGBoost ",
    "url": "https://arxiv.org/abs/2204.07532",
    "authors": [
      "Hao Tian",
      "Rajas Ketkar",
      "Peng Tao"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2204.09532",
    "title": "Gaussian mixture modeling of nodes in Bayesian network according to  maximal parental cliques",
    "abstract": " Comments: 22 pages 6 figures ",
    "url": "https://arxiv.org/abs/2204.09532",
    "authors": [
      "Yiran Dong",
      "Chuanhou Gao"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.11406",
    "title": "Robust Self-Augmentation for Named Entity Recognition with Meta  Reweighting",
    "abstract": " Comments: Accepted by NAACL 2022 ",
    "url": "https://arxiv.org/abs/2204.11406",
    "authors": [
      "Linzhi Wu",
      "Pengjun Xie",
      "Jie Zhou",
      "Meishan Zhang",
      "Chunping Ma",
      "Guangwei Xu",
      "Min Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.12063",
    "title": "A Review-aware Graph Contrastive Learning Framework for Recommendation",
    "abstract": " Comments: Accepted by SIGIR 2022 ",
    "url": "https://arxiv.org/abs/2204.12063",
    "authors": [
      "Jie Shuai",
      "Kun Zhang",
      "Le Wu",
      "Peijie Sun",
      "Richang Hong",
      "Meng Wang",
      "Yong Li"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2204.12533",
    "title": "A Gaussian Process Model for Opponent Prediction in Autonomous Racing",
    "abstract": " Comments: A version of this work was accepted as a contributed paper at the 2022 ICRA 2nd Workshop on Opportunities and Challenges with Autonomous Racing ",
    "url": "https://arxiv.org/abs/2204.12533",
    "authors": [
      "Finn Lukas Busch",
      "Jake Johnson",
      "Edward L. Zhu",
      "Francesco Borrelli"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2205.00301",
    "title": "ONCE-3DLanes: Building Monocular 3D Lane Detection",
    "abstract": " Comments: CVPR 2022. Project page at this https URL ",
    "url": "https://arxiv.org/abs/2205.00301",
    "authors": [
      "Fan Yan",
      "Ming Nie",
      "Xinyue Cai",
      "Jianhua Han",
      "Hang Xu",
      "Zhen Yang",
      "Chaoqiang Ye",
      "Yanwei Fu",
      "Michael Bi Mi",
      "Li Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.01287",
    "title": "SemAttack: Natural Textual Attacks via Different Semantic Spaces",
    "abstract": " Comments: Published at Findings of NAACL 2022 ",
    "url": "https://arxiv.org/abs/2205.01287",
    "authors": [
      "Boxin Wang",
      "Chejian Xu",
      "Xiangyu Liu",
      "Yu Cheng",
      "Bo Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.02741",
    "title": "CE-based white-box adversarial attacks will not work using super-fitting",
    "abstract": " Title: CE-based white-box adversarial attacks will not work using super-fitting ",
    "url": "https://arxiv.org/abs/2205.02741",
    "authors": [
      "Youhuan Yang",
      "Lei Sun",
      "Leyu Dai",
      "Song Guo",
      "Xiuqing Mao",
      "Xiaoqin Wang",
      "Bayi Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.02743",
    "title": "Rethinking Classifier and Adversarial Attack",
    "abstract": " Title: Rethinking Classifier and Adversarial Attack ",
    "url": "https://arxiv.org/abs/2205.02743",
    "authors": [
      "Youhuan Yang",
      "Lei Sun",
      "Leyu Dai",
      "Song Guo",
      "Xiuqing Mao",
      "Xiaoqin Wang",
      "Bayi Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.02848",
    "title": "Building Brains: Subvolume Recombination for Data Augmentation in Large  Vessel Occlusion Detection",
    "abstract": " Comments: PrePrint - Accepted at MICCAI 2022 ",
    "url": "https://arxiv.org/abs/2205.02848",
    "authors": [
      "Florian Thamm",
      "Oliver Taubmann",
      "Markus Jürgens",
      "Aleksandra Thamm",
      "Felix Denzinger",
      "Leonhard Rist",
      "Hendrik Ditt",
      "Andreas Maier"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.03752",
    "title": "Efficient Representation of Large-Alphabet Probability Distributions",
    "abstract": " Comments: corrected typos ",
    "url": "https://arxiv.org/abs/2205.03752",
    "authors": [
      "Aviv Adler",
      "Jennifer Tang",
      "Yury Polyanskiy"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2205.03852",
    "title": "Randomized geometric tools for anomaly detection in stock markets",
    "abstract": " Comments: 39 pages, 14 figures, 9 tables ",
    "url": "https://arxiv.org/abs/2205.03852",
    "authors": [
      "Cyril Bachelard",
      "Apostolos Chalkis",
      "Vissarion Fisikopoulos",
      "Elias Tsigaridas"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "General Economics (econ.GN)",
      "Applications (stat.AP)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:2205.04300",
    "title": "Multi-modal Semantic SLAM for Complex Dynamic Environments",
    "abstract": " Title: Multi-modal Semantic SLAM for Complex Dynamic Environments ",
    "url": "https://arxiv.org/abs/2205.04300",
    "authors": [
      "Han Wang",
      "Jing Ying Ko",
      "Lihua Xie"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2205.05467",
    "title": "A Continual Deepfake Detection Benchmark: Dataset, Methods, and  Essentials",
    "abstract": " Comments: some typos are corrected ",
    "url": "https://arxiv.org/abs/2205.05467",
    "authors": [
      "Chuqiao Li",
      "Zhiwu Huang",
      "Danda Pani Paudel",
      "Yabin Wang",
      "Mohamad Shahbazi",
      "Xiaopeng Hong",
      "Luc Van Gool"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.05980",
    "title": "\"Teaching Independent Parts Separately\"(TIPSy-GAN) : Improving Accuracy  and Stability in Unsupervised Adversarial 2D to 3D Human Pose Estimation",
    "abstract": " Title: \"Teaching Independent Parts Separately\"(TIPSy-GAN) : Improving Accuracy  and Stability in Unsupervised Adversarial 2D to 3D Human Pose Estimation ",
    "url": "https://arxiv.org/abs/2205.05980",
    "authors": [
      "Peter Hardy",
      "Srinandan Dasmahapatra",
      "Hansung Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.06226",
    "title": "The Mechanism of Prediction Head in Non-contrastive Self-supervised  Learning",
    "abstract": " Comments: 88 pages, comments welcome ",
    "url": "https://arxiv.org/abs/2205.06226",
    "authors": [
      "Zixin Wen",
      "Yuanzhi Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.06468",
    "title": "Monocular Human Digitization via Implicit Re-projection Networks",
    "abstract": " Comments: Presented at CVRRW (AI for Content Creation workshop) 2022 ",
    "url": "https://arxiv.org/abs/2205.06468",
    "authors": [
      "Min-Gyu Park",
      "Ju-Mi Kang",
      "Je Woo Kim",
      "Ju Hong Yoon"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.06661",
    "title": "FLAD: Adaptive Federated Learning for DDoS Attack Detection",
    "abstract": " Title: FLAD: Adaptive Federated Learning for DDoS Attack Detection ",
    "url": "https://arxiv.org/abs/2205.06661",
    "authors": [
      "Roberto Doriguzzi-Corin",
      "Domenico Siracusa"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  }
]