[
  {
    "id": "arXiv:2111.03687",
    "title": "AI and Blackness: Towards moving beyond bias and representation",
    "abstract": "In this paper, we argue that AI ethics must move beyond the concepts of race-based representation and bias, and towards those that probe the deeper relations that impact how these systems are designed, developed, and deployed. Many recent discussions on ethical considerations of bias in AI systems have centered on racial bias. We contend that antiblackness in AI requires more of an examination of the ontological space that provides a foundation for the design, development, and deployment of AI systems. We examine what this contention means from the perspective of the sociocultural context in which AI systems are designed, developed, and deployed and focus on intersections with anti-Black racism (antiblackness). To bring these multiple perspectives together and show an example of antiblackness in the face of attempts at de-biasing, we discuss results from auditing an existing open-source semantic network (ConceptNet). We use this discussion to further contextualize antiblackness in design, development, and deployment of AI systems and suggest questions one may ask when attempting to combat antiblackness in AI systems. ",
    "url": "https://arxiv.org/abs/2111.03687",
    "authors": [
      "Christopher L. Dancy",
      "P. Khalil Saucier"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.03693",
    "title": "Disaster mapping from satellites: damage detection with crowdsourced  point labels",
    "abstract": "High-resolution satellite imagery available immediately after disaster events is crucial for response planning as it facilitates broad situational awareness of critical infrastructure status such as building damage, flooding, and obstructions to access routes. Damage mapping at this scale would require hundreds of expert person-hours. However, a combination of crowdsourcing and recent advances in deep learning reduces the effort needed to just a few hours in real time. Asking volunteers to place point marks, as opposed to shapes of actual damaged areas, significantly decreases the required analysis time for response during the disaster. However, different volunteers may be inconsistent in their marking. This work presents methods for aggregating potentially inconsistent damage marks to train a neural network damage detector. ",
    "url": "https://arxiv.org/abs/2111.03693",
    "authors": [
      "Danil Kuzin",
      "Olga Isupova",
      "Brooke D. Simmons",
      "Steven Reece"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2111.03706",
    "title": "Inferring untrained complex dynamics of delay systems using an adapted  echo state network",
    "abstract": "Caused by finite signal propagation velocities, many complex systems feature time delays that may induce high-dimensional chaotic behavior and make forecasting intricate. Here, we propose an echo state network adaptable to the physics of systems with arbitrary delays. After training the network to forecast a system with a unique and sufficiently long delay, it already learned to predict the system dynamics for all other delays. A simple adaptation of the network's topology allows us to infer untrained features such as high-dimensional chaotic attractors, bifurcations, and even multistabilities, that emerge with shorter and longer delays. Thus, the fusion of physical knowledge of the delay system and data-driven machine learning yields a model with high generalization capabilities and unprecedented prediction accuracy. ",
    "url": "https://arxiv.org/abs/2111.03706",
    "authors": [
      "Mirko Goldmann",
      "Claudio R. Mirasso",
      "Ingo Fischer",
      "Miguel C. Soriano"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Adaptation and Self-Organizing Systems (nlin.AO)"
    ]
  },
  {
    "id": "arXiv:2111.03777",
    "title": "Privacy attacks for automatic speech recognition acoustic models in a  federated learning framework",
    "abstract": "This paper investigates methods to effectively retrieve speaker information from the personalized speaker adapted neural network acoustic models (AMs) in automatic speech recognition (ASR). This problem is especially important in the context of federated learning of ASR acoustic models where a global model is learnt on the server based on the updates received from multiple clients. We propose an approach to analyze information in neural network AMs based on a neural network footprint on the so-called Indicator dataset. Using this method, we develop two attack models that aim to infer speaker identity from the updated personalized models without access to the actual users' speech data. Experiments on the TED-LIUM 3 corpus demonstrate that the proposed approaches are very effective and can provide equal error rate (EER) of 1-2%. ",
    "url": "https://arxiv.org/abs/2111.03777",
    "authors": [
      "Natalia Tomashenko",
      "Salima Mdhaffar",
      "Marc Tommasi",
      "Yannick Estève",
      "Jean-François Bonastre"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2111.03845",
    "title": "Multi-modal land cover mapping of remote sensing images using pyramid  attention and gated fusion networks",
    "abstract": "Multi-modality data is becoming readily available in remote sensing (RS) and can provide complementary information about the Earth's surface. Effective fusion of multi-modal information is thus important for various applications in RS, but also very challenging due to large domain differences, noise, and redundancies. There is a lack of effective and scalable fusion techniques for bridging multiple modality encoders and fully exploiting complementary information. To this end, we propose a new multi-modality network (MultiModNet) for land cover mapping of multi-modal remote sensing data based on a novel pyramid attention fusion (PAF) module and a gated fusion unit (GFU). The PAF module is designed to efficiently obtain rich fine-grained contextual representations from each modality with a built-in cross-level and cross-view attention fusion mechanism, and the GFU module utilizes a novel gating mechanism for early merging of features, thereby diminishing hidden redundancies and noise. This enables supplementary modalities to effectively extract the most valuable and complementary information for late feature fusion. Extensive experiments on two representative RS benchmark datasets demonstrate the effectiveness, robustness, and superiority of the MultiModNet for multi-modal land cover classification. ",
    "url": "https://arxiv.org/abs/2111.03845",
    "authors": [
      "Qinghui Liu",
      "Michael Kampffmeyer",
      "Robert Jenssen",
      "Arnt-Børre Salberg"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2111.03898",
    "title": "Rapid mixing of the hardcore Glauber dynamics and other Markov chains in  bounded-treewidth graphs",
    "abstract": "We give a new rapid mixing result for a natural random walk on the independent sets of an input graph $G$. Rapid mixing is of interest in approximately sampling a structure, over some underlying set or graph, from some target distribution. In the case of independent sets, we show that when $G$ has bounded treewidth, this random walk -- known as the hardcore Glauber dynamics -- mixes rapidly for all values of the standard parameter $\\lambda > 0$, giving a simple alternative to existing sampling algorithms for these structures. We also show rapid mixing for Markov chains on dominating sets and $b$-edge covers (for fixed $b\\geq 1$ and $\\lambda > 0$) in the case where treewidth is bounded, and for Markov chains on the $b$-matchings (for fixed $b \\geq 1$ and $\\lambda > 0$), the maximal independent sets, and the maximal $b$-matchings of a graph (for fixed $b \\geq 1$), in the case where carving width is bounded. We prove our results by developing a divide-and-conquer framework using the well-known multicommodity flows technique. Using this technique, we additionally show that a similar dynamics on the $k$-angulations of a convex set of $n$ points mixes in quasipolynomial time for all $k \\geq 3$. (McShine and Tetali gave a stronger result in the special case $k = 3$.) Our technique also allows us to strengthen existing results by Dyer, Goldberg, and Jerrum and by Heinrich for the Glauber dynamics on the $q$-colorings of $G$ on graphs of bounded carving width, when $q \\geq \\Delta + 2$ is bounded. Specifically, our technique yields an improvement in the dependence on treewidth when $\\Delta < 2t$ or when $q < 4t$ and $\\Delta < t^2$. We additionally show that the Glauber dynamics on the partial $q$-colorings of $G$ mix rapidly for all $\\lambda > 0$ when $q \\geq \\Delta + 2$ is bounded. ",
    "url": "https://arxiv.org/abs/2111.03898",
    "authors": [
      "David Eppstein",
      "Daniel Frishberg"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2111.03899",
    "title": "Planning for net zero by 2050, what HVAC system interventions will  today's code minimum commercial buildings require?",
    "abstract": "Heating, Ventilation and Air conditioning (HVAC) systems account for approximately 40% of the total energy used by buildings in the USA. To reduce this consumption States enforce minimum energy codes that currently range from strict (ASHRAE 90.1-2016) to relaxed (ASHRAE 90.1-2007) with some states following no particular standard. To reach as close as possible to net zero carbon and energy, each statewide energy code requires different levels of interventions for each code minimum building. This paper presents a collection of potential HVAC retrofits to transition each State's current code minimum buildings towards the goal of net zero to achieve a carbon free future by 2050. The study shall use a large array of code minimum criteria and climate zones covering the 48 contiguous United States to determine the most successful interventions at reducing the energy use of buildings meeting today's energy codes. Office use type has been selected for the study as they account for 18% of total buildings and close to 19% of the total commercial floorspace. A number of interventions will be applied to this use type that will vary based on current code and climate zone; however, a common theme will be electrification through the use of heat pump technology. Each intervention will be scored based on energy and carbon savings, along with level of difficulty and cost. The study not only provides a comprehensive transition guideline toward the net zero energy and carbon but also predicts the future project opportunities. ",
    "url": "https://arxiv.org/abs/2111.03899",
    "authors": [
      "Patrick Pease",
      "Jayati Chhabra",
      "Zahra Zolfaghari"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2111.03904",
    "title": "On pseudo-absence generation and machine learning for locust breeding  ground prediction in Africa",
    "abstract": "Desert locust outbreaks threaten the food security of a large part of Africa and have affected the livelihoods of millions of people over the years. Machine learning (ML) has been demonstrated as an effective approach to locust distribution modelling which could assist in early warning. ML requires a significant amount of labelled data to train. Most publicly available labelled data on locusts are presence-only data, where only the sightings of locusts being present at a location are recorded. Therefore, prior work using ML have resorted to pseudo-absence generation methods as a way to circumvent this issue. The most commonly used approach is to randomly sample points in a region of interest while ensuring that these sampled pseudo-absence points are at least a specific distance away from true presence points. In this paper, we compare this random sampling approach to more advanced pseudo-absence generation methods, such as environmental profiling and optimal background extent limitation, specifically for predicting desert locust breeding grounds in Africa. Interestingly, we find that for the algorithms we tested, namely logistic regression, gradient boosting, random forests and maximum entropy, all popular in prior work, the logistic model performed significantly better than the more sophisticated ensemble methods, both in terms of prediction accuracy and F1 score. Although background extent limitation combined with random sampling boosted performance for ensemble methods, for LR this was not the case, and instead, a significant improvement was obtained when using environmental profiling. In light of this, we conclude that a simpler ML approach such as logistic regression combined with more advanced pseudo-absence generation, specifically environmental profiling, can be a sensible and effective approach to predicting locust breeding grounds across Africa. ",
    "url": "https://arxiv.org/abs/2111.03904",
    "authors": [
      "Ibrahim Salihu Yusuf",
      "Kale-ab Tessera",
      "Thomas Tumiel",
      "Sella Nevo",
      "Arnu Pretorius"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2111.03971",
    "title": "Towards noise robust trigger-word detection with contrastive learning  pre-task for fast on-boarding of new trigger-words",
    "abstract": "Trigger-word detection plays an important role as the entry point of user's communication with voice assistants. But supporting a particular word as a trigger-word involves huge amount of data collection, augmentation and labelling for that word. This makes supporting new trigger-words a tedious and time consuming process. To combat this, we explore the use of contrastive learning as a pre-training task that helps the detection model to generalize to different words and noise conditions. We explore supervised contrastive techniques and also propose a self-supervised technique using chunked words from long sentence audios. We show that the contrastive pre-training techniques have comparable results to a traditional classification pre-training on new trigger words with less data availability. ",
    "url": "https://arxiv.org/abs/2111.03971",
    "authors": [
      "Sivakumar Balasubramanian",
      "Aditya Jajodia",
      "Gowtham Srinivasan"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2111.04066",
    "title": "Fast sampling via spectral independence beyond bounded-degree graphs",
    "abstract": "Spectral independence is a recently-developed framework for obtaining sharp bounds on the convergence time of the classical Glauber dynamics. This new framework has yielded optimal $O(n \\log n)$ sampling algorithms on bounded-degree graphs for a large class of problems throughout the so-called uniqueness regime, including, for example, the problems of sampling independent sets, matchings, and Ising-model configurations. Our main contribution is to relax the bounded-degree assumption that has so far been important in establishing and applying spectral independence. Previous methods for avoiding degree bounds rely on using $L^p$-norms to analyse contraction on graphs with bounded connective constant (Sinclair, Srivastava, Yin; FOCS'13). The non-linearity of $L^p$-norms is an obstacle to applying these results to bound spectral independence. Our solution is to capture the $L^p$-analysis recursively by amortising over the subtrees of the recurrence used to analyse contraction. Our method generalises previous analyses that applied only to bounded-degree graphs. As a main application of our techniques, we consider the random graph $G(n,d/n)$, where the previously known algorithms run in time $n^{O(\\log d)}$ or applied only to large $d$. We refine these algorithmic bounds significantly, and develop fast $n^{1+o(1)}$ algorithms based on Glauber dynamics that apply to all $d$, throughout the uniqueness regime. ",
    "url": "https://arxiv.org/abs/2111.04066",
    "authors": [
      "Ivona Bezáková",
      "Andreas Galanis",
      "Leslie Ann Goldberg",
      "Daniel Štefankovič"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2111.04099",
    "title": "Developing neural machine translation models for Hungarian-English",
    "abstract": "I train models for the task of neural machine translation for English-Hungarian and Hungarian-English, using the Hunglish2 corpus. The main contribution of this work is evaluating different data augmentation methods during the training of NMT models. I propose 5 different augmentation methods that are structure-aware, meaning that instead of randomly selecting words for blanking or replacement, the dependency tree of sentences is used as a basis for augmentation. I start my thesis with a detailed literature review on neural networks, sequential modeling, neural machine translation, dependency parsing and data augmentation. After a detailed exploratory data analysis and preprocessing of the Hunglish2 corpus, I perform experiments with the proposed data augmentation techniques. The best model for Hungarian-English achieves a BLEU score of 33.9, while the best model for English-Hungarian achieves a BLEU score of 28.6. ",
    "url": "https://arxiv.org/abs/2111.04099",
    "authors": [
      "Attila Nagy"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.04113",
    "title": "Stable Lifelong Learning: Spiking neurons as a solution to instability  in plastic neural networks",
    "abstract": "Synaptic plasticity poses itself as a powerful method of self-regulated unsupervised learning in neural networks. A recent resurgence of interest has developed in utilizing Artificial Neural Networks (ANNs) together with synaptic plasticity for intra-lifetime learning. Plasticity has been shown to improve the learning capabilities of these networks in generalizing to novel environmental circumstances. However, the long-term stability of these trained networks has yet to be examined. This work demonstrates that utilizing plasticity together with ANNs leads to instability beyond the pre-specified lifespan used during training. This instability can lead to the dramatic decline of reward seeking behavior, or quickly lead to reaching environment terminal states. This behavior is shown to hold consistent for several plasticity rules on two different environments across many training time-horizons: a cart-pole balancing problem and a quadrupedal locomotion problem. We present a solution to this instability through the use of spiking neurons. ",
    "url": "https://arxiv.org/abs/2111.04113",
    "authors": [
      "Samuel Schmidgall",
      "Joe Hays"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2111.04330",
    "title": "Characterizing the adversarial vulnerability of speech self-supervised  learning",
    "abstract": "A leaderboard named Speech processing Universal PERformance Benchmark (SUPERB), which aims at benchmarking the performance of a shared self-supervised learning (SSL) speech model across various downstream speech tasks with minimal modification of architectures and small amount of data, has fueled the research for speech representation learning. The SUPERB demonstrates speech SSL upstream models improve the performance of various downstream tasks through just minimal adaptation. As the paradigm of the self-supervised learning upstream model followed by downstream tasks arouses more attention in the speech community, characterizing the adversarial robustness of such paradigm is of high priority. In this paper, we make the first attempt to investigate the adversarial vulnerability of such paradigm under the attacks from both zero-knowledge adversaries and limited-knowledge adversaries. The experimental results illustrate that the paradigm proposed by SUPERB is seriously vulnerable to limited-knowledge adversaries, and the attacks generated by zero-knowledge adversaries are with transferability. The XAB test verifies the imperceptibility of crafted adversarial attacks. ",
    "url": "https://arxiv.org/abs/2111.04330",
    "authors": [
      "Haibin Wu",
      "Bo Zheng",
      "Xu Li",
      "Xixin Wu",
      "Hung-yi Lee",
      "Helen Meng"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2111.04367",
    "title": "Sequence pairs related to produced graphs from a method for dividing a  natural number by two",
    "abstract": "This paper is about producing a new kind of the pairs which we call it MS-pairs. To produce these pairs, we use an algorithm for dividing a natural number $x$ by two for two arbitrary numbers and consider their related graphs. We present some applications of these pairs that show their interesting properties such as unpredictability, irreversible, aperiodicity and chaotic behavior. ",
    "url": "https://arxiv.org/abs/2111.04367",
    "authors": [
      "Mohammad Zeynali Azim",
      "Saeid Alikhani",
      "Babak Anari"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2111.04398",
    "title": "Sub-realtime simulation of a neuronal network of natural density",
    "abstract": "Full scale simulations of neuronal network models of the brain are challenging due to the high density of connections between neurons. This contribution reports run times shorter than the simulated span of biological time for a full scale model of the local cortical microcircuit with explicit representation of synapses on a recent conventional compute node. Realtime performance is relevant for robotics and closed-loop applications while sub-realtime is desirable for the study of learning and development in the brain, processes extending over hours and days of biological time. ",
    "url": "https://arxiv.org/abs/2111.04398",
    "authors": [
      "Anno C. Kurth",
      "Johanna Senk",
      "Dennis Terhorst",
      "Justin Finnerty",
      "Markus Diesmann"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2111.04431",
    "title": "Inverting the discrete curl operator: a novel graph algorithm to find a  vector potential of a given vector field",
    "abstract": "We provide a novel framework to compute a discrete vector potential of a given discrete vector field on arbitrary polyhedral meshes. The framework exploits the concept of acyclic matching, a combinatorial tool at the core of discrete Morse theory. We introduce the new concept of complete acyclic matchings and we show that they give the same end result of Gaussian elimination. Basically, instead of doing costly row and column operations on a sparse matrix, we compute equivalent cheap combinatorial operations that preserve the underlying sparsity structure. Currently, the most efficient algorithms proposed in literature to find discrete vector potentials make use of tree-cotree techniques. We show that they compute a special type of complete acyclic matchings. Moreover, we show that the problem of computing them is equivalent to the problem of deciding whether a given mesh has a topological property called collapsibility. This fact gives a topological characterization of well-known termination problems of tree-cotree techniques. We propose a new recursive algorithm to compute discrete vector potentials. It works directly on basis elements of $1$- and $2$-chains by performing elementary Gaussian operations on them associated with acyclic matchings. However, the main novelty is that it can be applied recursively. Indeed, the recursion process allows us to sidetrack termination problems of the standard tree-cotree techniques. We tested the algorithm on pathological triangulations with known topological obstructions. In all tested problems we observe linear computational complexity as a function of mesh size. Moreover, the algorithm is purely graph-based so it is straightforward to implement and does not require specialized external procedures. We believe that our framework could offer new perspectives to sparse matrix computations. ",
    "url": "https://arxiv.org/abs/2111.04431",
    "authors": [
      "Silvano Pitassi",
      "Riccardo Ghiloni",
      "Ruben Specogna"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2111.04682",
    "title": "SMU: smooth activation function for deep networks using smoothing  maximum technique",
    "abstract": "Deep learning researchers have a keen interest in proposing two new novel activation functions which can boost network performance. A good choice of activation function can have significant consequences in improving network performance. A handcrafted activation is the most common choice in neural network models. ReLU is the most common choice in the deep learning community due to its simplicity though ReLU has some serious drawbacks. In this paper, we have proposed a new novel activation function based on approximation of known activation functions like Leaky ReLU, and we call this function Smooth Maximum Unit (SMU). Replacing ReLU by SMU, we have got 6.22% improvement in the CIFAR100 dataset with the ShuffleNet V2 model. ",
    "url": "https://arxiv.org/abs/2111.04682",
    "authors": [
      "Koushik Biswas",
      "Sandeep Kumar",
      "Shilpak Banerjee",
      "Ashish Kumar Pandey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2111.03729",
    "title": "Explaining neural network predictions of material strength",
    "abstract": "We recently developed a deep learning method that can determine the critical peak stress of a material by looking at scanning electron microscope (SEM) images of the material's crystals. However, it has been somewhat unclear what kind of image features the network is keying off of when it makes its prediction. It is common in computer vision to employ an explainable AI saliency map to tell one what parts of an image are important to the network's decision. One can usually deduce the important features by looking at these salient locations. However, SEM images of crystals are more abstract to the human observer than natural image photographs. As a result, it is not easy to tell what features are important at the locations which are most salient. To solve this, we developed a method that helps us map features from important locations in SEM images to non-abstract textures that are easier to interpret. ",
    "url": "https://arxiv.org/abs/2111.03729",
    "authors": [
      "Ian A. Palmer",
      "T. Nathan Mundhenk",
      "Brian Gallagher",
      "Yong Han"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.04084",
    "title": "Statistical physics of exchangeable sparse network ensembles",
    "abstract": "Exchangeability is a desired statistical property of network ensembles requiring their invariance upon relabelling of the nodes. However combining sparsity of network ensembles with exchangeability is challenging. Here we propose a statistical physics framework and a Metropolis-Hasting algorithm defining exchangeable sparse network ensembles. The model generates networks with heterogeneous degree distributions by enforcing only global constraints while existing (non exchangeable) exponential random graphs enforce an extensive number of local constraints. The model can be generalized to networks with degree correlations and to generalized network structures. ",
    "url": "https://arxiv.org/abs/2111.04084",
    "authors": [
      "Ginestra Bianconi"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2111.04389",
    "title": "Lattice gauge symmetry in neural networks",
    "abstract": "We review a novel neural network architecture called lattice gauge equivariant convolutional neural networks (L-CNNs), which can be applied to generic machine learning problems in lattice gauge theory while exactly preserving gauge symmetry. We discuss the concept of gauge equivariance which we use to explicitly construct a gauge equivariant convolutional layer and a bilinear layer. The performance of L-CNNs and non-equivariant CNNs is compared using seemingly simple non-linear regression tasks, where L-CNNs demonstrate generalizability and achieve a high degree of accuracy in their predictions compared to their non-equivariant counterparts. ",
    "url": "https://arxiv.org/abs/2111.04389",
    "authors": [
      "Matteo Favoni",
      "Andreas Ipp",
      "David I. Müller",
      "Daniel Schuh"
    ],
    "subjectives": [
      "High Energy Physics - Lattice (hep-lat)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)",
      "High Energy Physics - Theory (hep-th)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2111.04568",
    "title": "Simultaneous estimation of wall and object parameters in TWR using deep  neural network",
    "abstract": "This paper presents a deep learning model for simultaneously estimating target and wall parameters in Through-the-Wall Radar. In this work, we consider two modes: single-target and two-targets. In both cases, we consider the permittivity and thickness for the wall, as well as the two-dimensional coordinates of the target's center and permittivity. This means that in the case of a single target, we estimate five values, whereas, in the case of two targets, we estimate eight values simultaneously, each of which represents the mentioned parameters. We discovered that when using deep neural networks to solve the target locating problem, giving the model more parameters of the problem increases the location accuracy. As a result, we included two wall parameters in the problem and discovered that the accuracy of target locating improves while the wall parameters are estimated. We were able to estimate the parameters of wall permittivity and thickness, as well as two-dimensional coordinates and permittivity of targets in single-target and two-target modes with 99\\% accuracy by using a deep neural network model. ",
    "url": "https://arxiv.org/abs/2111.04568",
    "authors": [
      "Fardin Ghorbani",
      "Hossein Soleimani"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2111.04637",
    "title": "The complex-valued correlation coefficient accounts for binaural  detection",
    "abstract": "Binaural hearing is one of the principal mechanisms enabling the localization of sound sources in space. In addition, binaural hearing also significantly improves the ability to detect signals in noise. Humans can detect interaurally anti-phasic tones in masking noise at sound levels 15 dB below the detection threshold of the equivalent in-phase tones. Intermediate thresholds result from detecting tones in noise with an interaural time difference (ITD). The ITD dependence has been most accurately accounted for by models using an internal delay-line mechanism. The delay lines, or an equivalent mechanism, however, have not been found in mammals. Alternative coding principles that do not include delay lines can explain many aspects of sound localization but have failed to account for some of the available data on binaural detection. By employing the complex-valued correlation coefficient, we show that a minimum assumption model can explain the outcome of a wide range of binaural detection experiments. The proposed mechanism requires fewer degrees of freedom when compared to delay-line models while arguably improving compatibility with mammalian physiology. The study also shows that the 2-dimensional acoustic feature space of complex correlation coefficients is at the same time a perceptually uniform space for binaural detection. ",
    "url": "https://arxiv.org/abs/2111.04637",
    "authors": [
      "Jörg Encke",
      "Mathias Dietz"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2111.04684",
    "title": "Physics-informed neural networks for understanding shear migration of  particles in viscous flow",
    "abstract": "We harness the physics-informed neural network (PINN) approach to extend the utility of phenomenological models for particle migration in shear flow. Specifically, we propose to constrain the neural network training via a model for the physics of shear-induced particle migration in suspensions. Then, we train the PINN against experimental data from the literature, showing that this approach provides both better fidelity to the experiments, and novel understanding of the relative roles of the hypothesized migration fluxes. We first verify the PINN approach for solving the inverse problem of radial particle migration in a non-Brownian suspension in an annular Couette flow. In this classical case, the PINN yields the same value (as reported in the literature) for the ratio of the two parameters of the empirical model. Next, we apply the PINN approach to analyze experiments on particle migration in both non-Brownian and Brownian suspensions in Poiseuille slot flow, for which a definitive calibration of the phenomenological migration model has been lacking. Using the PINN approach, we identify the unknown/empirical parameters in the physical model through the inverse solver capability of PINNs. Specifically, the values are significantly different from those for the Couette cell, highlighting an inconsistency in the literature that uses the latter value for Poiseuille flow. Importantly, the PINN results also show that the inferred values of the empirical model's parameters vary with the shear P\\'eclet number and the particle bulk volume fraction of the suspension, instead of being constant as assumed in previous literature. ",
    "url": "https://arxiv.org/abs/2111.04684",
    "authors": [
      "Daihui Lu",
      "Ivan C. Christov"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2111.04699",
    "title": "Automated pharyngeal phase detection and bolus localization in  videofluoroscopic swallowing study: Killing two birds with one stone?",
    "abstract": "The videofluoroscopic swallowing study (VFSS) is a gold-standard imaging technique for assessing swallowing, but analysis and rating of VFSS recordings is time consuming and requires specialized training and expertise. Researchers have demonstrated that it is possible to automatically detect the pharyngeal phase of swallowing and to localize the bolus in VFSS recordings via computer vision approaches, fostering the development of novel techniques for automatic VFSS analysis. However, training of algorithms to perform these tasks requires large amounts of annotated data that are seldom available. We demonstrate that the challenges of pharyngeal phase detection and bolus localization can be solved together using a single approach. We propose a deep-learning framework that jointly tackles pharyngeal phase detection and bolus localization in a weakly-supervised manner, requiring only the initial and final frames of the pharyngeal phase as ground truth annotations for the training. Our approach stems from the observation that bolus presence in the pharynx is the most prominent visual feature upon which to infer whether individual VFSS frames belong to the pharyngeal phase. We conducted extensive experiments with multiple convolutional neural networks (CNNs) on a dataset of 1245 VFSS clips from 59 healthy subjects. We demonstrated that the pharyngeal phase can be detected with an F1-score higher than 0.9. Moreover, by processing the class activation maps of the CNNs, we were able to localize the bolus with promising results, obtaining correlations with ground truth trajectories higher than 0.9, without any manual annotations of bolus location used for training purposes. Once validated on a larger sample of participants with swallowing disorders, our framework will pave the way for the development of intelligent tools for VFSS analysis to support clinicians in swallowing assessment. ",
    "url": "https://arxiv.org/abs/2111.04699",
    "authors": [
      "Andrea Bandini",
      "Sana Smaoui",
      "Catriona M. Steele"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2001.11107",
    "title": "Hamiltonian neural networks for solving equations of motion",
    "abstract": " Comments: This version (v4) is the same with version 2 (arXiv:2001.11107v2). The version 3 (v3) was uploaded by accident ",
    "url": "https://arxiv.org/abs/2001.11107",
    "authors": [
      "Marios Mattheakis",
      "David Sondak",
      "Akshunna S. Dogra",
      "Pavlos Protopapas"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2012.03817",
    "title": "A bounded-noise mechanism for differential privacy",
    "abstract": " Title: A bounded-noise mechanism for differential privacy ",
    "url": "https://arxiv.org/abs/2012.03817",
    "authors": [
      "Yuval Dagan",
      "Gil Kur"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.08426",
    "title": "Exact imposition of boundary conditions with distance functions in  physics-informed deep neural networks",
    "abstract": " Comments: 50 pages, 46 figures ",
    "url": "https://arxiv.org/abs/2104.08426",
    "authors": [
      "N. Sukumar",
      "Ankit Srivastava"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2104.13619",
    "title": "Reconstructing nodal pressures in water distribution systems with graph  neural networks",
    "abstract": " Comments: 12 pages, 6 figures. Interpolated regularization has been added as a baseline method for nodal pressure reconstruction ",
    "url": "https://arxiv.org/abs/2104.13619",
    "authors": [
      "Gergely Hajgató",
      "Bálint Gyires-Tóth",
      "György Paál"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.07402",
    "title": "Is the aspect ratio of cells important in deep learning? A robust  comparison of deep learning methods for multi-scale cytopathology cell image  classification: from convolutional neural networks to visual transformers",
    "abstract": " Title: Is the aspect ratio of cells important in deep learning? A robust  comparison of deep learning methods for multi-scale cytopathology cell image  classification: from convolutional neural networks to visual transformers ",
    "url": "https://arxiv.org/abs/2105.07402",
    "authors": [
      "Wanli Liu",
      "Chen Li",
      "Md Mamunur Rahamana",
      "Tao Jiang",
      "Hongzan Sun",
      "Xiangchen Wu",
      "Weiming Hu",
      "Haoyuan Chen",
      "Changhao Sun",
      "Yudong Yao",
      "Marcin Grzegorzek"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.00259",
    "title": "Neuron segmentation using 3D wavelet integrated encoder-decoder network",
    "abstract": " Comments: Bioinformatics accepted paper ",
    "url": "https://arxiv.org/abs/2106.00259",
    "authors": [
      "Qiufu Li",
      "Linlin Shen"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.02483",
    "title": "You can't always get what you want: towards user-controlled privacy on  Android",
    "abstract": " Title: You can't always get what you want: towards user-controlled privacy on  Android ",
    "url": "https://arxiv.org/abs/2106.02483",
    "authors": [
      "Davide Caputo",
      "Francesco Pagano",
      "Giovanni Bottino",
      "Luca Verderame",
      "Alessio Merlo"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2106.05018",
    "title": "RLupus: Cooperation through emergent communication in The Werewolf  social deduction game",
    "abstract": " Title: RLupus: Cooperation through emergent communication in The Werewolf  social deduction game ",
    "url": "https://arxiv.org/abs/2106.05018",
    "authors": [
      "Nicolo' Brandizzi",
      "Davide Grossi",
      "Luca Iocchi"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2106.15909",
    "title": "Effect of acoustic scene complexity and visual scene representation on  auditory perception in virtual audio-visual environments",
    "abstract": " Comments: Accepted publication in Proceedings of 3DA 2021 International Conference on Immersive and 3D Audio ",
    "url": "https://arxiv.org/abs/2106.15909",
    "authors": [
      "Stefan Fichna",
      "Thomas Biberger",
      "Bernhard U. Seeber",
      "Stephan D. Ewert"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2109.04463",
    "title": "Neural Latents Benchmark '21: Evaluating latent variable models of  neural population activity",
    "abstract": " Title: Neural Latents Benchmark '21: Evaluating latent variable models of  neural population activity ",
    "url": "https://arxiv.org/abs/2109.04463",
    "authors": [
      "Felix Pei",
      "Joel Ye",
      "David Zoltowski",
      "Anqi Wu",
      "Raeed H. Chowdhury",
      "Hansem Sohn",
      "Joseph E. O'Doherty",
      "Krishna V. Shenoy",
      "Matthew T. Kaufman",
      "Mark Churchland",
      "Mehrdad Jazayeri",
      "Lee E. Miller",
      "Jonathan Pillow",
      "Il Memming Park",
      "Eva L. Dyer",
      "Chethan Pandarinath"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2110.03130",
    "title": "Generic tool for numerical simulation of transformation-diffusion  processes in complex volume geometric shapes: application to microbial  decomposition of organic matter",
    "abstract": " Comments: This paper represents, in my opinion, a breakthrough and then is worthing to be online before the end of the review process ",
    "url": "https://arxiv.org/abs/2110.03130",
    "authors": [
      "Olivier Monga",
      "Frédéric Hecht",
      "Serge Moto",
      "Bruno Mbe",
      "Patricia Garnier",
      "Valérie Pot"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computational Physics (physics.comp-ph)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2110.14124",
    "title": "A novel multiobjective evolutionary algorithm based on decomposition and  multi-reference points strategy",
    "abstract": " Title: A novel multiobjective evolutionary algorithm based on decomposition and  multi-reference points strategy ",
    "url": "https://arxiv.org/abs/2110.14124",
    "authors": [
      "Wang Chen",
      "Jian Chen",
      "Weitian Wu",
      "Xinmin Yang",
      "Hui Li"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2111.02212",
    "title": "Swarm intelligence algorithms applied to Virtual Reference Feedback  Tuning to increase controller robustness -- a one-shot technique",
    "abstract": " Comments: 35 pages, 10 figures, journal ",
    "url": "https://arxiv.org/abs/2111.02212",
    "authors": [
      "L. V. Fiorio",
      "C. L. Remes",
      "Y. R. de Novaes"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2111.03383",
    "title": "Epidemic inference through generative neural networks",
    "abstract": " Comments: 30 pages, 6 figures, 1 table ",
    "url": "https://arxiv.org/abs/2111.03383",
    "authors": [
      "Indaco Biazzo",
      "Alfredo Braunstein",
      "Luca Dall'Asta",
      "Fabio Mazza"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  }
]