[
  {
    "id": "arXiv:2403.12044",
    "title": "Mobile Application for Oral Disease Detection using Federated Learning",
    "abstract": "The mouth, often regarded as a window to the internal state of the body, plays an important role in reflecting one's overall health. Poor oral hygiene has far-reaching consequences, contributing to severe conditions like heart disease, cancer, and diabetes, while inadequate care leads to discomfort, pain, and costly treatments. Federated Learning (FL) for object detection can be utilized for this use case due to the sensitivity of the oral image data of the patients. FL ensures data privacy by storing the images used for object detection on the local device and trains the model on the edge. The updated weights are federated to a central server where all the collected weights are updated via The Federated Averaging algorithm. Finally, we have developed a mobile app named OralH which provides user-friendly solutions, allowing people to conduct self-assessments through mouth scans and providing quick oral health insights. Upon detection of the issues, the application alerts the user about potential oral health concerns or diseases and provides details about dental clinics in the user's locality. Designed as a Progressive Web Application (PWA), the platform ensures ubiquitous access, catering to users across devices for a seamless experience. The application aims to provide state-of-the-art segmentation and detection techniques, leveraging the YOLOv8 object detection model to identify oral hygiene issues and diseases. This study deals with the benefits of leveraging FL in healthcare with promising real-world results. ",
    "url": "https://arxiv.org/abs/2403.12044",
    "authors": [
      "Shankara Narayanan V",
      "Sneha Varsha M",
      "Syed Ashfaq Ahmed",
      "Guruprakash J"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12047",
    "title": "Alpha-wolves and Alpha-mammals: Exploring Dictionary Attacks on Iris  Recognition Systems",
    "abstract": "A dictionary attack in a biometric system entails the use of a small number of strategically generated images or templates to successfully match with a large number of identities, thereby compromising security. We focus on dictionary attacks at the template level, specifically the IrisCodes used in iris recognition systems. We present an hitherto unknown vulnerability wherein we mix IrisCodes using simple bitwise operators to generate alpha-mixtures - alpha-wolves (combining a set of \"wolf\" samples) and alpha-mammals (combining a set of users selected via search optimization) that increase false matches. We evaluate this vulnerability using the IITD, CASIA-IrisV4-Thousand and Synthetic datasets, and observe that an alpha-wolf (from two wolves) can match upto 71 identities @FMR=0.001%, while an alpha-mammal (from two identities) can match upto 133 other identities @FMR=0.01% on the IITD dataset. ",
    "url": "https://arxiv.org/abs/2403.12047",
    "authors": [
      "Sudipta Banerjee",
      "Anubhav Jain",
      "Zehua Jiang",
      "Nasir Memon",
      "Julian Togelius",
      "Arun Ross"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12049",
    "title": "Toward Improving Robustness of Object Detectors Against Domain Shift",
    "abstract": "This paper proposes a data augmentation method for improving the robustness of driving object detectors against domain shift. Domain shift problem arises when there is a significant change between the distribution of the source data domain used in the training phase and that of the target data domain in the deployment phase. Domain shift is known as one of the most popular reasons resulting in the considerable drop in the performance of deep neural network models. In order to address this problem, one effective approach is to increase the diversity of training data. To this end, we propose a data synthesis module that can be utilized to train more robust and effective object detectors. By adopting YOLOv4 as a base object detector, we have witnessed a remarkable improvement in performance on both the source and target domain data. The code of this work is publicly available at https://github.com/tranleanh/haze-synthesis. ",
    "url": "https://arxiv.org/abs/2403.12049",
    "authors": [
      "Le-Anh Tran",
      "Chung Nguyen Tran",
      "Dong-Chul Park",
      "Jordi Carrabina",
      "David Castells-Rufas"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12055",
    "title": "Deep learning based detection of collateral circulation in coronary  angiographies",
    "abstract": "Coronary artery disease (CAD) is the dominant cause of death and hospitalization across the globe. Atherosclerosis, an inflammatory condition that gradually narrows arteries and has potentially fatal effects, is the most frequent cause of CAD. Nonetheless, the circulation regularly adapts in the presence of atherosclerosis, through the formation of collateral arteries, resulting in significant long-term health benefits. Therefore, timely detection of coronary collateral circulation (CCC) is crucial for CAD personalized medicine. We propose a novel deep learning based method to detect CCC in angiographic images. Our method relies on a convolutional backbone to extract spatial features from each frame of an angiography sequence. The features are then concatenated, and subsequently processed by another convolutional layer that processes embeddings temporally. Due to scarcity of data, we also experiment with pretraining the backbone on coronary artery segmentation, which improves the results consistently. Moreover, we experiment with few-shot learning to further improve performance, given our low data regime. We present our results together with subgroup analyses based on Rentrop grading, collateral flow, and collateral grading, which provide valuable insights into model performance. Overall, the proposed method shows promising results in detecting CCC, and can be further extended to perform landmark based CCC detection and CCC quantification. ",
    "url": "https://arxiv.org/abs/2403.12055",
    "authors": [
      "Cosmin-Andrei Hatfaludi",
      "Daniel Bunescu",
      "Costin Florian Ciusdel",
      "Alex Serban",
      "Karl Bose",
      "Marc Oppel",
      "Stephanie Schroder",
      "Christopher Seehase",
      "Harald F. Langer",
      "Jeanette Erdmann",
      "Henry Nording",
      "Lucian Mihai Itu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.12057",
    "title": "Discriminative Consensus Mining with A Thousand Groups for More Accurate  Co-Salient Object Detection",
    "abstract": "Co-Salient Object Detection (CoSOD) is a rapidly growing task, extended from Salient Object Detection (SOD) and Common Object Segmentation (Co-Segmentation). It is aimed at detecting the co-occurring salient object in the given image group. Many effective approaches have been proposed on the basis of existing datasets. However, there is still no standard and efficient training set in CoSOD, which makes it chaotic to choose training sets in the recently proposed CoSOD methods. First, the drawbacks of existing training sets in CoSOD are analyzed in a comprehensive way, and potential improvements are provided to solve existing problems to some extent. In particular, in this thesis, a new CoSOD training set is introduced, named Co-Saliency of ImageNet (CoSINe) dataset. The proposed CoSINe is the largest number of groups among all existing CoSOD datasets. The images obtained here span a wide variety in terms of categories, object sizes, etc. In experiments, models trained on CoSINe can achieve significantly better performance with fewer images compared to all existing datasets. Second, to make the most of the proposed CoSINe, a novel CoSOD approach named Hierarchical Instance-aware COnsensus MinEr (HICOME) is proposed, which efficiently mines the consensus feature from different feature levels and discriminates objects of different classes in an object-aware contrastive way. As extensive experiments show, the proposed HICOME achieves SoTA performance on all the existing CoSOD test sets. Several useful training tricks suitable for training CoSOD models are also provided. Third, practical applications are given using the CoSOD technique to show the effectiveness. Finally, the remaining challenges and potential improvements of CoSOD are discussed to inspire related work in the future. The source code, the dataset, and the online demo will be publicly available at github.com/ZhengPeng7/CoSINe. ",
    "url": "https://arxiv.org/abs/2403.12057",
    "authors": [
      "Peng Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12060",
    "title": "Blockchain-Empowered Immutable and Reliable Delivery Service (BIRDS)  Using UAV Networks",
    "abstract": "Exploiting unmanned aerial vehicles (UAVs) for delivery services is expected to reduce delivery time and human resource costs. However, the proximity of these UAVs to the ground can make them an ideal target for opportunistic criminals. Consequently, UAVs may be hacked, diverted from their destinations, or used for malicious purposes. Furthermore, as a decentralized (peer-to-peer) technology, the blockchain has immense potential to enable secure, decentralized, and cooperative communication among UAVs. With this goal in mind, we propose the Blockchain-Empowered, Immutable, and Reliable Delivery Service (BIRDS) framework to address data security challenges. BIRDS deploys communication hubs across a scalable network. Following the registration phase of BIRDS, UAV node selection is carried out based on a specific consensus proof-of-competence (PoC), where UAVs are evaluated solely on their credibility. The chosen finalist is awarded a certificate for the BIRDS global order fulfillment system. The simulation results demonstrate that BIRDS requires fewer UAVs compared to conventional solutions, resulting in reduced costs and emissions. The proposed BIRDS framework caters to the requirements of numerous users while necessitating less network traffic and consuming low energy. ",
    "url": "https://arxiv.org/abs/2403.12060",
    "authors": [
      "Sana Hafeez",
      "Habib Ullah Manzoor",
      "Lina Mohjazi",
      "Ahmed Zoha",
      "Muhammad Ali Imran",
      "Yao Sun"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.12068",
    "title": "Process mining for self-regulated learning assessment in e-learning",
    "abstract": "Content assessment has broadly improved in e-learning scenarios in recent decades. However, the eLearning process can give rise to a spatial and temporal gap that poses interesting challenges for assessment of not only content, but also students' acquisition of core skills such as self-regulated learning. Our objective was to discover students' self-regulated learning processes during an eLearning course by using Process Mining Techniques. We applied a new algorithm in the educational domain called Inductive Miner over the interaction traces from 101 university students in a course given over one semester on the Moodle 2.0 platform. Data was extracted from the platform's event logs with 21629 traces in order to discover students' self-regulation models that contribute to improving the instructional process. The Inductive Miner algorithm discovered optimal models in terms of fitness for both Pass and Fail students in this dataset, as well as models at a certain level of granularity that can be interpreted in educational terms, which are the most important achievement in model discovery. We can conclude that although students who passed did not follow the instructors' suggestions exactly, they did follow the logic of a successful self-regulated learning process as opposed to their failing classmates. The Process Mining models also allow us to examine which specific actions the students performed, and it was particularly interesting to see a high presence of actions related to forum-supported collaborative learning in the Pass group and an absence of those in the Fail group. ",
    "url": "https://arxiv.org/abs/2403.12068",
    "authors": [
      "R. Cerezo",
      "A. Bogarin",
      "M. Esteban",
      "C. Romero"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12075",
    "title": "Adversarial Nibbler: An Open Red-Teaming Method for Identifying Diverse  Harms in Text-to-Image Generation",
    "abstract": "With the rise of text-to-image (T2I) generative AI models reaching wide audiences, it is critical to evaluate model robustness against non-obvious attacks to mitigate the generation of offensive images. By focusing on ``implicitly adversarial'' prompts (those that trigger T2I models to generate unsafe images for non-obvious reasons), we isolate a set of difficult safety issues that human creativity is well-suited to uncover. To this end, we built the Adversarial Nibbler Challenge, a red-teaming methodology for crowdsourcing a diverse set of implicitly adversarial prompts. We have assembled a suite of state-of-the-art T2I models, employed a simple user interface to identify and annotate harms, and engaged diverse populations to capture long-tail safety issues that may be overlooked in standard testing. The challenge is run in consecutive rounds to enable a sustained discovery and analysis of safety pitfalls in T2I models. In this paper, we present an in-depth account of our methodology, a systematic study of novel attack strategies and discussion of safety failures revealed by challenge participants. We also release a companion visualization tool for easy exploration and derivation of insights from the dataset. The first challenge round resulted in over 10k prompt-image pairs with machine annotations for safety. A subset of 1.5k samples contains rich human annotations of harm types and attack styles. We find that 14% of images that humans consider harmful are mislabeled as ``safe'' by machines. We have identified new attack strategies that highlight the complexity of ensuring T2I model robustness. Our findings emphasize the necessity of continual auditing and adaptation as new vulnerabilities emerge. We are confident that this work will enable proactive, iterative safety assessments and promote responsible development of T2I models. ",
    "url": "https://arxiv.org/abs/2403.12075",
    "authors": [
      "Jessica Quaye",
      "Alicia Parrish",
      "Oana Inel",
      "Charvi Rastogi",
      "Hannah Rose Kirk",
      "Minsuk Kahng",
      "Erin van Liemt",
      "Max Bartolo",
      "Jess Tsang",
      "Justin White",
      "Nathan Clement",
      "Rafael Mosquera",
      "Juan Ciro",
      "Vijay Janapa Reddi",
      "Lora Aroyo"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12077",
    "title": "Evaluating Robustness of Generative Search Engine on Adversarial Factual  Questions",
    "abstract": "Generative search engines have the potential to transform how people seek information online, but generated responses from existing large language models (LLMs)-backed generative search engines may not always be accurate. Nonetheless, retrieval-augmented generation exacerbates safety concerns, since adversaries may successfully evade the entire system by subtly manipulating the most vulnerable part of a claim. To this end, we propose evaluating the robustness of generative search engines in the realistic and high-risk setting, where adversaries have only black-box system access and seek to deceive the model into returning incorrect responses. Through a comprehensive human evaluation of various generative search engines, such as Bing Chat, PerplexityAI, and YouChat across diverse queries, we demonstrate the effectiveness of adversarial factual questions in inducing incorrect responses. Moreover, retrieval-augmented generation exhibits a higher susceptibility to factual errors compared to LLMs without retrieval. These findings highlight the potential security risks of these systems and emphasize the need for rigorous evaluation before deployment. ",
    "url": "https://arxiv.org/abs/2403.12077",
    "authors": [
      "Xuming Hu",
      "Xiaochuan Li",
      "Junzhe Chen",
      "Yinghui Li",
      "Yangning Li",
      "Xiaoguang Li",
      "Yasheng Wang",
      "Qun Liu",
      "Lijie Wen",
      "Philip S. Yu",
      "Zhijiang Guo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2403.12080",
    "title": "Evaluating Terrain-Dependent Performance for Martian Frost Detection in  Visible Satellite Observations",
    "abstract": "Seasonal frosting and defrosting on the surface of Mars is hypothesized to drive both climate processes and the formation and evolution of geomorphological features such as gullies. Past studies have focused on manually analyzing the behavior of the frost cycle in the northern mid-latitude region of Mars using high-resolution visible observations from orbit. Extending these studies globally requires automating the detection of frost using data science techniques such as convolutional neural networks. However, visible indications of frost presence can vary significantly depending on the geologic context on which the frost is superimposed. In this study, we (1) present a novel approach for spatially partitioning data to reduce biases in model performance estimation, (2) illustrate how geologic context affects automated frost detection, and (3) propose mitigations to observed biases in automated frost detection. ",
    "url": "https://arxiv.org/abs/2403.12080",
    "authors": [
      "Gary Doran",
      "Serina Diniega",
      "Steven Lu",
      "Mark Wronkiewicz",
      "Kiri L. Wagstaff"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12143",
    "title": "Graph Neural Networks for Learning Equivariant Representations of Neural  Networks",
    "abstract": "Neural networks that process the parameters of other neural networks find applications in domains as diverse as classifying implicit neural representations, generating neural network weights, and predicting generalization errors. However, existing approaches either overlook the inherent permutation symmetry in the neural network or rely on intricate weight-sharing patterns to achieve equivariance, while ignoring the impact of the network architecture itself. In this work, we propose to represent neural networks as computational graphs of parameters, which allows us to harness powerful graph neural networks and transformers that preserve permutation symmetry. Consequently, our approach enables a single model to encode neural computational graphs with diverse architectures. We showcase the effectiveness of our method on a wide range of tasks, including classification and editing of implicit neural representations, predicting generalization performance, and learning to optimize, while consistently outperforming state-of-the-art methods. The source code is open-sourced at https://github.com/mkofinas/neural-graphs. ",
    "url": "https://arxiv.org/abs/2403.12143",
    "authors": [
      "Miltiadis Kofinas",
      "Boris Knyazev",
      "Yan Zhang",
      "Yunlu Chen",
      "Gertjan J. Burghouts",
      "Efstratios Gavves",
      "Cees G. M. Snoek",
      "David W. Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.12151",
    "title": "Fusing Domain-Specific Content from Large Language Models into Knowledge  Graphs for Enhanced Zero Shot Object State Classification",
    "abstract": "Domain-specific knowledge can significantly contribute to addressing a wide variety of vision tasks. However, the generation of such knowledge entails considerable human labor and time costs. This study investigates the potential of Large Language Models (LLMs) in generating and providing domain-specific information through semantic embeddings. To achieve this, an LLM is integrated into a pipeline that utilizes Knowledge Graphs and pre-trained semantic vectors in the context of the Vision-based Zero-shot Object State Classification task. We thoroughly examine the behavior of the LLM through an extensive ablation study. Our findings reveal that the integration of LLM-based embeddings, in combination with general-purpose pre-trained embeddings, leads to substantial performance improvements. Drawing insights from this ablation study, we conduct a comparative analysis against competing models, thereby highlighting the state-of-the-art performance achieved by the proposed approach. ",
    "url": "https://arxiv.org/abs/2403.12151",
    "authors": [
      "Filippos Gouidis",
      "Katerina Papantoniou",
      "Konstantinos Papoutsakis Theodore Patkos",
      "Antonis Argyros",
      "Dimitris Plexousakis"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12152",
    "title": "Development of Automated Neural Network Prediction for Echocardiographic  Left ventricular Ejection Fraction",
    "abstract": "The echocardiographic measurement of left ventricular ejection fraction (LVEF) is fundamental to the diagnosis and classification of patients with heart failure (HF). In order to quantify LVEF automatically and accurately, this paper proposes a new pipeline method based on deep neural networks and ensemble learning. Within the pipeline, an Atrous Convolutional Neural Network (ACNN) was first trained to segment the left ventricle (LV), before employing the area-length formulation based on the ellipsoid single-plane model to calculate LVEF values. This formulation required inputs of LV area, derived from segmentation using an improved Jeffrey's method, as well as LV length, derived from a novel ensemble learning model. To further improve the pipeline's accuracy, an automated peak detection algorithm was used to identify end-diastolic and end-systolic frames, avoiding issues with human error. Subsequently, single-beat LVEF values were averaged across all cardiac cycles to obtain the final LVEF. This method was developed and internally validated in an open-source dataset containing 10,030 echocardiograms. The Pearson's correlation coefficient was 0.83 for LVEF prediction compared to expert human analysis (p<0.001), with a subsequent area under the receiver operator curve (AUROC) of 0.98 (95% confidence interval 0.97 to 0.99) for categorisation of HF with reduced ejection (HFrEF; LVEF<40%). In an external dataset with 200 echocardiograms, this method achieved an AUC of 0.90 (95% confidence interval 0.88 to 0.91) for HFrEF assessment. This study demonstrates that an automated neural network-based calculation of LVEF is comparable to expert clinicians performing time-consuming, frame-by-frame manual evaluation of cardiac systolic function. ",
    "url": "https://arxiv.org/abs/2403.12152",
    "authors": [
      "Yuting Zhang",
      "Boyang Liu",
      "Karina V. Bunting",
      "David Brind",
      "Alexander Thorley",
      "Andreas Karwath",
      "Wenqi Lu",
      "Diwei Zhou",
      "Xiaoxia Wang",
      "Alastair R. Mobley",
      "Otilia Tica",
      "Georgios Gkoutos",
      "Dipak Kotecha",
      "Jinming Duan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12154",
    "title": "ThermoNeRF: Multimodal Neural Radiance Fields for Thermal Novel View  Synthesis",
    "abstract": "Thermal scene reconstruction exhibit great potential for applications across a broad spectrum of fields, including building energy consumption analysis and non-destructive testing. However, existing methods typically require dense scene measurements and often rely on RGB images for 3D geometry reconstruction, with thermal information being projected post-reconstruction. This two-step strategy, adopted due to the lack of texture in thermal images, can lead to disparities between the geometry and temperatures of the reconstructed objects and those of the actual scene. To address this challenge, we propose ThermoNeRF, a novel multimodal approach based on Neural Radiance Fields, capable of rendering new RGB and thermal views of a scene jointly. To overcome the lack of texture in thermal images, we use paired RGB and thermal images to learn scene density, while distinct networks estimate color and temperature information. Furthermore, we introduce ThermoScenes, a new dataset to palliate the lack of available RGB+thermal datasets for scene reconstruction. Experimental results validate that ThermoNeRF achieves accurate thermal image synthesis, with an average mean absolute error of 1.5$^\\circ$C, an improvement of over 50% compared to using concatenated RGB+thermal data with Nerfacto, a state-of-the-art NeRF method. ",
    "url": "https://arxiv.org/abs/2403.12154",
    "authors": [
      "Mariam Hassan",
      "Florent Forest",
      "Olga Fink",
      "Malcolm Mielle"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12172",
    "title": "Graph-Jigsaw Conditioned Diffusion Model for Skeleton-based Video  Anomaly Detection",
    "abstract": "Skeleton-based video anomaly detection (SVAD) is a crucial task in computer vision. Accurately identifying abnormal patterns or events enables operators to promptly detect suspicious activities, thereby enhancing safety. Achieving this demands a comprehensive understanding of human motions, both at body and region levels, while also accounting for the wide variations of performing a single action. However, existing studies fail to simultaneously address these crucial properties. This paper introduces a novel, practical and lightweight framework, namely Graph-Jigsaw Conditioned Diffusion Model for Skeleton-based Video Anomaly Detection (GiCiSAD) to overcome the challenges associated with SVAD. GiCiSAD consists of three novel modules: the Graph Attention-based Forecasting module to capture the spatio-temporal dependencies inherent in the data, the Graph-level Jigsaw Puzzle Maker module to distinguish subtle region-level discrepancies between normal and abnormal motions, and the Graph-based Conditional Diffusion model to generate a wide spectrum of human motions. Extensive experiments on four widely used skeleton-based video datasets show that GiCiSAD outperforms existing methods with significantly fewer training parameters, establishing it as the new state-of-the-art. ",
    "url": "https://arxiv.org/abs/2403.12172",
    "authors": [
      "Ali Karami",
      "Thi Kieu Khanh Ho",
      "Narges Armanfard"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.12173",
    "title": "TnT-LLM: Text Mining at Scale with Large Language Models",
    "abstract": "Transforming unstructured text into structured and meaningful forms, organized by useful category labels, is a fundamental step in text mining for downstream analysis and application. However, most existing methods for producing label taxonomies and building text-based label classifiers still rely heavily on domain expertise and manual curation, making the process expensive and time-consuming. This is particularly challenging when the label space is under-specified and large-scale data annotations are unavailable. In this paper, we address these challenges with Large Language Models (LLMs), whose prompt-based interface facilitates the induction and use of large-scale pseudo labels. We propose TnT-LLM, a two-phase framework that employs LLMs to automate the process of end-to-end label generation and assignment with minimal human effort for any given use-case. In the first phase, we introduce a zero-shot, multi-stage reasoning approach which enables LLMs to produce and refine a label taxonomy iteratively. In the second phase, LLMs are used as data labelers that yield training samples so that lightweight supervised classifiers can be reliably built, deployed, and served at scale. We apply TnT-LLM to the analysis of user intent and conversational domain for Bing Copilot (formerly Bing Chat), an open-domain chat-based search engine. Extensive experiments using both human and automatic evaluation metrics demonstrate that TnT-LLM generates more accurate and relevant label taxonomies when compared against state-of-the-art baselines, and achieves a favorable balance between accuracy and efficiency for classification at scale. We also share our practical experiences and insights on the challenges and opportunities of using LLMs for large-scale text mining in real-world applications. ",
    "url": "https://arxiv.org/abs/2403.12173",
    "authors": [
      "Mengting Wan",
      "Tara Safavi",
      "Sujay Kumar Jauhar",
      "Yujin Kim",
      "Scott Counts",
      "Jennifer Neville",
      "Siddharth Suri",
      "Chirag Shah",
      "Ryen W White",
      "Longqi Yang",
      "Reid Andersen",
      "Georg Buscher",
      "Dhruv Joshi",
      "Nagu Rangan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2403.12211",
    "title": "A Unified Model for Longitudinal Multi-Modal Multi-View Prediction with  Missingness",
    "abstract": "Medical records often consist of different modalities, such as images, text, and tabular information. Integrating all modalities offers a holistic view of a patient's condition, while analyzing them longitudinally provides a better understanding of disease progression. However, real-world longitudinal medical records present challenges: 1) patients may lack some or all of the data for a specific timepoint, and 2) certain modalities or views might be absent for all patients during a particular period. In this work, we introduce a unified model for longitudinal multi-modal multi-view (MMMV) prediction with missingness. Our method allows as many timepoints as desired for input, and aims to leverage all available data, regardless of their availability. We conduct extensive experiments on the knee osteoarthritis dataset from the Osteoarthritis Initiative (OAI) for pain and Kellgren-Lawrence grade (KLG) prediction at a future timepoint. We demonstrate the effectiveness of our method by comparing results from our unified model to specific models that use the same modality and view combinations during training and evaluation. We also show the benefit of having extended temporal data and provide post-hoc analysis for a deeper understanding of each modality/view's importance for different tasks. ",
    "url": "https://arxiv.org/abs/2403.12211",
    "authors": [
      "Boqi Chen",
      "Junier Oliva",
      "Marc Niethammer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.12215",
    "title": "Aggregate Peak EV Charging Demand: The Impact of Segmented Network  Tariffs",
    "abstract": "Aggregate peak Electric Vehicle (EV) charging demand has become an increasingly concerning issue for network operators, impacting their reliable operations. Various network tariff schemes have been proposed to limit peak demand by incentivizing flexible asset users to shift their demand from peak periods. However, fewer studies quantify the overall effect of these tariff schemes, which operate at the level of individual connections, on the aggregate load. In this paper, we investigate the effect of a multi-level segmented network tariff on aggregate EV charging demand. The interaction between peak-reducing network tariffs and dynamic energy prices is studied, shedding light on the competition between peak-reducing (network tariffs) and peak-forming (wholesale prices) charging behaviour. Results based on real charging transactions from over 650 public charging stations (CS) in the Netherlands show that the segmented network tariff with flat energy prices results in more diverse load profiles with increasing aggregation compared to cost-optimized dispatch based on dynamic day-ahead prices. The average peak demand for charging with segmented network tariffs and flat energy prices is reduced by 49% and 29% compared to optimized charging under dynamic day-ahead energy prices and unoptimized (dumb) charging, respectively. ",
    "url": "https://arxiv.org/abs/2403.12215",
    "authors": [
      "Nanda Kishor Panda",
      "Na Li",
      "Simon H. Tindemans"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.12218",
    "title": "Secure Synchronization of Heterogeneous Pulse-Coupled Oscillators",
    "abstract": "In this paper, we consider the synchronization of heterogeneous pulse-coupled oscillators (PCOs), where some of the oscillators might be faulty or malicious. The oscillators interact through identical pulses at discrete instants and evolve continuously with different frequencies otherwise. Despite the presence of misbehaviors, benign oscillators aim to reach synchronization. To achieve this objective, two resilient synchronization protocols are developed in this paper by adapting the real-valued mean-subsequence reduced (MSR) algorithm to pulse-based interactions. The first protocol relies on packet-based communication to transmit absolute frequencies, while the second protocol operates purely with pulses to calculate relative frequencies. In both protocols, each normal oscillator periodically counts the received pulses to detect possible malicious behaviors. By disregarding suspicious pulses from its neighbors, the oscillator updates both its phases and frequencies. The paper establishes sufficient conditions on the initial states and graph structure under which resilient synchronization is achieved in the PCO network. Specifically, the normal oscillators can either detect the presence of malicious nodes or synchronize in both phases and frequencies. Additionally, a comparison between the two algorithms reveals a trade-off between relaxed initial conditions and reduced communication burden. ",
    "url": "https://arxiv.org/abs/2403.12218",
    "authors": [
      "Jiaqi Yan",
      "Hideaki Ishii"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.12231",
    "title": "Edge-Disjoint Spanning Trees on Star-Product Networks",
    "abstract": "Star-product graphs are a natural extension of the Cartesian product, but have not been well-studied. We show that many important established and emerging network topologies, including HyperX, SlimFly, BundleFly, PolarStar, mesh, and torus, are in fact star-product graphs. While this connection was known for BundleFly and PolarStar, it was not for the others listed. We extend a method of constructing maximal and near-maximal sets of edge-disjoint spanning trees on Cartesian products to the star product, thus obtain maximal or near-maximal sets of edge-disjoint spanning trees on new networks of importance, where such sets can improve bandwidth of collective operations and therefore accelerate many important workloads in high-performance computing. ",
    "url": "https://arxiv.org/abs/2403.12231",
    "authors": [
      "Aleyah Dawkins",
      "Kelly Isham",
      "Ales Kubicek",
      "Kartik Lakhotia",
      "Laura Monroe"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2403.12244",
    "title": "Zero-Shot Multi-task Hallucination Detection",
    "abstract": "In recent studies, the extensive utilization of large language models has underscored the importance of robust evaluation methodologies for assessing text generation quality and relevance to specific tasks. This has revealed a prevalent issue known as hallucination, an emergent condition in the model where generated text lacks faithfulness to the source and deviates from the evaluation criteria. In this study, we formally define hallucination and propose a framework for its quantitative detection in a zero-shot setting, leveraging our definition and the assumption that model outputs entail task and sample specific inputs. In detecting hallucinations, our solution achieves an accuracy of 0.78 in a model-aware setting and 0.61 in a model-agnostic setting. Notably, our solution maintains computational efficiency, requiring far less computational resources than other SOTA approaches, aligning with the trend towards lightweight and compressed models. ",
    "url": "https://arxiv.org/abs/2403.12244",
    "authors": [
      "Patanjali Bhamidipati",
      "Advaith Malladi",
      "Manish Shrivastava",
      "Radhika Mamidi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.12280",
    "title": "Reachability-based Trajectory Design via Exact Formulation of Implicit  Neural Signed Distance Functions",
    "abstract": "Generating receding-horizon motion trajectories for autonomous vehicles in real-time while also providing safety guarantees is challenging. This is because a future trajectory needs to be planned before the previously computed trajectory is completely executed. This becomes even more difficult if the trajectory is required to satisfy continuous-time collision-avoidance constraints while accounting for a large number of obstacles. To address these challenges, this paper proposes a novel real-time, receding-horizon motion planning algorithm named REachability-based trajectory Design via Exact Formulation of Implicit NEural signed Distance functions (REDEFINED). REDEFINED first applies offline reachability analysis to compute zonotope-based reachable sets that overapproximate the motion of the ego vehicle. During online planning, REDEFINED leverages zonotope arithmetic to construct a neural implicit representation that computes the exact signed distance between a parameterized swept volume of the ego vehicle and obstacle vehicles. REDEFINED then implements a novel, real-time optimization framework that utilizes the neural network to construct a collision avoidance constraint. REDEFINED is compared to a variety of state-of-the-art techniques and is demonstrated to successfully enable the vehicle to safely navigate through complex environments. Code, data, and video demonstrations can be found at https://roahmlab.github.io/redefined/. ",
    "url": "https://arxiv.org/abs/2403.12280",
    "authors": [
      "Jonathan Michaux",
      "Qingyi Chen",
      "Challen Enninful Adu",
      "Jinsun Liu",
      "Ram Vasudevan"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.12283",
    "title": "Energy Consumption in RES-Aware 5G Networks",
    "abstract": "In this work, the impact of using Renewable Energy Source (RES) generators in next-generation (5G) cellular systems on total power consumption (PC) has been investigated. The paper highlights the gain related to the use of photovoltaic (PV) panels and wind turbines (WTs) in the form of two factors - the average extension of battery lifetime (AEBL) powering a single network cell and the average reduction in energy consumption (AREC) within the whole network. The examination has been conducted for four different seasons of the year and various configurations of available power sources. The provided system scenario was based on real data on weather conditions, building placement, and implemented mobile networks for the city of Poznan in Poland. Used RES generators were designed in accordance with the specifications of real devices. ",
    "url": "https://arxiv.org/abs/2403.12283",
    "authors": [
      "Adam Samorzewski",
      "Margot Deruyck",
      "Adrian Kliks"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2403.12289",
    "title": "BostonTwin: the Boston Digital Twin for Ray-Tracing in 6G Networks",
    "abstract": "Digital twins are now a staple of wireless networks design and evolution. Creating an accurate digital copy of a real system offers numerous opportunities to study and analyze its performance and issues. It also allows designing and testing new solutions in a risk-free environment, and applying them back to the real system after validation. A candidate technology that will heavily rely on digital twins for design and deployment is 6G, which promises robust and ubiquitous networks for eXtended Reality (XR) and immersive communications solutions. In this paper, we present BostonTwin, a dataset that merges a high-fidelity 3D model of the city of Boston, MA, with the existing geospatial data on cellular base stations deployments, in a ray-tracing-ready format. Thus, BostonTwin enables not only the instantaneous rendering and programmatic access to the building models, but it also allows for an accurate representation of the electromagnetic propagation environment in the real-world city of Boston. The level of detail and accuracy of this characterization is crucial to designing 6G networks that can support the strict requirements of sensitive and high-bandwidth applications, such as XR and immersive communication. ",
    "url": "https://arxiv.org/abs/2403.12289",
    "authors": [
      "Paolo Testolina",
      "Michele Polese",
      "Pedram Johari",
      "Tommaso Melodia"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.12307",
    "title": "Molecular Classification Using Hyperdimensional Graph Classification",
    "abstract": "Our work introduces an innovative approach to graph learning by leveraging Hyperdimensional Computing. Graphs serve as a widely embraced method for conveying information, and their utilization in learning has gained significant attention. This is notable in the field of chemoinformatics, where learning from graph representations plays a pivotal role. An important application within this domain involves the identification of cancerous cells across diverse molecular structures. We propose an HDC-based model that demonstrates comparable Area Under the Curve results when compared to state-of-the-art models like Graph Neural Networks (GNNs) or the Weisfieler-Lehman graph kernel (WL). Moreover, it outperforms previously proposed hyperdimensional computing graph learning methods. Furthermore, it achieves noteworthy speed enhancements, boasting a 40x acceleration in the training phase and a 15x improvement in inference time compared to GNN and WL models. This not only underscores the efficacy of the HDC-based method, but also highlights its potential for expedited and resource-efficient graph learning. ",
    "url": "https://arxiv.org/abs/2403.12307",
    "authors": [
      "Pere Verges",
      "Igor Nunes",
      "Mike Heddes",
      "Tony Givargis",
      "Alexandru Nicolau"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2403.12320",
    "title": "Approximated Likelihood Ratio: A Forward-Only and Parallel Framework for  Boosting Neural Network Training",
    "abstract": "Efficient and biologically plausible alternatives to backpropagation in neural network training remain a challenge due to issues such as high computational complexity and additional assumptions about neural networks, which limit scalability to deeper networks. The likelihood ratio method offers a promising gradient estimation strategy but is constrained by significant memory consumption, especially when deploying multiple copies of data to reduce estimation variance. In this paper, we introduce an approximation technique for the likelihood ratio (LR) method to alleviate computational and memory demands in gradient estimation. By exploiting the natural parallelism during the backward pass using LR, we further provide a high-performance training strategy, which pipelines both the forward and backward pass, to make it more suitable for the computation on specialized hardware. Extensive experiments demonstrate the effectiveness of the approximation technique in neural network training. This work underscores the potential of the likelihood ratio method in achieving high-performance neural network training, suggesting avenues for further exploration. ",
    "url": "https://arxiv.org/abs/2403.12320",
    "authors": [
      "Zeliang Zhang",
      "Jinyang Jiang",
      "Zhuo Liu",
      "Susan Liang",
      "Yijie Peng",
      "Chenliang Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.12321",
    "title": "Explainable agency: human preferences for simple or complex explanations",
    "abstract": "Research in cognitive psychology has established that whether people prefer simpler explanations to complex ones is context dependent, but the question of `simple vs. complex' becomes critical when an artificial agent seeks to explain its decisions or predictions to humans. We present a model for abstracting causal reasoning chains for the purpose of explanation. This model uses a set of rules to progressively abstract different types of causal information in causal proof traces. We perform online studies using 123 Amazon MTurk participants and with five industry experts over two domains: maritime patrol and weather prediction. We found participants' satisfaction with generated explanations was based on the consistency of relationships among the causes (coherence) that explain an event; and that the important question is not whether people prefer simple or complex explanations, but what types of causal information are relevant to individuals in specific contexts. ",
    "url": "https://arxiv.org/abs/2403.12321",
    "authors": [
      "Michelle Blom",
      "Ronal Singh",
      "Tim Miller",
      "Liz Sonenberg",
      "Kerry Trentelman",
      "Adam Saulwick"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2403.12323",
    "title": "Enhanced Detection of Transdermal Alcohol Levels Using Hyperdimensional  Computing on Embedded Devices",
    "abstract": "Alcohol consumption has a significant impact on individuals' health, with even more pronounced consequences when consumption becomes excessive. One approach to promoting healthier drinking habits is implementing just-in-time interventions, where timely notifications indicating intoxication are sent during heavy drinking episodes. However, the complexity or invasiveness of an intervention mechanism may deter an individual from using them in practice. Previous research tackled this challenge using collected motion data and conventional Machine Learning (ML) algorithms to classify heavy drinking episodes, but with impractical accuracy and computational efficiency for mobile devices. Consequently, we have elected to use Hyperdimensional Computing (HDC) to design a just-in-time intervention approach that is practical for smartphones, smart wearables, and IoT deployment. HDC is a framework that has proven results in processing real-time sensor data efficiently. This approach offers several advantages, including low latency, minimal power consumption, and high parallelism. We explore various HDC encoding designs and combine them with various HDC learning models to create an optimal and feasible approach for mobile devices. Our findings indicate an accuracy rate of 89\\%, which represents a substantial 12\\% improvement over the current state-of-the-art. ",
    "url": "https://arxiv.org/abs/2403.12323",
    "authors": [
      "Manuel E. Segura",
      "Pere Verges",
      "Justin Tian Jin Chen",
      "Ramesh Arangott",
      "Angela Kristine Garcia",
      "Laura Garcia Reynoso",
      "Alexandru Nicolau",
      "Tony Givargis",
      "Sergio Gago-Masague"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12334",
    "title": "Structural Validation Of Synthetic Power Distribution Networks Using The  Multiscale Flat Norm",
    "abstract": "We study the problem of comparing a pair of geometric networks that may not be similarly defined, i.e., when they do not have one-to-one correspondences between their nodes and edges. Our motivating application is to compare power distribution networks of a region. Due to the lack of openly available power network datasets, researchers synthesize realistic networks resembling their actual counterparts. But the synthetic digital twins may vary significantly from one another and from actual networks due to varying underlying assumptions and approaches. Hence the user wants to evaluate the quality of networks in terms of their structural similarity to actual power networks. But the lack of correspondence between the networks renders most standard approaches, e.g., subgraph isomorphism and edit distance, unsuitable. We propose an approach based on the multiscale flat norm, a notion of distance between objects defined in the field of geometric measure theory, to compute the distance between a pair of planar geometric networks. Using a triangulation of the domain containing the input networks, the flat norm distance between two networks at a given scale can be computed by solving a linear program. In addition, this computation automatically identifies the 2D regions (patches) that capture where the two networks are different. We demonstrate through 2D examples that the flat norm distance can capture the variations of inputs more accurately than the commonly used Hausdorff distance. As a notion of stability, we also derive upper bounds on the flat norm distance between a simple 1D curve and its perturbed version as a function of the radius of perturbation for a restricted class of perturbations. We demonstrate our approach on a set of actual power networks from a county in the USA. ",
    "url": "https://arxiv.org/abs/2403.12334",
    "authors": [
      "Kostiantyn Lyman",
      "Rounak Meyur",
      "Bala Krishnamoorthy",
      "Mahantesh Halappanavar"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Algebraic Topology (math.AT)",
      "Differential Geometry (math.DG)"
    ]
  },
  {
    "id": "arXiv:2403.12362",
    "title": "DMAD: Dual Memory Bank for Real-World Anomaly Detection",
    "abstract": "Training a unified model is considered to be more suitable for practical industrial anomaly detection scenarios due to its generalization ability and storage efficiency. However, this multi-class setting, which exclusively uses normal data, overlooks the few but important accessible annotated anomalies in the real world. To address the challenge of real-world anomaly detection, we propose a new framework named Dual Memory bank enhanced representation learning for Anomaly Detection (DMAD). This framework handles both unsupervised and semi-supervised scenarios in a unified (multi-class) setting. DMAD employs a dual memory bank to calculate feature distance and feature attention between normal and abnormal patterns, thereby encapsulating knowledge about normal and abnormal instances. This knowledge is then used to construct an enhanced representation for anomaly score learning. We evaluated DMAD on the MVTec-AD and VisA datasets. The results show that DMAD surpasses current state-of-the-art methods, highlighting DMAD's capability in handling the complexities of real-world anomaly detection scenarios. ",
    "url": "https://arxiv.org/abs/2403.12362",
    "authors": [
      "Jianlong Hu",
      "Xu Chen",
      "Zhenye Gan",
      "Jinlong Peng",
      "Shengchuan Zhang",
      "Jiangning Zhang",
      "Yabiao Wang",
      "Chengjie Wang",
      "Liujuan Cao",
      "Rongrong Ji"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12364",
    "title": "Class and Region-Adaptive Constraints for Network Calibration",
    "abstract": "In this work, we present a novel approach to calibrate segmentation networks that considers the inherent challenges posed by different categories and object regions. In particular, we present a formulation that integrates class and region-wise constraints into the learning objective, with multiple penalty weights to account for class and region differences. Finding the optimal penalty weights manually, however, might be unfeasible, and potentially hinder the optimization process. To overcome this limitation, we propose an approach based on Class and Region-Adaptive constraints (CRaC), which allows to learn the class and region-wise penalty weights during training. CRaC is based on a general Augmented Lagrangian method, a well-established technique in constrained optimization. Experimental results on two popular segmentation benchmarks, and two well-known segmentation networks, demonstrate the superiority of CRaC compared to existing approaches. The code is available at: https://github.com/Bala93/CRac/ ",
    "url": "https://arxiv.org/abs/2403.12364",
    "authors": [
      "Balamurali Murugesan",
      "Julio Silva-Rodriguez",
      "Ismail Ben Ayed",
      "Jose Dolz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12374",
    "title": "Improving Generalizability of Extracting Social Determinants of Health  Using Large Language Models through Prompt-tuning",
    "abstract": "The progress in natural language processing (NLP) using large language models (LLMs) has greatly improved patient information extraction from clinical narratives. However, most methods based on the fine-tuning strategy have limited transfer learning ability for cross-domain applications. This study proposed a novel approach that employs a soft prompt-based learning architecture, which introduces trainable prompts to guide LLMs toward desired outputs. We examined two types of LLM architectures, including encoder-only GatorTron and decoder-only GatorTronGPT, and evaluated their performance for the extraction of social determinants of health (SDoH) using a cross-institution dataset from the 2022 n2c2 challenge and a cross-disease dataset from the University of Florida (UF) Health. The results show that decoder-only LLMs with prompt tuning achieved better performance in cross-domain applications. GatorTronGPT achieved the best F1 scores for both datasets, outperforming traditional fine-tuned GatorTron by 8.9% and 21.8% in a cross-institution setting, and 5.5% and 14.5% in a cross-disease setting. ",
    "url": "https://arxiv.org/abs/2403.12374",
    "authors": [
      "Cheng Peng",
      "Zehao Yu",
      "Kaleb E Smith",
      "Wei-Hsuan Lo-Ciganic",
      "Jiang Bian",
      "Yonghui Wu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.12398",
    "title": "Hierarchical Digital Twin for Efficient 6G Network Orchestration via  Adaptive Attribute Selection and Scalable Network Modeling",
    "abstract": "Achieving a holistic and long-term understanding through accurate network modeling is essential for orchestrating future networks with increasing service diversity and infrastructure complexities. However, due to unselective data collection and uniform processing, traditional modeling approaches undermine the efficacy and timeliness of network orchestration. Additionally, temporal disparities arising from various modeling delays further impair the centralized decision-making with distributed models. In this paper, we propose a new hierarchical digital twin paradigm adapting to real-time network situations for problem-centered model construction. Specifically, we introduce an adaptive attribute selection mechanism that evaluates the distinct modeling values of diverse network attributes, considering their relevance to current network scenarios and inherent modeling complexity. By prioritizing critical attributes at higher layers, an efficient evaluation of network situations is achieved to identify target areas. Subsequently, scalable network modeling facilitates the inclusion of all identified elements at the lower layers, where more fine-grained digital twins are developed to generate targeted solutions for user association and power allocation. Furthermore, virtual-physical domain synchronization is implemented to maintain accurate temporal alignment between the digital twins and their physical counterparts, spanning from the construction to the utilization of the proposed paradigm. Extensive simulations validate the proposed approach, demonstrating its effectiveness in efficiently identifying pressing issues and delivering network orchestration solutions in complex 6G HetNets. ",
    "url": "https://arxiv.org/abs/2403.12398",
    "authors": [
      "Pengyi Jia",
      "Xianbin Wang",
      "Xuemin",
      "Shen"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2403.12399",
    "title": "Electioneering the Network: Dynamic Multi-Step Adversarial Attacks for  Community Canvassing",
    "abstract": "The problem of online social network manipulation for community canvassing is of real concern in today's world. Motivated by the study of voter models, opinion and polarization dynamics on networks, we model community canvassing as a dynamic process over a network enabled via gradient-based attacks on GNNs. Existing attacks on GNNs are all single-step and do not account for the dynamic cascading nature of information diffusion in networks. We consider the realistic scenario where an adversary uses a GNN as a proxy to predict and manipulate voter preferences, especially uncertain voters. Gradient-based attacks on the GNN inform the adversary of strategic manipulations that can be made to proselytize targeted voters. In particular, we explore $\\textit{minimum budget attacks for community canvassing}$ (MBACC). We show that the MBACC problem is NP-Hard and propose Dynamic Multi-Step Adversarial Community Canvassing (MAC) to address it. MAC makes dynamic local decisions based on the heuristic of low budget and high second-order influence to convert and perturb target voters. MAC is a dynamic multi-step attack that discovers low-budget and high-influence targets from which efficient cascading attacks can happen. We evaluate MAC against single-step baselines on the MBACC problem with multiple underlying networks and GNN models. Our experiments show the superiority of MAC which is able to discover efficient multi-hop attacks for adversarial community canvassing. Our code implementation and data is available at https://github.com/saurabhsharma1993/mac. ",
    "url": "https://arxiv.org/abs/2403.12399",
    "authors": [
      "Saurabh Sharma",
      "Ambuj SIngh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.12401",
    "title": "VQ-NeRV: A Vector Quantized Neural Representation for Videos",
    "abstract": "Implicit neural representations (INR) excel in encoding videos within neural networks, showcasing promise in computer vision tasks like video compression and denoising. INR-based approaches reconstruct video frames from content-agnostic embeddings, which hampers their efficacy in video frame regression and restricts their generalization ability for video interpolation. To address these deficiencies, Hybrid Neural Representation for Videos (HNeRV) was introduced with content-adaptive embeddings. Nevertheless, HNeRV's compression ratios remain relatively low, attributable to an oversight in leveraging the network's shallow features and inter-frame residual information. In this work, we introduce an advanced U-shaped architecture, Vector Quantized-NeRV (VQ-NeRV), which integrates a novel component--the VQ-NeRV Block. This block incorporates a codebook mechanism to discretize the network's shallow residual features and inter-frame residual information effectively. This approach proves particularly advantageous in video compression, as it results in smaller size compared to quantized features. Furthermore, we introduce an original codebook optimization technique, termed shallow codebook optimization, designed to refine the utility and efficiency of the codebook. The experimental evaluations indicate that VQ-NeRV outperforms HNeRV on video regression tasks, delivering superior reconstruction quality (with an increase of 1-2 dB in Peak Signal-to-Noise Ratio (PSNR)), better bit per pixel (bpp) efficiency, and improved video inpainting outcomes. ",
    "url": "https://arxiv.org/abs/2403.12401",
    "authors": [
      "Yunjie Xu",
      "Xiang Feng",
      "Feiwei Qin",
      "Ruiquan Ge",
      "Yong Peng",
      "Changmiao Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12403",
    "title": "Towards Interpretable Hate Speech Detection using Large Language  Model-extracted Rationales",
    "abstract": "Although social media platforms are a prominent arena for users to engage in interpersonal discussions and express opinions, the facade and anonymity offered by social media may allow users to spew hate speech and offensive content. Given the massive scale of such platforms, there arises a need to automatically identify and flag instances of hate speech. Although several hate speech detection methods exist, most of these black-box methods are not interpretable or explainable by design. To address the lack of interpretability, in this paper, we propose to use state-of-the-art Large Language Models (LLMs) to extract features in the form of rationales from the input text, to train a base hate speech classifier, thereby enabling faithful interpretability by design. Our framework effectively combines the textual understanding capabilities of LLMs and the discriminative power of state-of-the-art hate speech classifiers to make these classifiers faithfully interpretable. Our comprehensive evaluation on a variety of social media hate speech datasets demonstrate: (1) the goodness of the LLM-extracted rationales, and (2) the surprising retention of detector performance even after training to ensure interpretability. ",
    "url": "https://arxiv.org/abs/2403.12403",
    "authors": [
      "Ayushi Nirmal",
      "Amrita Bhattacharjee",
      "Paras Sheth",
      "Huan Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12410",
    "title": "TikTok and the Art of Personalization: Investigating Exploration and  Exploitation on Social Media Feeds",
    "abstract": "Recommendation algorithms for social media feeds often function as black boxes from the perspective of users. We aim to detect whether social media feed recommendations are personalized to users, and to characterize the factors contributing to personalization in these feeds. We introduce a general framework to examine a set of social media feed recommendations for a user as a timeline. We label items in the timeline as the result of exploration vs. exploitation of the user's interests on the part of the recommendation algorithm and introduce a set of metrics to capture the extent of personalization across user timelines. We apply our framework to a real TikTok dataset and validate our results using a baseline generated from automated TikTok bots, as well as a randomized baseline. We also investigate the extent to which factors such as video viewing duration, liking, and following drive the personalization of content on TikTok. Our results demonstrate that our framework produces intuitive and explainable results, and can be used to audit and understand personalization in social media feeds. ",
    "url": "https://arxiv.org/abs/2403.12410",
    "authors": [
      "Karan Vombatkere",
      "Sepehr Mousavi",
      "Savvas Zannettou",
      "Franziska Roesner",
      "Krishna P. Gummadi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.12413",
    "title": "Third-Party Language Model Performance Prediction from Instruction",
    "abstract": "Language model-based instruction-following systems have lately shown increasing performance on many benchmark tasks, demonstrating the capability of adapting to a broad variety of instructions. However, such systems are often not designed to be transparent about their limitations; a user may easily prompt a model with an instruction without any idea of whether the responses should be expected to be accurate, or if the system is even capable of performing the task. We propose a third party performance prediction framework, where a separate model is trained to predict the metric resulting from evaluating an instruction-following system on a task while assuming access only to its inputs and outputs at inference time. We perform this analysis with a variety of both open and closed instruction-following models as well as multiple performance predictors, and examine the effect of various factors such as model size, number of training tasks, and prompt format. Our findings indicate that third-party performance prediction is very challenging, and much work remains in developing predictors that can automatically reveal the limitations of modern instruction-following natural language processing systems. ",
    "url": "https://arxiv.org/abs/2403.12413",
    "authors": [
      "Rahul Nadkarni",
      "Yizhong Wang",
      "Noah A. Smith"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.12415",
    "title": "VisionGPT: LLM-Assisted Real-Time Anomaly Detection for Safe Visual  Navigation",
    "abstract": "This paper explores the potential of Large Language Models(LLMs) in zero-shot anomaly detection for safe visual navigation. With the assistance of the state-of-the-art real-time open-world object detection model Yolo-World and specialized prompts, the proposed framework can identify anomalies within camera-captured frames that include any possible obstacles, then generate concise, audio-delivered descriptions emphasizing abnormalities, assist in safe visual navigation in complex circumstances. Moreover, our proposed framework leverages the advantages of LLMs and the open-vocabulary object detection model to achieve the dynamic scenario switch, which allows users to transition smoothly from scene to scene, which addresses the limitation of traditional visual navigation. Furthermore, this paper explored the performance contribution of different prompt components, provided the vision for future improvement in visual accessibility, and paved the way for LLMs in video anomaly detection and vision-language understanding. ",
    "url": "https://arxiv.org/abs/2403.12415",
    "authors": [
      "Hao Wang",
      "Jiayou Qin",
      "Ashish Bastola",
      "Xiwen Chen",
      "John Suchanek",
      "Zihao Gong",
      "Abolfazl Razi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2403.12418",
    "title": "STG-Mamba: Spatial-Temporal Graph Learning via Selective State Space  Model",
    "abstract": "Spatial-Temporal Graph (STG) data is characterized as dynamic, heterogenous, and non-stationary, leading to the continuous challenge of spatial-temporal graph learning. In the past few years, various GNN-based methods have been proposed to solely focus on mimicking the relationships among node individuals of the STG network, ignoring the significance of modeling the intrinsic features that exist in STG system over time. In contrast, modern Selective State Space Models (SSSMs) present a new approach which treat STG Network as a system, and meticulously explore the STG system's dynamic state evolution across temporal dimension. In this work, we introduce Spatial-Temporal Graph Mamba (STG-Mamba) as the first exploration of leveraging the powerful selective state space models for STG learning by treating STG Network as a system, and employing the Graph Selective State Space Block (GS3B) to precisely characterize the dynamic evolution of STG networks. STG-Mamba is formulated as an Encoder-Decoder architecture, which takes GS3B as the basic module, for efficient sequential data modeling. Furthermore, to strengthen GNN's ability of modeling STG data under the setting of SSSMs, we propose Kalman Filtering Graph Neural Networks (KFGN) for adaptive graph structure upgrading. KFGN smoothly fits in the context of selective state space evolution, and at the same time keeps linear complexity. Extensive empirical studies are conducted on three benchmark STG forecasting datasets, demonstrating the performance superiority and computational efficiency of STG-Mamba. It not only surpasses existing state-of-the-art methods in terms of STG forecasting performance, but also effectively alleviate the computational bottleneck of large-scale graph networks in reducing the computational cost of FLOPs and test inference time. ",
    "url": "https://arxiv.org/abs/2403.12418",
    "authors": [
      "Lincan Li",
      "Hanchen Wang",
      "Wenjie Zhang",
      "Adelle Coster"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.12433",
    "title": "Algorithmic Complexity Attacks on Dynamic Learned Indexes",
    "abstract": "Learned Index Structures (LIS) view a sorted index as a model that learns the data distribution, takes a data element key as input, and outputs the predicted position of the key. The original LIS can only handle lookup operations with no support for updates, rendering it impractical to use for typical workloads. To address this limitation, recent studies have focused on designing efficient dynamic learned indexes. ALEX, as the pioneering dynamic learned index structures, enables dynamism by incorporating a series of design choices, including adaptive key space partitioning, dynamic model retraining, and sophisticated engineering and policies that prioritize read/write performance. While these design choices offer improved average-case performance, the emphasis on flexibility and performance increases the attack surface by allowing adversarial behaviors that maximize ALEX's memory space and time complexity in worst-case scenarios. In this work, we present the first systematic investigation of algorithmic complexity attacks (ACAs) targeting the worst-case scenarios of ALEX. We introduce new ACAs that fall into two categories, space ACAs and time ACAs, which target the memory space and time complexity, respectively. First, our space ACA on data nodes exploits ALEX's gapped array layout and uses Multiple-Choice Knapsack (MCK) to generate an optimal adversarial insertion plan for maximizing the memory consumption at the data node level. Second, our space ACA on internal nodes exploits ALEX's catastrophic cost mitigation mechanism, causing an out-of-memory error with only a few hundred adversarial insertions. Third, our time ACA generates pathological insertions to increase the disparity between the actual key distribution and the linear models of data nodes, deteriorating the runtime performance by up to 1,641X compared to ALEX operating under legitimate workloads. ",
    "url": "https://arxiv.org/abs/2403.12433",
    "authors": [
      "Rui Yang",
      "Evgenios M. Kornaropoulos",
      "Yue Cheng"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.12445",
    "title": "Boosting Transferability in Vision-Language Attacks via Diversification  along the Intersection Region of Adversarial Trajectory",
    "abstract": "Vision-language pre-training (VLP) models exhibit remarkable capabilities in comprehending both images and text, yet they remain susceptible to multimodal adversarial examples (AEs). Strengthening adversarial attacks and uncovering vulnerabilities, especially common issues in VLP models (e.g., high transferable AEs), can stimulate further research on constructing reliable and practical VLP models. A recent work (i.e., Set-level guidance attack) indicates that augmenting image-text pairs to increase AE diversity along the optimization path enhances the transferability of adversarial examples significantly. However, this approach predominantly emphasizes diversity around the online adversarial examples (i.e., AEs in the optimization period), leading to the risk of overfitting the victim model and affecting the transferability. In this study, we posit that the diversity of adversarial examples towards the clean input and online AEs are both pivotal for enhancing transferability across VLP models. Consequently, we propose using diversification along the intersection region of adversarial trajectory to expand the diversity of AEs. To fully leverage the interaction between modalities, we introduce text-guided adversarial example selection during optimization. Furthermore, to further mitigate the potential overfitting, we direct the adversarial text deviating from the last intersection region along the optimization path, rather than adversarial images as in existing methods. Extensive experiments affirm the effectiveness of our method in improving transferability across various VLP models and downstream vision-and-language tasks (e.g., Image-Text Retrieval(ITR), Visual Grounding(VG), Image Captioning(IC)). ",
    "url": "https://arxiv.org/abs/2403.12445",
    "authors": [
      "Sensen Gao",
      "Xiaojun Jia",
      "Xuhong Ren",
      "Ivor Tsang",
      "Qing Guo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12462",
    "title": "Topological Representations of Heterogeneous Learning Dynamics of  Recurrent Spiking Neural Networks",
    "abstract": "Spiking Neural Networks (SNNs) have become an essential paradigm in neuroscience and artificial intelligence, providing brain-inspired computation. Recent advances in literature have studied the network representations of deep neural networks. However, there has been little work that studies representations learned by SNNs, especially using unsupervised local learning methods like spike-timing dependent plasticity (STDP). Recent work by \\cite{barannikov2021representation} has introduced a novel method to compare topological mappings of learned representations called Representation Topology Divergence (RTD). Though useful, this method is engineered particularly for feedforward deep neural networks and cannot be used for recurrent networks like Recurrent SNNs (RSNNs). This paper introduces a novel methodology to use RTD to measure the difference between distributed representations of RSNN models with different learning methods. We propose a novel reformulation of RSNNs using feedforward autoencoder networks with skip connections to help us compute the RTD for recurrent networks. Thus, we investigate the learning capabilities of RSNN trained using STDP and the role of heterogeneity in the synaptic dynamics in learning such representations. We demonstrate that heterogeneous STDP in RSNNs yield distinct representations than their homogeneous and surrogate gradient-based supervised learning counterparts. Our results provide insights into the potential of heterogeneous SNN models, aiding the development of more efficient and biologically plausible hybrid artificial intelligence systems. ",
    "url": "https://arxiv.org/abs/2403.12462",
    "authors": [
      "Biswadeep Chakraborty",
      "Saibal Mukhopadhyay"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.12473",
    "title": "PostoMETRO: Pose Token Enhanced Mesh Transformer for Robust 3D Human  Mesh Recovery",
    "abstract": "With the recent advancements in single-image-based human mesh recovery, there is a growing interest in enhancing its performance in certain extreme scenarios, such as occlusion, while maintaining overall model accuracy. Although obtaining accurately annotated 3D human poses under occlusion is challenging, there is still a wealth of rich and precise 2D pose annotations that can be leveraged. However, existing works mostly focus on directly leveraging 2D pose coordinates to estimate 3D pose and mesh. In this paper, we present PostoMETRO($\\textbf{Pos}$e $\\textbf{to}$ken enhanced $\\textbf{ME}$sh $\\textbf{TR}$ansf$\\textbf{O}$rmer), which integrates occlusion-resilient 2D pose representation into transformers in a token-wise manner. Utilizing a specialized pose tokenizer, we efficiently condense 2D pose data to a compact sequence of pose tokens and feed them to the transformer together with the image tokens. This process not only ensures a rich depiction of texture from the image but also fosters a robust integration of pose and image information. Subsequently, these combined tokens are queried by vertex and joint tokens to decode 3D coordinates of mesh vertices and human joints. Facilitated by the robust pose token representation and the effective combination, we are able to produce more precise 3D coordinates, even under extreme scenarios like occlusion. Experiments on both standard and occlusion-specific benchmarks demonstrate the effectiveness of PostoMETRO. Qualitative results further illustrate the clarity of how 2D pose can help 3D reconstruction. Code will be made available. ",
    "url": "https://arxiv.org/abs/2403.12473",
    "authors": [
      "Wendi Yang",
      "Zihang Jiang",
      "Shang Zhao",
      "S. Kevin Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12474",
    "title": "FairSIN: Achieving Fairness in Graph Neural Networks through Sensitive  Information Neutralization",
    "abstract": "Despite the remarkable success of graph neural networks (GNNs) in modeling graph-structured data, like other machine learning models, GNNs are also susceptible to making biased predictions based on sensitive attributes, such as race and gender. For fairness consideration, recent state-of-the-art (SOTA) methods propose to filter out sensitive information from inputs or representations, e.g., edge dropping or feature masking. However, we argue that such filtering-based strategies may also filter out some non-sensitive feature information, leading to a sub-optimal trade-off between predictive performance and fairness. To address this issue, we unveil an innovative neutralization-based paradigm, where additional Fairness-facilitating Features (F3) are incorporated into node features or representations before message passing. The F3 are expected to statistically neutralize the sensitive bias in node representations and provide additional nonsensitive information. We also provide theoretical explanations for our rationale, concluding that F3 can be realized by emphasizing the features of each node's heterogeneous neighbors (neighbors with different sensitive attributes). We name our method as FairSIN, and present three implementation variants from both data-centric and model-centric perspectives. Experimental results on five benchmark datasets with three different GNN backbones show that FairSIN significantly improves fairness metrics while maintaining high prediction accuracies. ",
    "url": "https://arxiv.org/abs/2403.12474",
    "authors": [
      "Cheng Yang",
      "Jixi Liu",
      "Yunhe Yan",
      "Chuan Shi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2403.12481",
    "title": "TT-BLIP: Enhancing Fake News Detection Using BLIP and Tri-Transformer",
    "abstract": "Detecting fake news has received a lot of attention. Many previous methods concatenate independently encoded unimodal data, ignoring the benefits of integrated multimodal information. Also, the absence of specialized feature extraction for text and images further limits these methods. This paper introduces an end-to-end model called TT-BLIP that applies the bootstrapping language-image pretraining for unified vision-language understanding and generation (BLIP) for three types of information: BERT and BLIP\\textsubscript{Txt} for text, ResNet and BLIP\\textsubscript{Img} for images, and bidirectional BLIP encoders for multimodal information. The Multimodal Tri-Transformer fuses tri-modal features using three types of multi-head attention mechanisms, ensuring integrated modalities for enhanced representations and improved multimodal data analysis. The experiments are performed using two fake news datasets, Weibo and Gossipcop. The results indicate TT-BLIP outperforms the state-of-the-art models. ",
    "url": "https://arxiv.org/abs/2403.12481",
    "authors": [
      "Eunjee Choi",
      "Jong-Kook Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12488",
    "title": "DetToolChain: A New Prompting Paradigm to Unleash Detection Ability of  MLLM",
    "abstract": "We present DetToolChain, a novel prompting paradigm, to unleash the zero-shot object detection ability of multimodal large language models (MLLMs), such as GPT-4V and Gemini. Our approach consists of a detection prompting toolkit inspired by high-precision detection priors and a new Chain-of-Thought to implement these prompts. Specifically, the prompts in the toolkit are designed to guide the MLLM to focus on regional information (e.g., zooming in), read coordinates according to measure standards (e.g., overlaying rulers and compasses), and infer from the contextual information (e.g., overlaying scene graphs). Building upon these tools, the new detection chain-of-thought can automatically decompose the task into simple subtasks, diagnose the predictions, and plan for progressive box refinements. The effectiveness of our framework is demonstrated across a spectrum of detection tasks, especially hard cases. Compared to existing state-of-the-art methods, GPT-4V with our DetToolChain improves state-of-the-art object detectors by +21.5% AP50 on MS COCO Novel class set for open-vocabulary detection, +24.23% Acc on RefCOCO val set for zero-shot referring expression comprehension, +14.5% AP on D-cube describe object detection FULL setting. ",
    "url": "https://arxiv.org/abs/2403.12488",
    "authors": [
      "Yixuan Wu",
      "Yizhou Wang",
      "Shixiang Tang",
      "Wenhao Wu",
      "Tong He",
      "Wanli Ouyang",
      "Jian Wu",
      "Philip Torr"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.12490",
    "title": "Genetically programmable optical random neural networks",
    "abstract": "Today, machine learning tools, particularly artificial neural networks, have become crucial for diverse applications. However, current digital computing tools to train and deploy artificial neural networks often struggle with massive data sizes and high power consumptions. Optical computing provides inherent parallelism and perform fundamental operations with passive optical components. However, most of the optical computing platforms suffer from relatively low accuracies for machine learning tasks due to fixed connections while avoiding complex and sensitive techniques. Here, we demonstrate a genetically programmable yet simple optical neural network to achieve high performances with optical random projection. By genetically programming the orientation of the scattering medium which acts as a random projection kernel and only using 1% of the search space, our novel technique finds an optimum kernel and improves its initial test accuracies 7-22% for various machine learning tasks. Our optical computing method presents a promising approach to achieve high performance in optical neural networks with a simple and scalable design. ",
    "url": "https://arxiv.org/abs/2403.12490",
    "authors": [
      "Bora Çarpınlıoğlu",
      "Bahrem Serhat Daniş",
      "Uğur Teğin"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2403.12493",
    "title": "A Trainable Feature Extractor Module for Deep Neural Networks and  Scanpath Classification",
    "abstract": "Scanpath classification is an area in eye tracking research with possible applications in medicine, manufacturing as well as training systems for students in various domains. In this paper we propose a trainable feature extraction module for deep neural networks. The purpose of this module is to transform a scanpath into a feature vector which is directly useable for the deep neural network architecture. Based on the backpropagated error of the deep neural network, the feature extraction module adapts its parameters to improve the classification performance. Therefore, our feature extraction module is jointly trainable with the deep neural network. The motivation to this feature extraction module is based on classical histogram-based approaches which usually compute distributions over a scanpath. We evaluated our module on three public datasets and compared it to the state of the art approaches. ",
    "url": "https://arxiv.org/abs/2403.12493",
    "authors": [
      "Wolfgang Fuhl"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12504",
    "title": "TON-VIO: Online Time Offset Modeling Networks for Robust Temporal  Alignment in High Dynamic Motion VIO",
    "abstract": "Temporal misalignment (time offset) between sensors is common in low cost visual-inertial odometry (VIO) systems. Such temporal misalignment introduces inconsistent constraints for state estimation, leading to a significant positioning drift especially in high dynamic motion scenarios. In this article, we focus on online temporal calibration to reduce the positioning drift caused by the time offset for high dynamic motion VIO. For the time offset observation model, most existing methods rely on accurate state estimation or stable visual tracking. For the prediction model, current methods oversimplify the time offset as a constant value with white Gaussian noise. However, these ideal conditions are seldom satisfied in real high dynamic scenarios, resulting in the poor performance. In this paper, we introduce online time offset modeling networks (TON) to enhance real-time temporal calibration. TON improves the accuracy of time offset observation and prediction modeling. Specifically, for observation modeling, we propose feature velocity observation networks to enhance velocity computation for features in unstable visual tracking conditions. For prediction modeling, we present time offset prediction networks to learn its evolution pattern. To highlight the effectiveness of our method, we integrate the proposed TON into both optimization-based and filter-based VIO systems. Simulation and real-world experiments are conducted to demonstrate the enhanced performance of our approach. Additionally, to contribute to the VIO community, we will open-source the code of our method on: https://github.com/Franky-X/FVON-TPN. ",
    "url": "https://arxiv.org/abs/2403.12504",
    "authors": [
      "Chaoran Xiong",
      "Guoqing Liu",
      "Qi Wu",
      "Songpengcheng Xia",
      "Tong Hua",
      "Kehui Ma",
      "Zhen Sun",
      "Yan Xiang",
      "Ling Pei"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.12506",
    "title": "Sparse Estimation for XL-MIMO with Unified LoS/NLoS Representation",
    "abstract": "Extremely large-scale antenna array (ELAA) is promising as one of the key ingredients for the sixth generation (6G) of wireless communications. The electromagnetic propagation of spherical wavefronts introduces an additional distance-dependent dimension beyond conventional beamspace. In this paper, we first present one concise closed-form channel formulation for extremely large-scale multiple-input multiple-output (XL-MIMO). All line-of-sight (LoS) and non-line-of-sight (NLoS) paths, far-field and near-field scenarios, and XL-MIMO and XL-MISO channels are unified under the framework, where additional Vandermonde windowing matrix is exclusively considered for LoS path. Under this framework, we further propose one low-complexity unified LoS/NLoS orthogonal matching pursuit (XL-UOMP) algorithm for XL-MIMO channel estimation. The simulation results demonstrate the superiority of the proposed algorithm on both estimation accuracy and pilot consumption. ",
    "url": "https://arxiv.org/abs/2403.12506",
    "authors": [
      "Xu Shi",
      "Xuehan Wang",
      "Jingbo Tan",
      "Jintao Wang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.12511",
    "title": "Forward Gradient-Based Frank-Wolfe Optimization for Memory Efficient  Deep Neural Network Training",
    "abstract": "Training a deep neural network using gradient-based methods necessitates the calculation of gradients at each level. However, using backpropagation or reverse mode differentiation, to calculate the gradients necessities significant memory consumption, rendering backpropagation an inefficient method for computing gradients. This paper focuses on analyzing the performance of the well-known Frank-Wolfe algorithm, a.k.a. conditional gradient algorithm by having access to the forward mode of automatic differentiation to compute gradients. We provide in-depth technical details that show the proposed Algorithm does converge to the optimal solution with a sub-linear rate of convergence by having access to the noisy estimate of the true gradient obtained in the forward mode of automated differentiation, referred to as the Projected Forward Gradient. In contrast, the standard Frank-Wolfe algorithm, when provided with access to the Projected Forward Gradient, fails to converge to the optimal solution. We demonstrate the convergence attributes of our proposed algorithms using a numerical example. ",
    "url": "https://arxiv.org/abs/2403.12511",
    "authors": [
      "M. Rostami",
      "S. S. Kia"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2403.12526",
    "title": "Prompt-based Graph Model for Joint Liberal Event Extraction and Event  Schema Induction",
    "abstract": "Events are essential components of speech and texts, describing the changes in the state of entities. The event extraction task aims to identify and classify events and find their participants according to event schemas. Manually predefined event schemas have limited coverage and are hard to migrate across domains. Therefore, the researchers propose Liberal Event Extraction (LEE), which aims to extract events and discover event schemas simultaneously. However, existing LEE models rely heavily on external language knowledge bases and require the manual development of numerous rules for noise removal and knowledge alignment, which is complex and laborious. To this end, we propose a Prompt-based Graph Model for Liberal Event Extraction (PGLEE). Specifically, we use a prompt-based model to obtain candidate triggers and arguments, and then build heterogeneous event graphs to encode the structures within and between events. Experimental results prove that our approach achieves excellent performance with or without predefined event schemas, while the automatically detected event schemas are proven high quality. ",
    "url": "https://arxiv.org/abs/2403.12526",
    "authors": [
      "Haochen Li",
      "Di Geng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.12529",
    "title": "Contextualized Messages Boost Graph Representations",
    "abstract": "Graph neural networks (GNNs) have gained significant interest in recent years due to their ability to handle arbitrarily structured data represented as graphs. GNNs generally follow the message-passing scheme to locally update node feature representations. A graph readout function is then employed to create a representation for the entire graph. Several studies proposed different GNNs by modifying the aggregation and combination strategies of the message-passing framework, often inspired by heuristics. Nevertheless, several studies have begun exploring GNNs from a theoretical perspective based on the graph isomorphism problem which inherently assumes countable node feature representations. Yet, there are only a few theoretical works exploring GNNs with uncountable node feature representations. This paper presents a new perspective on the representational capabilities of GNNs across all levels - node-level, neighborhood-level, and graph-level - when the space of node feature representation is uncountable. From the results, a novel soft-isomorphic relational graph convolution network (SIR-GCN) is proposed that emphasizes non-linear and contextualized transformations of neighborhood feature representations. The mathematical relationship of SIR-GCN and three widely used GNNs is explored to highlight the contribution. Validation on synthetic datasets then demonstrates that SIR-GCN outperforms comparable models even in simple node and graph property prediction tasks. ",
    "url": "https://arxiv.org/abs/2403.12529",
    "authors": [
      "Brian Godwin Lim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12532",
    "title": "UniBind: LLM-Augmented Unified and Balanced Representation Space to Bind  Them All",
    "abstract": "We present UniBind, a flexible and efficient approach that learns a unified representation space for seven diverse modalities -- images, text, audio, point cloud, thermal, video, and event data. Existing works, eg., ImageBind, treat the image as the central modality and build an image-centered representation space; however, the space may be sub-optimal as it leads to an unbalanced representation space among all modalities. Moreover, the category names are directly used to extract text embeddings for the downstream tasks, making it hardly possible to represent the semantics of multi-modal data. The 'out-of-the-box' insight of our UniBind is to make the alignment center modality-agnostic and further learn a unified and balanced representation space, empowered by the large language models (LLMs). UniBind is superior in its flexible application to all CLIP-style models and delivers remarkable performance boosts. To make this possible, we 1) construct a knowledge base of text embeddings with the help of LLMs and multi-modal LLMs; 2) adaptively build LLM-augmented class-wise embedding center on top of the knowledge base and encoded visual embeddings; 3) align all the embeddings to the LLM-augmented embedding center via contrastive learning to achieve a unified and balanced representation space. UniBind shows strong zero-shot recognition performance gains over prior arts by an average of 6.36%. Finally, we achieve new state-of-the-art performance, eg., a 6.75% gain on ImageNet, on the multi-modal fine-tuning setting while reducing 90% of the learnable parameters. ",
    "url": "https://arxiv.org/abs/2403.12532",
    "authors": [
      "Yuanhuiyi Lyu",
      "Xu Zheng",
      "Jiazhou Zhou",
      "Lin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12536",
    "title": "Vox-Fusion++: Voxel-based Neural Implicit Dense Tracking and Mapping  with Multi-maps",
    "abstract": "In this paper, we introduce Vox-Fusion++, a multi-maps-based robust dense tracking and mapping system that seamlessly fuses neural implicit representations with traditional volumetric fusion techniques. Building upon the concept of implicit mapping and positioning systems, our approach extends its applicability to real-world scenarios. Our system employs a voxel-based neural implicit surface representation, enabling efficient encoding and optimization of the scene within each voxel. To handle diverse environments without prior knowledge, we incorporate an octree-based structure for scene division and dynamic expansion. To achieve real-time performance, we propose a high-performance multi-process framework. This ensures the system's suitability for applications with stringent time constraints. Additionally, we adopt the idea of multi-maps to handle large-scale scenes, and leverage loop detection and hierarchical pose optimization strategies to reduce long-term pose drift and remove duplicate geometry. Through comprehensive evaluations, we demonstrate that our method outperforms previous methods in terms of reconstruction quality and accuracy across various scenarios. We also show that our Vox-Fusion++ can be used in augmented reality and collaborative mapping applications. Our source code will be publicly available at \\url{https://github.com/zju3dv/Vox-Fusion_Plus_Plus} ",
    "url": "https://arxiv.org/abs/2403.12536",
    "authors": [
      "Hongjia Zhai",
      "Hai Li",
      "Xingrui Yang",
      "Gan Huang",
      "Yuhang Ming",
      "Hujun Bao",
      "Guofeng Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12540",
    "title": "Community detection by spectral methods in multi-layer networks",
    "abstract": "Community detection in multi-layer networks is a crucial problem in network analysis. In this paper, we analyze the performance of two spectral clustering algorithms for community detection within the multi-layer degree-corrected stochastic block model (MLDCSBM) framework. One algorithm is based on the sum of adjacency matrices, while the other utilizes the debiased sum of squared adjacency matrices. We establish consistency results for community detection using these methods under MLDCSBM as the size of the network and/or the number of layers increases. Our theorems demonstrate the advantages of utilizing multiple layers for community detection. Moreover, our analysis indicates that spectral clustering with the debiased sum of squared adjacency matrices is generally superior to spectral clustering with the sum of adjacency matrices. Numerical simulations confirm that our algorithm, employing the debiased sum of squared adjacency matrices, surpasses existing methods for community detection in multi-layer networks. Finally, the analysis of several real-world multi-layer networks yields meaningful insights. ",
    "url": "https://arxiv.org/abs/2403.12540",
    "authors": [
      "Huan Qing"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.12541",
    "title": "TAGS: Real-time Intrusion Detection with Tag-Propagation-based  Provenance Graph Alignment on Streaming Events",
    "abstract": "The evolution and advancement of cyberattacks pose challenges to existing security products. Recent concentrated research on provenance graph-based detection has proved its effectiveness in attack detection and investigation. However, implementing these approaches in practice encounters challenges such as high overhead, slow responsiveness, and low interpretability and extensibility. Towards practical attack detection and investigation with provenance graphs, we propose TAGS, a tag-propagation-based streaming provenance graph alignment system. Utilizing the tag-based intermediate result caching mechanism alongside carefully crafted propagation rules, we eliminate the need to store and duplicate raw data processing. This approach effectively mitigates in-memory storage requirements and minimizes data processing overhead, facilitating rapid on-stream graph alignment while significantly conserving CPU and memory resources. As a result, TAGS can detect and investigate various cyber-attacks in real-time. Moreover, TAGS allows analysts to customize attack query graphs flexibly to identify extended attacks in data streams. We conduct experimental evaluations on two large-scale public datasets containing 257.42 GB of audit logs with 12 relevant query graphs of varying sizes, covering multiple attack techniques and scenarios. The results demonstrate that TAGS is sufficiently efficient to process 176K events per second while sufficiently accurately identifying all 29 alignments in massive data. Moreover, it can effectively handle the dependency explosion problem with steady, low-level memory consumption (less than 300MB), producing only 3 false positives. Overall, the performance of TAGS significantly outperforms the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2403.12541",
    "authors": [
      "Zhenyuan Li",
      "Yangyang Wei",
      "Xiangmin Shen",
      "Lingzhi Wang",
      "Yan Chen",
      "Haitao Xu",
      "Shouling Ji",
      "Fan Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.12553",
    "title": "Pretraining Codomain Attention Neural Operators for Solving Multiphysics  PDEs",
    "abstract": "Existing neural operator architectures face challenges when solving multiphysics problems with coupled partial differential equations (PDEs), due to complex geometries, interactions between physical variables, and the lack of large amounts of high-resolution training data. To address these issues, we propose Codomain Attention Neural Operator (CoDA-NO), which tokenizes functions along the codomain or channel space, enabling self-supervised learning or pretraining of multiple PDE systems. Specifically, we extend positional encoding, self-attention, and normalization layers to the function space. CoDA-NO can learn representations of different PDE systems with a single model. We evaluate CoDA-NO's potential as a backbone for learning multiphysics PDEs over multiple systems by considering few-shot learning settings. On complex downstream tasks with limited data, such as fluid flow simulations and fluid-structure interactions, we found CoDA-NO to outperform existing methods on the few-shot learning task by over $36\\%$. The code is available at https://github.com/ashiq24/CoDA-NO. ",
    "url": "https://arxiv.org/abs/2403.12553",
    "authors": [
      "Md Ashiqur Rahman",
      "Robert Joseph George",
      "Mogab Elleithy",
      "Daniel Leibovici",
      "Zongyi Li",
      "Boris Bonev",
      "Colin White",
      "Julius Berner",
      "Raymond A. Yeh",
      "Jean Kossaifi",
      "Kamyar Azizzadenesheli",
      "Anima Anandkumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12567",
    "title": "NN-ETM: Enabling safe neural network-based event-triggering mechanisms  for consensus problems",
    "abstract": "In networked control applications, event-triggering mechanisms (ETMs) reduce the communication load while ensuring performance guarantees. However, the design of ETMs is becoming increasingly complex, particularly for decentralized multi-agent and consensus setups, where the condition used to trigger communication might incorporate the agent's local information and the information received from neighbors. This typically results in ad-hoc solutions, which may only work for the consensus protocols under consideration. In this work, we aim to safely incorporate neural networks in the ETM to provide a general and flexible solution while ensuring guaranteed performance. To decouple the stability analysis of the consensus protocol from the abstraction of the neural network in the ETM, we first derive design criteria for the consensus and ETM pair, which allow independent analysis of each element under mild constraints. As a result, we propose NN-ETM, a novel ETM featuring a neural network, which provides an all-purpose solution to optimize communication in consensus problems while preserving the stability guarantees of the consensus protocol. ",
    "url": "https://arxiv.org/abs/2403.12567",
    "authors": [
      "Irene Perez-Salesa",
      "Rodrigo Aldana-Lopez",
      "Carlos Sagues"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.12570",
    "title": "Adapting Visual-Language Models for Generalizable Anomaly Detection in  Medical Images",
    "abstract": "Recent advancements in large-scale visual-language pre-trained models have led to significant progress in zero-/few-shot anomaly detection within natural image domains. However, the substantial domain divergence between natural and medical images limits the effectiveness of these methodologies in medical anomaly detection. This paper introduces a novel lightweight multi-level adaptation and comparison framework to repurpose the CLIP model for medical anomaly detection. Our approach integrates multiple residual adapters into the pre-trained visual encoder, enabling a stepwise enhancement of visual features across different levels. This multi-level adaptation is guided by multi-level, pixel-wise visual-language feature alignment loss functions, which recalibrate the model's focus from object semantics in natural imagery to anomaly identification in medical images. The adapted features exhibit improved generalization across various medical data types, even in zero-shot scenarios where the model encounters unseen medical modalities and anatomical regions during training. Our experiments on medical anomaly detection benchmarks demonstrate that our method significantly surpasses current state-of-the-art models, with an average AUC improvement of 6.24% and 7.33% for anomaly classification, 2.03% and 2.37% for anomaly segmentation, under the zero-shot and few-shot settings, respectively. Source code is available at: https://github.com/MediaBrain-SJTU/MVFA-AD ",
    "url": "https://arxiv.org/abs/2403.12570",
    "authors": [
      "Chaoqin Huang",
      "Aofan Jiang",
      "Jinghao Feng",
      "Ya Zhang",
      "Xinchao Wang",
      "Yanfeng Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12573",
    "title": "Lifting Multi-View Detection and Tracking to the Bird's Eye View",
    "abstract": "Taking advantage of multi-view aggregation presents a promising solution to tackle challenges such as occlusion and missed detection in multi-object tracking and detection. Recent advancements in multi-view detection and 3D object recognition have significantly improved performance by strategically projecting all views onto the ground plane and conducting detection analysis from a Bird's Eye View. In this paper, we compare modern lifting methods, both parameter-free and parameterized, to multi-view aggregation. Additionally, we present an architecture that aggregates the features of multiple times steps to learn robust detection and combines appearance- and motion-based cues for tracking. Most current tracking approaches either focus on pedestrians or vehicles. In our work, we combine both branches and add new challenges to multi-view detection with cross-scene setups. Our method generalizes to three public datasets across two domains: (1) pedestrian: Wildtrack and MultiviewX, and (2) roadside perception: Synthehicle, achieving state-of-the-art performance in detection and tracking. https://github.com/tteepe/TrackTacular ",
    "url": "https://arxiv.org/abs/2403.12573",
    "authors": [
      "Torben Teepe",
      "Philipp Wolters",
      "Johannes Gilg",
      "Fabian Herzog",
      "Gerhard Rigoll"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12574",
    "title": "EAS-SNN: End-to-End Adaptive Sampling and Representation for Event-based  Detection with Recurrent Spiking Neural Networks",
    "abstract": "Event cameras, with their high dynamic range and temporal resolution, are ideally suited for object detection, especially under scenarios with motion blur and challenging lighting conditions. However, while most existing approaches prioritize optimizing spatiotemporal representations with advanced detection backbones and early aggregation functions, the crucial issue of adaptive event sampling remains largely unaddressed. Spiking Neural Networks (SNNs), which operate on an event-driven paradigm through sparse spike communication, emerge as a natural fit for addressing this challenge. In this study, we discover that the neural dynamics of spiking neurons align closely with the behavior of an ideal temporal event sampler. Motivated by this insight, we propose a novel adaptive sampling module that leverages recurrent convolutional SNNs enhanced with temporal memory, facilitating a fully end-to-end learnable framework for event-based detection. Additionally, we introduce Residual Potential Dropout (RPD) and Spike-Aware Training (SAT) to regulate potential distribution and address performance degradation encountered in spike-based sampling modules. Through rigorous testing on neuromorphic datasets for event-based detection, our approach demonstrably surpasses existing state-of-the-art spike-based methods, achieving superior performance with significantly fewer parameters and time steps. For instance, our method achieves a 4.4\\% mAP improvement on the Gen1 dataset, while requiring 38\\% fewer parameters and three time steps. Moreover, the applicability and effectiveness of our adaptive sampling methodology extend beyond SNNs, as demonstrated through further validation on conventional non-spiking detection models. ",
    "url": "https://arxiv.org/abs/2403.12574",
    "authors": [
      "Ziming Wang",
      "Ziling Wang",
      "Huaning Li",
      "Lang Qin",
      "Runhao Jiang",
      "De Ma",
      "Huajin Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2403.12580",
    "title": "Real-IAD: A Real-World Multi-View Dataset for Benchmarking Versatile  Industrial Anomaly Detection",
    "abstract": "Industrial anomaly detection (IAD) has garnered significant attention and experienced rapid development. However, the recent development of IAD approach has encountered certain difficulties due to dataset limitations. On the one hand, most of the state-of-the-art methods have achieved saturation (over 99% in AUROC) on mainstream datasets such as MVTec, and the differences of methods cannot be well distinguished, leading to a significant gap between public datasets and actual application scenarios. On the other hand, the research on various new practical anomaly detection settings is limited by the scale of the dataset, posing a risk of overfitting in evaluation results. Therefore, we propose a large-scale, Real-world, and multi-view Industrial Anomaly Detection dataset, named Real-IAD, which contains 150K high-resolution images of 30 different objects, an order of magnitude larger than existing datasets. It has a larger range of defect area and ratio proportions, making it more challenging than previous datasets. To make the dataset closer to real application scenarios, we adopted a multi-view shooting method and proposed sample-level evaluation metrics. In addition, beyond the general unsupervised anomaly detection setting, we propose a new setting for Fully Unsupervised Industrial Anomaly Detection (FUIAD) based on the observation that the yield rate in industrial production is usually greater than 60%, which has more practical application value. Finally, we report the results of popular IAD methods on the Real-IAD dataset, providing a highly challenging benchmark to promote the development of the IAD field. ",
    "url": "https://arxiv.org/abs/2403.12580",
    "authors": [
      "Chengjie Wang",
      "Wenbing Zhu",
      "Bin-Bin Gao",
      "Zhenye Gan",
      "Jianning Zhang",
      "Zhihao Gu",
      "Shuguang Qian",
      "Mingang Chen",
      "Lizhuang Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12584",
    "title": "Robust Fuel-Optimal Landing Guidance for Hazardous Terrain using  Multiple Sliding Surfaces",
    "abstract": "In any spacecraft landing mission, precision soft landing in a fuel-efficient way while also avoiding nearby hazardous terrain is of utmost importance. Very few existing literature have attempted addressing both the problems of precision soft landing and terrain avoidance simultaneously. To this end, an optimal terrain avoidance landing guidance (OTALG) was recently developed, which showed promising performance in avoiding the terrain while consuming near-minimum fuel. However, its performance significantly degrades in the face of external disturbances, indicating lack of robustness. In order to mitigate this problem, in this paper, a novel near fuel-optimal guidance law is developed to avoid terrain and land precisely and softly at the desired landing site, under atmospheric perturbations and thrust deviations and constraints. Expanding the OTALG formulation by using sliding mode control with multiple sliding surfaces (MSS), the presented guidance law, named `MSS-OTALG', improves in terms of precision soft landing accuracy. Further, the sliding parameter is designed to allow the lander to avoid terrain by leaving the trajectory enforced by the sliding mode, and eventually returning to it when the terrain avoidance phase is completed. And finally, the robustness of the MSS-OTALG is established by proving practical fixed-time stability. Extensive numerical simulations are also presented to showcase its performance in terms of terrain avoidance, low fuel consumption and accuracy of precision soft landing. Comparative studies against existing relevant literature validates a balanced trade-off of all these performance measures achieved by the developed MSS-OTALG. ",
    "url": "https://arxiv.org/abs/2403.12584",
    "authors": [
      "Sheikh Zeeshan Basar",
      "Satadal Ghosh"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.12606",
    "title": "On the Effectiveness of Heterogeneous Ensemble Methods for  Re-identification",
    "abstract": "In this contribution, we introduce a novel ensemble method for the re-identification of industrial entities, using images of chipwood pallets and galvanized metal plates as dataset examples. Our algorithms replace commonly used, complex siamese neural networks with an ensemble of simplified, rudimentary models, providing wider applicability, especially in hardware-restricted scenarios. Each ensemble sub-model uses different types of extracted features of the given data as its input, allowing for the creation of effective ensembles in a fraction of the training duration needed for more complex state-of-the-art models. We reach state-of-the-art performance at our task, with a Rank-1 accuracy of over 77% and a Rank-10 accuracy of over 99%, and introduce five distinct feature extraction approaches, and study their combination using different ensemble methods. ",
    "url": "https://arxiv.org/abs/2403.12606",
    "authors": [
      "Simon Klüttermann",
      "Jérôme Rutinowski",
      "Anh Nguyen",
      "Britta Grimme",
      "Moritz Roidl",
      "Emmanuel Müller"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12619",
    "title": "Detection of Malicious Agents in Social Learning",
    "abstract": "Social learning is a non-Bayesian framework for distributed hypothesis testing aimed at learning the true state of the environment. Traditionally, the agents are assumed to receive observations conditioned on the same true state, although it is also possible to examine the case of heterogeneous models across the graph. One important special case is when heterogeneity is caused by the presence of malicious agents whose goal is to move the agents towards a wrong hypothesis. In this work, we propose an algorithm that allows to discover the true state of every individual agent based on the sequence of their beliefs. In so doing, the methodology is also able to locate malicious behavior. ",
    "url": "https://arxiv.org/abs/2403.12619",
    "authors": [
      "Valentina Shumovskaia",
      "Mert Kayaalp",
      "Ali H. Sayed"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Multiagent Systems (cs.MA)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.12627",
    "title": "Enhancing Formal Theorem Proving: A Comprehensive Dataset for Training  AI Models on Coq Code",
    "abstract": "In the realm of formal theorem proving, the Coq proof assistant stands out for its rigorous approach to verifying mathematical assertions and software correctness. Despite the advances in artificial intelligence and machine learning, the specialized nature of Coq syntax and semantics poses unique challenges for Large Language Models (LLMs). Addressing this gap, we present a comprehensive dataset specifically designed to enhance LLMs' proficiency in interpreting and generating Coq code. This dataset, derived from a collection of over 10,000 Coq source files, encompasses a wide array of propositions, proofs, and definitions, enriched with metadata including source references and licensing information. Our primary aim is to facilitate the development of LLMs capable of generating syntactically correct and semantically meaningful Coq constructs, thereby advancing the frontier of automated theorem proving. Initial experiments with this dataset have showcased its significant potential; models trained on this data exhibited enhanced accuracy in Coq code generation. Notably, a particular experiment revealed that a fine-tuned LLM was capable of generating 141 valid proofs for a basic lemma, highlighting the dataset's utility in facilitating the discovery of diverse and valid proof strategies. This paper discusses the dataset's composition, the methodology behind its creation, and the implications of our findings for the future of machine learning in formal verification. The dataset is accessible for further research and exploration: https://huggingface.co/datasets/florath/coq-facts-props-proofs-gen0-v1 ",
    "url": "https://arxiv.org/abs/2403.12627",
    "authors": [
      "Andreas Florath"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2403.12649",
    "title": "InBox: Recommendation with Knowledge Graph using Interest Box Embedding",
    "abstract": "Knowledge graphs (KGs) have become vitally important in modern recommender systems, effectively improving performance and interpretability. Fundamentally, recommender systems aim to identify user interests based on historical interactions and recommend suitable items. However, existing works overlook two key challenges: (1) an interest corresponds to a potentially large set of related items, and (2) the lack of explicit, fine-grained exploitation of KG information and interest connectivity. This leads to an inability to reflect distinctions between entities and interests when modeling them in a single way. Additionally, the granularity of concepts in the knowledge graphs used for recommendations tends to be coarse, failing to match the fine-grained nature of user interests. This homogenization limits the precise exploitation of knowledge graph data and interest connectivity. To address these limitations, we introduce a novel embedding-based model called InBox. Specifically, various knowledge graph entities and relations are embedded as points or boxes, while user interests are modeled as boxes encompassing interaction history. Representing interests as boxes enables containing collections of item points related to that interest. We further propose that an interest comprises diverse basic concepts, and box intersection naturally supports concept combination. Across three training steps, InBox significantly outperforms state-of-the-art methods like HAKG and KGIN on recommendation tasks. Further analysis provides meaningful insights into the variable value of different KG data for recommendations. In summary, InBox advances recommender systems through box-based interest and concept modeling for sophisticated knowledge graph exploitation. ",
    "url": "https://arxiv.org/abs/2403.12649",
    "authors": [
      "Zezhong Xu",
      "Yincen Qu",
      "Wen Zhang",
      "Lei Liang",
      "Huajun Chen"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.12650",
    "title": "Adaptive Multilevel Neural Networks for Parametric PDEs with Error  Estimation",
    "abstract": "To solve high-dimensional parameter-dependent partial differential equations (pPDEs), a neural network architecture is presented. It is constructed to map parameters of the model data to corresponding finite element solutions. To improve training efficiency and to enable control of the approximation error, the network mimics an adaptive finite element method (AFEM). It outputs a coarse grid solution and a series of corrections as produced in an AFEM, allowing a tracking of the error decay over successive layers of the network. The observed errors are measured by a reliable residual based a posteriori error estimator, enabling the reduction to only few parameters for the approximation in the output of the network. This leads to a problem adapted representation of the solution on locally refined grids. Furthermore, each solution of the AFEM is discretized in a hierarchical basis. For the architecture, convolutional neural networks (CNNs) are chosen. The hierarchical basis then allows to handle sparse images for finely discretized meshes. Additionally, as corrections on finer levels decrease in amplitude, i.e., importance for the overall approximation, the accuracy of the network approximation is allowed to decrease successively. This can either be incorporated in the number of generated high fidelity samples used for training or the size of the network components responsible for the fine grid outputs. The architecture is described and preliminary numerical examples are presented. ",
    "url": "https://arxiv.org/abs/2403.12650",
    "authors": [
      "Janina E. Schütte",
      "Martin Eigel"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12671",
    "title": "Enhancing Security of AI-Based Code Synthesis with GitHub Copilot via  Cheap and Efficient Prompt-Engineering",
    "abstract": "AI assistants for coding are on the rise. However one of the reasons developers and companies avoid harnessing their full potential is the questionable security of the generated code. This paper first reviews the current state-of-the-art and identifies areas for improvement on this issue. Then, we propose a systematic approach based on prompt-altering methods to achieve better code security of (even proprietary black-box) AI-based code generators such as GitHub Copilot, while minimizing the complexity of the application from the user point-of-view, the computational resources, and operational costs. In sum, we propose and evaluate three prompt altering methods: (1) scenario-specific, (2) iterative, and (3) general clause, while we discuss their combination. Contrary to the audit of code security, the latter two of the proposed methods require no expert knowledge from the user. We assess the effectiveness of the proposed methods on the GitHub Copilot using the OpenVPN project in realistic scenarios, and we demonstrate that the proposed methods reduce the number of insecure generated code samples by up to 16\\% and increase the number of secure code by up to 8\\%. Since our approach does not require access to the internals of the AI models, it can be in general applied to any AI-based code synthesizer, not only GitHub Copilot. ",
    "url": "https://arxiv.org/abs/2403.12671",
    "authors": [
      "Jakub Res",
      "Ivan Homoliak",
      "Martin Perešíni",
      "Aleš Smrčka",
      "Kamil Malinka",
      "Petr Hanacek"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.12672",
    "title": "Improving Interpretability of Scores in Anomaly Detection Based on  Gaussian-Bernoulli Restricted Boltzmann Machine",
    "abstract": "Gaussian-Bernoulli restricted Boltzmann machines (GBRBMs) are often used for semi-supervised anomaly detection, where they are trained using only normal data points. In GBRBM-based anomaly detection, normal and anomalous data are classified based on a score that is identical to an energy function of the marginal GBRBM. However, the classification threshold is difficult to set to an appropriate value, as this score cannot be interpreted. In this study, we propose a measure that improves score's interpretability based on its cumulative distribution, and establish a guideline for setting the threshold using the interpretable measure. The results of numerical experiments show that the guideline is reasonable when setting the threshold solely using normal data points. Moreover, because identifying the measure involves computationally infeasible evaluation of the minimum score value, we also propose an evaluation method for the minimum score based on simulated annealing, which is widely used for optimization problems. The proposed evaluation method was also validated using numerical experiments. ",
    "url": "https://arxiv.org/abs/2403.12672",
    "authors": [
      "Kaiji Sekimoto",
      "Muneki Yasuda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.12690",
    "title": "LNPT: Label-free Network Pruning and Training",
    "abstract": "Pruning before training enables the deployment of neural networks on smart devices. By retaining weights conducive to generalization, pruned networks can be accommodated on resource-constrained smart devices. It is commonly held that the distance on weight norms between the initialized and the fully-trained networks correlates with generalization performance. However, as we have uncovered, inconsistency between this metric and generalization during training processes, which poses an obstacle to determine the pruned structures on smart devices in advance. In this paper, we introduce the concept of the learning gap, emphasizing its accurate correlation with generalization. Experiments show that the learning gap, in the form of feature maps from the penultimate layer of networks, aligns with variations of generalization performance. We propose a novel learning framework, LNPT, which enables mature networks on the cloud to provide online guidance for network pruning and learning on smart devices with unlabeled data. Our results demonstrate the superiority of this approach over supervised training. ",
    "url": "https://arxiv.org/abs/2403.12690",
    "authors": [
      "Jinying Xiao",
      "Ping Li",
      "Zhe Tang",
      "Jie Nie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12693",
    "title": "As Firm As Their Foundations: Can open-sourced foundation models be used  to create adversarial examples for downstream tasks?",
    "abstract": "Foundation models pre-trained on web-scale vision-language data, such as CLIP, are widely used as cornerstones of powerful machine learning systems. While pre-training offers clear advantages for downstream learning, it also endows downstream models with shared adversarial vulnerabilities that can be easily identified through the open-sourced foundation model. In this work, we expose such vulnerabilities in CLIP's downstream models and show that foundation models can serve as a basis for attacking their downstream systems. In particular, we propose a simple yet effective adversarial attack strategy termed Patch Representation Misalignment (PRM). Solely based on open-sourced CLIP vision encoders, this method produces adversaries that simultaneously fool more than 20 downstream models spanning 4 common vision-language tasks (semantic segmentation, object detection, image captioning and visual question-answering). Our findings highlight the concerning safety risks introduced by the extensive usage of public foundational models in the development of downstream systems, calling for extra caution in these scenarios. ",
    "url": "https://arxiv.org/abs/2403.12693",
    "authors": [
      "Anjun Hu",
      "Jindong Gu",
      "Francesco Pinto",
      "Konstantinos Kamnitsas",
      "Philip Torr"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12707",
    "title": "Selective Domain-Invariant Feature for Generalizable Deepfake Detection",
    "abstract": "With diverse presentation forgery methods emerging continually, detecting the authenticity of images has drawn growing attention. Although existing methods have achieved impressive accuracy in training dataset detection, they still perform poorly in the unseen domain and suffer from forgery of irrelevant information such as background and identity, affecting generalizability. To solve this problem, we proposed a novel framework Selective Domain-Invariant Feature (SDIF), which reduces the sensitivity to face forgery by fusing content features and styles. Specifically, we first use a Farthest-Point Sampling (FPS) training strategy to construct a task-relevant style sample representation space for fusing with content features. Then, we propose a dynamic feature extraction module to generate features with diverse styles to improve the performance and effectiveness of the feature extractor. Finally, a domain separation strategy is used to retain domain-related features to help distinguish between real and fake faces. Both qualitative and quantitative results in existing benchmarks and proposals demonstrate the effectiveness of our approach. ",
    "url": "https://arxiv.org/abs/2403.12707",
    "authors": [
      "Yingxin Lai",
      "Guoqing Yang Yifan He",
      "Zhiming Luo",
      "Shaozi Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12710",
    "title": "Selective, Interpretable, and Motion Consistent Privacy Attribute  Obfuscation for Action Recognition",
    "abstract": "Concerns for the privacy of individuals captured in public imagery have led to privacy-preserving action recognition. Existing approaches often suffer from issues arising through obfuscation being applied globally and a lack of interpretability. Global obfuscation hides privacy sensitive regions, but also contextual regions important for action recognition. Lack of interpretability erodes trust in these new technologies. We highlight the limitations of current paradigms and propose a solution: Human selected privacy templates that yield interpretability by design, an obfuscation scheme that selectively hides attributes and also induces temporal consistency, which is important in action recognition. Our approach is architecture agnostic and directly modifies input imagery, while existing approaches generally require architecture training. Our approach offers more flexibility, as no retraining is required, and outperforms alternatives on three widely used datasets. ",
    "url": "https://arxiv.org/abs/2403.12710",
    "authors": [
      "Filip Ilic",
      "He Zhao",
      "Thomas Pock",
      "Richard P. Wildes"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12719",
    "title": "Bilevel Hypergraph Networks for Multi-Modal Alzheimer's Diagnosis",
    "abstract": "Early detection of Alzheimer's disease's precursor stages is imperative for significantly enhancing patient outcomes and quality of life. This challenge is tackled through a semi-supervised multi-modal diagnosis framework. In particular, we introduce a new hypergraph framework that enables higher-order relations between multi-modal data, while utilising minimal labels. We first introduce a bilevel hypergraph optimisation framework that jointly learns a graph augmentation policy and a semi-supervised classifier. This dual learning strategy is hypothesised to enhance the robustness and generalisation capabilities of the model by fostering new pathways for information propagation. Secondly, we introduce a novel strategy for generating pseudo-labels more effectively via a gradient-driven flow. Our experimental results demonstrate the superior performance of our framework over current techniques in diagnosing Alzheimer's disease. ",
    "url": "https://arxiv.org/abs/2403.12719",
    "authors": [
      "Angelica I. Aviles-Rivero",
      "Chun-Wun Cheng",
      "Zhongying Deng",
      "Zoe Kourtzi",
      "Carola-Bibiane Schönlieb"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12728",
    "title": "Diffusion-Driven Self-Supervised Learning for Shape Reconstruction and  Pose Estimation",
    "abstract": "Fully-supervised category-level pose estimation aims to determine the 6-DoF poses of unseen instances from known categories, requiring expensive mannual labeling costs. Recently, various self-supervised category-level pose estimation methods have been proposed to reduce the requirement of the annotated datasets. However, most methods rely on synthetic data or 3D CAD model for self-supervised training, and they are typically limited to addressing single-object pose problems without considering multi-objective tasks or shape reconstruction. To overcome these challenges and limitations, we introduce a diffusion-driven self-supervised network for multi-object shape reconstruction and categorical pose estimation, only leveraging the shape priors. Specifically, to capture the SE(3)-equivariant pose features and 3D scale-invariant shape information, we present a Prior-Aware Pyramid 3D Point Transformer in our network. This module adopts a point convolutional layer with radial-kernels for pose-aware learning and a 3D scale-invariant graph convolution layer for object-level shape representation, respectively. Furthermore, we introduce a pretrain-to-refine self-supervised training paradigm to train our network. It enables proposed network to capture the associations between shape priors and observations, addressing the challenge of intra-class shape variations by utilising the diffusion mechanism. Extensive experiments conducted on four public datasets and a self-built dataset demonstrate that our method significantly outperforms state-of-the-art self-supervised category-level baselines and even surpasses some fully-supervised instance-level and category-level methods. ",
    "url": "https://arxiv.org/abs/2403.12728",
    "authors": [
      "Jingtao Sun",
      "Yaonan Wang",
      "Mingtao Feng",
      "Chao Ding",
      "Mike Zheng Shou",
      "Ajmal Saeed Mian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12734",
    "title": "Exact and Heuristic Computation of the Scanwidth of Directed Acyclic  Graphs",
    "abstract": "To measure the tree-likeness of a directed acyclic graph (DAG), a new width parameter that considers the directions of the arcs was recently introduced: scanwidth. We present the first algorithm that efficiently computes the exact scanwidth of general DAGs. For DAGs with one root and scanwidth $k$ it runs in $O(k \\cdot n^k \\cdot m)$ time. The algorithm also functions as an FPT algorithm with complexity $O(2^{4 \\ell - 1} \\cdot \\ell \\cdot n + n^2)$ for phylogenetic networks of level-$\\ell$, a type of DAG used to depict evolutionary relationships among species. Our algorithm performs well in practice, being able to compute the scanwidth of synthetic networks up to 30 reticulations and 100 leaves within 500 seconds. Furthermore, we propose a heuristic that obtains an average practical approximation ratio of 1.5 on these networks. While we prove that the scanwidth is bounded from below by the treewidth of the underlying undirected graph, experiments suggest that for networks the parameters are close in practice. ",
    "url": "https://arxiv.org/abs/2403.12734",
    "authors": [
      "Niels Holtgrefe",
      "Leo van Iersel",
      "Mark Jones"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2403.12747",
    "title": "N-Modal Contrastive Losses with Applications to Social Media Data in  Trimodal Space",
    "abstract": "The social media landscape of conflict dynamics has grown increasingly multi-modal. Recent advancements in model architectures such as CLIP have enabled researchers to begin studying the interplay between the modalities of text and images in a shared latent space. However, CLIP models fail to handle situations on social media when modalities present in a post expand above two. Social media dynamics often require understanding the interplay between not only text and images, but video as well. In this paper we explore an extension of the contrastive loss function to allow for any number of modalities, and demonstrate its usefulness in trimodal spaces on social media. By extending CLIP into three dimensions we can further aide understanding social media landscapes where all three modalities are present (an increasingly common situation). We use a newly collected public data set of Telegram posts containing all three modalities to train, and then demonstrate the usefulness of, a trimodal model in two OSINT scenarios: classifying a social media artifact post as either pro-Russian or pro-Ukrainian and identifying which account a given artifact originated from. While trimodal CLIP models have been explored before (though not on social media data), we also display a novel quadmodal CLIP model. This model can learn the interplay between text, image, video, and audio. We demonstrate new state-of-the-art baseline results on retrieval for quadmodel models moving forward. ",
    "url": "https://arxiv.org/abs/2403.12747",
    "authors": [
      "William Theisen",
      "Walter Scheirer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12748",
    "title": "Building Brain Tumor Segmentation Networks with User-Assisted Filter  Estimation and Selection",
    "abstract": "Brain tumor image segmentation is a challenging research topic in which deep-learning models have presented the best results. However, the traditional way of training those models from many pre-annotated images leaves several unanswered questions. Hence methodologies, such as Feature Learning from Image Markers (FLIM), have involved an expert in the learning loop to reduce human effort in data annotation and build models sufficiently deep for a given problem. FLIM has been successfully used to create encoders, estimating the filters of all convolutional layers from patches centered at marker voxels. In this work, we present Multi-Step (MS) FLIM - a user-assisted approach to estimating and selecting the most relevant filters from multiple FLIM executions. MS-FLIM is used only for the first convolutional layer, and the results already indicate improvement over FLIM. For evaluation, we build a simple U-shaped encoder-decoder network, named sU-Net, for glioblastoma segmentation using T1Gd and FLAIR MRI scans, varying the encoder's training method, using FLIM, MS-FLIM, and backpropagation algorithm. Also, we compared these sU-Nets with two State-Of-The-Art (SOTA) deep-learning models using two datasets. The results show that the sU-Net based on MS-FLIM outperforms the other training methods and achieves effectiveness within the standard deviations of the SOTA models. ",
    "url": "https://arxiv.org/abs/2403.12748",
    "authors": [
      "Matheus A. Cerqueira",
      "Flávia Sprenger",
      "Bernardo C. A. Teixeira",
      "Alexandre X. Falcão"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.12764",
    "title": "Neural Parameter Regression for Explicit Representations of PDE Solution  Operators",
    "abstract": "We introduce Neural Parameter Regression (NPR), a novel framework specifically developed for learning solution operators in Partial Differential Equations (PDEs). Tailored for operator learning, this approach surpasses traditional DeepONets (Lu et al., 2021) by employing Physics-Informed Neural Network (PINN, Raissi et al., 2019) techniques to regress Neural Network (NN) parameters. By parametrizing each solution based on specific initial conditions, it effectively approximates a mapping between function spaces. Our method enhances parameter efficiency by incorporating low-rank matrices, thereby boosting computational efficiency and scalability. The framework shows remarkable adaptability to new initial and boundary conditions, allowing for rapid fine-tuning and inference, even in cases of out-of-distribution examples. ",
    "url": "https://arxiv.org/abs/2403.12764",
    "authors": [
      "Konrad Mundinger",
      "Max Zimmer",
      "Sebastian Pokutta"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2403.12776",
    "title": "Automated Data Curation for Robust Language Model Fine-Tuning",
    "abstract": "Large Language Models have become the de facto approach to sequence-to-sequence text generation tasks, but for specialized tasks/domains, a pretrained LLM lacks specific capabilities to produce accurate or well-formatted responses. Supervised fine-tuning specializes a LLM by training it on dataset of example prompts with target responses, but real-world data tends to be noisy. While many fine-tuning algorithms exist, here we consider a \\emph{data-centric AI} perspective on LLM fine-tuning, studying how to \\emph{systematically} curate the training dataset to improve the LLM produced via \\emph{any} fine-tuning algorithm. We introduce an automated data curation pipeline CLEAR (Confidence-based LLM Evaluation And Rectification) for instruction tuning datasets, that can be used with any LLM and fine-tuning procedure. CLEAR estimates which training data is low-quality and either filters or corrects it. Automatically identifying which data to filter or correct is done via LLM-derived confidence estimates, to ensure only confident modifications to the dataset. Unlike existing data curation techniques, CLEAR is a comprehensive framework that can improve a dataset (and trained model outputs) without additional fine-tuning computations. We don't assume access to a stronger LLM than the model being fine-tuned (e.g.\\ relying on GPT-4 when fine-tuning GPT-3.5), to see whether CLEAR can meaningfully improve the capabilities of any LLM. Experiments reveal that CLEAR consistently improves the performance of fine-tuned models across many datasets and models (like GPT-3.5 and Llama2). ",
    "url": "https://arxiv.org/abs/2403.12776",
    "authors": [
      "Jiuhai Chen",
      "Jonas Mueller"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.12787",
    "title": "DDSB: An Unsupervised and Training-free Method for Phase Detection in  Echocardiography",
    "abstract": "Accurate identification of End-Diastolic (ED) and End-Systolic (ES) frames is key for cardiac function assessment through echocardiography. However, traditional methods face several limitations: they require extensive amounts of data, extensive annotations by medical experts, significant training resources, and often lack robustness. Addressing these challenges, we proposed an unsupervised and training-free method, our novel approach leverages unsupervised segmentation to enhance fault tolerance against segmentation inaccuracies. By identifying anchor points and analyzing directional deformation, we effectively reduce dependence on the accuracy of initial segmentation images and enhance fault tolerance, all while improving robustness. Tested on Echo-dynamic and CAMUS datasets, our method achieves comparable accuracy to learning-based models without their associated drawbacks. The code is available at https://github.com/MRUIL/DDSB ",
    "url": "https://arxiv.org/abs/2403.12787",
    "authors": [
      "Zhenyu Bu",
      "Yang Liu",
      "Jiayu Huo",
      "Jingjing Peng",
      "Kaini Wang",
      "Guangquan Zhou",
      "Rachel Sparks",
      "Prokar Dasgupta",
      "Alejandro Granados",
      "Sebastien Ourselin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12800",
    "title": "Learning Neural Volumetric Pose Features for Camera Localization",
    "abstract": "We introduce a novel neural volumetric pose feature, termed PoseMap, designed to enhance camera localization by encapsulating the information between images and the associated camera poses. Our framework leverages an Absolute Pose Regression (APR) architecture, together with an augmented NeRF module. This integration not only facilitates the generation of novel views to enrich the training dataset but also enables the learning of effective pose features. Additionally, we extend our architecture for self-supervised online alignment, allowing our method to be used and fine-tuned for unlabelled images within a unified framework. Experiments demonstrate that our method achieves 14.28% and 20.51% performance gain on average in indoor and outdoor benchmark scenes, outperforming existing APR methods with state-of-the-art accuracy. ",
    "url": "https://arxiv.org/abs/2403.12800",
    "authors": [
      "Jingyu Lin",
      "Jiaqi Gu",
      "Bojian Wu",
      "Lubin Fan",
      "Renjie Chen",
      "Ligang Liu",
      "Jieping Ye"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12803",
    "title": "DreamDA: Generative Data Augmentation with Diffusion Models",
    "abstract": "The acquisition of large-scale, high-quality data is a resource-intensive and time-consuming endeavor. Compared to conventional Data Augmentation (DA) techniques (e.g. cropping and rotation), exploiting prevailing diffusion models for data generation has received scant attention in classification tasks. Existing generative DA methods either inadequately bridge the domain gap between real-world and synthesized images, or inherently suffer from a lack of diversity. To solve these issues, this paper proposes a new classification-oriented framework DreamDA, which enables data synthesis and label generation by way of diffusion models. DreamDA generates diverse samples that adhere to the original data distribution by considering training images in the original data as seeds and perturbing their reverse diffusion process. In addition, since the labels of the generated data may not align with the labels of their corresponding seed images, we introduce a self-training paradigm for generating pseudo labels and training classifiers using the synthesized data. Extensive experiments across four tasks and five datasets demonstrate consistent improvements over strong baselines, revealing the efficacy of DreamDA in synthesizing high-quality and diverse images with accurate labels. Our code will be available at https://github.com/yunxiangfu2001/DreamDA. ",
    "url": "https://arxiv.org/abs/2403.12803",
    "authors": [
      "Yunxiang Fu",
      "Chaoqi Chen",
      "Yu Qiao",
      "Yizhou Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12807",
    "title": "Freshness-aware Block Propagation Optimization in 6G-based Web 3.0: An  Evolutionary Game Approach",
    "abstract": "Driven by the aspiration to establish a decentralized digital economy, Web 3.0 is emerging as the fundamental technology for digital transformation. Incorporating the promising sixth-generation (6G) technology with large bandwidth and space-air-ground integrated coverage, 6G-based Web 3.0 holds great potential in empowering users with enhanced data control and facilitating secure peer-to-peer transactions, especially in consumer electronics, through the utilization of blockchain technologies. However, 6G-based Web 3.0 is still in its infancy, such as ensuring block freshness and optimizing block propagation to improve blockchain performance. In this paper, we develop a freshness-aware block propagation optimization framework for 6G-based Web 3.0. We first propose a novel metric called Age of Block Information (AoBI) based on the concept of age of information to quantify block freshness. To make block propagation optimization tractable, we classify miners into five different states and propose a block propagation model for public blockchains inspired by epidemic models. Moreover, considering that the miners are bounded rational, we propose an incentive mechanism based on the evolutionary game for block propagation to improve block propagation efficiency. Numerical results demonstrate that compared with other block propagation mechanisms, the proposed scheme has a higher block forwarding probability, which improves block propagation efficiency. ",
    "url": "https://arxiv.org/abs/2403.12807",
    "authors": [
      "Jinbo Wen",
      "Jiawen Kang",
      "Zehui Xiong",
      "Hongyang Du",
      "Zhaohui Yang",
      "Dusit Niyato",
      "Meng Shen",
      "Yutao Jiao",
      "Yang Zhang"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2403.12818",
    "title": "Dynamic Survival Analysis for Early Event Prediction",
    "abstract": "This study advances Early Event Prediction (EEP) in healthcare through Dynamic Survival Analysis (DSA), offering a novel approach by integrating risk localization into alarm policies to enhance clinical event metrics. By adapting and evaluating DSA models against traditional EEP benchmarks, our research demonstrates their ability to match EEP models on a time-step level and significantly improve event-level metrics through a new alarm prioritization scheme (up to 11% AuPRC difference). This approach represents a significant step forward in predictive healthcare, providing a more nuanced and actionable framework for early event prediction and management. ",
    "url": "https://arxiv.org/abs/2403.12818",
    "authors": [
      "Hugo Yèche",
      "Manuel Burger",
      "Dinara Veshchezerova",
      "Gunnar Rätsch"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12821",
    "title": "FlowerFormer: Empowering Neural Architecture Encoding using a Flow-aware  Graph Transformer",
    "abstract": "The success of a specific neural network architecture is closely tied to the dataset and task it tackles; there is no one-size-fits-all solution. Thus, considerable efforts have been made to quickly and accurately estimate the performances of neural architectures, without full training or evaluation, for given tasks and datasets. Neural architecture encoding has played a crucial role in the estimation, and graphbased methods, which treat an architecture as a graph, have shown prominent performance. For enhanced representation learning of neural architectures, we introduce FlowerFormer, a powerful graph transformer that incorporates the information flows within a neural architecture. FlowerFormer consists of two key components: (a) bidirectional asynchronous message passing, inspired by the flows; (b) global attention built on flow-based masking. Our extensive experiments demonstrate the superiority of FlowerFormer over existing neural encoding methods, and its effectiveness extends beyond computer vision models to include graph neural networks and auto speech recognition models. Our code is available at this http URL ",
    "url": "https://arxiv.org/abs/2403.12821",
    "authors": [
      "Dongyeong Hwang",
      "Hyunju Kim",
      "Sunwoo Kim",
      "Kijung Shin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.12839",
    "title": "Global-guided Focal Neural Radiance Field for Large-scale Scene  Rendering",
    "abstract": "Neural radiance fields~(NeRF) have recently been applied to render large-scale scenes. However, their limited model capacity typically results in blurred rendering results. Existing large-scale NeRFs primarily address this limitation by partitioning the scene into blocks, which are subsequently handled by separate sub-NeRFs. These sub-NeRFs, trained from scratch and processed independently, lead to inconsistencies in geometry and appearance across the scene. Consequently, the rendering quality fails to exhibit significant improvement despite the expansion of model capacity. In this work, we present global-guided focal neural radiance field (GF-NeRF) that achieves high-fidelity rendering of large-scale scenes. Our proposed GF-NeRF utilizes a two-stage (Global and Focal) architecture and a global-guided training strategy. The global stage obtains a continuous representation of the entire scene while the focal stage decomposes the scene into multiple blocks and further processes them with distinct sub-encoders. Leveraging this two-stage architecture, sub-encoders only need fine-tuning based on the global encoder, thus reducing training complexity in the focal stage while maintaining scene-wide consistency. Spatial information and error information from the global stage also benefit the sub-encoders to focus on crucial areas and effectively capture more details of large-scale scenes. Notably, our approach does not rely on any prior knowledge about the target scene, attributing GF-NeRF adaptable to various large-scale scene types, including street-view and aerial-view scenes. We demonstrate that our method achieves high-fidelity, natural rendering results on various types of large-scale datasets. Our project page: https://shaomq2187.github.io/GF-NeRF/ ",
    "url": "https://arxiv.org/abs/2403.12839",
    "authors": [
      "Mingqi Shao",
      "Feng Xiong",
      "Hang Zhang",
      "Shuang Yang",
      "Mu Xu",
      "Wei Bian",
      "Xueqian Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12848",
    "title": "Compositional 3D Scene Synthesis with Scene Graph Guided Layout-Shape  Generation",
    "abstract": "Compositional 3D scene synthesis has diverse applications across a spectrum of industries such as robotics, films, and video games, as it closely mirrors the complexity of real-world multi-object environments. Early works typically employ shape retrieval based frameworks which naturally suffer from limited shape diversity. Recent progresses have been made in shape generation with powerful generative models, such as diffusion models, which increases the shape fidelity. However, these approaches separately treat 3D shape generation and layout generation. The synthesized scenes are usually hampered by layout collision, which implies that the scene-level fidelity is still under-explored. In this paper, we aim at generating realistic and reasonable 3D scenes from scene graph. To enrich the representation capability of the given scene graph inputs, large language model is utilized to explicitly aggregate the global graph features with local relationship features. With a unified graph convolution network (GCN), graph features are extracted from scene graphs updated via joint layout-shape distribution. During scene generation, an IoU-based regularization loss is introduced to constrain the predicted 3D layouts. Benchmarked on the SG-FRONT dataset, our method achieves better 3D scene synthesis, especially in terms of scene-level fidelity. The source code will be released after publication. ",
    "url": "https://arxiv.org/abs/2403.12848",
    "authors": [
      "Yao Wei",
      "Martin Renqiang Min",
      "George Vosselman",
      "Li Erran Li",
      "Michael Ying Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12864",
    "title": "A Comparison of Deep Learning Architectures for Spacecraft Anomaly  Detection",
    "abstract": "Spacecraft operations are highly critical, demanding impeccable reliability and safety. Ensuring the optimal performance of a spacecraft requires the early detection and mitigation of anomalies, which could otherwise result in unit or mission failures. With the advent of deep learning, a surge of interest has been seen in leveraging these sophisticated algorithms for anomaly detection in space operations. This study aims to compare the efficacy of various deep learning architectures in detecting anomalies in spacecraft data. The deep learning models under investigation include Convolutional Neural Networks (CNNs), Recurrent Neural Networks (RNNs), Long Short-Term Memory (LSTM) networks, and Transformer-based architectures. Each of these models was trained and validated using a comprehensive dataset sourced from multiple spacecraft missions, encompassing diverse operational scenarios and anomaly types. Initial results indicate that while CNNs excel in identifying spatial patterns and may be effective for some classes of spacecraft data, LSTMs and RNNs show a marked proficiency in capturing temporal anomalies seen in time-series spacecraft telemetry. The Transformer-based architectures, given their ability to focus on both local and global contexts, have showcased promising results, especially in scenarios where anomalies are subtle and span over longer durations. Additionally, considerations such as computational efficiency, ease of deployment, and real-time processing capabilities were evaluated. While CNNs and LSTMs demonstrated a balance between accuracy and computational demands, Transformer architectures, though highly accurate, require significant computational resources. In conclusion, the choice of deep learning architecture for spacecraft anomaly detection is highly contingent on the nature of the data, the type of anomalies, and operational constraints. ",
    "url": "https://arxiv.org/abs/2403.12864",
    "authors": [
      "Daniel Lakey",
      "Tim Schlippe"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12865",
    "title": "PE-Planner: A Performance-Enhanced Quadrotor Motion Planner for  Autonomous Flight in Complex and Dynamic Environments",
    "abstract": "The role of a motion planner is pivotal in quadrotor applications, yet existing methods often struggle to adapt to complex environments, limiting their ability to achieve fast, safe, and robust flight. In this letter, we introduce a performance-enhanced quadrotor motion planner designed for autonomous flight in complex environments including dense obstacles, dynamic obstacles, and unknown disturbances. The global planner generates an initial trajectory through kinodynamic path searching and refines it using B-spline trajectory optimization. Subsequently, the local planner takes into account the quadrotor dynamics, estimated disturbance, global reference trajectory, control cost, time cost, and safety constraints to generate real-time control inputs, utilizing the framework of model predictive contouring control. Both simulations and real-world experiments corroborate the heightened robustness, safety, and speed of the proposed motion planner. Additionally, our motion planner achieves flights at more than 6.8 m/s in a challenging and complex racing scenario. ",
    "url": "https://arxiv.org/abs/2403.12865",
    "authors": [
      "Jiaxin Qiu",
      "Qingchen Liu",
      "Jiahu Qin",
      "Dewang Cheng",
      "Yawei Tian",
      "Qichao Ma"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.12870",
    "title": "PoNQ: a Neural QEM-based Mesh Representation",
    "abstract": "Although polygon meshes have been a standard representation in geometry processing, their irregular and combinatorial nature hinders their suitability for learning-based applications. In this work, we introduce a novel learnable mesh representation through a set of local 3D sample Points and their associated Normals and Quadric error metrics (QEM) w.r.t. the underlying shape, which we denote PoNQ. A global mesh is directly derived from PoNQ by efficiently leveraging the knowledge of the local quadric errors. Besides marking the first use of QEM within a neural shape representation, our contribution guarantees both topological and geometrical properties by ensuring that a PoNQ mesh does not self-intersect and is always the boundary of a volume. Notably, our representation does not rely on a regular grid, is supervised directly by the target surface alone, and also handles open surfaces with boundaries and/or sharp features. We demonstrate the efficacy of PoNQ through a learning-based mesh prediction from SDF grids and show that our method surpasses recent state-of-the-art techniques in terms of both surface and edge-based metrics. ",
    "url": "https://arxiv.org/abs/2403.12870",
    "authors": [
      "Nissim Maruani",
      "Maks Ovsjanikov",
      "Pierre Alliez",
      "Mathieu Desbrun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12871",
    "title": "Wildfire danger prediction optimization with transfer learning",
    "abstract": "Convolutional Neural Networks (CNNs) have proven instrumental across various computer science domains, enabling advancements in object detection, classification, and anomaly detection. This paper explores the application of CNNs to analyze geospatial data specifically for identifying wildfire-affected areas. Leveraging transfer learning techniques, we fine-tuned CNN hyperparameters and integrated the Canadian Fire Weather Index (FWI) to assess moisture conditions. The study establishes a methodology for computing wildfire risk levels on a scale of 0 to 5, dynamically linked to weather patterns. Notably, through the integration of transfer learning, the CNN model achieved an impressive accuracy of 95\\% in identifying burnt areas. This research sheds light on the inner workings of CNNs and their practical, real-time utility in predicting and mitigating wildfires. By combining transfer learning and CNNs, this study contributes a robust approach to assess burnt areas, facilitating timely interventions and preventative measures against conflagrations. ",
    "url": "https://arxiv.org/abs/2403.12871",
    "authors": [
      "Spiros Maggioros",
      "Nikos Tsalkitzis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12904",
    "title": "Social bots sour activist sentiment without eroding engagement",
    "abstract": "Social media platforms have witnessed a substantial increase in social bot activity, significantly affecting online discourse. Our study explores the dynamic nature of bot engagement related to Extinction Rebellion climate change protests from 18 November 2019 to 10 December 2019. We find that bots exert a greater influence on human behavior than vice versa during heated online periods. To assess the causal impact of human-bot communication, we compared communication histories between human users who directly interacted with bots and matched human users who did not. Our findings demonstrate a consistent negative impact of bot interactions on subsequent human sentiment, with exposed users displaying significantly more negative sentiment than their counterparts. Furthermore, the nature of bot interaction influences human tweeting activity and the sentiment towards protests. Political astroturfing bots increase activity, whereas other bots decrease it. Sentiment changes towards protests depend on the user's original support level, indicating targeted manipulation. However, bot interactions do not change activists' engagement towards protests. Despite the seemingly minor impact of individual bot encounters, the cumulative effect is profound due to the large volume of bot communication. Our findings underscore the importance of unrestricted access to social media data for studying the prevalence and influence of social bots, as with new technological advancements distinguishing between bots and humans becomes nearly impossible. ",
    "url": "https://arxiv.org/abs/2403.12904",
    "authors": [
      "Linda Li",
      "Orsolya Vasarhelyi",
      "Balazs Vedres"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.12938",
    "title": "Neural Differential Algebraic Equations",
    "abstract": "Differential-Algebraic Equations (DAEs) describe the temporal evolution of systems that obey both differential and algebraic constraints. Of particular interest are systems that contain implicit relationships between their components, such as conservation relationships. Here, we present Neural Differential-Algebraic Equations (NDAEs) suitable for data-driven modeling of DAEs. This methodology is built upon the concept of the Universal Differential Equation; that is, a model constructed as a system of Neural Ordinary Differential Equations informed by theory from particular science domains. In this work, we show that the proposed NDAEs abstraction is suitable for relevant system-theoretic data-driven modeling tasks. Presented examples include (i) the inverse problem of tank-manifold dynamics and (ii) discrepancy modeling of a network of pumps, tanks, and pipes. Our experiments demonstrate the proposed method's robustness to noise and extrapolation ability to (i) learn the behaviors of the system components and their interaction physics and (ii) disambiguate between data trends and mechanistic relationships contained in the system. ",
    "url": "https://arxiv.org/abs/2403.12938",
    "authors": [
      "James Koch",
      "Madelyn Shapiro",
      "Himanshu Sharma",
      "Draguna Vrabie",
      "Jan Drgona"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12946",
    "title": "Sample Complexity of Offline Distributionally Robust Linear Markov  Decision Processes",
    "abstract": "In offline reinforcement learning (RL), the absence of active exploration calls for attention on the model robustness to tackle the sim-to-real gap, where the discrepancy between the simulated and deployed environments can significantly undermine the performance of the learned policy. To endow the learned policy with robustness in a sample-efficient manner in the presence of high-dimensional state-action space, this paper considers the sample complexity of distributionally robust linear Markov decision processes (MDPs) with an uncertainty set characterized by the total variation distance using offline data. We develop a pessimistic model-based algorithm and establish its sample complexity bound under minimal data coverage assumptions, which outperforms prior art by at least $\\tilde{O}(d)$, where $d$ is the feature dimension. We further improve the performance guarantee of the proposed algorithm by incorporating a carefully-designed variance estimator. ",
    "url": "https://arxiv.org/abs/2403.12946",
    "authors": [
      "He Wang",
      "Laixi Shi",
      "Yuejie Chi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2403.12949",
    "title": "A Novel Energy-Efficient Cross-Layer Design for Scheduling and Routing  in 6TiSCH Networks",
    "abstract": "The 6TiSCH protocol stack was proposed to ensure high-performance communications in the Industrial Internet of Things (IIoT). However, the lack of sufficient time slots for nodes outside the 6TiSCH's Destination Oriented Directed Acyclic Graph (DODAG) to transmit their Destination Advertisement Object (DAO) messages and cell reservation requests significantly hinders their integration into the DODAG. This oversight not only prolongs the device's join time but also increases energy consumption during the network formation phase. Moreover, challenges emerge due to the substantial number of control packets employed by both the 6TiSCH Scheduling Function (SF) and routing protocol (RPL), thus draining more energy resources, increasing medium contention, and decreasing spatial reuse. Furthermore, an SF that overlooks previously allocated slots when assigning new ones to the same node may increase jitter, and more complications ensue when it neglects the state of the TSCH queue, thus leading to packet dropping due to queue saturation. Additional complexity arises when the RPL disregards the new parent's schedule saturation during parent switching, which results in inefficient energy and time usage. To address these issues, we introduce in this paper novel mechanisms, strategically situated at the intersection of SF and RPL that are designed to balance the control packet distribution and adaptively manage parent switching. Our proposal, implemented within the 6TiSCH simulator, demonstrates significant improvements across vital performance metrics, such as node's joining time, jitter, latency, energy consumption, and amount of traffic, in comparison to the conventional 6TiSCH benchmark. ",
    "url": "https://arxiv.org/abs/2403.12949",
    "authors": [
      "Ahlam Hannachi",
      "Wael Jaafar",
      "Salim Bitam",
      "Nabil Ouazene"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2403.12957",
    "title": "GVGEN: Text-to-3D Generation with Volumetric Representation",
    "abstract": "In recent years, 3D Gaussian splatting has emerged as a powerful technique for 3D reconstruction and generation, known for its fast and high-quality rendering capabilities. To address these shortcomings, this paper introduces a novel diffusion-based framework, GVGEN, designed to efficiently generate 3D Gaussian representations from text input. We propose two innovative techniques:(1) Structured Volumetric Representation. We first arrange disorganized 3D Gaussian points as a structured form GaussianVolume. This transformation allows the capture of intricate texture details within a volume composed of a fixed number of Gaussians. To better optimize the representation of these details, we propose a unique pruning and densifying method named the Candidate Pool Strategy, enhancing detail fidelity through selective optimization. (2) Coarse-to-fine Generation Pipeline. To simplify the generation of GaussianVolume and empower the model to generate instances with detailed 3D geometry, we propose a coarse-to-fine pipeline. It initially constructs a basic geometric structure, followed by the prediction of complete Gaussian attributes. Our framework, GVGEN, demonstrates superior performance in qualitative and quantitative assessments compared to existing 3D generation methods. Simultaneously, it maintains a fast generation speed ($\\sim$7 seconds), effectively striking a balance between quality and efficiency. ",
    "url": "https://arxiv.org/abs/2403.12957",
    "authors": [
      "Xianglong He",
      "Junyi Chen",
      "Sida Peng",
      "Di Huang",
      "Yangguang Li",
      "Xiaoshui Huang",
      "Chun Yuan",
      "Wanli Ouyang",
      "Tong He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12050",
    "title": "Efficient and Accurate Hyperspectral Image Demosaicing with Neural  Network Architectures",
    "abstract": "Neural network architectures for image demosaicing have been become more and more complex. This results in long training periods of such deep networks and the size of the networks is huge. These two factors prevent practical implementation and usage of the networks in real-time platforms, which generally only have limited resources. This study investigates the effectiveness of neural network architectures in hyperspectral image demosaicing. We introduce a range of network models and modifications, and compare them with classical interpolation methods and existing reference network approaches. The aim is to identify robust and efficient performing network architectures. Our evaluation is conducted on two datasets, \"SimpleData\" and \"SimRealData,\" representing different degrees of realism in multispectral filter array (MSFA) data. The results indicate that our networks outperform or match reference models in both datasets demonstrating exceptional performance. Notably, our approach focuses on achieving correct spectral reconstruction rather than just visual appeal, and this emphasis is supported by quantitative and qualitative assessments. Furthermore, our findings suggest that efficient demosaicing solutions, which require fewer parameters, are essential for practical applications. This research contributes valuable insights into hyperspectral imaging and its potential applications in various fields, including medical imaging. ",
    "url": "https://arxiv.org/abs/2403.12050",
    "authors": [
      "Eric L. Wisotzky",
      "Lara Wallburg",
      "Anna Hilsmann",
      "Peter Eisert",
      "Thomas Wittenberg",
      "Stephan Göb"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12062",
    "title": "A GNN Approach for Cell-Free Massive MIMO",
    "abstract": "Beyond 5G wireless technology Cell-Free Massive MIMO (CFmMIMO) downlink relies on carefully designed precoders and power control to attain uniformly high rate coverage. Many such power control problems can be calculated via second order cone programming (SOCP). In practice, several order of magnitude faster numerical procedure is required because power control has to be rapidly updated to adapt to changing channel conditions. We propose a Graph Neural Network (GNN) based solution to replace SOCP. Specifically, we develop a GNN to obtain downlink max-min power control for a CFmMIMO with maximum ratio transmission (MRT) beamforming. We construct a graph representation of the problem that properly captures the dominant dependence relationship between access points (APs) and user equipments (UEs). We exploit a symmetry property, called permutation equivariance, to attain training simplicity and efficiency. Simulation results show the superiority of our approach in terms of computational complexity, scalability and generalizability for different system sizes and deployment scenarios. ",
    "url": "https://arxiv.org/abs/2403.12062",
    "authors": [
      "Lou Salaun",
      "Hong Yang",
      "Shashwat Mishra",
      "Chung Shue Chen"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Networking and Internet Architecture (cs.NI)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2403.12117",
    "title": "Transfer Learning for T-Cell Response Prediction",
    "abstract": "We study the prediction of T-cell response for specific given peptides, which could, among other applications, be a crucial step towards the development of personalized cancer vaccines. It is a challenging task due to limited, heterogeneous training data featuring a multi-domain structure; such data entail the danger of shortcut learning, where models learn general characteristics of peptide sources, such as the source organism, rather than specific peptide characteristics associated with T-cell response. Using a transformer model for T-cell response prediction, we show that the danger of inflated predictive performance is not merely theoretical but occurs in practice. Consequently, we propose a domain-aware evaluation scheme. We then study different transfer learning techniques to deal with the multi-domain structure and shortcut learning. We demonstrate a per-source fine tuning approach to be effective across a wide range of peptide sources and further show that our final model outperforms existing state-of-the-art approaches for predicting T-cell responses for human peptides. ",
    "url": "https://arxiv.org/abs/2403.12117",
    "authors": [
      "Josua Stadelmaier",
      "Brandon Malone",
      "Ralf Eggeling"
    ],
    "subjectives": [
      "Cell Behavior (q-bio.CB)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12187",
    "title": "Approximation of RKHS Functionals by Neural Networks",
    "abstract": "Motivated by the abundance of functional data such as time series and images, there has been a growing interest in integrating such data into neural networks and learning maps from function spaces to R (i.e., functionals). In this paper, we study the approximation of functionals on reproducing kernel Hilbert spaces (RKHS's) using neural networks. We establish the universality of the approximation of functionals on the RKHS's. Specifically, we derive explicit error bounds for those induced by inverse multiquadric, Gaussian, and Sobolev kernels. Moreover, we apply our findings to functional regression, proving that neural networks can accurately approximate the regression maps in generalized functional linear models. Existing works on functional learning require integration-type basis function expansions with a set of pre-specified basis functions. By leveraging the interpolating orthogonal projections in RKHS's, our proposed network is much simpler in that we use point evaluations to replace basis function expansions. ",
    "url": "https://arxiv.org/abs/2403.12187",
    "authors": [
      "Tian-Yi Zhou",
      "Namjoon Suh",
      "Guang Cheng",
      "Xiaoming Huo"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2403.12378",
    "title": "Distributionally Robust Density Control with Wasserstein Ambiguity Sets",
    "abstract": "Precise control under uncertainty requires a good understanding and characterization of the noise affecting the system. This paper studies the problem of steering state distributions of dynamical systems subject to partially known uncertainties. We model the distributional uncertainty of the noise process in terms of Wasserstein ambiguity sets, which, based on recent results, have been shown to be an effective means of capturing and propagating uncertainty through stochastic LTI systems. To this end, we propagate the distributional uncertainty of the state through the dynamical system, and, using an affine feedback control law, we steer the ambiguity set of the state to a prescribed, terminal ambiguity set. We also enforce distributionally robust CVaR constraints for the transient motion of the state so as to reside within a prescribed constraint space. The resulting optimization problem is formulated as a semi-definite program, which can be solved efficiently using standard off-the-shelf solvers. We illustrate the proposed distributionally-robust framework on a quadrotor landing problem subject to wind turbulence. ",
    "url": "https://arxiv.org/abs/2403.12378",
    "authors": [
      "Joshua Pilipovsky",
      "Panagiotis Tsiotras"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.12382",
    "title": "Low-Trace Adaptation of Zero-shot Self-supervised Blind Image Denoising",
    "abstract": "Deep learning-based denoiser has been the focus of recent development on image denoising. In the past few years, there has been increasing interest in developing self-supervised denoising networks that only require noisy images, without the need for clean ground truth for training. However, a performance gap remains between current self-supervised methods and their supervised counterparts. Additionally, these methods commonly depend on assumptions about noise characteristics, thereby constraining their applicability in real-world scenarios. Inspired by the properties of the Frobenius norm expansion, we discover that incorporating a trace term reduces the optimization goal disparity between self-supervised and supervised methods, thereby enhancing the performance of self-supervised learning. To exploit this insight, we propose a trace-constraint loss function and design the low-trace adaptation Noise2Noise (LoTA-N2N) model that bridges the gap between self-supervised and supervised learning. Furthermore, we have discovered that several existing self-supervised denoising frameworks naturally fall within the proposed trace-constraint loss as subcases. Extensive experiments conducted on natural and confocal image datasets indicate that our method achieves state-of-the-art performance within the realm of zero-shot self-supervised image denoising approaches, without relying on any assumptions regarding the noise. ",
    "url": "https://arxiv.org/abs/2403.12382",
    "authors": [
      "Jintong Hu",
      "Bin Xia",
      "Bingchen Li",
      "Wenming Yang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12659",
    "title": "Zeolite Adsorption Property Prediction using Deep Learning",
    "abstract": "The ability to efficiently predict adsorption properties of zeolites can be of large benefit in accelerating the design process of novel materials. The existing configuration space for these materials is wide, while existing molecular simulation methods are computationally expensive. In this work, we propose a model which is 4 to 5 orders of magnitude faster at adsorption properties compared to molecular simulations. To validate the model, we generated datasets containing various aluminium configurations for the MOR, MFI, RHO and ITW zeolites along with their heat of adsorptions and Henry coefficients for CO$_2$, obtained from Monte Carlo simulations. The predictions obtained from the Machine Learning model are in agreement with the values obtained from the Monte Carlo simulations, confirming that the model can be used for property prediction. Furthermore, we show that the model can be used for identifying adsorption sites. Finally, we evaluate the capability of our model for generating novel zeolite configurations by using it in combination with a genetic algorithm. ",
    "url": "https://arxiv.org/abs/2403.12659",
    "authors": [
      "Marko Petković",
      "José Manuel Vicent-Luna",
      "Vlado Menkovski",
      "Sofía Calero"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12729",
    "title": "Posterior Uncertainty Quantification in Neural Networks using Data  Augmentation",
    "abstract": "In this paper, we approach the problem of uncertainty quantification in deep learning through a predictive framework, which captures uncertainty in model parameters by specifying our assumptions about the predictive distribution of unseen future data. Under this view, we show that deep ensembling (Lakshminarayanan et al., 2017) is a fundamentally mis-specified model class, since it assumes that future data are supported on existing observations only -- a situation rarely encountered in practice. To address this limitation, we propose MixupMP, a method that constructs a more realistic predictive distribution using popular data augmentation techniques. MixupMP operates as a drop-in replacement for deep ensembles, where each ensemble member is trained on a random simulation from this predictive distribution. Grounded in the recently-proposed framework of Martingale posteriors (Fong et al., 2023), MixupMP returns samples from an implicitly defined Bayesian posterior. Our empirical analysis showcases that MixupMP achieves superior predictive performance and uncertainty quantification on various image classification datasets, when compared with existing Bayesian and non-Bayesian approaches. ",
    "url": "https://arxiv.org/abs/2403.12729",
    "authors": [
      "Luhuan Wu",
      "Sinead Williamson"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2007.07145",
    "title": "On sampling symmetric Gibbs distributions on sparse random graphs and  hypergraphs",
    "abstract": " Comments: Polished previous version ",
    "url": "https://arxiv.org/abs/2007.07145",
    "authors": [
      "Charilaos Efthymiou"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2203.07738",
    "title": "GCT: Graph Co-Training for Semi-Supervised Few-Shot Learning",
    "abstract": " Title: GCT: Graph Co-Training for Semi-Supervised Few-Shot Learning ",
    "url": "https://arxiv.org/abs/2203.07738",
    "authors": [
      "Rui Xu",
      "Lei Xing",
      "Shuai Shao",
      "Lifei Zhao",
      "Baodi Liu",
      "Weifeng Liu",
      "Yicong Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.06705",
    "title": "Deep Joint Source-Channel Coding Over Cooperative Relay Networks",
    "abstract": " Comments: Accepted to IEEE International Conference on Machine Learning for Communication and Networking (ICMLCN) 2024, code available via this link this https URL ",
    "url": "https://arxiv.org/abs/2211.06705",
    "authors": [
      "Chenghong Bian",
      "Yulin Shao",
      "Haotian Wu",
      "Deniz Gunduz"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2212.03281",
    "title": "Copula Conformal Prediction for Multi-step Time Series Forecasting",
    "abstract": " Title: Copula Conformal Prediction for Multi-step Time Series Forecasting ",
    "url": "https://arxiv.org/abs/2212.03281",
    "authors": [
      "Sophia Sun",
      "Rose Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2212.13992",
    "title": "Social-Aware Clustered Federated Learning with Customized Privacy  Preservation",
    "abstract": " Comments: This paper has been accepted by IEEE/ACM Transactions on Networking in March 2024 ",
    "url": "https://arxiv.org/abs/2212.13992",
    "authors": [
      "Yuntao Wang",
      "Zhou Su",
      "Yanghe Pan",
      "Tom H Luan",
      "Ruidong Li",
      "Shui Yu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.10229",
    "title": "ETHNO-DAANN: Ethnographic Engagement Classification by Deep Adversarial  Transfer Learning",
    "abstract": " Comments: This submission has been withdrawn by arXiv administrators as the second author was added without their knowledge or consent ",
    "url": "https://arxiv.org/abs/2301.10229",
    "authors": [
      "Rossi Kamal",
      "Zuzana Kubincova",
      "Mosaddek Hossain Kamal",
      "Upama Kabir"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2301.11187",
    "title": "Smoothed Online Learning for Prediction in Piecewise Affine Systems",
    "abstract": " Title: Smoothed Online Learning for Prediction in Piecewise Affine Systems ",
    "url": "https://arxiv.org/abs/2301.11187",
    "authors": [
      "Adam Block",
      "Max Simchowitz",
      "Russ Tedrake"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.13853",
    "title": "LAGAN: Deep Semi-Supervised Linguistic-Anthropology Classification with  Conditional Generative Adversarial Neural Network",
    "abstract": " Comments: This submission has been withdrawn by arXiv administrators as the second author was added without their knowledge or consent ",
    "url": "https://arxiv.org/abs/2301.13853",
    "authors": [
      "Rossi Kamal",
      "Zuzana Kubincova"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2302.03788",
    "title": "Toward a Theory of Causation for Interpreting Neural Code Models",
    "abstract": " Title: Toward a Theory of Causation for Interpreting Neural Code Models ",
    "url": "https://arxiv.org/abs/2302.03788",
    "authors": [
      "David N. Palacio",
      "Nathan Cooper",
      "Alvaro Rodriguez",
      "Kevin Moran",
      "Denys Poshyvanyk"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2303.10036",
    "title": "Individual differences in knowledge network navigation",
    "abstract": " Comments: 14 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2303.10036",
    "authors": [
      "Manran Zhu",
      "Taha Yasseri",
      "János Kertész"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.01838",
    "title": "BugNIST - a Large Volumetric Dataset for Object Detection under Domain  Shift",
    "abstract": " Comments: 20 pages, 6 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2304.01838",
    "authors": [
      "Patrick Møller Jensen",
      "Vedrana Andersen Dahl",
      "Carsten Gundlach",
      "Rebecca Engberg",
      "Hans Martin Kjer",
      "Anders Bjorholm Dahl"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.04962",
    "title": "Mask-Based Modeling for Neural Radiance Fields",
    "abstract": " Title: Mask-Based Modeling for Neural Radiance Fields ",
    "url": "https://arxiv.org/abs/2304.04962",
    "authors": [
      "Ganlin Yang",
      "Guoqiang Wei",
      "Zhizheng Zhang",
      "Yan Lu",
      "Dong Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.08571",
    "title": "Optimal Robust Network Design: Formulations and Algorithms for  Maximizing Algebraic Connectivity",
    "abstract": " Title: Optimal Robust Network Design: Formulations and Algorithms for  Maximizing Algebraic Connectivity ",
    "url": "https://arxiv.org/abs/2304.08571",
    "authors": [
      "Neelkamal Somisetty",
      "Harsha Nagarajan",
      "Swaroop Darbha"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2305.01604",
    "title": "The Training Process of Many Deep Networks Explores the Same  Low-Dimensional Manifold",
    "abstract": " Title: The Training Process of Many Deep Networks Explores the Same  Low-Dimensional Manifold ",
    "url": "https://arxiv.org/abs/2305.01604",
    "authors": [
      "Jialin Mao",
      "Itay Griniasty",
      "Han Kheng Teoh",
      "Rahul Ramesh",
      "Rubing Yang",
      "Mark K. Transtrum",
      "James P. Sethna",
      "Pratik Chaudhari"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)"
    ]
  },
  {
    "id": "arXiv:2305.08473",
    "title": "Shared and Private Information Learning in Multimodal Sentiment Analysis  with Deep Modal Alignment and Self-supervised Multi-Task Learning",
    "abstract": " Title: Shared and Private Information Learning in Multimodal Sentiment Analysis  with Deep Modal Alignment and Self-supervised Multi-Task Learning ",
    "url": "https://arxiv.org/abs/2305.08473",
    "authors": [
      "Songning Lai",
      "Jiakang Li",
      "Guinan Guo",
      "Xifeng Hu",
      "Yulong Li",
      "Yuan Tan",
      "Zichen Song",
      "Yutong Liu",
      "Zhaoxia Ren",
      "Chun Wan",
      "Danmin Miao",
      "Zhi Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.18026",
    "title": "Semantic Role Labeling Guided Out-of-distribution Detection",
    "abstract": " Comments: accepted by COLING 2024 ",
    "url": "https://arxiv.org/abs/2305.18026",
    "authors": [
      "Jinan Zou",
      "Maihao Guo",
      "Yu Tian",
      "Yuhao Lin",
      "Haiyao Cao",
      "Lingqiao Liu",
      "Ehsan Abbasnejad",
      "Javen Qinfeng Shi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.19115",
    "title": "High-Gain Disturbance Observer for Robust Trajectory Tracking of  Quadrotors",
    "abstract": " Title: High-Gain Disturbance Observer for Robust Trajectory Tracking of  Quadrotors ",
    "url": "https://arxiv.org/abs/2305.19115",
    "authors": [
      "Mohammadreza Izadi",
      "Reza Faieghi"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.19157",
    "title": "Sensor Fault Detection and Compensation with Performance Prescription  for Robotic Manipulators",
    "abstract": " Title: Sensor Fault Detection and Compensation with Performance Prescription  for Robotic Manipulators ",
    "url": "https://arxiv.org/abs/2305.19157",
    "authors": [
      "S. Mohammadreza Ebrahimi",
      "Farid Norouzi",
      "Hossein Dastres",
      "Reza Faieghi",
      "Mehdi Naderi",
      "Milad Malekzadeh"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2306.03000",
    "title": "BeyondPixels: A Comprehensive Review of the Evolution of Neural Radiance  Fields",
    "abstract": " Comments: 33 page, 7 figure, 5 table ",
    "url": "https://arxiv.org/abs/2306.03000",
    "authors": [
      "AKM Shahariar Azad Rabby",
      "Chengcui Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.08266",
    "title": "Analyzing Robustness of Angluin's L$^*$ Algorithm in Presence of Noise",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2209.10315 ",
    "url": "https://arxiv.org/abs/2306.08266",
    "authors": [
      "Lina Ye",
      "Igor Khmelnitsky",
      "Serge Haddad",
      "Benoît Barbot",
      "Benedikt Bollig",
      "Martin Leucker",
      "Daniel Neider",
      "Rajarshi Roy"
    ],
    "subjectives": [
      "Formal Languages and Automata Theory (cs.FL)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2306.11035",
    "title": "Adversarial Training Should Be Cast as a Non-Zero-Sum Game",
    "abstract": " Title: Adversarial Training Should Be Cast as a Non-Zero-Sum Game ",
    "url": "https://arxiv.org/abs/2306.11035",
    "authors": [
      "Alexander Robey",
      "Fabian Latorre",
      "George J. Pappas",
      "Hamed Hassani",
      "Volkan Cevher"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.01187",
    "title": "SAMAug: Point Prompt Augmentation for Segment Anything Model",
    "abstract": " Title: SAMAug: Point Prompt Augmentation for Segment Anything Model ",
    "url": "https://arxiv.org/abs/2307.01187",
    "authors": [
      "Haixing Dai",
      "Chong Ma",
      "Zhiling Yan",
      "Zhengliang Liu",
      "Enze Shi",
      "Yiwei Li",
      "Peng Shu",
      "Xiaozheng Wei",
      "Lin Zhao",
      "Zihao Wu",
      "Fang Zeng",
      "Dajiang Zhu",
      "Wei Liu",
      "Quanzheng Li",
      "Lichao Sun",
      "Shu Zhang Tianming Liu",
      "Xiang Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.04755",
    "title": "Information decomposition in complex systems via machine learning",
    "abstract": " Comments: Project page: this https URL ",
    "url": "https://arxiv.org/abs/2307.04755",
    "authors": [
      "Kieran A. Murphy",
      "Dani S. Bassett"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Soft Condensed Matter (cond-mat.soft)",
      "Information Theory (cs.IT)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2308.03135",
    "title": "EventBind: Learning a Unified Representation to Bind Them All for  Event-based Open-world Understanding",
    "abstract": " Comments: Conference version with supplementary ",
    "url": "https://arxiv.org/abs/2308.03135",
    "authors": [
      "Jiazhou Zhou",
      "Xu Zheng",
      "Yuanhuiyi Lyu",
      "Lin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.10148",
    "title": "Privacy Perceptions and Behaviors of Google Personal Account Holders in  Saudi Arabia",
    "abstract": " Comments: To appear in Proceedings of Human Computer Interaction International (HCII) 2024 ",
    "url": "https://arxiv.org/abs/2308.10148",
    "authors": [
      "Eman Alashwali",
      "Lorrie Faith Cranor"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Cryptography and Security (cs.CR)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.15805",
    "title": "Design of Coherent Passive Quantum Equalizers Using Robust Control  Theory",
    "abstract": " Title: Design of Coherent Passive Quantum Equalizers Using Robust Control  Theory ",
    "url": "https://arxiv.org/abs/2308.15805",
    "authors": [
      "V. Ugrinovskii",
      "M.R. James"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2309.01582",
    "title": "Improving Visual Quality and Transferability of Adversarial Attacks on  Face Recognition Simultaneously with Adversarial Restoration",
    "abstract": " Comments: \\copyright 2023 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses, in any current or future media, including reprinting/republishing this material for advertising or promotional purposes, creating new collective works, for resale or redistribution to servers or lists, or reuse of any copyrighted component of this work in other works ",
    "url": "https://arxiv.org/abs/2309.01582",
    "authors": [
      "Fengfan Zhou",
      "Hefei Ling",
      "Yuxuan Shi",
      "Jiazhong Chen",
      "Ping Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.09007",
    "title": "MonoForce: Self-supervised Learning of Physics-aware Model for  Predicting Robot-terrain Interaction",
    "abstract": " Comments: 8 pages, IROS-2024 submission ",
    "url": "https://arxiv.org/abs/2309.09007",
    "authors": [
      "Ruslan Agishev",
      "Karel Zimmermann",
      "Vladimír Kubelka",
      "Martin Pecka",
      "Tomáš Svoboda"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.09297",
    "title": "Chasing Day and Night: Towards Robust and Efficient All-Day Object  Detection Guided by an Event Camera",
    "abstract": " Comments: Accepted by ICRA 2024 ",
    "url": "https://arxiv.org/abs/2309.09297",
    "authors": [
      "Jiahang Cao",
      "Xu Zheng",
      "Yuanhuiyi Lyu",
      "Jiaxu Wang",
      "Renjing Xu",
      "Lin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.10787",
    "title": "AV-SUPERB: A Multi-Task Evaluation Benchmark for Audio-Visual  Representation Models",
    "abstract": " Comments: Accepted to ICASSP 2024; Evaluation Code: this https URL Submission Platform: this https URL ",
    "url": "https://arxiv.org/abs/2309.10787",
    "authors": [
      "Yuan Tseng",
      "Layne Berry",
      "Yi-Ting Chen",
      "I-Hsiang Chiu",
      "Hsuan-Hao Lin",
      "Max Liu",
      "Puyuan Peng",
      "Yi-Jen Shih",
      "Hung-Yu Wang",
      "Haibin Wu",
      "Po-Yao Huang",
      "Chun-Mao Lai",
      "Shang-Wen Li",
      "David Harwath",
      "Yu Tsao",
      "Shinji Watanabe",
      "Abdelrahman Mohamed",
      "Chi-Luen Feng",
      "Hung-yi Lee"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2309.14590",
    "title": "HeLiPR: Heterogeneous LiDAR Dataset for inter-LiDAR Place Recognition  under Spatiotemporal Variations",
    "abstract": " Comments: 11 pages, 9 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2309.14590",
    "authors": [
      "Minwoo Jung",
      "Wooseong Yang",
      "Dongjae Lee",
      "Hyeonjae Gil",
      "Giseop Kim",
      "Ayoung Kim"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.00840",
    "title": "Error Norm Truncation: Robust Training in the Presence of Data Noise for  Text Generation Models",
    "abstract": " Comments: ICLR 2024 ",
    "url": "https://arxiv.org/abs/2310.00840",
    "authors": [
      "Tianjian Li",
      "Haoran Xu",
      "Philipp Koehn",
      "Daniel Khashabi",
      "Kenton Murray"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.01755",
    "title": "ImageNet-OOD: Deciphering Modern Out-of-Distribution Detection  Algorithms",
    "abstract": " Comments: ICLR 2024. Code and dataset at this https URL ",
    "url": "https://arxiv.org/abs/2310.01755",
    "authors": [
      "William Yang",
      "Byron Zhang",
      "Olga Russakovsky"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.06921",
    "title": "Hybrid Zonotope-Based Backward Reachability Analysis for Neural Feedback  Systems With Nonlinear Plant Models",
    "abstract": " Comments: Accepted by IEEE American Control Conference 2024, 9 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2310.06921",
    "authors": [
      "Hang Zhang",
      "Yuhao Zhang",
      "Xiangru Xu"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.11409",
    "title": "LLMs as Hackers: Autonomous Linux Privilege Escalation Attacks",
    "abstract": " Comments: 11 pages ",
    "url": "https://arxiv.org/abs/2310.11409",
    "authors": [
      "Andreas Happe",
      "Aaron Kaplan",
      "Jürgen Cito"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.14394",
    "title": "Neural Networks are Integrable",
    "abstract": " Title: Neural Networks are Integrable ",
    "url": "https://arxiv.org/abs/2310.14394",
    "authors": [
      "Yucong Liu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2311.02629",
    "title": "Pointer Networks with Q-Learning for OP Combinatorial Optimization",
    "abstract": " Title: Pointer Networks with Q-Learning for OP Combinatorial Optimization ",
    "url": "https://arxiv.org/abs/2311.02629",
    "authors": [
      "Alessandro Barro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2311.15056",
    "title": "Accurate and interpretable drug-drug interaction prediction enabled by  knowledge subgraph learning",
    "abstract": " Comments: Accepted to Nature Communications (Medicine) ",
    "url": "https://arxiv.org/abs/2311.15056",
    "authors": [
      "Yaqing Wang",
      "Zaifei Yang",
      "Quanming Yao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.15380",
    "title": "Grafite: Taming Adversarial Queries with Optimal Range Filters",
    "abstract": " Comments: Accepted for publication in Proceedings of the ACM on Management of Data (SIGMOD 2024) ",
    "url": "https://arxiv.org/abs/2311.15380",
    "authors": [
      "Marco Costa",
      "Paolo Ferragina",
      "Giorgio Vinciguerra"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2311.16191",
    "title": "Learning Multi-Pattern Normalities in the Frequency Domain for Efficient  Time Series Anomaly Detection",
    "abstract": " Comments: Accepted by IEEE 40th International Conference on Data Engineering (ICDE 2024) ",
    "url": "https://arxiv.org/abs/2311.16191",
    "authors": [
      "Feiyi Chen",
      "Yingying zhang",
      "Zhen Qin",
      "Lunting Fan",
      "Renhe Jiang",
      "Yuxuan Liang",
      "Qingsong Wen",
      "Shuiguang Deng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.03774",
    "title": "OctreeOcc: Efficient and Multi-Granularity Occupancy Prediction Using  Octree Queries",
    "abstract": " Title: OctreeOcc: Efficient and Multi-Granularity Occupancy Prediction Using  Octree Queries ",
    "url": "https://arxiv.org/abs/2312.03774",
    "authors": [
      "Yuhang Lu",
      "Xinge Zhu",
      "Tai Wang",
      "Yuexin Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.08656",
    "title": "MaxK-GNN: Extremely Fast GPU Kernel Design for Accelerating Graph Neural  Networks Training",
    "abstract": " Comments: ASPLOS 2024 accepted publication ",
    "url": "https://arxiv.org/abs/2312.08656",
    "authors": [
      "Hongwu Peng",
      "Xi Xie",
      "Kaustubh Shivdikar",
      "MD Amit Hasan",
      "Jiahui Zhao",
      "Shaoyi Huang",
      "Omer Khan",
      "David Kaeli",
      "Caiwen Ding"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2312.11232",
    "title": "Self-Supervised Learning for Image Super-Resolution and Deblurring",
    "abstract": " Title: Self-Supervised Learning for Image Super-Resolution and Deblurring ",
    "url": "https://arxiv.org/abs/2312.11232",
    "authors": [
      "Jérémy Scanvic",
      "Mike Davies",
      "Patrice Abry",
      "Julián Tachella"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.11730",
    "title": "Stronger Graph Transformer with Regularized Attention Scores",
    "abstract": " Title: Stronger Graph Transformer with Regularized Attention Scores ",
    "url": "https://arxiv.org/abs/2312.11730",
    "authors": [
      "Eugene Ku",
      "Swetha Arunraj"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.12784",
    "title": "Fast Cell Library Characterization for Design Technology Co-Optimization  Based on Graph Neural Networks",
    "abstract": " Title: Fast Cell Library Characterization for Design Technology Co-Optimization  Based on Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2312.12784",
    "authors": [
      "Tianliang Ma",
      "Guangxi Fan",
      "Zhihui Deng",
      "Xuguang Sun",
      "Kainlu Low",
      "Leilai Shao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08876",
    "title": "Evaluating the Utility of Conformal Prediction Sets for AI-Advised Image  Labeling",
    "abstract": " Comments: 19 pages, 11 figures, 10 tables. Accepted by ACM CHI 2024 ",
    "url": "https://arxiv.org/abs/2401.08876",
    "authors": [
      "Dongping Zhang",
      "Angelos Chatzimparmpas",
      "Negar Kamali",
      "Jessica Hullman"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.09516",
    "title": "Accelerating Data Generation for Neural Operators via Krylov Subspace  Recycling",
    "abstract": " Title: Accelerating Data Generation for Neural Operators via Krylov Subspace  Recycling ",
    "url": "https://arxiv.org/abs/2401.09516",
    "authors": [
      "Hong Wang",
      "Zhongkai Hao",
      "Jie Wang",
      "Zijie Geng",
      "Zhen Wang",
      "Bin Li",
      "Feng Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2401.11576",
    "title": "Quantum Architecture Search with Unsupervised Representation Learning",
    "abstract": " Comments: 9 Pages, quantum architecture search, unsupervised representation learning ",
    "url": "https://arxiv.org/abs/2401.11576",
    "authors": [
      "Yize Sun",
      "Zixin Wu",
      "Yunpu Ma",
      "Volker Tresp"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.15771",
    "title": "Bayesian Nonparametrics Meets Data-Driven Robust Optimization",
    "abstract": " Title: Bayesian Nonparametrics Meets Data-Driven Robust Optimization ",
    "url": "https://arxiv.org/abs/2401.15771",
    "authors": [
      "Nicola Bariletto",
      "Nhat Ho"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.17859",
    "title": "Towards Semantic Consistency: Dirichlet Energy Driven Robust Multi-Modal  Entity Alignment",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2307.16210 by other authors ",
    "url": "https://arxiv.org/abs/2401.17859",
    "authors": [
      "Yuanyi Wang",
      "Haifeng Sun",
      "Jiabo Wang",
      "Jingyu Wang",
      "Wei Tang",
      "Qi Qi",
      "Shaoling Sun",
      "Jianxin Liao"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2402.02464",
    "title": "A Graph is Worth $K$ Words: Euclideanizing Graph using Pure Transformer",
    "abstract": " Title: A Graph is Worth $K$ Words: Euclideanizing Graph using Pure Transformer ",
    "url": "https://arxiv.org/abs/2402.02464",
    "authors": [
      "Zhangyang Gao",
      "Daize Dong",
      "Cheng Tan",
      "Jun Xia",
      "Bozhen Hu",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2402.03094",
    "title": "Cross-Domain Few-Shot Object Detection via Enhanced Open-Set Object  Detector",
    "abstract": " Title: Cross-Domain Few-Shot Object Detection via Enhanced Open-Set Object  Detector ",
    "url": "https://arxiv.org/abs/2402.03094",
    "authors": [
      "Yuqian Fu",
      "Yu Wang",
      "Yixuan Pan",
      "Lian Huai",
      "Xingyu Qiu",
      "Zeyu Shangguan",
      "Tong Liu",
      "Yanwei Fu",
      "Luc Van Gool",
      "Xingqun Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04527",
    "title": "RA-Rec: An Efficient ID Representation Alignment Framework for LLM-based  Recommendation",
    "abstract": " Comments: 10 pages ",
    "url": "https://arxiv.org/abs/2402.04527",
    "authors": [
      "Xiaohan Yu",
      "Li Zhang",
      "Xin Zhao",
      "Yue Wang",
      "Zhongrui Ma"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.05348",
    "title": "Are We Asking the Right Questions?: Designing for Community  Stakeholders' Interactions with AI in Policing",
    "abstract": " Title: Are We Asking the Right Questions?: Designing for Community  Stakeholders' Interactions with AI in Policing ",
    "url": "https://arxiv.org/abs/2402.05348",
    "authors": [
      "MD Romael Haque",
      "Devansh Saxena",
      "Katy Weathington",
      "Joseph Chudzik",
      "Shion Guha"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2402.05946",
    "title": "Unveiling Latent Causal Rules: A Temporal Point Process Approach for  Abnormal Event Explanation",
    "abstract": " Comments: Accepted by AISTATS 2024 ",
    "url": "https://arxiv.org/abs/2402.05946",
    "authors": [
      "Yiling Kuang",
      "Chao Yang",
      "Yang Yang",
      "Shuang Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.09450",
    "title": "Guiding Masked Representation Learning to Capture Spatio-Temporal  Relationship of Electrocardiogram",
    "abstract": " Comments: ICLR 2024. The first three authors contribute equally ",
    "url": "https://arxiv.org/abs/2402.09450",
    "authors": [
      "Yeongyeon Na",
      "Minje Park",
      "Yunwon Tae",
      "Sunghoon Joo"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10109",
    "title": "Towards Reducing Diagnostic Errors with Interpretable Risk Prediction",
    "abstract": " Title: Towards Reducing Diagnostic Errors with Interpretable Risk Prediction ",
    "url": "https://arxiv.org/abs/2402.10109",
    "authors": [
      "Denis Jered McInerney",
      "William Dickinson",
      "Lucy C. Flynn",
      "Andrea C. Young",
      "Geoffrey S. Young",
      "Jan-Willem van de Meent",
      "Byron C. Wallace"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.11137",
    "title": "TuneTables: Context Optimization for Scalable Prior-Data Fitted Networks",
    "abstract": " Title: TuneTables: Context Optimization for Scalable Prior-Data Fitted Networks ",
    "url": "https://arxiv.org/abs/2402.11137",
    "authors": [
      "Benjamin Feuer",
      "Robin Tibor Schirrmeister",
      "Valeriia Cherepanova",
      "Chinmay Hegde",
      "Frank Hutter",
      "Micah Goldblum",
      "Niv Cohen",
      "Colin White"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.12518",
    "title": "Gaussian Process Neural Additive Models",
    "abstract": " Comments: Appears at AAAI 2024 ",
    "url": "https://arxiv.org/abs/2402.12518",
    "authors": [
      "Wei Zhang",
      "Brian Barr",
      "John Paisley"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.13605",
    "title": "KorNAT: LLM Alignment Benchmark for Korean Social Values and Common  Knowledge",
    "abstract": " Comments: 35 pages, 7 figures, 16 tables ",
    "url": "https://arxiv.org/abs/2402.13605",
    "authors": [
      "Jiyoung Lee",
      "Minwoo Kim",
      "Seungho Kim",
      "Junghwan Kim",
      "Seunghyun Won",
      "Hwaran Lee",
      "Edward Choi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.00665",
    "title": "Complex-Valued Neural Network based Federated Learning for Multi-user  Indoor Positioning Performance Optimization",
    "abstract": " Comments: 13 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2403.00665",
    "authors": [
      "Hanzhi Yu",
      "Yuchen Liu",
      "Mingzhe Chen"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.01046",
    "title": "A Library of Mirrors: Deep Neural Nets in Low Dimensions are Convex  Lasso Models with Reflection Features",
    "abstract": " Title: A Library of Mirrors: Deep Neural Nets in Low Dimensions are Convex  Lasso Models with Reflection Features ",
    "url": "https://arxiv.org/abs/2403.01046",
    "authors": [
      "Emi Zeger",
      "Yifei Wang",
      "Aaron Mishkin",
      "Tolga Ergen",
      "Emmanuel Candès",
      "Mert Pilanci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.05007",
    "title": "Age of Computing: A Metric of Computation Freshness in Communication and  Computation Cooperative Networks",
    "abstract": " Title: Age of Computing: A Metric of Computation Freshness in Communication and  Computation Cooperative Networks ",
    "url": "https://arxiv.org/abs/2403.05007",
    "authors": [
      "Xingran Chen",
      "Yusha Liu",
      "Yali Zheng",
      "Kun Yang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.05723",
    "title": "Digital Wellbeing Redefined: Toward User-Centric Approach for Positive  Social Media Engagement",
    "abstract": " Comments: MOBILESoft 2024, Lisbon, Portugal ",
    "url": "https://arxiv.org/abs/2403.05723",
    "authors": [
      "Yixue Zhao",
      "Tianyi Li",
      "Michael Sobolev"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2403.05881",
    "title": "KG-Rank: Enhancing Large Language Models for Medical QA with Knowledge  Graphs and Ranking Techniques",
    "abstract": " Title: KG-Rank: Enhancing Large Language Models for Medical QA with Knowledge  Graphs and Ranking Techniques ",
    "url": "https://arxiv.org/abs/2403.05881",
    "authors": [
      "Rui Yang",
      "Haoran Liu",
      "Edison Marrese-Taylor",
      "Qingcheng Zeng",
      "Yu He Ke",
      "Wanxin Li",
      "Lechao Cheng",
      "Qingyu Chen",
      "James Caverlee",
      "Yutaka Matsuo",
      "Irene Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.07310",
    "title": "How does promoting the minority fraction affect generalization? A  theoretical study of the one-hidden-layer neural network on group imbalance",
    "abstract": " Title: How does promoting the minority fraction affect generalization? A  theoretical study of the one-hidden-layer neural network on group imbalance ",
    "url": "https://arxiv.org/abs/2403.07310",
    "authors": [
      "Hongkang Li",
      "Shuai Zhang",
      "Yihua Zhang",
      "Meng Wang",
      "Sijia Liu",
      "Pin-Yu Chen"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07311",
    "title": "Knowledge Graph Large Language Model (KG-LLM) for Link Prediction",
    "abstract": " Comments: 23 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2403.07311",
    "authors": [
      "Dong Shu",
      "Tianle Chen",
      "Mingyu Jin",
      "Yiting Zhang",
      "Chong Zhang",
      "Mengnan Du",
      "Yongfeng Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07673",
    "title": "Towards Model Extraction Attacks in GAN-Based Image Translation via  Domain Shift Mitigation",
    "abstract": " Comments: Accepted by AAAI 2024 ",
    "url": "https://arxiv.org/abs/2403.07673",
    "authors": [
      "Di Mi",
      "Yanjun Zhang",
      "Leo Yu Zhang",
      "Shengshan Hu",
      "Qi Zhong",
      "Haizhuan Yuan",
      "Shirui Pan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.08438",
    "title": "Reproducibility and Geometric Intrinsic Dimensionality: An Investigation  on Graph Neural Network Research",
    "abstract": " Comments: 39 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2403.08438",
    "authors": [
      "Tobias Hille",
      "Maximilian Stubbemann",
      "Tom Hanika"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.09481",
    "title": "Clinical Reasoning over Tabular Data and Text with Bayesian Networks",
    "abstract": " Comments: 10 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2403.09481",
    "authors": [
      "Paloma Rabaey",
      "Johannes Deleu",
      "Stefan Heytens",
      "Thomas Demeester"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.10103",
    "title": "DyBluRF: Dynamic Neural Radiance Fields from Blurry Monocular Video",
    "abstract": " Comments: Accepted by CVPR 2024. Project page: this https URL ",
    "url": "https://arxiv.org/abs/2403.10103",
    "authors": [
      "Huiqiang Sun",
      "Xingyi Li",
      "Liao Shen",
      "Xinyi Ye",
      "Ke Xian",
      "Zhiguo Cao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.10319",
    "title": "NetBench: A Large-Scale and Comprehensive Network Traffic Benchmark  Dataset for Foundation Models",
    "abstract": " Title: NetBench: A Large-Scale and Comprehensive Network Traffic Benchmark  Dataset for Foundation Models ",
    "url": "https://arxiv.org/abs/2403.10319",
    "authors": [
      "Chen Qian",
      "Xiaochang Li",
      "Qineng Wang",
      "Gang Zhou",
      "Huajie Shao"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.10357",
    "title": "ANIM: Accurate Neural Implicit Model for Human Reconstruction from a  single RGB-D image",
    "abstract": " Comments: Accepted to CVPR24; Project page: this https URL ",
    "url": "https://arxiv.org/abs/2403.10357",
    "authors": [
      "Marco Pesavento",
      "Yuanlu Xu",
      "Nikolaos Sarafianos",
      "Robert Maier",
      "Ziyan Wang",
      "Chun-Han Yao",
      "Marco Volino",
      "Edmond Boyer",
      "Adrian Hilton",
      "Tony Tung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2403.10801",
    "title": "Securely Fine-tuning Pre-trained Encoders Against Adversarial Examples",
    "abstract": " Title: Securely Fine-tuning Pre-trained Encoders Against Adversarial Examples ",
    "url": "https://arxiv.org/abs/2403.10801",
    "authors": [
      "Ziqi Zhou",
      "Minghui Li",
      "Wei Liu",
      "Shengshan Hu",
      "Yechao Zhang",
      "Wei Wan",
      "Lulu Xue",
      "Leo Yu Zhang",
      "Dezhong Yao",
      "Hai Jin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.10904",
    "title": "Urban Sound Propagation: a Benchmark for 1-Step Generative Modeling of  Complex Physical Systems",
    "abstract": " Title: Urban Sound Propagation: a Benchmark for 1-Step Generative Modeling of  Complex Physical Systems ",
    "url": "https://arxiv.org/abs/2403.10904",
    "authors": [
      "Martin Spitznagel",
      "Janis Keuper"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2403.11087",
    "title": "Incorporating Higher-order Structural Information for Graph Clustering",
    "abstract": " Title: Incorporating Higher-order Structural Information for Graph Clustering ",
    "url": "https://arxiv.org/abs/2403.11087",
    "authors": [
      "Qiankun Li",
      "Haobing Liu",
      "Ruobing Jiang",
      "Tingting Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.11220",
    "title": "CPA-Enhancer: Chain-of-Thought Prompted Adaptive Enhancer for Object  Detection under Unknown Degradations",
    "abstract": " Title: CPA-Enhancer: Chain-of-Thought Prompted Adaptive Enhancer for Object  Detection under Unknown Degradations ",
    "url": "https://arxiv.org/abs/2403.11220",
    "authors": [
      "Yuwei Zhang",
      "Yan Wu",
      "Yanming Liu",
      "Xinyue Peng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.11370",
    "title": "DynamicGlue: Epipolar and Time-Informed Data Association in Dynamic  Environments using Graph Neural Networks",
    "abstract": " Title: DynamicGlue: Epipolar and Time-Informed Data Association in Dynamic  Environments using Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2403.11370",
    "authors": [
      "Theresa Huber",
      "Simon Schaefer",
      "Stefan Leutenegger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.11492",
    "title": "SmartRefine: A Scenario-Adaptive Refinement Framework for Efficient  Motion Prediction",
    "abstract": " Comments: Camera-ready version for CVPR 2024 ",
    "url": "https://arxiv.org/abs/2403.11492",
    "authors": [
      "Yang Zhou",
      "Hao Shao",
      "Letian Wang",
      "Steven L. Waslander",
      "Hongsheng Li",
      "Yu Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.11672",
    "title": "WIA-LD2ND: Wavelet-based Image Alignment for Self-supervised Low-Dose CT  Denoising",
    "abstract": " Comments: 12 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2403.11672",
    "authors": [
      "Haoyu Zhao",
      "Yuliang Gu",
      "Zhou Zhao",
      "Bo Du",
      "Yongchao Xu",
      "Rui Yu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.12009",
    "title": "Leveraging Spatial and Semantic Feature Extraction for Skin Cancer  Diagnosis with Capsule Networks and Graph Neural Networks",
    "abstract": " Comments: This is the first version of our paper, we gladly expect feedback and corrections if there is any mistake within our paper ",
    "url": "https://arxiv.org/abs/2403.12009",
    "authors": [
      "K. P. Santoso",
      "R. V. H. Ginardi",
      "R. A. Sastrowardoyo",
      "F. A. Madany"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  }
]