[
  {
    "id": "arXiv:2303.00032",
    "title": "Decentralized Model Dissemination Empowered Federated Learning in mmWave  Aerial-Terrestrial Integrated Networks",
    "abstract": "It is anticipated that aerial-terrestrial integrated networks incorporating unmanned aerial vehicles (UAVs) mounted relays will offer improved coverage and connectivity in the beyond 5G era. Meanwhile, federated learning (FL) is a promising distributed machine learning technique for building inference models over wireless networks due to its ability to maintain user privacy and reduce communication overhead. However, off-the-shelf FL models aggregate global parameters at a central parameter server (CPS), increasing energy consumption and latency, as well as inefficiently utilizing radio resource blocks (RRBs) for distributed user devices (UDs). This paper presents a resource-efficient FL framework, called FedMoD (\\textbf{fed}erated learning with \\textbf{mo}del \\textbf{d}issemination), for millimeter-wave (mmWave) aerial-terrestrial integrated networks with the following two unique characteristics. Firstly, FedMoD presents a novel decentralized model dissemination algorithm that makes use of UAVs as local model aggregators through UAV-to-UAV and device-to-device (D2D) communications. As a result, FedMoD (i) increases the number of participant UDs in developing FL model and (ii) achieves global model aggregation without involving CPS. Secondly, FedMoD reduces the energy consumption of FL using radio resource management (RRM) under the constraints of over-the-air learning latency. In order to achieve this, by leveraging graph theory, FedMoD optimizes the scheduling of line-of-sight (LOS) UDs to suitable UAVs/RRBs over mmWave links and non-LOS UDs to available LOS UDs via overlay D2D communications. Extensive simulations reveal that decentralized FedMoD offers same convergence rate performance as compared to conventional FL frameworks. ",
    "url": "https://arxiv.org/abs/2303.00032",
    "authors": [
      "Mohammed S. Al-Abiad",
      "Md. Zoheb Hassan",
      "Md. Jahangir Hossain"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2303.00035",
    "title": "Collaborative Mean Estimation over Intermittently Connected Networks  with Peer-To-Peer Privacy",
    "abstract": "This work considers the problem of Distributed Mean Estimation (DME) over networks with intermittent connectivity, where the goal is to learn a global statistic over the data samples localized across distributed nodes with the help of a central server. To mitigate the impact of intermittent links, nodes can collaborate with their neighbors to compute local consensus which they forward to the central server. In such a setup, the communications between any pair of nodes must satisfy local differential privacy constraints. We study the tradeoff between collaborative relaying and privacy leakage due to the additional data sharing among nodes and, subsequently, propose a novel differentially private collaborative algorithm for DME to achieve the optimal tradeoff. Finally, we present numerical simulations to substantiate our theoretical findings. ",
    "url": "https://arxiv.org/abs/2303.00035",
    "authors": [
      "Rajarshi Saha",
      "Mohamed Seif",
      "Michal Yemini",
      "Andrea J. Goldsmith",
      "H. Vincent Poor"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00046",
    "title": "Robustness of edited neural networks",
    "abstract": "Successful deployment in uncertain, real-world environments requires that deep learning models can be efficiently and reliably modified in order to adapt to unexpected issues. However, the current trend toward ever-larger models makes standard retraining procedures an ever-more expensive burden. For this reason, there is growing interest in model editing, which enables computationally inexpensive, interpretable, post-hoc model modifications. While many model editing techniques are promising, research on the properties of edited models is largely limited to evaluation of validation accuracy. The robustness of edited models is an important and yet mostly unexplored topic. In this paper, we employ recently developed techniques from the field of deep learning robustness to investigate both how model editing affects the general robustness of a model, as well as the robustness of the specific behavior targeted by the edit. We find that edits tend to reduce general robustness, but that the degree of degradation depends on the editing algorithm chosen. In particular, robustness is best preserved by more constrained techniques that modify less of the model. Motivated by these observations, we introduce two new model editing algorithms, direct low-rank model editing and 1-layer interpolation (1-LI), which each exhibit strong generalization performance. ",
    "url": "https://arxiv.org/abs/2303.00046",
    "authors": [
      "Davis Brown",
      "Charles Godfrey",
      "Cody Nizinski",
      "Jonathan Tu",
      "Henry Kvinge"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00050",
    "title": "Dynamic Multi-View Scene Reconstruction Using Neural Implicit Surface",
    "abstract": "Reconstructing general dynamic scenes is important for many computer vision and graphics applications. Recent works represent the dynamic scene with neural radiance fields for photorealistic view synthesis, while their surface geometry is under-constrained and noisy. Other works introduce surface constraints to the implicit neural representation to disentangle the ambiguity of geometry and appearance field for static scene reconstruction. To bridge the gap between rendering dynamic scenes and recovering static surface geometry, we propose a template-free method to reconstruct surface geometry and appearance using neural implicit representations from multi-view videos. We leverage topology-aware deformation and the signed distance field to learn complex dynamic surfaces via differentiable volume rendering without scene-specific prior knowledge like template models. Furthermore, we propose a novel mask-based ray selection strategy to significantly boost the optimization on challenging time-varying regions. Experiments on different multi-view video datasets demonstrate that our method achieves high-fidelity surface reconstruction as well as photorealistic novel view synthesis. ",
    "url": "https://arxiv.org/abs/2303.00050",
    "authors": [
      "Decai Chen",
      "Haofei Lu",
      "Ingo Feldmann",
      "Oliver Schreer",
      "Peter Eisert"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00055",
    "title": "Learning time-scales in two-layers neural networks",
    "abstract": "Gradient-based learning in multi-layer neural networks displays a number of striking features. In particular, the decrease rate of empirical risk is non-monotone even after averaging over large batches. Long plateaus in which one observes barely any progress alternate with intervals of rapid decrease. These successive phases of learning often take place on very different time scales. Finally, models learnt in an early phase are typically `simpler' or `easier to learn' although in a way that is difficult to formalize. Although theoretical explanations of these phenomena have been put forward, each of them captures at best certain specific regimes. In this paper, we study the gradient flow dynamics of a wide two-layer neural network in high-dimension, when data are distributed according to a single-index model (i.e., the target function depends on a one-dimensional projection of the covariates). Based on a mixture of new rigorous results, non-rigorous mathematical derivations, and numerical simulations, we propose a scenario for the learning dynamics in this setting. In particular, the proposed evolution exhibits separation of timescales and intermittency. These behaviors arise naturally because the population gradient flow can be recast as a singularly perturbed dynamical system. ",
    "url": "https://arxiv.org/abs/2303.00055",
    "authors": [
      "Raphaël Berthier",
      "Andrea Montanari",
      "Kangjie Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2303.00058",
    "title": "Neural Nonnegative Matrix Factorization for Hierarchical Multilayer  Topic Modeling",
    "abstract": "We introduce a new method based on nonnegative matrix factorization, Neural NMF, for detecting latent hierarchical structure in data. Datasets with hierarchical structure arise in a wide variety of fields, such as document classification, image processing, and bioinformatics. Neural NMF recursively applies NMF in layers to discover overarching topics encompassing the lower-level features. We derive a backpropagation optimization scheme that allows us to frame hierarchical NMF as a neural network. We test Neural NMF on a synthetic hierarchical dataset, the 20 Newsgroups dataset, and the MyLymeData symptoms dataset. Numerical results demonstrate that Neural NMF outperforms other hierarchical NMF methods on these data sets and offers better learned hierarchical structure and interpretability of topics. ",
    "url": "https://arxiv.org/abs/2303.00058",
    "authors": [
      "Tyler Will",
      "Runyu Zhang",
      "Eli Sadovnik",
      "Mengdi Gao",
      "Joshua Vendrow",
      "Jamie Haddock",
      "Denali Molitor",
      "Deanna Needell"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2303.00076",
    "title": "A multivariate Riesz basis of ReLU neural networks",
    "abstract": "We consider the trigonometric-like system of piecewise linear functions introduced recently by Daubechies, DeVore, Foucart, Hanin, and Petrova. We provide an alternative proof that this system forms a Riesz basis of $L_2([0,1])$ based on the Gershgorin theorem. We also generalize this system to higher dimensions $d>1$ by a construction, which avoids using (tensor) products. As a consequence, the functions from the new Riesz basis of $L_2([0,1]^d)$ can be easily represented by neural networks. Moreover, the Riesz constants of this system are independent of $d$, making it an attractive building block regarding future multivariate analysis of neural networks. ",
    "url": "https://arxiv.org/abs/2303.00076",
    "authors": [
      "Cornelia Schneider",
      "Jan Vybíral"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Functional Analysis (math.FA)"
    ]
  },
  {
    "id": "arXiv:2303.00105",
    "title": "Scalability and Sample Efficiency Analysis of Graph Neural Networks for  Power System State Estimation",
    "abstract": "Data-driven state estimation (SE) is becoming increasingly important in modern power systems, as it allows for more efficient analysis of system behaviour using real-time measurement data. This paper thoroughly evaluates a PMU-only state estimator based on graph neural networks (GNNs) applied over factor graphs. To assess the sample efficiency of the GNN model, we perform multiple training experiments on various training set sizes. Additionally, to evaluate the scalability of the GNN model, we conduct experiments on power systems of various sizes. Our results show that the GNN-based state estimator exhibits high accuracy and efficient use of data. Additionally, it demonstrated scalability in terms of both memory usage and inference time, making it a promising solution for data-driven SE in modern power systems. ",
    "url": "https://arxiv.org/abs/2303.00105",
    "authors": [
      "Ognjen Kundacina",
      "Gorana Gojic",
      "Mirsad Cosovic",
      "Dragisa Miskovic",
      "Dejan Vukobratovic"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.00109",
    "title": "Linear Size Universal Point Sets for Classes of Planar Graphs",
    "abstract": "A finite set $P$ of points in the plane is $n$-universal with respect to a class $\\mathcal{C}$ of planar graphs if every $n$-vertex graph in $\\mathcal{C}$ admits a crossing-free straight-line drawing with vertices at points of $P$. For the class of all planar graphs the best known upper bound on the size of a universal point set is quadratic and the best known lower bound is linear in $n$. Some classes of planar graphs are known to admit universal point sets of near linear size, however, there are no truly linear bounds for interesting classes beyond outerplanar graphs. In this paper, we show that there is a universal point set of size $2n-2$ for the class of bipartite planar graphs with $n$ vertices. The same point set is also universal for the class of $n$-vertex planar graphs of maximum degree $3$. The point set used for the results is what we call an exploding double chain, and we prove that this point set allows planar straight-line embeddings of many more planar graphs, namely of all subgraphs of planar graphs admitting a one-sided Hamiltonian cycle. The result for bipartite graphs also implies that every $n$-vertex plane graph has a $1$-bend drawing all whose bends and vertices are contained in a specific point set of size $4n-6$, this improves a bound of $6n-10$ for the same problem by L\\\"offler and T\\'oth. ",
    "url": "https://arxiv.org/abs/2303.00109",
    "authors": [
      "Stefan Felsner",
      "Hendrik Schrezenmaier",
      "Felix Schröder",
      "Raphael Steiner"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2303.00110",
    "title": "A P Systems Variant for Reasoning about Sequential Controllability of  Boolean Networks",
    "abstract": "A Boolean network is a discrete dynamical system operating on vectors of Boolean variables. The action of a Boolean network can be conveniently expressed as a system of Boolean update functions, computing the new values for each component of the Boolean vector as a function of the other components. Boolean networks are widely used in modelling biological systems that can be seen as consisting of entities which can be activated or deactivated, expressed or inhibited, on or off. P systems on the other hand are classically introduced as a model of hierarchical multiset rewriting. However, over the years the community has proposed a wide range of P system variants including diverse ingredients suited for various needs. In this work, we propose a new variant -- Boolean P systems -- specifically designed for reasoning about sequential controllability of Boolean networks, and use it to first establish a crisp formalization of the problem, and then to prove that the problem of sequential controllability is PSPACE-complete. We further claim that Boolean P systems are a demonstration of how P systems can be used to construct ad hoc formalisms, custom-tailored for reasoning about specific problems, and providing new advantageous points of view. ",
    "url": "https://arxiv.org/abs/2303.00110",
    "authors": [
      "Artiom Alhazov",
      "Vincent Ferrari-Dominguez",
      "Rudolf Freund",
      "Nicolas Glade",
      "Sergiu Ivanov"
    ],
    "subjectives": [
      "Formal Languages and Automata Theory (cs.FL)"
    ]
  },
  {
    "id": "arXiv:2303.00116",
    "title": "Neural Auctions Compromise Bidder Information",
    "abstract": "Single-shot auctions are commonly used as a means to sell goods, for example when selling ad space or allocating radio frequencies, however devising mechanisms for auctions with multiple bidders and multiple items can be complicated. It has been shown that neural networks can be used to approximate optimal mechanisms while satisfying the constraints that an auction be strategyproof and individually rational. We show that despite such auctions maximizing revenue, they do so at the cost of revealing private bidder information. While randomness is often used to build in privacy, in this context it comes with complications if done without care. Specifically, it can violate rationality and feasibility constraints, fundamentally change the incentive structure of the mechanism, and/or harm top-level metrics such as revenue and social welfare. We propose a method that employs stochasticity to improve privacy while meeting the requirements for auction mechanisms with only a modest sacrifice in revenue. We analyze the cost to the auction house that comes with introducing varying degrees of privacy in common auction settings. Our results show that despite current neural auctions' ability to approximate optimal mechanisms, the resulting vulnerability that comes with relying on neural networks must be accounted for. ",
    "url": "https://arxiv.org/abs/2303.00116",
    "authors": [
      "Alex Stein",
      "Avi Schwarzschild",
      "Michael Curry",
      "Tom Goldstein",
      "John Dickerson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2303.00128",
    "title": "Representation Disentaglement via Regularization by Identification",
    "abstract": "This work focuses on the problem of learning disentangled representations from observational data. Given observations ${\\mathbf{x}^{(i)}}$ for $i=1,...,N $ drawn from $p(\\mathbf{x}|\\mathbf{y})$ with generative variables $\\mathbf{y}$ admitting the distribution factorization $p(\\mathbf{y}) = \\prod_{c} p(\\mathbf{y}_c )$ we ask whether learning disentangled representations matching the space of observations with identification guarantees on the posterior $p(\\mathbf{z}| \\mathbf{x}, \\hat{\\mathbf{y}}_c)$ for each $c$, is plausible. We argue modern deep representation learning models are ill-posed with collider bias behaviour; a source of bias producing entanglement between generating variables. Under the rubric of causality, we show this issue can be explained and reconciled under the condition of identifiability; attainable under supervision or a weak-form of it. For this, we propose regularization by identification (ReI), a regularization framework defined by the identification of the causal queries involved in the learning problem. Empirical evidence shows that enforcing ReI in a variational framework results in disentangled representations equipped with generalization capabilities to out-of-distribution examples and that aligns nicely with the true expected effect between generating variables and measurement apparatus. ",
    "url": "https://arxiv.org/abs/2303.00128",
    "authors": [
      "Juan Castorena"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00132",
    "title": "Onboard dynamic-object detection and tracking for autonomous robot  navigation with RGB-D camera",
    "abstract": "Deploying autonomous robots in crowded indoor environments usually requires them to have accurate dynamic obstacle perception. Although plenty of previous works in the autonomous driving field have investigated the 3D object detection problem, the usage of dense point clouds from a heavy LiDAR and their high computation cost for learning-based data processing make those methods not applicable to lightweight robots, such as vision-based UAVs with small onboard computers. To address this issue, we propose a lightweight 3D dynamic obstacle detection and tracking (DODT) method based on an RGB-D camera. Our method adopts a novel ensemble detection strategy, combining multiple computationally efficient but low-accuracy detectors to achieve real-time high-accuracy obstacle detection. Besides, we introduce a new feature-based data association method to prevent mismatches and use the Kalman filter with the constant acceleration model to track detected obstacles. In addition, our system includes an optional and auxiliary learning-based module to enhance the obstacle detection range and dynamic obstacle identification. The users can determine whether or not to run this module based on the available computation resources. The proposed method is implemented in a lightweight quadcopter, and the experiments prove that the algorithm can make the robot detect dynamic obstacles and navigate dynamic environments safely. ",
    "url": "https://arxiv.org/abs/2303.00132",
    "authors": [
      "Zhefan Xu",
      "Xiaoyang Zhan",
      "Yumeng Xiu",
      "Christopher Suzuki",
      "Kenji Shimada"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2303.00154",
    "title": "Neural inverse procedural modeling of knitting yarns from images",
    "abstract": "We investigate the capabilities of neural inverse procedural modeling to infer high-quality procedural yarn models with fiber-level details from single images of depicted yarn samples. While directly inferring all parameters of the underlying yarn model based on a single neural network may seem an intuitive choice, we show that the complexity of yarn structures in terms of twisting and migration characteristics of the involved fibers can be better encountered in terms of ensembles of networks that focus on individual characteristics. We analyze the effect of different loss functions including a parameter loss to penalize the deviation of inferred parameters to ground truth annotations, a reconstruction loss to enforce similar statistics of the image generated for the estimated parameters in comparison to training images as well as an additional regularization term to explicitly penalize deviations between latent codes of synthetic images and the average latent code of real images in the latent space of the encoder. We demonstrate that the combination of a carefully designed parametric, procedural yarn model with respective network ensembles as well as loss functions even allows robust parameter inference when solely trained on synthetic data. Since our approach relies on the availability of a yarn database with parameter annotations and we are not aware of such a respectively available dataset, we additionally provide, to the best of our knowledge, the first dataset of yarn images with annotations regarding the respective yarn parameters. For this purpose, we use a novel yarn generator that improves the realism of the produced results over previous approaches. ",
    "url": "https://arxiv.org/abs/2303.00154",
    "authors": [
      "Elena Trunz",
      "Jonathan Klein",
      "Jan Müller",
      "Lukas Bode",
      "Ralf Sarlette",
      "Michael Weinmann",
      "Reinhard Klein"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00155",
    "title": "Exponential Consensus of Multiple Agents over Dynamic Network Topology:  Controllability, Connectivity, and Compactness",
    "abstract": "This paper investigates the problem of securing exponentially fast consensus (exponential consensus for short) for identical agents with finite-dimensional linear system dynamics over dynamic network topology. Our aim is to find the weakest possible conditions that guarantee exponentially fast consensus using a Lyapunov function consisting of a sum of terms of the same functional form. We first investigate necessary conditions, starting by examining the system (both agent and network) parameters. It is found that controllability of the linear agents is necessary for reaching consensus. Then, to work out necessary conditions incorporating the network topology, we construct a set of Laplacian matrix-valued functions. The precompactness of this set of functions is shown to be a significant generalization of existing assumptions on network topology, including the common assumption that the edge weights are bounded piecewise constant functions or continuous functions. With the aid of such a precompactness assumption and restricting the Lyapunov function to one consisting of a sum of terms of the same functional form, we prove that a joint $(\\delta, T)$-connectivity condition on the network topology is necessary for exponential consensus. Finally, we investigate how the above two ``necessities'' work together to guarantee exponential consensus. To partially address this problem, we define a synchronization index to characterize the interplay between agent parameters and network topology. Based on this notion, it is shown that by designing a proper feedback matrix and under the precompactness assumption, exponential consensus can be reached globally and uniformly if the joint $(\\delta,T)$-connectivity and controllability conditions are satisfied, and the synchronization index is not less than one. ",
    "url": "https://arxiv.org/abs/2303.00155",
    "authors": [
      "Qichao Ma",
      "Jiahu Qin",
      "Brian D. O. Anderson",
      "Long Wang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2303.00158",
    "title": "HyScale-GNN: A Scalable Hybrid GNN Training System on Single-Node  Heterogeneous Architecture",
    "abstract": "Graph Neural Networks (GNNs) have shown success in many real-world applications that involve graph-structured data. Most of the existing single-node GNN training systems are capable of training medium-scale graphs with tens of millions of edges; however, scaling them to large-scale graphs with billions of edges remains challenging. In addition, it is challenging to map GNN training algorithms onto a computation node as state-of-the-art machines feature heterogeneous architecture consisting of multiple processors and a variety of accelerators. We propose HyScale-GNN, a novel system to train GNN models on a single-node heterogeneous architecture. HyScale- GNN performs hybrid training which utilizes both the processors and the accelerators to train a model collaboratively. Our system design overcomes the memory size limitation of existing works and is optimized for training GNNs on large-scale graphs. We propose a two-stage data pre-fetching scheme to reduce the communication overhead during GNN training. To improve task mapping efficiency, we propose a dynamic resource management mechanism, which adjusts the workload assignment and resource allocation during runtime. We evaluate HyScale-GNN on a CPU-GPU and a CPU-FPGA heterogeneous architecture. Using several large-scale datasets and two widely-used GNN models, we compare the performance of our design with a multi-GPU baseline implemented in PyTorch-Geometric. The CPU-GPU design and the CPU-FPGA design achieve up to 2.08x speedup and 12.6x speedup, respectively. Compared with the state-of-the-art large-scale multi-node GNN training systems such as P3 and DistDGL, our CPU-FPGA design achieves up to 5.27x speedup using a single node. ",
    "url": "https://arxiv.org/abs/2303.00158",
    "authors": [
      "Yi-Chien Lin",
      "Viktor Prasanna"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2303.00170",
    "title": "Asymmetric Learning for Graph Neural Network based Link Prediction",
    "abstract": "Link prediction is a fundamental problem in many graph based applications, such as protein-protein interaction prediction. Graph neural network (GNN) has recently been widely used for link prediction. However, existing GNN based link prediction (GNN-LP) methods suffer from scalability problem during training for large-scale graphs, which has received little attention by researchers. In this paper, we first give computation complexity analysis of existing GNN-LP methods, which reveals that the scalability problem stems from their symmetric learning strategy adopting the same class of GNN models to learn representation for both head and tail nodes. Then we propose a novel method, called asymmetric learning (AML), for GNN-LP. The main idea of AML is to adopt a GNN model for learning head node representation while using a multi-layer perceptron (MLP) model for learning tail node representation. Furthermore, AML proposes a row-wise sampling strategy to generate mini-batch for training, which is a necessary component to make the asymmetric learning strategy work for training speedup. To the best of our knowledge, AML is the first GNN-LP method adopting an asymmetric learning strategy for node representation learning. Experiments on three real large-scale datasets show that AML is 1.7X~7.3X faster in training than baselines with a symmetric learning strategy, while having almost no accuracy loss. ",
    "url": "https://arxiv.org/abs/2303.00170",
    "authors": [
      "Kai-Lang Yao",
      "Wu-Jun Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2303.00171",
    "title": "DTW-SiameseNet: Dynamic Time Warped Siamese Network for Mispronunciation  Detection and Correction",
    "abstract": "Personal Digital Assistants (PDAs) - such as Siri, Alexa and Google Assistant, to name a few - play an increasingly important role to access information and complete tasks spanning multiple domains, and by diverse groups of users. A text-to-speech (TTS) module allows PDAs to interact in a natural, human-like manner, and play a vital role when the interaction involves people with visual impairments or other disabilities. To cater to the needs of a diverse set of users, inclusive TTS is important to recognize and pronounce correctly text in different languages and dialects. Despite great progress in speech synthesis, the pronunciation accuracy of named entities in a multi-lingual setting still has a large room for improvement. Existing approaches to correct named entity (NE) mispronunciations, like retraining Grapheme-to-Phoneme (G2P) models, or maintaining a TTS pronunciation dictionary, require expensive annotation of the ground truth pronunciation, which is also time consuming. In this work, we present a highly-precise, PDA-compatible pronunciation learning framework for the task of TTS mispronunciation detection and correction. In addition, we also propose a novel mispronunciation detection model called DTW-SiameseNet, which employs metric learning with a Siamese architecture for Dynamic Time Warping (DTW) with triplet loss. We demonstrate that a locale-agnostic, privacy-preserving solution to the problem of TTS mispronunciation detection is feasible. We evaluate our approach on a real-world dataset, and a corpus of NE pronunciations of an anonymized audio dataset of person names recorded by participants from 10 different locales. Human evaluation shows our proposed approach improves pronunciation accuracy on average by ~6% compared to strong phoneme-based and audio-based baselines. ",
    "url": "https://arxiv.org/abs/2303.00171",
    "authors": [
      "Raviteja Anantha",
      "Kriti Bhasin",
      "Daniela de la Parra Aguilar",
      "Prabal Vashisht",
      "Becci Williamson",
      "Srinivas Chappidi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2303.00179",
    "title": "A Unified Momentum-based Paradigm of Decentralized SGD for Non-Convex  Models and Heterogeneous Data",
    "abstract": "Emerging distributed applications recently boosted the development of decentralized machine learning, especially in IoT and edge computing fields. In real-world scenarios, the common problems of non-convexity and data heterogeneity result in inefficiency, performance degradation, and development stagnation. The bulk of studies concentrates on one of the issues mentioned above without having a more general framework that has been proven optimal. To this end, we propose a unified paradigm called UMP, which comprises two algorithms, D-SUM and GT-DSUM, based on the momentum technique with decentralized stochastic gradient descent(SGD). The former provides a convergence guarantee for general non-convex objectives. At the same time, the latter is extended by introducing gradient tracking, which estimates the global optimization direction to mitigate data heterogeneity(i.e., distribution drift). We can cover most momentum-based variants based on the classical heavy ball or Nesterov's acceleration with different parameters in UMP. In theory, we rigorously provide the convergence analysis of these two approaches for non-convex objectives and conduct extensive experiments, demonstrating a significant improvement in model accuracy by up to 57.6% compared to other methods in practice. ",
    "url": "https://arxiv.org/abs/2303.00179",
    "authors": [
      "Haizhou Du",
      "Chengdong Ni"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2303.00180",
    "title": "FaceRNET: a Facial Expression Intensity Estimation Network",
    "abstract": "This paper presents our approach for Facial Expression Intensity Estimation from videos. It includes two components: i) a representation extractor network that extracts various emotion descriptors (valence-arousal, action units and basic expressions) from each videoframe; ii) a RNN that captures temporal information in the data, followed by a mask layer which enables handling varying input video lengths through dynamic routing. This approach has been tested on the Hume-Reaction dataset yielding excellent results. ",
    "url": "https://arxiv.org/abs/2303.00180",
    "authors": [
      "Dimitrios Kollias",
      "Andreas Psaroudakis",
      "Anastasios Arsenos",
      "Paraskeui Theofilou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00181",
    "title": "Selectively Hard Negative Mining for Alleviating Gradient Vanishing in  Image-Text Matching",
    "abstract": "Recently, a series of Image-Text Matching (ITM) methods achieve impressive performance. However, we observe that most existing ITM models suffer from gradients vanishing at the beginning of training, which makes these models prone to falling into local minima. Most ITM models adopt triplet loss with Hard Negative mining (HN) as the optimization objective. We find that optimizing an ITM model using only the hard negative samples can easily lead to gradient vanishing. In this paper, we derive the condition under which the gradient vanishes during training. When the difference between the positive pair similarity and the negative pair similarity is close to 0, the gradients on both the image and text encoders will approach 0. To alleviate the gradient vanishing problem, we propose a Selectively Hard Negative Mining (SelHN) strategy, which chooses whether to mine hard negative samples according to the gradient vanishing condition. SelHN can be plug-and-play applied to existing ITM models to give them better training behavior. To further ensure the back-propagation of gradients, we construct a Residual Visual Semantic Embedding model with SelHN, denoted as RVSE++. Extensive experiments on two ITM benchmarks demonstrate the strength of RVSE++, achieving state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2303.00181",
    "authors": [
      "Zheng Li",
      "Caili Guo",
      "Xin Wang",
      "Zerun Feng",
      "Zhongtian Du"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2303.00196",
    "title": "Transformed Low-Rank Parameterization Can Help Robust Generalization for  Tensor Neural Networks",
    "abstract": "Achieving efficient and robust multi-channel data learning is a challenging task in data science. By exploiting low-rankness in the transformed domain, i.e., transformed low-rankness, tensor Singular Value Decomposition (t-SVD) has achieved extensive success in multi-channel data representation and has recently been extended to function representation such as Neural Networks with t-product layers (t-NNs). However, it still remains unclear how t-SVD theoretically affects the learning behavior of t-NNs. This paper is the first to answer this question by deriving the upper bounds of the generalization error of both standard and adversarially trained t-NNs. It reveals that the t-NNs compressed by exact transformed low-rank parameterization can achieve a sharper adversarial generalization bound. In practice, although t-NNs rarely have exactly transformed low-rank weights, our analysis further shows that by adversarial training with gradient flow (GF), the over-parameterized t-NNs with ReLU activations are trained with implicit regularization towards transformed low-rank parameterization under certain conditions. We also establish adversarial generalization bounds for t-NNs with approximately transformed low-rank weights. Our analysis indicates that the transformed low-rank parameterization can promisingly enhance robust generalization for t-NNs. ",
    "url": "https://arxiv.org/abs/2303.00196",
    "authors": [
      "Andong Wang",
      "Chao Li",
      "Mingyuan Bai",
      "Zhong Jin",
      "Guoxu Zhou",
      "Qibin Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.00198",
    "title": "Self-Supervised Convolutional Visual Prompts",
    "abstract": "Machine learning models often fail on out-of-distribution (OOD) samples. Visual prompts emerge as a light-weight adaptation method in input space for large-scale vision models. Existing vision prompts optimize a high-dimensional additive vector and require labeled data on training. However, we find this paradigm fails on test-time adaptation when labeled data is unavailable, where the high-dimensional visual prompt overfits to the self-supervised objective. We present convolutional visual prompts for test-time adaptation without labels. Our convolutional prompt is structured and requires fewer trainable parameters (less than 1 % parameters of standard visual prompts). Extensive experiments on a wide variety of OOD recognition tasks show that our approach is effective, improving robustness by up to 5.87 % over a number of large-scale model architectures. ",
    "url": "https://arxiv.org/abs/2303.00198",
    "authors": [
      "Yun-Yun Tsai",
      "Chengzhi Mao",
      "Yow-Kuan Lin",
      "Junfeng Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00200",
    "title": "Feature Extraction Matters More: Universal Deepfake Disruption through  Attacking Ensemble Feature Extractors",
    "abstract": "Adversarial example is a rising way of protecting facial privacy security from deepfake modification. To prevent massive facial images from being illegally modified by various deepfake models, it is essential to design a universal deepfake disruptor. However, existing works treat deepfake disruption as an End-to-End process, ignoring the functional difference between feature extraction and image reconstruction, which makes it difficult to generate a cross-model universal disruptor. In this work, we propose a novel Feature-Output ensemble UNiversal Disruptor (FOUND) against deepfake networks, which explores a new opinion that considers attacking feature extractors as the more critical and general task in deepfake disruption. We conduct an effective two-stage disruption process. We first disrupt multi-model feature extractors through multi-feature aggregation and individual-feature maintenance, and then develop a gradient-ensemble algorithm to enhance the disruption effect by simplifying the complex optimization problem of disrupting multiple End-to-End models. Extensive experiments demonstrate that FOUND can significantly boost the disruption effect against ensemble deepfake benchmark models. Besides, our method can fast obtain a cross-attribute, cross-image, and cross-model universal deepfake disruptor with only a few training images, surpassing state-of-the-art universal disruptors in both success rate and efficiency. ",
    "url": "https://arxiv.org/abs/2303.00200",
    "authors": [
      "Long Tang",
      "Dengpan Ye",
      "Zhenhao Lu",
      "Yunming Zhang",
      "Shengshan Hu",
      "Yue Xu",
      "Chuanxi Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.00215",
    "title": "Single Image Backdoor Inversion via Robust Smoothed Classifiers",
    "abstract": "Backdoor inversion, the process of finding a backdoor trigger inserted into a machine learning model, has become the pillar of many backdoor detection and defense methods. Previous works on backdoor inversion often recover the backdoor through an optimization process to flip a support set of clean images into the target class. However, it is rarely studied and understood how large this support set should be to recover a successful backdoor. In this work, we show that one can reliably recover the backdoor trigger with as few as a single image. Specifically, we propose the SmoothInv method, which first constructs a robust smoothed version of the backdoored classifier and then performs guided image synthesis towards the target class to reveal the backdoor pattern. SmoothInv requires neither an explicit modeling of the backdoor via a mask variable, nor any complex regularization schemes, which has become the standard practice in backdoor inversion methods. We perform both quantitaive and qualitative study on backdoored classifiers from previous published backdoor attacks. We demonstrate that compared to existing methods, SmoothInv is able to recover successful backdoors from single images, while maintaining high fidelity to the original backdoor. We also show how we identify the target backdoored class from the backdoored classifier. Last, we propose and analyze two countermeasures to our approach and show that SmoothInv remains robust in the face of an adaptive attacker. Our code is available at https://github.com/locuslab/smoothinv . ",
    "url": "https://arxiv.org/abs/2303.00215",
    "authors": [
      "Mingjie Sun",
      "Zico Kolter"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00223",
    "title": "Meal-time Detection by Means of Long Periods Blood Glucose Level  Monitoring via IoT Technology",
    "abstract": "Blood glucose level monitoring is of great importance, especially for subjects experiencing type 1 diabetes. Accurate monitoring of their blood glucose level prevents dangerous and life-threatening situations that might be experienced by those subjects. In addition, precise monitoring of blood glucose levels over long periods of time helps establishing knowledge about the daily mealtime routine which aids the medical staff to monitor subjects and properly intervene in hazardous cases such as hypo- or hyperglycemia. Establishing such knowledge will play a potential role when designing proper treatment intervention plan. In this research, we present a complete IoT framework, starting from hardware acquisition system to data analysis approaches that gives a hand for medical staff when long periods of blood glucose monitoring are essential for subjects. Also, this framework is validated with real-time data collection from 7 subjects over 10 successive days with temporal resolution of 5 minutes allowing for near real-time monitoring and analysis. Our results show the precisely estimated daily mealtime routines for 4 subjects out of the 7 with discard of 3 subjects due to huge data loss mainly. The daily mealtime routines for the 4 subjects are found to be matching to have a pattern of 4 periods of blood glucose level changes corresponding to the breakfast around 8 AM, the lunch around 5 PM, the dinner around 8 PM, and finally a within-day snack around 12 PM. The research shows the potential of IoT ecosystem in support for medically related studies. ",
    "url": "https://arxiv.org/abs/2303.00223",
    "authors": [
      "Hassan M. Ahmed",
      "Souhail Maraoui",
      "Muhammed Abd Elnaby Sadek",
      "Bessam Abdulrazak",
      "Camille Vandenberghe",
      "Stephen Cunnane C. Cunnane",
      "F. Guillaume Blanchet"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2303.00236",
    "title": "P$^2$SDF for Neural Indoor Scene Reconstruction",
    "abstract": "Given only a set of images, neural implicit surface representation has shown its capability in 3D surface reconstruction. However, as the nature of per-scene optimization is based on the volumetric rendering of color, previous neural implicit surface reconstruction methods usually fail in low-textured regions, including the floors, walls, etc., which commonly exist for indoor scenes. Being aware of the fact that these low-textured regions usually correspond to planes, without introducing additional ground-truth supervisory signals or making additional assumptions about the room layout, we propose to leverage a novel Pseudo Plane-regularized Signed Distance Field (P$^2$SDF) for indoor scene reconstruction. Specifically, we consider adjacent pixels with similar colors to be on the same pseudo planes. The plane parameters are then estimated on the fly during training by an efficient and effective two-step scheme. Then the signed distances of the points on the planes are regularized by the estimated plane parameters in the training phase. As the unsupervised plane segments are usually noisy and inaccurate, we propose to assign different weights to the sampled points on the plane in plane estimation as well as the regularization loss. The weights come by fusing the plane segments from different views. As the sampled rays in the planar regions are redundant, leading to inefficient training, we further propose a keypoint-guided rays sampling strategy that attends to the informative textured regions with large color variations, and the implicit network gets a better reconstruction, compared with the original uniform ray sampling strategy. Experiments show that our P$^2$SDF achieves competitive reconstruction performance in Manhattan scenes. Further, as we do not introduce any additional room layout assumption, our P$^2$SDF generalizes well to the reconstruction of non-Manhattan scenes. ",
    "url": "https://arxiv.org/abs/2303.00236",
    "authors": [
      "Jing Li",
      "Jinpeng Yu",
      "Ruoyu Wang",
      "Zhengxin Li",
      "Zhengyu Zhang",
      "Lina Cao",
      "Shenghua Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00244",
    "title": "SUNY: A Visual Interpretation Framework for Convolutional Neural  Networks from a Necessary and Sufficient Perspective",
    "abstract": "Researchers have proposed various methods for visually interpreting the Convolutional Neural Network (CNN) via saliency maps, which include Class-Activation-Map (CAM) based approaches as a leading family. However, in terms of the internal design logic, existing CAM-based approaches often overlook the causal perspective that answers the core \"why\" question to help humans understand the explanation. Additionally, current CNN explanations lack the consideration of both necessity and sufficiency, two complementary sides of a desirable explanation. This paper presents a causality-driven framework, SUNY, designed to rationalize the explanations toward better human understanding. Using the CNN model's input features or internal filters as hypothetical causes, SUNY generates explanations by bi-directional quantifications on both the necessary and sufficient perspectives. Extensive evaluations justify that SUNY not only produces more informative and convincing explanations from the angles of necessity and sufficiency, but also achieves performances competitive to other approaches across different CNN architectures over large-scale datasets, including ILSVRC2012 and CUB-200-2011. ",
    "url": "https://arxiv.org/abs/2303.00244",
    "authors": [
      "Xiwei Xuan",
      "Ziquan Deng",
      "Hsuan-Tien Lin",
      "Zhaodan Kong",
      "Kwan-Liu Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.00246",
    "title": "ISBNet: a 3D Point Cloud Instance Segmentation Network with  Instance-aware Sampling and Box-aware Dynamic Convolution",
    "abstract": "Existing 3D instance segmentation methods are predominated by the bottom-up design -- manually fine-tuned algorithm to group points into clusters followed by a refinement network. However, by relying on the quality of the clusters, these methods generate susceptible results when (1) nearby objects with the same semantic class are packed together, or (2) large objects with loosely connected regions. To address these limitations, we introduce ISBNet, a novel cluster-free method that represents instances as kernels and decodes instance masks via dynamic convolution. To efficiently generate high-recall and discriminative kernels, we propose a simple strategy named Instance-aware Farthest Point Sampling to sample candidates and leverage the local aggregation layer inspired by PointNet++ to encode candidate features. Moreover, we show that predicting and leveraging the 3D axis-aligned bounding boxes in the dynamic convolution further boosts performance. Our method set new state-of-the-art results on ScanNetV2 (55.9), S3DIS (60.8), and STPLS3D (49.2) in terms of AP and retains fast inference time (237ms per scene on ScanNetV2). ",
    "url": "https://arxiv.org/abs/2303.00246",
    "authors": [
      "Tuan Duc Ngo",
      "Binh-Son Hua",
      "Khoi Nguyen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00250",
    "title": "Combating Exacerbated Heterogeneity for Robust Models in Federated  Learning",
    "abstract": "Privacy and security concerns in real-world applications have led to the development of adversarially robust federated models. However, the straightforward combination between adversarial training and federated learning in one framework can lead to the undesired robustness deterioration. We discover that the attribution behind this phenomenon is that the generated adversarial data could exacerbate the data heterogeneity among local clients, making the wrapped federated learning perform poorly. To deal with this problem, we propose a novel framework called Slack Federated Adversarial Training (SFAT), assigning the client-wise slack during aggregation to combat the intensified heterogeneity. Theoretically, we analyze the convergence of the proposed method to properly relax the objective when combining federated learning and adversarial training. Experimentally, we verify the rationality and effectiveness of SFAT on various benchmarked and real-world datasets with different adversarial training and federated optimization methods. The code is publicly available at https://github.com/ZFancy/SFAT. ",
    "url": "https://arxiv.org/abs/2303.00250",
    "authors": [
      "Jianing Zhu",
      "Jiangchao Yao",
      "Tongliang Liu",
      "Quanming Yao",
      "Jianliang Xu",
      "Bo Han"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00260",
    "title": "Addressing DAO Insider Attacks in IPv6-Based Low-Power and Lossy  Networks",
    "abstract": "Low-Power and Lossy Networks (LLNs) run on resource-constrained devices and play a key role in many Industrial Internet of Things and Cyber-Physical Systems based applications. But, achieving an energy-efficient routing in LLNs is a major challenge nowadays. This challenge is addressed by Routing Protocol for Low-power Lossy Networks (RPL), which is specified in RFC 6550 as a \"Proposed Standard\" at present. In RPL, a client node uses Destination Advertisement Object (DAO) control messages to pass on the destination information towards the root node. An attacker may exploit the DAO sending mechanism of RPL to perform a DAO Insider attack in LLNs. In this paper, it is shown that an aggressive attacker can drastically degrade the network performance. To address DAO Insider attack, a lightweight defense solution is proposed. The proposed solution uses an early blacklisting strategy to significantly mitigate the attack and restore RPL performance. The proposed solution is implemented and tested on Cooja Simulator. ",
    "url": "https://arxiv.org/abs/2303.00260",
    "authors": [
      "Sachin Kumar Verma",
      "Abhishek Verma",
      "Avinash Chandra Pandey"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2303.00261",
    "title": "Speeding Up EfficientNet: Selecting Update Blocks of Convolutional  Neural Networks using Genetic Algorithm in Transfer Learning",
    "abstract": "The performance of convolutional neural networks (CNN) depends heavily on their architectures. Transfer learning performance of a CNN relies quite strongly on selection of its trainable layers. Selecting the most effective update layers for a certain target dataset often requires expert knowledge on CNN architecture which many practitioners do not posses. General users prefer to use an available architecture (e.g. GoogleNet, ResNet, EfficientNet etc.) that is developed by domain experts. With the ever-growing number of layers, it is increasingly becoming quite difficult and cumbersome to handpick the update layers. Therefore, in this paper we explore the application of genetic algorithm to mitigate this problem. The convolutional layers of popular pretrained networks are often grouped into modules that constitute their building blocks. We devise a genetic algorithm to select blocks of layers for updating the parameters. By experimenting with EfficientNetB0 pre-trained on ImageNet and using Food-101, CIFAR-100 and MangoLeafBD as target datasets, we show that our algorithm yields similar or better results than the baseline in terms of accuracy, and requires lower training and evaluation time due to learning less number of parameters. We also devise a metric called block importance to measure efficacy of each block as update block and analyze the importance of the blocks selected by our algorithm. ",
    "url": "https://arxiv.org/abs/2303.00261",
    "authors": [
      "Md. Mehedi Hasana",
      "Muhammad Ibrahim",
      "Md. Sawkat Ali"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00265",
    "title": "Security of RPL Based 6LoWPAN Networks in the Internet of Things: A  Review",
    "abstract": "Internet of Things (IoT) is one of the fastest emerging networking paradigms enabling a large number of applications for the benefit of mankind. Advancements in embedded system technology and compressed IPv6 have enabled the support of IP stack in resource constrained heterogeneous smart devices. However, global connectivity and resource constrained characteristics of smart devices have exposed them to different insider and outsider attacks, which put users' security and privacy at risk. Various risks associated with IoT slow down its growth and become an obstruction in the worldwide adoption of its applications. In RFC 6550, the IPv6 Routing Protocol for Low Power and Lossy Network (RPL) is specified by IETF's ROLL working group for facilitating efficient routing in 6LoWPAN networks, while considering its limitations. Due to resource constrained nature of nodes in the IoT, RPL is vulnerable to many attacks that consume the node's resources and degrade the network's performance. In this paper, we present a study on various attacks and their existing defense solutions, particularly to RPL. Open research issues, challenges, and future directions specific to RPL security are also discussed. A taxonomy of RPL attacks, considering the essential attributes like resources, topology, and traffic, is shown for better understanding. In addition, a study of existing cross-layered and RPL specific network layer based defense solutions suggested in the literature is also carried out. ",
    "url": "https://arxiv.org/abs/2303.00265",
    "authors": [
      "Abhishek Verma",
      "Virender Ranga"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2303.00273",
    "title": "The impact of copycat attack on RPL based 6LoWPAN networks in Internet  of Things",
    "abstract": "IPv6 Routing Protocol for Low-Power and Lossy Networks (RPL) is the standard network layer protocol for achieving efficient routing in IPv6 over Low-Power Wireless Personal Area Networks (6LoWPAN). Resource-constrained and non-tamper resistant nature of smart sensor nodes makes RPL protocol susceptible to different threats. An attacker may use insider or outsider attack strategy to perform Denial-of-Service (DoS) attacks against RPL based networks. Security and Privacy risks associated with RPL protocol may limit its global adoption and worldwide acceptance. A proper investigation of RPL specific attacks and their impacts on an underlying network needs to be done. In this paper, we present and investigate one of the catastrophic attacks named as a copycat attack, a type of replay based DoS attack against the RPL protocol. An in-depth experimental study for analyzing the impacts of the copycat attack on RPL has been done. The experimental results show that the copycat attack can significantly degrade network performance in terms of packet delivery ratio, average end-to-end delay, and average power consumption. To the best of our knowledge, this is the first paper that extensively studies the impact of RPL specific replay mechanism based DoS attack on 6LoWPAN networks. ",
    "url": "https://arxiv.org/abs/2303.00273",
    "authors": [
      "Abhishek Verma",
      "Virender Ranga"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2303.00276",
    "title": "Entire Space Learning Framework: Unbias Conversion Rate Prediction in  Full Stages of Recommender System",
    "abstract": "Recommender system is an essential part of online services, especially for e-commerce platform. Conversion Rate (CVR) prediction in RS plays a significant role in optimizing Gross Merchandise Volume (GMV) goal of e-commerce. However, CVR suffers from well-known Sample Selection Bias (SSB) and Data Sparsity (DS) problems. Although existing methods ESMM and ESM2 train with all impression samples over the entire space by modeling user behavior paths, SSB and DS problems still exist. In real practice, the online inference space are samples from previous stage of RS process, rather than the impression space modeled by existing methods. Moreover, existing methods solve the DS problem mainly by building behavior paths of their own specific scene, ignoring the behaviors in various scenes of e-commerce platform. In this paper, we propose Entire Space Learning Framework: Unbias Conversion Rate Prediction in Full Stages of Recommender System, solving SSB and DS problems by reformulating GMV goal in a novel manner. Specifically, we rebuild the CVR on the entire data space with samples from previous stage of RS process, unifying training and online inference space. Moreover, we explicitly introduce purchase samples from other scenes of e-commerce platform in model learning process. Online A/B test and offline experiments show the superiority of our framework. Our framework has been deployed in rank stage of Taobao recommendation, providing recommendation service for hundreds of millions of consumers everyday. ",
    "url": "https://arxiv.org/abs/2303.00276",
    "authors": [
      "Shanshan Lyu",
      "Qiwei Chen",
      "Tao Zhuang",
      "Junfeng Ge"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2303.00280",
    "title": "Label Attention Network for sequential multi-label classification",
    "abstract": "Multi-label classification is a natural problem statement for sequential data. We might be interested in the items of the next order by a customer, or types of financial transactions that will occur tomorrow. Most modern approaches focus on transformer architecture for multi-label classification, introducing self-attention for the elements of a sequence with each element being a multi-label vector and supplementary information. However, in this way we loose local information related to interconnections between particular labels. We propose instead to use a self-attention mechanism over labels preceding the predicted step. Conducted experiments suggest that such architecture improves the model performance and provides meaningful attention between labels. The metric such as micro-AUC of our label attention network is $0.9847$ compared to $0.7390$ for vanilla transformers benchmark. ",
    "url": "https://arxiv.org/abs/2303.00280",
    "authors": [
      "Elizaveta Kovtun",
      "Galina Boeva",
      "Artem Zabolotnyi",
      "Evgeny Burnaev",
      "Martin Spindler",
      "Alexey Zaytsev"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00284",
    "title": "To Make Yourself Invisible with Adversarial Semantic Contours",
    "abstract": "Modern object detectors are vulnerable to adversarial examples, which may bring risks to real-world applications. The sparse attack is an important task which, compared with the popular adversarial perturbation on the whole image, needs to select the potential pixels that is generally regularized by an $\\ell_0$-norm constraint, and simultaneously optimize the corresponding texture. The non-differentiability of $\\ell_0$ norm brings challenges and many works on attacking object detection adopted manually-designed patterns to address them, which are meaningless and independent of objects, and therefore lead to relatively poor attack performance. In this paper, we propose Adversarial Semantic Contour (ASC), an MAP estimate of a Bayesian formulation of sparse attack with a deceived prior of object contour. The object contour prior effectively reduces the search space of pixel selection and improves the attack by introducing more semantic bias. Extensive experiments demonstrate that ASC can corrupt the prediction of 9 modern detectors with different architectures (\\e.g., one-stage, two-stage and Transformer) by modifying fewer than 5\\% of the pixels of the object area in COCO in white-box scenario and around 10\\% of those in black-box scenario. We further extend the attack to datasets for autonomous driving systems to verify the effectiveness. We conclude with cautions about contour being the common weakness of object detectors with various architecture and the care needed in applying them in safety-sensitive scenarios. ",
    "url": "https://arxiv.org/abs/2303.00284",
    "authors": [
      "Yichi Zhang",
      "Zijian Zhu",
      "Hang Su",
      "Jun Zhu",
      "Shibao Zheng",
      "Yuan He",
      "Hui Xue"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00286",
    "title": "Enhancing Knowledge Graph Embedding Models with Semantic-driven Loss  Functions",
    "abstract": "Knowledge graph embedding models (KGEMs) are used for various tasks related to knowledge graphs (KGs), including link prediction. They are trained with loss functions that are computed considering a batch of scored triples and their corresponding labels. Traditional approaches consider the label of a triple to be either true or false. However, recent works suggest that all negative triples should not be valued equally. In line with this commonly adopted assumption, we posit that semantically valid negative triples might be high-quality negative triples. As such, loss functions should treat them differently from semantically invalid negative ones. To this aim, we propose semantic-driven versions for the three mostly used loss functions for link prediction. In particular, we treat the scores of negative triples differently by injecting background knowledge about relation domains and ranges into the loss functions. In an extensive and controlled experimental setting, we show that the proposed loss functions systematically provide satisfying results on three public benchmark KGs underpinned with different schemas, which demonstrates both the generality and superiority of our proposed approach. In fact, the proposed loss functions do not only lead to better MRR and Hits@10 values, but also drive KGEMs towards better semantic awareness. This highlights that semantic information globally improves KGEMs, and thus should be incorporated into loss functions whenever such information is available. ",
    "url": "https://arxiv.org/abs/2303.00286",
    "authors": [
      "Nicolas Hubert",
      "Pierre Monnin",
      "Armelle Brun",
      "Davy Monticolo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.00289",
    "title": "StrucTexTv2: Masked Visual-Textual Prediction for Document Image  Pre-training",
    "abstract": "In this paper, we present StrucTexTv2, an effective document image pre-training framework, by performing masked visual-textual prediction. It consists of two self-supervised pre-training tasks: masked image modeling and masked language modeling, based on text region-level image masking. The proposed method randomly masks some image regions according to the bounding box coordinates of text words. The objectives of our pre-training tasks are reconstructing the pixels of masked image regions and the corresponding masked tokens simultaneously. Hence the pre-trained encoder can capture more textual semantics in comparison to the masked image modeling that usually predicts the masked image patches. Compared to the masked multi-modal modeling methods for document image understanding that rely on both the image and text modalities, StrucTexTv2 models image-only input and potentially deals with more application scenarios free from OCR pre-processing. Extensive experiments on mainstream benchmarks of document image understanding demonstrate the effectiveness of StrucTexTv2. It achieves competitive or even new state-of-the-art performance in various downstream tasks such as image classification, layout analysis, table structure recognition, document OCR, and information extraction under the end-to-end scenario. ",
    "url": "https://arxiv.org/abs/2303.00289",
    "authors": [
      "Yuechen Yu",
      "Yulin Li",
      "Chengquan Zhang",
      "Xiaoqiang Zhang",
      "Zengyuan Guo",
      "Xiameng Qin",
      "Kun Yao",
      "Junyu Han",
      "Errui Ding",
      "Jingdong Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00293",
    "title": "How Robust is GPT-3.5 to Predecessors? A Comprehensive Study on Language  Understanding Tasks",
    "abstract": "The GPT-3.5 models have demonstrated impressive performance in various Natural Language Processing (NLP) tasks, showcasing their strong understanding and reasoning capabilities. However, their robustness and abilities to handle various complexities of the open world have yet to be explored, which is especially crucial in assessing the stability of models and is a key aspect of trustworthy AI. In this study, we perform a comprehensive experimental analysis of GPT-3.5, exploring its robustness using 21 datasets (about 116K test samples) with 66 text transformations from TextFlint that cover 9 popular Natural Language Understanding (NLU) tasks. Our findings indicate that while GPT-3.5 outperforms existing fine-tuned models on some tasks, it still encounters significant robustness degradation, such as its average performance dropping by up to 35.74\\% and 43.59\\% in natural language inference and sentiment analysis tasks, respectively. We also show that GPT-3.5 faces some specific robustness challenges, including robustness instability, prompt sensitivity, and number sensitivity. These insights are valuable for understanding its limitations and guiding future research in addressing these challenges to enhance GPT-3.5's overall performance and generalization abilities. ",
    "url": "https://arxiv.org/abs/2303.00293",
    "authors": [
      "Xuanting Chen",
      "Junjie Ye",
      "Can Zu",
      "Nuo Xu",
      "Rui Zheng",
      "Minlong Peng",
      "Jie Zhou",
      "Tao Gui",
      "Qi Zhang",
      "Xuanjing Huang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2303.00295",
    "title": "Region Prediction for Efficient Robot Localization on Large Maps",
    "abstract": "Recognizing already explored places (a.k.a. place recognition) is a fundamental task in Simultaneous Localization and Mapping (SLAM) to enable robot relocalization and loop closure detection. In topological SLAM the recognition takes place by comparing a signature (or feature vector) associated to the current node with the signatures of the nodes in the known map. However, as the number of nodes increases, matching the current node signature against all the existing ones becomes inefficient and thwarts real-time navigation. In this paper we propose a novel approach to pre-select a subset of map nodes for place recognition. The map nodes are clustered during exploration and each cluster is associated with a region. The region labels become the prediction targets of a deep neural network and, during navigation, only the nodes associated with the regions predicted with high probability are considered for matching. While the proposed technique can be integrated in different SLAM approaches, in this work we describe an effective integration with RTAB-Map (a popular framework for real-time topological SLAM) which allowed us to design and run several experiments to demonstrate its effectiveness. All the code and material from the experiments will be available online at https://github.com/MI-BioLab/region-learner. ",
    "url": "https://arxiv.org/abs/2303.00295",
    "authors": [
      "Matteo Scucchia",
      "Davide Maltoni"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00300",
    "title": "BiSVP: Building Footprint Extraction via Bidirectional Serialized Vertex  Prediction",
    "abstract": "Extracting building footprints from remote sensing images has been attracting extensive attention recently. Dominant approaches address this challenging problem by generating vectorized building masks with cumbersome refinement stages, which limits the application of such methods. In this paper, we introduce a new refinement-free and end-to-end building footprint extraction method, which is conceptually intuitive, simple, and effective. Our method, termed as BiSVP, represents a building instance with ordered vertices and formulates the building footprint extraction as predicting the serialized vertices directly in a bidirectional fashion. Moreover, we propose a cross-scale feature fusion (CSFF) module to facilitate high resolution and rich semantic feature learning, which is essential for the dense building vertex prediction task. Without bells and whistles, our BiSVP outperforms state-of-the-art methods by considerable margins on three building instance segmentation benchmarks, clearly demonstrating its superiority. The code and datasets will be made public available. ",
    "url": "https://arxiv.org/abs/2303.00300",
    "authors": [
      "Mingming Zhang",
      "Ye Du",
      "Zhenghui Hu",
      "Qingjie Liu",
      "Yunhong Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00304",
    "title": "Renderable Neural Radiance Map for Visual Navigation",
    "abstract": "We propose a novel type of map for visual navigation, a renderable neural radiance map (RNR-Map), which is designed to contain the overall visual information of a 3D environment. The RNR-Map has a grid form and consists of latent codes at each pixel. These latent codes are embedded from image observations, and can be converted to the neural radiance field which enables image rendering given a camera pose. The recorded latent codes implicitly contain visual information about the environment, which makes the RNR-Map visually descriptive. This visual information in RNR-Map can be a useful guideline for visual localization and navigation. We develop localization and navigation frameworks that can effectively utilize the RNR-Map. We evaluate the proposed frameworks on camera tracking, visual localization, and image-goal navigation. Experimental results show that the RNR-Map-based localization framework can find the target location based on a single query image with fast speed and competitive accuracy compared to other baselines. Also, this localization framework is robust to environmental changes, and even finds the most visually similar places when a query image from a different environment is given. The proposed navigation framework outperforms the existing image-goal navigation methods in difficult scenarios, under odometry and actuation noises. The navigation framework shows 65.7% success rate in curved scenarios of the NRNS dataset, which is an improvement of 18.6% over the current state-of-the-art. ",
    "url": "https://arxiv.org/abs/2303.00304",
    "authors": [
      "Obin Kwon",
      "Jeongho Park",
      "Songhwai Oh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2303.00308",
    "title": "Event Fusion Photometric Stereo Network",
    "abstract": "We introduce a novel method to estimate surface normal of an object in an ambient light environment using RGB and event cameras. Modern photometric stereo methods rely on RGB cameras in a darkroom to avoid ambient illumination. To alleviate the limitations of using an RGB camera in a darkroom setting, we utilize an event camera with high dynamic range and low latency by capturing essential light information. This is the first study to use event cameras for photometric stereo in continuous light sources and ambient light environments. Additionally, we curate a new photometric stereo dataset captured by RGB and event cameras under various ambient lights. Our proposed framework, Event Fusion Photometric Stereo Network (EFPS-Net), estimates surface normals using RGB frames and event signals. EFPS-Net outperforms state-of-the-art methods on a real-world dataset with ambient lights, demonstrating the effectiveness of incorporating additional modalities to alleviate limitations caused by ambient illumination. ",
    "url": "https://arxiv.org/abs/2303.00308",
    "authors": [
      "Wonjeong Ryoo",
      "Giljoo Nam",
      "Jae-Sang Hyun",
      "Sangpil Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00320",
    "title": "TimeMAE: Self-Supervised Representations of Time Series with Decoupled  Masked Autoencoders",
    "abstract": "Enhancing the expressive capacity of deep learning-based time series models with self-supervised pre-training has become ever-increasingly prevalent in time series classification. Even though numerous efforts have been devoted to developing self-supervised models for time series data, we argue that the current methods are not sufficient to learn optimal time series representations due to solely unidirectional encoding over sparse point-wise input units. In this work, we propose TimeMAE, a novel self-supervised paradigm for learning transferrable time series representations based on transformer networks. The distinct characteristics of the TimeMAE lie in processing each time series into a sequence of non-overlapping sub-series via window-slicing partitioning, followed by random masking strategies over the semantic units of localized sub-series. Such a simple yet effective setting can help us achieve the goal of killing three birds with one stone, i.e., (1) learning enriched contextual representations of time series with a bidirectional encoding scheme; (2) increasing the information density of basic semantic units; (3) efficiently encoding representations of time series using transformer networks. Nevertheless, it is a non-trivial to perform reconstructing task over such a novel formulated modeling paradigm. To solve the discrepancy issue incurred by newly injected masked embeddings, we design a decoupled autoencoder architecture, which learns the representations of visible (unmasked) positions and masked ones with two different encoder modules, respectively. Furthermore, we construct two types of informative targets to accomplish the corresponding pretext tasks. One is to create a tokenizer module that assigns a codeword to each masked region, allowing the masked codeword classification (MCC) task to be completed effectively... ",
    "url": "https://arxiv.org/abs/2303.00320",
    "authors": [
      "Mingyue Cheng",
      "Qi Liu",
      "Zhiding Liu",
      "Hao Zhang",
      "Rujiao Zhang",
      "Enhong Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00326",
    "title": "Empowering Networks With Scale and Rotation Equivariance Using A  Similarity Convolution",
    "abstract": "The translational equivariant nature of Convolutional Neural Networks (CNNs) is a reason for its great success in computer vision. However, networks do not enjoy more general equivariance properties such as rotation or scaling, ultimately limiting their generalization performance. To address this limitation, we devise a method that endows CNNs with simultaneous equivariance with respect to translation, rotation, and scaling. Our approach defines a convolution-like operation and ensures equivariance based on our proposed scalable Fourier-Argand representation. The method maintains similar efficiency as a traditional network and hardly introduces any additional learnable parameters, since it does not face the computational issue that often occurs in group-convolution operators. We validate the efficacy of our approach in the image classification task, demonstrating its robustness and the generalization ability to both scaled and rotated inputs. ",
    "url": "https://arxiv.org/abs/2303.00326",
    "authors": [
      "Zikai Sun",
      "Thierry Blu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00328",
    "title": "The Total Matching Polytope of Complete Bipartite Graphs",
    "abstract": "The total matching polytope generalizes the stable set polytope and the matching polytope. In this paper, we first propose new facet-defining inequalities for the total matching polytope. We then give an exponential-sized, non-redundant description in the original space and a compact description in an extended space of the total matching polytope of complete bipartite graphs. ",
    "url": "https://arxiv.org/abs/2303.00328",
    "authors": [
      "Yuri Faenza",
      "Luca Ferrarini"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2303.00332",
    "title": "CAM++: A Fast and Efficient Network For Speaker Verification Using  Context-Aware Masking",
    "abstract": "Time delay neural network (TDNN) has been proven to be efficient in learning discriminative speaker embeddings. One of its successful variant, ECAPA-TDNN, achieved state-of-the-art performance on speaker verification tasks at the cost of much higher computational complexity and slower inference speed. This makes it inadequate for scenarios with demanding inference rate and limited computational resources. We are thus interested in finding an architecture that can achieve the performance of ECAPA-TDNN and the efficiency of vanilla TDNN. In this paper, we propose an efficient network based on context-aware masking, namely CAM++, which uses densely connected time delay neural network (D-TDNN) as backbone and adopts a novel multi-granularity pooling to capture contextual information at different levels. Extensive experiments on two public benchmarks, VoxCeleb and CN-Celeb, demonstrate that the proposed architecture outperforms other mainstream speaker verification systems with lower computational cost and faster inference speed. ",
    "url": "https://arxiv.org/abs/2303.00332",
    "authors": [
      "Hui Wang",
      "Siqi Zheng",
      "Yafeng Chen",
      "Luyao Cheng",
      "Qian Chen"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2303.00344",
    "title": "Inline Citation Classification using Peripheral Context and  Time-evolving Augmentation",
    "abstract": "Citation plays a pivotal role in determining the associations among research articles. It portrays essential information in indicative, supportive, or contrastive studies. The task of inline citation classification aids in extrapolating these relationships; However, existing studies are still immature and demand further scrutiny. Current datasets and methods used for inline citation classification only use citation-marked sentences constraining the model to turn a blind eye to domain knowledge and neighboring contextual sentences. In this paper, we propose a new dataset, named 3Cext, which along with the cited sentences, provides discourse information using the vicinal sentences to analyze the contrasting and entailing relationships as well as domain information. We propose PeriCite, a Transformer-based deep neural network that fuses peripheral sentences and domain knowledge. Our model achieves the state-of-the-art on the 3Cext dataset by +0.09 F1 against the best baseline. We conduct extensive ablations to analyze the efficacy of the proposed dataset and model fusion methods. ",
    "url": "https://arxiv.org/abs/2303.00344",
    "authors": [
      "Priyanshi Gupta",
      "Yash Kumar Atri",
      "Apurva Nagvenkar",
      "Sourish Dasgupta",
      "Tanmoy Chakraborty"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2303.00355",
    "title": "Progressive Scale-aware Network for Remote sensing Image Change  Captioning",
    "abstract": "Remote sensing (RS) images contain numerous objects of different scales, which poses significant challenges for the RS image change captioning (RSICC) task to identify visual changes of interest in complex scenes and describe them via language. However, current methods still have some weaknesses in sufficiently extracting and utilizing multi-scale information. In this paper, we propose a progressive scale-aware network (PSNet) to address the problem. PSNet is a pure Transformer-based model. To sufficiently extract multi-scale visual features, multiple progressive difference perception (PDP) layers are stacked to progressively exploit the differencing features of bitemporal features. To sufficiently utilize the extracted multi-scale features for captioning, we propose a scale-aware reinforcement (SR) module and combine it with the Transformer decoding layer to progressively utilize the features from different PDP layers. Experiments show that the PDP layer and SR module are effective and our PSNet outperforms previous methods. ",
    "url": "https://arxiv.org/abs/2303.00355",
    "authors": [
      "Chenyang Liu",
      "Jiajun Yang",
      "Zipeng Qi",
      "Zhengxia Zou",
      "Zhenwei Shi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00364",
    "title": "Lessons Learned Report: Super-Resolution for Detection Tasks in  Engineering Problem-Solving",
    "abstract": "We describe the lessons learned from targeting agricultural detection problem-solving, when subject to low resolution input maps, by means of Machine Learning-based super-resolution approaches. The underlying domain is the so-called agro-detection class of problems, and the specific objective is to learn a complementary ensemble of sporadic input maps. While super-resolution algorithms are branded with the capacity to enhance various attractive features in generic photography, we argue that they must meet certain requirements, and more importantly, that their outcome does not necessarily guarantee an improvement in engineering detection problem-solving (unlike so-called aesthetics/artistic super-resolution in ImageNet-like datasets). By presenting specific data-driven case studies, we outline a set of limitations and recommendations for deploying super-resolution algorithms for agro-detection problems. Another conclusion states that super-resolution algorithms can be used for learning missing spectral channels, and that their usage may result in some desired side-effects such as channels' synchronization. ",
    "url": "https://arxiv.org/abs/2303.00364",
    "authors": [
      "Martin Feder",
      "Michal Horovitz",
      "Assaf Chen",
      "Raphael Linker",
      "Ofer M. Shir"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00387",
    "title": "DOLOS: A Novel Architecture for Moving Target Defense",
    "abstract": "Moving Target Defense and Cyber Deception emerged in recent years as two key proactive cyber defense approaches, contrasting with the static nature of the traditional reactive cyber defense. The key insight behind these approaches is to impose an asymmetric disadvantage for the attacker by using deception and randomization techniques to create a dynamic attack surface. Moving Target Defense typically relies on system randomization and diversification, while Cyber Deception is based on decoy nodes and fake systems to deceive attackers. However, current Moving Target Defense techniques are complex to manage and can introduce high overheads, while Cyber Deception nodes are easily recognized and avoided by adversaries. This paper presents DOLOS, a novel architecture that unifies Cyber Deception and Moving Target Defense approaches. DOLOS is motivated by the insight that deceptive techniques are much more powerful when integrated into production systems rather than deployed alongside them. DOLOS combines typical Moving Target Defense techniques, such as randomization, diversity, and redundancy, with cyber deception and seamlessly integrates them into production systems through multiple layers of isolation. We extensively evaluate DOLOS against a wide range of attackers, ranging from automated malware to professional penetration testers, and show that DOLOS is highly effective in slowing down attacks and protecting the integrity of production systems. We also provide valuable insights and considerations for the future development of MTD techniques based on our findings. ",
    "url": "https://arxiv.org/abs/2303.00387",
    "authors": [
      "Giulio Pagnotta",
      "Fabio De Gaspari",
      "Dorjan Hitaj",
      "Mauro Andreolini",
      "Michele Colajanni",
      "Luigi V. Mancini"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2303.00391",
    "title": "Grid-Forming Control Based On Emulated Synchronous Condenser Strategy  Compliant With Challenging Grid Code Requirements",
    "abstract": "Future power systems will include high shares of inverter-based generation. There is a general consensus that for allowing this transition, the Grid-Forming (GFo) control approach would be of great value. This article presents a GFo control strategy which is based on the concept of an Emulated Synchronous Condenser in parallel with a controlled current source with an explicit representation of the swing equation. The advantage of this control is that it can cope with challenging grid code requirements such as severe phase jumps, balanced and unbalanced Fault Ride-Through (FRT), main grid disconnection and black start. All these scenarios can be surpassed with a single control structure with no further logic involved (e.g. fault detection to turn on or off different control parts, freezes, etc.). The proposed strategy is evaluated via time-domain simulations of a 2-MW Battery Energy Storage System (BESS). ",
    "url": "https://arxiv.org/abs/2303.00391",
    "authors": [
      "Julian Freytes",
      "Antoine Rossé",
      "Valentin Costan",
      "Grégoire Prime"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2303.00403",
    "title": "Can representation learning for multimodal image registration be  improved by supervision of intermediate layers?",
    "abstract": "Multimodal imaging and correlative analysis typically require image alignment. Contrastive learning can generate representations of multimodal images, reducing the challenging task of multimodal image registration to a monomodal one. Previously, additional supervision on intermediate layers in contrastive learning has improved biomedical image classification. We evaluate if a similar approach improves representations learned for registration to boost registration performance. We explore three approaches to add contrastive supervision to the latent features of the bottleneck layer in the U-Nets encoding the multimodal images and evaluate three different critic functions. Our results show that representations learned without additional supervision on latent features perform best in the downstream task of registration on two public biomedical datasets. We investigate the performance drop by exploiting recent insights in contrastive learning in classification and self-supervised learning. We visualize the spatial relations of the learned representations by means of multidimensional scaling, and show that additional supervision on the bottleneck layer can lead to partial dimensional collapse of the intermediate embedding space. ",
    "url": "https://arxiv.org/abs/2303.00403",
    "authors": [
      "Elisabeth Wetzer",
      "Joakim Lindblad",
      "Nataša Sladoje"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00404",
    "title": "Distilled Reverse Attention Network for Open-world Compositional  Zero-Shot Learning",
    "abstract": "Open-World Compositional Zero-Shot Learning (OW-CZSL) aims to recognize new compositions of seen attributes and objects. In OW-CZSL, methods built on the conventional closed-world setting degrade severely due to the unconstrained OW test space. While previous works alleviate the issue by pruning compositions according to external knowledge or correlations in seen pairs, they introduce biases that harm the generalization. Some methods thus predict state and object with independently constructed and trained classifiers, ignoring that attributes are highly context-dependent and visually entangled with objects. In this paper, we propose a novel Distilled Reverse Attention Network to address the challenges. We also model attributes and objects separately but with different motivations, capturing contextuality and locality, respectively. We further design a reverse-and-distill strategy that learns disentangled representations of elementary components in training data supervised by reverse attention and knowledge distillation. We conduct experiments on three datasets and consistently achieve state-of-the-art (SOTA) performance. ",
    "url": "https://arxiv.org/abs/2303.00404",
    "authors": [
      "Yun Li",
      "Zhe Liu",
      "Saurav Jha",
      "Sally Cripps",
      "Lina Yao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00408",
    "title": "A Persian Benchmark for Joint Intent Detection and Slot Filling",
    "abstract": "Natural Language Understanding (NLU) is important in today's technology as it enables machines to comprehend and process human language, leading to improved human-computer interactions and advancements in fields such as virtual assistants, chatbots, and language-based AI systems. This paper highlights the significance of advancing the field of NLU for low-resource languages. With intent detection and slot filling being crucial tasks in NLU, the widely used datasets ATIS and SNIPS have been utilized in the past. However, these datasets only cater to the English language and do not support other languages. In this work, we aim to address this gap by creating a Persian benchmark for joint intent detection and slot filling based on the ATIS dataset. To evaluate the effectiveness of our benchmark, we employ state-of-the-art methods for intent detection and slot filling. ",
    "url": "https://arxiv.org/abs/2303.00408",
    "authors": [
      "Masoud Akbari",
      "Amir Hossein Karimi",
      "Tayyebeh Saeedi",
      "Zeinab Saeidi",
      "Kiana Ghezelbash",
      "Fatemeh Shamsezat",
      "Mohammad Akbari",
      "Ali Mohades"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2303.00409",
    "title": "RePAD2: Real-Time, Lightweight, and Adaptive Anomaly Detection for  Open-Ended Time Series",
    "abstract": "An open-ended time series refers to a series of data points indexed in time order without an end. Such a time series can be found everywhere due to the prevalence of Internet of Things. Providing lightweight and real-time anomaly detection for open-ended time series is highly desirable to industry and organizations since it allows immediate response and avoids potential financial loss. In the last few years, several real-time time series anomaly detection approaches have been introduced. However, they might exhaust system resources when they are applied to open-ended time series for a long time. To address this issue, in this paper we propose RePAD2, a lightweight real-time anomaly detection approach for open-ended time series by improving its predecessor RePAD, which is one of the state-of-the-art anomaly detection approaches. We conducted a series of experiments to compare RePAD2 with RePAD and another similar detection approach based on real-world time series datasets, and demonstrated that RePAD2 can address the mentioned resource exhaustion issue while offering comparable detection accuracy and slightly less time consumption. ",
    "url": "https://arxiv.org/abs/2303.00409",
    "authors": [
      "Ming-Chang Lee",
      "Jia-Chun Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00421",
    "title": "Operator-difference schemes on non-uniform grids for second-order  evolutionary equations",
    "abstract": "The approximate solution of the Cauchy problem for second-order evolution equations is performed, first of all, using three-level time approximations. Such approximations are easily constructed and relatively uncomplicated to investigate when using uniform time grids. When solving applied problems numerically, we should focus on approximations with variable time steps. When using multilevel schemes on non-uniform grids, we should maintain accuracy by choosing appropriate approximations and ensuring the approximate solution's stability. In this paper, we construct unconditionally stable first- and second-order accuracy schemes on a non-uniform time grid for the approximate solution of the Cauchy problem for a second-order evolutionary equation. We use a special transformation of the original second-order differential-operator equation to a system of first-order equations. For the system of first-order equations, we apply standard two-level time approximations. We obtained stability estimates for the initial data and the right-hand side in finite-dimensional Hilbert space. Eliminating auxiliary variables leads to three-level schemes for the initial second-order evolution equation. Numerical experiments were performed for the test problem for a one-dimensional in space bi-parabolic equation. The accuracy and stability properties of the constructed schemes are demonstrated on non-uniform grids with randomly varying grid steps. ",
    "url": "https://arxiv.org/abs/2303.00421",
    "authors": [
      "P.N. Vabishchevich"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2303.00431",
    "title": "OliVaR: Improving Olive Variety Recognition using Deep Neural Networks",
    "abstract": "The easy and accurate identification of varieties is fundamental in agriculture, especially in the olive sector, where more than 1200 olive varieties are currently known worldwide. Varietal misidentification leads to many potential problems for all the actors in the sector: farmers and nursery workers may establish the wrong variety, leading to its maladaptation in the field; olive oil and table olive producers may label and sell a non-authentic product; consumers may be misled; and breeders may commit errors during targeted crossings between different varieties. To date, the standard for varietal identification and certification consists of two methods: morphological classification and genetic analysis. The morphological classification consists of the visual pairwise comparison of different organs of the olive tree, where the most important organ is considered to be the endocarp. In contrast, different methods for genetic classification exist (RAPDs, SSR, and SNP). Both classification methods present advantages and disadvantages. Visual morphological classification requires highly specialized personnel and is prone to human error. Genetic identification methods are more accurate but incur a high cost and are difficult to implement. This paper introduces OliVaR, a novel approach to olive varietal identification. OliVaR uses a teacher-student deep learning architecture to learn the defining characteristics of the endocarp of each specific olive variety and perform classification. We construct what is, to the best of our knowledge, the largest olive variety dataset to date, comprising image data for 131 varieties from the Mediterranean basin. We thoroughly test OliVaR on this dataset and show that it correctly predicts olive varieties with over 86% accuracy. ",
    "url": "https://arxiv.org/abs/2303.00431",
    "authors": [
      "Hristofor Miho",
      "Giulio Pagnotta",
      "Dorjan Hitaj",
      "Fabio De Gaspari",
      "Luigi V. Mancini",
      "Georgios Koubouris",
      "Gianluca Godino",
      "Mehmet Hakan",
      "Concepcion Muñoz Diez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00442",
    "title": "Re-weighting Based Group Fairness Regularization via Classwise Robust  Optimization",
    "abstract": "Many existing group fairness-aware training methods aim to achieve the group fairness by either re-weighting underrepresented groups based on certain rules or using weakly approximated surrogates for the fairness metrics in the objective as regularization terms. Although each of the learning schemes has its own strength in terms of applicability or performance, respectively, it is difficult for any method in the either category to be considered as a gold standard since their successful performances are typically limited to specific cases. To that end, we propose a principled method, dubbed as \\ours, which unifies the two learning schemes by incorporating a well-justified group fairness metric into the training objective using a class wise distributionally robust optimization (DRO) framework. We then develop an iterative optimization algorithm that minimizes the resulting objective by automatically producing the correct re-weights for each group. Our experiments show that FairDRO is scalable and easily adaptable to diverse applications, and consistently achieves the state-of-the-art performance on several benchmark datasets in terms of the accuracy-fairness trade-off, compared to recent strong baselines. ",
    "url": "https://arxiv.org/abs/2303.00442",
    "authors": [
      "Sangwon Jung",
      "Taeeon Park",
      "Sanghyuk Chun",
      "Taesup Moon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2303.00456",
    "title": "N-best T5: Robust ASR Error Correction using Multiple Input Hypotheses  and Constrained Decoding Space",
    "abstract": "Error correction models form an important part of Automatic Speech Recognition (ASR) post-processing to improve the readability and quality of transcriptions. Most prior works use the 1-best ASR hypothesis as input and therefore can only perform correction by leveraging the context within one sentence. In this work, we propose a novel N-best T5 model for this task, which is fine-tuned from a T5 model and utilizes ASR N-best lists as model input. By transferring knowledge from the pre-trained language model and obtaining richer information from the ASR decoding space, the proposed approach outperforms a strong Conformer-Transducer baseline. Another issue with standard error correction is that the generation process is not well-guided. To address this a constrained decoding process, either based on the N-best list or an ASR lattice, is used which allows additional information to be propagated. ",
    "url": "https://arxiv.org/abs/2303.00456",
    "authors": [
      "Rao Ma",
      "Mark J F Gales",
      "Kate Knill",
      "Mengjie Qian"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2303.00457",
    "title": "Robust Statistical Beamforming with Multi-Cluster Tracking for  Time-Varying Massive MIMO (Extended Version)",
    "abstract": "In this paper, a joint design of instantaneous channel estimation, beam tracking, and adaptive beamformer construction for a massive multiple-input multiple-output (MIMO) system is proposed. This design focuses on efficiency in terms of performance and computational complexity under the adverse effects of time variation and mobility of sources, the presence of multiuser and multipath components, or simply multi-clusters, and the near-far effect. The design is also suitable for hybrid beamforming and frequency-selective channels. In the proposed system, channel parameters are estimated in time-domain duplex (TDD) uplink mode using a per-cluster approach rather than a joint approach, which significantly reduces the complexity. Per-cluster estimation is possible thanks to the proposed interference-aware statistical beamforming method, namely reduced dimensional Generalized Eigenbeamformer (RD-GEB), which undertakes the computational load of interference mitigation and enables a simpler design for the remaining stages. In addition, the overall design is based on the separation of channel parameters as fast-time and slow-time, leaving only the instantaneous channel estimation and channel matched filtering as fast-time operations, which are handled inside cluster-specific reduced dimensional subspaces. Beam tracking and beamformer construction are held in slow-time rarely, which reduces the time-averaged complexity. Furthermore, beam tracking is performed by leveraging a batch of instantaneous channel estimates, which removes the need for an additional training process. The proposed low-complexity design is shown to outperform the conventional methods. ",
    "url": "https://arxiv.org/abs/2303.00457",
    "authors": [
      "Anil Kurt",
      "Gokhan M. Guvensen"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2303.00458",
    "title": "AR-Assisted Surgical Care via 5G networks for First Aid Responders",
    "abstract": "Surgeons should play a central role in disaster planning and management due to the overwhelming number of bodily injuries that are typically involved during most forms of disaster. In fact, various types of surgical procedures are performed by emergency medical teams after sudden-onset disasters, such as soft tissue wounds, orthopaedic traumas, abdominal surgeries, etc. HMD-based Augmented Reality (AR), using state-of-the-art hardware such as the Magic Leap or the Microsoft HoloLens, have long been foreseen as a key enabler for clinicians in surgical use cases, especially for procedures performed outside of the operating room. This paper describes the Use Case (UC) \"AR-assisted emergency surgical care\", identified in the context of the 5G-EPICENTRE EU-funded project. Specifically, the UC will experiment with holographic AR technology for emergency medical surgery teams, by overlaying deformable medical models directly on top of the patient body parts, effectively enabling surgeons to see inside (visualizing bones, blood vessels, etc.) and perform surgical actions following step-by-step instructions. The goal is to combine the computational and data-intensive nature of AR and Computer Vision algorithms with upcoming 5G network architectures deployed for edge computing so as to satisfy real-time interaction requirements and provide an efficient and powerful platform for the pervasive promotion of such applications. By developing the necessary Virtual Network Functions (VNFs) to manage data-intensive services (e.g., prerendering, caching, compression) and by exploiting available network resources and Multi-access Edge Computing (MEC) support, provided by the 5G-EPICENTRE infrastructure, this UC aims to provide powerful AR-based tools, usable on site, to first-aid responders. ",
    "url": "https://arxiv.org/abs/2303.00458",
    "authors": [
      "Manos Kamarianakis",
      "Antonis Protopsaltis",
      "George Papagiannakis"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2303.00466",
    "title": "ASP: Learn a Universal Neural Solver!",
    "abstract": "Applying machine learning to combinatorial optimization problems has the potential to improve both efficiency and accuracy. However, existing learning-based solvers often struggle with generalization when faced with changes in problem distributions and scales. In this paper, we propose a new approach called ASP: Adaptive Staircase Policy Space Response Oracle to address these generalization issues and learn a universal neural solver. ASP consists of two components: Distributional Exploration, which enhances the solver's ability to handle unknown distributions using Policy Space Response Oracles, and Persistent Scale Adaption, which improves scalability through curriculum learning. We have tested ASP on several challenging COPs, including the traveling salesman problem, the vehicle routing problem, and the prize collecting TSP, as well as the real-world instances from TSPLib and CVRPLib. Our results show that even with the same model size and weak training signal, ASP can help neural solvers explore and adapt to unseen distributions and varying scales, achieving superior performance. In particular, compared with the same neural solvers under a standard training pipeline, ASP produces a remarkable decrease in terms of the optimality gap with 90.9% and 47.43% on generated instances and real-world instances for TSP, and a decrease of 19% and 45.57% for CVRP. ",
    "url": "https://arxiv.org/abs/2303.00466",
    "authors": [
      "Chenguang Wang",
      "Zhouliang Yu",
      "Stephen McAleer",
      "Tianshu Yu",
      "Yaodong Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2303.00476",
    "title": "About Engaging and Governing Strategies: A Thematic Analysis of Dark  Patterns in Social Networking Services",
    "abstract": "Research in HCI has shown a growing interest in unethical design practices across numerous domains, often referred to as ``dark patterns''. There is, however, a gap in related literature regarding social networking services (SNSs). In this context, studies emphasise a lack of users' self-determination regarding control over personal data and time spent on SNSs. We collected over 16 hours of screen recordings from Facebook's, Instagram's, TikTok's, and Twitter's mobile applications to understand how dark patterns manifest in these SNSs. For this task, we turned towards HCI experts to mitigate possible difficulties of non-expert participants in recognising dark patterns, as prior studies have noticed. Supported by the recordings, two authors of this paper conducted a thematic analysis based on previously described taxonomies, manually classifying the recorded material while delivering two key findings: We observed which instances occur in SNSs and identified two strategies - engaging and governing - with five dark patterns undiscovered before. ",
    "url": "https://arxiv.org/abs/2303.00476",
    "authors": [
      "Thomas Mildner",
      "Gian-Luca Savino",
      "Philip R. Doyle",
      "Benjamin R. Cowan",
      "Rainer Malaka"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2303.00477",
    "title": "ORCHNet: A Robust Global Feature Aggregation approach for 3D LiDAR-based  Place recognition in Orchards",
    "abstract": "Robust and reliable place recognition and loop closure detection in agricultural environments is still an open problem. In particular, orchards are a difficult case study due to structural similarity across the entire field. In this work, we address the place recognition problem in orchards resorting to 3D LiDAR data, which is considered a key modality for robustness. Hence, we propose ORCHNet, a deep-learning-based approach that maps 3D-LiDAR scans to global descriptors. Specifically, this work proposes a new global feature aggregation approach, which fuses multiple aggregation methods into a robust global descriptor. ORCHNet is evaluated on real-world data collected in orchards, comprising data from the summer and autumn seasons. To assess the robustness, We compare ORCHNet with state-of-the-art aggregation approaches on data from the same season and across seasons. Moreover, we additionally evaluate the proposed approach as part of a localization framework, where ORCHNet is used as a loop closure detector. The empirical results indicate that, on the place recognition task, ORCHNet outperforms the remaining approaches, and is also more robust across seasons. As for the localization, the edge cases where the path goes through the trees are solved when integrating ORCHNet as a loop detector, showing the potential applicability of the proposed approach in this task. The code and dataset will be publicly available at:\\url{https://github.com/Cybonic/ORCHNet.git} ",
    "url": "https://arxiv.org/abs/2303.00477",
    "authors": [
      "T. Barros",
      "L. Garrote",
      "P. Conde",
      "M.J. Coombes",
      "C. Liu",
      "C. Premebida",
      "U.J. Nunes"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2303.00492",
    "title": "Lumos: Heterogeneity-aware Federated Graph Learning over Decentralized  Devices",
    "abstract": "Graph neural networks (GNN) have been widely deployed in real-world networked applications and systems due to their capability to handle graph-structured data. However, the growing awareness of data privacy severely challenges the traditional centralized model training paradigm, where a server holds all the graph information. Federated learning is an emerging collaborative computing paradigm that allows model training without data centralization. Existing federated GNN studies mainly focus on systems where clients hold distinctive graphs or sub-graphs. The practical node-level federated situation, where each client is only aware of its direct neighbors, has yet to be studied. In this paper, we propose the first federated GNN framework called Lumos that supports supervised and unsupervised learning with feature and degree protection on node-level federated graphs. We first design a tree constructor to improve the representation capability given the limited structural information. We further present a Monte Carlo Markov Chain-based algorithm to mitigate the workload imbalance caused by degree heterogeneity with theoretically-guaranteed performance. Based on the constructed tree for each client, a decentralized tree-based GNN trainer is proposed to support versatile training. Extensive experiments demonstrate that Lumos outperforms the baseline with significantly higher accuracy and greatly reduced communication cost and training time. ",
    "url": "https://arxiv.org/abs/2303.00492",
    "authors": [
      "Qiying Pan",
      "Yifei Zhu",
      "Lingyang Chu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2303.00498",
    "title": "Adaptive Hybrid Spatial-Temporal Graph Neural Network for Cellular  Traffic Prediction",
    "abstract": "Cellular traffic prediction is an indispensable part for intelligent telecommunication networks. Nevertheless, due to the frequent user mobility and complex network scheduling mechanisms, cellular traffic often inherits complicated spatial-temporal patterns, making the prediction incredibly challenging. Although recent advanced algorithms such as graph-based prediction approaches have been proposed, they frequently model spatial dependencies based on static or dynamic graphs and neglect the coexisting multiple spatial correlations induced by traffic generation. Meanwhile, some works lack the consideration of the diverse cellular traffic patterns, result in suboptimal prediction results. In this paper, we propose a novel deep learning network architecture, Adaptive Hybrid Spatial-Temporal Graph Neural Network (AHSTGNN), to tackle the cellular traffic prediction problem. First, we apply adaptive hybrid graph learning to learn the compound spatial correlations among cell towers. Second, we implement a Temporal Convolution Module with multi-periodic temporal data input to capture the nonlinear temporal dependencies. In addition, we introduce an extra Spatial-Temporal Adaptive Module to conquer the heterogeneity lying in cell towers. Our experiments on two real-world cellular traffic datasets show AHSTGNN outperforms the state-of-the-art by a significant margin, illustrating the superior scalability of our method for spatial-temporal cellular traffic prediction. ",
    "url": "https://arxiv.org/abs/2303.00498",
    "authors": [
      "Xing Wang",
      "Kexin Yang",
      "Zhendong Wang",
      "Junlan Feng",
      "Lin Zhu",
      "Juan Zhao",
      "Chao Deng"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00505",
    "title": "Robust consensus control of second-order uncertain multiagent systems  with velocity and input constraints (extended version)",
    "abstract": "In this paper, we investigate the consensus problem of second-order multiagent systems under directed graphs. Simple yet robust consensus algorithms that advance existing achievements in accounting for velocity and input constraints, agent uncertainties, and lack of neighboring velocity measurements are proposed. Furthermore, we show that the proposed method can be applied to the consensus control of uncertain robotic manipulators with velocity and control torque constraints. We rigorously prove that the velocity and control inputs stay within prespecified ranges by tuning design parameters a priori and that asymptotic consensus can be achieved through Lyapunov functions and fixed-time stability. Simulations are performed for symmetric and asymmetric constraints to show the efficiency of the theoretical findings. ",
    "url": "https://arxiv.org/abs/2303.00505",
    "authors": [
      "Gang Wang",
      "Zongyu Zuo",
      "Chaoli Wang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2303.00510",
    "title": "A Comparison of Speech Data Augmentation Methods Using S3PRL Toolkit",
    "abstract": "Data augmentations are known to improve robustness in speech-processing tasks. In this study, we summarize and compare different data augmentation strategies using S3PRL toolkit. We explore how HuBERT and wav2vec perform using different augmentation techniques (SpecAugment, Gaussian Noise, Speed Perturbation) for Phoneme Recognition (PR) and Automatic Speech Recognition (ASR) tasks. We evaluate model performance in terms of phoneme error rate (PER) and word error rate (WER). From the experiments, we observed that SpecAugment slightly improves the performance of HuBERT and wav2vec on the original dataset. Also, we show that models trained using the Gaussian Noise and Speed Perturbation dataset are more robust when tested with augmented test sets. ",
    "url": "https://arxiv.org/abs/2303.00510",
    "authors": [
      "Mina Huh",
      "Ruchira Ray",
      "Corey Karnei"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2303.00517",
    "title": "Analyzing Impact of Socio-Economic Factors on COVID-19 Mortality  Prediction Using SHAP Value",
    "abstract": "This paper applies multiple machine learning (ML) algorithms to a dataset of de-identified COVID-19 patients provided by the COVID-19 Research Database. The dataset consists of 20,878 COVID-positive patients, among which 9,177 patients died in the year 2020. This paper aims to understand and interpret the association of socio-economic characteristics of patients with their mortality instead of maximizing prediction accuracy. According to our analysis, a patients households annual and disposable income, age, education, and employment status significantly impacts a machine learning models prediction. We also observe several individual patient data, which gives us insight into how the feature values impact the prediction for that data point. This paper analyzes the global and local interpretation of machine learning models on socio-economic data of COVID patients. ",
    "url": "https://arxiv.org/abs/2303.00517",
    "authors": [
      "Redoan Rahman",
      "Jooyeong Kang",
      "Justin F Rousseau",
      "Ying Ding"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2303.00520",
    "title": "Valid Information Guidance Network for Compressed Video Quality  Enhancement",
    "abstract": "In recent years deep learning methods have shown great superiority in compressed video quality enhancement tasks. Existing methods generally take the raw video as the ground truth and extract practical information from consecutive frames containing various artifacts. However, they do not fully exploit the valid information of compressed and raw videos to guide the quality enhancement for compressed videos. In this paper, we propose a unique Valid Information Guidance scheme (VIG) to enhance the quality of compressed videos by mining valid information from both compressed videos and raw videos. Specifically, we propose an efficient framework, Compressed Redundancy Filtering (CRF) network, to balance speed and enhancement. After removing the redundancy by filtering the information, CRF can use the valid information of the compressed video to reconstruct the texture. Furthermore, we propose a progressive Truth Guidance Distillation (TGD) strategy, which does not need to design additional teacher models and distillation loss functions. By only using the ground truth as input to guide the model to aggregate the correct spatio-temporal correspondence across the raw frames, TGD can significantly improve the enhancement effect without increasing the extra training cost. Extensive experiments show that our method achieves the state-of-the-art performance of compressed video quality enhancement in terms of accuracy and efficiency. ",
    "url": "https://arxiv.org/abs/2303.00520",
    "authors": [
      "Xuan Sun",
      "Ziyue Zhang",
      "Guannan Chen",
      "Dan Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2303.00524",
    "title": "Semi-decentralized Inference in Heterogeneous Graph Neural Networks for  Traffic Demand Forecasting: An Edge-Computing Approach",
    "abstract": "Accurate and timely prediction of transportation demand and supply is essential for improving customer experience and raising the provider's profit. Recently, graph neural networks (GNNs) have been shown promising in predicting traffic demand and supply in small city regions. This awes their capability in modeling both a node's historical features and its relational information with other nodes. However, more efficient taxi demand and supply forecasting can still be achieved by following two main routes. First, is extending the scale of the prediction graph to include more regions. Second, is the simultaneous exploitation of multiple node and edge types to better expose and exploit the complex and diverse set of relations in a traffic system. Nevertheless, the applicability of both approaches is challenged by the scalability of system-wide GNN training and inference. An immediate remedy to the scalability challenge is to decentralize the GNN operation. However, decentralizing GNN operation creates excessive node-to-node communication overhead which hinders the potential of this approach. In this paper, we propose a semi-decentralized approach based on the use of multiple, moderately sized, and high-throughout cloudlet communication networks on the edge. This approach combines the best features of the centralized and decentralized settings; it may minimize the inter-cloudlet communication thereby alleviating the communication overhead of the decentralized approach while promoting scalability due to cloudlet-level decentralization. Also, we propose a heterogeneous GNN-LSTM algorithm for improved taxi-level demand and supply forecasting. This approach allows for handling dynamic taxi graphs where nodes are taxis. Through a set of experiments over real data, we show the advantage of the semi-decentralized approach as tested over our GNN-LSTM algorithm for taxi demand and supply prediction. ",
    "url": "https://arxiv.org/abs/2303.00524",
    "authors": [
      "Mahmoud Nazzal",
      "Abdallah Khreishah",
      "Joyoung Lee",
      "Shaahin Angizi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.00528",
    "title": "Comparing Nodes of Multivariate Graphs Through Dynamic Layout  Adaptations",
    "abstract": "Visual comparison is an important task in the analysis of multivariate graphs. However, comparison of topological features of a graph with respect to its data attributes for different portions of the data remains challenging because there is no single visual representation that would suit the dynamic nature of comparative analyses. To facilitate the visual comparison in node-link diagrams, we propose the comparison lens as a focus+context approach for dynamic layout adaptation. The core idea is to start with a topology-driven layout and locally inject an attribute-driven layout based on the multivariate similarity of node attributes. This facilitates comparison tasks on a local level while preserving the user's overall mental map of the graph topology. Additional visual enhancements, including color-coding, reduction of edge clutter, and radial guides, further support the comparison. To fit the lens to different comparison situations, it can be configured via user-controllable parameters. To demonstrate the utility of our approach, we use it for comparison in a real-world dataset of soccer players. ",
    "url": "https://arxiv.org/abs/2303.00528",
    "authors": [
      "Philip Berger",
      "Sebastian Beleites",
      "Christian Tominski"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2303.00542",
    "title": "D2Q-DETR: Decoupling and Dynamic Queries for Oriented Object Detection  with Transformers",
    "abstract": "Despite the promising results, existing oriented object detection methods usually involve heuristically designed rules, e.g., RRoI generation, rotated NMS. In this paper, we propose an end-to-end framework for oriented object detection, which simplifies the model pipeline and obtains superior performance. Our framework is based on DETR, with the box regression head replaced with a points prediction head. The learning of points is more flexible, and the distribution of points can reflect the angle and size of the target rotated box. We further propose to decouple the query features into classification and regression features, which significantly improves the model precision. Aerial images usually contain thousands of instances. To better balance model precision and efficiency, we propose a novel dynamic query design, which reduces the number of object queries in stacked decoder layers without sacrificing model performance. Finally, we rethink the label assignment strategy of existing DETR-like detectors and propose an effective label re-assignment strategy for improved performance. We name our method D2Q-DETR. Experiments on the largest and challenging DOTA-v1.0 and DOTA-v1.5 datasets show that D2Q-DETR outperforms existing NMS-based and NMS-free oriented object detection methods and achieves the new state-of-the-art. ",
    "url": "https://arxiv.org/abs/2303.00542",
    "authors": [
      "Qiang Zhou",
      "Chaohui Yu",
      "Zhibin Wang",
      "Fan Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00554",
    "title": "CausIL: Causal Graph for Instance Level Microservice Data",
    "abstract": "AI-based monitoring has become crucial for cloud-based services due to its scale. A common approach to AI-based monitoring is to detect causal relationships among service components and build a causal graph. Availability of domain information makes cloud systems even better suited for such causal detection approaches. In modern cloud systems, however, auto-scalers dynamically change the number of microservice instances, and a load-balancer manages the load on each instance. This poses a challenge for off-the-shelf causal structure detection techniques as they neither incorporate the system architectural domain information nor provide a way to model distributed compute across varying numbers of service instances. To address this, we develop CausIL, which detects a causal structure among service metrics by considering compute distributed across dynamic instances and incorporating domain knowledge derived from system architecture. Towards the application in cloud systems, CausIL estimates a causal graph using instance-specific variations in performance metrics, modeling multiple instances of a service as independent, conditional on system assumptions. Simulation study shows the efficacy of CausIL over baselines by improving graph estimation accuracy by ~25% as measured by Structural Hamming Distance whereas the real-world dataset demonstrates CausIL's applicability in deployment settings. ",
    "url": "https://arxiv.org/abs/2303.00554",
    "authors": [
      "Sarthak Chakraborty",
      "Shaddy Garg",
      "Shubham Agarwal",
      "Ayush Chauhan",
      "Shiv Kumar Saini"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2303.00565",
    "title": "AdaSAM: Boosting Sharpness-Aware Minimization with Adaptive Learning  Rate and Momentum for Training Deep Neural Networks",
    "abstract": "Sharpness aware minimization (SAM) optimizer has been extensively explored as it can generalize better for training deep neural networks via introducing extra perturbation steps to flatten the landscape of deep learning models. Integrating SAM with adaptive learning rate and momentum acceleration, dubbed AdaSAM, has already been explored empirically to train large-scale deep neural networks without theoretical guarantee due to the triple difficulties in analyzing the coupled perturbation step, adaptive learning rate and momentum step. In this paper, we try to analyze the convergence rate of AdaSAM in the stochastic non-convex setting. We theoretically show that AdaSAM admits a $\\mathcal{O}(1/\\sqrt{bT})$ convergence rate, which achieves linear speedup property with respect to mini-batch size $b$. Specifically, to decouple the stochastic gradient steps with the adaptive learning rate and perturbed gradient, we introduce the delayed second-order momentum term to decompose them to make them independent while taking an expectation during the analysis. Then we bound them by showing the adaptive learning rate has a limited range, which makes our analysis feasible. To the best of our knowledge, we are the first to provide the non-trivial convergence rate of SAM with an adaptive learning rate and momentum acceleration. At last, we conduct several experiments on several NLP tasks, which show that AdaSAM could achieve superior performance compared with SGD, AMSGrad, and SAM optimizers. ",
    "url": "https://arxiv.org/abs/2303.00565",
    "authors": [
      "Hao Sun",
      "Li Shen",
      "Qihuang Zhong",
      "Liang Ding",
      "Shixiang Chen",
      "Jingwei Sun",
      "Jing Li",
      "Guangzhong Sun",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2303.00566",
    "title": "Structured Pruning for Deep Convolutional Neural Networks: A survey",
    "abstract": "The remarkable performance of deep Convolutional neural networks (CNNs) is generally attributed to their deeper and wider architectures, which can come with significant computational costs. Pruning neural networks has thus gained interest since it effectively lowers storage and computational costs. In contrast to weight pruning, which results in unstructured models, structured pruning provides the benefit of realistic acceleration by producing models that are friendly to hardware implementation. The special requirements of structured pruning have led to the discovery of numerous new challenges and the development of innovative solutions. This article surveys the recent progress towards structured pruning of deep CNNs. We summarize and compare the state-of-the-art structured pruning techniques with respect to filter ranking methods, regularization methods, dynamic execution, neural architecture search, the lottery ticket hypothesis, and the applications of pruning. While discussing structured pruning algorithms, we briefly introduce the unstructured pruning counterpart to emphasize their differences. Furthermore, we provide insights into potential research opportunities in the field of structured pruning. A curated list of neural network pruning papers can be found at https://github.com/he-y/Awesome-Pruning ",
    "url": "https://arxiv.org/abs/2303.00566",
    "authors": [
      "Yang He",
      "Lingao Xiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00575",
    "title": "IPCC-TP: Utilizing Incremental Pearson Correlation Coefficient for Joint  Multi-Agent Trajectory Prediction",
    "abstract": "Reliable multi-agent trajectory prediction is crucial for the safe planning and control of autonomous systems. Compared with single-agent cases, the major challenge in simultaneously processing multiple agents lies in modeling complex social interactions caused by various driving intentions and road conditions. Previous methods typically leverage graph-based message propagation or attention mechanism to encapsulate such interactions in the format of marginal probabilistic distributions. However, it is inherently sub-optimal. In this paper, we propose IPCC-TP, a novel relevance-aware module based on Incremental Pearson Correlation Coefficient to improve multi-agent interaction modeling. IPCC-TP learns pairwise joint Gaussian Distributions through the tightly-coupled estimation of the means and covariances according to interactive incremental movements. Our module can be conveniently embedded into existing multi-agent prediction methods to extend original motion distribution decoders. Extensive experiments on nuScenes and Argoverse 2 datasets demonstrate that IPCC-TP improves the performance of baselines by a large margin. ",
    "url": "https://arxiv.org/abs/2303.00575",
    "authors": [
      "Dekai Zhu",
      "Guangyao Zhai",
      "Yan Di",
      "Fabian Manhardt",
      "Hendrik Berkemeyer",
      "Tuan Tran",
      "Nassir Navab",
      "Federico Tombari",
      "Benjamin Busam"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2303.00579",
    "title": "Are More Layers Beneficial to Graph Transformers?",
    "abstract": "Despite that going deep has proven successful in many neural architectures, the existing graph transformers are relatively shallow. In this work, we explore whether more layers are beneficial to graph transformers, and find that current graph transformers suffer from the bottleneck of improving performance by increasing depth. Our further analysis reveals the reason is that deep graph transformers are limited by the vanishing capacity of global attention, restricting the graph transformer from focusing on the critical substructure and obtaining expressive features. To this end, we propose a novel graph transformer model named DeepGraph that explicitly employs substructure tokens in the encoded representation, and applies local attention on related nodes to obtain substructure based attention encoding. Our model enhances the ability of the global attention to focus on substructures and promotes the expressiveness of the representations, addressing the limitation of self-attention as the graph transformer deepens. Experiments show that our method unblocks the depth limitation of graph transformers and results in state-of-the-art performance across various graph benchmarks with deeper models. ",
    "url": "https://arxiv.org/abs/2303.00579",
    "authors": [
      "Haiteng Zhao",
      "Shuming Ma",
      "Dongdong Zhang",
      "Zhi-Hong Deng",
      "Furu Wei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00595",
    "title": "A Universal Question-Answering Platform for Knowledge Graphs",
    "abstract": "Knowledge from diverse application domains is organized as knowledge graphs (KGs) that are stored in RDF engines accessible in the web via SPARQL endpoints. Expressing a well-formed SPARQL query requires information about the graph structure and the exact URIs of its components, which is impractical for the average user. Question answering (QA) systems assist by translating natural language questions to SPARQL. Existing QA systems are typically based on application-specific human-curated rules, or require prior information, expensive pre-processing and model adaptation for each targeted KG. Therefore, they are hard to generalize to a broad set of applications and KGs. In this paper, we propose KGQAn, a universal QA system that does not need to be tailored to each target KG. Instead of curated rules, KGQAn introduces a novel formalization of question understanding as a text generation problem to convert a question into an intermediate abstract representation via a neural sequence-to-sequence model. We also develop a just-in-time linker that maps at query time the abstract representation to a SPARQL query for a specific KG, using only the publicly accessible APIs and the existing indices of the RDF store, without requiring any pre-processing. Our experiments with several real KGs demonstrate that KGQAn is easily deployed and outperforms by a large margin the state-of-the-art in terms of quality of answers and processing time, especially for arbitrary KGs, unseen during the training. ",
    "url": "https://arxiv.org/abs/2303.00595",
    "authors": [
      "Reham Omar",
      "Ishika Dhall",
      "Panos Kalnis",
      "Essam Mansour"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2303.00596",
    "title": "Information Plane Analysis for Dropout Neural Networks",
    "abstract": "The information-theoretic framework promises to explain the predictive power of neural networks. In particular, the information plane analysis, which measures mutual information (MI) between input and representation as well as representation and output, should give rich insights into the training process. This approach, however, was shown to strongly depend on the choice of estimator of the MI. The problem is amplified for deterministic networks if the MI between input and representation is infinite. Thus, the estimated values are defined by the different approaches for estimation, but do not adequately represent the training process from an information-theoretic perspective. In this work, we show that dropout with continuously distributed noise ensures that MI is finite. We demonstrate in a range of experiments that this enables a meaningful information plane analysis for a class of dropout neural networks that is widely used in practice. ",
    "url": "https://arxiv.org/abs/2303.00596",
    "authors": [
      "Linara Adilova",
      "Bernhard C. Geiger",
      "Asja Fischer"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2303.00601",
    "title": "Multimodal Industrial Anomaly Detection via Hybrid Fusion",
    "abstract": "2D-based Industrial Anomaly Detection has been widely discussed, however, multimodal industrial anomaly detection based on 3D point clouds and RGB images still has many untouched fields. Existing multimodal industrial anomaly detection methods directly concatenate the multimodal features, which leads to a strong disturbance between features and harms the detection performance. In this paper, we propose Multi-3D-Memory (M3DM), a novel multimodal anomaly detection method with hybrid fusion scheme: firstly, we design an unsupervised feature fusion with patch-wise contrastive learning to encourage the interaction of different modal features; secondly, we use a decision layer fusion with multiple memory banks to avoid loss of information and additional novelty classifiers to make the final decision. We further propose a point feature alignment operation to better align the point cloud and RGB features. Extensive experiments show that our multimodal industrial anomaly detection model outperforms the state-of-the-art (SOTA) methods on both detection and segmentation precision on MVTec-3D AD dataset. Code is available at https://github.com/nomewang/M3DM. ",
    "url": "https://arxiv.org/abs/2303.00601",
    "authors": [
      "Yue Wang",
      "Jinlong Peng",
      "Jiangning Zhang",
      "Ran Yi",
      "Yabiao Wang",
      "Chengjie Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00613",
    "title": "Diffusing Graph Attention",
    "abstract": "The dominant paradigm for machine learning on graphs uses Message Passing Graph Neural Networks (MP-GNNs), in which node representations are updated by aggregating information in their local neighborhood. Recently, there have been increasingly more attempts to adapt the Transformer architecture to graphs in an effort to solve some known limitations of MP-GNN. A challenging aspect of designing Graph Transformers is integrating the arbitrary graph structure into the architecture. We propose Graph Diffuser (GD) to address this challenge. GD learns to extract structural and positional relationships between distant nodes in the graph, which it then uses to direct the Transformer's attention and node representation. We demonstrate that existing GNNs and Graph Transformers struggle to capture long-range interactions and how Graph Diffuser does so while admitting intuitive visualizations. Experiments on eight benchmarks show Graph Diffuser to be a highly competitive model, outperforming the state-of-the-art in a diverse set of domains. ",
    "url": "https://arxiv.org/abs/2303.00613",
    "authors": [
      "Daniel Glickman",
      "Eran Yahav"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00616",
    "title": "Prediction of SLAM ATE Using an Ensemble Learning Regression Model and  1-D Global Pooling of Data Characterization",
    "abstract": "Robustness and resilience of simultaneous localization and mapping (SLAM) are critical requirements for modern autonomous robotic systems. One of the essential steps to achieve robustness and resilience is the ability of SLAM to have an integrity measure for its localization estimates, and thus, have internal fault tolerance mechanisms to deal with performance degradation. In this work, we introduce a novel method for predicting SLAM localization error based on the characterization of raw sensor inputs. The proposed method relies on using a random forest regression model trained on 1-D global pooled features that are generated from characterized raw sensor data. The model is validated by using it to predict the performance of ORB-SLAM3 on three different datasets running on four different operating modes, resulting in an average prediction accuracy of up to 94.7\\%. The paper also studies the impact of 12 different 1-D global pooling functions on regression quality, and the superiority of 1-D global averaging is quantitatively proven. Finally, the paper studies the quality of prediction with limited training data, and proves that we are able to maintain proper prediction quality when only 20 \\% of the training examples are used for training, which highlights how the proposed model can optimize the evaluation footprint of SLAM systems. ",
    "url": "https://arxiv.org/abs/2303.00616",
    "authors": [
      "Islam Ali",
      "Bingqing",
      "Hong Zhang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00617",
    "title": "Causalvis: Visualizations for Causal Inference",
    "abstract": "Causal inference is a statistical paradigm for quantifying causal effects using observational data. It is a complex process, requiring multiple steps, iterations, and collaborations with domain experts. Analysts often rely on visualizations to evaluate the accuracy of each step. However, existing visualization toolkits are not designed to support the entire causal inference process within computational environments familiar to analysts. In this paper, we address this gap with Causalvis, a Python visualization package for causal inference. Working closely with causal inference experts, we adopted an iterative design process to develop four interactive visualization modules to support causal inference analysis tasks. The modules are then presented back to the experts for feedback and evaluation. We found that Causalvis effectively supported the iterative causal inference process. We discuss the implications of our findings for designing visualizations for causal inference, particularly for tasks of communication and collaboration. ",
    "url": "https://arxiv.org/abs/2303.00617",
    "authors": [
      "Grace Guo",
      "Ehud Karavani",
      "Alex Endert",
      "Bum Chul Kwon"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2303.00621",
    "title": "The (Computational) Social Choice Take on Indivisible Participatory  Budgeting",
    "abstract": "In this survey, we review the literature investigating participatory budgeting as a social choice problem. Participatory Budgeting (PB) is a democratic process in which citizens are asked to vote on how to allocate a given amount of public money to a set of projects. From a social choice perspective, it corresponds then to the problem of aggregating opinions about which projects should be funded, into a budget allocation satisfying a budget constraint. This problem has received substantial attention in recent years and the literature is growing at a fast pace. In this survey, we present the most important research directions from the literature, each time presenting a large set of representative results. We only focus on the indivisible case, that is, PB problems in which projects can either be fully funded or not at all. The aim of the survey is to present a comprehensive overview of the state of the research on PB. We aim at providing both a general overview of the main research questions that are being investigated, and formal and unified definitions of the most important technical concepts from the literature. Of course a survey is never complete as the state of the research keeps changing. This document is intended to be a living document that gets updated every now and then as the literature grows. If you feel that some papers are not presented correctly, or simply missing, feel free to contact us. We will be more than happy to correct it. ",
    "url": "https://arxiv.org/abs/2303.00621",
    "authors": [
      "Simon Rey",
      "Jan Maly"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2303.00628",
    "title": "MuAViC: A Multilingual Audio-Visual Corpus for Robust Speech Recognition  and Robust Speech-to-Text Translation",
    "abstract": "We introduce MuAViC, a multilingual audio-visual corpus for robust speech recognition and robust speech-to-text translation providing 1200 hours of audio-visual speech in 9 languages. It is fully transcribed and covers 6 English-to-X translation as well as 6 X-to-English translation directions. To the best of our knowledge, this is the first open benchmark for audio-visual speech-to-text translation and the largest open benchmark for multilingual audio-visual speech recognition. Our baseline results show that MuAViC is effective for building noise-robust speech recognition and translation models. We make the corpus available at https://github.com/facebookresearch/muavic. ",
    "url": "https://arxiv.org/abs/2303.00628",
    "authors": [
      "Mohamed Anwar",
      "Bowen Shi",
      "Vedanuj Goswami",
      "Wei-Ning Hsu",
      "Juan Pino",
      "Changhan Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2303.00630",
    "title": "Personalized Task Load Prediction in Speech Communication",
    "abstract": "Estimating the quality of remote speech communication is a complex task influenced by the speaker, transmission channel, and listener. For example, the degradation of transmission quality can increase listeners' cognitive load, which can influence the overall perceived quality of the conversation. This paper presents a framework that isolates quality-dependent changes and controls most outside influencing factors like personal preference in a simulated conversational environment. The performed statistical analysis finds significant relationships between stimulus quality and the listener's valence and personality (agreeableness and openness) and, similarly, between the perceived task load during the listening task and the listener's personality and frustration intolerance. The machine learning model of the task load prediction improves the correlation coefficients from 0.48 to 0.76 when listeners' individuality is considered. The proposed evaluation framework and results pave the way for personalized audio quality assessment that includes speakers' and listeners' individuality beyond conventional channel modeling. ",
    "url": "https://arxiv.org/abs/2303.00630",
    "authors": [
      "Robert P. Spang",
      "Karl El Hajal",
      "Sebastian Möller",
      "Milos Cernak"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2303.00632",
    "title": "That's All Folks: a KG of Values as Commonsense Social Norms and  Behaviors",
    "abstract": "Values, as intended in ethics, determine the shape and validity of moral and social norms, grounding our everyday individual and community behavior on commonsense knowledge. Formalising latent moral content in human interaction is an appealing perspective that would enable a deeper understanding of both social dynamics and individual cognitive and behavioral dimension. To tackle this problem, several theoretical frameworks offer different values models, and organize them into different taxonomies. The problem of the most used theories is that they adopt a cultural-independent perspective while many entities that are considered \"values\" are grounded in commonsense knowledge and expressed in everyday life interaction. We propose here two ontological modules, FOLK, an ontology for values intended in their broad sense, and That's All Folks, a module for lexical and factual folk value triggers, whose purpose is to complement the main theories, providing a method for identifying the values that are not contemplated by the major value theories, but which nonetheless play a key role in daily human interactions, and shape social structures, cultural biases, and personal beliefs. The resource is tested via performing automatic detection of values from text with a frame-based approach. ",
    "url": "https://arxiv.org/abs/2303.00632",
    "authors": [
      "Stefano De Giorgis",
      "Aldo Gangemi"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)",
      "Symbolic Computation (cs.SC)"
    ]
  },
  {
    "id": "arXiv:2303.00635",
    "title": "Guided Graph Generation: Evaluation of Graph Generators in Terms of  Network Statistics, and a New Algorithm",
    "abstract": "We consider the problem of graph generation guided by network statistics, i.e., the generation of graphs which have given values of various numerical measures that characterize networks, such as the clustering coefficient and the number of cycles of given lengths. Algorithms for the generation of synthetic graphs are often based on graph growth models, i.e., rules of adding (and sometimes removing) nodes and edges to a graph that mimic the processes present in real-world networks. While such graph generators are desirable from a theoretical point of view, they are often only able to reproduce a narrow set of properties of real-world networks, resulting in graphs with otherwise unrealistic properties. In this article, we instead evaluate common graph generation algorithms at the task of reproducing the numerical statistics of real-world networks, such as the clustering coefficient, the degree assortativity, and the connectivity. We also propose an iterative algorithm, the Guided Graph Generator, based on a greedy-like procedure that recovers realistic values over a large number of commonly used graph statistics, while at the same time allowing an efficient implementation based on incremental updating of only a small number of subgraph counts. We show that the proposed algorithm outperforms previous graph generation algorithms in terms of the error in the reconstructed graphs for a large number of graph statistics such as the clustering coefficient, the assortativity, the mean node distance, and also evaluate the algorithm in terms of precision, speed of convergence and scalability, and compare it to previous graph generators and models. We also show that the proposed algorithm generates graphs with realistic degree distributions, graph spectra, clustering coefficient distributions, and distance distributions. ",
    "url": "https://arxiv.org/abs/2303.00635",
    "authors": [
      "Jérôme Kunegis",
      "Jun Sun",
      "Eiko Yoneki"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2303.00654",
    "title": "How to DP-fy ML: A Practical Guide to Machine Learning with Differential  Privacy",
    "abstract": "ML models are ubiquitous in real world applications and are a constant focus of research. At the same time, the community has started to realize the importance of protecting the privacy of ML training data. Differential Privacy (DP) has become a gold standard for making formal statements about data anonymization. However, while some adoption of DP has happened in industry, attempts to apply DP to real world complex ML models are still few and far between. The adoption of DP is hindered by limited practical guidance of what DP protection entails, what privacy guarantees to aim for, and the difficulty of achieving good privacy-utility-computation trade-offs for ML models. Tricks for tuning and maximizing performance are scattered among papers or stored in the heads of practitioners. Furthermore, the literature seems to present conflicting evidence on how and whether to apply architectural adjustments and which components are ``safe'' to use with DP. This work is a self-contained guide that gives an in-depth overview of the field of DP ML and presents information about achieving the best possible DP ML model with rigorous privacy guarantees. Our target audience is both researchers and practitioners. Researchers interested in DP for ML will benefit from a clear overview of current advances and areas for improvement. We include theory-focused sections that highlight important topics such as privacy accounting and its assumptions, and convergence. For a practitioner, we provide a background in DP theory and a clear step-by-step guide for choosing an appropriate privacy definition and approach, implementing DP training, potentially updating the model architecture, and tuning hyperparameters. For both researchers and practitioners, consistently and fully reporting privacy guarantees is critical, and so we propose a set of specific best practices for stating guarantees. ",
    "url": "https://arxiv.org/abs/2303.00654",
    "authors": [
      "Natalia Ponomareva",
      "Hussein Hazimeh",
      "Alex Kurakin",
      "Zheng Xu",
      "Carson Denison",
      "H. Brendan McMahan",
      "Sergei Vassilvitskii",
      "Steve Chien",
      "Abhradeep Thakurta"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2303.00691",
    "title": "On the Importance of Feature Representation for Flood Mapping using  Classical Machine Learning Approaches",
    "abstract": "Climate change has increased the severity and frequency of weather disasters all around the world. Flood inundation mapping based on earth observation data can help in this context, by providing cheap and accurate maps depicting the area affected by a flood event to emergency-relief units in near-real-time. Building upon the recent development of the Sen1Floods11 dataset, which provides a limited amount of hand-labeled high-quality training data, this paper evaluates the potential of five traditional machine learning approaches such as gradient boosted decision trees, support vector machines or quadratic discriminant analysis. By performing a grid-search-based hyperparameter optimization on 23 feature spaces we can show that all considered classifiers are capable of outperforming the current state-of-the-art neural network-based approaches in terms of total IoU on their best-performing feature spaces. With total and mean IoU values of 0.8751 and 0.7031 compared to 0.70 and 0.5873 as the previous best-reported results, we show that a simple gradient boosting classifier can significantly improve over deep neural network based approaches, despite using less training data. Furthermore, an analysis of the regional distribution of the Sen1Floods11 dataset reveals a problem of spatial imbalance. We show that traditional machine learning models can learn this bias and argue that modified metric evaluations are required to counter artifacts due to spatial imbalance. Lastly, a qualitative analysis shows that this pixel-wise classifier provides highly-precise surface water classifications indicating that a good choice of a feature space and pixel-wise classification can generate high-quality flood maps using optical and SAR data. We make our code publicly available at: https://github.com/DFKI-Earth-And-Space-Applications/Flood_Mapping_Feature_Space_Importance ",
    "url": "https://arxiv.org/abs/2303.00691",
    "authors": [
      "Kevin Iselborn",
      "Marco Stricker",
      "Takashi Miyamoto",
      "Marlon Nuske",
      "Andreas Dengel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Geophysics (physics.geo-ph)"
    ]
  },
  {
    "id": "arXiv:2303.00695",
    "title": "The position value as a centrality measure in social networks",
    "abstract": "The position value, introduced by Meessen (1988), is a solution concept for cooperative games in which the value assigned to a player depends on the value of the connections or links he has with other players. This concept has been studied by Borm et al. (1992) and characterised by Slikker (2005). In this paper, we analyse the position value from the point of view of the typical properties of a measure of centrality in a social network. We extend the analysis already developed in Gomez et al. (2003) for the Myerson centrality measure, where the symmetric effect on the centralities of the end nodes of an added or removed edge is a fundamental part of its characterisation. However, the Position centrality measure, unlike the Myerson centrality measure, responds in a more versatile way to such addition or elimination. After studying the aforementioned properties, we will focus on the analysis and characterisation of the Position attachment centrality given by the position value when the underlying game is the attachment game. Some comparisons are made with the attachment centrality introduced by Skibski et al. (2019). ",
    "url": "https://arxiv.org/abs/2303.00695",
    "authors": [
      "Susana Lopez",
      "Elisenda Molina",
      "Martha Saboya",
      "Juan Tejada"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2303.00703",
    "title": "Nearest Neighbors Meet Deep Neural Networks for Point Cloud Analysis",
    "abstract": "Performances on standard 3D point cloud benchmarks have plateaued, resulting in oversized models and complex network design to make a fractional improvement. We present an alternative to enhance existing deep neural networks without any redesigning or extra parameters, termed as Spatial-Neighbor Adapter (SN-Adapter). Building on any trained 3D network, we utilize its learned encoding capability to extract features of the training dataset and summarize them as prototypical spatial knowledge. For a test point cloud, the SN-Adapter retrieves k nearest neighbors (k-NN) from the pre-constructed spatial prototypes and linearly interpolates the k-NN prediction with that of the original 3D network. By providing complementary characteristics, the proposed SN-Adapter serves as a plug-and-play module to economically improve performance in a non-parametric manner. More importantly, our SN-Adapter can be effectively generalized to various 3D tasks, including shape classification, part segmentation, and 3D object detection, demonstrating its superiority and robustness. We hope our approach could show a new perspective for point cloud analysis and facilitate future research. ",
    "url": "https://arxiv.org/abs/2303.00703",
    "authors": [
      "Renrui Zhang",
      "Liuhui Wang",
      "Ziyu Guo",
      "Jianbo Shi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00709",
    "title": "Robust and Practical Solution of Laplacian Equations by Approximate  Elimination",
    "abstract": "We introduce a new algorithm and software for solving linear equations in symmetric diagonally dominant matrices with non-positive off-diagonal entries (SDDM matrices), including Laplacian matrices. We use pre-conditioned conjugate gradient (PCG) to solve the system of linear equations. Our preconditioner is a variant of the Approximate Cholesky factorization of Kyng and Sachdeva (FOCS 2016). Our factorization approach is simple: we eliminate matrix rows/columns one at a time and update the remaining matrix using sampling to approximate the outcome of complete Cholesky factorization. Unlike earlier approaches, our sampling always maintains a connectivity in the remaining non-zero structure. Our algorithm comes with a tuning parameter that upper bounds the number of samples made per original entry. We implement our algorithm in Julia, providing two versions, AC and AC2, that respectively use 1 and 2 samples per original entry. We compare their single-threaded performance to that of current state-of-the-art solvers Combinatorial Multigrid (CMG), BoomerAMG-preconditioned Krylov solvers from HyPre and PETSc, Lean Algebraic Multigrid (LAMG), and MATLAB's with Incomplete Cholesky Factorization (ICC). Our evaluation uses a broad class of problems, including all large SDDM matrices from the SuiteSparse collection and diverse programmatically generated instances. Our experiments suggest that our algorithm attains a level of robustness and reliability not seen before in SDDM solvers, while retaining good performance across all instances. Our code and data are public, and we provide a tutorial on how to replicate our tests. We hope that others will adopt this suite of tests as a benchmark, which we refer to as SDDM2023. Our solver code is available at: https://github.com/danspielman/Laplacians.jl/ Our benchmarking data and tutorial are available at: https://rjkyng.github.io/SDDM2023/ ",
    "url": "https://arxiv.org/abs/2303.00709",
    "authors": [
      "Yuan Gao",
      "Rasmus Kyng",
      "Daniel A. Spielman"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Data Structures and Algorithms (cs.DS)",
      "Mathematical Software (cs.MS)"
    ]
  },
  {
    "id": "arXiv:2303.00732",
    "title": "R-U-SURE? Uncertainty-Aware Code Suggestions By Maximizing Utility  Across Random User Intents",
    "abstract": "Large language models show impressive results at predicting structured text such as code, but also commonly introduce errors and hallucinations in their output. When used to assist software developers, these models may make mistakes that users must go back and fix, or worse, introduce subtle bugs that users may miss entirely. We propose Randomized Utility-driven Synthesis of Uncertain REgions (R-U-SURE), an approach for building uncertainty-aware suggestions based on a decision-theoretic model of goal-conditioned utility, using random samples from a generative model as a proxy for the unobserved possible intents of the end user. Our technique combines minimum-Bayes-risk decoding, dual decomposition, and decision diagrams in order to efficiently produce structured uncertainty summaries, given only sample access to an arbitrary generative model of code and an optional AST parser. We demonstrate R-U-SURE on three developer-assistance tasks, and show that it can be applied different user interaction patterns without retraining the model and leads to more accurate uncertainty estimates than token-probability baselines. ",
    "url": "https://arxiv.org/abs/2303.00732",
    "authors": [
      "Daniel D. Johnson",
      "Daniel Tarlow",
      "Christian Walder"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2303.00738",
    "title": "What Are the Chances? Explaining the Epsilon Parameter in Differential  Privacy",
    "abstract": "Differential privacy (DP) is a mathematical privacy notion increasingly deployed across government and industry. With DP, privacy protections are probabilistic: they are bounded by the privacy budget parameter, $\\epsilon$. Prior work in health and computational science finds that people struggle to reason about probabilistic risks. Yet, communicating the implications of $\\epsilon$ to people contributing their data is vital to avoiding privacy theater -- presenting meaningless privacy protection as meaningful -- and empowering more informed data-sharing decisions. Drawing on best practices in risk communication and usability, we develop three methods to convey probabilistic DP guarantees to end users: two that communicate odds and one offering concrete examples of DP outputs. We quantitatively evaluate these explanation methods in a vignette survey study ($n=963$) via three metrics: objective risk comprehension, subjective privacy understanding of DP guarantees, and self-efficacy. We find that odds-based explanation methods are more effective than (1) output-based methods and (2) state-of-the-art approaches that gloss over information about $\\epsilon$. Further, when offered information about $\\epsilon$, respondents are more willing to share their data than when presented with a state-of-the-art DP explanation; this willingness to share is sensitive to $\\epsilon$ values: as privacy protections weaken, respondents are less likely to share data. ",
    "url": "https://arxiv.org/abs/2303.00738",
    "authors": [
      "Priyanka Nanayakkara",
      "Mary Anne Smart",
      "Rachel Cummings",
      "Gabriel Kaptchuk",
      "Elissa Redmiles"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2303.00749",
    "title": "S-NeRF: Neural Radiance Fields for Street Views",
    "abstract": "Neural Radiance Fields (NeRFs) aim to synthesize novel views of objects and scenes, given the object-centric camera views with large overlaps. However, we conjugate that this paradigm does not fit the nature of the street views that are collected by many self-driving cars from the large-scale unbounded scenes. Also, the onboard cameras perceive scenes without much overlapping. Thus, existing NeRFs often produce blurs, 'floaters' and other artifacts on street-view synthesis. In this paper, we propose a new street-view NeRF (S-NeRF) that considers novel view synthesis of both the large-scale background scenes and the foreground moving vehicles jointly. Specifically, we improve the scene parameterization function and the camera poses for learning better neural representations from street views. We also use the the noisy and sparse LiDAR points to boost the training and learn a robust geometry and reprojection based confidence to address the depth outliers. Moreover, we extend our S-NeRF for reconstructing moving vehicles that is impracticable for conventional NeRFs. Thorough experiments on the large-scale driving datasets (e.g., nuScenes and Waymo) demonstrate that our method beats the state-of-the-art rivals by reducing 7% to 40% of the mean-squared error in the street-view synthesis and a 45% PSNR gain for the moving vehicles rendering. ",
    "url": "https://arxiv.org/abs/2303.00749",
    "authors": [
      "Ziyang Xie",
      "Junge Zhang",
      "Wenye Li",
      "Feihu Zhang",
      "Li Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00080",
    "title": "Neural Stochastic Agent-Based Limit Order Book Simulation: A Hybrid  Methodology",
    "abstract": "Modern financial exchanges use an electronic limit order book (LOB) to store bid and ask orders for a specific financial asset. As the most fine-grained information depicting the demand and supply of an asset, LOB data is essential in understanding market dynamics. Therefore, realistic LOB simulations offer a valuable methodology for explaining empirical properties of markets. Mainstream simulation models include agent-based models (ABMs) and stochastic models (SMs). However, ABMs tend not to be grounded on real historical data, while SMs tend not to enable dynamic agent-interaction. To overcome these limitations, we propose a novel hybrid LOB simulation paradigm characterised by: (1) representing the aggregation of market events' logic by a neural stochastic background trader that is pre-trained on historical LOB data through a neural point process model; and (2) embedding the background trader in a multi-agent simulation with other trading agents. We instantiate this hybrid NS-ABM model using the ABIDES platform. We first run the background trader in isolation and show that the simulated LOB can recreate a comprehensive list of stylised facts that demonstrate realistic market behaviour. We then introduce a population of `trend' and `value' trading agents, which interact with the background trader. We show that the stylised facts remain and we demonstrate order flow impact and financial herding behaviours that are in accordance with empirical observations of real markets. ",
    "url": "https://arxiv.org/abs/2303.00080",
    "authors": [
      "Zijian Shi",
      "John Cartlidge"
    ],
    "subjectives": [
      "Trading and Market Microstructure (q-fin.TR)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Multiagent Systems (cs.MA)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Computational Finance (q-fin.CP)"
    ]
  },
  {
    "id": "arXiv:2303.00175",
    "title": "A Deep Neural Architecture for Harmonizing 3-D Input Data Analysis and  Decision Making in Medical Imaging",
    "abstract": "Harmonizing the analysis of data, especially of 3-D image volumes, consisting of different number of slices and annotated per volume, is a significant problem in training and using deep neural networks in various applications, including medical imaging. Moreover, unifying the decision making of the networks over different input datasets is crucial for the generation of rich data-driven knowledge and for trusted usage in the applications. This paper presents a new deep neural architecture, named RACNet, which includes routing and feature alignment steps and effectively handles different input lengths and single annotations of the 3-D image inputs, whilst providing highly accurate decisions. In addition, through latent variable extraction from the trained RACNet, a set of anchors are generated providing further insight on the network's decision making. These can be used to enrich and unify data-driven knowledge extracted from different datasets. An extensive experimental study illustrates the above developments, focusing on COVID-19 diagnosis through analysis of 3-D chest CT scans from databases generated in different countries and medical centers. ",
    "url": "https://arxiv.org/abs/2303.00175",
    "authors": [
      "Dimitrios Kollias",
      "Anastasios Arsenos",
      "Stefanos Kollias"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00233",
    "title": "Single-Cell Multimodal Prediction via Transformers",
    "abstract": "The recent development of multimodal single-cell technology has made the possibility of acquiring multiple omics data from individual cells, thereby enabling a deeper understanding of cellular states and dynamics. Nevertheless, the proliferation of multimodal single-cell data also introduces tremendous challenges in modeling the complex interactions among different modalities. The recently advanced methods focus on constructing static interaction graphs and applying graph neural networks (GNNs) to learn from multimodal data. However, such static graphs can be suboptimal as they do not take advantage of the downstream task information; meanwhile GNNs also have some inherent limitations when deeply stacking GNN layers. To tackle these issues, in this work, we investigate how to leverage transformers for multimodal single-cell data in an end-to-end manner while exploiting downstream task information. In particular, we propose a scMoFormer framework which can readily incorporate external domain knowledge and model the interactions within each modality and cross modalities. Extensive experiments demonstrate that scMoFormer achieves superior performance on various benchmark datasets. Note that scMoFormer won a Kaggle silver medal with the rank of $24\\ /\\ 1221$ (Top 2%) without ensemble in a NeurIPS 2022 competition. Our implementation is publicly available at Github. ",
    "url": "https://arxiv.org/abs/2303.00233",
    "authors": [
      "Wenzhuo Tang",
      "Hongzhi Wen",
      "Renming Liu",
      "Jiayuan Ding",
      "Wei Jin",
      "Yuying Xie",
      "Hui Liu",
      "Jiliang Tang"
    ],
    "subjectives": [
      "Genomics (q-bio.GN)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00351",
    "title": "An end-to-end SE(3)-equivariant segmentation network",
    "abstract": "Convolutional neural networks (CNNs) allow for parameter sharing and translational equivariance by using convolutional kernels in their linear layers. By restricting these kernels to be SO(3)-steerable, CNNs can further improve parameter sharing and equivariance. These equivariant convolutional layers have several advantages over standard convolutional layers, including increased robustness to unseen poses, smaller network size, and improved sample efficiency. Despite this, most segmentation networks used in medical image analysis continue to rely on standard convolutional kernels. In this paper, we present a new family of segmentation networks that use equivariant voxel convolutions based on spherical harmonics, as well as equivariant pooling and normalization operations. These SE(3)-equivariant volumetric segmentation networks, which are robust to data poses not seen during training, do not require rotation-based data augmentation during training. In addition, we demonstrate improved segmentation performance in MRI brain tumor and healthy brain structure segmentation tasks, with enhanced robustness to reduced amounts of training data and improved parameter efficiency. Code to reproduce our results, and to implement the equivariant segmentation networks for other tasks is available at~\\url{this http URL}. ",
    "url": "https://arxiv.org/abs/2303.00351",
    "authors": [
      "Ivan Diaz",
      "Mario Geiger",
      "Richard Iain McKinley"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00437",
    "title": "Assessing the Finite-Time Stability of Nonlinear Systems by means of  Physics-Informed Neural Networks",
    "abstract": "In this paper, the problem of assessing the Finite-Time Stability (FTS) property for general nonlinear systems is considered. First, some necessary and sufficient conditions that guarantee the FTS of general nonlinear systems are provided; such conditions are expressed in terms of the existence of a suitable Lyapunov-like function. Connections of the main theoretical result of given in this article with the typical conditions based on Linear Matrix Inequalities (LMI) that are used for Linear Time-Varying (LTV) systems are discussed. An extension to the case of discrete time systems is also provided. Then, we propose a method to verify the obtained conditions for a very broad class of nonlinear systems. The proposed technique leverages the capability of neural networks to serve as universal function approximators to obtain the Lyapunov-like function. The network training data are generated by enforcing the conditions defining such function in a (large) set of collocation points, as in the case of Physics-Informed Neural Networks. To illustrate the effectiveness of the proposed approach, some numerical examples are proposed and discussed. The technique proposed in this paper allows to obtain the required Lyapunov-like function in closed form. This has the twofold advantage of a) providing a practical way to verify the considered FTS property for a very general class of systems, with an unprecedented flexibility in the FTS context, and b) paving the way to control applications based on Lyapunov methods in the framework of Finite-Time Stability and Control. ",
    "url": "https://arxiv.org/abs/2303.00437",
    "authors": [
      "Adriano Mele",
      "Alfredo Pironti"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2303.00455",
    "title": "First-shot anomaly sound detection for machine condition monitoring: A  domain generalization baseline",
    "abstract": "This paper provides a baseline system for First-shot-compliant unsupervised anomaly detection (ASD) for machine condition monitoring. First-shot ASD does not allow systems to do machine-type dependent hyperparameter tuning or tool ensembling based on the performance metric calculated with the grand truth. To show benchmark performance for First-shot ASD, this paper proposes an anomaly sound detection system that works on the domain generalization task in the Detection and Classification of Acoustic Scenes and Events (DCASE) 2022 Challenge Task 2: \"Unsupervised Anomalous Sound Detection for Machine Condition Monitoring Applying Domain Generalization Technique\" while complying with the First-shot requirements introduced in the DCASE 2023 Challenge Task 2 (DCASE2023T2). A simple autoencoder based implementation combined with selective Mahalanobis metric is implemented as a baseline system. The performance evaluation is conducted to set the target benchmark for the forthcoming DCASE2023T2. Source code of the baseline system will be available on GitHub: https://github.com/nttcslab/dcase2023_task2_baseline_ae . ",
    "url": "https://arxiv.org/abs/2303.00455",
    "authors": [
      "Noboru Harada",
      "Daisuke Niizumi",
      "Yasunori Ohishi",
      "Daiki Takeuchi",
      "Masahiro Yasuda"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2303.00556",
    "title": "A linear bound for the Colin de Verdiére parameter $μ$ for graphs  embedded on surfaces",
    "abstract": "We provide a combinatorial and self-contained proof that for all graphs $G$ embedded on a surface $S$, the Colin de Verdi\\`ere parameter $\\mu(G)$ is upper bounded by $7-2\\chi(S)$. ",
    "url": "https://arxiv.org/abs/2303.00556",
    "authors": [
      "Camille Lanuel",
      "Francis Lazarus",
      "Rudi Pendavingh"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2303.00589",
    "title": "Composite Optimization Algorithms for Sigmoid Networks",
    "abstract": "In this paper, we use composite optimization algorithms to solve sigmoid networks. We equivalently transfer the sigmoid networks to a convex composite optimization and propose the composite optimization algorithms based on the linearized proximal algorithms and the alternating direction method of multipliers. Under the assumptions of the weak sharp minima and the regularity condition, the algorithm is guaranteed to converge to a globally optimal solution of the objective function even in the case of non-convex and non-smooth problems. Furthermore, the convergence results can be directly related to the amount of training data and provide a general guide for setting the size of sigmoid networks. Numerical experiments on Franke's function fitting and handwritten digit recognition show that the proposed algorithms perform satisfactorily and robustly. ",
    "url": "https://arxiv.org/abs/2303.00589",
    "authors": [
      "Huixiong Chen",
      "Qi Ye"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.00618",
    "title": "Robustness of quantum algorithms against coherent control errors",
    "abstract": "Coherent control errors, for which ideal Hamiltonians are perturbed by unknown multiplicative noise terms, are a major obstacle for reliable quantum computing. In this paper, we present a framework for analyzing the robustness of quantum algorithms against coherent control errors using Lipschitz bounds. We derive worst-case fidelity bounds which show that the resilience against coherent control errors is mainly influenced by the norms of the Hamiltonians generating the individual gates. These bounds are explicitly computable even for large circuits, and they can be used to guarantee fault-tolerance via threshold theorems. Moreover, we apply our theoretical framework to derive a novel guideline for robust quantum algorithm design and transpilation, which amounts to reducing the norms of the Hamiltonians. Using the $3$-qubit Quantum Fourier Transform as an example application, we demonstrate that this guideline targets robustness more effectively than existing ones based on circuit depth or gate count. Furthermore, we apply our framework to study the effect of parameter regularization in variational quantum algorithms. The practicality of the theoretical results is demonstrated via implementations in simulation and on a quantum computer. ",
    "url": "https://arxiv.org/abs/2303.00618",
    "authors": [
      "J. Berberich",
      "D. Fink",
      "C. Holm"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2303.00693",
    "title": "PE-GAN: Prior Embedding GAN for PXD images at Belle II",
    "abstract": "The pixel vertex detector (PXD) is an essential part of the Belle II detector recording particle positions. Data from the PXD and other sensors allow us to reconstruct particle tracks and decay vertices. The effect of background hits on track reconstruction is simulated by adding measured or simulated background hit patterns to the hits produced by simulated signal particles. This model requires a large set of statistically independent PXD background noise samples to avoid a systematic bias of reconstructed tracks. However, data from the fine-grained PXD requires a substantial amount of storage. As an efficient way of producing background noise, we explore the idea of an on-demand PXD background generator using conditional Generative Adversarial Networks (GANs) with contrastive learning, adapted by the number of PXD sensors in order to both increase the image fidelity and produce sensor-dependent PXD hitmaps. ",
    "url": "https://arxiv.org/abs/2303.00693",
    "authors": [
      "Hosein Hashemi",
      "Nikolai Hartmann",
      "Thomas Kuhr",
      "Martin Ritter",
      "Matej srebre"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:1910.02684",
    "title": "Effective Stabilized Self-Training on Few-Labeled Graph Data",
    "abstract": " Comments: 34 pages ",
    "url": "https://arxiv.org/abs/1910.02684",
    "authors": [
      "Ziang Zhou",
      "Jieming Shi",
      "Shengzhong Zhang",
      "Zengfeng Huang",
      "Qing Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2006.05534",
    "title": "Novelty Detection via Robust Variational Autoencoding",
    "abstract": " Title: Novelty Detection via Robust Variational Autoencoding ",
    "url": "https://arxiv.org/abs/2006.05534",
    "authors": [
      "Chieh-Hsin Lai",
      "Dongmian Zou",
      "Gilad Lerman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2008.04267",
    "title": "Robust Validation: Confident Predictions Even When Distributions Shift",
    "abstract": " Comments: 58 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2008.04267",
    "authors": [
      "Maxime Cauchois",
      "Suyash Gupta",
      "Alnur Ali",
      "John C. Duchi"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2010.11342",
    "title": "Contextual Linear Types for Differential Privacy",
    "abstract": " Comments: Published in Transactions on Programming Languages and Systems (TOPLAS) 2023 ",
    "url": "https://arxiv.org/abs/2010.11342",
    "authors": [
      "Matías Toro",
      "David Darais",
      "Chike Abuah",
      "Joe Near",
      "Damián Árquez",
      "Federico Olmedo",
      "Éric Tanter"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2012.08950",
    "title": "Revocable Deep Reinforcement Learning with Affinity Regularization for  Outlier-Robust Graph Matching",
    "abstract": " Comments: Proceedings of The Eleventh International Conference on Learning Representations (ICLR 2023) ",
    "url": "https://arxiv.org/abs/2012.08950",
    "authors": [
      "Chang Liu",
      "Zetian Jiang",
      "Runzhong Wang",
      "Junchi Yan",
      "Lingxiao Huang",
      "Pinyan Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2102.10343",
    "title": "Measuring the Transferability of $\\ell_\\infty$ Attacks by the $\\ell_2$  Norm",
    "abstract": " Comments: ICASSP 2023 ",
    "url": "https://arxiv.org/abs/2102.10343",
    "authors": [
      "Sizhe Chen",
      "Qinghua Tao",
      "Zhixing Ye",
      "Xiaolin Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2104.03138",
    "title": "Destroying Multicolored Paths and Cycles in Edge-Colored Graphs",
    "abstract": " Comments: 31 pages ",
    "url": "https://arxiv.org/abs/2104.03138",
    "authors": [
      "Nils Jakob Eckstein",
      "Niels Grüttemeier",
      "Christian Komusiewicz",
      "Frank Sommer"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2106.04416",
    "title": "Context-Specific Causal Discovery for Categorical Data Using Staged  Trees",
    "abstract": " Title: Context-Specific Causal Discovery for Categorical Data Using Staged  Trees ",
    "url": "https://arxiv.org/abs/2106.04416",
    "authors": [
      "Manuele Leonelli",
      "Gherardo Varando"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.06988",
    "title": "Spectral Convergence of Symmetrized Graph Laplacian on manifolds with  boundary",
    "abstract": " Comments: 6 figures ",
    "url": "https://arxiv.org/abs/2110.06988",
    "authors": [
      "J. Wilson Peoples",
      "John Harlim"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2201.12220",
    "title": "Neural Optimal Transport",
    "abstract": " Title: Neural Optimal Transport ",
    "url": "https://arxiv.org/abs/2201.12220",
    "authors": [
      "Alexander Korotin",
      "Daniil Selikhanovych",
      "Evgeny Burnaev"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.12240",
    "title": "Continuous Deep Equilibrium Models: Training Neural ODEs faster by  integrating them to Infinity",
    "abstract": " Title: Continuous Deep Equilibrium Models: Training Neural ODEs faster by  integrating them to Infinity ",
    "url": "https://arxiv.org/abs/2201.12240",
    "authors": [
      "Avik Pal",
      "Alan Edelman",
      "Christopher Rackauckas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2204.12533",
    "title": "A Gaussian Process Model for Opponent Prediction in Autonomous Racing",
    "abstract": " Comments: Submitted to IROS 2023 ",
    "url": "https://arxiv.org/abs/2204.12533",
    "authors": [
      "Edward L. Zhu",
      "Finn Lukas Busch",
      "Jake Johnson",
      "Francesco Borrelli"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.12637",
    "title": "Meta-Learning Based Early Fault Detection for Rolling Bearings via  Few-Shot Anomaly Detection",
    "abstract": " Comments: The results require to be updated ",
    "url": "https://arxiv.org/abs/2204.12637",
    "authors": [
      "Wenbin Song",
      "Di Wu",
      "Weiming Shen",
      "Benoit Boulet"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.08059",
    "title": "Evolution strategies: Application in hybrid quantum-classical neural  networks",
    "abstract": " Title: Evolution strategies: Application in hybrid quantum-classical neural  networks ",
    "url": "https://arxiv.org/abs/2205.08059",
    "authors": [
      "Lucas Friedrich",
      "Jonas Maziero"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.14309",
    "title": "Federated Neural Bandits",
    "abstract": " Comments: ICLR 2023. Code: this https URL ",
    "url": "https://arxiv.org/abs/2205.14309",
    "authors": [
      "Zhongxiang Dai",
      "Yao Shu",
      "Arun Verma",
      "Flint Xiaofeng Fan",
      "Bryan Kian Hsiang Low",
      "Patrick Jaillet"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.15269",
    "title": "Kernel Neural Optimal Transport",
    "abstract": " Title: Kernel Neural Optimal Transport ",
    "url": "https://arxiv.org/abs/2205.15269",
    "authors": [
      "Alexander Korotin",
      "Daniil Selikhanovych",
      "Evgeny Burnaev"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2206.00518",
    "title": "Efficient Scheduling of Data Augmentation for Deep Reinforcement  Learning",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2102.08581 ",
    "url": "https://arxiv.org/abs/2206.00518",
    "authors": [
      "Byungchan Ko",
      "Jungseul Ok"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.14855",
    "title": "SoK: Content Moderation in Social Media, from Guidelines to Enforcement,  and Research to Practice",
    "abstract": " Comments: To appear in the 8th IEEE European Symposium on Security and Privacy (EuroS&P 2023) ",
    "url": "https://arxiv.org/abs/2206.14855",
    "authors": [
      "Mohit Singhal",
      "Chen Ling",
      "Pujan Paudel",
      "Poojitha Thota",
      "Nihal Kumarswamy",
      "Gianluca Stringhini",
      "Shirin Nilizadeh"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2207.07338",
    "title": "Context-sensitive neocortical neurons transform the effectiveness and  efficiency of neural information processing",
    "abstract": " Title: Context-sensitive neocortical neurons transform the effectiveness and  efficiency of neural information processing ",
    "url": "https://arxiv.org/abs/2207.07338",
    "authors": [
      "Ahsan Adeel",
      "Mario Franco",
      "Mohsin Raza",
      "Khubaib Ahmed"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.12988",
    "title": "Monocular 3D Object Detection with Depth from Motion",
    "abstract": " Comments: ECCV 2022 Oral ",
    "url": "https://arxiv.org/abs/2207.12988",
    "authors": [
      "Tai Wang",
      "Jiangmiao Pang",
      "Dahua Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2208.12428",
    "title": "Robust Prototypical Few-Shot Organ Segmentation with Regularized  Neural-ODEs",
    "abstract": " Title: Robust Prototypical Few-Shot Organ Segmentation with Regularized  Neural-ODEs ",
    "url": "https://arxiv.org/abs/2208.12428",
    "authors": [
      "Prashant Pandey",
      "Mustafa Chasmai",
      "Tanuj Sur",
      "Brejesh Lall"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.06954",
    "title": "Correlation Information Bottleneck: Towards Adapting Pretrained  Multimodal Models for Robust Visual Question Answering",
    "abstract": " Comments: 17 pages, 4 figures, 11 tables ",
    "url": "https://arxiv.org/abs/2209.06954",
    "authors": [
      "Jingjing Jiang",
      "Ziyi Liu",
      "Nanning Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.06983",
    "title": "Double Doubly Robust Thompson Sampling for Generalized Linear Contextual  Bandits",
    "abstract": " Comments: 2023 AAAI Press Proceedings (Full paper including Appendix) Selected as an oral presentation at the 2023 AAAI conference ",
    "url": "https://arxiv.org/abs/2209.06983",
    "authors": [
      "Wonyoung Kim",
      "Kyungbok Lee",
      "Myunghee Cho Paik"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07753",
    "title": "Code as Policies: Language Model Programs for Embodied Control",
    "abstract": " Title: Code as Policies: Language Model Programs for Embodied Control ",
    "url": "https://arxiv.org/abs/2209.07753",
    "authors": [
      "Jacky Liang",
      "Wenlong Huang",
      "Fei Xia",
      "Peng Xu",
      "Karol Hausman",
      "Brian Ichter",
      "Pete Florence",
      "Andy Zeng"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.07817",
    "title": "SPGP: Structure Prototype Guided Graph Pooling",
    "abstract": " Comments: 20 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2209.07817",
    "authors": [
      "Sangseon Lee",
      "Dohoon Lee",
      "Yinhua Piao",
      "Sun Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.07896",
    "title": "3D VSG: Long-term Semantic Scene Change Prediction through 3D Variable  Scene Graphs",
    "abstract": " Comments: Accepted for IEEE International Conference on Robotics and Automation (ICRA) 2023. 8 pages, 4 figures, code released at this https URL ",
    "url": "https://arxiv.org/abs/2209.07896",
    "authors": [
      "Samuel Looper",
      "Javier Rodriguez-Puigvert",
      "Roland Siegwart",
      "Cesar Cadena",
      "Lukas Schmid"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07924",
    "title": "GNNInterpreter: A Probabilistic Generative Model-Level Explanation for  Graph Neural Networks",
    "abstract": " Title: GNNInterpreter: A Probabilistic Generative Model-Level Explanation for  Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2209.07924",
    "authors": [
      "Xiaoqi Wang",
      "Han-Wei Shen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.09329",
    "title": "MAN: Multi-Action Networks Learning",
    "abstract": " Title: MAN: Multi-Action Networks Learning ",
    "url": "https://arxiv.org/abs/2209.09329",
    "authors": [
      "Keqin Wang",
      "Alison Bartsch",
      "Amir Barati Farimani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.13657",
    "title": "Suture Thread Spline Reconstruction from Endoscopic Images for Robotic  Surgery with Reliability-driven Keypoint Detection",
    "abstract": " Comments: To be published in ICRA 2023 ",
    "url": "https://arxiv.org/abs/2209.13657",
    "authors": [
      "Neelay Joglekar",
      "Fei Liu",
      "Ryan Orosco",
      "Michael Yip"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.14499",
    "title": "NVRadarNet: Real-Time Radar Obstacle and Free Space Detection for  Autonomous Driving",
    "abstract": " Comments: 7 pages, 6 figures, ICRA 2023 conference, for associated video file, see this https URL ",
    "url": "https://arxiv.org/abs/2209.14499",
    "authors": [
      "Alexander Popov",
      "Patrik Gebhardt",
      "Ke Chen",
      "Ryan Oldja",
      "Heeseok Lee",
      "Shane Murray",
      "Ruchi Bhargava",
      "Nikolai Smolyanskiy"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.14649",
    "title": "Factor Graph Fusion of Raw GNSS Sensing with IMU and Lidar for Precise  Robot Localization without a Base Station",
    "abstract": " Comments: 7 pages, 4 figures, accompanying video: this https URL, accepted to the 2023 IEEE International Conference on Robotics and Automation (ICRA) ",
    "url": "https://arxiv.org/abs/2209.14649",
    "authors": [
      "Jonas Beuchert",
      "Marco Camurri",
      "Maurice Fallon"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2210.00120",
    "title": "NTFields: Neural Time Fields for Physics-Informed Robot Motion Planning",
    "abstract": " Title: NTFields: Neural Time Fields for Physics-Informed Robot Motion Planning ",
    "url": "https://arxiv.org/abs/2210.00120",
    "authors": [
      "Ruiqi Ni",
      "Ahmed H. Qureshi"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.00312",
    "title": "Multimodal Analogical Reasoning over Knowledge Graphs",
    "abstract": " Comments: Accepted by ICLR 2023. The project website is this https URL ",
    "url": "https://arxiv.org/abs/2210.00312",
    "authors": [
      "Ningyu Zhang",
      "Lei Li",
      "Xiang Chen",
      "Xiaozhuan Liang",
      "Shumin Deng",
      "Huajun Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2210.01302",
    "title": "Nuisances via Negativa: Adjusting for Spurious Correlations via Data  Augmentation",
    "abstract": " Title: Nuisances via Negativa: Adjusting for Spurious Correlations via Data  Augmentation ",
    "url": "https://arxiv.org/abs/2210.01302",
    "authors": [
      "Aahlad Puli",
      "Nitish Joshi",
      "He He",
      "Rajesh Ranganath"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.01944",
    "title": "A Framework for Large Scale Synthetic Graph Dataset Generation",
    "abstract": " Title: A Framework for Large Scale Synthetic Graph Dataset Generation ",
    "url": "https://arxiv.org/abs/2210.01944",
    "authors": [
      "Sajad Darabi",
      "Piotr Bigaj",
      "Dawid Majchrowski",
      "Pawel Morkisz",
      "Alex Fit-Florea"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2210.02912",
    "title": "CANIFE: Crafting Canaries for Empirical Privacy Measurement in Federated  Learning",
    "abstract": " Comments: Accepted to ICLR 2023 ",
    "url": "https://arxiv.org/abs/2210.02912",
    "authors": [
      "Samuel Maddock",
      "Alexandre Sablayrolles",
      "Pierre Stock"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2210.07494",
    "title": "A Comprehensive Study on Large-Scale Graph Training: Benchmarking and  Rethinking",
    "abstract": " Comments: Accepted by NeurIPS 2022 Dataset and Benchmark Track ",
    "url": "https://arxiv.org/abs/2210.07494",
    "authors": [
      "Keyu Duan",
      "Zirui Liu",
      "Peihao Wang",
      "Wenqing Zheng",
      "Kaixiong Zhou",
      "Tianlong Chen",
      "Xia Hu",
      "Zhangyang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.10946",
    "title": "Causally-guided Regularization of Graph Attention Improves  Generalizability",
    "abstract": " Title: Causally-guided Regularization of Graph Attention Improves  Generalizability ",
    "url": "https://arxiv.org/abs/2210.10946",
    "authors": [
      "Alexander P. Wu",
      "Thomas Markovich",
      "Bonnie Berger",
      "Nils Hammerla",
      "Rohit Singh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.10992",
    "title": "NIFT: Neural Interaction Field and Template for Object Manipulation",
    "abstract": " Comments: ICRA 2023 ",
    "url": "https://arxiv.org/abs/2210.10992",
    "authors": [
      "Zeyu Huang",
      "Juzhan Xu",
      "Sisi Dai",
      "Kai Xu",
      "Hao Zhang",
      "Hui Huang",
      "Ruizhen Hu"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2210.13124",
    "title": "Cipherfix: Mitigating Ciphertext Side-Channel Attacks in Software",
    "abstract": " Comments: Jan Wichelmann and Anna P\\\"atschke contributed equally to this work ",
    "url": "https://arxiv.org/abs/2210.13124",
    "authors": [
      "Jan Wichelmann",
      "Anna Pätschke",
      "Luca Wilke",
      "Thomas Eisenbarth"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2210.14709",
    "title": "Learning on Large-scale Text-attributed Graphs via Variational Inference",
    "abstract": " Comments: ICLR 2023 ",
    "url": "https://arxiv.org/abs/2210.14709",
    "authors": [
      "Jianan Zhao",
      "Meng Qu",
      "Chaozhuo Li",
      "Hao Yan",
      "Qian Liu",
      "Rui Li",
      "Xing Xie",
      "Jian Tang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.15987",
    "title": "NNSVS: A Neural Network-Based Singing Voice Synthesis Toolkit",
    "abstract": " Comments: Accepted to ICASSP 2023 ",
    "url": "https://arxiv.org/abs/2210.15987",
    "authors": [
      "Ryuichi Yamamoto",
      "Reo Yoneyama",
      "Tomoki Toda"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2211.05641",
    "title": "Regression as Classification: Influence of Task Formulation on Neural  Network Features",
    "abstract": " Title: Regression as Classification: Influence of Task Formulation on Neural  Network Features ",
    "url": "https://arxiv.org/abs/2211.05641",
    "authors": [
      "Lawrence Stewart",
      "Francis Bach",
      "Quentin Berthet",
      "Jean-Philippe Vert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2211.06545",
    "title": "Self-Supervised Graph Structure Refinement for Graph Neural Networks",
    "abstract": " Comments: WSDM 2023 ",
    "url": "https://arxiv.org/abs/2211.06545",
    "authors": [
      "Jianan Zhao",
      "Qianlong Wen",
      "Mingxuan Ju",
      "Chuxu Zhang",
      "Yanfang Ye"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.06605",
    "title": "Comprehensive Analysis of Over-smoothing in Graph Neural Networks from  Markov Chains Perspective",
    "abstract": " Title: Comprehensive Analysis of Over-smoothing in Graph Neural Networks from  Markov Chains Perspective ",
    "url": "https://arxiv.org/abs/2211.06605",
    "authors": [
      "Weichen Zhao",
      "Chenguang Wang",
      "Congying Han",
      "Tiande Guo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.11853",
    "title": "Learnable Graph Convolutional Attention Networks",
    "abstract": " Comments: Published as a conference paper at ICLR 2023. 35 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2211.11853",
    "authors": [
      "Adrián Javaloy",
      "Pablo Sanchez-Martin",
      "Amit Levi",
      "Isabel Valera"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.12886",
    "title": "OReX: Object Reconstruction from Planar Cross-sections Using Neural  Fields",
    "abstract": " Title: OReX: Object Reconstruction from Planar Cross-sections Using Neural  Fields ",
    "url": "https://arxiv.org/abs/2211.12886",
    "authors": [
      "Haim Sawdayee",
      "Amir Vaxman",
      "Amit H. Bermano"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.14810",
    "title": "A Kernel Perspective of Skip Connections in Convolutional Networks",
    "abstract": " Title: A Kernel Perspective of Skip Connections in Convolutional Networks ",
    "url": "https://arxiv.org/abs/2211.14810",
    "authors": [
      "Daniel Barzilai",
      "Amnon Geifman",
      "Meirav Galun",
      "Ronen Basri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.00959",
    "title": "UniKGQA: Unified Retrieval and Reasoning for Solving Multi-hop Question  Answering Over Knowledge Graph",
    "abstract": " Comments: Camera-ready of ICLR 2023 ",
    "url": "https://arxiv.org/abs/2212.00959",
    "authors": [
      "Jinhao Jiang",
      "Kun Zhou",
      "Wayne Xin Zhao",
      "Ji-Rong Wen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2212.03741",
    "title": "Magic: Multi Art Genre Intelligent Choreography Dataset and Network for  3D Dance Generation",
    "abstract": " Comments: We realize that there are methods and experiments that better support our conclusions, so we decide to withdraw this release and investigate this further in future work ",
    "url": "https://arxiv.org/abs/2212.03741",
    "authors": [
      "Ronghui Li",
      "Junfan Zhao",
      "Yachao Zhang",
      "Mingyang Su",
      "Zeping Ren",
      "Han Zhang",
      "Xiu Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2212.09385",
    "title": "Prediction of Auto Insurance Risk Based on t-SNE Dimensionality  Reduction",
    "abstract": " Comments: 13 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2212.09385",
    "authors": [
      "Joseph Levitas",
      "Konstantin Yavilberg",
      "Oleg Korol",
      "Genadi Man"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Risk Management (q-fin.RM)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.10701",
    "title": "A Non-Asymptotic Analysis of Oversmoothing in Graph Neural Networks",
    "abstract": " Comments: Accepted by the 11th International Conference on Learning Representations (ICLR 2023) ",
    "url": "https://arxiv.org/abs/2212.10701",
    "authors": [
      "Xinyi Wu",
      "Zhengdao Chen",
      "William Wang",
      "Ali Jadbabaie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.12990",
    "title": "Unsupervised Representation Learning from Pre-trained Diffusion  Probabilistic Models",
    "abstract": " Comments: Accepted by NeurIPS 2022 Conference ",
    "url": "https://arxiv.org/abs/2212.12990",
    "authors": [
      "Zijian Zhang",
      "Zhou Zhao",
      "Zhijie Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.00591",
    "title": "Analysing Discrete Self Supervised Speech Representation for Spoken  Language Modeling",
    "abstract": " Comments: Accepted at ICASSP 2023 ",
    "url": "https://arxiv.org/abs/2301.00591",
    "authors": [
      "Amitay Sicherman",
      "Yossi Adi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2301.00858",
    "title": "Robust Average-Reward Markov Decision Processes",
    "abstract": " Comments: AAAI 2023 ",
    "url": "https://arxiv.org/abs/2301.00858",
    "authors": [
      "Yue Wang",
      "Alvaro Velasquez",
      "George Atia",
      "Ashley Prater-Bennette",
      "Shaofeng Zou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.01970",
    "title": "CAT: LoCalization and IdentificAtion Cascade Detection Transformer for  Open-World Object Detection",
    "abstract": " Title: CAT: LoCalization and IdentificAtion Cascade Detection Transformer for  Open-World Object Detection ",
    "url": "https://arxiv.org/abs/2301.01970",
    "authors": [
      "Shuailei Ma",
      "Yuefeng Wang",
      "Jiaqi Fan",
      "Ying Wei",
      "Thomas H. Li",
      "Hongli Liu",
      "Fanbing Lv"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.08771",
    "title": "Matching Exemplar as Next Sentence Prediction (MeNSP): Zero-shot Prompt  Learning for Automatic Scoring in Science Education",
    "abstract": " Comments: 10+3 pages ",
    "url": "https://arxiv.org/abs/2301.08771",
    "authors": [
      "Xuansheng Wu",
      "Xinyu He",
      "Tianming Li",
      "Ninghao Liu",
      "Xiaoming Zhai"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.09617",
    "title": "Fully transformer-based biomarker prediction from colorectal cancer  histology: a large-scale multicentric study",
    "abstract": " Comments: Updated Figure 2 and Table A.5 ",
    "url": "https://arxiv.org/abs/2301.09617",
    "authors": [
      "Sophia J. Wagner",
      "Daniel Reisenbüchler",
      "Nicholas P. West",
      "Jan Moritz Niehues",
      "Gregory Patrick Veldhuizen",
      "Philip Quirke",
      "Heike I. Grabsch",
      "Piet A. van den Brandt",
      "Gordon G. A. Hutchins",
      "Susan D. Richman",
      "Tanwei Yuan",
      "Rupert Langer",
      "Josien Christina Anna Jenniskens",
      "Kelly Offermans",
      "Wolfram Mueller",
      "Richard Gray",
      "Stephen B. Gruber",
      "Joel K. Greenson",
      "Gad Rennert",
      "Joseph D. Bonner",
      "Daniel Schmolze",
      "Jacqueline A. James",
      "Maurice B. Loughrey",
      "Manuel Salto-Tellez",
      "Hermann Brenner",
      "Michael Hoffmeister",
      "Daniel Truhn",
      "Julia A. Schnabel",
      "Melanie Boxberg",
      "Tingying Peng",
      "Jakob Nikolas Kather"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.13473",
    "title": "CRC-RL: A Novel Visual Feature Representation Architecture for  Unsupervised Reinforcement Learning",
    "abstract": " Title: CRC-RL: A Novel Visual Feature Representation Architecture for  Unsupervised Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2301.13473",
    "authors": [
      "Darshita Jain",
      "Anima Majumder",
      "Samrat Dutta",
      "Swagat Kumar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.03459",
    "title": "On the relationship between multivariate splines and infinitely-wide  neural networks",
    "abstract": " Title: On the relationship between multivariate splines and infinitely-wide  neural networks ",
    "url": "https://arxiv.org/abs/2302.03459",
    "authors": [
      "Francis Bach"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.08639",
    "title": "Improving Transformer-based Networks With Locality For Automatic Speaker  Verification",
    "abstract": " Comments: Accepted to ICASSP 2023 ",
    "url": "https://arxiv.org/abs/2302.08639",
    "authors": [
      "Mufan Sang",
      "Yong Zhao",
      "Gang Liu",
      "John H.L. Hansen",
      "Jian Wu"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2302.10747",
    "title": "Clustered Data Sharing for Non-IID Federated Learning over Wireless  Networks",
    "abstract": " Title: Clustered Data Sharing for Non-IID Federated Learning over Wireless  Networks ",
    "url": "https://arxiv.org/abs/2302.10747",
    "authors": [
      "Gang Hu",
      "Yinglei Teng",
      "Nan Wang",
      "F. Richard Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2302.12000",
    "title": "Graph Construction using Principal Axis Trees for Simple Graph  Convolution",
    "abstract": " Title: Graph Construction using Principal Axis Trees for Simple Graph  Convolution ",
    "url": "https://arxiv.org/abs/2302.12000",
    "authors": [
      "Mashaan Alshammari",
      "John Stavrakakis",
      "Adel F. Ahmed",
      "Masahiro Takatsuka"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2302.12597",
    "title": "Active Velocity Estimation using Light Curtains via Self-Supervised  Multi-Armed Bandits",
    "abstract": " Comments: 9 pages (main paper), 3 pages (references), 9 pages (appendix) ",
    "url": "https://arxiv.org/abs/2302.12597",
    "authors": [
      "Siddharth Ancha",
      "Gaurav Pathak",
      "Ji Zhang",
      "Srinivasa Narasimhan",
      "David Held"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.12840",
    "title": "HULAT at SemEval-2023 Task 10: Data augmentation for pre-trained  transformers applied to the detection of sexism in social media",
    "abstract": " Comments: The experiments are not reproducible because I did not use a seed for replicability ",
    "url": "https://arxiv.org/abs/2302.12840",
    "authors": [
      "Isabel Segura-Bedmar"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2302.13259",
    "title": "Dodging the Double Descent in Deep Neural Networks",
    "abstract": " Title: Dodging the Double Descent in Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2302.13259",
    "authors": [
      "Victor Quétu",
      "Enzo Tartaglione"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.14340",
    "title": "HelixSurf: A Robust and Efficient Neural Implicit Surface Learning of  Indoor Scenes with Iterative Intertwined Regularization",
    "abstract": " Title: HelixSurf: A Robust and Efficient Neural Implicit Surface Learning of  Indoor Scenes with Iterative Intertwined Regularization ",
    "url": "https://arxiv.org/abs/2302.14340",
    "authors": [
      "Zhihao Liang",
      "Zhangjin Huang",
      "Changxing Ding",
      "Kui Jia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.14348",
    "title": "Im2Hands: Learning Attentive Implicit Representation of Interacting  Two-Hand Shapes",
    "abstract": " Comments: 6 figures, 14 pages, accepted to CVPR 2023, project page: this https URL ",
    "url": "https://arxiv.org/abs/2302.14348",
    "authors": [
      "Jihyun Lee",
      "Minhyuk Sung",
      "Honggyu Choi",
      "Tae-Kyun Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.14498",
    "title": "Effective Community Search on Large Attributed Bipartite Graphs",
    "abstract": " Title: Effective Community Search on Large Attributed Bipartite Graphs ",
    "url": "https://arxiv.org/abs/2302.14498",
    "authors": [
      "Zongyu Xu",
      "Yihao Zhang",
      "Long Yuan",
      "Yuwen Qian",
      "Zi Chen",
      "Mingliang Zhou",
      "Qin Mao",
      "Weibin Pan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Databases (cs.DB)"
    ]
  }
]