[
  {
    "id": "arXiv:2309.00007",
    "title": "When Measures are Unreliable: Imperceptible Adversarial Perturbations  toward Top-$k$ Multi-Label Learning",
    "abstract": "With the great success of deep neural networks, adversarial learning has received widespread attention in various studies, ranging from multi-class learning to multi-label learning. However, existing adversarial attacks toward multi-label learning only pursue the traditional visual imperceptibility but ignore the new perceptible problem coming from measures such as Precision@$k$ and mAP@$k$. Specifically, when a well-trained multi-label classifier performs far below the expectation on some samples, the victim can easily realize that this performance degeneration stems from attack, rather than the model itself. Therefore, an ideal multi-labeling adversarial attack should manage to not only deceive visual perception but also evade monitoring of measures. To this end, this paper first proposes the concept of measure imperceptibility. Then, a novel loss function is devised to generate such adversarial perturbations that could achieve both visual and measure imperceptibility. Furthermore, an efficient algorithm, which enjoys a convex objective, is established to optimize this objective. Finally, extensive experiments on large-scale benchmark datasets, such as PASCAL VOC 2012, MS COCO, and NUS WIDE, demonstrate the superiority of our proposed method in attacking the top-$k$ multi-label systems. ",
    "url": "https://arxiv.org/abs/2309.00007",
    "authors": [
      "Yuchen Sun",
      "Qianqian Xu",
      "Zitai Wang",
      "Qingming Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.00013",
    "title": "Model Inversion Attack via Dynamic Memory Learning",
    "abstract": "Model Inversion (MI) attacks aim to recover the private training data from the target model, which has raised security concerns about the deployment of DNNs in practice. Recent advances in generative adversarial models have rendered them particularly effective in MI attacks, primarily due to their ability to generate high-fidelity and perceptually realistic images that closely resemble the target data. In this work, we propose a novel Dynamic Memory Model Inversion Attack (DMMIA) to leverage historically learned knowledge, which interacts with samples (during the training) to induce diverse generations. DMMIA constructs two types of prototypes to inject the information about historically learned knowledge: Intra-class Multicentric Representation (IMR) representing target-related concepts by multiple learnable prototypes, and Inter-class Discriminative Representation (IDR) characterizing the memorized samples as learned prototypes to capture more privacy-related information. As a result, our DMMIA has a more informative representation, which brings more diverse and discriminative generated results. Experiments on multiple benchmarks show that DMMIA performs better than state-of-the-art MI attack methods. ",
    "url": "https://arxiv.org/abs/2309.00013",
    "authors": [
      "Gege Qi",
      "YueFeng Chen",
      "Xiaofeng Mao",
      "Binyuan Hui",
      "Xiaodan Li",
      "Rong Zhang",
      "Hui Xue"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00014",
    "title": "Improving NeRF Quality by Progressive Camera Placement for Unrestricted  Navigation in Complex Environments",
    "abstract": "Neural Radiance Fields, or NeRFs, have drastically improved novel view synthesis and 3D reconstruction for rendering. NeRFs achieve impressive results on object-centric reconstructions, but the quality of novel view synthesis with free-viewpoint navigation in complex environments (rooms, houses, etc) is often problematic. While algorithmic improvements play an important role in the resulting quality of novel view synthesis, in this work, we show that because optimizing a NeRF is inherently a data-driven process, good quality data play a fundamental role in the final quality of the reconstruction. As a consequence, it is critical to choose the data samples -- in this case the cameras -- in a way that will eventually allow the optimization to converge to a solution that allows free-viewpoint navigation with good quality. Our main contribution is an algorithm that efficiently proposes new camera placements that improve visual quality with minimal assumptions. Our solution can be used with any NeRF model and outperforms baselines and similar work. ",
    "url": "https://arxiv.org/abs/2309.00014",
    "authors": [
      "Georgios Kopanas",
      "George Drettakis"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2309.00024",
    "title": "Efficient Multi-View Graph Clustering with Local and Global Structure  Preservation",
    "abstract": "Anchor-based multi-view graph clustering (AMVGC) has received abundant attention owing to its high efficiency and the capability to capture complementary structural information across multiple views. Intuitively, a high-quality anchor graph plays an essential role in the success of AMVGC. However, the existing AMVGC methods only consider single-structure information, i.e., local or global structure, which provides insufficient information for the learning task. To be specific, the over-scattered global structure leads to learned anchors failing to depict the cluster partition well. In contrast, the local structure with an improper similarity measure results in potentially inaccurate anchor assignment, ultimately leading to sub-optimal clustering performance. To tackle the issue, we propose a novel anchor-based multi-view graph clustering framework termed Efficient Multi-View Graph Clustering with Local and Global Structure Preservation (EMVGC-LG). Specifically, a unified framework with a theoretical guarantee is designed to capture local and global information. Besides, EMVGC-LG jointly optimizes anchor construction and graph learning to enhance the clustering quality. In addition, EMVGC-LG inherits the linear complexity of existing AMVGC methods respecting the sample number, which is time-economical and scales well with the data size. Extensive experiments demonstrate the effectiveness and efficiency of our proposed method. ",
    "url": "https://arxiv.org/abs/2309.00024",
    "authors": [
      "Yi Wen",
      "Suyuan Liu",
      "Xinhang Wan",
      "Siwei Wang",
      "Ke Liang",
      "Xinwang Liu",
      "Xihong Yang",
      "Pei Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.00032",
    "title": "Blockchain Based Open Network in Technology Intermediation",
    "abstract": "Blockchain technology is developing using in reliable applications which can be designed to achieve decentralization and trustless. Based on the open network innovation theory, this paper proposes a technical intermediary management idea based on blockchain technology to improve the efficiency of technology intermediaries, providing accurate, reliable information and cutting cost for the market. This study demonstrates the advantage of blockchain to technology intermediaries. First, on a specific level, it can provide openness, transparency, decentralization and anonymity services. Second, the current industrial innovation elements are analyzed. blockchain improve the efficiency of technology intermediary, prevent risks and to make up for the shortcomings of traditional intermediaries. It has revolutionized the traditional technology intermediary. As this happens, it can revolutionize traditional technology intermediaries. ",
    "url": "https://arxiv.org/abs/2309.00032",
    "authors": [
      "Yang Yue",
      "Joseph Z. Shyu"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2309.00059",
    "title": "STint: Self-supervised Temporal Interpolation for Geospatial Data",
    "abstract": "Supervised and unsupervised techniques have demonstrated the potential for temporal interpolation of video data. Nevertheless, most prevailing temporal interpolation techniques hinge on optical flow, which encodes the motion of pixels between video frames. On the other hand, geospatial data exhibits lower temporal resolution while encompassing a spectrum of movements and deformations that challenge several assumptions inherent to optical flow. In this work, we propose an unsupervised temporal interpolation technique, which does not rely on ground truth data or require any motion information like optical flow, thus offering a promising alternative for better generalization across geospatial domains. Specifically, we introduce a self-supervised technique of dual cycle consistency. Our proposed technique incorporates multiple cycle consistency losses, which result from interpolating two frames between consecutive input frames through a series of stages. This dual cycle consistent constraint causes the model to produce intermediate frames in a self-supervised manner. To the best of our knowledge, this is the first attempt at unsupervised temporal interpolation without the explicit use of optical flow. Our experimental evaluations across diverse geospatial datasets show that STint significantly outperforms existing state-of-the-art methods for unsupervised temporal interpolation. ",
    "url": "https://arxiv.org/abs/2309.00059",
    "authors": [
      "Nidhin Harilal",
      "Bri-Mathias Hodge",
      "Aneesh Subramanian",
      "Claire Monteleoni"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2309.00088",
    "title": "Deep Semi-Supervised Anomaly Detection for Finding Fraud in the Futures  Market",
    "abstract": "Modern financial electronic exchanges are an exciting and fast-paced marketplace where billions of dollars change hands every day. They are also rife with manipulation and fraud. Detecting such activity is a major undertaking, which has historically been a job reserved exclusively for humans. Recently, more research and resources have been focused on automating these processes via machine learning and artificial intelligence. Fraud detection is overwhelmingly associated with the greater field of anomaly detection, which is usually performed via unsupervised learning techniques because of the lack of labeled data needed for supervised learning. However, a small quantity of labeled data does often exist. This research article aims to evaluate the efficacy of a deep semi-supervised anomaly detection technique, called Deep SAD, for detecting fraud in high-frequency financial data. We use exclusive proprietary limit order book data from the TMX exchange in Montr\\'eal, with a small set of true labeled instances of fraud, to evaluate Deep SAD against its unsupervised predecessor. We show that incorporating a small amount of labeled data into an unsupervised anomaly detection framework can greatly improve its accuracy. ",
    "url": "https://arxiv.org/abs/2309.00088",
    "authors": [
      "Timothy DeLise"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Risk Management (q-fin.RM)"
    ]
  },
  {
    "id": "arXiv:2309.00108",
    "title": "Laplacian-Former: Overcoming the Limitations of Vision Transformers in  Local Texture Detection",
    "abstract": "Vision Transformer (ViT) models have demonstrated a breakthrough in a wide range of computer vision tasks. However, compared to the Convolutional Neural Network (CNN) models, it has been observed that the ViT models struggle to capture high-frequency components of images, which can limit their ability to detect local textures and edge information. As abnormalities in human tissue, such as tumors and lesions, may greatly vary in structure, texture, and shape, high-frequency information such as texture is crucial for effective semantic segmentation tasks. To address this limitation in ViT models, we propose a new technique, Laplacian-Former, that enhances the self-attention map by adaptively re-calibrating the frequency information in a Laplacian pyramid. More specifically, our proposed method utilizes a dual attention mechanism via efficient attention and frequency attention while the efficient attention mechanism reduces the complexity of self-attention to linear while producing the same output, selectively intensifying the contribution of shape and texture features. Furthermore, we introduce a novel efficient enhancement multi-scale bridge that effectively transfers spatial information from the encoder to the decoder while preserving the fundamental features. We demonstrate the efficacy of Laplacian-former on multi-organ and skin lesion segmentation tasks with +1.87\\% and +0.76\\% dice scores compared to SOTA approaches, respectively. Our implementation is publically available at https://github.com/mindflow-institue/Laplacian-Former ",
    "url": "https://arxiv.org/abs/2309.00108",
    "authors": [
      "Reza Azad",
      "Amirhossein Kazerouni",
      "Babak Azad",
      "Ehsan Khodapanah Aghdam",
      "Yury Velichko",
      "Ulas Bagci",
      "Dorit Merhof"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00126",
    "title": "QS-TTS: Towards Semi-Supervised Text-to-Speech Synthesis via  Vector-Quantized Self-Supervised Speech Representation Learning",
    "abstract": "This paper proposes a novel semi-supervised TTS framework, QS-TTS, to improve TTS quality with lower supervised data requirements via Vector-Quantized Self-Supervised Speech Representation Learning (VQ-S3RL) utilizing more unlabeled speech audio. This framework comprises two VQ-S3R learners: first, the principal learner aims to provide a generative Multi-Stage Multi-Codebook (MSMC) VQ-S3R via the MSMC-VQ-GAN combined with the contrastive S3RL, while decoding it back to the high-quality audio; then, the associate learner further abstracts the MSMC representation into a highly-compact VQ representation through a VQ-VAE. These two generative VQ-S3R learners provide profitable speech representations and pre-trained models for TTS, significantly improving synthesis quality with the lower requirement for supervised data. QS-TTS is evaluated comprehensively under various scenarios via subjective and objective tests in experiments. The results powerfully demonstrate the superior performance of QS-TTS, winning the highest MOS over supervised or semi-supervised baseline TTS approaches, especially in low-resource scenarios. Moreover, comparing various speech representations and transfer learning methods in TTS further validates the notable improvement of the proposed VQ-S3RL to TTS, showing the best audio quality and intelligibility metrics. The trend of slower decay in the synthesis quality of QS-TTS with decreasing supervised data further highlights its lower requirements for supervised data, indicating its great potential in low-resource scenarios. ",
    "url": "https://arxiv.org/abs/2309.00126",
    "authors": [
      "Haohan Guo",
      "Fenglong Xie",
      "Jiawen Kang",
      "Yujia Xiao",
      "Xixin Wu",
      "Helen Meng"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2309.00127",
    "title": "FTA: Stealthy and Robust Backdoor Attack with Flexible Trigger on  Federated Learning",
    "abstract": "Current backdoor attacks against federated learning (FL) strongly rely on universal triggers or semantic patterns, which can be easily detected and filtered by certain defense mechanisms such as norm clipping, comparing parameter divergences among local updates. In this work, we propose a new stealthy and robust backdoor attack with flexible triggers against FL defenses. To achieve this, we build a generative trigger function that can learn to manipulate the benign samples with an imperceptible flexible trigger pattern and simultaneously make the trigger pattern include the most significant hidden features of the attacker-chosen label. Moreover, our trigger generator can keep learning and adapt across different rounds, allowing it to adjust to changes in the global model. By filling the distinguishable difference (the mapping between the trigger pattern and target label), we make our attack naturally stealthy. Extensive experiments on real-world datasets verify the effectiveness and stealthiness of our attack compared to prior attacks on decentralized learning framework with eight well-studied defenses. ",
    "url": "https://arxiv.org/abs/2309.00127",
    "authors": [
      "Yanqi Qiao",
      "Congwen Chen",
      "Rui Wang",
      "Kaitai Liang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2309.00133",
    "title": "Distraction-free Embeddings for Robust VQA",
    "abstract": "The generation of effective latent representations and their subsequent refinement to incorporate precise information is an essential prerequisite for Vision-Language Understanding (VLU) tasks such as Video Question Answering (VQA). However, most existing methods for VLU focus on sparsely sampling or fine-graining the input information (e.g., sampling a sparse set of frames or text tokens), or adding external knowledge. We present a novel \"DRAX: Distraction Removal and Attended Cross-Alignment\" method to rid our cross-modal representations of distractors in the latent space. We do not exclusively confine the perception of any input information from various modalities but instead use an attention-guided distraction removal method to increase focus on task-relevant information in latent embeddings. DRAX also ensures semantic alignment of embeddings during cross-modal fusions. We evaluate our approach on a challenging benchmark (SUTD-TrafficQA dataset), testing the framework's abilities for feature and event queries, temporal relation understanding, forecasting, hypothesis, and causal analysis through extensive experiments. ",
    "url": "https://arxiv.org/abs/2309.00133",
    "authors": [
      "Atharvan Dogra",
      "Deeksha Varshney",
      "Ashwin Kalyan",
      "Ameet Deshpande",
      "Neeraj Kumar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00143",
    "title": "Self-supervised Semantic Segmentation: Consistency over Transformation",
    "abstract": "Accurate medical image segmentation is of utmost importance for enabling automated clinical decision procedures. However, prevailing supervised deep learning approaches for medical image segmentation encounter significant challenges due to their heavy dependence on extensive labeled training data. To tackle this issue, we propose a novel self-supervised algorithm, \\textbf{S$^3$-Net}, which integrates a robust framework based on the proposed Inception Large Kernel Attention (I-LKA) modules. This architectural enhancement makes it possible to comprehensively capture contextual information while preserving local intricacies, thereby enabling precise semantic segmentation. Furthermore, considering that lesions in medical images often exhibit deformations, we leverage deformable convolution as an integral component to effectively capture and delineate lesion deformations for superior object boundary definition. Additionally, our self-supervised strategy emphasizes the acquisition of invariance to affine transformations, which is commonly encountered in medical scenarios. This emphasis on robustness with respect to geometric distortions significantly enhances the model's ability to accurately model and handle such distortions. To enforce spatial consistency and promote the grouping of spatially connected image pixels with similar feature representations, we introduce a spatial consistency loss term. This aids the network in effectively capturing the relationships among neighboring pixels and enhancing the overall segmentation quality. The S$^3$-Net approach iteratively learns pixel-level feature representations for image content clustering in an end-to-end manner. Our experimental results on skin lesion and lung organ segmentation tasks show the superior performance of our method compared to the SOTA approaches. https://github.com/mindflow-institue/SSCT ",
    "url": "https://arxiv.org/abs/2309.00143",
    "authors": [
      "Sanaz Karimijafarbigloo",
      "Reza Azad",
      "Amirhossein Kazerouni",
      "Yury Velichko",
      "Ulas Bagci",
      "Dorit Merhof"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00144",
    "title": "Multi Agent DeepRL based Joint Power and Subchannel Allocation in IAB  networks",
    "abstract": "Integrated Access and Backhauling (IAB) is a viable approach for meeting the unprecedented need for higher data rates of future generations, acting as a cost-effective alternative to dense fiber-wired links. The design of such networks with constraints usually results in an optimization problem of non-convex and combinatorial nature. Under those situations, it is challenging to obtain an optimal strategy for the joint Subchannel Allocation and Power Allocation (SAPA) problem. In this paper, we develop a multi-agent Deep Reinforcement Learning (DeepRL) based framework for joint optimization of power and subchannel allocation in an IAB network to maximize the downlink data rate. SAPA using DDQN (Double Deep Q-Learning Network) can handle computationally expensive problems with huge action spaces associated with multiple users and nodes. Unlike the conventional methods such as game theory, fractional programming, and convex optimization, which in practice demand more and more accurate network information, the multi-agent DeepRL approach requires less environment network information. Simulation results show the proposed scheme's promising performance when compared with baseline (Deep Q-Learning Network and Random) schemes. ",
    "url": "https://arxiv.org/abs/2309.00144",
    "authors": [
      "Lakshya Jagadish",
      "Banashree Sarma",
      "R. Manivasakan"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.00160",
    "title": "A Task-Interdependency Model of Complex Collaboration Towards  Human-Centered Crowd Work",
    "abstract": "Models of crowdsourcing and human computation often assume that individuals independently carry out small, modular tasks. However, while these models have successfully shown how crowds can accomplish significant objectives, they can inadvertently advance a less than human view of crowd workers and fail to capture the unique human capacity for complex collaborative work. We present a model centered on interdependencies -- a phenomenon well understood to be at the core of collaboration -- that allows one to formally reason about diverse challenges to complex collaboration. Our model represents tasks as an interdependent collection of subtasks, formalized as a task graph. We use it to explain challenges to scaling complex collaborative work, underscore the importance of expert workers, reveal critical factors for learning on the job, and explore the relationship between coordination intensity and occupational wages. Using data from O*NET and the Bureau of Labor Statistics, we introduce an index of occupational coordination intensity to validate our theoretical predictions. We present preliminary evidence that occupations with greater coordination intensity are less exposed to displacement by AI, and discuss opportunities for models that emphasize the collaborative capacities of human workers, bridge models of crowd work and traditional work, and promote AI in roles augmenting human collaboration. ",
    "url": "https://arxiv.org/abs/2309.00160",
    "authors": [
      "David T. Lee",
      "Christos A. Makridis"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Multiagent Systems (cs.MA)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2309.00168",
    "title": "Pose-Graph Attentional Graph Neural Network for Lidar Place Recognition",
    "abstract": "This paper proposes a lidar place recognition approach, called P-GAT, to increase the receptive field between point clouds captured over time. Instead of comparing pairs of point clouds, we compare the similarity between sets of point clouds to use the maximum spatial and temporal information between neighbour clouds utilising the concept of pose-graph SLAM. Leveraging intra- and inter-attention and graph neural network, P-GAT relates point clouds captured in nearby locations in Euclidean space and their embeddings in feature space. Experimental results on the large-scale publically available datasets demonstrate the effectiveness of our approach in recognising scenes lacking distinct features and when training and testing environments have different distributions (domain adaptation). Further, an exhaustive comparison with the state-of-the-art shows improvements in performance gains. Code will be available upon acceptance. ",
    "url": "https://arxiv.org/abs/2309.00168",
    "authors": [
      "Milad Ramezani",
      "Liang Wang",
      "Joshua Knights",
      "Zhibin Li",
      "Pauline Pounds",
      "Peyman Moghadam"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.00174",
    "title": "Typing on Any Surface: A Deep Learning-based Method for Real-Time  Keystroke Detection in Augmented Reality",
    "abstract": "Frustrating text entry interface has been a major obstacle in participating in social activities in augmented reality (AR). Popular options, such as mid-air keyboard interface, wireless keyboards or voice input, either suffer from poor ergonomic design, limited accuracy, or are simply embarrassing to use in public. This paper proposes and validates a deep-learning based approach, that enables AR applications to accurately predict keystrokes from the user perspective RGB video stream that can be captured by any AR headset. This enables a user to perform typing activities on any flat surface and eliminates the need of a physical or virtual keyboard. A two-stage model, combing an off-the-shelf hand landmark extractor and a novel adaptive Convolutional Recurrent Neural Network (C-RNN), was trained using our newly built dataset. The final model was capable of adaptive processing user-perspective video streams at ~32 FPS. This base model achieved an overall accuracy of $91.05\\%$ when typing 40 Words per Minute (wpm), which is how fast an average person types with two hands on a physical keyboard. The Normalised Levenshtein Distance also further confirmed the real-world applicability of that our approach. The promising results highlight the viability of our approach and the potential for our method to be integrated into various applications. We also discussed the limitations and future research required to bring such technique into a production system. ",
    "url": "https://arxiv.org/abs/2309.00174",
    "authors": [
      "Xingyu Fu",
      "Mingze Xi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2309.00178",
    "title": "Will Sentiment Analysis Need Subculture? A New Data Augmentation  Approach",
    "abstract": "The renowned proverb that \"The pen is mightier than the sword\" underscores the formidable influence wielded by text expressions in shaping sentiments. Indeed, well-crafted written can deeply resonate within cultures, conveying profound sentiments. Nowadays, the omnipresence of the Internet has fostered a subculture that congregates around the contemporary milieu. The subculture artfully articulates the intricacies of human feelings by ardently pursuing the allure of novelty, a fact that cannot be disregarded in the sentiment analysis. This paper strives to enrich data through the lens of subculture, to address the insufficient training data faced by sentiment analysis. To this end, a new approach of subculture-based data augmentation (SCDA) is proposed, which engenders six enhanced texts for each training text by leveraging the creation of six diverse subculture expression generators. The extensive experiments attest to the effectiveness and potential of SCDA. The results also shed light on the phenomenon that disparate subculture expressions elicit varying degrees of sentiment stimulation. Moreover, an intriguing conjecture arises, suggesting the linear reversibility of certain subculture expressions. It is our fervent aspiration that this study serves as a catalyst in fostering heightened perceptiveness towards the tapestry of information, sentiment and culture, thereby enriching our collective understanding. ",
    "url": "https://arxiv.org/abs/2309.00178",
    "authors": [
      "Zhenhua Wang",
      "Simin He",
      "Guang Xu",
      "Ming Ren"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2309.00184",
    "title": "A Survey of Network Requirements for Enabling Effective Cyber Deception",
    "abstract": "In the evolving landscape of cybersecurity, the utilization of cyber deception has gained prominence as a proactive defense strategy against sophisticated attacks. This paper presents a comprehensive survey that investigates the crucial network requirements essential for the successful implementation of effective cyber deception techniques. With a focus on diverse network architectures and topologies, we delve into the intricate relationship between network characteristics and the deployment of deception mechanisms. This survey provides an in-depth analysis of prevailing cyber deception frameworks, highlighting their strengths and limitations in meeting the requirements for optimal efficacy. By synthesizing insights from both theoretical and practical perspectives, we contribute to a comprehensive understanding of the network prerequisites crucial for enabling robust and adaptable cyber deception strategies. ",
    "url": "https://arxiv.org/abs/2309.00184",
    "authors": [
      "Md Abu Sayed",
      "Moqsadur Rahman",
      "Mohammad Ariful Islam Khan",
      "Deepak Tosh"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2309.00206",
    "title": "Gap and Overlap Detection in Automated Fiber Placement",
    "abstract": "The identification and correction of manufacturing defects, particularly gaps and overlaps, are crucial for ensuring high-quality composite parts produced through Automated Fiber Placement (AFP). These imperfections are the most commonly observed issues that can significantly impact the overall quality of the composite parts. Manual inspection is both time-consuming and labor-intensive, making it an inefficient approach. To overcome this challenge, the implementation of an automated defect detection system serves as the optimal solution. In this paper, we introduce a novel method that uses an Optical Coherence Tomography (OCT) sensor and computer vision techniques to detect and locate gaps and overlaps in composite parts. Our approach involves generating a depth map image of the composite surface that highlights the elevation of composite tapes (or tows) on the surface. By detecting the boundaries of each tow, our algorithm can compare consecutive tows and identify gaps or overlaps that may exist between them. Any gaps or overlaps exceeding a predefined tolerance threshold are considered manufacturing defects. To evaluate the performance of our approach, we compare the detected defects with the ground truth annotated by experts. The results demonstrate a high level of accuracy and efficiency in gap and overlap segmentation. ",
    "url": "https://arxiv.org/abs/2309.00206",
    "authors": [
      "Assef Ghamisi",
      "Homayoun Najjaran"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2309.00236",
    "title": "Image Hijacking: Adversarial Images can Control Generative Models at  Runtime",
    "abstract": "Are foundation models secure from malicious actors? In this work, we focus on the image input to a vision-language model (VLM). We discover image hijacks, adversarial images that control generative models at runtime. We introduce Behavior Matching, a general method for creating image hijacks, and we use it to explore three types of attacks. Specific string attacks generate arbitrary output of the adversary's choosing. Leak context attacks leak information from the context window into the output. Jailbreak attacks circumvent a model's safety training. We study these attacks against LLaVA-2, a state-of-the-art VLM based on CLIP and LLaMA-2, and find that all our attack types have above a 90\\% success rate. Moreover, our attacks are automated and require only small image perturbations. These findings raise serious concerns about the security of foundation models. If image hijacks are as difficult to defend against as adversarial examples in CIFAR-10, then it might be many years before a solution is found -- if it even exists. ",
    "url": "https://arxiv.org/abs/2309.00236",
    "authors": [
      "Luke Bailey",
      "Euan Ong",
      "Stuart Russell",
      "Scott Emmons"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2309.00238",
    "title": "ALJP: An Arabic Legal Judgment Prediction in Personal Status Cases Using  Machine Learning Models",
    "abstract": "Legal Judgment Prediction (LJP) aims to predict judgment outcomes based on case description. Several researchers have developed techniques to assist potential clients by predicting the outcome in the legal profession. However, none of the proposed techniques were implemented in Arabic, and only a few attempts were implemented in English, Chinese, and Hindi. In this paper, we develop a system that utilizes deep learning (DL) and natural language processing (NLP) techniques to predict the judgment outcome from Arabic case scripts, especially in cases of custody and annulment of marriage. This system will assist judges and attorneys in improving their work and time efficiency while reducing sentencing disparity. In addition, it will help litigants, lawyers, and law students analyze the probable outcomes of any given case before trial. We use a different machine and deep learning models such as Support Vector Machine (SVM), Logistic regression (LR), Long Short Term Memory (LSTM), and Bidirectional Long Short-Term Memory (BiLSTM) using representation techniques such as TF-IDF and word2vec on the developed dataset. Experimental results demonstrate that compared with the five baseline methods, the SVM model with word2vec and LR with TF-IDF achieve the highest accuracy of 88% and 78% in predicting the judgment on custody cases and annulment of marriage, respectively. Furthermore, the LR and SVM with word2vec and BiLSTM model with TF-IDF achieved the highest accuracy of 88% and 69% in predicting the probability of outcomes on custody cases and annulment of marriage, respectively. ",
    "url": "https://arxiv.org/abs/2309.00238",
    "authors": [
      "Salwa Abbara",
      "Mona Hafez",
      "Aya Kazzaz",
      "Areej Alhothali",
      "Alhanouf Alsolami"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2309.00245",
    "title": "City electric power consumption forecasting based on big data & neural  network under smart grid background",
    "abstract": "With the development of the electric power system, the smart grid has become an important part of the smart city. The rational transmission of electric energy and the guarantee of power supply of the smart grid are very important to smart cities, smart cities can provide better services through smart grids. Among them, predicting and judging city electric power consumption is closely related to electricity supply and regulation, the location of power plants, and the control of electricity transmission losses. Based on big data, this paper establishes a neural network and considers the influence of various nonlinear factors on city electric power consumption. A model is established to realize the prediction of power consumption. Based on the permutation importance test, an evaluation model of the influencing factors of city electric power consumption is constructed to obtain the core characteristic values of city electric power consumption prediction, which can provide an important reference for electric power related industry. ",
    "url": "https://arxiv.org/abs/2309.00245",
    "authors": [
      "Zhengxian Chen",
      "Maowei Wang",
      "Conghu Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.00251",
    "title": "Optimal Repair Strategy Against Advanced Persistent Threats Under  Time-Varying Networks",
    "abstract": "Advanced persistent threat (APT) is a kind of stealthy, sophisticated, and long-term cyberattack that has brought severe financial losses and critical infrastructure damages. Existing works mainly focus on APT defense under stable network topologies, while the problem under time-varying dynamic networks (e.g., vehicular networks) remains unexplored, which motivates our work. Besides, the spatiotemporal dynamics in defense resources, complex attackers' lateral movement behaviors, and lack of timely defense make APT defense a challenging issue under time-varying networks. In this paper, we propose a novel game-theoretical APT defense approach to promote real-time and optimal defense strategy-making under both periodic time-varying and general time-varying environments. Specifically, we first model the interactions between attackers and defenders in an APT process as a dynamic APT repair game, and then formulate the APT damage minimization problem as the precise prevention and control (PPAC) problem. To derive the optimal defense strategy under both latency and defense resource constraints, we further devise an online optimal control-based mechanism integrated with two backtracking-forward algorithms to fastly derive the near-optimal solution of the PPAC problem in real time. Extensive experiments are carried out, and the results demonstrate that our proposed scheme can efficiently obtain optimal defense strategy in 54481 ms under seven attack-defense interactions with 9.64$\\%$ resource occupancy in stimulated periodic time-varying and general time-varying networks. Besides, even under static networks, our proposed scheme still outperforms existing representative APT defense approaches in terms of service stability and defense resource utilization. ",
    "url": "https://arxiv.org/abs/2309.00251",
    "authors": [
      "Zixuan Wang",
      "Jiliang Li",
      "Yuntao Wang",
      "Zhou Su",
      "Shui Yu",
      "Weizhi Meng"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2309.00254",
    "title": "Why do universal adversarial attacks work on large language models?:  Geometry might be the answer",
    "abstract": "Transformer based large language models with emergent capabilities are becoming increasingly ubiquitous in society. However, the task of understanding and interpreting their internal workings, in the context of adversarial attacks, remains largely unsolved. Gradient-based universal adversarial attacks have been shown to be highly effective on large language models and potentially dangerous due to their input-agnostic nature. This work presents a novel geometric perspective explaining universal adversarial attacks on large language models. By attacking the 117M parameter GPT-2 model, we find evidence indicating that universal adversarial triggers could be embedding vectors which merely approximate the semantic information in their adversarial training region. This hypothesis is supported by white-box model analysis comprising dimensionality reduction and similarity measurement of hidden representations. We believe this new geometric perspective on the underlying mechanism driving universal attacks could help us gain deeper insight into the internal workings and failure modes of LLMs, thus enabling their mitigation. ",
    "url": "https://arxiv.org/abs/2309.00254",
    "authors": [
      "Varshini Subhash",
      "Anna Bialas",
      "Weiwei Pan",
      "Finale Doshi-Velez"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2309.00255",
    "title": "SortedNet, a Place for Every Network and Every Network in its Place:  Towards a Generalized Solution for Training Many-in-One Neural Networks",
    "abstract": "As the size of deep learning models continues to grow, finding optimal models under memory and computation constraints becomes increasingly more important. Although usually the architecture and constituent building blocks of neural networks allow them to be used in a modular way, their training process is not aware of this modularity. Consequently, conventional neural network training lacks the flexibility to adapt the computational load of the model during inference. This paper proposes SortedNet, a generalized and scalable solution to harness the inherent modularity of deep neural networks across various dimensions for efficient dynamic inference. Our training considers a nested architecture for the sub-models with shared parameters and trains them together with the main model in a sorted and probabilistic manner. This sorted training of sub-networks enables us to scale the number of sub-networks to hundreds using a single round of training. We utilize a novel updating scheme during training that combines random sampling of sub-networks with gradient accumulation to improve training efficiency. Furthermore, the sorted nature of our training leads to a search-free sub-network selection at inference time; and the nested architecture of the resulting sub-networks leads to minimal storage requirement and efficient switching between sub-networks at inference. Our general dynamic training approach is demonstrated across various architectures and tasks, including large language models and pre-trained vision models. Experimental results show the efficacy of the proposed approach in achieving efficient sub-networks while outperforming state-of-the-art dynamic training approaches. Our findings demonstrate the feasibility of training up to 160 different sub-models simultaneously, showcasing the extensive scalability of our proposed method while maintaining 96% of the model performance. ",
    "url": "https://arxiv.org/abs/2309.00255",
    "authors": [
      "Mojtaba Valipour",
      "Mehdi Rezagholizadeh",
      "Hossein Rajabzadeh",
      "Marzieh Tahaei",
      "Boxing Chen",
      "Ali Ghodsi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.00275",
    "title": "Technical Companion to Example-Based Procedural Modeling Using Graph  Grammars",
    "abstract": "This is a companion piece to my paper on \"Example-Based Procedural Modeling Using Graph Grammars.\" This paper examines some of the theoretical issues in more detail. This paper discusses some more complex parts of the implementation, why certain algorithmic decisions were made, proves the algorithm can solve certain classes of problems, and examines other interesting theoretical questions. ",
    "url": "https://arxiv.org/abs/2309.00275",
    "authors": [
      "Paul Merrell"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2309.00277",
    "title": "SparseSat-NeRF: Dense Depth Supervised Neural Radiance Fields for Sparse  Satellite Images",
    "abstract": "Digital surface model generation using traditional multi-view stereo matching (MVS) performs poorly over non-Lambertian surfaces, with asynchronous acquisitions, or at discontinuities. Neural radiance fields (NeRF) offer a new paradigm for reconstructing surface geometries using continuous volumetric representation. NeRF is self-supervised, does not require ground truth geometry for training, and provides an elegant way to include in its representation physical parameters about the scene, thus potentially remedying the challenging scenarios where MVS fails. However, NeRF and its variants require many views to produce convincing scene's geometries which in earth observation satellite imaging is rare. In this paper we present SparseSat-NeRF (SpS-NeRF) - an extension of Sat-NeRF adapted to sparse satellite views. SpS-NeRF employs dense depth supervision guided by crosscorrelation similarity metric provided by traditional semi-global MVS matching. We demonstrate the effectiveness of our approach on stereo and tri-stereo Pleiades 1B/WorldView-3 images, and compare against NeRF and Sat-NeRF. The code is available at https://github.com/LulinZhang/SpS-NeRF ",
    "url": "https://arxiv.org/abs/2309.00277",
    "authors": [
      "Lulin Zhang",
      "Ewelina Rupnik"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2309.00297",
    "title": "Fine-Grained Spatiotemporal Motion Alignment for Contrastive Video  Representation Learning",
    "abstract": "As the most essential property in a video, motion information is critical to a robust and generalized video representation. To inject motion dynamics, recent works have adopted frame difference as the source of motion information in video contrastive learning, considering the trade-off between quality and cost. However, existing works align motion features at the instance level, which suffers from spatial and temporal weak alignment across modalities. In this paper, we present a \\textbf{Fi}ne-grained \\textbf{M}otion \\textbf{A}lignment (FIMA) framework, capable of introducing well-aligned and significant motion information. Specifically, we first develop a dense contrastive learning framework in the spatiotemporal domain to generate pixel-level motion supervision. Then, we design a motion decoder and a foreground sampling strategy to eliminate the weak alignments in terms of time and space. Moreover, a frame-level motion contrastive loss is presented to improve the temporal diversity of the motion features. Extensive experiments demonstrate that the representations learned by FIMA possess great motion-awareness capabilities and achieve state-of-the-art or competitive results on downstream tasks across UCF101, HMDB51, and Diving48 datasets. Code is available at \\url{https://github.com/ZMHH-H/FIMA}. ",
    "url": "https://arxiv.org/abs/2309.00297",
    "authors": [
      "Minghao Zhu",
      "Xiao Lin",
      "Ronghao Dang",
      "Chengju Liu",
      "Qijun Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00305",
    "title": "Efficient Surrogate Models for Materials Science Simulations: Machine  Learning-based Prediction of Microstructure Properties",
    "abstract": "Determining, understanding, and predicting the so-called structure-property relation is an important task in many scientific disciplines, such as chemistry, biology, meteorology, physics, engineering, and materials science. Structure refers to the spatial distribution of, e.g., substances, material, or matter in general, while property is a resulting characteristic that usually depends in a non-trivial way on spatial details of the structure. Traditionally, forward simulations models have been used for such tasks. Recently, several machine learning algorithms have been applied in these scientific fields to enhance and accelerate simulation models or as surrogate models. In this work, we develop and investigate the applications of six machine learning techniques based on two different datasets from the domain of materials science: data from a two-dimensional Ising model for predicting the formation of magnetic domains and data representing the evolution of dual-phase microstructures from the Cahn-Hilliard model. We analyze the accuracy and robustness of all models and elucidate the reasons for the differences in their performances. The impact of including domain knowledge through tailored features is studied, and general recommendations based on the availability and quality of training data are derived from this. ",
    "url": "https://arxiv.org/abs/2309.00305",
    "authors": [
      "Binh Duong Nguyen",
      "Pavlo Potapenko",
      "Aytekin Dermici",
      "Kishan Govinda",
      "Stefan Sandfeld"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Materials Science (cond-mat.mtrl-sci)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00306",
    "title": "On the Aggregation of Rules for Knowledge Graph Completion",
    "abstract": "Rule learning approaches for knowledge graph completion are efficient, interpretable and competitive to purely neural models. The rule aggregation problem is concerned with finding one plausibility score for a candidate fact which was simultaneously predicted by multiple rules. Although the problem is ubiquitous, as data-driven rule learning can result in noisy and large rulesets, it is underrepresented in the literature and its theoretical foundations have not been studied before in this context. In this work, we demonstrate that existing aggregation approaches can be expressed as marginal inference operations over the predicting rules. In particular, we show that the common Max-aggregation strategy, which scores candidates based on the rule with the highest confidence, has a probabilistic interpretation. Finally, we propose an efficient and overlooked baseline which combines the previous strategies and is competitive to computationally more expensive approaches. ",
    "url": "https://arxiv.org/abs/2309.00306",
    "authors": [
      "Patrick Betz",
      "Stefan Lüdtke",
      "Christian Meilicke",
      "Heiner Stuckenschmidt"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.00314",
    "title": "ARFA: An Asymmetric Receptive Field Autoencoder Model for Spatiotemporal  Prediction",
    "abstract": "Spatiotemporal prediction aims to generate future sequences by paradigms learned from historical contexts. It holds significant importance in numerous domains, including traffic flow prediction and weather forecasting. However, existing methods face challenges in handling spatiotemporal correlations, as they commonly adopt encoder and decoder architectures with identical receptive fields, which adversely affects prediction accuracy. This paper proposes an Asymmetric Receptive Field Autoencoder (ARFA) model to address this issue. Specifically, we design corresponding sizes of receptive field modules tailored to the distinct functionalities of the encoder and decoder. In the encoder, we introduce a large kernel module for global spatiotemporal feature extraction. In the decoder, we develop a small kernel module for local spatiotemporal information reconstruction. To address the scarcity of meteorological prediction data, we constructed the RainBench, a large-scale radar echo dataset specific to the unique precipitation characteristics of inland regions in China for precipitation prediction. Experimental results demonstrate that ARFA achieves consistent state-of-the-art performance on two mainstream spatiotemporal prediction datasets and our RainBench dataset, affirming the effectiveness of our approach. This work not only explores a novel method from the perspective of receptive fields but also provides data support for precipitation prediction, thereby advancing future research in spatiotemporal prediction. ",
    "url": "https://arxiv.org/abs/2309.00314",
    "authors": [
      "Wenxuan Zhang",
      "Xuechao Zou",
      "Li Wu",
      "Jianqiang Huang",
      "Xiaoying Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00317",
    "title": "A Text-based Approach For Link Prediction on Wikipedia Articles",
    "abstract": "This paper present our work in the DSAA 2023 Challenge about Link Prediction for Wikipedia Articles. We use traditional machine learning models with POS tags (part-of-speech tags) features extracted from text to train the classification model for predicting whether two nodes has the link. Then, we use these tags to test on various machine learning models. We obtained the results by F1 score at 0.99999 and got 7th place in the competition. Our source code is publicly available at this link: https://github.com/Tam1032/DSAA2023-Challenge-Link-prediction-DS-UIT_SAT ",
    "url": "https://arxiv.org/abs/2309.00317",
    "authors": [
      "Anh Hoang Tran",
      "Tam Minh Nguyen",
      "Son T. Luu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.00320",
    "title": "Deep Segmented DMP Networks for Learning Discontinuous Motions",
    "abstract": "Discontinuous motion which is a motion composed of multiple continuous motions with sudden change in direction or velocity in between, can be seen in state-aware robotic tasks. Such robotic tasks are often coordinated with sensor information such as image. In recent years, Dynamic Movement Primitives (DMP) which is a method for generating motor behaviors suitable for robotics has garnered several deep learning based improvements to allow associations between sensor information and DMP parameters. While the implementation of deep learning framework does improve upon DMP's inability to directly associate to an input, we found that it has difficulty learning DMP parameters for complex motion which requires large number of basis functions to reconstruct. In this paper we propose a novel deep learning network architecture called Deep Segmented DMP Network (DSDNet) which generates variable-length segmented motion by utilizing the combination of multiple DMP parameters predicting network architecture, double-stage decoder network, and number of segments predictor. The proposed method is evaluated on both artificial data (object cutting & pick-and-place) and real data (object cutting) where our proposed method could achieve high generalization capability, task-achievement, and data-efficiency compared to previous method on generating discontinuous long-horizon motions. ",
    "url": "https://arxiv.org/abs/2309.00320",
    "authors": [
      "Edgar Anarossi",
      "Hirotaka Tahara",
      "Naoto Komeno",
      "Takamitsu Matsubara"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.00330",
    "title": "Multitask Deep Learning for Accurate Risk Stratification and Prediction  of Next Steps for Coronary CT Angiography Patients",
    "abstract": "Diagnostic investigation has an important role in risk stratification and clinical decision making of patients with suspected and documented Coronary Artery Disease (CAD). However, the majority of existing tools are primarily focused on the selection of gatekeeper tests, whereas only a handful of systems contain information regarding the downstream testing or treatment. We propose a multi-task deep learning model to support risk stratification and down-stream test selection for patients undergoing Coronary Computed Tomography Angiography (CCTA). The analysis included 14,021 patients who underwent CCTA between 2006 and 2017. Our novel multitask deep learning framework extends the state-of-the art Perceiver model to deal with real-world CCTA report data. Our model achieved an Area Under the receiver operating characteristic Curve (AUC) of 0.76 in CAD risk stratification, and 0.72 AUC in predicting downstream tests. Our proposed deep learning model can accurately estimate the likelihood of CAD and provide recommended downstream tests based on prior CCTA data. In clinical practice, the utilization of such an approach could bring a paradigm shift in risk stratification and downstream management. Despite significant progress using deep learning models for tabular data, they do not outperform gradient boosting decision trees, and further research is required in this area. However, neural networks appear to benefit more readily from multi-task learning than tree-based models. This could offset the shortcomings of using single task learning approach when working with tabular data. ",
    "url": "https://arxiv.org/abs/2309.00330",
    "authors": [
      "Juan Lu",
      "Mohammed Bennamoun",
      "Jonathon Stewart",
      "JasonK.Eshraghian",
      "Yanbin Liu",
      "Benjamin Chow",
      "Frank M.Sanfilippo",
      "Girish Dwivedi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2309.00331",
    "title": "Human trajectory prediction using LSTM with Attention mechanism",
    "abstract": "In this paper, we propose a human trajectory prediction model that combines a Long Short-Term Memory (LSTM) network with an attention mechanism. To do that, we use attention scores to determine which parts of the input data the model should focus on when making predictions. Attention scores are calculated for each input feature, with a higher score indicating the greater significance of that feature in predicting the output. Initially, these scores are determined for the target human position, velocity, and their neighboring individual's positions and velocities. By using attention scores, our model can prioritize the most relevant information in the input data and make more accurate predictions. We extract attention scores from our attention mechanism and integrate them into the trajectory prediction module to predict human future trajectories. To achieve this, we introduce a new neural layer that processes attention scores after extracting them and concatenates them with positional information. We evaluate our approach on the publicly available ETH and UCY datasets and measure its performance using the final displacement error (FDE) and average displacement error (ADE) metrics. We show that our modified algorithm performs better than the Social LSTM in predicting the future trajectory of pedestrians in crowded spaces. Specifically, our model achieves an improvement of 6.2% in ADE and 6.3% in FDE compared to the Social LSTM results in the literature. ",
    "url": "https://arxiv.org/abs/2309.00331",
    "authors": [
      "Amin Manafi Soltan Ahmadi",
      "Samaneh Hoseini Semnani"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.00339",
    "title": "Robust Point Cloud Processing through Positional Embedding",
    "abstract": "End-to-end trained per-point embeddings are an essential ingredient of any state-of-the-art 3D point cloud processing such as detection or alignment. Methods like PointNet, or the more recent point cloud transformer -- and its variants -- all employ learned per-point embeddings. Despite impressive performance, such approaches are sensitive to out-of-distribution (OOD) noise and outliers. In this paper, we explore the role of an analytical per-point embedding based on the criterion of bandwidth. The concept of bandwidth enables us to draw connections with an alternate per-point embedding -- positional embedding, particularly random Fourier features. We present compelling robust results across downstream tasks such as point cloud classification and registration with several categories of OOD noise. ",
    "url": "https://arxiv.org/abs/2309.00339",
    "authors": [
      "Jianqiao Zheng",
      "Xueqian Li",
      "Sameera Ramasinghe",
      "Simon Lucey"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00342",
    "title": "Self-Sustainable Key Generation: Strategies and Performance Bounds under  DoS Attacks",
    "abstract": "Denial-of-Service (DoS) threats pose a major challenge to the idea of physical-layer key generation as the underlying wireless channels for key extraction are usually public. Identifying this vulnerability, we study the effect of DoS threats on relay-assisted key generation, and show that a reactive jamming attack on the distribution phase of relay-assisted key generation can forbid the nodes from extracting secret keys. To circumvent this problem, we propose a self-sustainable key generation model, wherein a frequency-hopping based distribution phase is employed to evade the jamming attack even though the participating nodes do not share prior credentials. A salient feature of the idea is to carve out a few bits from the key generation phase and subsequently use them to pick a frequency band at random for the broadcast phase. Interesting resource-allocation problems are formulated on how to extract maximum number of secret bits while also being able to evade the jamming attack with high probability. Tractable low-complexity solutions are also provided to the resource-allocation problems, along with insights on the feasibility of their implementation in practice. ",
    "url": "https://arxiv.org/abs/2309.00342",
    "authors": [
      "Rusni Kima Mangang",
      "J. Harshan"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2309.00367",
    "title": "Where Did the Gap Go? Reassessing the Long-Range Graph Benchmark",
    "abstract": "The recent Long-Range Graph Benchmark (LRGB, Dwivedi et al. 2022) introduced a set of graph learning tasks strongly dependent on long-range interaction between vertices. Empirical evidence suggests that on these tasks Graph Transformers significantly outperform Message Passing GNNs (MPGNNs). In this paper, we carefully reevaluate multiple MPGNN baselines as well as the Graph Transformer GPS (Ramp\\'a\\v{s}ek et al. 2022) on LRGB. Through a rigorous empirical analysis, we demonstrate that the reported performance gap is overestimated due to suboptimal hyperparameter choices. It is noteworthy that across multiple datasets the performance gap completely vanishes after basic hyperparameter optimization. In addition, we discuss the impact of lacking feature normalization for LRGB's vision datasets and highlight a spurious implementation of LRGB's link prediction metric. The principal aim of our paper is to establish a higher standard of empirical rigor within the graph machine learning community. ",
    "url": "https://arxiv.org/abs/2309.00367",
    "authors": [
      "Jan Tönshoff",
      "Martin Ritzert",
      "Eran Rosenbluth",
      "Martin Grohe"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.00379",
    "title": "Anomaly detection with semi-supervised classification based on risk  estimators",
    "abstract": "A significant limitation of one-class classification anomaly detection methods is their reliance on the assumption that unlabeled training data only contains normal instances. To overcome this impractical assumption, we propose two novel classification-based anomaly detection methods. Firstly, we introduce a semi-supervised shallow anomaly detection method based on an unbiased risk estimator. Secondly, we present a semi-supervised deep anomaly detection method utilizing a nonnegative (biased) risk estimator. We establish estimation error bounds and excess risk bounds for both risk minimizers. Additionally, we propose techniques to select appropriate regularization parameters that ensure the nonnegativity of the empirical risk in the shallow model under specific loss functions. Our extensive experiments provide strong evidence of the effectiveness of the risk-based anomaly detection methods. ",
    "url": "https://arxiv.org/abs/2309.00379",
    "authors": [
      "Le Thi Khanh Hien",
      "Sukanya Patra",
      "Souhaib Ben Taieb"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.00399",
    "title": "Fine-grained Recognition with Learnable Semantic Data Augmentation",
    "abstract": "Fine-grained image recognition is a longstanding computer vision challenge that focuses on differentiating objects belonging to multiple subordinate categories within the same meta-category. Since images belonging to the same meta-category usually share similar visual appearances, mining discriminative visual cues is the key to distinguishing fine-grained categories. Although commonly used image-level data augmentation techniques have achieved great success in generic image classification problems, they are rarely applied in fine-grained scenarios, because their random editing-region behavior is prone to destroy the discriminative visual cues residing in the subtle regions. In this paper, we propose diversifying the training data at the feature-level to alleviate the discriminative region loss problem. Specifically, we produce diversified augmented samples by translating image features along semantically meaningful directions. The semantic directions are estimated with a covariance prediction network, which predicts a sample-wise covariance matrix to adapt to the large intra-class variation inherent in fine-grained images. Furthermore, the covariance prediction network is jointly optimized with the classification network in a meta-learning manner to alleviate the degenerate solution problem. Experiments on four competitive fine-grained recognition benchmarks (CUB-200-2011, Stanford Cars, FGVC Aircrafts, NABirds) demonstrate that our method significantly improves the generalization performance on several popular classification networks (e.g., ResNets, DenseNets, EfficientNets, RegNets and ViT). Combined with a recently proposed method, our semantic data augmentation approach achieves state-of-the-art performance on the CUB-200-2011 dataset. The source code will be released. ",
    "url": "https://arxiv.org/abs/2309.00399",
    "authors": [
      "Yifan Pu",
      "Yizeng Han",
      "Yulin Wang",
      "Junlan Feng",
      "Chao Deng",
      "Gao Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00407",
    "title": "PoCL-R: An Open Standard Based Offloading Layer for Heterogeneous  Multi-Access Edge Computing with Server Side Scalability",
    "abstract": "We propose a novel computing runtime that exposes remote compute devices via the cross-vendor open heterogeneous computing standard OpenCL and can execute compute tasks on the MEC cluster side across multiple servers in a scalable manner. Intermittent UE connection loss is handled gracefully even if the device's IP address changes on the way. Network-induced latency is minimized by transferring data and signaling command completions between remote devices in a peer-to-peer fashion directly to the target server with a streamlined TCP-based protocol that yields a command latency of only 60 microseconds on top of network round-trip latency in synthetic benchmarks. The runtime can utilize RDMA to speed up inter-server data transfers by an additional 60% compared to the TCP-based solution. The benefits of the proposed runtime in MEC applications are demonstrated with a smartphone-based augmented reality rendering case study. Measurements show up to 19x improvements to frame rate and 17x improvements to local energy consumption when using the proposed runtime to offload AR rendering from a smartphone. Scalability to multiple GPU servers in real-world applications is shown in a computational fluid dynamics simulation, which scales with the number of servers at roughly 80% efficiency which is comparable to an MPI port of the same simulation. ",
    "url": "https://arxiv.org/abs/2309.00407",
    "authors": [
      "Jan Solanti",
      "Michal Babej",
      "Julius Ikkala",
      "Pekka Jääskeläinen"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Networking and Internet Architecture (cs.NI)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2309.00417",
    "title": "Area-norm COBRA on Conditional Survival Prediction",
    "abstract": "The paper explores a different variation of combined regression strategy to calculate the conditional survival function. We use regression based weak learners to create the proposed ensemble technique. The proposed combined regression strategy uses proximity measure as area between two survival curves. The proposed model shows a construction which ensures that it performs better than the Random Survival Forest. The paper discusses a novel technique to select the most important variable in the combined regression setup. We perform a simulation study to show that our proposition for finding relevance of the variables works quite well. We also use three real-life datasets to illustrate the model. ",
    "url": "https://arxiv.org/abs/2309.00417",
    "authors": [
      "Rahul Goswami",
      "Arabin Kr. Dey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Quantitative Methods (q-bio.QM)",
      "Computation (stat.CO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2309.00428",
    "title": "A Locality-based Neural Solver for Optical Motion Capture",
    "abstract": "We present a novel locality-based learning method for cleaning and solving optical motion capture data. Given noisy marker data, we propose a new heterogeneous graph neural network which treats markers and joints as different types of nodes, and uses graph convolution operations to extract the local features of markers and joints and transform them to clean motions. To deal with anomaly markers (e.g. occluded or with big tracking errors), the key insight is that a marker's motion shows strong correlations with the motions of its immediate neighboring markers but less so with other markers, a.k.a. locality, which enables us to efficiently fill missing markers (e.g. due to occlusion). Additionally, we also identify marker outliers due to tracking errors by investigating their acceleration profiles. Finally, we propose a training regime based on representation learning and data augmentation, by training the model on data with masking. The masking schemes aim to mimic the occluded and noisy markers often observed in the real data. Finally, we show that our method achieves high accuracy on multiple metrics across various datasets. Extensive comparison shows our method outperforms state-of-the-art methods in terms of prediction accuracy of occluded marker position error by approximately 20%, which leads to a further error reduction on the reconstructed joint rotations and positions by 30%. The code and data for this paper are available at https://github.com/non-void/LocalMoCap. ",
    "url": "https://arxiv.org/abs/2309.00428",
    "authors": [
      "Xiaoyu Pan",
      "Bowen Zheng",
      "Xinwei Jiang",
      "Guanglong Xu",
      "Xianli Gu",
      "Jingxiang Li",
      "Qilong Kou",
      "He Wang",
      "Tianjia Shao",
      "Kun Zhou",
      "Xiaogang Jin"
    ],
    "subjectives": [
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.00438",
    "title": "A shape-based heuristic for the detection of urban block artifacts in  street networks",
    "abstract": "Street networks are ubiquitous components of cities, guiding their development and enabling movement from place to place; street networks are also the critical components of many urban analytical methods. However, their graph representation is often designed primarily for transportation purposes. This representation is less suitable for other use cases where transportation networks need to be simplified as a mandatory pre-processing step, e.g., in the case of morphological analysis, visual navigation, or drone flight routing. While the urgent demand for automated pre-processing methods comes from various fields, it is still an unsolved challenge. In this article, we tackle this challenge by proposing a cheap computational heuristic for the identification of \"face artifacts\", i.e., geometries that are enclosed by transportation edges but do not represent urban blocks. The heuristic is based on combining the frequency distributions of shape compactness metrics and area measurements of street network face polygons. We test our method on 131 globally sampled large cities and show that it successfully identifies face artifacts in 89% of analyzed cities. Our heuristic of detecting artifacts caused by data being collected for another purpose is the first step towards an automated street network simplification workflow. Moreover, the proposed face artifact index uncovers differences in structural rules guiding the development of cities in different world regions. ",
    "url": "https://arxiv.org/abs/2309.00438",
    "authors": [
      "Martin Fleischmann",
      "Anastassia Vybornova"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2309.00454",
    "title": "CoNeTTE: An efficient Audio Captioning system leveraging multiple  datasets with Task Embedding",
    "abstract": "Automated Audio Captioning (AAC) involves generating natural language descriptions of audio content, using encoder-decoder architectures. An audio encoder produces audio embeddings fed to a decoder, usually a Transformer decoder, for caption generation. In this work, we describe our model, which novelty, compared to existing models, lies in the use of a ConvNeXt architecture as audio encoder, adapted from the vision domain to audio classification. This model, called CNext-trans, achieved state-of-the-art scores on the AudioCaps (AC) dataset and performed competitively on Clotho (CL), while using four to forty times fewer parameters than existing models. We examine potential biases in the AC dataset due to its origin from AudioSet by investigating unbiased encoder's impact on performance. Using the well-known PANN's CNN14, for instance, as an unbiased encoder, we observed a 1.7% absolute reduction in SPIDEr score (where higher scores indicate better performance). To improve cross-dataset performance, we conducted experiments by combining multiple AAC datasets (AC, CL, MACS, WavCaps) for training. Although this strategy enhanced overall model performance across datasets, it still fell short compared to models trained specifically on a single target dataset, indicating the absence of a one-size-fits-all model. To mitigate performance gaps between datasets, we introduced a Task Embedding (TE) token, allowing the model to identify the source dataset for each input sample. We provide insights into the impact of these TEs on both the form (words) and content (sound event types) of the generated captions. The resulting model, named CoNeTTE, an unbiased CNext-trans model enriched with dataset-specific Task Embeddings, achieved SPIDEr scores of 44.1% and 30.5% on AC and CL, respectively. Code available: https://github.com/Labbeti/conette-audio-captioning. ",
    "url": "https://arxiv.org/abs/2309.00454",
    "authors": [
      "Étienne Labbé",
      "Thomas Pellegrini",
      "Julien Pinquier"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2309.00464",
    "title": "A Theoretical and Practical Framework for Evaluating Uncertainty  Calibration in Object Detection",
    "abstract": "The proliferation of Deep Neural Networks has resulted in machine learning systems becoming increasingly more present in various real-world applications. Consequently, there is a growing demand for highly reliable models in these domains, making the problem of uncertainty calibration pivotal, when considering the future of deep learning. This is especially true when considering object detection systems, that are commonly present in safety-critical application such as autonomous driving and robotics. For this reason, this work presents a novel theoretical and practical framework to evaluate object detection systems in the context of uncertainty calibration. The robustness of the proposed uncertainty calibration metrics is shown through a series of representative experiments. Code for the proposed uncertainty calibration metrics at: https://github.com/pedrormconde/Uncertainty_Calibration_Object_Detection. ",
    "url": "https://arxiv.org/abs/2309.00464",
    "authors": [
      "Pedro Conde",
      "Rui L. Lopes",
      "Cristiano Premebida"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.00474",
    "title": "Asymmetric double-winged multi-view clustering network for exploring  Diverse and Consistent Information",
    "abstract": "In unsupervised scenarios, deep contrastive multi-view clustering (DCMVC) is becoming a hot research spot, which aims to mine the potential relationships between different views. Most existing DCMVC algorithms focus on exploring the consistency information for the deep semantic features, while ignoring the diverse information on shallow features. To fill this gap, we propose a novel multi-view clustering network termed CodingNet to explore the diverse and consistent information simultaneously in this paper. Specifically, instead of utilizing the conventional auto-encoder, we design an asymmetric structure network to extract shallow and deep features separately. Then, by aligning the similarity matrix on the shallow feature to the zero matrix, we ensure the diversity for the shallow features, thus offering a better description of multi-view data. Moreover, we propose a dual contrastive mechanism that maintains consistency for deep features at both view-feature and pseudo-label levels. Our framework's efficacy is validated through extensive experiments on six widely used benchmark datasets, outperforming most state-of-the-art multi-view clustering algorithms. ",
    "url": "https://arxiv.org/abs/2309.00474",
    "authors": [
      "Qun Zheng",
      "Xihong Yang",
      "Siwei Wang",
      "Xinru An",
      "Qi Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00477",
    "title": "Privacy Attacks and Defenses for Digital Twin Migrations in Vehicular  Metaverses",
    "abstract": "The gradual fusion of intelligent transportation systems with metaverse technologies is giving rise to vehicular metaverses, which blend virtual spaces with physical space. As indispensable components for vehicular metaverses, Vehicular Twins (VTs) are digital replicas of Vehicular Metaverse Users (VMUs) and facilitate customized metaverse services to VMUs. VTs are established and maintained in RoadSide Units (RSUs) with sufficient computing and storage resources. Due to the limited communication coverage of RSUs and the high mobility of VMUs, VTs need to be migrated among RSUs to ensure real-time and seamless services for VMUs. However, during VT migrations, physical-virtual synchronization and massive communications among VTs may cause identity and location privacy disclosures of VMUs and VTs. In this article, we study privacy issues and the corresponding defenses for VT migrations in vehicular metaverses. We first present four kinds of specific privacy attacks during VT migrations. Then, we propose a VMU-VT dual pseudonym scheme and a synchronous pseudonym change framework to defend against these attacks. Additionally, we evaluate average privacy entropy for pseudonym changes and optimize the number of pseudonym distribution based on inventory theory. Numerical results show that the average utility of VMUs under our proposed schemes is 33.8% higher than that under the equal distribution scheme, demonstrating the superiority of our schemes. ",
    "url": "https://arxiv.org/abs/2309.00477",
    "authors": [
      "Xiaofeng Luo",
      "Jinbo Wen",
      "Jiawen Kang",
      "Jiangtian Nie",
      "Zehui Xiong",
      "Yang Zhang",
      "Zhaohui Yang",
      "Shengli Xie"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2309.00480",
    "title": "Learning-based NLOS Detection and Uncertainty Prediction of GNSS  Observations with Transformer-Enhanced LSTM Network",
    "abstract": "The global navigation satellite systems (GNSS) play a vital role in transport systems for accurate and consistent vehicle localization. However, GNSS observations can be distorted due to multipath effects and non-line-of-sight (NLOS) receptions in challenging environments such as urban canyons. In such cases, traditional methods to classify and exclude faulty GNSS observations may fail, leading to unreliable state estimation and unsafe system operations. This work proposes a Deep-Learning-based method to detect NLOS receptions and predict GNSS pseudorange errors by analyzing GNSS observations as a spatio-temporal modeling problem. Compared to previous works, we construct a transformer-like attention mechanism to enhance the long short-term memory (LSTM) networks, improving model performance and generalization. For the training and evaluation of the proposed network, we used labeled datasets from the cities of Hong Kong and Aachen. We also introduce a dataset generation process to label the GNSS observations using lidar maps. In experimental studies, we compare the proposed network with a deep-learning-based model and classical machine-learning models. Furthermore, we conduct ablation studies of our network components and integrate the NLOS detection with data out-of-distribution in a state estimator. As a result, our network presents improved precision and recall ratios compared to other models. Additionally, we show that the proposed method avoids trajectory divergence in real-world vehicle localization by classifying and excluding NLOS observations. ",
    "url": "https://arxiv.org/abs/2309.00480",
    "authors": [
      "Haoming Zhang",
      "Zhanxin Wang",
      "Heike Vallery"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.00483",
    "title": "Geometry-aware Line Graph Transformer Pre-training for Molecular  Property Prediction",
    "abstract": "Molecular property prediction with deep learning has gained much attention over the past years. Owing to the scarcity of labeled molecules, there has been growing interest in self-supervised learning methods that learn generalizable molecular representations from unlabeled data. Molecules are typically treated as 2D topological graphs in modeling, but it has been discovered that their 3D geometry is of great importance in determining molecular functionalities. In this paper, we propose the Geometry-aware line graph transformer (Galformer) pre-training, a novel self-supervised learning framework that aims to enhance molecular representation learning with 2D and 3D modalities. Specifically, we first design a dual-modality line graph transformer backbone to encode the topological and geometric information of a molecule. The designed backbone incorporates effective structural encodings to capture graph structures from both modalities. Then we devise two complementary pre-training tasks at the inter and intra-modality levels. These tasks provide properly supervised information and extract discriminative 2D and 3D knowledge from unlabeled molecules. Finally, we evaluate Galformer against six state-of-the-art baselines on twelve property prediction benchmarks via downstream fine-tuning. Experimental results show that Galformer consistently outperforms all baselines on both classification and regression tasks, demonstrating its effectiveness. ",
    "url": "https://arxiv.org/abs/2309.00483",
    "authors": [
      "Peizhen Bai",
      "Xianyuan Liu",
      "Haiping Lu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2309.00508",
    "title": "Structure and Gradient Dynamics Near Global Minima of Two-layer Neural  Networks",
    "abstract": "Under mild assumptions, we investigate the structure of loss landscape of two-layer neural networks near global minima, determine the set of parameters which give perfect generalization, and fully characterize the gradient flows around it. With novel techniques, our work uncovers some simple aspects of the complicated loss landscape and reveals how model, target function, samples and initialization affect the training dynamics differently. Based on these results, we also explain why (overparametrized) neural networks could generalize well. ",
    "url": "https://arxiv.org/abs/2309.00508",
    "authors": [
      "Leyang Zhang",
      "Yaoyu Zhang",
      "Tao Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2309.00513",
    "title": "A normative approach to radicalization in social networks",
    "abstract": "In recent decades, the massification of online social connections has made information globally accessible in a matter of seconds. Unfortunately, this has been accompanied by a dramatic surge in extreme opinions, without a clear solution in sight. Using a model performing probabilistic inference in large-scale loopy graphs through exchange of messages between nodes, we show how circularity in the social graph directly leads to radicalization and the polarization of opinions. We demonstrate that these detrimental effects could be avoided by actively decorrelating the messages in social media feeds. This approach is based on an extension of Belief Propagation (BP) named Circular Belief Propagation (CBP) that can be trained to drastically improve inference within a cyclic graph. CBP was benchmarked using data from Facebook and Twitter. This approach could inspire new methods for preventing the viral spreading and amplification of misinformation online, improving the capacity of social networks to share knowledge globally without resorting to censorship. ",
    "url": "https://arxiv.org/abs/2309.00513",
    "authors": [
      "Vincent Bouttier",
      "Salomé Leclercq",
      "Renaud Jardri",
      "Sophie Deneve"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2309.00523",
    "title": "Integrated Charging Scheduling and Operational Control for an Electric  Bus Network",
    "abstract": "The last few years have seen the massive deployment of electric buses in many existing transit networks. However, the planning and operation of an electric bus system differ from that of a bus system with conventional vehicles, and some key problems have not yet been studied in the literature. In this work, we address the integrated operational control and charging scheduling problem for a network of electric buses with a limited opportunity charging capacity. We propose a hierarchical control framework to solve this problem, where the charging and operational decisions are taken jointly by solving a mixed-integer linear program in the high-level control layer. Since this optimization problem might become very large as more bus lines are considered, we propose to apply Lagrangian relaxation in such a way as to exploit the structure of the problem and enable a decomposition into independent subproblems. A local search heuristic is then deployed in order to generate good feasible solutions to the original problem. This entire Lagrangian heuristic procedure is shown to scale much better on transit networks with an increasing number of bus lines than trying to solve the original problem with an off-the-shelf solver. The proposed procedure is then tested in the high-fidelity microscopic traffic environment Vissim on a bus network constructed from an openly available dataset of the city of Chicago. The results show the benefits of combining the charging scheduling decisions together with the real-time operational control of the vehicles as the proposed control framework manages to achieve both a better level of service and lower charging costs over control baselines with predetermined charging schedules. ",
    "url": "https://arxiv.org/abs/2309.00523",
    "authors": [
      "Rémi Lacombe",
      "Nikolce Murgovski",
      "Sébastien Gros",
      "Balázs Kulcsár"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2309.00526",
    "title": "SQLdepth: Generalizable Self-Supervised Fine-Structured Monocular Depth  Estimation",
    "abstract": "Recently, self-supervised monocular depth estimation has gained popularity with numerous applications in autonomous driving and robotics. However, existing solutions primarily seek to estimate depth from immediate visual features, and struggle to recover fine-grained scene details with limited generalization. In this paper, we introduce SQLdepth, a novel approach that can effectively learn fine-grained scene structures from motion. In SQLdepth, we propose a novel Self Query Layer (SQL) to build a self-cost volume and infer depth from it, rather than inferring depth from feature maps. The self-cost volume implicitly captures the intrinsic geometry of the scene within a single frame. Each individual slice of the volume signifies the relative distances between points and objects within a latent space. Ultimately, this volume is compressed to the depth map via a novel decoding approach. Experimental results on KITTI and Cityscapes show that our method attains remarkable state-of-the-art performance (AbsRel = $0.082$ on KITTI, $0.052$ on KITTI with improved ground-truth and $0.106$ on Cityscapes), achieves $9.9\\%$, $5.5\\%$ and $4.5\\%$ error reduction from the previous best. In addition, our approach showcases reduced training complexity, computational efficiency, improved generalization, and the ability to recover fine-grained scene details. Moreover, the self-supervised pre-trained and metric fine-tuned SQLdepth can surpass existing supervised methods by significant margins (AbsRel = $0.043$, $14\\%$ error reduction). self-matching-oriented relative distance querying in SQL improves the robustness and zero-shot generalization capability of SQLdepth. Code and the pre-trained weights will be publicly available. Code is available at \\href{https://github.com/hisfog/SQLdepth-Impl}{https://github.com/hisfog/SQLdepth-Impl}. ",
    "url": "https://arxiv.org/abs/2309.00526",
    "authors": [
      "Youhong Wang",
      "Yunji Liang",
      "Hao Xu",
      "Shaohui Jiao",
      "Hongkai Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00543",
    "title": "Curating Naturally Adversarial Datasets for Trustworthy AI in Healthcare",
    "abstract": "Deep learning models have shown promising predictive accuracy for time-series healthcare applications. However, ensuring the robustness of these models is vital for building trustworthy AI systems. Existing research predominantly focuses on robustness to synthetic adversarial examples, crafted by adding imperceptible perturbations to clean input data. However, these synthetic adversarial examples do not accurately reflect the most challenging real-world scenarios, especially in the context of healthcare data. Consequently, robustness to synthetic adversarial examples may not necessarily translate to robustness against naturally occurring adversarial examples, which is highly desirable for trustworthy AI. We propose a method to curate datasets comprised of natural adversarial examples to evaluate model robustness. The method relies on probabilistic labels obtained from automated weakly-supervised labeling that combines noisy and cheap-to-obtain labeling heuristics. Based on these labels, our method adversarially orders the input data and uses this ordering to construct a sequence of increasingly adversarial datasets. Our evaluation on six medical case studies and three non-medical case studies demonstrates the efficacy and statistical validity of our approach to generating naturally adversarial datasets ",
    "url": "https://arxiv.org/abs/2309.00543",
    "authors": [
      "Sydney Pugh",
      "Ivan Ruchkin",
      "Insup Lee",
      "James Weimer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.00549",
    "title": "Impact of Image Context for Single Deep Learning Face Morphing Attack  Detection",
    "abstract": "The increase in security concerns due to technological advancements has led to the popularity of biometric approaches that utilize physiological or behavioral characteristics for enhanced recognition. Face recognition systems (FRSs) have become prevalent, but they are still vulnerable to image manipulation techniques such as face morphing attacks. This study investigates the impact of the alignment settings of input images on deep learning face morphing detection performance. We analyze the interconnections between the face contour and image context and suggest optimal alignment conditions for face morphing detection. ",
    "url": "https://arxiv.org/abs/2309.00549",
    "authors": [
      "Joana Pimenta",
      "Iurii Medvedev",
      "Nuno Gonçalves"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00550",
    "title": "NeMig -- A Bilingual News Collection and Knowledge Graph about Migration",
    "abstract": "News recommendation plays a critical role in shaping the public's worldviews through the way in which it filters and disseminates information about different topics. Given the crucial impact that media plays in opinion formation, especially for sensitive topics, understanding the effects of personalized recommendation beyond accuracy has become essential in today's digital society. In this work, we present NeMig, a bilingual news collection on the topic of migration, and corresponding rich user data. In comparison to existing news recommendation datasets, which comprise a large variety of monolingual news, NeMig covers articles on a single controversial topic, published in both Germany and the US. We annotate the sentiment polarization of the articles and the political leanings of the media outlets, in addition to extracting subtopics and named entities disambiguated through Wikidata. These features can be used to analyze the effects of algorithmic news curation beyond accuracy-based performance, such as recommender biases and the creation of filter bubbles. We construct domain-specific knowledge graphs from the news text and metadata, thus encoding knowledge-level connections between articles. Importantly, while existing datasets include only click behavior, we collect user socio-demographic and political information in addition to explicit click feedback. We demonstrate the utility of NeMig through experiments on the tasks of news recommenders benchmarking, analysis of biases in recommenders, and news trends analysis. NeMig aims to provide a useful resource for the news recommendation community and to foster interdisciplinary research into the multidimensional effects of algorithmic news curation. ",
    "url": "https://arxiv.org/abs/2309.00550",
    "authors": [
      "Andreea Iana",
      "Mehwish Alam",
      "Alexander Grote",
      "Nevena Nikolajevic",
      "Katharina Ludwig",
      "Philipp Müller",
      "Christof Weinhardt",
      "Heiko Paulheim"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2309.00563",
    "title": "Catalyst Property Prediction with CatBERTa: Unveiling Feature  Exploration Strategies through Large Language Models",
    "abstract": "Efficient catalyst screening necessitates predictive models for adsorption energy, a key property of reactivity. However, prevailing methods, notably graph neural networks (GNNs), demand precise atomic coordinates for constructing graph representations, while integrating observable attributes remains challenging. This research introduces CatBERTa, an energy prediction Transformer model using textual inputs. Built on a pretrained Transformer encoder, CatBERTa processes human-interpretable text, incorporating target features. Attention score analysis reveals CatBERTa's focus on tokens related to adsorbates, bulk composition, and their interacting atoms. Moreover, interacting atoms emerge as effective descriptors for adsorption configurations, while factors such as bond length and atomic properties of these atoms offer limited predictive contributions. By predicting adsorption energy from the textual representation of initial structures, CatBERTa achieves a mean absolute error (MAE) of 0.75 eV-comparable to vanilla Graph Neural Networks (GNNs). Furthermore, the subtraction of the CatBERTa-predicted energies effectively cancels out their systematic errors by as much as 19.3% for chemically similar systems, surpassing the error reduction observed in GNNs. This outcome highlights its potential to enhance the accuracy of energy difference predictions. This research establishes a fundamental framework for text-based catalyst property prediction, without relying on graph representations, while also unveiling intricate feature-property relationships. ",
    "url": "https://arxiv.org/abs/2309.00563",
    "authors": [
      "Janghoon Ock",
      "Chakradhar Guntuboina",
      "Amir Barati Farimani"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Chemical Physics (physics.chem-ph)"
    ]
  },
  {
    "id": "arXiv:2309.00583",
    "title": "Geometry-Informed Neural Operator for Large-Scale 3D PDEs",
    "abstract": "We propose the geometry-informed neural operator (GINO), a highly efficient approach to learning the solution operator of large-scale partial differential equations with varying geometries. GINO uses a signed distance function and point-cloud representations of the input shape and neural operators based on graph and Fourier architectures to learn the solution operator. The graph neural operator handles irregular grids and transforms them into and from regular latent grids on which Fourier neural operator can be efficiently applied. GINO is discretization-convergent, meaning the trained model can be applied to arbitrary discretization of the continuous domain and it converges to the continuum operator as the discretization is refined. To empirically validate the performance of our method on large-scale simulation, we generate the industry-standard aerodynamics dataset of 3D vehicle geometries with Reynolds numbers as high as five million. For this large-scale 3D fluid simulation, numerical methods are expensive to compute surface pressure. We successfully trained GINO to predict the pressure on car surfaces using only five hundred data points. The cost-accuracy experiments show a $26,000 \\times$ speed-up compared to optimized GPU-based computational fluid dynamics (CFD) simulators on computing the drag coefficient. When tested on new combinations of geometries and boundary conditions (inlet velocities), GINO obtains a one-fourth reduction in error rate compared to deep neural network approaches. ",
    "url": "https://arxiv.org/abs/2309.00583",
    "authors": [
      "Zongyi Li",
      "Nikola Borislavov Kovachki",
      "Chris Choy",
      "Boyi Li",
      "Jean Kossaifi",
      "Shourya Prakash Otta",
      "Mohammad Amin Nabian",
      "Maximilian Stadler",
      "Christian Hundt",
      "Kamyar Azizzadenesheli",
      "Anima Anandkumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2309.00584",
    "title": "Laminar: A New Serverless Stream-based Framework with Semantic Code  Search and Code Completion",
    "abstract": "This paper introduces Laminar, a novel serverless framework based on dispel4py, a parallel stream-based dataflow library. Laminar efficiently manages streaming workflows and components through a dedicated registry, offering a seamless serverless experience. Leveraging large lenguage models, Laminar enhances the framework with semantic code search, code summarization, and code completion. This contribution enhances serverless computing by simplifying the execution of streaming computations, managing data streams more efficiently, and offering a valuable tool for both researchers and practitioners. ",
    "url": "https://arxiv.org/abs/2309.00584",
    "authors": [
      "Zaynab Zahra",
      "Zihao Li",
      "Rosa Filgueira"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.00588",
    "title": "Discrete Morphological Neural Networks",
    "abstract": "A classical approach to designing binary image operators is Mathematical Morphology (MM). We propose the Discrete Morphological Neural Networks (DMNN) for binary image analysis to represent W-operators and estimate them via machine learning. A DMNN architecture, which is represented by a Morphological Computational Graph, is designed as in the classical heuristic design of morphological operators, in which the designer should combine a set of MM operators and Boolean operations based on prior information and theoretical knowledge. Then, once the architecture is fixed, instead of adjusting its parameters (i.e., structural elements or maximal intervals) by hand, we propose a lattice gradient descent algorithm (LGDA) to train these parameters based on a sample of input and output images under the usual machine learning approach. We also propose a stochastic version of the LGDA that is more efficient, is scalable and can obtain small error in practical problems. The class represented by a DMNN can be quite general or specialized according to expected properties of the target operator, i.e., prior information, and the semantic expressed by algebraic properties of classes of operators is a differential relative to other methods. The main contribution of this paper is the merger of the two main paradigms for designing morphological operators: classical heuristic design and automatic design via machine learning. Thus, conciliating classical heuristic morphological operator design with machine learning. We apply the DMNN to recognize the boundary of digits with noise, and we discuss many topics for future research. ",
    "url": "https://arxiv.org/abs/2309.00588",
    "authors": [
      "Diego Marcondes",
      "Junior Barrera"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00614",
    "title": "Baseline Defenses for Adversarial Attacks Against Aligned Language  Models",
    "abstract": "As Large Language Models quickly become ubiquitous, their security vulnerabilities are critical to understand. Recent work shows that text optimizers can produce jailbreaking prompts that bypass moderation and alignment. Drawing from the rich body of work on adversarial machine learning, we approach these attacks with three questions: What threat models are practically useful in this domain? How do baseline defense techniques perform in this new domain? How does LLM security differ from computer vision? We evaluate several baseline defense strategies against leading adversarial attacks on LLMs, discussing the various settings in which each is feasible and effective. Particularly, we look at three types of defenses: detection (perplexity based), input preprocessing (paraphrase and retokenization), and adversarial training. We discuss white-box and gray-box settings and discuss the robustness-performance trade-off for each of the defenses considered. Surprisingly, we find much more success with filtering and preprocessing than we would expect from other domains, such as vision, providing a first indication that the relative strengths of these defenses may be weighed differently in these domains. ",
    "url": "https://arxiv.org/abs/2309.00614",
    "authors": [
      "Neel Jain",
      "Avi Schwarzschild",
      "Yuxin Wen",
      "Gowthami Somepalli",
      "John Kirchenbauer",
      "Ping-yeh Chiang",
      "Micah Goldblum",
      "Aniruddha Saha",
      "Jonas Geiping",
      "Tom Goldstein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2309.00027",
    "title": "A Sequential Framework for Detection and Classification of Abnormal  Teeth in Panoramic X-rays",
    "abstract": "This paper describes our solution for the Dental Enumeration and Diagnosis on Panoramic X-rays Challenge at MICCAI 2023. Our approach consists of a multi-step framework tailored to the task of detecting and classifying abnormal teeth. The solution includes three sequential stages: dental instance detection, healthy instance filtering, and abnormal instance classification. In the first stage, we employed a Faster-RCNN model for detecting and identifying teeth. In subsequent stages, we designed a model that merged the encoding pathway of a pretrained U-net, optimized for dental lesion detection, with the Vgg16 architecture. The resulting model was first used for filtering out healthy teeth. Then, any identified abnormal teeth were categorized, potentially falling into one or more of the following conditions: embeddded, periapical lesion, caries, deep caries. The model performing dental instance detection achieved an AP score of 0.49. The model responsible for identifying healthy teeth attained an F1 score of 0.71. Meanwhile, the model trained for multi-label dental disease classification achieved an F1 score of 0.76. The code is available at https://github.com/tudordascalu/2d-teeth-detection-challenge. ",
    "url": "https://arxiv.org/abs/2309.00027",
    "authors": [
      "Tudor Dascalu",
      "Shaqayeq Ramezanzade",
      "Azam Bakhshandeh",
      "Lars Bjorndal",
      "Bulat Ibragimov"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00073",
    "title": "Diffusion Variational Autoencoder for Tackling Stochasticity in  Multi-Step Regression Stock Price Prediction",
    "abstract": "Multi-step stock price prediction over a long-term horizon is crucial for forecasting its volatility, allowing financial institutions to price and hedge derivatives, and banks to quantify the risk in their trading books. Additionally, most financial regulators also require a liquidity horizon of several days for institutional investors to exit their risky assets, in order to not materially affect market prices. However, the task of multi-step stock price prediction is challenging, given the highly stochastic nature of stock data. Current solutions to tackle this problem are mostly designed for single-step, classification-based predictions, and are limited to low representation expressiveness. The problem also gets progressively harder with the introduction of the target price sequence, which also contains stochastic noise and reduces generalizability at test-time. To tackle these issues, we combine a deep hierarchical variational-autoencoder (VAE) and diffusion probabilistic techniques to do seq2seq stock prediction through a stochastic generative process. The hierarchical VAE allows us to learn the complex and low-level latent variables for stock prediction, while the diffusion probabilistic model trains the predictor to handle stock price stochasticity by progressively adding random noise to the stock data. Our Diffusion-VAE (D-Va) model is shown to outperform state-of-the-art solutions in terms of its prediction accuracy and variance. More importantly, the multi-step outputs can also allow us to form a stock portfolio over the prediction length. We demonstrate the effectiveness of our model outputs in the portfolio investment task through the Sharpe ratio metric and highlight the importance of dealing with different types of prediction uncertainties. ",
    "url": "https://arxiv.org/abs/2309.00073",
    "authors": [
      "Kelvin J.L. Koa",
      "Yunshan Ma",
      "Ritchie Ng",
      "Tat-Seng Chua"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Machine Learning (cs.LG)",
      "Computational Finance (q-fin.CP)"
    ]
  },
  {
    "id": "arXiv:2309.00169",
    "title": "RepCodec: A Speech Representation Codec for Speech Tokenization",
    "abstract": "With recent rapid growth of large language models (LLMs), discrete speech tokenization has played an important role for injecting speech into LLMs. However, this discretization gives rise to a loss of information, consequently impairing overall performance. To improve the performance of these discrete speech tokens, we present RepCodec, a novel speech representation codec for semantic speech tokenization. In contrast to audio codecs which reconstruct the raw audio, RepCodec learns a vector quantization codebook through reconstructing speech representations from speech encoders like HuBERT or data2vec. Together, the speech encoder, the codec encoder and the vector quantization codebook form a pipeline for converting speech waveforms into semantic tokens. The extensive experiments illustrate that RepCodec, by virtue of its enhanced information retention capacity, significantly outperforms the widely used k-means clustering approach in both speech understanding and generation. Furthermore, this superiority extends across various speech encoders and languages, affirming the robustness of RepCodec. We believe our method can facilitate large language modeling research on speech processing. ",
    "url": "https://arxiv.org/abs/2309.00169",
    "authors": [
      "Zhichao Huang",
      "Chutong Meng",
      "Tom Ko"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2309.00265",
    "title": "Application of Machine Learning in Melanoma Detection and the  Identification of 'Ugly Duckling' and Suspicious Naevi: A Review",
    "abstract": "Skin lesions known as naevi exhibit diverse characteristics such as size, shape, and colouration. The concept of an \"Ugly Duckling Naevus\" comes into play when monitoring for melanoma, referring to a lesion with distinctive features that sets it apart from other lesions in the vicinity. As lesions within the same individual typically share similarities and follow a predictable pattern, an ugly duckling naevus stands out as unusual and may indicate the presence of a cancerous melanoma. Computer-aided diagnosis (CAD) has become a significant player in the research and development field, as it combines machine learning techniques with a variety of patient analysis methods. Its aim is to increase accuracy and simplify decision-making, all while responding to the shortage of specialized professionals. These automated systems are especially important in skin cancer diagnosis where specialist availability is limited. As a result, their use could lead to life-saving benefits and cost reductions within healthcare. Given the drastic change in survival when comparing early stage to late-stage melanoma, early detection is vital for effective treatment and patient outcomes. Machine learning (ML) and deep learning (DL) techniques have gained popularity in skin cancer classification, effectively addressing challenges, and providing results equivalent to that of specialists. This article extensively covers modern Machine Learning and Deep Learning algorithms for detecting melanoma and suspicious naevi. It begins with general information on skin cancer and different types of naevi, then introduces AI, ML, DL, and CAD. The article then discusses the successful applications of various ML techniques like convolutional neural networks (CNN) for melanoma detection compared to dermatologists' performance. Lastly, it examines ML methods for UD naevus detection and identifying suspicious naevi. ",
    "url": "https://arxiv.org/abs/2309.00265",
    "authors": [
      "Fatima Al Zegair",
      "Nathasha Naranpanawa",
      "Brigid Betz-Stablein",
      "Monika Janda",
      "H. Peter Soyer",
      "Shekhar S. Chandra"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00520",
    "title": "Online Distributed Learning over Random Networks",
    "abstract": "The recent deployment of multi-agent systems in a wide range of scenarios has enabled the solution of learning problems in a distributed fashion. In this context, agents are tasked with collecting local data and then cooperatively train a model, without directly sharing the data. While distributed learning offers the advantage of preserving agents' privacy, it also poses several challenges in terms of designing and analyzing suitable algorithms. This work focuses specifically on the following challenges motivated by practical implementation: (i) online learning, where the local data change over time; (ii) asynchronous agent computations; (iii) unreliable and limited communications; and (iv) inexact local computations. To tackle these challenges, we introduce the Distributed Operator Theoretical (DOT) version of the Alternating Direction Method of Multipliers (ADMM), which we call the DOT-ADMM Algorithm. We prove that it converges with a linear rate for a large class of convex learning problems (e.g., linear and logistic regression problems) toward a bounded neighborhood of the optimal time-varying solution, and characterize how the neighborhood depends on~$\\text{(i)--(iv)}$. We corroborate the theoretical analysis with numerical simulations comparing the DOT-ADMM Algorithm with other state-of-the-art algorithms, showing that only the proposed algorithm exhibits robustness to (i)--(iv). ",
    "url": "https://arxiv.org/abs/2309.00520",
    "authors": [
      "Nicola Bastianello",
      "Diego Deplano",
      "Mauro Franceschelli",
      "Karl H. Johansson"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2309.00557",
    "title": "Interactive and Concentrated Differential Privacy for Bandits",
    "abstract": "Bandits play a crucial role in interactive learning schemes and modern recommender systems. However, these systems often rely on sensitive user data, making privacy a critical concern. This paper investigates privacy in bandits with a trusted centralized decision-maker through the lens of interactive Differential Privacy (DP). While bandits under pure $\\epsilon$-global DP have been well-studied, we contribute to the understanding of bandits under zero Concentrated DP (zCDP). We provide minimax and problem-dependent lower bounds on regret for finite-armed and linear bandits, which quantify the cost of $\\rho$-global zCDP in these settings. These lower bounds reveal two hardness regimes based on the privacy budget $\\rho$ and suggest that $\\rho$-global zCDP incurs less regret than pure $\\epsilon$-global DP. We propose two $\\rho$-global zCDP bandit algorithms, AdaC-UCB and AdaC-GOPE, for finite-armed and linear bandits respectively. Both algorithms use a common recipe of Gaussian mechanism and adaptive episodes. We analyze the regret of these algorithms to show that AdaC-UCB achieves the problem-dependent regret lower bound up to multiplicative constants, while AdaC-GOPE achieves the minimax regret lower bound up to poly-logarithmic factors. Finally, we provide experimental validation of our theoretical results under different settings. ",
    "url": "https://arxiv.org/abs/2309.00557",
    "authors": [
      "Achraf Azize",
      "Debabrota Basu"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2309.00570",
    "title": "Mechanism of feature learning in convolutional neural networks",
    "abstract": "Understanding the mechanism of how convolutional neural networks learn features from image data is a fundamental problem in machine learning and computer vision. In this work, we identify such a mechanism. We posit the Convolutional Neural Feature Ansatz, which states that covariances of filters in any convolutional layer are proportional to the average gradient outer product (AGOP) taken with respect to patches of the input to that layer. We present extensive empirical evidence for our ansatz, including identifying high correlation between covariances of filters and patch-based AGOPs for convolutional layers in standard neural architectures, such as AlexNet, VGG, and ResNets pre-trained on ImageNet. We also provide supporting theoretical evidence. We then demonstrate the generality of our result by using the patch-based AGOP to enable deep feature learning in convolutional kernel machines. We refer to the resulting algorithm as (Deep) ConvRFM and show that our algorithm recovers similar features to deep convolutional networks including the notable emergence of edge detectors. Moreover, we find that Deep ConvRFM overcomes previously identified limitations of convolutional kernels, such as their inability to adapt to local signals in images and, as a result, leads to sizable performance improvement over fixed convolutional kernels. ",
    "url": "https://arxiv.org/abs/2309.00570",
    "authors": [
      "Daniel Beaglehole",
      "Adityanarayanan Radhakrishnan",
      "Parthe Pandit",
      "Mikhail Belkin"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.08806",
    "title": "Best Practices for Noise-Based Augmentation to Improve the Performance  of Deployable Speech-Based Emotion Recognition Systems",
    "abstract": " Title: Best Practices for Noise-Based Augmentation to Improve the Performance  of Deployable Speech-Based Emotion Recognition Systems ",
    "url": "https://arxiv.org/abs/2104.08806",
    "authors": [
      "Mimansa Jaiswal",
      "Emily Mower Provost"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2111.13861",
    "title": "A New Multifractal-based Deep Learning Model for Text Mining",
    "abstract": " Title: A New Multifractal-based Deep Learning Model for Text Mining ",
    "url": "https://arxiv.org/abs/2111.13861",
    "authors": [
      "Zhenhua Wang",
      "Ming Ren",
      "Dong Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.13424",
    "title": "From prediction markets to interpretable collective intelligence",
    "abstract": " Comments: 41 pages, 3 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2204.13424",
    "authors": [
      "Alexey V. Osipov",
      "Nikolay N. Osipov"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Artificial Intelligence (cs.AI)",
      "Information Theory (cs.IT)",
      "Multiagent Systems (cs.MA)",
      "Econometrics (econ.EM)"
    ]
  },
  {
    "id": "arXiv:2205.01931",
    "title": "Mapping the landscape of histomorphological cancer phenotypes using  self-supervised learning on unlabeled, unannotated pathology slides",
    "abstract": " Title: Mapping the landscape of histomorphological cancer phenotypes using  self-supervised learning on unlabeled, unannotated pathology slides ",
    "url": "https://arxiv.org/abs/2205.01931",
    "authors": [
      "Adalberto Claudio Quiros",
      "Nicolas Coudray",
      "Anna Yeaton",
      "Xinyu Yang",
      "Bojing Liu",
      "Hortense Le",
      "Luis Chiriboga",
      "Afreen Karimkhan",
      "Navneet Narula",
      "David A. Moore",
      "Christopher Y. Park",
      "Harvey Pass",
      "Andre L. Moreira",
      "John Le Quesne",
      "Aristotelis Tsirigos",
      "Ke Yuan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.02547",
    "title": "Simple and Efficient Heterogeneous Graph Neural Network",
    "abstract": " Comments: Accepted by AAAI 2023 ",
    "url": "https://arxiv.org/abs/2207.02547",
    "authors": [
      "Xiaocheng Yang",
      "Mingyu Yan",
      "Shirui Pan",
      "Xiaochun Ye",
      "Dongrui Fan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.13240",
    "title": "Contrastive Image Synthesis and Self-supervised Feature Adaptation for  Cross-Modality Biomedical Image Segmentation",
    "abstract": " Title: Contrastive Image Synthesis and Self-supervised Feature Adaptation for  Cross-Modality Biomedical Image Segmentation ",
    "url": "https://arxiv.org/abs/2207.13240",
    "authors": [
      "Xinrong Hu",
      "Corey Wang",
      "Yiyu Shi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.00487",
    "title": "One Object at a Time: Accurate and Robust Structure From Motion for  Robots",
    "abstract": " Comments: v3: Add link to project page v2: Update DOI v1: Accepted at 2022 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) ",
    "url": "https://arxiv.org/abs/2208.00487",
    "authors": [
      "Aravind Battaje",
      "Oliver Brock"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03160",
    "title": "Almost-Orthogonal Layers for Efficient General-Purpose Lipschitz  Networks",
    "abstract": " Comments: - Corrected the results from competitor ECO. - Corrected a typo in the loss function equation ",
    "url": "https://arxiv.org/abs/2208.03160",
    "authors": [
      "Bernd Prach",
      "Christoph H. Lampert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.14613",
    "title": "Fair admission risk prediction with proportional multicalibration",
    "abstract": " Comments: Published in the 2023 Conference on Health, Inference, and Learning (CHIL). Best paper award ",
    "url": "https://arxiv.org/abs/2209.14613",
    "authors": [
      "William La Cava",
      "Elle Lett",
      "Guangya Wan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2210.15448",
    "title": "Neural Augmented Kalman Filtering with Bollinger Bands for Pairs Trading",
    "abstract": " Comments: Submitted to Transactions on Signal Processing ",
    "url": "https://arxiv.org/abs/2210.15448",
    "authors": [
      "Amit Milstein",
      "Haoran Deng",
      "Guy Revach",
      "Hai Morgenstern",
      "Nir Shlezinger"
    ],
    "subjectives": [
      "Trading and Market Microstructure (q-fin.TR)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2211.05400",
    "title": "onlineFGO: Online Continuous-Time Factor Graph Optimization with  Time-Centric Multi-Sensor Fusion for Robust Localization in Large-Scale  Environments",
    "abstract": " Comments: A major revision of this paper is available, which will be submitted to arXiv later ",
    "url": "https://arxiv.org/abs/2211.05400",
    "authors": [
      "Haoming Zhang",
      "Felix Widmayer",
      "Lars Lünnemann",
      "Dirk Abel"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2212.01168",
    "title": "Identifying Generalized Neural Representation Across Hamiltonian  Manifolds via Meta-learning",
    "abstract": " Comments: 15 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2212.01168",
    "authors": [
      "Yeongwoo Song",
      "Hawoong Jeong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2302.11055",
    "title": "SGD learning on neural networks: leap complexity and saddle-to-saddle  dynamics",
    "abstract": " Title: SGD learning on neural networks: leap complexity and saddle-to-saddle  dynamics ",
    "url": "https://arxiv.org/abs/2302.11055",
    "authors": [
      "Emmanuel Abbe",
      "Enric Boix-Adsera",
      "Theodor Misiakiewicz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2303.03786",
    "title": "Stability of the personal relationship networks in a longitudinal study  of middle school students",
    "abstract": " Comments: 10 pages, 7 figures, requires wlscirep.cls, jabbrv.sty, jabbrv-ltwa-all.ldf, and jabbrv-ltwa-en.ldf (included) ",
    "url": "https://arxiv.org/abs/2303.03786",
    "authors": [
      "Diego Escribano",
      "Francisco J. Lapuente",
      "José A. Cuesta",
      "Robin I. M. Dunbar",
      "Angel Sánchez"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2303.13121",
    "title": "DetOFA: Efficient Training of Once-for-All Networks for Object Detection  by Using Pre-trained Supernet and Path Filter",
    "abstract": " Comments: Accepted to ICCV workshop 2023 ",
    "url": "https://arxiv.org/abs/2303.13121",
    "authors": [
      "Yuiko Sakuma",
      "Masato Ishii",
      "Takuya Narihira"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02013",
    "title": "NPC: Neural Point Characters from Video",
    "abstract": " Comments: Project website: this https URL ",
    "url": "https://arxiv.org/abs/2304.02013",
    "authors": [
      "Shih-Yang Su",
      "Timur Bagautdinov",
      "Helge Rhodin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02216",
    "title": "Industrial Anomaly Detection with Domain Shift: A Real-world Dataset and  Masked Multi-scale Reconstruction",
    "abstract": " Comments: Accept by Computers in Industry ",
    "url": "https://arxiv.org/abs/2304.02216",
    "authors": [
      "Zilong Zhang",
      "Zhibin Zhao",
      "Xingwu Zhang",
      "Chuang Sun",
      "Xuefeng Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03763",
    "title": "Clutter Detection and Removal in 3D Scenes with View-Consistent  Inpainting",
    "abstract": " Comments: 18 pages. ICCV 2023. Project page: this https URL ",
    "url": "https://arxiv.org/abs/2304.03763",
    "authors": [
      "Fangyin Wei",
      "Thomas Funkhouser",
      "Szymon Rusinkiewicz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.09941",
    "title": "A Robust and Interpretable Deep Learning Framework for Multi-modal  Registration via Keypoints",
    "abstract": " Comments: Accepted to Medical Image Analysis 2023 ",
    "url": "https://arxiv.org/abs/2304.09941",
    "authors": [
      "Alan Q. Wang",
      "Evan M. Yu",
      "Adrian V. Dalca",
      "Mert R. Sabuncu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.04866",
    "title": "Causal Policy Gradient for Whole-Body Mobile Manipulation",
    "abstract": " Title: Causal Policy Gradient for Whole-Body Mobile Manipulation ",
    "url": "https://arxiv.org/abs/2305.04866",
    "authors": [
      "Jiaheng Hu",
      "Peter Stone",
      "Roberto Martín-Martín"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07270",
    "title": "SSD-MonoDETR: Supervised Scale-aware Deformable Transformer for  Monocular 3D Object Detection",
    "abstract": " Comments: Accepted to IEEE Transactions on Intelligent Vehicles (T-IV). Code will be made publicly available at this https URL ",
    "url": "https://arxiv.org/abs/2305.07270",
    "authors": [
      "Xuan He",
      "Fan Yang",
      "Kailun Yang",
      "Jiacheng Lin",
      "Haolong Fu",
      "Meng Wang",
      "Jin Yuan",
      "Zhiyong Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2305.07795",
    "title": "Constructing Holistic Measures for Social Biases in Masked Language  Models",
    "abstract": " Comments: We need to change the methodology in the paper appropriately cause us to change the title of the paper, so we need to withdraw it and subsequently resubmit the new version ",
    "url": "https://arxiv.org/abs/2305.07795",
    "authors": [
      "Yang Liu",
      "Yuexian Hou"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2306.08600",
    "title": "M^2UNet: MetaFormer Multi-scale Upsampling Network for Polyp  Segmentation",
    "abstract": " Title: M^2UNet: MetaFormer Multi-scale Upsampling Network for Polyp  Segmentation ",
    "url": "https://arxiv.org/abs/2306.08600",
    "authors": [
      "Quoc-Huy Trinh",
      "Nhat-Tan Bui",
      "Trong-Hieu Nguyen Mau",
      "Minh-Van Nguyen",
      "Hai-Minh Phan",
      "Minh-Triet Tran",
      "Hai-Dang Nguyen"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.10720",
    "title": "Exploring the Relationship between Samples and Masks for Robust Defect  Localization",
    "abstract": " Title: Exploring the Relationship between Samples and Masks for Robust Defect  Localization ",
    "url": "https://arxiv.org/abs/2306.10720",
    "authors": [
      "Jiang Lin",
      "Yaping Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.12133",
    "title": "Fundamental Performance Bounds for Carrier Phase Positioning in Cellular  Networks",
    "abstract": " Title: Fundamental Performance Bounds for Carrier Phase Positioning in Cellular  Networks ",
    "url": "https://arxiv.org/abs/2306.12133",
    "authors": [
      "Henk Wymeersch",
      "Rouhollah Amiri",
      "Gonzalo Seco-Granados"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2306.14142",
    "title": "Estimating Policy Effects in a Social Network with Independent Set  Sampling",
    "abstract": " Title: Estimating Policy Effects in a Social Network with Independent Set  Sampling ",
    "url": "https://arxiv.org/abs/2306.14142",
    "authors": [
      "Eugene Ang",
      "Prasanta Bhattacharya",
      "Andrew Lim"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2307.02437",
    "title": "Graphical CSS Code Transformation Using ZX Calculus",
    "abstract": " Comments: In Proceedings QPL 2023, arXiv:2308.15489 ",
    "url": "https://arxiv.org/abs/2307.02437",
    "authors": [
      "Jiaxin Huang",
      "Sarah Meng Li",
      "Lia Yeh",
      "Aleks Kissinger",
      "Michele Mosca",
      "Michael Vasmer"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2307.13925",
    "title": "EasyNet: An Easy Network for 3D Industrial Anomaly Detection",
    "abstract": " Title: EasyNet: An Easy Network for 3D Industrial Anomaly Detection ",
    "url": "https://arxiv.org/abs/2307.13925",
    "authors": [
      "Ruitao Chen",
      "Guoyang Xie",
      "Jiaqi Liu",
      "Jinbao Wang",
      "Ziqi Luo",
      "Jinfan Wang",
      "Feng Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.00890",
    "title": "Tango: rethinking quantization for graph neural network training on GPUs",
    "abstract": " Title: Tango: rethinking quantization for graph neural network training on GPUs ",
    "url": "https://arxiv.org/abs/2308.00890",
    "authors": [
      "Shiyang Chen",
      "Da Zheng",
      "Caiwen Ding",
      "Chengying Huan",
      "Yuede Ji",
      "Hang Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.03998",
    "title": "Real-time Strawberry Detection Based on Improved YOLOv5s Architecture  for Robotic Harvesting in open-field environment",
    "abstract": " Comments: 20 pages; 15 figures ",
    "url": "https://arxiv.org/abs/2308.03998",
    "authors": [
      "Zixuan He",
      "Salik Ram Khanal",
      "Xin Zhang",
      "Manoj Karkee",
      "Qin Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04287",
    "title": "Stable state and signal estimation in a network context",
    "abstract": " Comments: 14 pages, 1 figure ",
    "url": "https://arxiv.org/abs/2308.04287",
    "authors": [
      "Robert R. Bitmead"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.06961",
    "title": "Graph Structural Residuals: A Learning Approach to Diagnosis",
    "abstract": " Title: Graph Structural Residuals: A Learning Approach to Diagnosis ",
    "url": "https://arxiv.org/abs/2308.06961",
    "authors": [
      "Jan Lukas Augustin",
      "Oliver Niggemann"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.08242",
    "title": "Contrastive Learning for Lane Detection via Cross-Similarity",
    "abstract": " Comments: 10 pages ",
    "url": "https://arxiv.org/abs/2308.08242",
    "authors": [
      "Ali Zoljodi",
      "Sadegh Abadijou",
      "Mina Alibeigi",
      "Masoud Daneshtalab"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.09405",
    "title": "Robust Quadrupedal Locomotion via Risk-Averse Policy Learning",
    "abstract": " Comments: 8 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2308.09405",
    "authors": [
      "Jiyuan Shi",
      "Chenjia Bai",
      "Haoran He",
      "Lei Han",
      "Dong Wang",
      "Bin Zhao",
      "Mingguo Zhao",
      "Xiu Li",
      "Xuelong Li"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.09520",
    "title": "Proceedings of the 2nd International Workshop on Adaptive Cyber Defense",
    "abstract": " Title: Proceedings of the 2nd International Workshop on Adaptive Cyber Defense ",
    "url": "https://arxiv.org/abs/2308.09520",
    "authors": [
      "Marco Carvalho",
      "Damian Marriott",
      "Mark Bilinski",
      "Ahmad Ridley"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.11066",
    "title": "CSM-H-R: A Context Modeling Framework in Supporting Reasoning Automation  for Interoperable Intelligent Systems and Privacy Protection",
    "abstract": " Comments: 11 pages, 8 figures, Keywords: Context Reasoning, Automation, Intelligent Systems, Context Modeling, Context Dynamism, Privacy Protection, Context Sharing, Interoperability, System Integration ",
    "url": "https://arxiv.org/abs/2308.11066",
    "authors": [
      "Songhui Yue",
      "Xiaoyan Hong",
      "Randy K. Smith"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.11070",
    "title": "Temporal-Distributed Backdoor Attack Against Video Based Action  Recognition",
    "abstract": " Title: Temporal-Distributed Backdoor Attack Against Video Based Action  Recognition ",
    "url": "https://arxiv.org/abs/2308.11070",
    "authors": [
      "Xi Li",
      "Songhe Wang",
      "Ruiquan Huang",
      "Mahanth Gowda",
      "George Kesidis"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.11288",
    "title": "Test Time Embedding Normalization for Popularity Bias Mitigation",
    "abstract": " Comments: 5 pages, CIKM 2023 ",
    "url": "https://arxiv.org/abs/2308.11288",
    "authors": [
      "Dain Kim",
      "Jinhyeok Park",
      "Dongwoo Kim"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.12538",
    "title": "Mutual-Guided Dynamic Network for Image Fusion",
    "abstract": " Comments: ACMMM 2023 accepted ",
    "url": "https://arxiv.org/abs/2308.12538",
    "authors": [
      "Yuanshen Guan",
      "Ruikang Xu",
      "Mingde Yao",
      "Lizhi Wang",
      "Zhiwei Xiong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.12740",
    "title": "Human Comprehensible Active Learning of Genome-Scale Metabolic Networks",
    "abstract": " Comments: Invited presentation for AAAI Spring Symposium Series 2023 on Computational Scientific Discovery ",
    "url": "https://arxiv.org/abs/2308.12740",
    "authors": [
      "Lun Ai",
      "Shi-Shun Liang",
      "Wang-Zhou Dai",
      "Liam Hallett",
      "Stephen H. Muggleton",
      "Geoff S. Baldwin"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Molecular Networks (q-bio.MN)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2308.13392",
    "title": "Self-Supervised Representation Learning with Cross-Context Learning  between Global and Hypercolumn Features",
    "abstract": " Title: Self-Supervised Representation Learning with Cross-Context Learning  between Global and Hypercolumn Features ",
    "url": "https://arxiv.org/abs/2308.13392",
    "authors": [
      "Zheng Gao",
      "Chen Feng",
      "Ioannis Patras"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.14705",
    "title": "Diversified Ensemble of Independent Sub-Networks for Robust  Self-Supervised Representation Learning",
    "abstract": " Title: Diversified Ensemble of Independent Sub-Networks for Robust  Self-Supervised Representation Learning ",
    "url": "https://arxiv.org/abs/2308.14705",
    "authors": [
      "Amirhossein Vahidi",
      "Lisa Wimmer",
      "Hüseyin Anil Gündüz",
      "Bernd Bischl",
      "Eyke Hüllermeier",
      "Mina Rezaei"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.15068",
    "title": "A Comprehensive Augmentation Framework for Anomaly Detection",
    "abstract": " Title: A Comprehensive Augmentation Framework for Anomaly Detection ",
    "url": "https://arxiv.org/abs/2308.15068",
    "authors": [
      "Jiang Lin",
      "Yaping Yan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.15734",
    "title": "Efficient and Explainable Graph Neural Architecture Search via  Monte-Carlo Tree Search",
    "abstract": " Title: Efficient and Explainable Graph Neural Architecture Search via  Monte-Carlo Tree Search ",
    "url": "https://arxiv.org/abs/2308.15734",
    "authors": [
      "Yuya Sasaki"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2308.16258",
    "title": "Robust Principles: Architectural Design Principles for Adversarially  Robust CNNs",
    "abstract": " Comments: Published at BMVC'23 ",
    "url": "https://arxiv.org/abs/2308.16258",
    "authors": [
      "ShengYun Peng",
      "Weilin Xu",
      "Cory Cornelius",
      "Matthew Hull",
      "Kevin Li",
      "Rahul Duggal",
      "Mansi Phute",
      "Jason Martin",
      "Duen Horng Chau"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.16259",
    "title": "Materials Informatics Transformer: A Language Model for Interpretable  Materials Properties Prediction",
    "abstract": " Title: Materials Informatics Transformer: A Language Model for Interpretable  Materials Properties Prediction ",
    "url": "https://arxiv.org/abs/2308.16259",
    "authors": [
      "Hongshuo Huang",
      "Rishikesh Magar",
      "Changwen Xu",
      "Amir Barati Farimani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Materials Science (cond-mat.mtrl-sci)",
      "Chemical Physics (physics.chem-ph)"
    ]
  },
  {
    "id": "arXiv:2308.16737",
    "title": "Robust Networked Federated Learning for Localization",
    "abstract": " Title: Robust Networked Federated Learning for Localization ",
    "url": "https://arxiv.org/abs/2308.16737",
    "authors": [
      "Reza Mirzaeifard",
      "Naveen K. D. Venkategowda",
      "Stefan Werner"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16818",
    "title": "Irregular Traffic Time Series Forecasting Based on Asynchronous  Spatio-Temporal Graph Convolutional Network",
    "abstract": " Title: Irregular Traffic Time Series Forecasting Based on Asynchronous  Spatio-Temporal Graph Convolutional Network ",
    "url": "https://arxiv.org/abs/2308.16818",
    "authors": [
      "Weijia Zhang",
      "Le Zhang",
      "Jindong Han",
      "Hao Liu",
      "Jingbo Zhou",
      "Yu Mei",
      "Hui Xiong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.16891",
    "title": "GNFactor: Multi-Task Real Robot Learning with Generalizable Neural  Feature Fields",
    "abstract": " Comments: CoRL 2023 Oral. Website: this https URL ",
    "url": "https://arxiv.org/abs/2308.16891",
    "authors": [
      "Yanjie Ze",
      "Ge Yan",
      "Yueh-Hua Wu",
      "Annabella Macaluso",
      "Yuying Ge",
      "Jianglong Ye",
      "Nicklas Hansen",
      "Li Erran Li",
      "Xiaolong Wang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  }
]