[
  {
    "id": "arXiv:2202.11742",
    "title": "Think Global, Act Local: Dual-scale Graph Transformer for  Vision-and-Language Navigation",
    "abstract": "Following language instructions to navigate in unseen environments is a challenging problem for autonomous embodied agents. The agent not only needs to ground languages in visual scenes, but also should explore the environment to reach its target. In this work, we propose a dual-scale graph transformer (DUET) for joint long-term action planning and fine-grained cross-modal understanding. We build a topological map on-the-fly to enable efficient exploration in global action space. To balance the complexity of large action space reasoning and fine-grained language grounding, we dynamically combine a fine-scale encoding over local observations and a coarse-scale encoding on a global map via graph transformers. The proposed approach, DUET, significantly outperforms state-of-the-art methods on goal-oriented vision-and-language navigation (VLN) benchmarks REVERIE and SOON. It also improves the success rate on the fine-grained VLN benchmark R2R. ",
    "url": "https://arxiv.org/abs/2202.11742",
    "authors": [
      "Shizhe Chen",
      "Pierre-Louis Guhur",
      "Makarand Tapaswi",
      "Cordelia Schmid",
      "Ivan Laptev"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.11756",
    "title": "ML-based Anomaly Detection in Optical Fiber Monitoring",
    "abstract": "Secure and reliable data communication in optical networks is critical for high-speed internet. We propose a data driven approach for the anomaly detection and faults identification in optical networks to diagnose physical attacks such as fiber breaks and optical tapping. The proposed methods include an autoencoder-based anomaly detection and an attention-based bidirectional gated recurrent unit algorithm for the fiber fault identification and localization. We verify the efficiency of our methods by experiments under various attack scenarios using real operational data. ",
    "url": "https://arxiv.org/abs/2202.11756",
    "authors": [
      "Khouloud Abdelli",
      "Joo Yeon Cho",
      "Carsten Tropschug"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2202.11762",
    "title": "Safe Control with Learned Certificates: A Survey of Neural Lyapunov,  Barrier, and Contraction methods",
    "abstract": "Learning-enabled control systems have demonstrated impressive empirical performance on challenging control problems in robotics, but this performance comes at the cost of reduced transparency and lack of guarantees on the safety or stability of the learned controllers. In recent years, new techniques have emerged to provide these guarantees by learning certificates alongside control policies -- these certificates provide concise, data-driven proofs that guarantee the safety and stability of the learned control system. These methods not only allow the user to verify the safety of a learned controller but also provide supervision during training, allowing safety and stability requirements to influence the training process itself. In this paper, we provide a comprehensive survey of this rapidly developing field of certificate learning. We hope that this paper will serve as an accessible introduction to the theory and practice of certificate learning, both to those who wish to apply these tools to practical robotics problems and to those who wish to dive more deeply into the theory of learning for control. ",
    "url": "https://arxiv.org/abs/2202.11762",
    "authors": [
      "Charles Dawson",
      "Sicun Gao",
      "Chuchu Fan"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2202.11768",
    "title": "From Unstructured Text to Causal Knowledge Graphs: A Transformer-Based  Approach",
    "abstract": "Qualitative causal relationships compactly express the direction, dependency, temporal constraints, and monotonicity constraints of discrete or continuous interactions in the world. In everyday or academic language, we may express interactions between quantities (e.g., sleep decreases stress), between discrete events or entities (e.g., a protein inhibits another protein's transcription), or between intentional or functional factors (e.g., hospital patients pray to relieve their pain). Extracting and representing these diverse causal relations are critical for cognitive systems that operate in domains spanning from scientific discovery to social science. This paper presents a transformer-based NLP architecture that jointly extracts knowledge graphs including (1) variables or factors described in language, (2) qualitative causal relationships over these variables, (3) qualifiers and magnitudes that constrain these causal relationships, and (4) word senses to localize each extracted node within a large ontology. We do not claim that our transformer-based architecture is itself a cognitive system; however, we provide evidence of its accurate knowledge graph extraction in real-world domains and the practicality of its resulting knowledge graphs for cognitive systems that perform graph-based reasoning. We demonstrate this approach and include promising results in two use cases, processing textual inputs from academic publications, news articles, and social media. ",
    "url": "https://arxiv.org/abs/2202.11768",
    "authors": [
      "Scott Friedman",
      "Ian Magnusson",
      "Vasanth Sarathy",
      "Sonja Schmer-Galunder"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2202.11770",
    "title": "Development and performance of a HemeLB GPU code for human-scale blood  flow simulation",
    "abstract": "In recent years, it has become increasingly common for high performance computers (HPC) to possess some level of heterogeneous architecture - typically in the form of GPU accelerators. In some machines these are isolated within a dedicated partition, whilst in others they are integral to all compute nodes - often with multiple GPUs per node - and provide the majority of a machine's compute performance. In light of this trend, it is becoming essential that codes deployed on HPC are updated to execute on accelerator hardware. In this paper we introduce a GPU implementation of the 3D blood flow simulation code HemeLB that has been developed using CUDA C++. We demonstrate how taking advantage of NVIDIA GPU hardware can achieve significant performance improvements compared to the equivalent CPU only code on which it has been built whilst retaining the excellent strong scaling characteristics that have been repeatedly demonstrated by the CPU version. With HPC positioned on the brink of the exascale era, we use HemeLB as a motivation to provide a discussion on some of the challenges that many users will face when deploying their own applications on upcoming exascale machines. ",
    "url": "https://arxiv.org/abs/2202.11770",
    "authors": [
      "I. Zacharoudiou",
      "J.W.S. McCullough",
      "P.V. Coveney"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2202.11789",
    "title": "Investigating the effect of binning on causal discovery",
    "abstract": "Binning (a.k.a. discretization) of numerically continuous measurements is a wide-spread but controversial practice in data collection, analysis, and presentation. The consequences of binning have been evaluated for many different kinds of data analysis methods, however so far the effect of binning on causal discovery algorithms has not been directly investigated. This paper reports the results of a simulation study that examined the effect of binning on the Greedy Equivalence Search (GES) causal discovery algorithm. Our findings suggest that unbinned continuous data often result in the highest search performance, but some exceptions are identified. We also found that binned data are more sensitive to changes in sample size and tuning parameters, and identified some interactive effects between sample size, binning, and tuning parameter on performance. ",
    "url": "https://arxiv.org/abs/2202.11789",
    "authors": [
      "Andrew Colt Deckert",
      "Erich Kummerfeld"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.11813",
    "title": "AirGuard -- Protecting Android Users From Stalking Attacks By Apple Find  My Devices",
    "abstract": "Finder networks in general, and Apple's Find My network in particular, can pose a grave threat to users' privacy and even health if these networks are abused for stalking. Apple's release of the AirTag, a very affordable tracker covered by the nearly ubiquitous Find My network, amplified this issue. While Apple provides a stalking detection feature within its ecosystem, billions of Android users are still left in the dark. Apple recently released the Android app \"Tracker Detect,\" which does not deliver a convincing feature set for stalking protection. We reverse engineer Apple's tracking protection in iOS and discuss its features regarding stalking detection. We design \"AirGuard\" and release it as an Android app to protect against abuse by Apple tracking devices. We compare the performance of our solution with the Apple-provided one in iOS and study the use of AirGuard in the wild over multiple weeks using data contributed by tens of thousands of active users. ",
    "url": "https://arxiv.org/abs/2202.11813",
    "authors": [
      "Alexander Heinrich",
      "Niklas Bittner",
      "Matthias Hollick"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2202.11821",
    "title": "Physics-informed neural networks for inverse problems in supersonic  flows",
    "abstract": "Accurate solutions to inverse supersonic compressible flow problems are often required for designing specialized aerospace vehicles. In particular, we consider the problem where we have data available for density gradients from Schlieren photography as well as data at the inflow and part of wall boundaries. These inverse problems are notoriously difficult and traditional methods may not be adequate to solve such ill-posed inverse problems. To this end, we employ the physics-informed neural networks (PINNs) and its extended version, extended PINNs (XPINNs), where domain decomposition allows deploying locally powerful neural networks in each subdomain, which can provide additional expressivity in subdomains, where a complex solution is expected. Apart from the governing compressible Euler equations, we also enforce the entropy conditions in order to obtain viscosity solutions. Moreover, we enforce positivity conditions on density and pressure. We consider inverse problems involving two-dimensional expansion waves, two-dimensional oblique and bow shock waves. We compare solutions obtained by PINNs and XPINNs and invoke some theoretical results that can be used to decide on the generalization errors of the two methods. ",
    "url": "https://arxiv.org/abs/2202.11821",
    "authors": [
      "Ameya D. Jagtap",
      "Zhiping Mao",
      "Nikolaus Adams",
      "George Em Karniadakis"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.11824",
    "title": "Using Deep Learning to Detect Digitally Encoded DNA Trigger for Trojan  Malware in Bio-Cyber Attacks",
    "abstract": "This article uses Deep Learning technologies to safeguard DNA sequencing against Bio-Cyber attacks. We consider a hybrid attack scenario where the payload is encoded into a DNA sequence to activate a Trojan malware implanted in a software tool used in the sequencing pipeline in order to allow the perpetrators to gain control over the resources used in that pipeline during sequence analysis. The scenario considered in the paper is based on perpetrators submitting synthetically engineered DNA samples that contain digitally encoded IP address and port number of the perpetrators machine in the DNA. Genetic analysis of the samples DNA will decode the address that is used by the software trojan malware to activate and trigger a remote connection. This approach can open up to multiple perpetrators to create connections to hijack the DNA sequencing pipeline. As a way of hiding the data, the perpetrators can avoid detection by encoding the address to maximise similarity with genuine DNAs, which we showed previously. However, in this paper we show how Deep Learning can be used to successfully detect and identify the trigger encoded data, in order to protect a DNA sequencing pipeline from trojan attacks. The result shows nearly up to 100% accuracy in detection in such a novel Trojan attack scenario even after applying fragmentation encryption and steganography on the encoded trigger data. In addition, feasibility of designing and synthesizing encoded DNA for such Trojan payloads is validated by a wet lab experiment. ",
    "url": "https://arxiv.org/abs/2202.11824",
    "authors": [
      "Mohd Siblee Islam",
      "Stepan Ivanov",
      "Hamdan Awan",
      "Jennifer Drohan",
      "Sasitharan Balasubramaniam",
      "Lee Coffey",
      "Srivatsan Kidambi",
      "Witty Sri-saan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.11838",
    "title": "Explanatory Paradigms in Neural Networks",
    "abstract": "In this article, we present a leap-forward expansion to the study of explainability in neural networks by considering explanations as answers to abstract reasoning-based questions. With $P$ as the prediction from a neural network, these questions are `Why P?', `What if not P?', and `Why P, rather than Q?' for a given contrast prediction $Q$. The answers to these questions are observed correlations, observed counterfactuals, and observed contrastive explanations respectively. Together, these explanations constitute the abductive reasoning scheme. We term the three explanatory schemes as observed explanatory paradigms. The term observed refers to the specific case of post-hoc explainability, when an explanatory technique explains the decision $P$ after a trained neural network has made the decision $P$. The primary advantage of viewing explanations through the lens of abductive reasoning-based questions is that explanations can be used as reasons while making decisions. The post-hoc field of explainability, that previously only justified decisions, becomes active by being involved in the decision making process and providing limited, but relevant and contextual interventions. The contributions of this article are: ($i$) realizing explanations as reasoning paradigms, ($ii$) providing a probabilistic definition of observed explanations and their completeness, ($iii$) creating a taxonomy for evaluation of explanations, and ($iv$) positioning gradient-based complete explanainability's replicability and reproducibility across multiple applications and data modalities, ($v$) code repositories, publicly available at https://github.com/olivesgatech/Explanatory-Paradigms. ",
    "url": "https://arxiv.org/abs/2202.11838",
    "authors": [
      "Ghassan AlRegib",
      "Mohit Prabhushankar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.11841",
    "title": "DC and SA: Robust and Efficient Hyperparameter Optimization of  Multi-subnetwork Deep Learning Models",
    "abstract": "We present two novel hyperparameter optimization strategies for optimization of deep learning models with a modular architecture constructed of multiple subnetworks. As complex networks with multiple subnetworks become more frequently applied in machine learning, hyperparameter optimization methods are required to efficiently optimize their hyperparameters. Existing hyperparameter searches are general, and can be used to optimize such networks, however, by exploiting the multi-subnetwork architecture, these searches can be sped up substantially. The proposed methods offer faster convergence to a better-performing final model. To demonstrate this, we propose 2 independent approaches to enhance these prior algorithms: 1) a divide-and-conquer approach, in which the best subnetworks of top-performing models are combined, allowing for more rapid sampling of the hyperparameter search space. 2) A subnetwork adaptive approach that distributes computational resources based on the importance of each subnetwork, allowing more intelligent resource allocation. These approaches can be flexibily applied to many hyperparameter optimization algorithms. To illustrate this, we combine our approaches with the commonly-used Bayesian optimization method. Our approaches are then tested against both synthetic examples and real-world examples and applied to multiple network types including convolutional neural networks and dense feed forward neural networks. Our approaches show an increased optimization efficiency of up to 23.62x, and a final performance boost of up to 3.5% accuracy for classification and 4.4 MSE for regression, when compared to comparable BO approach. ",
    "url": "https://arxiv.org/abs/2202.11841",
    "authors": [
      "Alex H. Treacher",
      "Albert Montillo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.11850",
    "title": "Robust Federated Learning with Connectivity Failures: A  Semi-Decentralized Framework with Collaborative Relaying",
    "abstract": "Intermittent client connectivity is one of the major challenges in centralized federated edge learning frameworks. Intermittently failing uplinks to the central parameter server (PS) can induce a large generalization gap in performance especially when the data distribution among the clients exhibits heterogeneity. In this work, to mitigate communication blockages between clients and the central PS, we introduce the concept of knowledge relaying wherein the successfully participating clients collaborate in relaying their neighbors' local updates to a central parameter server (PS) in order to boost the participation of clients with intermittently failing connectivity. We propose a collaborative relaying based semi-decentralized federated edge learning framework where at every communication round each client first computes a local consensus of the updates from its neighboring clients and eventually transmits a weighted average of its own update and those of its neighbors to the PS. We appropriately optimize these averaging weights to reduce the variance of the global update at the PS while ensuring that the global update is unbiased, consequently improving the convergence rate. Finally, by conducting experiments on CIFAR-10 dataset we validate our theoretical results and demonstrate that our proposed scheme is superior to Federated averaging benchmark especially when data distribution among clients is non-iid. ",
    "url": "https://arxiv.org/abs/2202.11850",
    "authors": [
      "Michal Yemini",
      "Rajarshi Saha",
      "Emre Ozfatura",
      "Deniz Gündüz",
      "Andrea J. Goldsmith"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2202.11855",
    "title": "Learning Multi-Object Dynamics with Compositional Neural Radiance Fields",
    "abstract": "We present a method to learn compositional predictive models from image observations based on implicit object encoders, Neural Radiance Fields (NeRFs), and graph neural networks. A central question in learning dynamic models from sensor observations is on which representations predictions should be performed. NeRFs have become a popular choice for representing scenes due to their strong 3D prior. However, most NeRF approaches are trained on a single scene, representing the whole scene with a global model, making generalization to novel scenes, containing different numbers of objects, challenging. Instead, we present a compositional, object-centric auto-encoder framework that maps multiple views of the scene to a \\emph{set} of latent vectors representing each object separately. The latent vectors parameterize individual NeRF models from which the scene can be reconstructed and rendered from novel viewpoints. We train a graph neural network dynamics model in the latent space to achieve compositionality for dynamics prediction. A key feature of our approach is that the learned 3D information of the scene through the NeRF model enables us to incorporate structural priors in learning the dynamics models, making long-term predictions more stable. The model can further be used to synthesize new scenes from individual object observations. For planning, we utilize RRTs in the learned latent space, where we can exploit our model and the implicit object encoder to make sampling the latent space informative and more efficient. In the experiments, we show that the model outperforms several baselines on a pushing task containing many objects. Video: https://dannydriess.github.io/compnerfdyn/ ",
    "url": "https://arxiv.org/abs/2202.11855",
    "authors": [
      "Danny Driess",
      "Zhiao Huang",
      "Yunzhu Li",
      "Russ Tedrake",
      "Marc Toussaint"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2202.11860",
    "title": "Robust Transmission Design for RIS-assisted Secure Multiuser  Communication Systems in the Presence of Hardware Impairments",
    "abstract": "This paper investigates reconfigurable intelligent surface (RIS)-assisted secure multiuser communication systems subject to hardware impairments (HIs). We jointly optimize the beamforming vectors at the base station (BS) and the phase shifts of the reflecting elements at the RIS so as to maximize the weighted minimum secrecy rate (WMSR), subject to both transmission power constraints at the BS and unit-modulus constraints at the RIS. To address the formulated optimization problem, we first decouple it into two tractable subproblems and then use the block coordinate descent (BCD) method to alternately optimize the subproblems. Two different methods are proposed to solve the two obtained subproblems. The first method transforms each subproblem into a second order cone programming (SOCP) problem, which can be directly solved using CVX. The second method leverages the Minorization- Maximization (MM) algorithm. Specifically, we first derive a concave approximation function, which is a lower bound of the original objective function, and then the two subproblems are transformed into two simple surrogate problems with closedform solutions. Simulation results verify the performance gains of the proposed robust transmission method over existing nonrobust designs. In addition, the MM algorithm is shown to have much lower complexity than the SOCP-based algorithm. ",
    "url": "https://arxiv.org/abs/2202.11860",
    "authors": [
      "Zhangjie Peng",
      "Ruisong Weng",
      "Cunhua Pan",
      "Gui Zhou",
      "Marco Di Renzo",
      "A. Lee Swindlehurst"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2202.11865",
    "title": "Using calibrator to improve robustness in Machine Reading Comprehension",
    "abstract": "Machine Reading Comprehension(MRC) has achieved a remarkable result since some powerful models, such as BERT, are proposed. However, these models are not robust enough and vulnerable to adversarial input perturbation and generalization examples. Some works tried to improve the performance on specific types of data by adding some related examples into training data while it leads to degradation on the original dataset, because the shift of data distribution makes the answer ranking based on the softmax probability of model unreliable. In this paper, we propose a method to improve the robustness by using a calibrator as the post-hoc reranker, which is implemented based on XGBoost model. The calibrator combines both manual features and representation learning features to rerank candidate results. Experimental results on adversarial datasets show that our model can achieve performance improvement by more than 10\\% and also make improvement on the original and generalization datasets. ",
    "url": "https://arxiv.org/abs/2202.11865",
    "authors": [
      "Jing Jin",
      "Houfeng Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2202.11868",
    "title": "CG-SSD: Corner Guided Single Stage 3D Object Detection from LiDAR Point  Cloud",
    "abstract": "At present, the anchor-based or anchor-free models that use LiDAR point clouds for 3D object detection use the center assigner strategy to infer the 3D bounding boxes. However, in a real world scene, the LiDAR can only acquire a limited object surface point clouds, but the center point of the object does not exist. Obtaining the object by aggregating the incomplete surface point clouds will bring a loss of accuracy in direction and dimension estimation. To address this problem, we propose a corner-guided anchor-free single-stage 3D object detection model (CG-SSD ).Firstly, 3D sparse convolution backbone network composed of residual layers and sub-manifold sparse convolutional layers are used to construct bird's eye view (BEV) features for further deeper feature mining by a lite U-shaped network; Secondly, a novel corner-guided auxiliary module (CGAM) is proposed to incorporate corner supervision signals into the neural network. CGAM is explicitly designed and trained to detect partially visible and invisible corners to obtains a more accurate object feature representation, especially for small or partial occluded objects; Finally, the deep features from both the backbone networks and CGAM module are concatenated and fed into the head module to predict the classification and 3D bounding boxes of the objects in the scene. The experiments demonstrate CG-SSD achieves the state-of-art performance on the ONCE benchmark for supervised 3D object detection using single frame point cloud data, with 62.77%mAP. Additionally, the experiments on ONCE and Waymo Open Dataset show that CGAM can be extended to most anchor-based models which use the BEV feature to detect objects, as a plug-in and bring +1.17%-+14.27%AP improvement. ",
    "url": "https://arxiv.org/abs/2202.11868",
    "authors": [
      "Ruiqi Ma",
      "Chi Chen",
      "Bisheng Yang",
      "Deren Li",
      "Haiping Wang",
      "Yangzi Cong",
      "Zongtian Hu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.11884",
    "title": "M2I: From Factored Marginal Trajectory Prediction to Interactive  Prediction",
    "abstract": "Predicting future motions of road participants is an important task for driving autonomously in urban scenes. Existing models excel at predicting marginal trajectories for single agents, yet it remains an open question to jointly predict scene compliant trajectories over multiple agents. The challenge is due to exponentially increasing prediction space as a function of the number of agents. In this work, we exploit the underlying relations between interacting agents and decouple the joint prediction problem into marginal prediction problems. Our proposed approach M2I first classifies interacting agents as pairs of influencers and reactors, and then leverages a marginal prediction model and a conditional prediction model to predict trajectories for the influencers and reactors, respectively. The predictions from interacting agents are combined and selected according to their joint likelihoods. Experiments show that our simple but effective approach achieves state-of-the-art performance on the Waymo Open Motion Dataset interactive prediction benchmark. ",
    "url": "https://arxiv.org/abs/2202.11884",
    "authors": [
      "Qiao Sun",
      "Xin Huang",
      "Junru Gu",
      "Brian C. Williams",
      "Hang Zhao"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.11885",
    "title": "A Partition-and-Merge Algorithm for Solving the Steiner Tree Problem in  Large Graphs",
    "abstract": "The Steiner tree problem, which asks for a minimum weighted tree spanning a given set of terminal vertices in a given graph, is a classic problem arising in numerous practical applications. Many algorithms about this problem emerged in the past decade, especially presented in the 11th DIMACS Challenge in 2014 and the 3rd PACE Competition in 2018. In this paper, we present a novel partition-and-merge algorithm for effectively solving this NP-hard problem in large graphs. The algorithm first breaks the input graph into small fragments and then gradually builds up the graph in a level-by-level manner. Intuitively, the method aggregates information that is found by local search at each level into the final graph. We assess the algorithm on a wide range of benchmark instances, showing that the algorithm outperforms the winners of DIMACS and PACE challenges on large instances and competes favorably with them on small or middle-sized instances. ",
    "url": "https://arxiv.org/abs/2202.11885",
    "authors": [
      "Xinyu Wu",
      "Yi Zhou",
      "Jin-Kao Hao",
      "Zhang-Hua Fu"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2202.11898",
    "title": "Improving Robustness of Convolutional Neural Networks Using Element-Wise  Activation Scaling",
    "abstract": "Recent works reveal that re-calibrating the intermediate activation of adversarial examples can improve the adversarial robustness of a CNN model. The state of the arts [Baiet al., 2021] and [Yanet al., 2021] explores this feature at the channel level, i.e. the activation of a channel is uniformly scaled by a factor. In this paper, we investigate the intermediate activation manipulation at a more fine-grained level. Instead of uniformly scaling the activation, we individually adjust each element within an activation and thus propose Element-Wise Activation Scaling, dubbed EWAS, to improve CNNs' adversarial robustness. Experimental results on ResNet-18 and WideResNet with CIFAR10 and SVHN show that EWAS significantly improves the robustness accuracy. Especially for ResNet18 on CIFAR10, EWAS increases the adversarial accuracy by 37.65% to 82.35% against C&W attack. EWAS is simple yet very effective in terms of improving robustness. The codes are anonymously available at https://anonymous.4open.science/r/EWAS-DD64. ",
    "url": "https://arxiv.org/abs/2202.11898",
    "authors": [
      "Zhi-Yuan Zhang",
      "Di Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.11910",
    "title": "Robust Probabilistic Time Series Forecasting",
    "abstract": "Probabilistic time series forecasting has played critical role in decision-making processes due to its capability to quantify uncertainties. Deep forecasting models, however, could be prone to input perturbations, and the notion of such perturbations, together with that of robustness, has not even been completely established in the regime of probabilistic forecasting. In this work, we propose a framework for robust probabilistic time series forecasting. First, we generalize the concept of adversarial input perturbations, based on which we formulate the concept of robustness in terms of bounded Wasserstein deviation. Then we extend the randomized smoothing technique to attain robust probabilistic forecasters with theoretical robustness certificates against certain classes of adversarial perturbations. Lastly, extensive experiments demonstrate that our methods are empirically effective in enhancing the forecast quality under additive adversarial attacks and forecast consistency under supplement of noisy observations. ",
    "url": "https://arxiv.org/abs/2202.11910",
    "authors": [
      "TaeHo Yoon",
      "Youngsuk Park",
      "Ernest K. Ryu",
      "Yuyang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.11911",
    "title": "When Transformer Meets Robotic Grasping: Exploits Context for Efficient  Grasp Detection",
    "abstract": "In this paper, we present a transformer-based architecture, namely TF-Grasp, for robotic grasp detection. The developed TF-Grasp framework has two elaborate designs making it well suitable for visual grasping tasks. The first key design is that we adopt the local window attention to capture local contextual information and detailed features of graspable objects. Then, we apply the cross window attention to model the long-term dependencies between distant pixels. Object knowledge, environmental configuration, and relationships between different visual entities are aggregated for subsequent grasp detection. The second key design is that we build a hierarchical encoder-decoder architecture with skip-connections, delivering shallow features from encoder to decoder to enable a multi-scale feature fusion. Due to the powerful attention mechanism, the TF-Grasp can simultaneously obtain the local information (i.e., the contours of objects), and model long-term connections such as the relationships between distinct visual concepts in clutter. Extensive computational experiments demonstrate that the TF-Grasp achieves superior results versus state-of-art grasping convolutional models and attain a higher accuracy of 97.99% and 94.6% on Cornell and Jacquard grasping datasets, respectively. Real-world experiments using a 7DoF Franka Emika Panda robot also demonstrate its capability of grasping unseen objects in a variety of scenarios. The code and pre-trained models will be available at https://github.com/WangShaoSUN/grasp-transformer ",
    "url": "https://arxiv.org/abs/2202.11911",
    "authors": [
      "Shaochen Wang",
      "Zhangli Zhou",
      "Zhen Kan"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.11917",
    "title": "Machine Learning for Intrusion Detection in Industrial Control Systems:  Applications, Challenges, and Recommendations",
    "abstract": "Methods from machine learning are being applied to design Industrial Control Systems resilient to cyber-attacks. Such methods focus on two major areas: the detection of intrusions at the network-level using the information acquired through network packets, and detection of anomalies at the physical process level using data that represents the physical behavior of the system. This survey focuses on four types of methods from machine learning in use for intrusion and anomaly detection, namely, supervised, semi-supervised, unsupervised, and reinforcement learning. Literature available in the public domain was carefully selected, analyzed, and placed in a 7-dimensional space for ease of comparison. The survey is targeted at researchers, students, and practitioners. Challenges associated in using the methods and research gaps are identified and recommendations are made to fill the gaps. ",
    "url": "https://arxiv.org/abs/2202.11917",
    "authors": [
      "Muhammad Azmi Umer",
      "Khurum Nazir Junejo",
      "Muhammad Taha Jilani",
      "Aditya P. Mathur"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.11929",
    "title": "Word Segmentation on Discovered Phone Units with Dynamic Programming and  Self-Supervised Scoring",
    "abstract": "Recent work on unsupervised speech segmentation has used self-supervised models with a phone segmentation module and a word segmentation module that are trained jointly. This paper compares this joint methodology with an older idea: bottom-up phone-like unit discovery is performed first, and symbolic word segmentation is then performed on top of the discovered units (without influencing the lower level). I specifically describe a duration-penalized dynamic programming (DPDP) procedure that can be used for either phone or word segmentation by changing the self-supervised scoring network that gives segment costs. For phone discovery, DPDP is applied with a contrastive predictive coding clustering model, while for word segmentation it is used with an autoencoding recurrent neural network. The two models are chained in order to segment speech. This approach gives comparable word segmentation results to state-of-the-art joint self-supervised models on an English benchmark. On French and Mandarin data, it outperforms previous systems on the ZeroSpeech benchmarks. Analysis shows that the chained DPDP system segments shorter filler words well, but longer words might require an external top-down signal. ",
    "url": "https://arxiv.org/abs/2202.11929",
    "authors": [
      "Herman Kamper"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2202.11944",
    "title": "Computer Aided Diagnosis and Out-of-Distribution Detection in Glaucoma  Screening Using Color Fundus Photography",
    "abstract": "Artificial Intelligence for RObust Glaucoma Screening (AIROGS) Challenge is held for developing solutions for glaucoma screening from color fundus photography that are robust to real-world scenarios. This report describes our method submitted to the AIROGS challenge. Our method employs convolutional neural networks to classify input images to \"referable glaucoma\" or \"no referable glaucoma\". In addition, we introduce an inference-time out-of-distribution (OOD) detection method to identify ungradable images. Our OOD detection is based on an energy-based method combined with activation rectification. ",
    "url": "https://arxiv.org/abs/2202.11944",
    "authors": [
      "Satoshi Kondo",
      "Satoshi Kasai",
      "Kosuke Hirasawa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.11946",
    "title": "Temporal Efficient Training of Spiking Neural Network via Gradient  Re-weighting",
    "abstract": "Recently, brain-inspired spiking neuron networks (SNNs) have attracted widespread research interest because of their event-driven and energy-efficient characteristics. Still, it is difficult to efficiently train deep SNNs due to the non-differentiability of its activation function, which disables the typically used gradient descent approaches for traditional artificial neural networks (ANNs). Although the adoption of surrogate gradient (SG) formally allows for the back-propagation of losses, the discrete spiking mechanism actually differentiates the loss landscape of SNNs from that of ANNs, failing the surrogate gradient methods to achieve comparable accuracy as for ANNs. In this paper, we first analyze why the current direct training approach with surrogate gradient results in SNNs with poor generalizability. Then we introduce the temporal efficient training (TET) approach to compensate for the loss of momentum in the gradient descent with SG so that the training process can converge into flatter minima with better generalizability. Meanwhile, we demonstrate that TET improves the temporal scalability of SNN and induces a temporal inheritable training for acceleration. Our method consistently outperforms the SOTA on all reported mainstream datasets, including CIFAR-10/100 and ImageNet. Remarkably on DVS-CIFAR10, we obtained 83$\\%$ top-1 accuracy, over 10$\\%$ improvement compared to existing state of the art. Codes are available at \\url{https://github.com/Gus-Lab/temporal_efficient_training}. ",
    "url": "https://arxiv.org/abs/2202.11946",
    "authors": [
      "Shikuang Deng",
      "Yuhang Li",
      "Shanghang Zhang",
      "Shi Gu"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.11948",
    "title": "Domain Disentangled Generative Adversarial Network for Zero-Shot  Sketch-Based 3D Shape Retrieval",
    "abstract": "Sketch-based 3D shape retrieval is a challenging task due to the large domain discrepancy between sketches and 3D shapes. Since existing methods are trained and evaluated on the same categories, they cannot effectively recognize the categories that have not been used during training. In this paper, we propose a novel domain disentangled generative adversarial network (DD-GAN) for zero-shot sketch-based 3D retrieval, which can retrieve the unseen categories that are not accessed during training. Specifically, we first generate domain-invariant features and domain-specific features by disentangling the learned features of sketches and 3D shapes, where the domain-invariant features are used to align with the corresponding word embeddings. Then, we develop a generative adversarial network that combines the domainspecific features of the seen categories with the aligned domain-invariant features to synthesize samples, where the synthesized samples of the unseen categories are generated by using the corresponding word embeddings. Finally, we use the synthesized samples of the unseen categories combined with the real samples of the seen categories to train the network for retrieval, so that the unseen categories can be recognized. In order to reduce the domain shift between the synthesized domain and the real domain, we adopt the transductive setting to reduce the gap between the distributions of the synthesized unseen categories and real unseen categories. Extensive experiments on the SHREC'13 and SHREC'14 datasets show that our method significantly improves the retrieval performance of the unseen categories. ",
    "url": "https://arxiv.org/abs/2202.11948",
    "authors": [
      "Rui Xu",
      "Zongyan Han",
      "Le Hui",
      "Jianjun Qian",
      "Jin Xie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.11958",
    "title": "Cognitive Semantic Communication Systems Driven by Knowledge Graph",
    "abstract": "Semantic communication is envisioned as a promising technique to break through the Shannon limit. However, the existing semantic communication frameworks do not involve inference and error correction, which limits the achievable performance. In this paper, in order to tackle this issue, a cognitive semantic communication framework is proposed by exploiting knowledge graph. Moreover, a simple, general and interpretable solution for semantic information detection is developed by exploiting triples as semantic symbols. It also allows the receiver to correct errors occurring at the symbolic level. Furthermore, the pre-trained model is fine-tuned to recover semantic information, which overcomes the drawback that a fixed bit length coding is used to encode sentences of different lengths. Simulation results on the public WebNLG corpus show that our proposed system is superior to other benchmark systems in terms of the data compression rate and the reliability of communication. ",
    "url": "https://arxiv.org/abs/2202.11958",
    "authors": [
      "Fuhui Zhou",
      "Yihao Li",
      "Xinyuan Zhang",
      "Qihui Wu",
      "Xianfu Lei",
      "Rose Qingyang Hu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.11961",
    "title": "\"Is not the truth the truth?\": Analyzing the Impact of User Validations  for Bus In/Out Detection in Smartphone-based Surveys",
    "abstract": "Passenger flow allows the study of users' behavior through the public network and assists in designing new facilities and services. This flow is observed through interactions between passengers and infrastructure. For this task, Bluetooth technology and smartphones represent the ideal solution. The latter component allows users' identification, authentication, and billing, while the former allows short-range implicit interactions, device-to-device. To assess the potential of such a use case, we need to verify how robust Bluetooth signal and related machine learning (ML) classifiers are against the noise of realistic contexts. Therefore, we model binary passenger states with respect to a public vehicle, where one can either be-in or be-out (BIBO). The BIBO label identifies a fundamental building block of continuously-valued passenger flow. This paper describes the Human-Computer interaction experimental setting in a semi-controlled environment, which involves: two autonomous vehicles operating on two routes, serving three bus stops and eighteen users, as well as a proprietary smartphone-Bluetooth sensing platform. The resulting dataset includes multiple sensors' measurements of the same event and two ground-truth levels, the first being validation by participants, the second by three video-cameras surveilling buses and track. We performed a Monte-Carlo simulation of labels-flip to emulate human errors in the labeling process, as is known to happen in smartphone surveys; next we used such flipped labels for supervised training of ML classifiers. The impact of errors on model performance bias can be large. Results show ML tolerance to label flips caused by human or machine errors up to 30%. ",
    "url": "https://arxiv.org/abs/2202.11961",
    "authors": [
      "Valentino Servizi.",
      "Dan R. Persson",
      "Francisco C. Pereira",
      "Hannah Villadsen",
      "Per Bækgaard",
      "Inon Peled",
      "Otto A. Nielsen"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.11962",
    "title": "Large Scale Passenger Detection with Smartphone/Bus Implicit Interaction  and Multisensory Unsupervised Cause-effect Learning",
    "abstract": "Intelligent Transportation Systems (ITS) underpin the concept of Mobility as a Service (MaaS), which requires universal and seamless users' access across multiple public and private transportation systems while allowing operators' proportional revenue sharing. Current user sensing technologies such as Walk-in/Walk-out (WIWO) and Check-in/Check-out (CICO) have limited scalability for large-scale deployments. These limitations prevent ITS from supporting analysis, optimization, calculation of revenue sharing, and control of MaaS comfort, safety, and efficiency. We focus on the concept of implicit Be-in/Be-out (BIBO) smartphone-sensing and classification. To close the gap and enhance smartphones towards MaaS, we developed a proprietary smartphone-sensing platform collecting contemporary Bluetooth Low Energy (BLE) signals from BLE devices installed on buses and Global Positioning System (GPS) locations of both buses and smartphones. To enable the training of a model based on GPS features against the BLE pseudo-label, we propose the Cause-Effect Multitask Wasserstein Autoencoder (CEMWA). CEMWA combines and extends several frameworks around Wasserstein autoencoders and neural networks. As a dimensionality reduction tool, CEMWA obtains an auto-validated representation of a latent space describing users' smartphones within the transport system. This representation allows BIBO clustering via DBSCAN. We perform an ablation study of CEMWA's alternative architectures and benchmark against the best available supervised methods. We analyze performance's sensitivity to label quality. Under the na\\\"ive assumption of accurate ground truth, XGBoost outperforms CEMWA. Although XGBoost and Random Forest prove to be tolerant to label noise, CEMWA is agnostic to label noise by design and provides the best performance with an 88\\% F1 score. ",
    "url": "https://arxiv.org/abs/2202.11962",
    "authors": [
      "Valentino Servizi",
      "Dan R. Persson",
      "Francisco C. Pereira",
      "Hannah Villadsen",
      "Per Bækgaard",
      "Jeppe Rich",
      "Otto A. Nielsen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2202.11969",
    "title": "Should I Get Involved? On the Privacy Perils of Mining Software  Repositories for Research Participants",
    "abstract": "Mining Software Repositories (MSRs) is an evidence-based methodology that cross-links data to uncover actionable information about software systems. Empirical studies in software engineering often leverage MSR techniques as they allow researchers to unveil issues and flaws in software development so as to analyse the different factors contributing to them. Hence, counting on fine-grained information about the repositories and sources being mined (e.g., server names, and contributors' identities) is essential for the reproducibility and transparency of MSR studies. However, this can also introduce threats to participants' privacy as their identities may be linked to flawed/sub-optimal programming practices (e.g., code smells, improper documentation), or vice-versa. Moreover, this can be extensible to close collaborators and community members resulting \"guilty by association\". This position paper aims to start a discussion about indirect participation in MSRs investigations, the dichotomy of 'privacy vs. utility' regarding sharing non-aggregated data, and its effects on privacy restrictions and ethical considerations for participant involvement. ",
    "url": "https://arxiv.org/abs/2202.11969",
    "authors": [
      "Melina Vidoni",
      "Nicolás E. Díaz Ferreyra"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2202.11981",
    "title": "Fully Self-Supervised Learning for Semantic Segmentation",
    "abstract": "In this work, we present a fully self-supervised framework for semantic segmentation(FS^4). A fully bootstrapped strategy for semantic segmentation, which saves efforts for the huge amount of annotation, is crucial for building customized models from end-to-end for open-world domains. This application is eagerly needed in realistic scenarios. Even though recent self-supervised semantic segmentation methods have gained great progress, these works however heavily depend on the fully-supervised pretrained model and make it impossible a fully self-supervised pipeline. To solve this problem, we proposed a bootstrapped training scheme for semantic segmentation, which fully leveraged the global semantic knowledge for self-supervision with our proposed PGG strategy and CAE module. In particular, we perform pixel clustering and assignments for segmentation supervision. Preventing it from clustering a mess, we proposed 1) a pyramid-global-guided (PGG) training strategy to supervise the learning with pyramid image/patch-level pseudo labels, which are generated by grouping the unsupervised features. The stable global and pyramid semantic pseudo labels can prevent the segmentation from learning too many clutter regions or degrading to one background region; 2) in addition, we proposed context-aware embedding (CAE) module to generate global feature embedding in view of its neighbors close both in space and appearance in a non-trivial way. We evaluate our method on the large-scale COCO-Stuff dataset and achieved 7.19 mIoU improvements on both things and stuff objects ",
    "url": "https://arxiv.org/abs/2202.11981",
    "authors": [
      "Yuan Wang",
      "Wei Zhuo",
      "Yucong Li",
      "Zhi Wang",
      "Qi Ju",
      "Wenwu Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.11982",
    "title": "N-QGN: Navigation Map from a Monocular Camera using Quadtree Generating  Networks",
    "abstract": "Monocular depth estimation has been a popular area of research for several years, especially since self-supervised networks have shown increasingly good results in bridging the gap with supervised and stereo methods. However, these approaches focus their interest on dense 3D reconstruction and sometimes on tiny details that are superfluous for autonomous navigation. In this paper, we propose to address this issue by estimating the navigation map under a quadtree representation. The objective is to create an adaptive depth map prediction that only extract details that are essential for the obstacle avoidance. Other 3D space which leaves large room for navigation will be provided with approximate distance. Experiment on KITTI dataset shows that our method can significantly reduce the number of output information without major loss of accuracy. ",
    "url": "https://arxiv.org/abs/2202.11982",
    "authors": [
      "Daniel Braun",
      "Olivier Morel",
      "Pascal Vasseur",
      "Cédric Demonceaux"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.11985",
    "title": "Can deep neural networks learn process model structure? An assessment  framework and analysis",
    "abstract": "Predictive process monitoring concerns itself with the prediction of ongoing cases in (business) processes. Prediction tasks typically focus on remaining time, outcome, next event or full case suffix prediction. Various methods using machine and deep learning havebeen proposed for these tasks in recent years. Especially recurrent neural networks (RNNs) such as long short-term memory nets (LSTMs) have gained in popularity. However, no research focuses on whether such neural network-based models can truly learn the structure of underlying process models. For instance, can such neural networks effectively learn parallel behaviour or loops? Therefore, in this work, we propose an evaluation scheme complemented with new fitness, precision, and generalisation metrics, specifically tailored towards measuring the capacity of deep learning models to learn process model structure. We apply this framework to several process models with simple control-flow behaviour, on the task of next-event prediction. Our results show that, even for such simplistic models, careful tuning of overfitting countermeasures is required to allow these models to learn process model structure. ",
    "url": "https://arxiv.org/abs/2202.11985",
    "authors": [
      "Jari Peeperkorn",
      "Seppe vanden Broucke",
      "Jochen De Weerdt"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.11987",
    "title": "Predicting the impact of treatments over time with uncertainty aware  neural differential equations",
    "abstract": "Predicting the impact of treatments from observational data only still represents a majorchallenge despite recent significant advances in time series modeling. Treatment assignments are usually correlated with the predictors of the response, resulting in a lack of data support for counterfactual predictions and therefore in poor quality estimates. Developments in causal inference have lead to methods addressing this confounding by requiring a minimum level of overlap. However,overlap is difficult to assess and usually notsatisfied in practice. In this work, we propose Counterfactual ODE (CF-ODE), a novel method to predict the impact of treatments continuously over time using Neural Ordinary Differential Equations equipped with uncertainty estimates. This allows to specifically assess which treatment outcomes can be reliably predicted. We demonstrate over several longitudinal data sets that CF-ODE provides more accurate predictions and more reliable uncertainty estimates than previously available methods. ",
    "url": "https://arxiv.org/abs/2202.11987",
    "authors": [
      "Edward De Brouwer",
      "Javier González Hernández",
      "Stephanie Hyland"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.11988",
    "title": "Exact Matching in Graphs of Bounded Independence Number",
    "abstract": "In the \\emph{Exact Matching Problem} (EM), we are given a graph equipped with a fixed coloring of its edges with two colors (red and blue), as well as a positive integer $k$. The task is then to decide whether the given graph contains a perfect matching exactly $k$ of whose edges have color red. EM generalizes several important algorithmic problems such as \\emph{perfect matching} and restricted minimum weight spanning tree problems. When introducing the problem in 1982, Papadimitriou and Yannakakis conjectured EM to be \\textbf{NP}-complete. Later however, Mulmuley et al.~presented a randomized polynomial time algorithm for EM, which puts EM in \\textbf{RP}. Given that to decide whether or not \\textbf{RP}$=$\\textbf{P} represents a big open challenge in complexity theory, this makes it unlikely for EM to be \\textbf{NP}-complete, and in fact indicates the possibility of a \\emph{deterministic} polynomial time algorithm. EM remains one of the few natural combinatorial problems in \\textbf{RP} which are not known to be contained in \\textbf{P}, making it an interesting instance for testing the hypothesis \\textbf{RP}$=$\\textbf{P}. Despite EM being quite well-known, attempts to devise deterministic polynomial algorithms have remained illusive during the last 40 years and progress has been lacking even for very restrictive classes of input graphs. In this paper we finally push the frontier of positive results forward by proving that EM can be solved in deterministic polynomial time for input graphs of bounded independence number, and for bipartite input graphs of bounded bipartite independence number. This generalizes previous positive results for complete (bipartite) graphs which were the only known results for EM on dense graphs. ",
    "url": "https://arxiv.org/abs/2202.11988",
    "authors": [
      "Nicolas El Maalouly",
      "Raphael Steiner"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2202.11998",
    "title": "Effective Actor-centric Human-object Interaction Detection",
    "abstract": "While Human-Object Interaction(HOI) Detection has achieved tremendous advances in recent, it still remains challenging due to complex interactions with multiple humans and objects occurring in images, which would inevitably lead to ambiguities. Most existing methods either generate all human-object pair candidates and infer their relationships by cropped local features successively in a two-stage manner, or directly predict interaction points in a one-stage procedure. However, the lack of spatial configurations or reasoning steps of two- or one- stage methods respectively limits their performance in such complex scenes. To avoid this ambiguity, we propose a novel actor-centric framework. The main ideas are that when inferring interactions: 1) the non-local features of the entire image guided by actor position are obtained to model the relationship between the actor and context, and then 2) we use an object branch to generate pixel-wise interaction area prediction, where the interaction area denotes the object central area. Moreover, we also use an actor branch to get interaction prediction of the actor and propose a novel composition strategy based on center-point indexing to generate the final HOI prediction. Thanks to the usage of the non-local features and the partly-coupled property of the human-objects composition strategy, our proposed framework can detect HOI more accurately especially for complex images. Extensive experimental results show that our method achieves the state-of-the-art on the challenging V-COCO and HICO-DET benchmarks and is more robust especially in multiple persons and/or objects scenes. ",
    "url": "https://arxiv.org/abs/2202.11998",
    "authors": [
      "Kunlun Xu",
      "Zhimin Li",
      "Zhijun Zhang",
      "Leizhen Dong",
      "Wenhui Xu",
      "Luxin Yan",
      "Sheng Zhong",
      "Xu Zou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.12023",
    "title": "Validating an SVM-based neonatal seizure detection algorithm for  generalizability, non-inferiority and clinical efficacy",
    "abstract": "Neonatal seizure detection algorithms (SDA) are approaching the benchmark of human expert annotation. Measures of algorithm generalizability and non-inferiority as well as measures of clinical efficacy are needed to assess the full scope of neonatal SDA performance. We validated our neonatal SDA on an independent data set of 28 neonates. Generalizability was tested by comparing the performance of the original training set (cross-validation) to its performance on the validation set. Non-inferiority was tested by assessing inter-observer agreement between combinations of SDA and two human expert annotations. Clinical efficacy was tested by comparing how the SDA and human experts quantified seizure burden and identified clinically significant periods of seizure activity in the EEG. Algorithm performance was consistent between training and validation sets with no significant worsening in AUC (p>0.05, n =28). SDA output was inferior to the annotation of the human expert, however, re-training with an increased diversity of data resulted in non-inferior performance ($\\Delta\\kappa$=0.077, 95% CI: -0.002-0.232, n=18). The SDA assessment of seizure burden had an accuracy ranging from 89-93%, and 87% for identifying periods of clinical interest. The proposed SDA is approaching human equivalence and provides a clinically relevant interpretation of the EEG. ",
    "url": "https://arxiv.org/abs/2202.12023",
    "authors": [
      "Karoliina T. Tapani",
      "Päivi Nevalainen",
      "Sampsa Vanhatalo",
      "Nathan J. Stevenson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.12031",
    "title": "Assessing generalisability of deep learning-based polyp detection and  segmentation methods through a computer vision challenge",
    "abstract": "Polyps are well-known cancer precursors identified by colonoscopy. However, variability in their size, location, and surface largely affect identification, localisation, and characterisation. Moreover, colonoscopic surveillance and removal of polyps (referred to as polypectomy ) are highly operator-dependent procedures. There exist a high missed detection rate and incomplete removal of colonic polyps due to their variable nature, the difficulties to delineate the abnormality, the high recurrence rates, and the anatomical topography of the colon. There have been several developments in realising automated methods for both detection and segmentation of these polyps using machine learning. However, the major drawback in most of these methods is their ability to generalise to out-of-sample unseen datasets that come from different centres, modalities and acquisition systems. To test this hypothesis rigorously we curated a multi-centre and multi-population dataset acquired from multiple colonoscopy systems and challenged teams comprising machine learning experts to develop robust automated detection and segmentation methods as part of our crowd-sourcing Endoscopic computer vision challenge (EndoCV) 2021. In this paper, we analyse the detection results of the four top (among seven) teams and the segmentation results of the five top teams (among 16). Our analyses demonstrate that the top-ranking teams concentrated on accuracy (i.e., accuracy > 80% on overall Dice score on different validation sets) over real-time performance required for clinical applicability. We further dissect the methods and provide an experiment-based hypothesis that reveals the need for improved generalisability to tackle diversity present in multi-centre datasets. ",
    "url": "https://arxiv.org/abs/2202.12031",
    "authors": [
      "Sharib Ali",
      "Noha Ghatwary",
      "Debesh Jha",
      "Ece Isik-Polat",
      "Gorkem Polat",
      "Chen Yang",
      "Wuyang Li",
      "Adrian Galdran",
      "Miguel-Ángel González Ballester",
      "Vajira Thambawita",
      "Steven Hicks",
      "Sahadev Poudel",
      "Sang-Woong Lee",
      "Ziyi Jin",
      "Tianyuan Gan",
      "ChengHui Yu",
      "JiangPeng Yan",
      "Doyeob Yeo",
      "Hyunseok Lee",
      "Nikhil Kumar Tomar",
      "Mahmood Haithmi",
      "Amr Ahmed",
      "Michael A. Riegler",
      "Christian Daul",
      "Pål Halvorsen",
      "Jens Rittscher",
      "Osama E. Salem",
      "Dominique Lamarque",
      "Renato Cannizzaro",
      "Stefano Realdon",
      "Thomas de Lange",
      "James E. East"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.12042",
    "title": "Parameterized Complexity of Graph Partitioning into Connected Clusters",
    "abstract": "Given an undirected graph $G$ and $q$ integers $n_1,n_2,n_3, \\cdots, n_q$, balanced connected $q$-partition problem ($BCP_q$) asks whether there exists a partition of the vertex set $V$ of $G$ into $q$ parts $V_1,V_2,V_3,\\cdots, V_q$ such that for all $i\\in[1,q]$, $|V_i|=n_i$ and the graph induced on $V_i$ is connected. A related problem denoted as the balanced connected $q$-edge partition problem ($BCEP_q$) is defined as follows. Given an undirected graph $G$ and $q$ integers $n_1,n_2,n_3, \\cdots, n_q$, $BCEP_q$ asks whether there exists a partition of the edge set of $G$ into $q$ parts $E_1,E_2,E_3,\\cdots, E_q$ such that for all $i\\in[1,q]$, $|E_i|=n_i$ and the graph induced on the edge set $E_i$ is connected. Here we study both the problems for $q=2$ and prove that $BCP_q$ for $q\\geq 2$ is $W[1]$-hard. We also show that $BCP_2$ is unlikely to have a polynomial kernel on the class of planar graphs. Coming to the positive results, we show that $BCP_2$ is fixed parameter tractable (FPT) parameterized by treewidth of the graph, which generalizes to FPT algorithm for planar graphs. We design another FPT algorithm and a polynomial kernel on the class of unit disk graphs parameterized by $\\min(n_1,n_2)$. Finally, we prove that unlike $BCP_2$, $BCEP_2$ is FPT parameterized by $\\min(n_1,n_2)$. ",
    "url": "https://arxiv.org/abs/2202.12042",
    "authors": [
      "Ankit Abhinav",
      "Susobhan Bandopadhyay",
      "Aritra Banik",
      "Saket Saurabh"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2202.12074",
    "title": "Investigating the Use of One-Class Support Vector Machine for Software  Defect Prediction",
    "abstract": "Early software defect identification is considered an important step towards software quality assurance. Software defect prediction aims at identifying software components that are likely to cause faults before a software is made available to the end-user. To date, this task has been modeled as a two-class classification problem, however its nature also allows it to be formulated as a one-class classification task. Preliminary results obtained in prior work show that One-Class Support Vector Machine (OCSVM) can outperform two-class classifiers for defect prediction. If confirmed, these results would overcome the data imbalance problem researchers have for long attempted to tackle in this field. In this paper, we further investigate whether learning from one class only is sufficient to produce effective defect prediction models by conducting a thorough large-scale empirical study investigating 15 real-world software projects, three validation scenarios, eight classifiers, robust evaluation measures and statistical significance tests. The results reveal that OCSVM is more suitable for cross-version and cross-project, rather than for within-project defect prediction, thus suggesting it performs better with heterogeneous data. While, we cannot conclude that OCSVM is the best classifier (Random Forest performs best herein), our results show interesting findings that open up further research avenues for training accurate defect prediction classifiers when defective instances are scarce or unavailable. ",
    "url": "https://arxiv.org/abs/2202.12074",
    "authors": [
      "Rebecca Moussa",
      "Danielle Azar",
      "Federica Sarro"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.12076",
    "title": "Phrase-Based Affordance Detection via Cyclic Bilateral Interaction",
    "abstract": "Affordance detection, which refers to perceiving objects with potential action possibilities in images, is a challenging task since the possible affordance depends on the person's purpose in real-world application scenarios. The existing works mainly extract the inherent human-object dependencies from image/video to accommodate affordance properties that change dynamically. In this paper, we explore to perceive affordance from a vision-language perspective and consider the challenging phrase-based affordance detection problem,i.e., given a set of phrases describing the action purposes, all the object regions in a scene with the same affordance should be detected. To this end, we propose a cyclic bilateral consistency enhancement network (CBCE-Net) to align language and vision features progressively. Specifically, the presented CBCE-Net consists of a mutual guided vision-language module that updates the common features of vision and language in a progressive manner, and a cyclic interaction module (CIM) that facilitates the perception of possible interaction with objects in a cyclic manner. In addition, we extend the public Purpose-driven Affordance Dataset (PAD) by annotating affordance categories with short phrases. The contrastive experimental results demonstrate the superiority of our method over nine typical methods from four relevant fields in terms of both objective metrics and visual quality. The related code and dataset will be released at \\url{https://github.com/lulsheng/CBCE-Net}. ",
    "url": "https://arxiv.org/abs/2202.12076",
    "authors": [
      "Liangsheng Lu",
      "Wei Zhai",
      "Hongchen Luo",
      "Yu Kang",
      "Yang Cao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.12081",
    "title": "Community Trend Prediction on Heterogeneous Graph in E-commerce",
    "abstract": "In online shopping, ever-changing fashion trends make merchants need to prepare more differentiated products to meet the diversified demands, and e-commerce platforms need to capture the market trend with a prophetic vision. For the trend prediction, the attribute tags, as the essential description of items, can genuinely reflect the decision basis of consumers. However, few existing works explore the attribute trend in the specific community for e-commerce. In this paper, we focus on the community trend prediction on the item attribute and propose a unified framework that combines the dynamic evolution of two graph patterns to predict the attribute trend in a specific community. Specifically, we first design a communityattribute bipartite graph at each time step to learn the collaboration of different communities. Next, we transform the bipartite graph into a hypergraph to exploit the associations of different attribute tags in one community. Lastly, we introduce a dynamic evolution component based on the recurrent neural networks to capture the fashion trend of attribute tags. Extensive experiments on three real-world datasets in a large e-commerce platform show the superiority of the proposed approach over several strong alternatives and demonstrate the ability to discover the community trend in advance. ",
    "url": "https://arxiv.org/abs/2202.12081",
    "authors": [
      "Jiahao Yuan",
      "Zhao Li",
      "Pengcheng Zou",
      "Xuan Gao",
      "Jinwei Pan",
      "Wendi Ji",
      "Xiaoling Wang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2202.12087",
    "title": "SQuadMDS: a lean Stochastic Quartet MDS improving global structure  preservation in neighbor embedding like t-SNE and UMAP",
    "abstract": "Multidimensional scaling is a statistical process that aims to embed high dimensional data into a lower-dimensional space; this process is often used for the purpose of data visualisation. Common multidimensional scaling algorithms tend to have high computational complexities, making them inapplicable on large data sets. This work introduces a stochastic, force directed approach to multidimensional scaling with a time and space complexity of O(N), with N data points. The method can be combined with force directed layouts of the family of neighbour embedding such as t-SNE, to produce embeddings that preserve both the global and the local structures of the data. Experiments assess the quality of the embeddings produced by the standalone version and its hybrid extension both quantitatively and qualitatively, showing competitive results outperforming state-of-the-art approaches. Codes are available at https://github.com/PierreLambert3/SQuaD-MDS-and-FItSNE-hybrid. ",
    "url": "https://arxiv.org/abs/2202.12087",
    "authors": [
      "Pierre Lambert",
      "Cyril de Bodt",
      "Michel Verleysen",
      "John Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.12108",
    "title": "Light Robust Monocular Depth Estimation For Outdoor Environment Via  Monochrome And Color Camera Fusion",
    "abstract": "Depth estimation plays a important role in SLAM, odometry, and autonomous driving. Especially, monocular depth estimation is profitable technology because of its low cost, memory, and computation. However, it is not a sufficiently predicting depth map due to a camera often failing to get a clean image because of light conditions. To solve this problem, various sensor fusion method has been proposed. Even though it is a powerful method, sensor fusion requires expensive sensors, additional memory, and high computational performance. In this paper, we present color image and monochrome image pixel-level fusion and stereo matching with partially enhanced correlation coefficient maximization. Our methods not only outperform the state-of-the-art works across all metrics but also efficient in terms of cost, memory, and computation. We also validate the effectiveness of our design with an ablation study. ",
    "url": "https://arxiv.org/abs/2202.12108",
    "authors": [
      "Hyeonsoo Jang",
      "Yeongmin Ko",
      "Younkwan Lee",
      "Moongu Jeon"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.12111",
    "title": "An Algorithm for Computing the Covering Radius of a Linear Code Based on  Vilenkin-Chrestenson Transform",
    "abstract": "We present a generalization of Walsh-Hadamard transform that is suitable for applications in Coding Theory, especially for computation of the weight distribution and the covering radius of a linear code over a finite field. The transform used in our research, is a modification of Vilenkin-Chrestenson transform. Instead of using all the vectors in the considered space, we take a maximal set of nonproportional vectors, which reduces the computational complexity. ",
    "url": "https://arxiv.org/abs/2202.12111",
    "authors": [
      "Paskal Piperkov",
      "Iliya Bouyukliev",
      "Stefka Bouyuklieva"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2202.12119",
    "title": "Optimal Learning Rates of Deep Convolutional Neural Networks: Additive  Ridge Functions",
    "abstract": "Convolutional neural networks have shown extraordinary abilities in many applications, especially those related to the classification tasks. However, for the regression problem, the abilities of convolutional structures have not been fully understood, and further investigation is needed. In this paper, we consider the mean squared error analysis for deep convolutional neural networks. We show that, for additive ridge functions, convolutional neural networks followed by one fully connected layer with ReLU activation functions can reach optimal mini-max rates (up to a log factor). The convergence rates are dimension independent. This work shows the statistical optimality of convolutional neural networks and may shed light on why convolutional neural networks are able to behave well for high dimensional input. ",
    "url": "https://arxiv.org/abs/2202.12119",
    "authors": [
      "Zhiying Fang",
      "Guang Cheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2202.12120",
    "title": "Temporal Convolution Domain Adaptation Learning for Crops Growth  Prediction",
    "abstract": "Existing Deep Neural Nets on crops growth prediction mostly rely on availability of a large amount of data. In practice, it is difficult to collect enough high-quality data to utilize the full potential of these deep learning models. In this paper, we construct an innovative network architecture based on domain adaptation learning to predict crops growth curves with limited available crop data. This network architecture overcomes the challenge of data availability by incorporating generated data from the developed crops simulation model. We are the first to use the temporal convolution filters as the backbone to construct a domain adaptation network architecture which is suitable for deep learning regression models with very limited training data of the target domain. We conduct experiments to test the performance of the network and compare our proposed architecture with other state-of-the-art methods, including a recent LSTM-based domain adaptation network architecture. The results show that the proposed temporal convolution-based network architecture outperforms all benchmarks not only in accuracy but also in model size and convergence rate. ",
    "url": "https://arxiv.org/abs/2202.12120",
    "authors": [
      "Shengzhe Wang",
      "Ling Wang",
      "Zhihao Lin",
      "Xi Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.12138",
    "title": "How reparametrization trick broke differentially-private text  representation leaning",
    "abstract": "As privacy gains traction in the NLP community, researchers have started adopting various approaches to privacy-preserving methods. One of the favorite privacy frameworks, differential privacy (DP), is perhaps the most compelling thanks to its fundamental theoretical guarantees. Despite the apparent simplicity of the general concept of differential privacy, it seems non-trivial to get it right when applying it to NLP. In this short paper, we formally analyze several recent NLP papers proposing text representation learning using DPText (Beigi et al., 2019a,b; Alnasser et al., 2021; Beigi et al., 2021) and reveal their false claims of being differentially private. Furthermore, we also show a simple yet general empirical sanity check to determine whether a given implementation of a DP mechanism almost certainly violates the privacy loss guarantees. Our main goal is to raise awareness and help the community understand potential pitfalls of applying differential privacy to text representation learning. ",
    "url": "https://arxiv.org/abs/2202.12138",
    "authors": [
      "Ivan Habernal"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2202.12154",
    "title": "Towards Effective and Robust Neural Trojan Defenses via Input Filtering",
    "abstract": "Trojan attacks on deep neural networks are both dangerous and surreptitious. Over the past few years, Trojan attacks have advanced from using only a simple trigger and targeting only one class to using many sophisticated triggers and targeting multiple classes. However, Trojan defenses have not caught up with this development. Most defense methods still make out-of-date assumptions about Trojan triggers and target classes, thus, can be easily circumvented by modern Trojan attacks. In this paper, we advocate general defenses that are effective and robust against various Trojan attacks and propose two novel \"filtering\" defenses with these characteristics called Variational Input Filtering (VIF) and Adversarial Input Filtering (AIF). VIF and AIF leverage variational inference and adversarial training respectively to purify all potential Trojan triggers in the input at run time without making any assumption about their numbers and forms. We further extend \"filtering\" to \"filtering-then-contrasting\" - a new defense mechanism that helps avoid the drop in classification accuracy on clean data caused by filtering. Extensive experimental results show that our proposed defenses significantly outperform 4 well-known defenses in mitigating 5 different Trojan attacks including the two state-of-the-art which defeat many strong defenses. ",
    "url": "https://arxiv.org/abs/2202.12154",
    "authors": [
      "Kien Do",
      "Haripriya Harikumar",
      "Hung Le",
      "Dung Nguyen",
      "Truyen Tran",
      "Santu Rana",
      "Dang Nguyen",
      "Willy Susilo",
      "Svetha Venkatesh"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.12174",
    "title": "Collaborative Training of Heterogeneous Reinforcement Learning Agents in  Environments with Sparse Rewards: What and When to Share?",
    "abstract": "In the early stages of human life, babies develop their skills by exploring different scenarios motivated by their inherent satisfaction rather than by extrinsic rewards from the environment. This behavior, referred to as intrinsic motivation, has emerged as one solution to address the exploration challenge derived from reinforcement learning environments with sparse rewards. Diverse exploration approaches have been proposed to accelerate the learning process over single- and multi-agent problems with homogeneous agents. However, scarce studies have elaborated on collaborative learning frameworks between heterogeneous agents deployed into the same environment, but interacting with different instances of the latter without any prior knowledge. Beyond the heterogeneity, each agent's characteristics grant access only to a subset of the full state space, which may hide different exploration strategies and optimal solutions. In this work we combine ideas from intrinsic motivation and transfer learning. Specifically, we focus on sharing parameters in actor-critic model architectures and on combining information obtained through intrinsic motivation with the aim of having a more efficient exploration and faster learning. We test our strategies through experiments performed over a modified ViZDooM's My Way Home scenario, which is more challenging than its original version and allows evaluating the heterogeneity between agents. Our results reveal different ways in which a collaborative framework with little additional computational cost can outperform an independent learning process without knowledge sharing. Additionally, we depict the need for modulating correctly the importance between the extrinsic and intrinsic rewards to avoid undesired agent behaviors. ",
    "url": "https://arxiv.org/abs/2202.12174",
    "authors": [
      "Alain Andres",
      "Esther Villar-Rodriguez",
      "Javier Del Ser"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.12194",
    "title": "Towards a Heterogeneous Smart Electromagnetic Environment for  Millimeter-Wave Communications: An Industrial Viewpoint",
    "abstract": "Fifth generation (5G) and beyond communication systems open the door to millimeter Wave (mmWave) frequency bands to leverage the extremely large operating bandwidths and deliver unprecedented network capacity. These frequency bands are affected by high propagation losses that severely limit the achievable coverage. The simplest way to address this problem would be to increase the number of installed mmWave base stations (BSs), at the same time augmenting the overall network cost, power consumption and ElectroMagnetic Field (EMF) levels. As alternative direction, here we propose to complement the macro-layer of mmWave BSs with a heterogeneous deployment of Smart Electromagnetic (Smart EM) Entities - namely IAB nodes, Smart Repeaters, Reconfigurable Intelligent Surfaces (RISs) and passive surfaces - that is judiciously planned to minimize the total installation costs while at the same time optimizing the network spectral efficiency. Initial network planning results underline the effectiveness of the proposed approach. The available technologies and the key research directions for achieving this view are thoroughly discussed by accounting for issues ranging from system-level design to the development of new materials. ",
    "url": "https://arxiv.org/abs/2202.12194",
    "authors": [
      "Roberto Flamini",
      "Danilo De Donno",
      "Jonathan Gambini",
      "Francesco Giuppi",
      "Christian Mazzucco",
      "Angelo Milani",
      "Laura Resteghini"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2202.12197",
    "title": "Situational Graphs for Robot Navigation in Structured Indoor  Environments",
    "abstract": "Autonomous mobile robots should be aware of their situation, understood as a comprehensive understanding of the environment along with the estimation of its own state, to successfully make decisions and execute tasks in natural environments. 3D scene graphs are an emerging field of research with great potential to represent these situations in a joint model comprising geometric, semantic and relational/topological dimensions. Although 3D scene graphs have already been utilized for this, further research is still required to effectively deploy them on-board mobile robots. To this end, we present in this paper a real-time online built Situational Graphs (S-Graphs), composed of a single graph representing the environment, while simultaneously improving the robot pose estimation. Our method utilizes odometry readings and planar surfaces extracted from 3D LiDAR scans, to construct and optimize in real-time a three layered S-Graph that includes a robot tracking layer where the robot poses are registered, a metric-semantic layer with features such as planar walls and our novel topological layer constraining higher-level features such as corridors and rooms. Our proposal does not only demonstrate state-of-the-art results for pose estimation of the robot, but also contributes with a metric-semantic-topological model of the environment ",
    "url": "https://arxiv.org/abs/2202.12197",
    "authors": [
      "Hriday Bavle",
      "Jose Luis Sanchez-Lopez",
      "Muhammad Shaheer",
      "Javier Civera",
      "Holger Voos"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.12201",
    "title": "Energy-Efficient Transmission Range and Duration for Cognitive Radio  Sensor Networks",
    "abstract": "Cognitive Radio (CR) promises an efficient utilization of radio spectrum resources by enabling dynamic spectrum access to overcome the spectrum scarcity problem. Cognitive Radio Sensor Networks (CRSNs) are one type of Wireless Sensor Networks (WSNs) equipped with CR capabilities. CRSN nodes need to operate energy-efficiently to extend network lifetime due to their limited battery capacity. In this paper, for the first time in literature, we formulate the problem of finding a common energy-efficient transmission range and transmission duration for all CRSN nodes and network deployment that would minimize the energy consumed per goodput per meter toward the sink in a greedy forwarding scenario. Results reveal non-trivial relations for energy-efficient CRSN transmission range and duration as a function of nine critical network parameters such as primary user activity levels. These relations provide valuable insights for detailed CRSN designs prior to deployment. ",
    "url": "https://arxiv.org/abs/2202.12201",
    "authors": [
      "Mustafa Ozger",
      "Ecehan B. Pehlivanoglu",
      "Ozgur B. Akan"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2202.12219",
    "title": "Debugging Differential Privacy: A Case Study for Privacy Auditing",
    "abstract": "Differential Privacy can provide provable privacy guarantees for training data in machine learning. However, the presence of proofs does not preclude the presence of errors. Inspired by recent advances in auditing which have been used for estimating lower bounds on differentially private algorithms, here we show that auditing can also be used to find flaws in (purportedly) differentially private schemes. In this case study, we audit a recent open source implementation of a differentially private deep learning algorithm and find, with 99.99999999% confidence, that the implementation does not satisfy the claimed differential privacy guarantee. ",
    "url": "https://arxiv.org/abs/2202.12219",
    "authors": [
      "Florian Tramer",
      "Andreas Terzis",
      "Thomas Steinke",
      "Shuang Song",
      "Matthew Jagielski",
      "Nicholas Carlini"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.12230",
    "title": "Sample Efficiency of Data Augmentation Consistency Regularization",
    "abstract": "Data augmentation is popular in the training of large neural networks; currently, however, there is no clear theoretical comparison between different algorithmic choices on how to use augmented data. In this paper, we take a step in this direction - we first present a simple and novel analysis for linear regression, demonstrating that data augmentation consistency (DAC) is intrinsically more efficient than empirical risk minimization on augmented data (DA-ERM). We then propose a new theoretical framework for analyzing DAC, which reframes DAC as a way to reduce function class complexity. The new framework characterizes the sample efficiency of DAC for various non-linear models (e.g., neural networks). Further, we perform experiments that make a clean and apples-to-apples comparison (i.e., with no extra modeling or data tweaks) between ERM and consistency regularization using CIFAR-100 and WideResNet; these together demonstrate the superior efficacy of DAC. ",
    "url": "https://arxiv.org/abs/2202.12230",
    "authors": [
      "Shuo Yang",
      "Yijun Dong",
      "Rachel Ward",
      "Inderjit S. Dhillon",
      "Sujay Sanghavi",
      "Qi Lei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.12246",
    "title": "Neural reality of argument structure constructions",
    "abstract": "In lexicalist linguistic theories, argument structure is assumed to be predictable from the meaning of verbs. As a result, the verb is the primary determinant of the meaning of a clause. In contrast, construction grammarians propose that argument structure is encoded in constructions (or form-meaning pairs) that are distinct from verbs. Decades of psycholinguistic research have produced substantial empirical evidence in favor of the construction view. Here we adapt several psycholinguistic studies to probe for the existence of argument structure constructions (ASCs) in Transformer-based language models (LMs). First, using a sentence sorting experiment, we find that sentences sharing the same construction are closer in embedding space than sentences sharing the same verb. Furthermore, LMs increasingly prefer grouping by construction with more input data, mirroring the behaviour of non-native language learners. Second, in a \"Jabberwocky\" priming-based experiment, we find that LMs associate ASCs with meaning, even in semantically nonsensical sentences. Our work offers the first evidence for ASCs in LMs and highlights the potential to devise novel probing methods grounded in psycholinguistic research. ",
    "url": "https://arxiv.org/abs/2202.12246",
    "authors": [
      "Bai Li",
      "Zining Zhu",
      "Guillaume Thomas",
      "Frank Rudzicz",
      "Yang Xu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2202.12255",
    "title": "Exact Community Recovery over Signed Graphs",
    "abstract": "Signed graphs encode similarity and dissimilarity relationships among different entities with positive and negative edges. In this paper, we study the problem of community recovery over signed graphs generated by the signed stochastic block model (SSBM) with two equal-sized communities. Our approach is based on the maximum likelihood estimation (MLE) of the SSBM. Unlike many existing approaches, our formulation reveals that the positive and negative edges of a signed graph should be treated unequally. We then propose a simple two-stage iterative algorithm for solving the regularized MLE. It is shown that in the logarithmic degree regime, the proposed algorithm can exactly recover the underlying communities in nearly-linear time at the information-theoretic limit. Numerical results on both synthetic and real data are reported to validate and complement our theoretical developments and demonstrate the efficacy of the proposed method. ",
    "url": "https://arxiv.org/abs/2202.12255",
    "authors": [
      "Xiaolu Wang",
      "Peng Wang",
      "Anthony Man-Cho So"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2202.12256",
    "title": "Integration of neural network and fuzzy logic decision making compared  with bilayered neural network in the simulation of daily dew point  temperature",
    "abstract": "In this research, dew point temperature (DPT) is simulated using the data-driven approach. Adaptive Neuro-Fuzzy Inference System (ANFIS) is utilized as a data-driven technique to forecast this parameter at Tabriz in East Azerbaijan. Various input patterns, namely T min, T max, and T mean, are utilized for training the architecture whilst DPT is the model's output. The findings indicate that, in general, ANFIS method is capable of identifying data patterns with a high degree of accuracy. However, the approach demonstrates that processing time and computer resources may substantially increase by adding additional functions. Based on the results, the number of iterations and computing resources might change dramatically if new functionalities are included. As a result, tuning parameters have to be optimized inside the method framework. The findings demonstrate a high agreement between results by the data-driven technique (machine learning method) and the observed data. Using this prediction toolkit, DPT can be adequately forecasted solely based on the temperature distribution of Tabriz. This kind of modeling is extremely promising for predicting DPT at various sites. Besides, this study thoroughly compares the Bilayered Neural Network (BNN) and ANFIS models on various scales. Whilst the ANFIS model is extremely stable for almost all numbers of membership functions, the BNN model is highly sensitive to this scale factor to predict DPT. ",
    "url": "https://arxiv.org/abs/2202.12256",
    "authors": [
      "Guodao Zhang",
      "Shahab S. Band",
      "Sina Ardabili",
      "Kwok-Wing Chau",
      "Amir Mosavi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.12258",
    "title": "A Method for Waste Segregation using Convolutional Neural Networks",
    "abstract": "Segregation of garbage is a primary concern in many nations across the world. Even though we are in the modern era, many people still do not know how to distinguish between organic and recyclable waste. It is because of this that the world is facing a major crisis of waste disposal. In this paper, we try to use deep learning algorithms to help solve this problem of waste classification. The waste is classified into two categories like organic and recyclable. Our proposed model achieves an accuracy of 94.9%. Although the other two models also show promising results, the Proposed Model stands out with the greatest accuracy. With the help of deep learning, one of the greatest obstacles to efficient waste management can finally be removed. ",
    "url": "https://arxiv.org/abs/2202.12258",
    "authors": [
      "Jash Shah",
      "Sagar Kamat"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2202.12262",
    "title": "On the Omnipresence of Spurious Local Minima in Certain Neural Network  Training Problems",
    "abstract": "We study the loss landscape of training problems for deep artificial neural networks with a one-dimensional real output whose activation functions contain an affine segment and whose hidden layers have width at least two. It is shown that such problems possess a continuum of spurious (i.e., not globally optimal) local minima for all target functions that are not affine. In contrast to previous works, our analysis covers all sampling and parameterization regimes, general differentiable loss functions, arbitrary continuous nonpolynomial activation functions, and both the finite- and infinite-dimensional setting. It is further shown that the appearance of the spurious local minima in the considered training problems is a direct consequence of the universal approximation theorem and that the underlying mechanisms also cause, e.g., Lp-best approximation problems to be ill-posed in the sense of Hadamard for all networks that do not have a dense image. The latter result also holds without the assumption of local affine linearity and without any conditions on the hidden layers. The paper concludes with a numerical experiment which demonstrates that spurious local minima can indeed affect the convergence behavior of gradient-based solution algorithms in practice. ",
    "url": "https://arxiv.org/abs/2202.12262",
    "authors": [
      "Constantin Christof",
      "Julia Kowalczyk"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2202.12265",
    "title": "Clustering Edges in Directed Graphs",
    "abstract": "How do vertices exert influence in graph data? We develop a framework for edge clustering, a new method for exploratory data analysis that reveals how both vertices and edges collaboratively accomplish directed influence in graphs, especially for directed graphs. In contrast to the ubiquitous vertex clustering which groups vertices, edge clustering groups edges. Edges sharing a functional affinity are assigned to the same group and form an influence subgraph cluster. With a complexity comparable to that of vertex clustering, this framework presents three different methods for edge spectral clustering that reveal important influence subgraphs in graph data, with each method providing different insight into directed influence processes. We present several diverse examples demonstrating the potential for widespread application of edge clustering in scientific research. ",
    "url": "https://arxiv.org/abs/2202.12265",
    "authors": [
      "Manohar Murthi",
      "Kamal Premaratne"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.12278",
    "title": "Learning Stochastic Dynamics with Statistics-Informed Neural Network",
    "abstract": "We introduce a machine-learning framework named statistics-informed neural network (SINN) for learning stochastic dynamics from data. This new architecture was theoretically inspired by a universal approximation theorem for stochastic systems introduced in this paper and the projection-operator formalism for stochastic modeling. We devise mechanisms for training the neural network model to reproduce the correct \\emph{statistical} behavior of a target stochastic process. Numerical simulation results demonstrate that a well-trained SINN can reliably approximate both Markovian and non-Markovian stochastic dynamics. We demonstrate the applicability of SINN to model transition dynamics. Furthermore, we show that the obtained reduced-order model can be trained on temporally coarse-grained data and hence is well suited for rare-event simulations. ",
    "url": "https://arxiv.org/abs/2202.12278",
    "authors": [
      "Yuanran Zhu",
      "Yu-Hang Tang",
      "Changho Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Artificial Intelligence (cs.AI)",
      "Dynamical Systems (math.DS)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2202.12293",
    "title": "Planarizing Graphs and their Drawings by Vertex Splitting",
    "abstract": "The splitting number of a graph $G=(V,E)$ is the minimum number of vertex splits required to turn $G$ into a planar graph, where a vertex split removes a vertex $v \\in V$, introduces two new vertices $v_1, v_2$, and distributes the edges formerly incident to $v$ among its two split copies $v_1, v_2$. The splitting number problem is known to be NP-complete. In this paper we shift focus to the splitting number of graph drawings in $\\mathbb R^2$, where the new vertices resulting from vertex splits can be re-embedded into the existing drawing of the remaining graph. We first provide a non-uniform fixed-parameter tractable (FPT) algorithm for the splitting number problem (without drawings). Then we show the NP-completeness of the splitting number problem for graph drawings, even for its two subproblems of (1) selecting a minimum subset of vertices to split and (2) for re-embedding a minimum number of copies of a given set of vertices. For the latter problem we present an FPT algorithm parameterized by the number of vertex splits. This algorithm reduces to a bounded outerplanarity case and uses an intricate dynamic program on a sphere-cut decomposition. ",
    "url": "https://arxiv.org/abs/2202.12293",
    "authors": [
      "Soeren Nickel",
      "Martin Nöllenburg",
      "Manuel Sorge",
      "Anaïs Villedieu",
      "Hsiang-Yun Wu",
      "Jules Wulms"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2202.11727",
    "title": "Completely Quantum Neural Networks",
    "abstract": "Artificial neural networks are at the heart of modern deep learning algorithms. We describe how to embed and train a general neural network in a quantum annealer without introducing any classical element in training. To implement the network on a state-of-the-art quantum annealer, we develop three crucial ingredients: binary encoding the free parameters of the network, polynomial approximation of the activation function, and reduction of binary higher-order polynomials into quadratic ones. Together, these ideas allow encoding the loss function as an Ising model Hamiltonian. The quantum annealer then trains the network by finding the ground state. We implement this for an elementary network and illustrate the advantages of quantum training: its consistency in finding the global minimum of the loss function and the fact that the network training converges in a single annealing step, which leads to short training times while maintaining a high classification performance. Our approach opens a novel avenue for the quantum training of general machine learning models. ",
    "url": "https://arxiv.org/abs/2202.11727",
    "authors": [
      "Steve Abel",
      "Juan C. Criado",
      "Michael Spannowsky"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)",
      "High Energy Physics - Theory (hep-th)"
    ]
  },
  {
    "id": "arXiv:2202.11804",
    "title": "Nuclei panoptic segmentation and composition regression with multi-task  deep neural networks",
    "abstract": "Nuclear segmentation, classification and quantification within Haematoxylin & Eosin stained histology images enables the extraction of interpretable cell-based features that can be used in downstream explainable models in computational pathology. The Colon Nuclei Identification and Counting (CoNIC) Challenge is held to help drive forward research and innovation for automatic nuclei recognition in computational pathology. This report describes our proposed method submitted to the CoNIC challenge. Our method employs a multi-task learning framework, which performs a panoptic segmentation task and a regression task. For the panoptic segmentation task, we use encoder-decoder type deep neural networks predicting a direction map in addition to a segmentation map in order to separate neighboring nuclei into different instances ",
    "url": "https://arxiv.org/abs/2202.11804",
    "authors": [
      "Satoshi Kondo",
      "Satoshi Kasai"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.11889",
    "title": "A spectral-spatial fusion anomaly detection method for hyperspectral  imagery",
    "abstract": "In hyperspectral, high-quality spectral signals convey subtle spectral differences to distinguish similar materials, thereby providing unique advantage for anomaly detection. Hence fine spectra of anomalous pixels can be effectively screened out from heterogeneous background pixels. Since the same materials have similar characteristics in spatial and spectral dimension, detection performance can be significantly enhanced by jointing spatial and spectral information. In this paper, a spectralspatial fusion anomaly detection (SSFAD) method is proposed for hyperspectral imagery. First, original spectral signals are mapped to a local linear background space composed of median and mean with high confidence, where saliency weight and feature enhancement strategies are implemented to obtain an initial detection map in spectral domain. Futhermore, to make full use of similarity information of local background around testing pixel, a new detector is designed to extract the local similarity spatial features of patch images in spatial domain. Finally, anomalies are detected by adaptively combining the spectral and spatial detection maps. The experimental results demonstrate that our proposed method has superior detection performance than traditional methods. ",
    "url": "https://arxiv.org/abs/2202.11889",
    "authors": [
      "Zengfu Hou",
      "Siyuan Cheng",
      "Ting Hu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.12008",
    "title": "A fair pricing model via adversarial learning",
    "abstract": "At the core of insurance business lies classification between risky and non-risky insureds, actuarial fairness meaning that risky insureds should contribute more and pay a higher premium than non-risky or less-risky ones. Actuaries, therefore, use econometric or machine learning techniques to classify, but the distinction between a fair actuarial classification and \"discrimination\" is subtle. For this reason, there is a growing interest about fairness and discrimination in the actuarial community Lindholm, Richman, Tsanakas, and Wuthrich (2022). Presumably, non-sensitive characteristics can serve as substitutes or proxies for protected attributes. For example, the color and model of a car, combined with the driver's occupation, may lead to an undesirable gender bias in the prediction of car insurance prices. Surprisingly, we will show that debiasing the predictor alone may be insufficient to maintain adequate accuracy (1). Indeed, the traditional pricing model is currently built in a two-stage structure that considers many potentially biased components such as car or geographic risks. We will show that this traditional structure has significant limitations in achieving fairness. For this reason, we have developed a novel pricing model approach. Recently some approaches have Blier-Wong, Cossette, Lamontagne, and Marceau (2021); Wuthrich and Merz (2021) shown the value of autoencoders in pricing. In this paper, we will show that (2) this can be generalized to multiple pricing factors (geographic, car type), (3) it perfectly adapted for a fairness context (since it allows to debias the set of pricing components): We extend this main idea to a general framework in which a single whole pricing model is trained by generating the geographic and car pricing components needed to predict the pure premium while mitigating the unwanted bias according to the desired metric. ",
    "url": "https://arxiv.org/abs/2202.12008",
    "authors": [
      "Grari Vincent",
      "Charpentier Arthur",
      "Lamprier Sylvain",
      "Detyniecki Marcin"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2202.12028",
    "title": "Evolutionary Multi-Objective Reinforcement Learning Based Trajectory  Control and Task Offloading in UAV-Assisted Mobile Edge Computing",
    "abstract": "This paper studies the trajectory control and task offloading (TCTO) problem in an unmanned aerial vehicle (UAV)-assisted mobile edge computing system, where a UAV flies along a planned trajectory to collect computation tasks from smart devices (SDs). We consider a scenario that SDs are not directly connected by the base station (BS) and the UAV has two roles to play: MEC server or wireless relay. The UAV makes task offloading decisions online, in which the collected tasks can be executed locally on the UAV or offloaded to the BS for remote processing. The TCTO problem involves multi-objective optimization as its objectives are to minimize the task delay and the UAV's energy consumption, and maximize the number of tasks collected by the UAV, simultaneously. This problem is challenging because the three objectives conflict with each other. The existing reinforcement learning (RL) algorithms, either single-objective RLs or single-policy multi-objective RLs, cannot well address the problem since they cannot output multiple policies for various preferences (i.e. weights) across objectives in a single run. This paper adapts the evolutionary multi-objective RL (EMORL), a multi-policy multi-objective RL, to the TCTO problem. This algorithm can output multiple optimal policies in just one run, each optimizing a certain preference. The simulation results demonstrate that the proposed algorithm can obtain more excellent nondominated policies by striking a balance between the three objectives regarding policy quality, compared with two evolutionary and two multi-policy RL algorithms. ",
    "url": "https://arxiv.org/abs/2202.12028",
    "authors": [
      "Fuhong Song",
      "Huanlai Xing",
      "Xinhan Wang",
      "Shouxi Luo",
      "Penglin Dai",
      "Zhiwen Xiao",
      "Bowen Zhao"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.12104",
    "title": "A Transformer-based Network for Deformable Medical Image Registration",
    "abstract": "Deformable medical image registration plays an important role in clinical diagnosis and treatment. Recently, the deep learning (DL) based image registration methods have been widely investigated and showed excellent performance in computational speed. However, these methods cannot provide enough registration accuracy because of insufficient ability in representing both the global and local features of the moving and fixed images. To address this issue, this paper has proposed the transformer based image registration method. This method uses the distinctive transformer to extract the global and local image features for generating the deformation fields, based on which the registered image is produced in an unsupervised way. Our method can improve the registration accuracy effectively by means of self-attention mechanism and bi-level information flow. Experimental results on such brain MR image datasets as LPBA40 and OASIS-1 demonstrate that compared with several traditional and DL based registration methods, our method provides higher registration accuracy in terms of dice values. ",
    "url": "https://arxiv.org/abs/2202.12104",
    "authors": [
      "Yibo Wang",
      "Wen Qian",
      "Xuming Zhang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.12127",
    "title": "Robust random walk-like Metropolis-Hastings algorithms for concentrating  posteriors",
    "abstract": "Motivated by Bayesian inference with highly informative data we analyze the performance of random walk-like Metropolis-Hastings algorithms for approximate sampling of increasingly concentrating target distributions. We focus on Gaussian proposals which use a Hessian-based approximation of the target covariance. By means of pushforward transition kernels we show that for Gaussian target measures the spectral gap of the corresponding Metropolis-Hastings algorithm is independent of the concentration of the posterior, i.e., the noise level in the observational data that is used for Bayesian inference. Moreover, by exploiting the convergence of the concentrating posteriors to their Laplace approximation we extend the analysis to non-Gaussian target measures which either concentrate around a single point or along a linear manifold. In particular, in that setting we show that the average acceptance rate as well as the expected squared jump distance of suitable Metropolis-Hastings Markov chains do not deteriorate as the target concentrates. ",
    "url": "https://arxiv.org/abs/2202.12127",
    "authors": [
      "Daniel Rudolf",
      "Björn Sprungk"
    ],
    "subjectives": [
      "Computation (stat.CO)",
      "Numerical Analysis (math.NA)",
      "Probability (math.PR)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2202.12233",
    "title": "Automatic speaker verification spoofing and deepfake detection using  wav2vec 2.0 and data augmentation",
    "abstract": "The performance of spoofing countermeasure systems depends fundamentally upon the use of sufficiently representative training data. With this usually being limited, current solutions typically lack generalisation to attacks encountered in the wild. Strategies to improve reliability in the face of uncontrolled, unpredictable attacks are hence needed. We report in this paper our efforts to use self-supervised learning in the form of a wav2vec 2.0 front-end with fine tuning. Despite initial base representations being learned using only bona fide data and no spoofed data, we obtain the lowest equal error rates reported in the literature for both the ASVspoof 2021 Logical Access and Deepfake databases. When combined with data augmentation, these results correspond to an improvement of almost 90 % relative to our baseline system. ",
    "url": "https://arxiv.org/abs/2202.12233",
    "authors": [
      "Hemlata Tak",
      "Massimiliano Todisco",
      "Xin Wang",
      "Jee-weon Jung",
      "Junichi Yamagishi",
      "Nicholas Evans"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2202.12263",
    "title": "Effect Identification in Cluster Causal Diagrams",
    "abstract": "One pervasive task found throughout the empirical sciences is to determine the effect of interventions from non-experimental data. It is well-understood that assumptions are necessary to perform causal inferences, which are commonly articulated through causal diagrams (Pearl, 2000). Despite the power of this approach, there are settings where the knowledge necessary to specify a causal diagram over all observed variables may not be available, particularly in complex, high-dimensional domains. In this paper, we introduce a new type of graphical model called cluster causal diagrams (for short, C-DAGs) that allows for the partial specification of relationships among variables based on limited prior knowledge, alleviating the stringent requirement of specifying a full causal diagram. A C-DAG specifies relationships between clusters of variables, while the relationships between the variables within a cluster are left unspecified. We develop the foundations and machinery for valid causal inferences over C-DAGs. In particular, we first define a new version of the d-separation criterion and prove its soundness and completeness. Secondly, we extend these new separation rules and prove the validity of the corresponding do-calculus. Lastly, we show that a standard identification algorithm is sound and complete to systematically compute causal effects from observational data given a C-DAG. ",
    "url": "https://arxiv.org/abs/2202.12263",
    "authors": [
      "Tara V. Anand",
      "Adèle H. Ribeiro",
      "Jin Tian",
      "Elias Bareinboim"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1911.13136",
    "title": "A Multilayered Block Network Model to Forecast Large Dynamic  Transportation Graphs: an Application to US Air Transport",
    "abstract": " Title: A Multilayered Block Network Model to Forecast Large Dynamic  Transportation Graphs: an Application to US Air Transport ",
    "url": "https://arxiv.org/abs/1911.13136",
    "authors": [
      "Hector Rodriguez-Deniz",
      "Mattias Villani",
      "Augusto Voltes-Dorta"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2007.15030",
    "title": "Dynamic Defense Against Byzantine Poisoning Attacks in Federated  Learning",
    "abstract": " Comments: 10 pages ",
    "url": "https://arxiv.org/abs/2007.15030",
    "authors": [
      "Nuria Rodríguez-Barroso",
      "Eugenio Martínez-Cámara",
      "M. Victoria Luzón",
      "Francisco Herrera"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2010.06786",
    "title": "A Self-supervised Representation Learning of Sentence Structure for  Authorship Attribution",
    "abstract": " Title: A Self-supervised Representation Learning of Sentence Structure for  Authorship Attribution ",
    "url": "https://arxiv.org/abs/2010.06786",
    "authors": [
      "Fereshteh Jafariakinabad",
      "Kien A. Hua"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2012.00968",
    "title": "Reconfigurable Intelligent Surfaces in Action for Non-Terrestrial  Networks",
    "abstract": " Comments: 8 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2012.00968",
    "authors": [
      "Kürşat Tekbıyık",
      "Güneş Karabulut Kurt",
      "Ali Rıza Ekti",
      "Halim Yanikomeroglu"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2012.03597",
    "title": "PSGCNet: A Pyramidal Scale and Global Context Guided Network for Dense  Object Counting in Remote Sensing Images",
    "abstract": " Comments: Accepted by TGRS ",
    "url": "https://arxiv.org/abs/2012.03597",
    "authors": [
      "Guangshuai Gao",
      "Qingjie Liu",
      "Zhenghui Hu",
      "Lu Li",
      "Qi Wen",
      "Yunhong Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2102.01649",
    "title": "Heterogeneous Graph based Deep Learning for Biomedical Network Link  Prediction",
    "abstract": " Title: Heterogeneous Graph based Deep Learning for Biomedical Network Link  Prediction ",
    "url": "https://arxiv.org/abs/2102.01649",
    "authors": [
      "Jinjiang Guo",
      "Jie Li",
      "Dawei Leng",
      "Lurong Pan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2102.06249",
    "title": "A Survey on Ransomware: Evolution, Taxonomy, and Defense Solutions",
    "abstract": " Comments: Accepted to ACM Computing Surveys ",
    "url": "https://arxiv.org/abs/2102.06249",
    "authors": [
      "Harun Oz",
      "Ahmet Aris",
      "Albert Levi",
      "A. Selcuk Uluagac"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2102.12238",
    "title": "Inductive Bias of Multi-Channel Linear Convolutional Networks with  Bounded Weight Norm",
    "abstract": " Comments: Updated version with revised and expanded content ",
    "url": "https://arxiv.org/abs/2102.12238",
    "authors": [
      "Meena Jagadeesan",
      "Ilya Razenshteyn",
      "Suriya Gunasekar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2102.12592",
    "title": "Documentation Matters: Human-Centered AI System to Assist Data Science  Code Documentation in Computational Notebooks",
    "abstract": " Title: Documentation Matters: Human-Centered AI System to Assist Data Science  Code Documentation in Computational Notebooks ",
    "url": "https://arxiv.org/abs/2102.12592",
    "authors": [
      "April Yi Wang",
      "Dakuo Wang",
      "Jaimie Drozdal",
      "Michael Muller",
      "Soya Park",
      "Justin D. Weisz",
      "Xuye Liu",
      "Lingfei Wu",
      "Casey Dugan"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2105.13343",
    "title": "Drawing Multiple Augmentation Samples Per Image During Training  Efficiently Decreases Test Error",
    "abstract": " Title: Drawing Multiple Augmentation Samples Per Image During Training  Efficiently Decreases Test Error ",
    "url": "https://arxiv.org/abs/2105.13343",
    "authors": [
      "Stanislav Fort",
      "Andrew Brock",
      "Razvan Pascanu",
      "Soham De",
      "Samuel L. Smith"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.14428",
    "title": "DAGNN: Demand-aware Graph Neural Networks for Session-based  Recommendation",
    "abstract": " Comments: There were errors in the experimental analysis ",
    "url": "https://arxiv.org/abs/2105.14428",
    "authors": [
      "Liqi Yang",
      "Linhan Luo",
      "Lifeng Xin",
      "Xiaofeng Zhang",
      "Xinni Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2106.09659",
    "title": "Robustness and Consistency in Linear Quadratic Control with Untrusted  Predictions",
    "abstract": " Comments: 34 pages, 8 figures, ACM SIGMETRICS 2022 ",
    "url": "https://arxiv.org/abs/2106.09659",
    "authors": [
      "Tongxin Li",
      "Ruixiao Yang",
      "Guannan Qu",
      "Guanya Shi",
      "Chenkai Yu",
      "Adam Wierman",
      "Steven H. Low"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2106.11424",
    "title": "HODA: Hardness-Oriented Detection of Model Extraction Attacks",
    "abstract": " Comments: 15 pages, 12 figures, 7 tables, 2 Alg ",
    "url": "https://arxiv.org/abs/2106.11424",
    "authors": [
      "Amir Mahdi Sadeghzadeh",
      "Amir Mohammad Sobhanian",
      "Faezeh Dehghan",
      "Rasool Jalili"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2107.14185",
    "title": "Feature Importance-aware Transferable Adversarial Attacks",
    "abstract": " Comments: Accepted to ICCV 2021 ",
    "url": "https://arxiv.org/abs/2107.14185",
    "authors": [
      "Zhibo Wang",
      "Hengchang Guo",
      "Zhifei Zhang",
      "Wenxin Liu",
      "Zhan Qin",
      "Kui Ren"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.05539",
    "title": "BioLCNet: Reward-modulated Locally Connected Spiking Neural Networks",
    "abstract": " Comments: 9 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2109.05539",
    "authors": [
      "Hafez Ghaemi",
      "Erfan Mirzaei",
      "Mahbod Nouri",
      "Saeed Reza Kheradpisheh"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2109.05664",
    "title": "Unsupervised domain adaptation for cross-modality liver segmentation via  joint adversarial learning and self-learning",
    "abstract": " Title: Unsupervised domain adaptation for cross-modality liver segmentation via  joint adversarial learning and self-learning ",
    "url": "https://arxiv.org/abs/2109.05664",
    "authors": [
      "Jin Hong",
      "Simon Chun-Ho Yu",
      "Weitian Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2110.05023",
    "title": "Online Graph Learning in Dynamic Environments",
    "abstract": " Title: Online Graph Learning in Dynamic Environments ",
    "url": "https://arxiv.org/abs/2110.05023",
    "authors": [
      "Xiang Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2110.05809",
    "title": "Couple Learning for semi-supervised sound event detection",
    "abstract": " Comments: Interspeech 2022 ",
    "url": "https://arxiv.org/abs/2110.05809",
    "authors": [
      "Rui Tao",
      "Long Yan",
      "Kazushige Ouchi",
      "Xiangdong Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2110.08813",
    "title": "VISinger: Variational Inference with Adversarial Learning for End-to-End  Singing Voice Synthesis",
    "abstract": " Comments: 5 pages, ICASSP 2022 ",
    "url": "https://arxiv.org/abs/2110.08813",
    "authors": [
      "Yongmao Zhang",
      "Jian Cong",
      "Heyang Xue",
      "Lei Xie",
      "Pengcheng Zhu",
      "Mengxiao Bi"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2111.00734",
    "title": "Robust Deep Learning from Crowds with Belief Propagation",
    "abstract": " Title: Robust Deep Learning from Crowds with Belief Propagation ",
    "url": "https://arxiv.org/abs/2111.00734",
    "authors": [
      "Hoyoung Kim",
      "Seunghyuk Cho",
      "Dongwoo Kim",
      "Jungseul Ok"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2111.01225",
    "title": "Identifying causal relations in tweets using deep learning: Use case on  diabetes-related tweets from 2017-2021",
    "abstract": " Comments: 6 Figures, 4 Tables ",
    "url": "https://arxiv.org/abs/2111.01225",
    "authors": [
      "Adrian Ahne",
      "Vivek Khetan",
      "Xavier Tannier",
      "Md Imbessat Hassan Rizvi",
      "Thomas Czernichow",
      "Francisco Orchard",
      "Charline Bour",
      "Andrew Fano",
      "Guy Fagherazzi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.01892",
    "title": "Equivariant Deep Dynamical Model for Motion Prediction",
    "abstract": " Title: Equivariant Deep Dynamical Model for Motion Prediction ",
    "url": "https://arxiv.org/abs/2111.01892",
    "authors": [
      "Bahar Azari",
      "Deniz Erdoğmuş"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.02887",
    "title": "Self-Supervised Radio-Visual Representation Learning for 6G Sensing",
    "abstract": " Comments: To appear in IEEE ICC '22 ",
    "url": "https://arxiv.org/abs/2111.02887",
    "authors": [
      "Mohammed Alloulah",
      "Akash Deep Singh",
      "Maximilian Arnold"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.09005",
    "title": "A Neural Solver for Variational Problems on CAD Geometries with  Application to Electric Machine Simulation",
    "abstract": " Comments: 27 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2111.09005",
    "authors": [
      "Moritz von Tresckow",
      "Stefan Kurz",
      "Herbert De Gersem",
      "Dimitrios Loukrezis"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2111.10574",
    "title": "Switching Independent Vector Analysis and Its Extension to Blind and  Spatially Guided Convolutional Beamforming Algorithms",
    "abstract": " Comments: Submitted to IEEE/ACM Trans. Audio, Speech, and Language Processing on 27 July 2021, accepted on 22 Feb. 2022 ",
    "url": "https://arxiv.org/abs/2111.10574",
    "authors": [
      "Tomohiro Nakatani",
      "Rintaro Ikeshita",
      "Keisuke Kinoshita",
      "Hiroshi Sawada",
      "Naoyuki Kamo",
      "Shoko Araki"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2111.11305",
    "title": "Universal Efficient Variable-rate Neural Image Compression",
    "abstract": " Comments: 5 pages, 5 figures; Accepted by ICASSP 2022 ",
    "url": "https://arxiv.org/abs/2111.11305",
    "authors": [
      "Shanzhi Yin",
      "Chao Li",
      "Youneng Bao",
      "Yongsheng Liang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.01521",
    "title": "Object-aware Monocular Depth Prediction with Instance Convolutions",
    "abstract": " Title: Object-aware Monocular Depth Prediction with Instance Convolutions ",
    "url": "https://arxiv.org/abs/2112.01521",
    "authors": [
      "Enis Simsar",
      "Evin Pınar Örnek",
      "Fabian Manhardt",
      "Helisa Dhamo",
      "Nassir Navab",
      "Federico Tombari"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.01914",
    "title": "SGM3D: Stereo Guided Monocular 3D Object Detection",
    "abstract": " Comments: 8 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2112.01914",
    "authors": [
      "Zheyuan Zhou",
      "Liang Du",
      "Xiaoqing Ye",
      "Zhikang Zou",
      "Xiao Tan",
      "Li Zhang",
      "Xiangyang Xue",
      "Jianfeng Feng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.06064",
    "title": "Neighborhood Region Smoothing Regularization for Finding Flat Minima In  Deep Neural Networks",
    "abstract": " Title: Neighborhood Region Smoothing Regularization for Finding Flat Minima In  Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2201.06064",
    "authors": [
      "Yang Zhao",
      "Hao Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2201.07798",
    "title": "Cognitive Explainers of Graph Neural Networks Based on Medical Concepts",
    "abstract": " Comments: 9 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2201.07798",
    "authors": [
      "Yingni Wang",
      "Huabin Zhang",
      "Lichong Dong",
      "Xiaobo Zhou",
      "Kehong Yuan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.08894",
    "title": "Reinforcement Learning for Personalized Drug Discovery and Design for  Complex Diseases: A Systems Pharmacology Perspective",
    "abstract": " Comments: 26 pages, 3 figure ",
    "url": "https://arxiv.org/abs/2201.08894",
    "authors": [
      "Ryan K. Tan",
      "Yang Liu",
      "Lei Xie"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.00232",
    "title": "ISNet: Costless and Implicit Image Segmentation for Deep Classifiers,  with Application in COVID-19 Detection",
    "abstract": " Comments: Text revised ",
    "url": "https://arxiv.org/abs/2202.00232",
    "authors": [
      "Pedro R.A.S. Bassi",
      "Andrea Cavalli"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04595",
    "title": "Exploring Structural Sparsity in Neural Image Compression",
    "abstract": " Comments: 5 pages, 5 figures, submitted to ICIP 2022 ",
    "url": "https://arxiv.org/abs/2202.04595",
    "authors": [
      "Shanzhi Yin",
      "Chao Li",
      "Wen Tan",
      "Youneng Bao",
      "Yongsheng Liang",
      "Wei Liu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04744",
    "title": "Robust Bayesian Inference for Simulator-based Models via the MMD  Posterior Bootstrap",
    "abstract": " Comments: Accepted for publication (with an oral presentation) at AISTATS 2022. A preliminary version of this paper was accepted in the NeurIPS 2021 workshop \"Your Model is Wrong: Robustness and misspecification in probabilistic modeling\". v2: added some references ",
    "url": "https://arxiv.org/abs/2202.04744",
    "authors": [
      "Charita Dellaporta",
      "Jeremias Knoblauch",
      "Theodoros Damoulas",
      "François-Xavier Briol"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2202.04828",
    "title": "Learning Latent Causal Dynamics",
    "abstract": " Title: Learning Latent Causal Dynamics ",
    "url": "https://arxiv.org/abs/2202.04828",
    "authors": [
      "Weiran Yao",
      "Guangyi Chen",
      "Kun Zhang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.05139",
    "title": "Game of Privacy: Towards Better Federated Platform Collaboration under  Privacy Restriction",
    "abstract": " Comments: Submitted to KDD 2022 ",
    "url": "https://arxiv.org/abs/2202.05139",
    "authors": [
      "Chuhan Wu",
      "Fangzhao Wu",
      "Tao Qi",
      "Yanlin Wang",
      "Yuqing Yang",
      "Yongfeng Huang",
      "Xing Xie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.05338",
    "title": "Accountability in an Algorithmic Society: Relationality, Responsibility,  and Robustness in Machine Learning",
    "abstract": " Comments: Preprint ",
    "url": "https://arxiv.org/abs/2202.05338",
    "authors": [
      "A. Feder Cooper",
      "Benjamin Laufer",
      "Emanuel Moss",
      "Helen Nissenbaum"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.07646",
    "title": "Quantifying Memorization Across Neural Language Models",
    "abstract": " Title: Quantifying Memorization Across Neural Language Models ",
    "url": "https://arxiv.org/abs/2202.07646",
    "authors": [
      "Nicholas Carlini",
      "Daphne Ippolito",
      "Matthew Jagielski",
      "Katherine Lee",
      "Florian Tramer",
      "Chiyuan Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2202.08548",
    "title": "The Political Economy of Privacy Enhancing Technologies",
    "abstract": " Comments: 16 Pages, 1 Figure ",
    "url": "https://arxiv.org/abs/2202.08548",
    "authors": [
      "Partha Das Chowdhury",
      "Andres Dominguez",
      "Kopo M. Ramkapane",
      "Awais Rashid"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2202.09400",
    "title": "Equivariant Transporter Network",
    "abstract": " Title: Equivariant Transporter Network ",
    "url": "https://arxiv.org/abs/2202.09400",
    "authors": [
      "Haojie Huang",
      "Dian Wang",
      "Robin Walter",
      "Robert Platt"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2202.09464",
    "title": "Geometric Algebra based Embeddings for Static and Temporal Knowledge  Graph Completion",
    "abstract": " Comments: Accepted by IEEE Transactions on Knowledge and Data Engineering ",
    "url": "https://arxiv.org/abs/2202.09464",
    "authors": [
      "Chengjin Xu",
      "Mojtaba Nayyeri",
      "Yung-Yu Chen",
      "Jens Lehmann"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.10517",
    "title": "Personalized PATE: Differential Privacy for Machine Learning with  Individual Privacy Guarantees",
    "abstract": " Title: Personalized PATE: Differential Privacy for Machine Learning with  Individual Privacy Guarantees ",
    "url": "https://arxiv.org/abs/2202.10517",
    "authors": [
      "Christopher Mühl",
      "Franziska Boenisch"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2202.10873",
    "title": "Ligandformer: A Graph Neural Network for Predicting Compound Property  with Robust Interpretation",
    "abstract": " Comments: 7 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2202.10873",
    "authors": [
      "Jinjiang Guo",
      "Qi Liu",
      "Han Guo",
      "Xi Lu"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.11483",
    "title": "High-precision Hardware Oscillators Ensemble for GNSS Attack Detection",
    "abstract": " Title: High-precision Hardware Oscillators Ensemble for GNSS Attack Detection ",
    "url": "https://arxiv.org/abs/2202.11483",
    "authors": [
      "M. Spanghero",
      "P. Papadimitratos"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2202.11604",
    "title": "The Segment Number: Algorithms and Universal Lower Bounds for Some  Classes of Planar Graphs",
    "abstract": " Title: The Segment Number: Algorithms and Universal Lower Bounds for Some  Classes of Planar Graphs ",
    "url": "https://arxiv.org/abs/2202.11604",
    "authors": [
      "Ina Goeßmann",
      "Jonathan Klawitter",
      "Boris Klemz",
      "Felix Klesen",
      "Stephen Kobourov",
      "Myroslav Kryven",
      "Alexander Wolff",
      "Johannes Zink"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  }
]